[
    {
        "author": "hdigga",
        "created_utc": 1590591173,
        "id": "grl5cy",
        "num_comments": 196,
        "num_crossposts": 0,
        "selftext": "**TL;DR**: Secureworks, $SCWX, a managed cloud and software cybersecurity provider is set to pop hard.\n\n&amp;#x200B;\n\n1. **COVID has been hugely bullish for cybersecurity** with growth and earnings beats across the industry. But SCWX is lagging behind other cybersec firms in recovery--**down 20% pre-Rona where similar cybersec firms are up 20-50%.**\n2. **Announced a partnership program** last week to license their software to other companies to provide managed security. Tells me **a)** they’re so **damn busy with new customers** transitioning to WFH networks they need to outsource the work, **b)** SCWX **should be priced for growth** whereas they were previously the “value” play within cybersecurity.\n3. Insiders insanely bullish in April. **CEO nearly doubled his shares**\n4. High short interest and low float will make them run hard once they start moving up. **Short squeeze likely.**\n\n**SCWX 17.50c 7/17**, then sell just before or after June 4th earnings report. Other plays in write up. Start off with a limit order at 20 cents and raise from there if no fill.\n\n&amp;#x200B;\n\n*I originally posted about SCWX a week ago and they've popped up \\~15% since then*. I’m feeling even more bullish on them now after they announced their partnership news. I deleted the [previous post](https://www.reddit.com/r/wallstreetbets/comments/gkd9ax/missed_net_and_okta_heres_an_easy_2_to_10_bagger/fqqfimg/) after some big retards must have thrown a market order at these options and more than doubled the price in 15 minutes. Please use limit orders to buy in cheaply.\n\n&amp;#x200B;\n\n# Company basics\n\n&amp;#x200B;\n\n|Market cap|$1.06 billion|\n|:-|:-|\n|Price at close yesterday [(Marketwatch)](https://www.marketwatch.com/investing/stock/scwx)|$13.28|\n|ATH|$23.11, Jan 2019|\n|Core product|Managed cloud network security|\n|Customers|Include 23% of Fortune 500, 25% of total customers are international|\n\n&amp;#x200B;\n\nhttps://preview.redd.it/t3631diai9151.png?width=3128&amp;format=png&amp;auto=webp&amp;s=cab3357ac96e38a5fbf5890787250e8c63e0e1ad\n\nLet's hear what they do straight from their [**latest 10-K filing**](https://www.sec.gov/ix?doc=/Archives/edgar/data/1468666/000146866620000019/scwx10-kfy2020x01312020.htm):\n\n&amp;#x200B;\n\n&gt;We are a leading global provider of technology-driven information security solutions singularly focused on protecting our customers from cyber attacks. We combine deep experience from service to thousands of customers, machine learning and automation from our proprietary technology, and actionable insights from our team of elite researchers, analysts, and consultants to create a powerful network effect that provides increasingly strong protection for our customers. By aggregating and analyzing data from various sources around the world, we prevent security breaches, detect malicious activity in real time, respond rapidly and predict emerging threats.  \n&gt;  \n&gt;Our vision is to be the essential cybersecurity company for a digitally connected world. Through our vendor-neutral approach, **we create integrated and comprehensive solutions by proactively managing the collection of “point” products deployed by our customers to address specific security issues and provide supplemental solutions where gaps exist in our customers’ defenses**. We seek to provide the right level of security for each customer's unique situation, which evolves as the customer's organization grows and changes.  \n&gt;  \n&gt;We have pioneered an integrated approach that delivers a broad portfolio of information security solutions to organizations of varying size and complexity. Our flexible and scalable solutions support the evolving needs of the largest, most sophisticated enterprises staffed with in-house security experts, as well as small and medium-sized businesses and government agencies with limited in-house capabilities and resources.\n\nThe two keys here are **managed** and **portfolio**.\n\nUnlike most of their competition, **SCWX manages the security software they sell**. As part of the subscription price of the software, you pay for a SCWX security professional to monitor your suspicious logs in real time and investigate/communicate when they see a pattern consistent with an attack. Customers can also pay retainers for responses to potential breaches, so that when an attack is detected a team of SCWX professionals on standby will try to quickly shut the attack down and determine the extent of the damage. Along with managed security, they sell training, consultation, and testing for a company's security network. Additionally, SCWX has recently launched a SaaS platform that allows customers to use their software without purchasing management solutions which will help them grow even more among more price-sensitive and tech-savvy segments.\n\n**Managed security should be even more bullish than unmanaged security during this pandemic**. Companies that could manage their own security (i.e. tech and very large) already do and only needed to secure more devices. Whereas companies/government agencies/educational institutions that aren't capable of fielding a team of cybersecurity experts have suddenly found themselves in need of network security for their work from home (WFH) staff and the websites that drive 100% of their present income. These groups now suddenly need to pay someone to set up and manage cybersecurity that they were unprepared to manage themselves. In the past few years analysts have been less bullish on managed security companies for two reasons: higher costs (i.e. staff) and less growth potential (can't just add more servers and run the same code base). I think the pandemic changes some of that however, because SCWX has the badly needed security professionals which are in short supply.\n\nSecurity should never be thought of as a collection of individual tasks/actions, but as a **system**, because any one vulnerability can fuck up everything. Unlike competitors that focus on apps for solving particular problems, SCWX offers a comprehensive security solution. They offer suspicious activity detection and response, network security, endpoint security, malware/spyware detection and response, log management, firewall management, and other security features. Having an ecosystem of products helps them to tailor solutions to protect their clients from any of the variety of threats that they may face. If you've read Black Swan/Antifragile, then you know that antifragility comes from systems thinking and managing your environment holistically.\n\n[SCWX provides holistic cybersecurity](https://preview.redd.it/v480m6fgh9151.png?width=3132&amp;format=png&amp;auto=webp&amp;s=53e29093850fbecb4926db1dd5f3b42696a7ccc4)\n\n&amp;#x200B;\n\n# Peers: software and cloud cybersecurity firms are hitting new all time highs\n\nhttps://preview.redd.it/lqvhjizuh9151.png?width=1414&amp;format=png&amp;auto=webp&amp;s=a200cb667129443736ddf37bb1af97edfd1886ff\n\n**SCWX should be trading at February prices at a minimum. Cybersecurity is hot right now**. Amid the international distrust of pandemic, there have been many hacking attempts targeting new work-from-home networks, hospitals, biotechs, educational institutions, and government systems.\n\n[At least 28 US hospitals have been hacked this year.](https://www.beckershospitalreview.com/cybersecurity/28-health-system-cyberattacks-data-breaches-so-far-in-2020.html)\n\n[Foreign nations have been attacking government and healthcare infrastructure.](https://www.cityam.com/rival-states-launch-cyber-attacks-on-uk-and-us-coronavirus-labs/)\n\n[Foreign countries have been trying to steal data from companies working on cures.](https://www.newsweek.com/report-accuses-iran-attack-drug-company-coronavirus-1502838)\n\nAdditionally, SCWX has partnerships with CRWD and QLYS for endpoint security and vulnerability management respectively and it should be participating more heavily in their upside.\n\nNET, AKAM, and QLYS have all reported earnings in the last month. Their share prices spiked 10% in the week before their respective reports. They beat earnings slightly and then dumped off most of the gains to recover them a week or two later. Given both the trend of cybersecurity earnings beats and SCWX's own steady growth, **I think a massive earnings beat is likely compared to the analysts' low expectations.**\n\nhttps://preview.redd.it/qnjjgdxfk9151.png?width=658&amp;format=png&amp;auto=webp&amp;s=09c1f4917d6a647c37ca4e1c99c8507cbece6648\n\nUnlike it's competitors, **SCWX is priced cheaply** compared to their assets, at 7.5x cheaper than the median of the sample below. Even if you only want to buy shares, SCWX is a fantastic deal for picking up cloud cybersecurity assets compared to it's peer group.\n\n&amp;#x200B;\n\n|Ticker|Price to book value|\n|:-|:-|\n|**SCWX**|**1.63**|\n|NET|12.04|\n|OKTA|55.07|\n|CRWD|21.96|\n|QLYS|11.86|\n|AKAM|4.41|\n\n&amp;#x200B;\n\n# Partnership program announcement\n\n[Article.](https://www.marketwatch.com/press-release/secureworks-launches-new-global-partner-program-to-address-growing-demand-for-cybersecurity-solutions-2020-05-21?mod=mw_quote_news) Last week, SCWX announced a program so that other companies can license their software to build and sell managed security solutions. While their price jumped nearly 10% after the announcement, I don't think the implications have been fully realized.\n\n1. Against the common criticism of managed security as low growth, **SCWX is now poised for massive expansion**. Now other companies can target niche markets (region, sector, pricing, government, etc), while SCWX can focus on their core competencies. Letting specialized security companies handle clients with particular needs will cut some of their work bloat and stay efficient as a company. SCWX should start to approach the valuations of the cloud and SaaS security companies now that they can act like a managed security company without doing the managing.\n2. **THEY'RE GODDAMNED BUSY RIGHT NOW**. If their own security professionals were only half-busy right now, they wouldn't make this sort of announcement because it would undercut their own productivity/profitability. But if SCWX is swamped with new clients and with old clients who need more work done, then they would need to find ways to unload their work profitably. Partnership allows them to quickly add clients to their roster by pairing them with vetted security firms that don't have the same software base as SCWX.\n\n# Massive amounts of insider buying\n\nIn the last month, insiders, mainly the CEO, bought more stock than they did in the rest of last year.  I'm betting that they're doing brisk business and they think the stock is undervalued at current prices.\n\n[Source: NASDAQ](https://preview.redd.it/soizm2dzh9151.png?width=1210&amp;format=png&amp;auto=webp&amp;s=e73a75d162b9bfdee12067f60b63b147ce5924df)\n\n# Potential short squeeze\n\nNominally, the class A stock has a float (shares available to public, i.e. not insiders or index funds) of 63% and **15% short interest**. That level of short interest is on the low end of the right range where short squeezes are common.\n\nMost of the company's value, however, is locked up in class B stock held exclusively by Dell (12.12MM class A shares, 70MM class B shares). **The real float of the company is closer to 11.7%**. Low float is generally indicative of an extremely volatile share price. If SCWX picks up momentum, it will move up quickly as the short holders get squeezed and few market participants are able to sell.\n\nAdditionally, 25% of all class A shares are held by insiders and 62% are held by institutional investors; which is a bullish breakdown that implies knowledgeable folks are holding.\n\n&amp;#x200B;\n\n# Technicals\n\nI don't believe in magic crayon bollocks, but I want to draw attention to yesterday's trading which was the fairly wild for SCWX. Below we see a gap up, followed by a momentum algo pile-on or short squeeze to a two month high, a retest of last week's close, and then consolidation at +5%. Due to the volatility of SCWX on up days like yesterday, this trade will be most rewarding to traders who either actively check the charts or set profit-taking limit sells (like I do).\n\nhttps://preview.redd.it/vm7fvqn1i9151.png?width=858&amp;format=png&amp;auto=webp&amp;s=898d4a72bdd1e5c04842df343b7ed2f8b4cc0c07\n\nI think there's a legit possibility that this trade could be a ten-bagger, but I have set half my contracts to sell with a stop-limit order when they are up 100% so that I can take make my remaining contracts \"free\" without having to follow the chart all day. If that order executes, I'll probably set my next stop-limit order for a more outrageous amount like +300-500%, or I will follow the timeline below.\n\n# Strategy\n\nQ1 **earnings for SCWX are going to be reported pre-market on June 4th**. I expect a big run-up before then as other cybersecurity firms report high earnings and continue to be bid up. I hope the stock is up high enough that I can **sell June 3rd at a big profit**. If the stock moves up, but dip right before earnings, then I'll hold through earnings and sell just after at either a profit or a loss. I have TP hands (it happens when you watch 4/17 SPY puts go from +300% to -90%) and will take some profit/cut some losses early depending on how the trade goes.\n\nI recommend the **7/17 17.50 call** option for a couple of reasons:\n\n1. **Most liquid** call option in the entire chain with OI &gt; 300. The **bid-ask is still as wide as your wife's pussy, so be careful** with your orders. You can also do the 15c and 20c contracts for more/less risk, but there is less OI. The June contracts are more \"on thesis,\" but OI is less than 30 and I never buy contracts with that low of volume.\n2. I want a lot of **gamma** because I think the share price is going to make big swings in the next few days. The 17.50c offers the right amount of leverage for my taste.\n3. I think there is a solid chance (\\~30%) they will become ATM or higher by earnings.\n4. **Protection from theta gang**. There will still be over a month of time value on these bad boys after earnings, while we're only holding for a week.\n\nAgain, there's some other interesting options in the chain, you can also do spreads to lower cost basis, or you can sell covered calls to profit off the same move and make money off autists YOLOing into these contracts.\n\nBelow is the payout table I calculated for the 17.50c option. *Note that 50 cents might not be the best available price*, if you pay too much you'll take an immediate loss. And if you get in cheaper, growth potential is even higher. I did not take into account the pre-earnings IV pump which should act in your favor.\n\n[Options payout table](https://preview.redd.it/9dkbnog4i9151.png?width=691&amp;format=png&amp;auto=webp&amp;s=98a65739dee8b4c59dc7c7a57d1dafd597b78ba1)\n\n**Risks for this play:**\n\n1. The market is efficient and SCWX is correctly priced.\n2. Managed security does not attract more customers due to expense or inability to support additional customers.\n3. Existing customers too cash-strapped to buy more security infrastructure.\n4. During last earnings call, March 27th, SCWX gave guidance for lower earnings next quarter due to pandemic. (But that was when everyone was still freaking the fuck out and reported earnings were only to end of February.)\n5. Rug pull on entire market.\n6. Burned on bid-ask spread.\n7. CRWD and OKTA miss earnings (later this week).\n8. Fuckery by Dell related to the class B shares.\n9. Pretty much any risk listed in the SCWX 10-K.\n\n**Disclaimer:** I am not your financial advisor. Take anything you read on this retard sub with a grain of salt. The information here is reliable to my knowledge, but I cannot guarantee its accuracy. *Do your own DD.*",
        "subreddit": "wallstreetbets",
        "title": "Next cloud and cybersecurity ticker to make a huge move up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/grl5cy/next_cloud_and_cybersecurity_ticker_to_make_a/",
        "created": 1590619973.0
    },
    {
        "author": "candocanggu",
        "created_utc": 1589306541,
        "id": "gigkxx",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "So, if you’ve been following recent events, you might have observed a shift in global opinion towards a more anti-China stance. In other words, nations like Japan, America, and India are growing more distrustful of China’s economic expansionist policies, and trying to nurture local manufacturing, ultimately reducing their nation’s reliance on Chinese goods. Here we’ll observe how this could benefit other countries, particularly India, who’s PM just addressed their nation and announced a stimulus package. Yes, you degenerates, you can place bets on which country is most likely to benefit from China’s loss in tendies. This can be utilized as a long term and short-term play. \n\nTo begin with, China’s public image is at an all time low, with President Tendies himself accusing them of developing the virus in a lab in Wuhan. Moreover, this sentiment is spilling over globally. Other nations are realizing their dependence on China may leave them vulnerable to economic exploitation at their hands, and deprived of certain goods during testing times, such as a war or pandemic. To counter this, nations are going to great lengths and incentivizing local manufacturing. For example, Japan just allocated 243.5bn Yen to shift production back to Japan. This bill also includes billions to shift production to other countries. Translation: anywhere but China. \n\n[Trump’s Wuhan lab leak theory ](https://www.google.com/amp/s/amp.smh.com.au/national/it-would-be-unwise-to-dismiss-donald-trump-s-wuhan-lab-leak-theory-20200507-p54qyg.html)\n\n[Japan Production Shift ](https://www.japantimes.co.jp/news/2020/04/09/business/japan-sets-aside-¥243-5-billion-help-firms-shift-production-china/#.XrrKriXhXDs)\n\n\nThis raises a very interesting question: who will fill China’s void; which East Asian pie hole will the western powers now use to satisfy their glutinous consumer-crazed urges? I’m betting India’s looking really cute atm in that short dress and unlimited labor, many of whom speak (some, or something similar to) English. I’m betting this because most of the FAGMAN companies already have a strong presence there and have committed to increasing their presence there in the long term. For example, apple are planning on shifting most of their iPhone production from China to India. And big daddy Bezos just announced he’ll enslave, sorry, I mean employ 1 million more Indians by 2025. Moreover, Facebook just invested and bought 9.99% of Jio, a part of Reliance Industries for 5.7bn to increase its presence in India as well. This resulted in an increase in stock price for both companies. Now, you smart guys with calls already know the power of the FAGMAN and I’m pretty sure all these companies individually are all worth more than the GPD of Madagascar. This sets India up for a huge slam dunk in terms of their global presence and GDP, and companies like Reliance benefitting from foreign investment. \n\n[Apple production shift from China to India ](https://www.google.com/amp/s/9to5mac.com/2020/05/11/iphone-production/amp/)\n\n[Bezos pledges to create 1 million jobs in India ](https://www.google.com/amp/s/www.financialexpress.com/industry/jeff-bezos-says-amazon-to-create-1-million-jobs-in-india-by-2025/1827095/lite/)\n\n[Facebook investment in Jio ](https://www.google.com/amp/s/techcrunch.com/2020/04/21/facebook-reliance-jio/amp/)\n\n\nNow moving on to the PM Narendra “56 inch chest” Modi’s speech, the catalyst that could cause an immediate spike in INDA. ThePM made the speech announcing 2 main things. 1. Free naan for everyone to the tune of $60bn (nearly 10% of their GDP) 2. “A self-reliant India”. Translation: FU China, we’re coming for your tendies. No wonder their troops are fist fighting at their border (link included). Keep in mind Modi made this speech after markets closed in India, and Indian markets haven’t opened for tomorrow yet. Time as of posting this is 10:45pm IST; two hours after speech. Now, any economist can tell you a stimulus package hits the markets like a bump of pure yayo to the dome. The question is, how long will this high remain in the Indian markets. Considering the level of corruption in India, a huge amount, even backdoor payments, could go directly into the coffers of their corporations, causing an immediate spike and rally in the Indian markets starting tomorrow. Stock brokers in India are rejoicing as we speak (linked).\n\n[India China troops fist fight ](https://www.google.com/amp/s/amp.theguardian.com/world/2020/may/11/indian-and-chinese-soldiers-injured-in-cross-border-fistfight-says-delhi)\n\n[Stimulus Package + “self reliant India”](https://www.google.com/amp/s/www.ndtv.com/india-news/prime-minister-narendra-modis-address-to-nation-on-coronavirus-covid-19-lockdown-top-quotes-2227682%3famp=1&amp;akamai-rum=off)\n\n[Indian stock brokers rejoice ](https://www.google.com/amp/s/m.economictimes.com/markets/stocks/news/market-to-rally-on-thursday-as-modi-offers-big-bonanza-stimulus-package/amp_articleshow/75700846.cms)\n\n\n“Alright, that’s great, but how can I make money on this retard?” Alright, I think there’s 2 ways to play this.\n\nShort term: anticipate an increase in Sensex and NIFTY starting tomorrow and play short term weekly calls. An increase could turn into a rally in the Indian markets, but it’s anyone’s guess how long it could last, 1 day? 1 week? 1 month? It’s anyone’s guess during corona times. \n\nLong term: play long term options into Jan 2021 and 2022, anticipating a rise in the balance sheets of Indian companies and their economy. Remember INDA tracks only top firms in the Indian securities market. \n\nTLDR: End of Asian fettish. New world domination plan: gas stations everywhere. PM Modi gives coke IV to the Indian economy. Long term and short term calls on INDA viable. \n\nP.s. for anyone who’s offended, I’m of Indian descent. Lighten up.",
        "subreddit": "wallstreetbets",
        "title": "Why India’s $60bn stimulus package could be the catalyst to skyrocket INDA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gigkxx/why_indias_60bn_stimulus_package_could_be_the/",
        "created": 1589335341.0
    },
    {
        "author": "TimeEaterLavos",
        "created_utc": 1590261678,
        "id": "gpauek",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Recently the US in its infinite wisdom has continued to add US software and tech agencies that support China to the blacklist. An article released by TOP10VPN (yea that’s a fucking reliable source) has made it clear of the tech firms that are blacklisted/soon to be \n\nhttps://www.google.com/amp/s/www.top10vpn.com/research/investigations/big-tech-supporting-blacklisted-surveillance-companies/%3famp=1\n\nIf you go and scroll through you’ll find a list of links to certain services, these send you directly to the companies websites (rather than outright name them they decide to just show you who they are) \n\nIn the CDN space, Cloudflare is listed, and in streaming Akamai is there (they list Akamai by name though) \n\nJust some DD for anyone in NET whose wondering if it takes a downturn this is possible why",
        "subreddit": "wallstreetbets",
        "title": "Possible downside for Cloudflare(NET)and Akamai(AKAM)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gpauek/possible_downside_for_cloudflarenetand_akamaiakam/",
        "created": 1590290478.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589357214,
        "id": "giuqdd",
        "num_comments": 389,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - May 13, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/giuqdd/rstocks_daily_discussion_wednesday_may_13_2020/",
        "created": 1589386014.0
    },
    {
        "author": "HyperInflation2020",
        "created_utc": 1589748775,
        "id": "gln51p",
        "num_comments": 342,
        "num_crossposts": 0,
        "selftext": "How many people really understand what they’re buying, especially when it comes to highly specialized hardware companies? Most NVidia investors seem to be relying on a vague idea of how the company should thrive “in the future”, as their GPUs are ostensibly used for Artificial Intelligence, Cloud, holograms, etc. Having been shocked by how this company is represented in the media, I decided to lay out how this business works, doing my part to fight for reality. With what’s been going on in markets, I don’t like my chances but here goes:\n\nLet’s start with…\n\n**How does NVDA make money?**\n\nNVDA is in the business of semiconductor design. As a simplified image in your head, you can imagine this as designing very detailed and elaborate posters. Their engineers create circuit patterns for printing onto semiconductor wafers. NVDA then pays a semiconductor foundry (the printer – generally TSMC) to create chips with those patterns on them. \n\nSimply put, NVDA’s profits represent the difference between the price at which they can sell those chips, less the cost of printing, and less the cost of paying their engineers to design them.\n\nNotably, after the foundry prints the chips, NVDA also has to pay (I say pay, but really it is more like “sell at a discount to”) their “add-in board” (AIB) partners to stick the chips onto printed circuit boards (what you might imagine as green things with a bunch of capacitors on them). That leads to the final form in which buyers experience the GPU.  \n\n**What is a GPU?**\n\nNVDA designs chips called GPUs (Graphical Processing Units). Initially, GPUs were used for the rapid processing and creation of images, but their use cases have expanded over time. You may be familiar with the CPU (Central Processing Unit). CPUs sit at the core of a computer system, doing most of the calculation, taking orders from the operating system (e.g. Windows, Linux), etc. AMD and Intel make CPUs. GPUs assist the CPU with certain tasks. You can think of the CPU as having a few giant very powerful engines. The GPU has a lot of small much less powerful engines. Sometimes you have to do a lot of really simple tasks that don’t require powerful engines to complete. Here, the act of engaging the powerful engines is a waste of time, as you end up spending most of your time revving them up and revving them down. In that scenario, it helps the CPU to hand that task over to the GPU in order to “accelerate” the completion of the task. The GPU only revs up a small engine for each task, and is able to rev up all the small engines simultaneously to knock out a large number of these simple tasks at the same time. Remember the GPU has lots of engines. The GPU also has an edge in interfacing a lot with memory but let’s not get too technical.\n\n**Who uses NVDA’s GPUs?**\n\nThere are two main broad end markets for NVDA’s GPUs – Gaming and Professional. Let’s dig into each one:  \n\n**The Gaming Market:**\n\nA Bit of Ancient History (**Skip if impatient**)\n\nGPUs were first heavily used for gaming in arcades. They then made their way to consoles, and finally PCs. NVDA started out in the PC phase of GPU gaming usage. They weren’t the first company in the space, but they made several good moves that ultimately led to a very strong market position. Firstly, they focused on selling into OEMs – guys like the equivalent of today’s DELL/HP/Lenovo – , which allowed a small company to get access to a big market without having to create a lot of relationships. Secondly, they focused on the design aspect of the GPU, and relied on their Asian supply chain to print the chip, to package the chip and to install in on a printed circuit board – the Asian supply chain ended up being the best in semis. But the insight that really let NVDA dominate was noticing that some GPU manufacturers were focusing on keeping hardware-accelerated Transform and Lighting as a Professional GPU feature. As a start-up, with no professional GPU business to disrupt, NVidia decided their best ticket into the big leagues was blowing up the market by including this professional grade feature into their gaming product. It worked – and this was a real masterstroke – the visual and performance improvements were extraordinary. 3DFX, the initial leader in PC gaming GPUs, was vanquished, and importantly it happened when funding markets shut down with the tech bubble bursting and after 3DFX made some large ill-advised acquisitions. Consequently 3DFX, went from hero to zero, and NVDA bought them for a pittance out of bankruptcy, acquiring the best IP portfolio in the industry.\n\n**Some more Modern History**\n\nThis is what NVDA’s pure gaming card revenue looks like over time – NVDA only really broke these out in 2005 (note by pure, this means ex-Tegra revenues):\n\n📷 https://hyperinflation2020.tumblr.com/private/618394577731223552/tumblr\\_Ikb8g9Cu9sxh2ERno \n\nSo what is the history here? Well, back in the late 90s when GPUs were first invented, they were **required** to play any 3D game. As discussed in the early history above, NVDA landed a hit product to start with early and got a strong burst of growth: revenues of 160M in 1998 went to 1900M in 2002. But then NVDA ran into strong competition from ATI (later purchased and currently owned by AMD). While NVDA’s sales struggled to stay flat from 2002 to 2004, ATI’s doubled from 1Bn to 2Bn. NVDA’s next major win came in 2006, with the 8000 series. ATI was late with a competing product, and NVDA’s sales skyrocketed – as can be seen in the graph above. With ATI being acquired by AMD they were unfocused for some time, and NVDA was able to keep their lead for an extended period. Sales slowed in 2008/2009 but that was due to the GFC – people don’t buy expensive GPU hardware in recessions. \n\nAnd then we got to 2010 and the tide changed. Growth in desktop PCs ended. Here is a chart from Statista:\n\n📷https://hyperinflation2020.tumblr.com/private/618394674172919808/tumblr\\_OgCnNwTyqhMhAE9r9 \n\nThis resulted in two negative secular trends for Nvidia. Firstly, with the decline in popularity of desktop PCs, growth in gaming GPUs faded as well (below is a chart from Jon Peddie). Note that NVDA sells discrete GPUs, aka DT (Desktop) Discrete. Integrated GPUs are mainly made by Intel (these sit on the motherboard or with the CPU).\n\n📷 https://hyperinflation2020.tumblr.com/private/618394688079200256/tumblr\\_rTtKwOlHPIVUj8e7h \n\nYou can see from the chart above that discrete desktop GPU sales are fading faster than integrated GPU sales. This is the other secular trend [\\[TM1\\]](https://www.reddit.com/r/stocks/submit#_msocom_1) hurting NVDA’s gaming business. Integrated GPUs are getting better and better, taking over a wider range of tasks that were previously the domain of the discrete GPU. Surprisingly, the most popular eSports game of recent times – Fortnite – only requires Intel HD 4000 graphics – an Integrated GPU from 2012!\n\nSo at this point you might go back to NVDA’s gaming sales, and ask the question: What happened in 2015? How is NVDA overcoming these secular trends?\n\nThe answer consists of a few parts.Firstly, AMD dropped the ball in 2015. As you can see in this chart, sourced from 3DCenter, AMD market share was halved in 2015, due to a particularly poor product line-up:\n\n📷 https://hyperinflation2020.tumblr.com/private/618394753459994624/tumblr\\_J7vRw9y0QxMlfm6Xd \n\nFollowing this, NVDA came out with Pascal in 2016 – a very powerful offering in the mid to high end part of the GPU market. At the same time, AMD was focusing on rebuilding and had no compelling mid or high end offerings. AMD mainly focused on maintaining scale in the very low end. Following that came 2017 and 2018: AMD’s offering was still very poor at the time, but cryptomining drove demand for GPUs to new levels, and AMD’s GPUs were more compelling from a price-performance standpoint for crypto mining initially, perversely leading to AMD gaining share. NVDA quickly remedied that by improving their drivers to better mine crypto, regaining their relative positioning, and profiting in a big way from the crypto boom. Supply that was calibrated to meet gaming demand collided with cryptomining demand and Average Selling Prices of GPUs shot through the roof. Cryptominers bought top of the line GPUs aggressively.  \n\nA good way to see changes in crypto demand for GPUs is the mining profitability of Ethereum:\n\n📷 https://hyperinflation2020.tumblr.com/private/618394769378443264/tumblr\\_cmBtR9gm8T2NI9jmQ \n\nThis leads us to where we are today. 2019 saw gaming revenues drop for NVDA. Where are they likely to head? \n\nThe secular trends of falling desktop sales along with falling discrete GPU sales have reasserted themselves[\\[TM2\\]](https://www.reddit.com/r/stocks/submit#_msocom_2) , as per the Jon Peddie research above. Cryptomining profitability has collapsed. \n\nAMD has come out with a new architecture, NAVI, and the 5700XT – the first Iteration, competes effectively with NVDA in the mid-high end space on a price/performance basis. This is the first real competition from AMD since 2014.\n\nNVDA can see all these trends, and they tried to respond. Firstly, with volumes clearly declining, and likely with a glut of second-hand GPUs that can make their way to gamers over time from the crypto space, NVDA decided to pursue a price over volume strategy. They released their most expensive set of GPUs by far in the latest Turing series. They added a new feature, Ray Tracing, by leveraging the Tensor Cores they had created for Professional uses, hoping to use that as justification for higher prices (more on this in the section on Professional GPUs). Unfortunately for NVDA, gamers have responded quite poorly to Ray Tracing – it caused performance issues, had poor support, poor adoption, and the visual improvements in most cases are not particularly noticeable or relevant. \n\nThe last recession led to gaming revenues falling 30%, despite NVDA being in a very strong position at the time vis-à-vis AMD – this time around their position is quickly slipping and it appears that the recession is going to be bigger. Additionally, the shift away from discrete GPUs in gaming continues.\n\nTo make matters worse for NVDA, AMD won the slots in both the New Xbox and the New PlayStation, coming out later this year. The performance of just the AMD GPU in those consoles looks to be competitive with NVidia products that currently retail for more than the entire console is likely to cost. Consider that usually you have to pair that NVidia GPU with a bunch of other expensive hardware. The pricing and margin impact of this console cycle on NVDA is likely to be very substantially negative. \n\nIt would be prudent to assume a greater than 30% fall in gaming revenues from the very elevated 2019 levels, with likely secular decline to follow.\n\n**The Professional Market:**\n\nA Bit of Ancient History (again, skip if impatient)\n\nAs it turns out, graphical accelerators were first used in the Professional market, long before they were employed for Gaming purposes. The big leader in the space was a company called Silicon Graphics, who sold workstations with custom silicon optimised for graphical processing. Their sales were only $25Mn in 1985, but by 1997 they were doing 3.6Bn in revenue – truly exponential growth. Unfortunately for them, from that point on, discrete GPUs took over, and their highly engineered, customised workstations looked exorbitantly expensive in comparison. Sales sank to 500mn by 2006 and, with no profits in sight, they ended up filing for bankruptcy in 2009. Competition is harsh in the semiconductor industry.\n\nInitially, the Professional market centred on visualisation and design, but it has changed over time. There were a lot of players and lot of nuance, but I am going to focus on more recent times, as they are more relevant to NVidia. \n\n**Some More Modern History**\n\nNVDA’s Professional business started after its gaming business, but we don’t have revenue disclosures that show exactly when it became relevant. This is what we do have – going back to 2005:\n\n📷 https://hyperinflation2020.tumblr.com/private/618394785029472256/tumblr\\_fEcYAzdstyh6tqIsI \n\nIn the beginning, Professional revenues were focused on the 3D visualisation end of the spectrum, with initial sales going into workstations that were edging out the customised builds made by Silicon Graphics. Fairly quickly, however, GPUs added more and more functionality and started to turn into general parallel data processors rather than being solely optimised towards graphical processing. \n\nAs this change took place, people in scientific computing noticed, and started using GPUs to accelerate scientific workloads that involve very parallel computation, such as matrix manipulation. This started at the workstation level, but by 2007 NVDA decided to make a new line-up of Tesla series cards specifically suited to scientific computing. The professional segment now have several points of focus:\n\n1. GPUs used in workstations for things such as CAD graphical processing (Quadro Line)\n\n2. GPUs used in workstations for computational workloads such as running engineering simulations (Quadro Line)\n\n3. GPUs used in workstations for machine learning applications (Quadro line.. but can use gaming cards as well for this)\n\n4. GPUs used by enterprise customers for high performance computing (such as modelling oil wells) (Tesla Line)\n\n5. GPUs used by enterprise customers for machine learning projects (Tesla Line)\n\n6. GPUs used by hyperscalers (mostly for machine learning projects) (Tesla Line)\n\nIn more recent times, given the expansion of the Tesla line, NVDA has broken up reporting into Professional Visualisation (Quadro Line) and Datacenter (Tesla Line). Here are the revenue splits since that reporting started:\n\n📷 https://hyperinflation2020.tumblr.com/private/618394798232158208/tumblr\\_3AdufrCWUFwLgyQw2 \n\n📷 https://hyperinflation2020.tumblr.com/private/618394810632601600/tumblr\\_2jmajktuc0T78Juw7 \n\nIt is worth stopping here and thinking about the huge increase in sales delivered by the Tesla line. The reason for this huge boom is the sudden increase in interest in numerical techniques for machine learning. Let’s go on a brief detour here to understand what machine learning is, because a lot of people want to hype it but not many want to tell you what it actually is. I have the misfortune of being very familiar with the industry, which prevented me from buying into the hype. Oops – sometimes it really sucks being educated.\n\n**What is Machine Learning?**\n\nAt a very high level, machine learning is all about trying to get some sort of insight out of data. Most of the core techniques used in machine learning were developed a long time ago, in the 1950s and 1960s. The most common machine learning technique, which most people have heard of and may be vaguely familiar with, is called regression analysis. Regression analysis involves fitting a line through a bunch of datapoints. The most common type of regression analysis is called “Ordinary Least Squares” OLS regression, and that type of regression has a “closed form” solution, which means that there is a very simple calculation you can do to fit an OLS regression line to data.\n\nAs it happens, fitting a line through points is not only easy to do, it also tends to be the main machine learning technique that people want to use, because it is very intuitive. You can make good sense of what the data is telling you and can understand the machine learning model you are using. Obviously, regression analysis doesn’t require a GPU!\n\nHowever, there is another consideration in machine learning: if you want to use a regression model, you still need a human to select the data that you want to fit the line through. Also, sometimes the relationship doesn’t look like a line, but rather it might look like a curve. In this case, you need a human to “transform” the data before you fit a line through it in order to make the relationship linear.\n\nSo people had another idea here: what if instead of getting a person to select the right data to analyse, and the right model to apply, you could just get a computer to do that? Of course the problem with that is that computers are really stupid. They have no preconceived notion of what data to use or what relationship would make sense, so what they do is TRY EVERYTHING! And everything involves trying a hell of a lot of stuff. And trying a hell of a lot of stuff, most of which is useless garbage, involves a huge amount of computation. People tried this for a while through to the 1980s, decided it was useless, and dropped it… until recently. \n\nWhat changed? Well we have more data now, and we have a lot more computing power, so we figured lets have another go at it. As it happens, the premier technique for trying a hell of a lot of stuff (99.999% of which is garbage you throw away) is called “Deep Learning”. Deep learning is SUPER computationally intensive, and that computation happens to involve a lot of matrix multiplication. And guess what just happens to have been doing a lot of matrix multiplication? GPUs!\n\nHere is a chart that, for obvious reasons, lines up extremely well with the boom in Tesla GPU sales:\n\n📷 https://hyperinflation2020.tumblr.com/private/618394825774989312/tumblr\\_IZ3ayFDB0CsGdYVHW \n\nNow we need to realise a few things here. Deep Learning is not some magic silver bullet. There are specific applications where it has proven very useful – primarily areas that have a very large number of very weak relationships between bits of data that sum up into strong relationships. An example of ones of those is Google Translate. On the other hand, in most analytical tasks, it is most useful to have an intuitive understanding of the data and to fit a simple and sensible model to it that is explainable. Deep learning models are not explainable in an intuitive manner. This is not only because they are complicated, but also because their scattershot technique of trying everything leaves a huge amount of garbage inside the model that cancels itself out when calculating the answer, but it is hard to see how it cancels itself out when stepping through it.\n\nGiven the quantum of hype on Deep learning and the space in general, many companies are using “Deep Learning”, “Machine Learning” and “AI” as marketing. Not many companies are actually generating significant amounts of tangible value from Deep Learning. \n\n**Back to the Competitive Picture**\n\n**For the Tesla Segment**\n\nSo NVDA happened to be in the right place at the right time to benefit from the Deep Learning hype. They happened to have a product ready to go and were able to charge a pretty penny for their product. But what happens as we proceed from here?\n\nFirstly, it looks like the hype from Deep Learning has crested, which is not great from a future demand perspective. Not only that, but we really went from people having no GPUs, to people having GPUs. The next phase is people upgrading their old GPUs. It is much harder to sell an upgrade than to make the first sale.\n\nNot only that, but GPUs are not the ideal manifestation of silicon for Deep Learning. NVDA themselves effectively admitted that with their latest iteration in the Datacentre, called Ampere. High Performance Computing, which was the initial use case for Tesla GPUs, was historically all about double precision floating point calculations (FP64). High precision calculations are required for simulations in aerospace/oil &amp; gas/automotive. \n\nNVDA basically sacrificed HPC and shifted further towards Deep Learning with Ampere[\\[TM3\\]](https://www.reddit.com/r/stocks/submit#_msocom_3) , announced last Thursday. The FP64 performance of the A100 (the latest Ampere chip) increased a fairly pedestrian 24% from the V100, increasing from 7.8 to 9.7 TF. Not a surprise that NVDA lost El Capitan to AMD, given this shift away from a focus on HPC. Instead, NVDA jacked up their Tensor Cores (i.e. not the GPU cores) and focused very heavily on FP16 computation (a lot less precise than FP64). As it turns out, FP16 is precise enough for Deep Learning, and NVDA recognises that. The future industry standard is likely to be BFloat 16 – the format pioneered by Google, who lead in Deep Learning. Ampere now does 312 TF of BF16, which compares to the 420 TF of Google’s TPU V3 – Google’s Machine Learning specific processor. [\\[TM4\\]](https://www.reddit.com/r/stocks/submit#_msocom_4) Not quite up to the 2018 board from Google, but getting better – if they cut out all of the Cuda cores and GPU functionality maybe they could get up to Google’s spec. \n\nAnd indeed this is the problem for NVDA: when you make a GPU it has a large number of different use cases, and you provide a single product that meets all of these different use cases. That is a very hard thing to do, and explains why it has been difficult for competitors to muscle into the GPU space. On the other hand, when you are making a device that does one thing, such as deep learning, it is a much simpler thing to do. Google managed to do it with no GPU experience and is still ahead of NVDA. It is likely that Intel will be able to enter this space successfully, as they have widely signalled with the Xe. \n\nThere is of course the other large negative driver for Deep Learning, and that is the recession we are now in. Demand for GPU instances on Amazon has collapsed across the board, as evidenced by the fall in pricing. The below graph shows one example: this data is for renting out a single Tesla V100 GPU on AWS, which isthe typical thing to do in an early exploratory phase for a Deep Learning model:\n\n📷 https://hyperinflation2020.tumblr.com/private/618396177958944768/tumblr\\_Q86inWdeCwgeakUvh \n\nWith Deep Learning not delivering near-term tangible results, it is the first thing being cut. On their most recent conference call, [\\[TM5\\]](https://www.reddit.com/r/stocks/submit#_msocom_5) IBM noted weakness in their cognitive division (AI), and noted weaker sales of their power servers, which is the line that houses Enterprise GPU servers at IBM. Facebook cancelled their AI residencies for this year, and Google pushed theirs out. Even if NVDA can put in a good quarter due to their new product rollout[\\[TM6\\]](https://www.reddit.com/r/stocks/submit#_msocom_6)  (Ampere), the future is rapidly becoming a very stormy place.\n\n**For the Quadro segment**\n\nThe Quadro segment has been a cash cow for a long time, generating dependable sales and solid margins. AMD just decided to rock the boat a bit. Sensing NVDA’s focus on Deep Learning, AMD seems to be focusing on HPC – the Radeon VII announced recently with a price point of $1899 takes aim at NVDAs most expensive Quadro, the GV100, priced at $8999. It does 6.5 TFLOPS of FP64 Double precision, whereas the GV100 does 7.4 – talk about shaking up a quiet segment. \n\n**Pulling things together**\n\nLet’s go back to what NVidia fundamentally does – paying their engineers to design chips, getting TSMC to print those chips, and getting board partners in Taiwan to turn them into the final product.\n\nWe have seen how a confluence of several pieces of extremely good fortune lined up to increase NVidia’s sales and profits tremendously: first on the Gaming side, weak competition from AMD until 2014, coupled with a great product in form of Pascal in 2016, followed by a huge crypto driven boom in 2017 and 2018, and on the Professional side, a sudden and unexpected increase in interest in Deep Learning driving Tesla demand from 2017-2019 sky high.\n\nIt is worth noting what these transient factors have done to margins. When unexpected good things happen to a chip company, sales go up a lot, but there are no costs associated with those sales. Strong demand means that you can sell each chip for a higher price, but no additional design work is required, and you still pay the printer, TSMC, the same amount of money. Consequently NVDA’s margins have gone up substantially: well above their 11.9% long term average to hit a peak of 33.2%, and more recently 26.5%:\n\n📷 https://hyperinflation2020.tumblr.com/private/618396192166100992/tumblr\\_RiWaD0RLscq4midoP \n\nThe question is, what would be a sensible margin going forward? Obviously 33% operating margin would attract a wall of competition and get competed away, which is why they can only be temporary. However, NVidia has shifted to having a greater proportion of its sales coming from non-OEM, and has a greater proportion of its sales coming from Professional rather than gaming. As such, maybe one can be generous and say NVDA can earn an 18% average operating margin over the next cycle. We can sense check these margins, using Intel. Intel has a long term average EBIT margin of about 25%. Intel happens to actually print the chips as well, so they collect a bigger fraction of the final product that they sell. NVDA, since it only does the design aspect, can’t earn a higher EBIT margin than Intel on average over the long term.\n\nTesla sales have likely gone too far and will moderate from here – perhaps down to a still more than respectable $2bn per year. Gaming resumes the long-term slide in discrete GPUs, which will likely be replaced by integrated GPUs to a greater and greater extent over time. But let’s be generous and say it maintains $3.5 Bn Per year for the add in board, and let’s assume we keep getting $750mn odd of Nintendo Switch revenues(despite that product being past peak of cycle, with Nintendo themselves forecasting a sales decline). Let’s assume AMD struggles to make progress in Quadro, despite undercutting NVDA on price by 75%, with continued revenues at $1200. Add on the other 1.2Bn of Automotive, OEM and IP (I am not even counting the fact that car sales have collapsed and Automotive is likely to be down big), and we would end up with revenues of $8.65 Bn, at an average operating margin of 20% through the cycle that would have $1.75Bn of operating earnings power, and if I say that the recent Mellanox acquisition manages to earn enough to pay for all the interest on NVDAs debt, and I assume a tax rate of 15% we would have around $1.5Bn in Net income. \n\nThis company currently has a market capitalisation of $209 Bn. It blows my mind that it trades on 139x what I consider to be fairly generous earnings – earnings that NVidia never even got close to seeing before the confluence of good luck hit them. But what really stuns me is the fact that investors are actually willing to extrapolate this chain of unlikely and positive events into the future.\n\nShockingly, Intel has a market cap of 245Bn, only 40Bn more than NVDA, but Intel’s sales and profits are 7x higher. And while Intel is facing competition from AMD, it is much more likely to hold onto those sales and profits than NVDA is. These are absolutely stunning valuation disparities. \n\nIf I didn’t see NVDA’s price, and I started from first principles and tried to calculate a prudent price for the company I would have estimated a$1.5Bn normalised profit, maybe on a 20x multiple giving them the benefit of the doubt despite heading into a huge recession, and considering the fact that there is not much debt and the company is very well run. That would give you a market cap of $30Bn, and a share price of $49. And it is currently $339. Wow. Obviously I’m short here!",
        "subreddit": "stocks",
        "title": "NVidia – Know What You Own",
        "url": "https://www.reddit.com/r/stocks/comments/gln51p/nvidia_know_what_you_own/",
        "created": 1589777575.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589789335,
        "id": "glxd3p",
        "num_comments": 273,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - May 18, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/glxd3p/rstocks_daily_discussion_monday_may_18_2020/",
        "created": 1589818135.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589530025,
        "id": "gk51fo",
        "num_comments": 254,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday May 15, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gk51fo/rstocks_daily_discussion_fundamentals_friday_may/",
        "created": 1589558825.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589443570,
        "id": "gji1b0",
        "num_comments": 247,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - May 14, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gji1b0/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1589472370.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1590048371,
        "id": "gnsqod",
        "num_comments": 229,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - May 21, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gnsqod/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1590077171.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1590134820,
        "id": "gof7xi",
        "num_comments": 218,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday May 22, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gof7xi/rstocks_daily_discussion_fundamentals_friday_may/",
        "created": 1590163620.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588752423,
        "id": "gefu3d",
        "num_comments": 201,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - May 06, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gefu3d/rstocks_daily_discussion_wednesday_may_06_2020/",
        "created": 1588781223.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1589270841,
        "id": "gi6xt7",
        "num_comments": 191,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme and/or [post your arguments against TA here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help measure the trajectory of a security.  TA can also be used to interpret the actions of other market participants and predict their actions.\n\nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Technicals Tuesday - May 12, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gi6xt7/rstocks_daily_discussion_technicals_tuesday_may/",
        "created": 1589299641.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588925260,
        "id": "gfp02m",
        "num_comments": 168,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday May 08, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gfp02m/rstocks_daily_discussion_fundamentals_friday_may/",
        "created": 1588954060.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1588666074,
        "id": "gdtntt",
        "num_comments": 135,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme and/or [post your arguments against TA here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help measure the trajectory of a security.  TA can also be used to interpret the actions of other market participants and predict their actions.\n\nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Technicals Tuesday - May 05, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/gdtntt/rstocks_daily_discussion_technicals_tuesday_may/",
        "created": 1588694874.0
    },
    {
        "author": "PMD20XX",
        "created_utc": 1589951438,
        "id": "gn576i",
        "num_comments": 134,
        "num_crossposts": 0,
        "selftext": "I lost probably around 12k on a garbage scam stock called BXC last year. But if I didn’t sell when I did ($22), I would have lost it all. It’s currently trading at $5. I ended up meeting one of their largest investors in person long after I sold and he said word for word “they have no idea what they are doing over there.”\nI have since made that money back two fold from pure luck. Had good trades due to just random timing and lucky stock picks. I’m not great at this but my portfolio just hit 30k. Started with $300 in 2016 with AMD. So it’s been an interesting few years. I’m 25 now. It would be cool to hit a million before I’m 50 so that’s what the goal is for the account. Sorry I’m ranting. What’s your biggest single loss?",
        "subreddit": "stocks",
        "title": "What’s your biggest single loss?",
        "url": "https://www.reddit.com/r/stocks/comments/gn576i/whats_your_biggest_single_loss/",
        "created": 1589980238.0
    },
    {
        "author": "metawatts",
        "created_utc": 1589919317,
        "id": "gmwbmd",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Well... Looks like I'm holding this overnight... AMD",
        "url": "https://i.redd.it/69d5u4iw4sz41.jpg",
        "created": 1589948117.0
    },
    {
        "author": "extriniti",
        "created_utc": 1589912682,
        "id": "gmu5sh",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "Canadian Cannabis Industry stocks look like they turned the corner on proving their profitability &amp; viability &amp; are ready to go back up to their full potentials.\n\nAdult Recreational Sales of Cannabis 2.0 have gone up due to hoarding like toilet paper &amp; sales will keep growing during self isolation rules in Canada.\n\nCannabis 2.0 &amp; derivatives are legal in Canada &amp; the government is the biggest distributor &amp; they also retail too. You can buy it online, at a store or get it delivered. They definitely will be expanding Cannabis Sales for taxes for all the Covid19 Aid &amp; Cash they are giving to citizens &amp; businesses.\n\nHere's the Canadian Cannabis Stocks trading on the TSX, USA (NYSE &amp; Nasdaq) &amp; some European exchanges:\n\nAurora Cannabis Inc (ACB), Cronos Group Inc (CRON), HEXO Corp (HEXO), OrganiGram Holdings Inc. (OGI), Village Farms International, Inc. (VFF), Canopy Growth Corporation (WEED / CGC)\n\nThey all are near their 52 week lows &amp; are Short Squeeze candidates. ACB popped a bit since their last Q3 May 14 ER but there's still lots of room to go up.  HEXO is next on June 11. \n\nPast Big Stock Pick winners that I posted about in the past before their run up:\n\nAMD, ATVI, FB, LOGI, LULU, TSLA, TWTR \n\nGood luck &amp; always do your Due Diligence before investing.",
        "subreddit": "wallstreetbets",
        "title": "CANNABIS STOCKS OPPORTUNITY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gmu5sh/cannabis_stocks_opportunity/",
        "created": 1589941482.0
    },
    {
        "author": "PMD20XX",
        "created_utc": 1589952682,
        "id": "gn5gdo",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "What’s your biggest single loss?\n\nI lost probably around 12k on a garbage scam stock called BXC last year. But if I didn’t sell when I did ($22), I would have lost it all. It’s currently trading at $5. I ended up meeting one of their largest investors in person long after I sold and he said word for word “they have no idea what they are doing over there.”\nI have since made that money back two fold from pure luck. Had good trades due to just random timing and lucky stock picks. I’m not great at this but my portfolio just hit 30k. Started with $300 in 2016 with AMD. So it’s been an interesting few years. I’m 25 now. It would be cool to hit a million before I’m 50 so that’s what the goal is for the account. Sorry I’m ranting. What’s your biggest single loss?",
        "subreddit": "wallstreetbets",
        "title": "What’s your biggest single loss?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gn5gdo/whats_your_biggest_single_loss/",
        "created": 1589981482.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1589524360,
        "id": "gk3xle",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "\\## **My history investing in college and my first month investing in February:**\n\nLearned about miners and blockchain validation with a chemical engineering friend before the rally.\n\n\\- Bought **XRP** at $.15 and $.25, sold at $3.28 (I valued at $4 or $5 dollars MAX in 10 years if blockchain found adoption)\n\n\\- Bought **AMD** after the rally at $11 because it was ridiculous how much cost efficiency they had introduced to the market to poor people like me unlike **NVIDIA** products which always seemed far removed and discouraged me.\n\n\\- I started with **Panasonic** because I had missed out on the window to invest in **Tesla** at 200-300 range. I believed **Panasonic** to be similar to **AMD's** relationship to **bitcoin**; while all eyes looked at the shiny object, I looked at the boring parts that built it.\n\n\\- The market crashed, so I DCA'd aggressively and controlled my emotions through out. I was more concerned with my performance to commitment rather than my returns at the time. I did well.\n\n\\- My investments in March 19 was **SQ** and **Lyft**\n\n\\## **My Strategy now that I have income**\n\n\\- I bought up to 5,000 dollars in stocks ranging from **FANUC** (industrial robotics) to **DENNYS** (logistics/real estate)\n\n\\- I trimmed down to $2,300 but will rapidly rebuild with a different approach:\n\n\\- I'm buying 1 stock in the company before making any further developments with. Following this, I will purchase ETFs in sectors that I **want** to see develop in the next 5-15 years. I will buy 1 stake into these ETFs and combine it with my 1 stock purchase to create the necessary offset.\n\n\\- For example, I bought 1 stock of **Texas Instruments**  for $109 followed by a purchase in **SOXX ETF** for semiconductors, which has the largest ETF allocation to **Texas Instruments.** I will apply similar logic to companies like **Facebook, Paypal,** etc.\n\n&amp;#x200B;\n\n\\- I do this \"1 chip\" start in multiple industries because I want to pick some arbitrary point in time but I have a lot of industries &amp; ecosystems that I would like to reasonably participate in. This will still cost a lot of money to start off with and buys me time to study company numbers and outlooks.\n\n&amp;#x200B;\n\n\\## **My current market sentiment**\n\n**-** I consider where you start on a graph as somewhat arbitrary and see the current market stability as somewhat of an exercise in game theory and rowing a boat throat a thick fog. I believe it's optimal to row cautiously forward and to not stay still. With cautious rowing, you'll be able to react appropriately if you are suddenly met by a waterfall or a path with clearer vision.\n\n&amp;#x200B;\n\n\\- I am **\\`*****BEARISH\\`*** on Amazon in the long term. I believe that slowly, but surely, the market will consume Amazon's hold on its markets. I don't believe Amazon will maintain the status quo on cloud computing due to the quality of its competitors. I absolutely LOVE **Google Cloud Platform** and utilize **Firebase real-time database** very often. **Microsoft** has made some extremely important acquisitions recently in **Github and NPM - that's enormous.**\n\n\\-  I have suspicions about **Amazon** will struggle internationally. I don't know if Amazon will penetrate China the way China does, or if it will succeed in locations south of Mexico against things like **Mercado Libre**\n\n\\- I have suspicions that tech platforms will soon integrate in a meaningful way with financials. As in, the virtualization of stores and forwarded payments in places like the **Facebook(Visa) Market Place, Twitter(Square) payment sending, Paypal(honey) &amp; Amazon purchasing, Gaming credits, etc.**\n\n**-** I am \\`**bullish**\\` on Facebook. Facebook is utterly invaluable and scales globally. The reason it's adopted in **Mexico**, for example, is because it's cheaper and faster than other services. They also service millions of developers with **React** and its growing development ecosystem. They provide a standardized marketting platform for small businesses on Instagram, Facebook, WhatsApp, and soon to be JIO. I would not be surprised if they soon enter the fintech sector.\n\n\\- I am \\`**bullish\\`** on **Paypal**. They are seemingly repeating their previous success by servicing large online commerce that are upgrading their systems. **Honey/Paypal** will scrape coupons for Amazon and force organizations like Visa to compete with  **real-time financial services**.\n\n&amp;#x200B;\n\n\\- I am **\\`bullish\\`** on cloud software and networking. I think **CDNs** and dedicated **services for Cybersecurity** will maintain. Sure Google provides these services but things like **Cloudflare** and **Fastly** have dedicated solutions to fast image processing, DDoS protection, and more that other platforms may not be able to **allocate their resources to**. **Cloudflare** has an enormous network, and **Fastly** provides a great system for you to enjoy content like **Reddit.** I think it's hard to miss the mark here - the highway of the internet is going to get faster and more assets will be maintained in the server's space - the ecosystem must grow with it.\n\n&amp;#x200B;\n\n\\- I am ***\\`EXTREMELY BEARISH***\\*\\*\\`\\*\\* on Beyond Meat. I've been vegetarian for 10 years. IT'S BAD. WE HAVE NOTHING ELSE TO BE EXCITED ABOUT AND WE'RE NOT USED TO HAVING ATTENTION. VEGETARIANS ARE LYING IF THEY SAY IT'S AMAZING. ***IT'S LITERALLY DOG FOOD***\n\n&amp;#x200B;\n\n\\- I am \\`**BULLISH\\`** on the long term development of **Mexico**. I think companies like **Kansas City Southern** that services **Mexican-American** relationships will grow well in the long run.\n\n\\- I am **\\`BULLISH\\`**  on Apple and Adobe. Amazing products.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## **CURRENT HOLDINGS (ordered by priority &amp; checkup time):**\n\n&amp;#x200B;\n\n**GOOG &amp; AMZN exposure through tech ETFs** ::: priority FB\n\n**NVIDIA, AMD, Intel EXPOSURE through semiconductor ETFS** ::: priority Texas Instruments\n\n**Environmental Services exposure through Sanitation ETFS** ::: priority Waste Management\n\n**Adobe and AutoDesk exposure through cloud software ETFs** :: priority Adobe\n\n**Nintendo exposure through gaming ETFS ::** priority Nintendo\n\n**Cisco exposure through cloud networking and edge computing ETFS** Cicsco, Fastly, Cloudflare, etc\n\n**TELECOM networking ETFS** :: priority TMobile\n\n**Manufacturing technology, industrial sectors, and robotics exposure to**  Fanuc, ABB, Siemens, Sherwin-Williams, VW, GM, Nissan, Toyota, Panasonic,\n\n**Healthcare services ETF** :: priority Cigna\n\n**FB -- LONG**\n\n**PAYPAL --  LONG**\n\n**TEXAS INSTRUMENTS - LONG**\n\n**MSFT     --  LONG**\n\n**APPLE   --  LONG**\n\n**ADOBE -- LONG**\n\n**DISNEY -  LONG**\n\n**BITCOIN - LONG**\n\n**TMOBILE - 2 YEARS**\n\n**VISA -- 2 YEARS**\n\n**JPM - 2 YEARS**\n\n**TWITTER - 2 YEARS**\n\n**SQUARE - 1 YEAR**\n\n**LYFT - 1 YEAR**\n\n**FASTLY - QUARTERLY**\n\n**CLOUDFLARE - QUARTERLY**\n\n**1LIFE MEDICAL - QUARTERLY**\n\n**FIVERR - QUARTERLY**\n\n**DRAFT KING - QUARTERLY YEAR + CHICAGO POLITICS**\n\n**GROUPON - SPARE CHANGE JAR**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**## EXCITED TO ACQUIRE**\n\n**- ADOBE**\n\n\\- **QQQ**\n\n\\- **SHERWIN WILLIAMS**\n\n\\- **TOYOTA**\n\n\\- **KANSAS CITY SOUTHERN**\n\n\\-",
        "subreddit": "investing",
        "title": "I started my career in November and investing February 5th, 2020 - my strategy as a once peasant Mexican",
        "url": "https://www.reddit.com/r/investing/comments/gk3xle/i_started_my_career_in_november_and_investing/",
        "created": 1589553160.0
    },
    {
        "author": "rennocsemaj",
        "created_utc": 1589041175,
        "id": "ggiafk",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "Very powerful CPU AMD are supposedly producing.\n\nhttps://www.techradar.com/uk/news/amd-ryzen-4000-renoir-leak-hints-at-a-seriously-powerful-8-core-apu",
        "subreddit": "stocks",
        "title": "Some good news coming AMDs way",
        "url": "https://www.reddit.com/r/stocks/comments/ggiafk/some_good_news_coming_amds_way/",
        "created": 1589069975.0
    },
    {
        "author": "Adi_PL",
        "created_utc": 1589444187,
        "id": "gji5ks",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "Hi folks.\n\nI want to extend my long term portfolio. Currently it consists from primarily tech companies: MSFT, AAPL, ENP, SEDG, BABA, AMD, GOOGL, TSLA, V, MA.  \n\nI'm aware it's too tech focused, therefore I want to add non-tech stock to have it better diversified. I can add one position at this moment (transaction commission).  \n\nSo, what's your favourite non-tech stock for long term holding (10-20 years) that you believe is really safe, will still grow and can give you decent gains?",
        "subreddit": "stocks",
        "title": "What are your favourite/best non-tech stocks for long term hold?",
        "url": "https://www.reddit.com/r/stocks/comments/gji5ks/what_are_your_favouritebest_nontech_stocks_for/",
        "created": 1589472987.0
    },
    {
        "author": "mightylfc",
        "created_utc": 1589335678,
        "id": "gipqvu",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Some of the popular names on this subreddit are SHOP, AMD, SE and DXCM. But what are some of your lesser known aggressive growth stocks?",
        "subreddit": "stocks",
        "title": "What are some of your favorite aggressive growth stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/gipqvu/what_are_some_of_your_favorite_aggressive_growth/",
        "created": 1589364478.0
    },
    {
        "author": "HocusPokas",
        "created_utc": 1588865910,
        "id": "gf8tlo",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Just so I fully understand. If I own 100 shares of AMD and sell a $55 option at .15 premium, what is the max loss here? As I try to read it looks like it is the 100 shares - the premium price, but that seems a little wrong to risk $5k+ for a measly $15... Am I reading this wrong?\n\n&amp;#x200B;\n\nThanks for the insight!",
        "subreddit": "RobinHood",
        "title": "Looking for some clarity on covered calls",
        "url": "https://www.reddit.com/r/RobinHood/comments/gf8tlo/looking_for_some_clarity_on_covered_calls/",
        "created": 1588894710.0
    },
    {
        "author": "mtmtrader",
        "created_utc": 1590248129,
        "id": "gp6xor",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Stock breakouts create a ton of different trade opportunities for day traders, swing traders, and even investors using both long and short strategies. Still, they can also be pretty high-risk setups and many times cause inexperienced traders to buy at the very top of a move before it reverses back down. In this post I'll be explaining one of the proper ways to trade stock breakouts, which will help you avoid buying the top and will reduce risk when buying a breakout!\n\n*First... what exactly is a breakout?*\n\nA **breakout** is a move above a defined level of resistance. It's essentially the exact opposite of a breakdown, which is a move below a defined level of support. Unfortunately, many traders are taught to trade breakouts in a much less accurate way that creates a lot of unnecessary risk. This involves them buying immediately when a stock makes a new high over a past level of resistance. The problem with this breakout trading strategy is that it often leads to traders buying the top.\n\nThe reason for this is because of what are known as false breakouts. A **false breakout** is simply a short-term, temporary breakout over resistance that fails to continue upward. Any trader looking to immediately buy a breakout over resistance ends up buying the exact top of a move when it happens to be a false breakout. The breakout trading strategy that I'll be explaining in the rest of this post will help you avoid buying any false breakouts!\n\n[https://imgur.com/a/cWvdaim](https://imgur.com/a/cWvdaim) \n\nInstead of immediately buying a breakout to new highs, you can substantially reduce your risk by waiting for the past breakout level, *or resistance,* to turn into **support**. As explained in past posts, broken resistance can become support, and broken support can become resistance. When a stock breaks above resistance, by waiting for that past resistance to become a level of support you're ensuring that you're not chasing the stock at its high during a false breakout. By trading breakouts this way you also now have a level of support to use for risk management. You can enter the trade knowing that your risk is limited because you'll cut losses if the stock comes back below its new support level.\n\n[https://imgur.com/a/AmRFjt2](https://imgur.com/a/AmRFjt2) \n\nAs you can see in the real life example below with the stock symbol $AMD, there was a breakout over a past high/past resistance level, and a long consolidation period over that past resistance, which then became a key level of support. There was plenty of time in this example to use that support as an opportunity to buy before it started its run to new highs. This happens much more commonly than you may think and can offer some incredible trading opportunities!\n\n[https://imgur.com/a/VoK1nmZ](https://imgur.com/a/VoK1nmZ)\n\n*Again,* using this breakout trading strategy will reduce your risk and will definitely reduce the amount of time that you catch yourself buying into a false breakout. The example of stock symbol $IMBI below shows you how dangerous it can be to buy into these false breakouts. $IMBI had resistance at $5.40 from the market's open, briefly broke above that resistance by only $0.03, came straight back down, and ended the day more than 20% lower than its early morning breakout level! By waiting for support to form over that $5.40 resistance, you'd be able to avoid buying into this false breakout trap.\n\n[https://imgur.com/a/EtaUYFY](https://imgur.com/a/EtaUYFY) \n\nI hope this post was helpful for any new traders that find themselves buying the top of a move too frequently! This strategy should prevent that from happening and should greatly help you improve your accuracy when trading stock breakouts!",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Trading Stock Breakouts &amp; Avoiding False Breakouts",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/gp6xor/trading_stock_breakouts_avoiding_false_breakouts/",
        "created": 1590276929.0
    },
    {
        "author": "senpaistarkiller",
        "created_utc": 1589318217,
        "id": "gikmdd",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I'm an 18 year old college student, I started investing with $500 in March and made 10% by investing in stocks in a month. I then decided to get into options and doubled my portfolio to around a $1000 with BA calls and TWTR calls, but by dumb luck I'm guessing now. Then I just spiraled downwards. I bought and sold AMD, ATVI, GRUB calls for losses, only to have them bounce back significantly over the next few days. I bought a CSOD call and watched the value plummet, a SPY put and watched it skyrocket...I began to believe I was unlucky and decided to chase my losses. I'm currently sitting at a good $80, with my CSCO call probably bringing that down further tomorrow. I'm so exasperated, especially since I told myself I was going to quit multiple times while I was in the green. The worst part is that I feel like transferring another $500 from my bank account right now and chasing my losses. I don't know what to do, I'm really stressed and have developed a habit of checking my portfolio every five minutes. That $500 represented 20% of my net worth and I'm not sure I've learned much except that I suck at this.",
        "subreddit": "options",
        "title": "Lost my entire portfolio, regret",
        "url": "https://www.reddit.com/r/options/comments/gikmdd/lost_my_entire_portfolio_regret/",
        "created": 1589347017.0
    },
    {
        "author": "zakwill",
        "created_utc": 1588907435,
        "id": "gfl9oa",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Trading options during earnings season definitely adds to the intensity level, but makes it very interesting and rewarding. Yesterday I bought a 120 TWLO 5/22 p @5.30. I also bought a 135 TWLO c @ 6.10. Now, I have been buying calls in TWLO from 90 and up in the past month. I thought the recent run up provided for a difficult earnings season. However, I bought the call around 12:30pm because I didn’t want to miss a potential pop. Got lucky. In retrospect I shouldn’t have even bought the Put, but a little protection is fine if it fell hard. I sold the C this morning for a $2800 profit. The news was so good on TWLO, that I also bought an OTM, at the time, 165 C later on the day. Up another $1200 unrealized. \n\nI had 8 UBER calls. My strategy was to sell all if UBER traded above 30 in the AM which I did. After I had time to digest LYFTs report, I bought 4 ITM 28 UBER back. Still holding. \n\nROKU was another great holding of mine. However, I sold all three deep ITMs before the close because I was up over 6k from them. I did buy one OTM 145 C. Gone. \n\nI’m a huge believer in SQ so I picked up 5 ITMs today. Granted, I sold all 10 ITM calls yesterday before earnings. I held 3 ITM PYPLs. I thought Square May have bad earnings based on the pre earnings trade and PYPL would be good. The markets could easily sell a stock no matter how good the earnings, INTC. AMZN, AMD for example but I held my PYPLs. \n\nAlso, during the day I kept buying and adding to my SBUX ITM C positions and bought more CRM options on the strength of TWLOs report. I’m also holding several other positions. Very good day overall!! \n\nI’m looking to create a good group discussion to bounce trade ideas and strategies. I welcome other successful trade stories! I’m happy to help others also. As I said numerous times, I am a strong confident directional trader. Most of all, be patient, learn from your mistakes, take calculated risks and stay mentally strong. Good luck!!",
        "subreddit": "options",
        "title": "Mind of a trader. Today’s/ yesterday’s trades on UBER TWLO SQ and others",
        "url": "https://www.reddit.com/r/options/comments/gfl9oa/mind_of_a_trader_todays_yesterdays_trades_on_uber/",
        "created": 1588936235.0
    },
    {
        "author": "RRAIDD",
        "created_utc": 1588770035,
        "id": "gejjvw",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "it seems like many have contracted the \"UAVS-20\" virus and this disease is spreading quickly. One wonders why panic is breaking out now? The vaccine has already been taken and the studies speak only for themselves; it will be released to everyone tomorrow at 5:00 a.m.\nCongratulations to those with thick fur.\nMicrovision reminds me a lot of Advance micro devices ..\nAMD 2.0\nI am very optimistic and do not let fear of \"leading others\"",
        "subreddit": "pennystocks",
        "title": "MVIS Block",
        "url": "https://www.reddit.com/r/pennystocks/comments/gejjvw/mvis_block/",
        "created": 1588798835.0
    },
    {
        "author": "thajoker505",
        "created_utc": 1588889329,
        "id": "gfgdjr",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Anyone been looking into any AMD calls? The Zen 3 architecture is going to be released later this year and many are expecting single core performace is finally going to either match or exceed anything from intel. Looks like AMD is going to finally be able to go toe to toe with intel in every processor class including laptops. Stock hasnt moved much. Currently in the low 50's",
        "subreddit": "wallstreetbets",
        "title": "AMD Calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gfgdjr/amd_calls/",
        "created": 1588918129.0
    },
    {
        "author": "starkmatic",
        "created_utc": 1588318806,
        "id": "gbdu1g",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I’m on a group text since covid and a few finance guys are on there hedge fund/pe. They acted super surprised that I would try to time the market and trade options. I started just by investing in AMD and taking calculated options risk. Then I shorted the market for covid and did well. I’m pretty damn conservative overall but in my opinion you need to be in the game to have a chance of making it. Is it dumb to keep trying to grow the stack, what do normies do why are they so afraid. Gains in link below started with 7k \n\nhttps://imgur.com/a/Ge3WXRQ",
        "subreddit": "wallstreetbets",
        "title": "4 year returns and finance dudes",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbdu1g/4_year_returns_and_finance_dudes/",
        "created": 1588347606.0
    },
    {
        "author": "LiL_penut",
        "created_utc": 1588971382,
        "id": "gg1hly",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "The reason for this is that most blue chips nowadays have already had there Impressive growth and I want to invest in something that growing instead of something that has already grown. Microsoft is another candidate, but comparable companies to amd like Nvidia have a stock prices in the hundreds. Furthermore, as amd increases its presence in the tech hardware market I feel like they will have a good chance of reaching comparable stock prices to nvidia and intel. As the tech hardware market already has incredible upside, and amd is a growing company in that market I can’t imagine why they wouldn’t be green in the long term. This is just my DD and opinion and I would also love to hear yours.",
        "subreddit": "stocks",
        "title": "I want to invest my entire portfolio in amd for a long term investment 5+ years.",
        "url": "https://www.reddit.com/r/stocks/comments/gg1hly/i_want_to_invest_my_entire_portfolio_in_amd_for_a/",
        "created": 1589000182.0
    },
    {
        "author": "bubleboii",
        "created_utc": 1588380311,
        "id": "gbvdlo",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "11,248 puts for Hilton Worldwide Holding with a strike price of 60 on May 15. Daily trading volume is 3.7m so this one put represents nearly 33% of the total volume. Average price was 50 cents so a little over a half a million bet that Hilton will be trading under 60 by May 15.  A huge majority of these puts were bought between 13:25:30 and 13:37:50 in small quantities. 55% were traded above ask price. Going to look into grabbing some puts on Monday.\n\n&amp;#x200B;\n\nCurrent positions: AMD 52C 5/15, APPL 260P 6/19",
        "subreddit": "wallstreetbets",
        "title": "UOA Hilton HLT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbvdlo/uoa_hilton_hlt/",
        "created": 1588409111.0
    },
    {
        "author": "Dat_Speed",
        "created_utc": 1590198249,
        "id": "gowehb",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "In the last month NVDA has sky rocketed from $284 to $361 (+27%), while AMD has gone from $56 to $55 and been essentially flat, even though it also had a good earnings report and is a very similar business to NVDA. I'm thinking both of these will go even higher over the next few months as their business models are booming and so well protected from coronavirus. Both AMD and NVDA earnings report presentations looked super good.\n\nI notice over the last few years these two like to play catch up with each other and bought some $57 weekly calls on AMD. Thoughts?\n\n&amp;#x200B;\n\n[AMD vs NVDA 1 month](https://preview.redd.it/7g78iosj4f051.png?width=1511&amp;format=png&amp;auto=webp&amp;s=39071961a82b3b51e4e6ff156a593a3a4403830c)",
        "subreddit": "wallstreetbets",
        "title": "AMD coiled up for a pop?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gowehb/amd_coiled_up_for_a_pop/",
        "created": 1590227049.0
    },
    {
        "author": "Salty-Grips",
        "created_utc": 1588359059,
        "id": "gbnxhe",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "What are your thoughts on AMD and this particular option?\n\nI personally feel like AMD is at a pretty solid support at 49-48 and a price move is on its way. I would only hold this option up to 52 and exit the trade.\n\nDo you guys see the support at 48/49breaking and retesting 42? \n\nCurious on others thoughts on AMD at the moment!",
        "subreddit": "options",
        "title": "AMD 55 June 19th, 2020",
        "url": "https://www.reddit.com/r/options/comments/gbnxhe/amd_55_june_19th_2020/",
        "created": 1588387859.0
    },
    {
        "author": "ray_marcos",
        "created_utc": 1589842803,
        "id": "gmcdss",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "**GE** $7 CALL, 5/22 *(530K VOL.)* [GE](https://finance.yahoo.com/quote/GE?p=GE&amp;.tsrc=fin-srch)\n\n**AAPL** $320 CALL, 5/22 *(389K VOL.)* [AAPL](https://finance.yahoo.com/quote/AAPL/)\n\n**BA** $135 CALL, 5/22 *(301K VOL.)* [BA](https://finance.yahoo.com/quote/BA?p=BA&amp;.tsrc=fin-srch)\n\n**BAC** $23 CALL, 5/22 *(266K VOL.)* [BAC](https://finance.yahoo.com/quote/BAC?p=BAC&amp;.tsrc=fin-srch)\n\n**DIS** $120 CALL, 5/22 *(229K VOL.)* [DIS](https://finance.yahoo.com/quote/DIS?p=DIS&amp;.tsrc=fin-srch)\n\n**AMD** $55 CALL, 5/22 *(180K VOL.)* [AMD](https://finance.yahoo.com/quote/AMD?p=AMD&amp;.tsrc=fin-srch)\n\n**MSFT** $187.50 CALL, 5/22 *(180K VOL.)* [MSFT](https://finance.yahoo.com/quote/MSFT?p=MSFT&amp;.tsrc=fin-srch)\n\n**WMT** $135 CALL, 5/22 *(175K VOL.)* [WMT](https://finance.yahoo.com/quote/WMT?p=WMT&amp;.tsrc=fin-srch)\n\n**FB** $220 CALL, 5/22 *(148K VOL.)* [FB](https://finance.yahoo.com/quote/FB?p=FB&amp;.tsrc=fin-srch)\n\n**NVDA** $350 CALL, 5/22 *(141K VOL.)* [NVDA](https://finance.yahoo.com/quote/NVDA?p=NVDA&amp;.tsrc=fin-srch)\n\n**DAL** $22 CALL, 5/22 *(136K VOL.)* [DAL](https://finance.yahoo.com/quote/DAL?p=DAL&amp;.tsrc=fin-srch)\n\n\\--------------------------------------------------------------\n\n**VOL. = amount of calls on that strike price**",
        "subreddit": "smallstreetbets",
        "title": "Most Active Call Options 5/18",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gmcdss/most_active_call_options_518/",
        "created": 1589871603.0
    },
    {
        "author": "for-S-and-Gs",
        "created_utc": 1588819315,
        "id": "geybgh",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "What stocks are you watching for future potential in AI applications? \n\nThere are the usual suspects who'll be on it like MSFT, GOOG, AAPL, AMZN. I've looked at semiconductors like AMD, QCOM, NVDA thinking the semiconductor space is big due to compute power requirements.\n\nI feel like I'm sitting in the water waiting for the wave but could be in a better spot.",
        "subreddit": "investing",
        "title": "AI stocks",
        "url": "https://www.reddit.com/r/investing/comments/geybgh/ai_stocks/",
        "created": 1588848115.0
    },
    {
        "author": "ohkillem365",
        "created_utc": 1590185460,
        "id": "goszbz",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "This is my first question/post ever so if it’s not something usually done or wrong in any way I apologize!\n\nI’m 26 and have been investing biweekly since age 18 into a Roth IRA, I have about $30,000 in my Roth through Vanguard and feel I’m somewhat knowledgeable about investing. I’ve never invested into an individual stock but am interested in doing so now through a brokerage account.\n\nI am receiving a small settlement from a motor vehicle accident (around $3,500) and was thinking about investing this into a stock, or several. I totally realize the stock market is volatile and I risk losing this. Having said that, I did some research the last few weeks and knowing we are in not-so-certain times, I’m wondering if anyone has any opinion on any of the following?\n\nAMZN (Amazon) * I would only afford 1 share\nFB (Facebook)\nAAPL (Apple)\nCVX (Chevron)\nSGEN (Seattle Genetics)\nTJX (TJ Max)\nMTCH (Match)\nDAL (Delta)\nUBER\nWYNN (Wynn)\nNKE (Nike)\nINSG (Inseego)\nNLTX (Neoleukin)\nAMD (Adcanced Micro Devices)\nDBX (Dropbox)\nHTZ (Hertz)\n\nSorry for a lot of stocks, and willing to take any constructive criticism, thank you!",
        "subreddit": "stocks",
        "title": "Help me pick a stock(s) from the following (or not) to invest my settlement $?",
        "url": "https://www.reddit.com/r/stocks/comments/goszbz/help_me_pick_a_stocks_from_the_following_or_not/",
        "created": 1590214260.0
    },
    {
        "author": "nighthawk2007",
        "created_utc": 1589832550,
        "id": "gm93au",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Started years ago with stocks. Went to pennies. I learned about options when IQ was a meme stock last year. I lost around 10k. In the last 3 months I'm up around 12k. Some of my plays were the two big spy put drops. I'm currently in BABA calls, Cost calls and just sold my lowes calls. I'm deep in AMD calls atm\n\n\n\nhttp://imgur.com/gallery/7hjlnGE",
        "subreddit": "wallstreetbets",
        "title": "The Comeback",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gm93au/the_comeback/",
        "created": 1589861350.0
    },
    {
        "author": "mtmtrader",
        "created_utc": 1590248079,
        "id": "gp6x6i",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Stock breakouts create a ton of different trade opportunities for day traders, swing traders, and even investors using both long and short strategies. Still, they can also be pretty high-risk setups and many times cause inexperienced traders to buy at the very top of a move before it reverses back down. In this post I'll be explaining one of the proper ways to trade stock breakouts, which will help you avoid buying the top and will reduce risk when buying a breakout!\n\n*First... what exactly is a breakout?*\n\nA **breakout** is a move above a defined level of resistance. It's essentially the exact opposite of a breakdown, which is a move below a defined level of support. Unfortunately, many traders are taught to trade breakouts in a much less accurate way that creates a lot of unnecessary risk. This involves them buying immediately when a stock makes a new high over a past level of resistance. The problem with this breakout trading strategy is that it often leads to traders buying the top.\n\nThe reason for this is because of what are known as false breakouts. A **false breakout** is simply a short-term, temporary breakout over resistance that fails to continue upward. Any trader looking to immediately buy a breakout over resistance ends up buying the exact top of a move when it happens to be a false breakout. The breakout trading strategy that I'll be explaining in the rest of this post will help you avoid buying any false breakouts!\n\n[https://imgur.com/a/cWvdaim](https://imgur.com/a/cWvdaim) \n\nInstead of immediately buying a breakout to new highs, you can substantially reduce your risk by waiting for the past breakout level, *or resistance,* to turn into **support**. As explained in past posts, broken resistance can become support, and broken support can become resistance. When a stock breaks above resistance, by waiting for that past resistance to become a level of support you're ensuring that you're not chasing the stock at its high during a false breakout. By trading breakouts this way you also now have a level of support to use for risk management. You can enter the trade knowing that your risk is limited because you'll cut losses if the stock comes back below its new support level.\n\n[https://imgur.com/a/AmRFjt2](https://imgur.com/a/AmRFjt2) \n\nAs you can see in the real life example below with the stock symbol $AMD, there was a breakout over a past high/past resistance level, and a long consolidation period over that past resistance, which then became a key level of support. There was plenty of time in this example to use that support as an opportunity to buy before it started its run to new highs. This happens much more commonly than you may think and can offer some incredible trading opportunities!\n\n[https://imgur.com/a/VoK1nmZ](https://imgur.com/a/VoK1nmZ)\n\n*Again,* using this breakout trading strategy will reduce your risk and will definitely reduce the amount of time that you catch yourself buying into a false breakout. The example of stock symbol $IMBI below shows you how dangerous it can be to buy into these false breakouts. $IMBI had resistance at $5.40 from the market's open, briefly broke above that resistance by only $0.03, came straight back down, and ended the day more than 20% lower than its early morning breakout level! By waiting for support to form over that $5.40 resistance, you'd be able to avoid buying into this false breakout trap.\n\n[https://imgur.com/a/EtaUYFY](https://imgur.com/a/EtaUYFY) \n\nI hope this post was helpful for any new traders that find themselves buying the top of a move too frequently! This strategy should prevent that from happening and should greatly help you improve your accuracy when trading stock breakouts! \n\n&amp;#x200B;\n\nFull blog: [https://masterthemarket.teachable.com/blog/208628/trading-stock-breakouts-avoiding-false-breakouts](https://masterthemarket.teachable.com/blog/208628/trading-stock-breakouts-avoiding-false-breakouts)",
        "subreddit": "pennystocks",
        "title": "Trading Stock Breakouts &amp; Avoiding False Breakouts",
        "url": "https://www.reddit.com/r/pennystocks/comments/gp6x6i/trading_stock_breakouts_avoiding_false_breakouts/",
        "created": 1590276879.0
    },
    {
        "author": "swallja",
        "created_utc": 1588635945,
        "id": "gdmxqd",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "a tale of redemption. hold me. \n\nhttps://imgur.com/gallery/W9dNJts\n\ncurrent posish is just two AMD $55c 6/2021 leaps. port value: $48k",
        "subreddit": "wallstreetbets",
        "title": "Road to 50k pt 2, less dumb version.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdmxqd/road_to_50k_pt_2_less_dumb_version/",
        "created": 1588664745.0
    },
    {
        "author": "greatsugarloaf",
        "created_utc": 1588974844,
        "id": "gg2kep",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hi guys, i have made my first time entry into the stock market, did some research over the last 2 weeks and bought following shares, i actually missed the march dip window since at that time i wasn’t into buying stocks at all and knew very little, however i made some gains over the last 2 weeks. Thinking long term say 2-3 years do you think i would benefit from my portfolio or i’ve takes some risks as a first time buyer.\n\n5 AMD\n2 GOOG\n5 AAPL\n10 BRK.B \n5 EA\n10 FB\n10 Intel\n20 MSFT\n5 PEP\n50 TWTR\n3 V\n15 DIS",
        "subreddit": "stocks",
        "title": "First time buying stocks",
        "url": "https://www.reddit.com/r/stocks/comments/gg2kep/first_time_buying_stocks/",
        "created": 1589003644.0
    },
    {
        "author": "esuuuu",
        "created_utc": 1589162234,
        "id": "ghej7m",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Amd is still quite high up currently i missed the opportunity to but when it was below $40 whats the buying point in your opinion?",
        "subreddit": "stocks",
        "title": "AMD",
        "url": "https://www.reddit.com/r/stocks/comments/ghej7m/amd/",
        "created": 1589191034.0
    },
    {
        "author": "laurynasnba",
        "created_utc": 1588708258,
        "id": "ge4pta",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Why did AMD stock drop 1.2% in the last 30 minutes?",
        "subreddit": "stocks",
        "title": "AMD stock",
        "url": "https://www.reddit.com/r/stocks/comments/ge4pta/amd_stock/",
        "created": 1588737058.0
    },
    {
        "author": "forgottenpassword182",
        "created_utc": 1589720242,
        "id": "glez0v",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "\nI wanted to see if WSB DD has any value, so I went through DD over the last quarter.\n\nTLDR: Small sample size. 12/19 posts were wrong, 7 were right or rightish.\n\nI searched for posts flaired DD over the last year sorted by upvotes, but due to the growth of the subreddit most examined posts are 2-3 months old. At first I searched only last 30 days, but there were not enough posts. I stopped looking at around 500 upvotes, below that is usually just news and shitposts.\n\nI tried to include only posts with clear positions, but I made some exceptions for posts with clear sentiment. I excluded positions still in play, low-effort posts and shitposts. I focused mainly on price at the expiration date, so some DD rated wrong could have been profitable if you sold early, although I tried to mention those posts. Posts are roughly sorted by upvotes.\n\nHere's breakdown of the posts I examined:\n\n**1)** https://ns.reddit.com/r/wallstreetbets/comments/fkpv5a/dd_5k_to_330k_in_3_weeks_ulta_is_my_next_move/\n\nDate posted: 3/18\n\nPositions: ULTA 4/17 $125 Put\n\nPrice the day of posting: $124 - $148\n\nResult: 4/17 $208 - $223\n\nVerdict: Wrong\n\n\n**2)** https://ns.reddit.com/r/wallstreetbets/comments/g4yxwg/the_people_that_made_the_most_money_during_the/\n\nDate posted: 4/21\n\nPositions: Already had VEEV 5/15 $190 calls \"and I plan to buy a few higher OTM calls with strikes later this year\" and TMO 6/16 $350 calls\n\nPrice the day of posting: VEEV $176; TMO $320\n\nResult: VEEV closed 5/15 at $200, TMO is at $375\n\nVerdict: VEEV call was correct, TMO call looks good although it is a month before expiry.\n\n\n**3)** https://ns.reddit.com/r/wallstreetbets/comments/gd01t7/serious_on_the_oil_demand_crisis_and_why_you/\n\nDate posted: 5/4\nPositions:\n\nLow Risk Position Examples\n\nEuroNav ($EURN) $12.50C 6/15\nScorpio Tankers ($STNG) $23C 6/15\n\nModerate Risk Positions\n\n$EURN $12.50C 5/15\n$STNG $25C 5/15\nHigher Risk Positions\n\n$EURN $15C 5/15\n$STNG $30C 5/15\n\nLegendary Autistic Risk Positions\n\n$EURN $17.50C 5/15\n$STNG $35C 5/15\n$NAT, any calls\n\nPrice the day of posting:\n\nNAT $5.92\nEURN $11.36 \nSTNG $23.25\n\nResults: \n\nNAT $5.03\nEURN $9.81\nSTNG $16.79\n\nVerdict: Wrong\n\n**4)** https://ns.reddit.com/r/wallstreetbets/comments/fh6u5p/dd_turned_5k_to_165k_in_3_weeks_heres_my_grand/\n   https://www.reddit.com/r/wallstreetbets/comments/fi03cg/dd_yes_you_can_buy_puts_on_zillow_z_right_now/?amp%253Butm_medium=ios_app&amp;amp%253Butm_name=iossmf\n\nDate posted: 3/12; 3/13\n\nPositions: Z 3/20 $35 Puts, 3/20 $45 Puts and 4/17 $40 Puts\n\nPrice the day of posting: $33 - $40\n\nResults: 3/20 $26 - $31; 4/17 $36\n\nVerdict: Correct\n\n**5)** https://ns.reddit.com/r/wallstreetbets/comments/fiieap/heres_what_a_bunch_of_you_bulls_and_america_as_a/\n\nDate posted: 3/14\n\nPositions: Late April/Early May puts\n\nPrice the day of posting: 3/13 SPY $250 - $272\n\nResults: SPY moving between $272 and $293 during the specified time.\n\nVerdict: Wrong\n\n**6)** https://ns.reddit.com/r/wallstreetbets/comments/g9h9np/an_indepth_look_into_the_next_few_weeks/\n\nDate posted: 4/28\n\nPrice the day of posting: SPY $285 - $290\n\nPositions: If we end this week &lt; 272, SPY 270p 5/15. If &gt; 293, the world has gone insane. Otherwise, selling short-dated iron condors, holding cash, or SPY 250p 8/21.\n\nVerdict: I am bored, not smart, so I don't know if short-dated iron poultry made money, but we were range bound between 272 and 293, so I would call that a success.\n\n**7)** https://ns.reddit.com/r/wallstreetbets/comments/fiwgq5/how_much_fuk_could_we_be_in_an_analysis_of/\n\nDate posted: 3/15\n\nPositions: SPY 4/17 $250 puts \n\nPrice the day of posting: 3/13 SPY $250 - $272\n\nResults: $286. SPY did hit $220 3/23, so you might have made money if you sold.\n\nVerdict: Wrong\n\n**8)** https://ns.reddit.com/r/wallstreetbets/comments/fmzsq6/dd_i_did_a_the_big_shortstyle_research_on_sbux/\n\nDate posted: 3/22\n\nPositions: $SBUX 4/17 50p, $SBUX 5/15 $40p\n\nPrice the day of posting: $58 - $65, basically the bottom\n\nResults: 4/17 $77, 5/15 $74.16\n\nVerdict: Wrong\n\n**9)** https://ns.reddit.com/r/wallstreetbets/comments/feqfb9/dd_crash_incoming_real_talk/\n\nDate posted: 3/7\n\nPositions: \"Grow some balls, make a basket of put options that short indexes and equities from impacted sectors, then go long on inversely correlates equities (ie hospital care providers).\"\n\nPrice the day of posting: SPY $298\n\nResults: 3/9 SPY at $270, bottom roughly $220 3/23\n\nVerdict: Correct\n\n**10)**  https://ns.reddit.com/r/wallstreetbets/comments/ft0khy/it_was_officially_a_bull_trap/\n\nDate posted: 4/1\n\nPositions: SPY 200p 4/17\n\nPrice the day of posting: SPY $242 - $257\n\nResults: $286\n\nVerdict: Wrong\n\n**11)**  https://ns.reddit.com/r/wallstreetbets/comments/fdi3co/coronavirus_not_priced_in/\n\nDate posted: 3/4\n\nPositions: 4/17 SPY 250p \n\nPrice the day of posting: SPY $312\n\nResults: $286\n\nVerdict: I'll say correct. OP basically told us to go short on the first lower high, so he deserves credit, but if you had diamond hands you got fucked.\n\n**12)**  https://ns.reddit.com/r/wallstreetbets/comments/fdli1p/if_youre_still_unsure_if_shit_is_about_to_hit_the/\n\nDate posted: 3/5\n\nPositions: SPY 280 P 04/17 + VIX 40 C 04/17\n\nPrice the day of posting: SPY $312\n\nResults: SPY 4/17 $286, VIX $38\n\nVerdict: Correct, again unless you were retarded you would have made money.\n\n**13)** https://ns.reddit.com/r/wallstreetbets/comments/fs2u3z/hitting_the_top_tomorrow/\n\nDate posted: 3/31\n\nPositions: SPY 250p 4/13\n\nPrice the day of posting: SPY $257\n\nResults: SPY $270 - $277\n\nVerdict: Wrong\n\n**14)** https://ns.reddit.com/r/wallstreetbets/comments/f5egjw/dd_amd_is_going_up_this_week/\n\nDate posted: 2/17\n\nPositions: AMD 02/28 - Calls $62, 03/27 - Calls $60-66\n\nPrice the day of posting: 2/14 $55\n\nResults: 2/28 $41 - $46, 03/27 $39 - $41\n\nVerdict: Wrong\n\n**15)** https://ns.reddit.com/r/wallstreetbets/comments/g8krsz/the_normie_playbook_a_terrifying_spy_update/\n\nDate posted: 4/26\n\nPositions: \"My belief is the coiled market makes a run to the top of the channel (284-287), and collapses on itself like a dying star, \nexploding out to the downside, back to test the low 260's.\"\n\nPrice the day of posting: 4/24 SPY $282\n\nVerdict: OP: \"4/30 @ 8:30 : The reality for me right now is I feel this play has failed. I've turned my focus to how do I exit it.\"\n\n**16)** https://ns.reddit.com/r/wallstreetbets/comments/g39mo4/gay_bears_the_drop_is_soon/\n\nDate posted: 4/17\n\nPositions: \"TL;DR: Stocks go Uppies to around 2934 and then will go downies from there.\"\n\nPrice the day of posting: SPY $286\n\nResults: We indeed went upsies roughly to 2934, then kinda slowly downsies.\n\nVerdict: Rightish. We didn't drop much and I wouldn't say soon, but othwerwise OP was right.\n\n**17)** https://ns.reddit.com/r/wallstreetbets/comments/g4xss1/netflix_q1_earnings_will_be_negative/\n\nDate posted: 4/20\n\nPositions: NFLX May 400p\n\nPrice the day of posting: $436\n\nResults: \"Update: NFXL stock up 8% after q1 earnings, I belong in this sub.\" 4/29 $400 was ATM, currently $454.\n\nVerdict: Wrong\n\n**18)** https://ns.reddit.com/r/wallstreetbets/comments/gdkvqf/dd_from_5254_zillow_next_leg_down_oil_reminder/\n\nDate posted: 5/4\nPositions: Z 5/15 puts\nPrice the day of posting: $42.65\nResults: $48.73\nVerdict: Wrong\n\n**19)** https://ns.reddit.com/r/wallstreetbets/comments/gcfb27/goodnight_lyft/\n\nDate posted: 5/3\n\nPositions: LYFT 25P 5/15\n\nPrice the day of posting: $29.54\n\nResults: $28.15, was ATM on 5/6\n\nVerdict: Wrong",
        "subreddit": "wallstreetbets",
        "title": "DD on WSB DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/glez0v/dd_on_wsb_dd/",
        "created": 1589749042.0
    },
    {
        "author": "souptrades",
        "created_utc": 1589294359,
        "id": "gicfph",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hey all, \n\nI have $200 and am looking to put it into something (or a few things) that are a little more stable than penny stocks. Sort of tired of the rollercoaster of putting $100 into a $0.60 stock. \n\nWas thinking DIS or MSFT but unsure. \n\nAlready have small positions in SE, FSLY, NET, PINS, UBER, DKNG, PENN, AMD, and just cashed out of SDC (Hence the $200)",
        "subreddit": "stocks",
        "title": "Non-penny Investments",
        "url": "https://www.reddit.com/r/stocks/comments/gicfph/nonpenny_investments/",
        "created": 1589323159.0
    },
    {
        "author": "Liquid_Padpo",
        "created_utc": 1588736144,
        "id": "gecit8",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "When I was 15 a few years ago I told my dad I wanted to give him money to put in stocks so I threw down roughly $300 on AMD and now I was finally old enough to have it transferred",
        "url": "https://i.redd.it/pgctb71qe2x41.jpg",
        "created": 1588764944.0
    },
    {
        "author": "Gogols_Nose",
        "created_utc": 1589988112,
        "id": "gnda7b",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "AMD 45p 6/19",
        "subreddit": "wallstreetbets",
        "title": "Just remember, \"options\" is only one letter off from \"opium\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gnda7b/just_remember_options_is_only_one_letter_off_from/",
        "created": 1590016912.0
    },
    {
        "author": "TheBeardedBeast97",
        "created_utc": 1590019308,
        "id": "gnm5i8",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Which one do you think is a better investment? Debating on which one to buy and hold long term on.",
        "subreddit": "stocks",
        "title": "$INTC or $AMD",
        "url": "https://www.reddit.com/r/stocks/comments/gnm5i8/intc_or_amd/",
        "created": 1590048108.0
    },
    {
        "author": "SDuckworth12",
        "created_utc": 1588347126,
        "id": "gbk9hu",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Curious if y’all think today is a good entry point for these two stocks?",
        "subreddit": "stocks",
        "title": "AMD &amp; RTX",
        "url": "https://www.reddit.com/r/stocks/comments/gbk9hu/amd_rtx/",
        "created": 1588375926.0
    },
    {
        "author": "scouting4food",
        "created_utc": 1589102735,
        "id": "ggydis",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I went about 50% cash (sold $AMD and $V positions - ridiculous in hindsight) in the hope of buying back at a lower dip, but I'm currently in a bit of a limbo with the market storming upwards. I know there have been multiple discussions on another market crash, but is anyone *realistically* waiting in hope of a second crash? Or have you given up and bought back in?",
        "subreddit": "stocks",
        "title": "Those who went cash-heavy when the virus started to spread - have you given up on hope for a dip? What's your game plan?",
        "url": "https://www.reddit.com/r/stocks/comments/ggydis/those_who_went_cashheavy_when_the_virus_started/",
        "created": 1589131535.0
    },
    {
        "author": "private_pepper",
        "created_utc": 1588879149,
        "id": "gfd5vo",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "So,  I am begginer in stock market and couple days ago I bought 3 AMD stocks for 52.66 , and when i bought it , stock price started falling, should i sell it or keep it? Maybe someone could give me some advices about stock marktet too?:)",
        "subreddit": "stocks",
        "title": "AMD",
        "url": "https://www.reddit.com/r/stocks/comments/gfd5vo/amd/",
        "created": 1588907949.0
    },
    {
        "author": "MajinJuuu",
        "created_utc": 1590100571,
        "id": "go6y1f",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I fully expect they will crush earnings tomorrow, but I do plan on selling off my holdings due to the political climate right now. With Trump in office, pushing Anti-China, and now this Senate bill to delist Chinese companies, I think now would be a better time than any.\n\nAnyone else have opinions for where I should drop 2k or so? \n\nIm big on tech, my portfolio right now is:\n\n* VTI 22%\n* MSFT 11%\n* BTC 11%\n* V 12%\n* DIS 7%\n* AMD 6%\n* SQ 4%\n* GOOG 4%\n* DKNG 2%\n* BABA 3%\n* XOM 3%\n* JNJ 2%\n* SBUX 2%\n* TSLA 0.5%",
        "subreddit": "stocks",
        "title": "Pulling out of BABA... could use some help.",
        "url": "https://www.reddit.com/r/stocks/comments/go6y1f/pulling_out_of_baba_could_use_some_help/",
        "created": 1590129371.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1588682128,
        "id": "gdwxo6",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Good Morning, Here's My Watch List\n\nGap Ups: ADVM, AKBA, AMD, BYND, CHGG, FANG, REGN, SBGX, TGTX, TREX, W, XPO\n\nGap Downs: FIVN\n\n&amp;#x200B;\n\nSPY gapping up slightly after testing the 20 day moving average and giving bulls exactly what they want to see. Nice hold of short term support levels and room for price to move until the 200 dailly oving average which is at 300. Price action was good yesterday and there were quite a few of the Gap Down ORB setup's which I mentioned in the video last week. RCL, UAL, BA were some of the stocks that gave this setup yesterday. Business as usual for active day traders. Only trade the best setups with stop and targets calculated before entering trades will help keep emotions out of the equation and help to avoid big losses. Good luck trading today",
        "subreddit": "StockMarket",
        "title": "Stock Watch List May 5, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/gdwxo6/stock_watch_list_may_5_2020/",
        "created": 1588710928.0
    },
    {
        "author": "F-Severn",
        "created_utc": 1589920893,
        "id": "gmwtvh",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I am a very new investor. Currently I am reading “The Intelligent Investor” and trying to learn more about long term growth investing. I know everyone recommends to diversify, but this confuses me a little bit. Why wouldn’t I balance my portfolio with half and S&amp;P500 index fund and the other half consisting of major tech stocks that in reality are too big to fail. Microsoft isn’t a bank with crappy management. They are a company that makes strong stable decisions (Azure cloud computing). AMD is a company that is booming right now and honestly they don’t seem poised to fail. AMD supplies the chips for both the Xbox and PS5. That is a very big feat and it is estimated that over 1/3 the US population has a gaming console. Why wouldn’t I just put my money into strong companies like Microsoft, Google, Advanced Micro Devices, Amazon. I honestly don’t think the market will see another “dot com” crash as the world is continuously becoming more and more technology dependent.",
        "subreddit": "investing",
        "title": "Diversification Question?",
        "url": "https://www.reddit.com/r/investing/comments/gmwtvh/diversification_question/",
        "created": 1589949693.0
    },
    {
        "author": "Rob22sd",
        "created_utc": 1590251361,
        "id": "gp7u48",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "My entry into AMD was $2.25. So far I’m up 1,400 percent. Do you think AMD has the growth potential like NVIDIA has? AMD has a wonderful CEO.",
        "subreddit": "investing",
        "title": "Stock Pick of the Day",
        "url": "https://www.reddit.com/r/investing/comments/gp7u48/stock_pick_of_the_day/",
        "created": 1590280161.0
    },
    {
        "author": "Feeling_Sheltered",
        "created_utc": 1589255992,
        "id": "gi3mfj",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I am thinking of dividing my money into 3 groups -\n\n50% split into 4 stocks, so 12.5% into\nVisa (V)\nMicrosoft (MSFT)\nAmazon (AMZN)\nGoogle (GOOG)\n\nAnother 30% into 3 stocks, so 10% into\nDisney (DIS)\nBoeing (BA)\nActivision (ATVI)\n\nAnd the final 20% into 3 stocks, so about 6% into\nCloudflare (NET)\nExact Science (EXAS)\nDraft Kings (DKNG)\n\nI’m willing to take out some to have a higher percentage of others and/or replace stocks with other companies.\n\nOne company I’d consider adding or taking out others for is AMD. \n\nI also like Apple and NVDA but feel that I may have missed the boat on that.\n\nI’m aiming for a mix of safer options and a few riskier plays with growth potential.\n\nI’d like to hold long but would consider getting out and re-entering if things go up and there is a crash looming that is noticeable beforehand.",
        "subreddit": "stocks",
        "title": "30 year old - what do you think of my stock picks?",
        "url": "https://www.reddit.com/r/stocks/comments/gi3mfj/30_year_old_what_do_you_think_of_my_stock_picks/",
        "created": 1589284792.0
    },
    {
        "author": "verbotenh",
        "created_utc": 1589622202,
        "id": "gks15v",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Intel is to release GPU this year. They are to officially enter the discrete GPU business. This will compress margins on amd and nvda. \n\nAmd is getting competitve against intel in CPU, esepcially with Zen 3 coming out. So intel's getting killed there as well. But in return AMD's gpu business, which despite the quality being much weaker than nvidia, still comprise 50% of the revenue, is about to be challenged by intel.\n\nAll 3 are threatend by cloud gaming as well, and perhaps cloud computing in the future. Cloud gaming will reduce PC/latop upgrade cycle even further. A 10 year old PC can run games flawlessly on Stadia and Geforce Now. Many people who otherwise would upgrade their PC now just purcahse cloud gaming subscription. cloud gaming seem to be growing extremely fast. \n\nNvidia do have the foresight so they set up GFN on their own. But it cannabilises its own GPU business. Better than let a competitor do it to Nvidia, but still not ideal. \n\nand then ARM is to threaten both intel and amd cpus. it soon will be good enough for general computing and it has lower power and cheaper to make. And combined with the trend of cloud computing it's esepcially deadly. With cloud gaming, you can easily play AAA games with demanding graphics settings in a browser, with a PC or mobile device powered only by ARM CPUs.  \n\nI just dont see good growth oppotunity for these 3 stocks in the near future. both amd and nvda have fat growth premium, how long will that last? intc is also going nowhere due to cpu market getting challenged.",
        "subreddit": "stocks",
        "title": "Semis (AMD, INTC, NVDA) race to the bottom?",
        "url": "https://www.reddit.com/r/stocks/comments/gks15v/semis_amd_intc_nvda_race_to_the_bottom/",
        "created": 1589651002.0
    },
    {
        "author": "lyokowarri0r",
        "created_utc": 1589811660,
        "id": "gm2btk",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "So let's say I buy AMD in my Roth account for $50. If I set a limit sell order for $100, and set a limit buy for $100 in my Robinhood account, wouldn't that essentially be me transfering $50 to my Roth? Would this count as a contribution? Is this a workaround the 6k limit?\n\nAlso couldn't I sell that same AMD stock in my Robinhood for $50 and take a capital loss for a tax benefit?\n\nThis seems to good to be true but I'm having a hard time finding info in this.",
        "subreddit": "investing",
        "title": "Can I sell stock from a Roth above the current price and buy from an other broker to indirectly fund the Roth?",
        "url": "https://www.reddit.com/r/investing/comments/gm2btk/can_i_sell_stock_from_a_roth_above_the_current/",
        "created": 1589840460.0
    },
    {
        "author": "rdputra12",
        "created_utc": 1589126230,
        "id": "gh3zit",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Does anybody know the mechanism on how to buy foreign stocks? I'm interested in building a portofolio and AMD stocks is where I start. Thank You",
        "subreddit": "stocks",
        "title": "AMD Stocks",
        "url": "https://www.reddit.com/r/stocks/comments/gh3zit/amd_stocks/",
        "created": 1589155030.0
    },
    {
        "author": "Shaun80",
        "created_utc": 1589414101,
        "id": "gjay9q",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "   \n\n\n# Tech portfolio thoughts\n\nCurrent portfolio tech heavy long term holding QQQ and VGT for a few years added FDN during the March dip and  XNTK just recently\n\n30 percent FDN - AMZN , FB, NFLX, GOOG\n\n30 percent VGT APPL, MSFT, V, MA\n\n30 percent QQQ Mix of VGT and FDN\n\n10 percent XNTK Growth tech stocks SHOP, TSLA , AMD, NVIDIA etc\n\nHolding long term there is a little overlap between ETF holdings with QQQ but the others are relatively unique. Overall Mer is around 0.28. Thoughts",
        "subreddit": "stocks",
        "title": "Tech ETF Portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/gjay9q/tech_etf_portfolio/",
        "created": 1589442901.0
    },
    {
        "author": "DaScheuer",
        "created_utc": 1590096696,
        "id": "go5rje",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Moderate knowledge of stocks here.\n\nI'm always confused by the affirmation that a stock is overvalued or undervalued. I understand that the P/E ratio could be very high at a certain moment, but if we consider the subjective theory of value, shouldn't the information that a stock is either, immediately move the price up or down?\n\nNot only for stock, but if you know something is overvalued, why would you buy it? If we follow the logic of not buying when it's overvalued and not selling when it's undervalued, whouldn't we be in a natural equilibrium point all the time given the frequency at which stocks are traded?\n\nPS.: this is coming from someone who owns AMD and NVDA stocks lol.",
        "subreddit": "stocks",
        "title": "Why do we buy overvalued stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/go5rje/why_do_we_buy_overvalued_stocks/",
        "created": 1590125496.0
    },
    {
        "author": "tigerplane",
        "created_utc": 1588710624,
        "id": "ge5i0y",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "\nI’m 18 years old and I was looking for some tips on my portfolio. \n\nQQQ-33%\nVOO-16%\nVTI-8%\nIWM-8%\nXLV-6%\nXLK-5%\nMSFT-5%\nAMD-4%\nJNJ-4%\nXLE-4%\nXLF-2%\n\nI’m most concerned with growth in my situation. Any key pickups... or something I should drop?",
        "subreddit": "StockMarket",
        "title": "18 yo, Portfolio advice",
        "url": "https://www.reddit.com/r/StockMarket/comments/ge5i0y/18_yo_portfolio_advice/",
        "created": 1588739424.0
    },
    {
        "author": "DefectiveReptile",
        "created_utc": 1589607180,
        "id": "gkpcqm",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I recently started trading options with TOS and am finding it hard to close my put spreads.  Not one-off either, i have 2 spreads open on 2 different stocks (AMD and TSLA). \n\nSold a TSLA 720/725 put spread for a credit earlier this week and  set up a  GTC order with a limit price ($1.60) right away. The \"Mark\" has dropped at times at least 15 cents lower than my limit price  in the past 2 days but my order to close does not get fulfilled. Same thing with the AMD spread.\n\nIs this  a known risk or am i going about it the wrong way in trying to close it?",
        "subreddit": "options",
        "title": "Closing a Vertical Spread - Order not being fulfilled (TOS)",
        "url": "https://www.reddit.com/r/options/comments/gkpcqm/closing_a_vertical_spread_order_not_being/",
        "created": 1589635980.0
    },
    {
        "author": "MajinJuuu",
        "created_utc": 1590156211,
        "id": "gojx2h",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Just pulled out of BABA... might be a mistake long term, but with Trump in office, this global Anti-China sentiment, and now this Senate bill to delist Chinese companies, I decided to lock in small profits for the time being\n\nAnyone else have opinions for where I should drop 2k or so? I was considering MGM under $15 perhaps.\n\nIm big on tech, my portfolio right now is:\n\n* VTI 22%\n* MSFT 11%\n* BTC 11%\n* V 12%\n* DIS 7%\n* AMD 6%\n* SQ 4%\n* GOOG 4%\n* DKNG 2%\n* BABA was around 3%\n* XOM 3%\n* JNJ 2%\n* SBUX 2%\n* TSLA 0.5%\n\nIf not MGM, anyone else have a good long term (10-15 years or so) hold? Should I just reinvest in my current portfolio?",
        "subreddit": "stocks",
        "title": "BABA profits into MGM @ 15?",
        "url": "https://www.reddit.com/r/stocks/comments/gojx2h/baba_profits_into_mgm_15/",
        "created": 1590185011.0
    },
    {
        "author": "BlueSkyPilot",
        "created_utc": 1588964533,
        "id": "gfz9qy",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Can I join your gay ass club now? Positions: F 5p 5/15 SPY 267p 5/29 AMD 34p 7/17",
        "url": "https://i.redd.it/yki20r8a9lx41.jpg",
        "created": 1588993333.0
    },
    {
        "author": "Jburd6523",
        "created_utc": 1588369624,
        "id": "gbr5ln",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I do write ups through out the week of current new and events affecting the market and trends. I summarize from multiple sources, if there's any glaring errors blame CNBC and Bloomberg.   \n\n\n**04/26 Bank Of Japan Stimulus -** The bank of Japan (BOJ) will be having a meeting 04/26 to discuss further stimulus for the Japanese economy and is expected to remove buying limits of government bonds, and increase purchases of commercial and corporate debt. Though it should be noted that Japanese corporations are considered to be better positioned to weather the shut down, compared to corporations in other countries. This is due in large part to the high amount of cash reserves Japanese corporations keep on hand. It is currently estimated that Japanese corporations have $4.8 trillion of cash in their reserves. This places them in an excellent position to not only maintain operations, but also make future financial investments during this downturn. In addition, a record amount of publicly traded companies have chosen to suspend dividend payments until the economy reopens. A loan program is said to be on the table as well for companies who are struggling with cash flow.\n\n**04/26 Deficit and Spending**\\- The US budget deficit is expected to increase to 3.7trillion for this period as US spending rises fighting the coronavirus while the economy contracts. The previously projected budget deficit for 2020 was 1.083 trillion. Since the start of the lockdowns in the US, GDP is believed to have contracted 3.9% for the first quarter and possibly as much as 40% for the second quarter.\n\nSteve Mnuchin on Sunday stated that we were “In a War” and that “Everything that needs to be done to support the economy will be done”. He was encouraged by the fact that interest rates remain low between 0-.25% in the US, and believes that the US economy will “...really bounce back in July, August, and September.”\n\nMany economists remain concerned about the rising level of US debt, as treasury bond rates remain at record lows, worried that investor interest may wane on Treasury bonds. The current rate on the 10 year yield is .6%, 4X lower than it was a year ago when the yield was at 2.5%. Although, there has been an uptick in foreign interest for US Treasury bonds throughout Europe and Japan as they have seen their interest rates drop to negative levels. China is currently the largest buyer of US treasury bonds, and owns the largest amount of US debt measured at approximately 5%(1.07 Trillion). Under negative interest rates, people and businesses would actually have to pay the banks to store their money rather than make any passive income from interest payments.\n\nEven before Covid19 shut down the US economy, massive spending has been a concern for many economists, as our spending has far outpaced economic growth since the last recession. Post 2009 Federal spending was kept between 2-3% as to not outpace the growth of the economy. During the Great Recession, spending on economic stimulus and overseas wars caused US spending to balloon to 24% of GDP, greatly adding to our debt at a much faster rate than previously. After the Great Recession spending was never reduced back to previous levels, instead the government began withdrawing funding from government funded organizations such as the military and medicare. A practice known as sequestering.\n\nIt’s impossible to know the full range of consequences that the US will face due to its additional massive spending combating Covid19 but it is generally agreed upon that eventually taxes will have to increase, and the US may face the possibility of another credit downgrade if our debt remains unchecked.  The US saw its first credit downgrade two years after the end of the Great Recession in 2011.\n\n\\----------------------------------------------------------------------------------------------------------------------------------------\n\n04/27  **Oil Markets -** Oil had a rough Monday to start off the week. At the time of this writing June contracts for WTI are down 23% and trading at $13 a barrel. The popular oil index USO is also down 15% trading at $2.17. The two seem to be correlated as USO announces that they have begun offloading their June contracts out of fear those contracts would turn negative. The CME futures exchange has begun regulating the amount of contracts USO will be allowed to hold, warning them not to exceed their limits. This was done in an effort to prevent large unnecessary swings in the price of oil that do not reflect market conditions. Despite regulations supply still outpaces demand, and storage is also becoming an increasing worry for the oil producers. It is estimated about 85% of the world oils reserves are full at the moment. Producers are trying to come up with storage solutions by storing oil on tankers and possibly in pipelines as storage space disappears.\n\n\\----------------------------------------------------------------------------------------------------------------------------------------\n\n04/28 **Food Chain and Earnings** \\- Trump intends to use the defense production act to keep food processing plants open to prevent disruptions in the food supply chain. Many processing plants have shut down, threatening to reduce the US meat processing capacity by 80%.\n\nA flood of loan applications continues to crash the SBA website as bankers attempt to submit many applications on behalf of their clients. After the initial $342 billion was loaned out in less than 2 weeks, an additional $310 billion was approved by congress to loan out to small businesses who were unable to receive aid during the first round of loans. It is predicted that the SBA will quickly loan out the additional $310 billion as well.\n\n$GOOG beat on revenue causing their share price to jump around 8% during AH to above despite seeing a decrease in their ad revenue. $F reported a loss of 2 Billion for the previous quarter and predicted rough times ahead for the auto-industry. Shares fell greater than 5% during AH. AMD, SBUX also reported earnings during after market close and were trading lower during the after hours session.\n\n$UBER announced after the market closed that they were planning on laying off 20% of their workforce. This is a little bit of speculation here, but I’d imagine California, New York, and Las Vegas all contribute greatly to Uber's revenue. Seeing how New York and California have extended lock downs throughout May, and Las Vegas workers do not feel safe returning to work despite the mayor pushing them to do so, Ubers main markets have been hit the hardest and will be closed the longest giving Uber a very bleak outlook.\n\n\\----------------------------------------------------------------------------------------------------------------------------------------\n\n04/29 **Gilead &amp; The Fed -** Gilead was halted during pre-market trading hours while they made an announcement that their target goal had been achieved during their patient study for the drug remedesivir. This was a study including over a 1000 patients in multiple countries that showed patients on the drug recovered faster than those in the placebo group. Trump is now looking to the FDA to fast track the approval of the drug. $GILD ended the trading day 5% higher at $83.\n\nJerome Powell announced that the Fed will be keeping interest rates unchanged at 0-.25% and stated that interest rates will remain unchanged until he is confident the economy is nursed back to health. He stated that “Q2 economic numbers will be the worst we’ve seen in history” and it will be a long recovery back to pre-covid 19 levels.\n\nMSFT, TSLA, FB all reported positive earnings after the bell causing their stock price to rise during after hours trading.\n\n\\----------------------------------------------------------------------------------------------------------------------------------------\n\n04/30 **Unemployment &amp; PMI** \\- Unemployment numbers were reported to be at 3.83M which is a decline from the previous reported number last week, bringing the total number of unemployed to above 30 million. The highest unemployment number reported thus far was 6.87 for the last week of March 28th, and has been in decline every week since. Chicago announced a PMI of 35.4 which was their lowest PMI number since 2009. The 10 year treasury note is trending downward back towards its all time low of .54%\n\n\\----------------------------------------------------------------------------------------------------------------------------------------\n\n04/30 **Trump &amp; China -** Trump has stepped up his blame against China for the Corona Virus saying that they will face consequences for the damage it has caused. It is reported that possible sanctions, cancelling of US debt obligations, and new trade agreements were all being considered. This could potentially shake up investor confidence in a market that had previously rallied off of a trade agreement between the US and China earlier in the year.\n\nUS intelligence agencies are currently trying to determine if the virus had actually originated from the Wuhan Virology Center, and not the wet markets as China claims. Epidemiologist have thus far been unable to trace the virus back to a wet market adding to the suspicion that it was spread by an infected employee at the lab. Although it is important to note that scientists had determined Covid 19 was not man made, nor was it altered in a lab, often viruses are merely studied in Virology centers. Australia has also called out China and is asking for transparency and cooperation from the nation to determine the origins of the virus. China has responded by telling Australia they will “reduce economic cooperation with Australia” if they continue to mount pressure against China.\n\nIn regards to repercussions against China, Mike Pompeo said “Timing is important.” Due to the fragile state of both economies, China could harm the US economy just as easily as we could harm theirs. In addition, the US &amp; China have been sharing resources such as ventilators, testing equipment, and personal protective gear in an effort to regain control and fight Covid 19.\n\nAdding another layer of uncertainty to the world, Kim Jong-Un has yet to be seen since April 11th and many unconfirmed reports have come out about his health and possible location. There is some belief that Kim suffered a heart attack and is currently in a vegitative state and reports that Chinese medical team was dispatched to North Korea at some point during April. Other theories point to the leader simply being at one of his resorts likely hiding away from the public until the Covid 19 crisis is over. Although there has yet to be a single reported case of Covid 19 in North Korea.\n\n \\----------------------------------------------------------------------------------------------------------------------------------------\n\n05/01 **Elon, Fannie Mae, PMI Oh My -** “Sell in May and Go Away” proved true for the first of the month, as stocks sold off particularly hard due to reignited fears of Trump imposing tariffs on trade with China. Heading into the last hours of trading, all indexes are lower by greater than 2% with the Nasdaq down greater than 3%. PMI data for the month of April was also released this morning, ISM PMI was reported to be at 41.5 which is a decrease from March (49.1) indicating a further contraction of the economy. \n\nIn the mortgage market, there are about 3.8million mortgages in forbearance which accounts for nearly 8% of all US mortgages. This is equivalent to about 841 billion in unpaid principal. Fannie May believes this number could double in the coming months if the economy does not reopen and unemployment continues to rise. Out of all the Mortgage lenders, the Federal housing and Veterans administration had the highest level of homes in forbearance (10%) which doesn’t come as too much of a shock as they offer loans to individuals with low credit scores and allow them to place a smaller down payment.\n\nAfter the market closed, the FDA granted emergency use authorization for the use of Remdesivir to treat Covid19 patients. Gilead has had a wild ride over the past two weeks due to conflicting information in their patient test trials, yet the general consensus at the moment is that Remdesivir has an obvious beneficial effects in treating Covid patients. \n\nJCrew joins the list of the companies expected to file for bankruptcy, and analysts believe many more bankruptcies will be on the way once liquidity starts drying up for more companies. TSLA which reported better than expected earnings this week, is obviously not going bankrupt, yet Elon oddly seemed to think their stock was over performing. After making comments today that the price of TSLA stock was too high, TSLA dropped from roughly $760 to a low of $686 before closing the day at $701 per share. For once, Elon seems to be on the side of the short sellers.",
        "subreddit": "wallstreetbets",
        "title": "This Weeks Market News &amp; Events (04/26-05/01)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbr5ln/this_weeks_market_news_events_04260501/",
        "created": 1588398424.0
    },
    {
        "author": "stewie0107",
        "created_utc": 1589215413,
        "id": "ghr5of",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hi. I’m 18 and recently got into stocks. I’ve tried to find stocks to cover many fields like tech, food, oil and still need to find some good non us Etfs since they are not allowed in my country. These are currently stocks I own and on my watchlist. What are you thoughts considering I’m in long term of course. And recommendations on stocks to cover gold, 5g technology and like energy would be appreciated.\n\nMSFT, AMD, APPLE, VISA, MCDONALDS, COCA COLA, EXXON, DUTCH SHELL, DELTA, DISNEY.",
        "subreddit": "stocks",
        "title": "My stocks at 18. Thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/ghr5of/my_stocks_at_18_thoughts/",
        "created": 1589244213.0
    },
    {
        "author": "just_eat_my_ass",
        "created_utc": 1589949623,
        "id": "gn4t0z",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Suppose I wanted to sell one simple cash covered AMD $50 put expiring on 5/22. Do you have to wait until exp to get your gains? Not exactly sure how selling puts works because I’ve always bought. Any explanation appreciated. Thanks!",
        "subreddit": "options",
        "title": "Question about selling a put",
        "url": "https://www.reddit.com/r/options/comments/gn4t0z/question_about_selling_a_put/",
        "created": 1589978423.0
    },
    {
        "author": "Yssrmw",
        "created_utc": 1589559892,
        "id": "gkc9r5",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD Q4 to the roof",
        "url": "https://v.redd.it/3l4lhksjfyy41",
        "created": 1589588692.0
    },
    {
        "author": "Mudkipsforall",
        "created_utc": 1589997144,
        "id": "gng60c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I'd like to get your temp and point of view on Intel and AMD. On one hand it seems Intel has the industrial side of the market while AMD is gaining ground with consumers. It is also important to note that intel has the prestige and balance sheet that should weather a longer storm if AMD continues to take market share. I want to hear your opinions and just intrested in your take.\n\nThanks,",
        "subreddit": "stocks",
        "title": "AMD VS INTC",
        "url": "https://www.reddit.com/r/stocks/comments/gng60c/amd_vs_intc/",
        "created": 1590025944.0
    },
    {
        "author": "mariodolphins1010",
        "created_utc": 1588786893,
        "id": "geonlw",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " \n\nJust started reading up on stocks last week and im looking to invest 5k. My goal is to let everything sit a few years and not focus on selling.\n\nI put together a list of stocks and I have dont know what percentage to buy of each. Any info or opinions would be greatly appreciated.\n\nhere is a list of what im interested in.\n\nService now\n\nRing central\n\nAdobe\n\nAlgonquin Power &amp; Utilities Corp\n\nBrookfield Property Partners\n\nKirkland gold\n\nPower corp of Canada\n\nNvidia\n\nAMD\n\nMicrosoft\n\nAmazon\n\nVisa\n\nMastercard\n\nCnq\n\nSuncor\n\ncibc\n\nTD Bank",
        "subreddit": "stocks",
        "title": "potentially wanting to invest",
        "url": "https://www.reddit.com/r/stocks/comments/geonlw/potentially_wanting_to_invest/",
        "created": 1588815693.0
    },
    {
        "author": "CD_Johanna",
        "created_utc": 1589561266,
        "id": "gkcpbr",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "This is really leading to paralysis. I have a belief that cloud computing will perform very well over the next 10 years. But I'm very daunted at building a portfolio around this.\n\nI recently bought a small number of shares of the below stocks:\n\nAMD, Amazon, Arista, DataDog, Five9, Google, IBM, Intel, Microsoft, Nvidia, and Twilio\n\nSome things I'm struggling with:\n\n1. Weighting of each stock by %. \n2. When I have more money to contribute to these stocks, which ones should I boost up (leads to 1.)\n3. Should I add more companies and expand my list to 20 stocks? It gets very hard to keep track of.\n\nThere's so many other cloud computing and technology companies. There are a good 30 cloud computing stocks I know of.\n\nThere's also ETF's that take care of these issues for me, but I get hung up on their expense ratios, and then also which one to pick. There's broad technology like IGM, ITEC, VGT, QQQ, etc. \n\nBut then there's also cloud specific ones like SKYY, CLOU, WCLD, IVES. These have higher expense ratios than overall tech.\n\nAny tips for getting over my paralysis?",
        "subreddit": "investing",
        "title": "Feeling paralyzed about which cloud/technology ETF's or individual stocks to buy.",
        "url": "https://www.reddit.com/r/investing/comments/gkcpbr/feeling_paralyzed_about_which_cloudtechnology/",
        "created": 1589590066.0
    },
    {
        "author": "wives_boyfriend",
        "created_utc": 1590044081,
        "id": "gnry1m",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Whenever looking at the options spreads on TOS compared to say Fidelity Active Trader Pro TOS always seems to lack at least 1-2 seconds for me. Is there something wrong in my TOS settings?\n\nI have a trading computer (128GB RAM 2 TB HD top AMD chip excellent graphics card etc etc) and I have 400 speed internet wired in... \n\n&amp;#x200B;\n\nIs there something  I need to do on TOS or is it truly a little laggy these days?\n\nIt sucks trying to execute an option trade to already be 5-10 cents the other direction or even in the right direction. .",
        "subreddit": "options",
        "title": "Has Anyone Noticed that Think or Swim Seems to Be Delayed 1-2 Seconds on Options Spreads?",
        "url": "https://www.reddit.com/r/options/comments/gnry1m/has_anyone_noticed_that_think_or_swim_seems_to_be/",
        "created": 1590072881.0
    },
    {
        "author": "zephead98",
        "created_utc": 1589558579,
        "id": "gkbuuu",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "What's your favorite \"day trade\" stock?  This is a stock you can buy any day, and it will usually fluctuate a buck or two, EVERY day.   Not a long term gainer, or (hopefully) a long term loser, just a stock that is volatile enough that it moves a dollar or two every day.  And I like to keep the cost of the stock under $100  \n\n\nSome of my favorites:\n\nQCOM - Lots of movement, ATROCIOUS amount of debt, but stable business plan.  \nAMD - Still think INTC will kill it some day (again), but for now, it's a great play.  Sometimes you might have to wait a week or two to make your buck, but it usually comes right back.  \nCSCO - Have to be careful, I feel like they are overmilking their main business and huge danger could be ahead.  For now, it's a good fit here.  \nMO - Great stock, great dividends, nice momentum, though lately it's been a lot of down momentum.\n\nAny others you like to trade almost every day?",
        "subreddit": "stocks",
        "title": "Your Favorite Day Trade Stock",
        "url": "https://www.reddit.com/r/stocks/comments/gkbuuu/your_favorite_day_trade_stock/",
        "created": 1589587379.0
    },
    {
        "author": "TeenaCrossno",
        "created_utc": 1589833143,
        "id": "gm9agz",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "South Korea Bought AT&amp;T, GE and AMD Stock. It Also Scooped Up One Marijuana Stock (ACB Squeeze)",
        "url": "https://www.barrons.com/amp/articles/south-korea-bought-att-ge-amd-marijuana-stock-aurora-cannabis-51589478152",
        "created": 1589861943.0
    },
    {
        "author": "mightylfc",
        "created_utc": 1589863082,
        "id": "gmhsoo",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Young newbie investor trying a no-ETF, aggressive growth portfolio with my $20k savings.. Time horizon is 1-2 years or longer. How does this look? Looking to get rid of one of these 11 so that I have a 10%-a-piece portfolio. Which one should I get rid of?\n\n9.1% SE\n\n9.1% ENPH\n\n9.1% TDOC\n\n9.1% DXCM\n\n9.1% WST\n\n9.1% FTNT\n\n9.1% RNG\n\n9.1% TTD\n\n9.1% AMD\n\n9.1% DRD (Gold)\n\n9.1% SILV (Silver)",
        "subreddit": "stocks",
        "title": "Pure stock portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/gmhsoo/pure_stock_portfolio/",
        "created": 1589891882.0
    },
    {
        "author": "Michealchiv",
        "created_utc": 1588704010,
        "id": "ge3fc5",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Doesn't a possible looming recession put AMD at a huge risk? It doesn't really function as well as some of the cycle independent or cycle sturdy \"tech\" stock, it's pretty pro cyclical so even if it doesn't happen today or tomorrow, if it occurs in the next 2 years a recession could crush AMD's share price and sales right?\n\nAt least the past 3 recessions would suggest a massive decline is imminent, assuming a recession is likely (if)\n\nI read an article stating that it's more recession robust than intel or nvidia though so I guess if you're confident on no recession AMD and want a micro device stock then AMD is the pick. That said my outlook is not so positive and I just wanted to see some outside opinion.\n\nTl;dr AMD could drop to like $10 if there's a recession?",
        "subreddit": "stocks",
        "title": "AMD",
        "url": "https://www.reddit.com/r/stocks/comments/ge3fc5/amd/",
        "created": 1588732810.0
    },
    {
        "author": "EXLR8_Reddit",
        "created_utc": 1589765385,
        "id": "glrwvm",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Aloha fellow autists, for those already looking for positions, TL;DR will be at the end of the ~~post~~ wall of text; but before getting to positions I would like to lay forth my Med-LT projections for the course of the S&amp;P 500/NASDAQ &amp; approximations of what I believe to be as a 'healthy bottom' in the markets following the global deleveraging which is currently underway. \n\n\\*Note- I won't be diving very deep into the fundamentals in this post for the sake of trimming fat off of the data &amp; analysis; but for those interested in my PoV of the fundamentals which I build my projections on, reference this post/give it a quick read - [Economic Stagflation, Financial Corruption, Dying Industries, and a Need to Revolutionize](https://www.reddit.com/r/investing/comments/fvjlin/economic_stagnation_financial_corruption_dying/).\\*\n\n**Scope of Long-Term Projections (S&amp;P/NASDAQ)**\n\nFirst, to present the scope of my S&amp;P projection. First [the monthly chart](https://gyazo.com/f3e617e61dfa22c6761d0d679339fb52), then a [Daily Chart](https://gyazo.com/c268b3d7c1f7d80d436b7e5a6a1cdfdc) of a 1-0 fib-retracement back down to the highs of the 2000 dotcom bubble &amp; 2007 GFC. The 1 level (peak price) was put in place under the notion that major investor confidence had peaked in US markets the week of Jan 17th's opening price of \\~3335 at the start of this 'corona-virus black-swan event'/as the first case had been reported in the US via mainstream media, and with the belief we will be finding a true bottom around the highs of the 2000 'dotcom bubble' (\\~1555 on the S&amp;P.)\n\n\\*Note, these projections coincide with the parameters of 'Economic Stagnation' which I talk about in my 'fundamentals' post. To briefly outline a major point in the post, acknowledging that we find the genuine basis of a secular bull markets around the peak of our last run when forced into genuine innovation to produce economic productivity (While also respecting the reality that fiscal policies can/will send us into over-reactionary runs in either direction - IE: 2029 High following the roaring 20's, the following Great Depression's Low.... the 2020 High....)\\*\n\nI also mentioned the [NASDAQ](https://gyazo.com/27bfaa75f69057117f18ea0539301349) early on -Which  I've charted with the same exact 'scope,' being the time-line/High&amp;Low points. Imo this index even more than the S&amp;P truly showcases the over-reactive nature of the markets, investor greed/FOMO, and the impact of modern active fiscal policies on natural market movement/the 'precision' of Elliott wave theory. In my eyes, confirming the 5K low-projection as a significant price point in the past; which can be seen [on the daily chart](https://gyazo.com/4fe4b44e3da32cf0883cae330f63e557) as confirmed resistance/'the highs' in 2000, and also note the interaction with the 5k price point [on the monthly chart](https://gyazo.com/2ed7218fcc75e3cec9aa7f7b8296352d) from 2015-17 (seen as resistance for the most of 2015 with an 'island top' pattern which then collapsed below before breaking out and back-testing as support in late 2016.)\n\nTo briefly discuss the timeline of these retracements,  (starting on January 1st 2020 and ending on July 1st 2021) I believe this crash/harship will somehow give the groundwork for our gov't to feed some kind of \"America 2.0\" recovery program \\~July 2021. Seriously, what better time to push such a propaganda piece other than the month we celebrate our country's independence? As for the starting date of this retracement; January 1st was the first public release from the WHO discussing 'A cluster of cases have emerged of a mysterious pneumonia,\" and thus \n\n**The Path of These Projections/Calculation of Targets**\n\nNext, to present the projected path(s) of this deleveraging I'm using E.W.T. to draw rough price targets on the S\\&amp;P; this is analysis under the belief that Elliott Wave Theory still holds a level of accuracy despite modern active fiscal policy intervention in the markets/economically. I'm viewing this price action as a '[Down-trending impulse wave](https://gyazo.com/f77bc5e3d987095ca54addb9f2f1f213).' For Those that don't care about the explanation of the technical's and just want a cut and dry projection minus all the gibberish below - [Here](https://gyazo.com/05998bb307c8277d633419f9c973a704).\n\nThe first Fib is the same retracement from above, just labeled as 'LT Corrective Wave' since that's ultimately what I'm viewing this move as, (A LT Correction in the debt cycle.) The Second Fib is actually the length of Wave 1 from tip to tail to show's that our relief rally (Wave 2) has behaved to E.W.T. within reason thus far and would be confirmed as wave 2 considering we've rejected breaking above the .382 retracement level (or in other words have maxed out at bull momentum \\~0.618 the length of Wave 1). Next (and note that following last week I believe we have just entered) is Fib/Wave 3 - Wave 3 is the longest wave in the series and is ultimately to be at least 1.618 the length of Wave 1 (doesn't mean it has to be in a crash lol, it could be very very drawn out.) Wave 4 will then be another relief rally .5 the length of Wave 1. Followed by Wave 5 which I have drawn as .618 the length of Wave 1 (It very well could be shorter, that will be a discussion for a later time once we can better understand any news/media catalysts at play.) Then we have corrective waves A,B,C which ultimately in my eyes will lay forth the groundwork for the genuine beginnings of our next secular bull market. \\*Note, if you've made it this far and understand what I'm saying then you also understand that this outcome is one derivative of 72 potential outcomes given that we are still so early in the move.\n\n\\*I would also like to note that given the circumstances of the global economy in the Med-LT this creates an extremely bullish case for gold &amp; silver, gold should've been a no brainer to pick up following it's pull-back caused by the liquidity crisis in early March. I believe if we see the economic contraction which I had set-forth then spot gold could easily be pushing $3k around the time our markets are finding bottom. Silver traditionally will also act similarly to gold given circumstances around fiat currencies, however silver tends to act on a slight delay relative to gold in this regard. \n\n**Short Term Movement / What to Watch This Week**\n\n[S&amp;P](https://gyazo.com/344ea72b3f8edf40894c9b198e55c33c)/General Markets - Similarly to last week, I'm writing this as the futures open with a gap up and proceed for to push upwards of about 1% green. The DXY has created huge support and appears ready for a breakout, gold is trading higher than friday's close, in my opinion, all of which are signals similar to what we had seen in late February warning us to start to consider exiting the markets. I'm expecting early upwards movement in the markets to push up enough for one more test this downtrend line seen on the Fib-entrancement before once again rolling over to significant downside &amp; finally breaking down below this H&amp;S neckline for good (Targeting \\~270 EoW/mid-late week.) To give an even tighter projection on when I believe the markets will experience significant downside again,  I would like to show this 1 hour chart of the [H&amp;S formation](https://gyazo.com/deee92a5b8070f9bb4cfa7fb2ed37f63). So. Much. Selling. Pressure... Seriously, this thing is riddled with red dildos.  At best I believe the MM's will be able to push the markets upwards of a 2895 back-test at most before rolling over going into the second half of the trading day on Monday (\\~ 2-4PM trading time-frame.)\n\n[$XLF](https://gyazo.com/5f1e7a69a2edbaa85b48906d3d0d76be) Called out the broken H&amp;S pattern in my post last week &amp; claimed it to be a leading indicator for the general markets direction, I believe the same will continue to prove true moving forward. That said, looking for an entry on June 19th $18p during AM-lunch trading session (whenever the S&amp;P pushing near the 289-290 range, which could push to as close to \\~21.50 as on XLF I would say.) \n\n[$AMD](https://gyazo.com/461a4f07a758e37064a338d080929dc2) \\- I've been catching a fair amount of flack for calling out AMD as a short for the three weeks now, but had anyone taken the chance on taking positions near the resistance levels I was calling out then they would've been able to play these massive movements while consistently rolling profits into later dated contracts. Executives have been dumping their shares of stock left and right since leading up to and following their ER release, I wouldn't be surprised if the company knows their growth is going to be stunted for at least 4 quarters if not longer (Let's not forget the 190 PE ratio the damn stock is trading at based on current share price and Q1 EPS.....) AMD $40p June 19th &amp; $20p Oct 16th\n\n[$GDX](https://gyazo.com/f398759a085855ffc19ceabbef128336) \\- I'm pissed I didn't have the funds to act on this play before the markets ran up end of week giving the gold miners a heaftyyy run. That said, I believe this will prevail as a parabolic play through the rest of the year as gold miners are just only now returning to their 'fair value' and look ready for an over-reactionary  pop like in the early 2010's. I'm also bullish asf on spot gold price given the current economic circumstances and considering we're actually in a very interesting position with gold. Bears kept claiming \"gold miners will be shut down due to CV blah blah,\" but that was bullish for spot gold price. Anyone that wants to buy physical gold right now is paying between $100-150/oz more than spot in the futures due to this fact. I honestly believe spot gold price could push to kiss 3k come summer 2021. \n\n&amp;#x200B;\n\nTLDR - Magic Crayon Lines &amp; witchcraft elude to markets bottom \\~July 2021... XLF - $18p June 19th Exp, AMD - $40p June19th &amp; $20p Oct 16th, GDX $50c July 17th",
        "subreddit": "wallstreetbets",
        "title": "Dissecting Projected Med-LT Downwards Movement &amp; Plays for the Week Ahead 5/18",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/glrwvm/dissecting_projected_medlt_downwards_movement/",
        "created": 1589794185.0
    },
    {
        "author": "CD_Johanna",
        "created_utc": 1589561951,
        "id": "gkcx72",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "This is really leading to paralysis. I have a belief that cloud computing will perform very well over the next 10 years. But I'm very daunted at building a portfolio around this.\n\nI recently bought a small number of shares of the below stocks:\n\nAMD, Amazon, Arista, DataDog, Five9, Google, IBM, Intel, Microsoft, Nvidia, and Twilio\n\nSome things I'm struggling with:\n\n1. Weighting of each stock by %.\n2. When I have more money to contribute to these stocks, which ones should I boost up (leads to 1.)\n3. Should I add more companies and expand my list to 20 stocks? It gets very hard to keep track of.\n\nThere's so many other cloud computing and technology companies. There are a good 30 cloud computing stocks I know of.\n\nThere's also ETF's that take care of these issues for me, but I get hung up on their expense ratios, and then also which one to pick. There's broad technology like IGM, ITEC, VGT, QQQ, etc.\n\nBut then there's also cloud specific ones like SKYY, CLOU, WCLD, IVES. These have higher expense ratios than overall tech.\n\nAny tips for getting over my paralysis?",
        "subreddit": "stocks",
        "title": "Feeling paralyzed about which cloud/technology ETF's or individual stocks to buy.",
        "url": "https://www.reddit.com/r/stocks/comments/gkcx72/feeling_paralyzed_about_which_cloudtechnology/",
        "created": 1589590751.0
    },
    {
        "author": "ipostsomethingtoday",
        "created_utc": 1589402399,
        "id": "gj79ju",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "This is copied from  [https://www.reddit.com/r/eMaginCorp/comments/gifixi/potential\\_partnerships\\_between\\_emagin\\_apple\\_lg](https://www.reddit.com/r/eMaginCorp/comments/gifixi/potential_partnerships_between_emagin_apple_lg)\n\n \n\n**eMagin and Apple**\n\nIn 2017 eMagin Signs Agreement with **Tier-One Consumer Electronics Company** \\-\n\nHOPEWELL JUNCTION, N.Y.--(BUSINESS WIRE)--Oct. 31, 2017-- eMagin Corporation (NYSE American:EMAN), a leader in the development, design and manufacture of Active Matrix OLED microdisplays for high resolution imaging products, today announced the signing of a development and licensing agreement with a tier-one consumer electronics company permitting it to use eMagin technology. The program is expected to generate licensing revenue if the company commercializes eMagin's technology.\n\n[http://ir.emagin.com/news-releases/news-release-details/emagin-signs-agreement-tier-one-consumer-electronics-company](http://ir.emagin.com/news-releases/news-release-details/emagin-signs-agreement-tier-one-consumer-electronics-company)\n\nEvan Donoghue who led development of EMAN's high brightness Direct Patterned OLED is now Manager - Display Hardware Engineering at Apple - [https://www.linkedin.com/in/evan-donoghue-7a97bb45/?authType=name&amp;authToken=tUc2&amp;trk=prof-sb-browse\\_map-name](https://www.linkedin.com/in/evan-donoghue-7a97bb45/?authType=name&amp;authToken=tUc2&amp;trk=prof-sb-browse_map-name)\n\n**eMagin &amp; LG**\n\nLG would be interested in utilizing eMagin's direct patterning IP potentially as a manufacture for a company like Apple .\n\nRobert McIntire with LG Ventures was on a panel with EMAN CEO at SID last year - [https://youtu.be/5J0PyaXNEhM?t=4](https://youtu.be/5J0PyaXNEhM?t=4)\n\n**eMagin , Apple , LG**\n\nWhy Apple and LG as potential partners with EMAN?\n\nBecause EMAN clearly has a relationship with them .\n\nBuried In a 2018 \"Red Herring \" prospectus was a list of \"Specified Investors\".\n\nEMAN would have received a discount from the Broker fees if the \"Specified Investors\" had invested in EMAN because they had \"had discussions\" -\n\n\"According to a report from Bloomberg, **“Emagin listed those companies in the filing because it had discussions with \\[the companies\\] at industry events,”** the company reportedly told the publication.\"\n\n[https://www.roadtovr.com/apple-valve-and-lg-invest-in-oled-microdisplay-maker-emagin/](https://www.roadtovr.com/apple-valve-and-lg-invest-in-oled-microdisplay-maker-emagin/)\n\nThe \"Specified Investors\"\n\n1. Stillwater Holdings LLC and its affiliates\n2. Valve Corporation and its affiliates\n3. **Apple Inc.** and its affiliates\n4. **LG Display** and its affiliates\n5. Immerex and its affiliates\n\nsee page 41 - [https://www.sec.gov/Archives/edgar/data/1046995/000104746918000330/a2234310zex-1\\_1.htm](https://www.sec.gov/Archives/edgar/data/1046995/000104746918000330/a2234310zex-1_1.htm)\n\nHowever , none of the \"Specified Investors\" invested in eMagin at that time -\n\n[http://ir.emagin.com/news-releases/news-release-details/emagin-corporation-updates-market](http://ir.emagin.com/news-releases/news-release-details/emagin-corporation-updates-market)\n\n**eMagin &amp; Intel**\n\neMagin needs an on-shore supplier for OLED backplanes due to the military &amp; Intel could be a likely source .\n\nIs this \"US based chipmaker\" Intel ?\n\nBuried in this eMagin PR Jan 2018 -\n\nSeparately, the Company announced an agreement with a **U.S.-based chipmaker** to support scaling of mass production for the consumer AR and VR markets. This agreement will provide supply chain development assistance for eMagin to enable prototype and mass production of OLED microdisplays. As part of this agreement, eMagin’s partner will provide raw materials sourcing support necessary for scaling to mass production while helping the Company meet the cost requirements of high volume consumer segment original equipment manufacturers (“OEMs”).\n\n[http://ir.emagin.com/news-releases/news-release-details/emagin-demonstrate-their-highest-brightness-2k-oled-displays-ces](http://ir.emagin.com/news-releases/news-release-details/emagin-demonstrate-their-highest-brightness-2k-oled-displays-ces)\n\n@ SID 2018 Session 40 before a [packed room](https://twitter.com/LEXOS_lab/status/999424459898470401) eMagin Chaired an Intel Presentation -\n\nSession 40 : OLED AR/VR OLEDs ; Artificial Intelligence and Augmented Reality and Virtual Reality Wednesday, May 23 / 03:30 PM - 04:50 PM / Room 502B\n\n**Chair: Tariq Ali, eMagin Corporation**, Hopewell Junction, NY US\n\nCo-Chair: Jang Hyuk Kwon, Kyung Hee University, Seoul, South Korea\n\n40.1 - Invited Paper: Next Generation Virtual Reality Displays: Challenges and Opportunities (3:30 PM - 3:50 PM)\n\n**Kunjal Parikh, Jim Zhuang, Kim Pallister Intel Corp**. Santa Clara CA US\n\n**Jun Jiang, Marshall Smith Intel** Santa Clara CA US\n\nHigh ppi compact form factor requirement is being described using micro-display as key enabler. The trade-off between FOV, size and scalability to meet price targets will be discussed. Overview of system impact using novel display design with Intel’s key technologies will be presented to give holistic view about product vision.",
        "subreddit": "pennystocks",
        "title": "EMAN Potential partnerships with Apple, LG, Intel , AMD, Google",
        "url": "https://www.reddit.com/r/pennystocks/comments/gj79ju/eman_potential_partnerships_with_apple_lg_intel/",
        "created": 1589431199.0
    },
    {
        "author": "Arctic92Monkey",
        "created_utc": 1588810842,
        "id": "gew1v2",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Mine are:\n\n1 - TSLA \n\nThey have the best EVs and the best self driving tech. Solar/Energy storage also has massive future potential.\n\n2 - AMZN \n\nWill be the dominant player in cloud along with MSFT. Best ecommerce play.\n\n3 - AMD \n\nI believe they will continue to eat away at intel's market share.",
        "subreddit": "investing",
        "title": "What are your top 3 holdings and why?",
        "url": "https://www.reddit.com/r/investing/comments/gew1v2/what_are_your_top_3_holdings_and_why/",
        "created": 1588839642.0
    },
    {
        "author": "NeverInterruptEnemy",
        "created_utc": 1589219796,
        "id": "ghsna4",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Idiot here, accidentally got $52 Put on AMD at 6/19... keep/hope or sell/lesson?",
        "url": "https://www.reddit.com/r/investing/comments/ghsna4/idiot_here_accidentally_got_52_put_on_amd_at_619/",
        "created": 1589248596.0
    },
    {
        "author": "tradingkingeric",
        "created_utc": 1588606955,
        "id": "gddw5l",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " Take a free play,    [$AMD](https://stocktwits.com/symbol/AMD) July 17th exp  \n   strike- $70    \nbuy under .80    \n sell/ scale out as you see profits.     \nLook at the chart below, Thank trendspider for literally doing all the work for me this time.   \n\n\nThink this will make a ton of money. Let me know your thoughts \n\nhttps://preview.redd.it/97zqqsmkqrw41.png?width=1257&amp;format=png&amp;auto=webp&amp;s=691dd4a9cff526304d5d5b96ffab9039b21ec8b2\n\nClick the link below to check out trendspider  [trendspider.com/?\\_go=stckdy](https://trendspider.com/?_go=stckdy)",
        "subreddit": "smallstreetbets",
        "title": "Easy play, for FREE money Literally.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/gddw5l/easy_play_for_free_money_literally/",
        "created": 1588635755.0
    },
    {
        "author": "MajinJuuu",
        "created_utc": 1588429447,
        "id": "gc7adj",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Love tech, 24 year old investor, holding for the long term (say 10 years or so). Curious to see if my diversification is fine, and if so, if my allocation is okay or if I should be investing more in particular stocks.\n\n* VTI 22%\n* MSFT 12%\n* BTC 11%\n* V 12%\n* DIS 7%\n* AMD 7%\n* SQ 4%\n* GOOG 4%\n* BABA 3%\n* XOM 3%\n* JNJ 2%\n* SBUX 2%\n* TSLA 0.5%\n\nI have been DCAing these stocks in small amounts each week + if they dip below my avg. share price.\n\nIve been mostly focused on bringing my overall percentage of GOOG up. \n\nXOM is probably my shortest term hold. Going to wait for the oil industry to bounce back and then flip for a profit (hopefully). \n\nJNJ and SBUX are so low because they are my most recent additions, and I dont have much money to allocate at the moment. \n\nTSLA is basically a non-existant aspect of my portfolio because I refuse to pay over $400 per share.\n\nThe last 10% or so is employer sponsored stock options and a penny stock that I have done my DD on and taking a chance.\n\nCould use some opinions!",
        "subreddit": "stocks",
        "title": "Proper Allocation/Diversification?",
        "url": "https://www.reddit.com/r/stocks/comments/gc7adj/proper_allocationdiversification/",
        "created": 1588458247.0
    },
    {
        "author": "Miker1730",
        "created_utc": 1588976558,
        "id": "gg32mp",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Hello everyone, I have a question regarding when an option will show as assigned on Etrade. I had a few contracts i sold for AMD and DAL covered calls for 53$ and 22.50 respective.\n\nThe AMD still shows on my account\n\nand\n\nThe DAL finished in the money at end of day at 4:00 but after ours went out of money, will it sell my shares?",
        "subreddit": "options",
        "title": "Theta gang question",
        "url": "https://www.reddit.com/r/options/comments/gg32mp/theta_gang_question/",
        "created": 1589005358.0
    },
    {
        "author": "LowMeasurement",
        "created_utc": 1588899497,
        "id": "gfj9ec",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMD 6/19 calls !!",
        "url": "https://i.redd.it/bw50a3hgwfx41.jpg",
        "created": 1588928297.0
    },
    {
        "author": "ItsPul",
        "created_utc": 1589821375,
        "id": "gm5eao",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "U guys remember the good old days of 2019 going into 2020? \nAutists and retards alike were all beating the market by YOLOing meme stock options..\n\nCan we do that again pls?\n\nThis time, it’s J-Pow infinite money BRR machine AND more stim checks. Remember what happened last time? \nAnd we can use algorithmic warfare.\nLiterally just spam $TSLA and $AMD and $SPCE and put random calls, strikes and dates, the algos will eat that shit up. \n\nYou guys stopped so we haven’t seen insane pumps anymore. \nFor now, in the short timeframe before the next sell-off that ass-fucks all of us, we will eat from Daddy Wall Street’s plate 😋.",
        "subreddit": "wallstreetbets",
        "title": "I know I’m retarded but hear me out, I promise.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gm5eao/i_know_im_retarded_but_hear_me_out_i_promise/",
        "created": 1589850175.0
    },
    {
        "author": "LaponaCrypto",
        "created_utc": 1588425042,
        "id": "gc67qh",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I had AMD at +40%, TSLA at 50% and BA at 70% gains. Only sold BA at put a mental limit to sell only at more than 70% gains.\n\nNo with AMD and TSLA down I feel that I should lower the limit. What is your strategy?",
        "subreddit": "stocks",
        "title": "What is a good spike to sell?",
        "url": "https://www.reddit.com/r/stocks/comments/gc67qh/what_is_a_good_spike_to_sell/",
        "created": 1588453842.0
    },
    {
        "author": "nrfmartin",
        "created_utc": 1589433627,
        "id": "gjfz4q",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "My first true gain. AMD puts paid out, rolled into AMD calls RIP me.",
        "url": "https://i.redd.it/jsgjzi5p0oy41.jpg",
        "created": 1589462427.0
    },
    {
        "author": "tradingkingeric",
        "created_utc": 1588606156,
        "id": "gddne2",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " Take a free play,    [$AMD](https://stocktwits.com/symbol/AMD) July 17th exp  \n   strike- $70    \nbuy under .80    \n sell/ scale out as you see profits.     \nLook at the chart below, Thank trendspider for literally doing all the work for me this time.   \n\n\nClick the link below to check out trendspider  [trendspider.com/?\\_go=stckdy](https://trendspider.com/?_go=stckdy)  \n\n[LETS GO!!](https://preview.redd.it/mpd8y1c5orw41.png?width=1257&amp;format=png&amp;auto=webp&amp;s=2116e88f65a2919ce02cc6a4e000d62be34b9db1)",
        "subreddit": "options",
        "title": "$AMD GOING FOR THE MOON AGAIN",
        "url": "https://www.reddit.com/r/options/comments/gddne2/amd_going_for_the_moon_again/",
        "created": 1588634956.0
    },
    {
        "author": "rovaYa",
        "created_utc": 1589999577,
        "id": "gngyuu",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I’ve been struggling to find good long term Tech stocks to put some money into. We all know MSFT, AAPL, NVDA,AMD(overpriced rn imo) are there any other ones i should keep my eye on ?  Thanks in advanced !",
        "subreddit": "stocks",
        "title": "Tech Stocks ?",
        "url": "https://www.reddit.com/r/stocks/comments/gngyuu/tech_stocks/",
        "created": 1590028377.0
    },
    {
        "author": "xtuntx",
        "created_utc": 1588694740,
        "id": "ge0ilq",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD stock price is too low imo",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ge0ilq/amd_stock_price_is_too_low_imo/",
        "created": 1588723540.0
    },
    {
        "author": "PurpleOperation",
        "created_utc": 1589155057,
        "id": "ghcm3z",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Mine are about to expire worthless and I need someone to buy them from me please.",
        "subreddit": "wallstreetbets",
        "title": "USEFUL DD: GET $70 5/15 AMD CALLS ON MONDAY!!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ghcm3z/useful_dd_get_70_515_amd_calls_on_monday/",
        "created": 1589183857.0
    },
    {
        "author": "alwayswashere",
        "created_utc": 1588617784,
        "id": "gdhegm",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "EOM",
        "subreddit": "wallstreetbets",
        "title": "AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gdhegm/amd/",
        "created": 1588646584.0
    },
    {
        "author": "esketa",
        "created_utc": 1588443977,
        "id": "gcb8yd",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "Opinions on an AMD straddle for may 15? I would get an ATM put and call (50 and 51 as of now) Looking for low risk and low reward plays, this seems pretty promising to me. If there is anything i'm missing or not taking into account I would appreciate any guidance. thanks for helping a noob out!",
        "url": "https://i.redd.it/xpw3wkmy9ew41.jpg",
        "created": 1588472777.0
    },
    {
        "author": "paoro",
        "created_utc": 1588555868,
        "id": "gd2fbq",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " \n\nI have\n\nAMD 5/8 55 CALL\n\nAMD 5/8 54 CALL\n\nAMD 5/15 75 CALL\n\nAMD 6/19 75 CALL\n\nAll of which are 80% in the red.\n\nIs there anything I can do to prevent losing them completely or turning this around?",
        "subreddit": "wallstreetbets",
        "title": "How to save my AMD calls?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gd2fbq/how_to_save_my_amd_calls/",
        "created": 1588584668.0
    },
    {
        "author": "BlueSkyPilot",
        "created_utc": 1588968446,
        "id": "gg0jwl",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Mods keep deleting my loss post. Fuck you too! \nPositions:\nF 5p 5/15\nSPY 267p 5/29\nAMD 34p 7/17",
        "subreddit": "wallstreetbets",
        "title": "Fuck the mods! That is all.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gg0jwl/fuck_the_mods_that_is_all/",
        "created": 1588997246.0
    },
    {
        "author": "cran-BEAR-y",
        "created_utc": 1590023533,
        "id": "gnnanp",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hello,\n\nOld news, but Schwab is releasing Schwab Slices on the 9th of June. I am excited to apply this to my \"fun porfolio\", 10 percent of my total porfolio. \n\nMy intent was to mimic a very heavy tech based portfolio. To mimic QQQ for 20 yrs and forget it but with a few changes.\n\nA few notes about it...\n\n\\- I added Twitter because I feel that it is extremely undervalued! I think they have good financials and a strong future.\n\n\\- I added Pepsi Co. Great company, only reason I chose it over KO is because of its reach and diversity. \n\n\\- AMD. I know people are wishy washy on this especially with the extremely high PE and volatility. But I feel that fanbase is a huge drive for success and their CEO is an exceptional leader.\n\n\\- TSLA. Total meme stock but they are at least 10 years ahead of their time (in the automotive industry). As long as PR keeps Elon under control to a certain degree, we have lots of growth ahead. Elon is smart and relatively young. He is an engineer more than a business guy. Good innovation. \n\nMSFT   15%\n\nAMZN  14%\n\nAAPL    12%\n\nFB         11%\n\nDIS        11%\n\nGOOG   10%\n\nPEP       10%\n\nTWTR     7%\n\nAMD       5%\n\nTSLA       5%",
        "subreddit": "stocks",
        "title": "My Schwab Slices Porftolio (soon)",
        "url": "https://www.reddit.com/r/stocks/comments/gnnanp/my_schwab_slices_porftolio_soon/",
        "created": 1590052333.0
    },
    {
        "author": "germansheparddd",
        "created_utc": 1590256204,
        "id": "gp98k6",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Have 24k to invest\n\nI’m pretty risk averse so this was what I was thinking \n\nETFs\n\nVOO - 25%  (15 stocks)\nIXG - 9% (30 stocks)\nREIT ETF - 9% (20 stocks)\n\nStocks\nBlue Chip\n\nMicrosoft - 6% (5 stocks)\nVISA - 6% (5 stocks)\nDisney - 6% (7 stocks)\nApple - 6% (3 stocks)\nJPM - 5% (10 stocks)\nExxom - 4% (15 stocks)\n\nThe other 24% I would be going to growth stocks (I may have labelled wrongly what constituted as growth but you get the idea)\n\nBAM\nDKNG\nAMD \nMGM\nGNUS\nSDI\nPIN\nDRI\nERI\n\nAny recommendations? Am I diversified enough? Which would you sub out? What other blue chip should I get? What about Facebook or Walmart?\n\nPls advise, thanks!",
        "subreddit": "stocks",
        "title": "Portfolio Idea",
        "url": "https://www.reddit.com/r/stocks/comments/gp98k6/portfolio_idea/",
        "created": 1590285004.0
    },
    {
        "author": "snehal_patel",
        "created_utc": 1589921349,
        "id": "gmwz2i",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " \n\nHi\n\nI recently decided to get into investing and trading. I was looking at a few services to help understand and grow quickly in both fields. I tried the IBD newsletter for the last few weeks. I also decided to try Marketsmith and this is where I saw something odd. I was using IBD for chart pattern identification and help me develop and understand technical analysis&gt; I planeed to use it as a crutch to make some money and understand CANSlim faster. They weekly release stocks near buy zone wherein they tell you a list of stocks that are about to breakout of the cup and handle pattern and at what price should you get in.\n\nNow market smith is another product that is far more expensive at $150 a month and also gives you a set of stocks that are near their buypoint. A list of stocks that have broken out and are fast approcahing their sell price. It also gives you a lot of rating and fundamental data with a click of a button.\n\n1. The first glaring difference is in terms of the stock lists which are very different. The ones posted on the IBD newsletter seem to go nowhere or move very slowly. Currently AMD has been on the list forever. And AMD is not the only stock as most if not all stock on the Stocks to By list havent broken out or breakout over weeks. Market smith on the other hand actually gave recommendations every day and has had multiple stocks breakout per day basis. In short you will get realy slow moving or low priority information on the newletter compared to marketsmith.\n2. Now last night there was an article to get into Paypal on the IBD newletter as it had the potential of going further for those who missed out and add for those who followed the original recommendation, but on MarketSmith you have reached the sell zone. So in short the newsletter subscribers will buy into the stock while the Marketsmith users will sell and rake in the profits. Now this remind me of the pump and dump schemes that flow around penny stocks. Ofcourse since its a company like Paypal your downside is heavily protected but just looking at the quality of information provided feels like a scam\n3. The really infuriating portion is that they actually charge a decent amount of money for their newsletter/ site access. It feels like you pay for gettind second hand and second quality information.\n\nAs for the fundamental analysis Mornigstar offers amazing indepth reports on the stocks they follow for a fraction of the price.\n\nFor IBD list of growth stocks I believe there is an ETF from where you can get the list.\n\nAll in all I believe if you want to use IBD, Marketsmith is the way. Although I have not tried their other products like Swingtrader or Leaderboard.",
        "subreddit": "stocks",
        "title": "Is IBD a SCAM.?(Investor Business Daily Review)",
        "url": "https://www.reddit.com/r/stocks/comments/gmwz2i/is_ibd_a_scaminvestor_business_daily_review/",
        "created": 1589950149.0
    },
    {
        "author": "Shaun8030",
        "created_utc": 1589415784,
        "id": "gjbfrj",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Tech portfolio thoughts\n\nCurrent portfolio tech heavy long term holding QQQ and VGT for a few years added FDN during the March dip and XNTK just recently\n\n30 percent FDN - AMZN , FB, NFLX, GOOG\n\n30 percent VGT APPL, MSFT, V, MA\n\n30 percent QQQ Mix of VGT and FDN\n\n10 percent XNTK Growth tech stocks SHOP, TSLA , AMD, NVIDIA etc\n\nHolding long term there is a little overlap between ETF holdings with QQQ but the others are relatively unique. Overall Mer is around 0.28.",
        "subreddit": "StockMarket",
        "title": "All tech ETF portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/gjbfrj/all_tech_etf_portfolio/",
        "created": 1589444584.0
    },
    {
        "author": "Elekcktra",
        "created_utc": 1589548525,
        "id": "gk8ww3",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi guys, so I have about $60 to buy a stock with. My portfolio consists of one JPM stock and that's it as of now. I have been looking at AMD and Intel and they look good since AMD will be backing the GPU and CPU for the next generation of consoles. But I also heard about how Livongo will make me a huge profit in 10-20 years, but I'm not too sure about anything yet. Please give me any recommendations and advice, thanks!",
        "subreddit": "stocks",
        "title": "What should I buy?",
        "url": "https://www.reddit.com/r/stocks/comments/gk8ww3/what_should_i_buy/",
        "created": 1589577325.0
    },
    {
        "author": "Cat50n",
        "created_utc": 1588518738,
        "id": "gcs71s",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hello, I want to get into investing amd was wondering where do you all recommend I start, what should I read, what free/paid resources do you think I should check out? I pretty much am starting from scratch here so any advice is appreciated.",
        "subreddit": "investing",
        "title": "I want to start investing",
        "url": "https://www.reddit.com/r/investing/comments/gcs71s/i_want_to_start_investing/",
        "created": 1588547538.0
    },
    {
        "author": "LowMeasurement",
        "created_utc": 1589413813,
        "id": "gjavb5",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD!!!",
        "url": "https://www.cnn.com/2020/03/27/tech/lisa-su-amd-risk-takers/index.html",
        "created": 1589442613.0
    }
]