[
    {
        "author": "ali123512",
        "created_utc": 1589433321,
        "id": "gjfwtm",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "I live in CA. Shitty house, expensive zip code. No place to work so I work out of my garage with the door wide open. \n\n11:32am, watching my SPY 260p 5/15’s gain $12. Thinking if what Subway sandwhich I’m gonna buy with my tendies. Then out of nowhere, a wild woman runs into my garage. \n\nMy 82 year old Chinese neighbor who barely speaks English, wearing a mask, comes and starts screaming in Mandarin. I look at her confused. She screams “EMERGENCY”. Oh shiit. I jump into my car, she gets in and I drive her directly to the ER. \n\nWhen she sees the hospital, she’s confused and says no no no. She points at the road back and says something in Mandarin. I don’t know what she wants me to do so I call a Chinese friend. She and the woman talk for 5 minutes and then my friend say “think she wants to go to a bank. She’s saying something about stocks.” I ask “Stocks??” This 82 year old WSBer yells “STANKS!!” She reaches her purse and takes out a business card of some fucker from Fidelity...\n\nThis woman saw on the news that the market was down, was worried about her account at Fidelity and came to my house yelling “EMERGENCY.” \n\nSo I took her into Fidelity, my friend still translating for her and a teller. This woman had $12,600 in her account, most of it in motherfucking SPY\n\nYou guys, today was wake up call\n\ntl;dr puts on China 5/15",
        "subreddit": "wallstreetbets",
        "title": "82 year-old Chinese WSBer",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gjfwtm/82_yearold_chinese_wsber/",
        "created": 1589462121.0
    },
    {
        "author": "beefcake_123",
        "created_utc": 1590427150,
        "id": "gqf0ve",
        "num_comments": 105,
        "num_crossposts": 0,
        "selftext": "Some of you may know the tale of Andrew Caspersen, the \"Wall Street scion\" who stole tens of millions of dollars from friends and family and used that money to bet purely on SPY and QQQ weekly put options back in 2016. Here's an excellent [Vanity Fair article](https://www.vanityfair.com/news/2016/06/andrew-caspersen-fraud) on Caspersen's crime, which also has quite a bit of information on his background. \n\n*As a sidenote, I will say that Caspersen lived a life of marked by tragedy: His young fiance was killed in the 9/11 attacks, and his father committed suicide 8 years later in 2009.*\n\nI'm not going to discuss the fraud much here, because we are degenerate options gamblers, after all. But Caspersen was a Harvard-educated lawyer, and a very smart one, who created fake documents to sell to his friends, family, and network about some fake private equity financing deals that would give them quarterly interest payments amounting to 15% per annum. \n\nThe court documents that are publicly available paint some details that most news articles on the case did not explain fully. Specifically, I would like to point you all to [Exhibit D](https://www.courtlistener.com/recap/gov.uscourts.nysd.458915.29.5.pdf) in Caspersen's case, which includes testimony from a finance expert who was hired to examine Caspersen's trades on Interactive Brokers and Fidelity. \n\nBy late 2015, Caspersen had about $9 million to trade with. In January 2016, he spent all of this money on ATM SPY options expiring in about a week. He would sell his proceeds on Friday and roll them into more put options expiring the following week. This worked extremely well all throughout January and February. By the end of the trading day on February 11th, his account was worth $112 million, more than enough to repay his friends and family and walk away with tens of millions of dollars for himself. But he refused. He kept going \"all-in\" on SPY puts. By the end of the first week of March, he had lost everything, and by this time, one of his old classmates was clamoring for the $25 million he had loaned to Caspersen from a family foundation he worked for. \n\nThe jig was up. \n\nCaspersen was arrested by the FBI in New York on March 28, 2016, in full view of his wife and family. They were all returning from a family vacation in Florida.",
        "subreddit": "wallstreetbets",
        "title": "The tale of Andrew Caspersen, who gained and lost $100 million betting on SPY put options during early 2016 after stealing the initial capital from his friends and family.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gqf0ve/the_tale_of_andrew_caspersen_who_gained_and_lost/",
        "created": 1590455950.0
    },
    {
        "author": "honkyhorsepower",
        "created_utc": 1590680313,
        "id": "gs8ine",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "It is common to see index funds being recommended to the average investor and even some Vanguard and Fidelity are some of the [largest funds.](https://www.marketwatch.com/tools/mutual-fund/top25largest) My question is, why do funds such as VFIAX or FXAIX receive so much praise over other funds such as my favorite FSCSX?\n\nFor example, comparing FXAIX which is Fidelity's S&amp;P 500 index fund, has an annualized return of 9.67% for the life of the fund. Compare that to FSCSX which has a 15.74% annualized return since the inception of the fund in 1985. A nearly 6% difference is enormous when it compounds, especially over 3 to 4 decades. This is just one example, you can find similar differences with other funds that track the S&amp;P 500 or Nasdaq (although Nasdaq funds seem to do better). \n\nI understand expense ratios are one concern, and reasonably so. The expense ratio for FXAIX is 0.015% which is crazy low when compared to some of the 1%+ expense ratio for a lot of funds. Even so though, going back to my example, the 0.71% expense ratio for FSCSX does not close the gap between it and FXAIX. \n\nAlso, my example is not the rule. There are lot more funds that perform worse than the market and charge high fees. But there are options that *DO* perform better even with fees taken into account. Why are these funds not recommended more often?",
        "subreddit": "investing",
        "title": "Why are broad market index funds praised, when there are other mutual funds that have much higher annualized returns?",
        "url": "https://www.reddit.com/r/investing/comments/gs8ine/why_are_broad_market_index_funds_praised_when/",
        "created": 1590709113.0
    },
    {
        "author": "Polygonalpashtun",
        "created_utc": 1590918337,
        "id": "gtw9sh",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "So I deposited 25 thousand dollars into my Fidelity margin investment account. I then bought stock and sold it for 9000 dollars profit. Due to a mistake on my part, my bank transfer was reversed. Fidelity is now claiming that these stocks were “unpaid securities” and are closing my account and keeping all my money. Is there anything I can do? I have complained to FINRA and the SEC and they have lied to them saying they will release the funds if I present my Id at a branch. I have done so but nothing has changed.",
        "subreddit": "investing",
        "title": "Fidelity is keeping my money?",
        "url": "https://www.reddit.com/r/investing/comments/gtw9sh/fidelity_is_keeping_my_money/",
        "created": 1590947137.0
    },
    {
        "author": "EithneDraoct",
        "created_utc": 1589731279,
        "id": "glhue5",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "One of the things that kept me playing with this silly app was that fresh mint. It was pleasing to the eye. I was already considering transferring my equities over to my existing fidelity account. This may actually push me to do it, as dumb as it may sound. That new green just hurts my eyes.",
        "subreddit": "stocks",
        "title": "Anyone else turned off by RH’s new green?",
        "url": "https://www.reddit.com/r/stocks/comments/glhue5/anyone_else_turned_off_by_rhs_new_green/",
        "created": 1589760079.0
    },
    {
        "author": "CD_Johanna",
        "created_utc": 1588579082,
        "id": "gd7dmu",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Looking at this chart by Fidelity, International and US seem to go periods of years where one out performs the other:\nhttps://www.fidelity.com/viewpoints/investing-ideas/international-investing-myths\n\nWith the US dominating since the financial crisis.\n\nDo you think post corona, international could pull ahead? Under what circumstances are could international equities out perform US again?",
        "subreddit": "investing",
        "title": "Under what circumstances could international equities out perform US?",
        "url": "https://www.reddit.com/r/investing/comments/gd7dmu/under_what_circumstances_could_international/",
        "created": 1588607882.0
    },
    {
        "author": "jalm111",
        "created_utc": 1590772348,
        "id": "gswyd4",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Got this from Fidelity today. Made sure to file in the \"Important\" category.",
        "url": "https://i.redd.it/73hqmlg4lq151.jpg",
        "created": 1590801148.0
    },
    {
        "author": "----The_Truth-----",
        "created_utc": 1590676509,
        "id": "gs7dao",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Well, I did buy in, but only with a small investment in a company called Altimmune (ALT). I bought 40 shares at $6.50, and that was me getting in what I considered to be late (opened my trading account when it was at $4.93 and by the time my funds hit the stock was already well into the high $5s). It looks like a good move so far, but anything can happen.\n\n&amp;#x200B;\n\nAnyway,  I've been holding... holding... waiting to get my big chunk into the market (not much, \\~$2K). Haven't made big buys yet, but yesterday and today I've put in limit buys for 5 stocks I've been staring at for 2 weeks, and now I've missed a couple different +10% days. Now where I've put my limits is much higher than it would've been last week. It doesn't feel right because I've been holding off waiting for another drop, but it doesn't seem like it's coming now. The Memorial Day rally has caused me to rethink this and now I feel like I may need to get back in before it's WAY too late. \n\n&amp;#x200B;\n\nI opened my Fidelity account right smack dab in the middle of the bottom out, but the funds weren't available until days later when the market had already corrected itself. Unfortunately for me, I decided to hold, take notes, and watch the markets every day since, hoping for another dip. The problem is the opposite happened with the Memorial Day rally and now I'm afraid that dip might not happen, and if it does and I buy in now, I'll take unnecessary losses that may have been avoided with some patience and trust in my fundamental knowledge.\n\n&amp;#x200B;\n\nI guess my question is this. Do I buy in now? Do I continue to be patient for what could be an inevitable 2nd crash or down spike? Or do you think we are in the clear and I should just buy now and try to forget about what could have been? It just really feels like this rally bubble could burst, even if it happens gradually. At the same time, it may not.\n\n&amp;#x200B;\n\nRight now I've got limit buy orders in intentionally too low to hit today, probably. But this is what got me here in the first place. Could really use at least some conversation about it. No one here is going to convince me either way, but it is nice to read others having the same concerns.\n\n&amp;#x200B;\n\nFor the record, I am a purely fundamental trader. The stocks I've been staring at are ALT, SAVE, LUV, CCL, PENN, and NVAX.\n\n&amp;#x200B;\n\nThanks for any input. I look forward to any replies.",
        "subreddit": "StockMarket",
        "title": "New investor, haven't bought in yet, do I continue to wait or go for it?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gs7dao/new_investor_havent_bought_in_yet_do_i_continue/",
        "created": 1590705309.0
    },
    {
        "author": "diverareyouok",
        "created_utc": 1590335366,
        "id": "gprxev",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "I’m new to investing. Figured I’d give it a shot since they are offering 100 in a fidelity account if you beat the s&amp;p by 20% in June... they give you 100k in imaginary money and you can’t buy anything under $2. Anyone else playing? I figured it would be a good way to see if I can learn enough to make money without risking any of my own just yet.",
        "subreddit": "pennystocks",
        "title": "Is anybody else playing the “beat the s&amp;p in June for $100” on wealthbase.com?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gprxev/is_anybody_else_playing_the_beat_the_sp_in_june/",
        "created": 1590364166.0
    },
    {
        "author": "drroscoe",
        "created_utc": 1588657522,
        "id": "gds2ax",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Just as an FYI, schwab just post this link on their website that fractional shares is coming soon: [https://www.schwab.com/stock-slices](https://www.schwab.com/stock-slices)\n\nFidelity already offers fractional investing on their mobile app as of February 2020",
        "subreddit": "investing",
        "title": "Fractional Share investing - schwab &amp; Fidelity",
        "url": "https://www.reddit.com/r/investing/comments/gds2ax/fractional_share_investing_schwab_fidelity/",
        "created": 1588686322.0
    },
    {
        "author": "datius",
        "created_utc": 1590772313,
        "id": "gswxyx",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "In case you didn't know, like myself, if you are unhappy with your firm or want to go to something more flexible like from Robinhood to TDA, E\\*, Fidelity etc. you can. I just switched from TDA to Fidelity because they have no commission charges on pennies. \n\n[https://www.fidelity.com/customer-service/transfer-assets](https://www.fidelity.com/customer-service/transfer-assets)\n\n[https://us.etrade.com/what-we-offer/our-accounts/fund-my-account](https://us.etrade.com/what-we-offer/our-accounts/fund-my-account)\n\n[https://www.tdameritrade.com/funding-and-transfers/faqs-transfers-and-rollovers.page](https://www.tdameritrade.com/funding-and-transfers/faqs-transfers-and-rollovers.page)",
        "subreddit": "pennystocks",
        "title": "FYI You can transfer your account firm to firm.",
        "url": "https://www.reddit.com/r/pennystocks/comments/gswxyx/fyi_you_can_transfer_your_account_firm_to_firm/",
        "created": 1590801113.0
    },
    {
        "author": "zztooooob",
        "created_utc": 1589230484,
        "id": "ghw9jc",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Been trading stocks/options for a bit but i've never sold puts unless they were apart of a spread and am a bit confused about assignment of a put.\n\n&amp;#x200B;\n\nIf I sell a put (but have cash in my account for 100% of the possible risk) and get assigned, will I literally get 100 shares of that company added to my account that were purchased at the strike price?or will it be cash settled and I will be forced to buy their shares and sell them at the market price? I am on robinhood/fidelity for options.\n\n&amp;#x200B;\n\nThanks, I just want to make sure I know everything before I get into a position i'm thinking about.",
        "subreddit": "options",
        "title": "basic question",
        "url": "https://www.reddit.com/r/options/comments/ghw9jc/basic_question/",
        "created": 1589259284.0
    },
    {
        "author": "999_999_999",
        "created_utc": 1590676868,
        "id": "gs7h00",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Just chatted with fidelity, best they can do is lock me out of account and then have me call and verify ID to reset password. They say there is not a stronger way to prevent me from accessing my account. Anyone have any ideas?",
        "subreddit": "wallstreetbets",
        "title": "How to prevent self from trading?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gs7h00/how_to_prevent_self_from_trading/",
        "created": 1590705668.0
    },
    {
        "author": "mrtorrence",
        "created_utc": 1588968103,
        "id": "gg0fyx",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I've got ~$150k in a D.A. Davidson account and after my broker there accidentally placed a market order instead of the limit order I requested, lost me a couple hundred bucks on the trade, and then still charged a $298 transaction fee and wouldn't budge on it despite his mess up, I've decided to pull my holdings from DA Davidson. The majority of the holdings are in Microsoft, which don't get me wrong seems to have incredible fundamentals, but I'm not comfortable with such a lack of diversification. So I want to dollar cost average out of MSFT and into the classic Vanguard index funds like VTSAX. Just looking for some advice on which to buy into and how much to put in stocks versus bonds and whatnot to accomplish my investing goals (very low risk since I'd like to take the money to buy a house in the near future). I don't want to use the advice services that Fidelity offers (where I'm transferring the DA Davidson account) because they have an incentive to try to get me on a recurring management plan. I want to hire someone who knows they are just getting a one time fee to give me advice and thus remove the incentive for them to try to sell me on something recurring/long term. It's great getting advice on here but I'd like to talk with someone who has a name and face.",
        "subreddit": "investing",
        "title": "Where to hire a short term investing coach to help with asset reallocation?",
        "url": "https://www.reddit.com/r/investing/comments/gg0fyx/where_to_hire_a_short_term_investing_coach_to/",
        "created": 1588996903.0
    },
    {
        "author": "Reeeetail_Investor",
        "created_utc": 1588879121,
        "id": "gfd5ja",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "SPY Technical Analysis - YTD chart - Bollinger Band squeeze forming, indicating that a large movement up or down may happen soon - Fidelity detected 6 short term bearish signals today - (I realize most autists erroneously think TA is astrology)",
        "url": "https://i.redd.it/dnxnovwk7ex41.png",
        "created": 1588907921.0
    },
    {
        "author": "SourDough93",
        "created_utc": 1590094581,
        "id": "go53zs",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I use Robinhood and I’m looking to switch over to TD and/or Fidelity by the end of the month. I was just wondering if they, or most other brokers, have ‘Instant Deposits’ like Robinhood does, where you can essentially move money into your account instantly and then use it, so you don’t have to wait the 3 or so business days for the money to transfer. Sorry if this is a stupid question, and thanks!",
        "subreddit": "StockMarket",
        "title": "Quickly purchasing stocks?",
        "url": "https://www.reddit.com/r/StockMarket/comments/go53zs/quickly_purchasing_stocks/",
        "created": 1590123381.0
    },
    {
        "author": "Ldeexo",
        "created_utc": 1590281451,
        "id": "gpgcfx",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hello, just recently opened at IRA &amp; I was wondering what’s the best Fidelity funds I should invest in?\n\nIm a beginner on my Roth IRA with Fidelity &amp; truly would like to invest, but it says I need to choose funds, before I can do that. Any advice, tips or pointers would greatly be appreciated. I’ve been told to create a fans only account on RobinH&amp; work with numbers through there with a small fund, such as $10. I think this is a great idea, however I don’t really understand stocks, funds and which ones to choose from quiet exactly. I feel so dumb ☹️ however, I know it’s a process &amp; it takes time to learn. \n\n\nThank you",
        "subreddit": "stocks",
        "title": "Best Fidelity Funds to Invest In for beginners?",
        "url": "https://www.reddit.com/r/stocks/comments/gpgcfx/best_fidelity_funds_to_invest_in_for_beginners/",
        "created": 1590310251.0
    },
    {
        "author": "roptions",
        "created_utc": 1590241448,
        "id": "gp555j",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I’ve looked at different brokers, this is what they charge:\n\nFidelity/Etrade/IB - $0.65 per option contract.\nTasty - $1 per contract capped at $10 per trade\n\nI’ve been using fidelity and they seem to have good research tools. I’ve heard IB has tools on par with fidelity.\n\nHave you found any broker that’s cheaper?\n\nWhich one do you think have the most value for money based on tools they provide, order execution etc?",
        "subreddit": "options",
        "title": "Which brokerage do you use?",
        "url": "https://www.reddit.com/r/options/comments/gp555j/which_brokerage_do_you_use/",
        "created": 1590270248.0
    },
    {
        "author": "AnthonyRS791",
        "created_utc": 1590699392,
        "id": "gsen0q",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Hello all, after recently losing all of my monthly gains to a penny stock, I decided I wanted to play it a little more safe. I have been buying and selling several companies (GUSH, SCVL, etc.) daily and have gotten some okay results, but I want to get more. As of now I have $3000 in Fidelity (right where I started) and have done the math and to buy a share of each DOW company it would cost a hair under $4500. I can definitely put in another 1500 to match that, but I was wondering; would buying 1 share of every company be a good move? What companies in the DOW and stars and which ones are slugs? I was interested in the dividends and I figured if I do it this way I will make money as the DOW makes money. This was a really different (I think) concept that I have been thinking about for a couple days, and I just wanted to know your guys opinion on it. Thanks!",
        "subreddit": "stocks",
        "title": "Thinking about buying 1 share of each company from the DOW",
        "url": "https://www.reddit.com/r/stocks/comments/gsen0q/thinking_about_buying_1_share_of_each_company/",
        "created": 1590728192.0
    },
    {
        "author": "k1tch3nMitts",
        "created_utc": 1589549587,
        "id": "gk96oh",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "When selling CSPs, Have you guys ever had experience getting assigned on a put you sold well before the expiration day ?\n\nObviously getting assigned is not part of the end goal when I’m selling CSPs, but it can and has happened, both after the expiration/Friday of expiry.\n\nHave you ever had experience getting assigned during the middle of the day or well before the option expired?\n\nI called fidelity and they told me 9/10 , it’s most likely that when The option you sold is ITM that you will get assigned on expiration day or right before .",
        "subreddit": "options",
        "title": "Assignment",
        "url": "https://www.reddit.com/r/options/comments/gk96oh/assignment/",
        "created": 1589578387.0
    },
    {
        "author": "bwang29",
        "created_utc": 1590070519,
        "id": "gnxm7w",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Autists, I got burned with this, and want to post this to whoever is using Fidelity so you know how they process ITM expirations. Apparently, Fidelity will always exercise your ITM option regardless if you have the money to support it. So I woke up with -2000 shares in my account and couldn't buy it.\n\nI called their customer rep, and they said they can do a credit buy with no fee on their side, and I had to literally time the trade on the phone with the support rep to wait for the trade to be at least ITM again ... and it was really stressful (rep also wants to make sure I don't lose money, kudos to Fidelity rep)\n\nAfter \"we\" placed the trade, rep said I should have closed the position before it expired (which in this case it would have actually generated an additional $1k in profit for me), and Fidelity allows expired option on that day to trade for another 15 minutes after close (so I could have closed the position before 415PM).\n\nWhat's not cool is if this happens again in the future, the only way I can process a trade like this is by calling that rep again, and you can't do this credit thing yourself on their app or website.\n\nSo there you go, lost $1k on nothing, but a good lesson learned. Hope if helps other autists who use Fidelity.",
        "subreddit": "wallstreetbets",
        "title": "Fidelity - When your calls expire ITM but you don't have the cash to buy 2000 SPY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gnxm7w/fidelity_when_your_calls_expire_itm_but_you_dont/",
        "created": 1590099319.0
    },
    {
        "author": "jasonbdt666",
        "created_utc": 1590708807,
        "id": "gshgua",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I'm thinking to switch to either Charles Schwab or Fidelity.  I'm not considering Webull because Schwab and Fidelity's order  execution quality should be much better as compared Webull.\n\nI'm  planning to deposit about $6800 in my trading account and do 3 day  trades per week. So, I wanted to know whether I'll be able to make those  3 trades on a single day or one day after the other in one week. I'll  be using 100% of my buying power in each trade. Will good faith  violation be applied to my account on these trades or not? I’m confused  about whether 3 or less trades are allowed on same day or not, as the  full buying power may not be available because of unsettled funds. Will  the full buying power be available immediately after selling stocks  worth full buying power? Also, will any margin interest be applied to my account in the situations  stated  above?",
        "subreddit": "stocks",
        "title": "Which brokers provide instant settlement?",
        "url": "https://www.reddit.com/r/stocks/comments/gshgua/which_brokers_provide_instant_settlement/",
        "created": 1590737607.0
    },
    {
        "author": "lewiswc17",
        "created_utc": 1590863819,
        "id": "gtj9jh",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I’m looking for a alternative to the S&amp;P 500. I’m in the UK, I’m planning to put £500 - £1000 a month into a fund. I’m currently 18 and am planning to start at 20.\n\nFunds I’ve considered:\n\nFidelity Advisor Growth Opportunity Fund - M \nVanguards S&amp;P 500 Index",
        "subreddit": "investing",
        "title": "High return mutual funds UK ?",
        "url": "https://www.reddit.com/r/investing/comments/gtj9jh/high_return_mutual_funds_uk/",
        "created": 1590892619.0
    },
    {
        "author": "AshesToEarth",
        "created_utc": 1589821363,
        "id": "gm5e66",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I recently got a new job and have a 401k plan set up through fidelity with them. They give us 23 options to choose from and how much percentage of our contributions we want to allocate and where.\n\nMy question is why wouldn’t someone choose the best performing of all 23 options?? \n\nThe target date 2055 fund has a 10 y/LOF of 8.24% compared to the US Large cap EQ index fund which has a 10y/LOF of 11.69%. \n\nWhy wouldn’t everyone just put their money in the Large Cap fund? Both have similar risk levels from what fidelity shows. What am I not getting here?\n\nThere are other mutual funds with even higher returns (12-18%) offered through fidelity’s brokeragelink and they have only slightly higher expense ratios (.89 compared to .013). I just can’t imagine that those percentages would make such a difference that it wouldn’t be worth investing in those funds that claim a 18% return over 10 years.",
        "subreddit": "investing",
        "title": "Why would anyone choose a fund has less returns than another?",
        "url": "https://www.reddit.com/r/investing/comments/gm5e66/why_would_anyone_choose_a_fund_has_less_returns/",
        "created": 1589850163.0
    },
    {
        "author": "bwang29",
        "created_utc": 1590071233,
        "id": "gnxtjl",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I got burned by this, and want to post this to whoever is using Fidelity so you know how they process ITM expirations. Apparently, Fidelity will always exercise your ITM option regardless if you have the money to support it. So I woke up with -2000 shares in my account and couldn't buy it.\n\nI called their customer rep, and they said they can do a credit buy with no fee on their side, and I had to literally time the trade on the phone with the support rep to wait for the trade to be at least ITM again ... and it was really stressful (rep also wants to make sure I don't lose money, kudos to Fidelity rep)\n\nAfter \"we\" placed the trade, rep said I should have closed the position before it expired (which in this case it would have actually generated an additional $1k in profit for me), and Fidelity allows expired option on that day to trade for another 15 minutes after close (so I could have closed the position before 415PM).\n\nWhat's not cool is if this happens again in the future, the only way I can process a trade like this is by calling that rep again, and you can't do this credit thing yourself on their app or website.\n\nSo there you go, lost $1k on nothing, but a good lesson learned. Hope if helps other who use Fidelity.",
        "subreddit": "options",
        "title": "Fidelity - When your calls expire ITM but you don't have the cash to buy 2000 SPY",
        "url": "https://www.reddit.com/r/options/comments/gnxtjl/fidelity_when_your_calls_expire_itm_but_you_dont/",
        "created": 1590100033.0
    },
    {
        "author": "chinotruong",
        "created_utc": 1589606431,
        "id": "gkp7ec",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I’m 23 recent college grad and just open up a Roth. My employer got a 401k for me but I figure to get a Roth as well so I got 2 retirement plan going on. Start early huh. I got some money in my Roth but was wondering what fidelity mutual fund do you guys recommend that have a low expense fee yearly ?  \n\nThanks",
        "subreddit": "stocks",
        "title": "I’m 23 and recently investing. I got a Roth IRA what mutual can you recommend ? Thank you.",
        "url": "https://www.reddit.com/r/stocks/comments/gkp7ec/im_23_and_recently_investing_i_got_a_roth_ira/",
        "created": 1589635231.0
    },
    {
        "author": "Servletless",
        "created_utc": 1588540216,
        "id": "gcyb87",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I tried to close out my Fidelity account and a small amount got left behind i.e. some leftover dividend payment. Now they say to get that money out I have to make a \"phone call\" (WTF).\n\nWhat's the best TRADE to get this balance to $0 OR LESS while risking an accidental profit?\n\nThe account is Margin and Level 4 Options approved.\n\nCurrent balance is $35.77",
        "subreddit": "wallstreetbets",
        "title": "best way to zero out an account balance?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gcyb87/best_way_to_zero_out_an_account_balance/",
        "created": 1588569016.0
    },
    {
        "author": "produceprodigy7",
        "created_utc": 1588782613,
        "id": "gena9w",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Recently moved my brokerage account from Robinhood, over to fidelity. My 401k was already through fidelity so I thought the move only made sense. I do find that the fidelity app however is not really geared towards trading as much as im used to? Could just be me.. are there any apps that could link with my fidelity account so I could view my postions in real time etc ?",
        "subreddit": "investing",
        "title": "Fidelity app",
        "url": "https://www.reddit.com/r/investing/comments/gena9w/fidelity_app/",
        "created": 1588811413.0
    },
    {
        "author": "SynFisa",
        "created_utc": 1588727611,
        "id": "geafjr",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I've been a long time customer of Vanguard, and i've been trying to find an alternative. I don't feel the security at Vanguard is up to modern standards. They require/fall back to SMS for two factor authentication, which isn't really secure at all. And almost worse, to do a Wire i need to call them (inconvenient) and their only security is an SMS to my account. No password needed even, pretty insane. Was already turning a blind eye to SMS for too long, and then once i realized how poor the security was for wiring large amounts of money, i was pretty rattled. \n\n&amp;#x200B;\n\nI looked at some others like Fidelity and I don't really like their options. They require Symantec VIP for 2FA (much rather use traditional tokens like Authy). Saw reports of various companies that use Symantec VIP that just allow you to call to reset your account in case you lost the device the Symantec VIP app is on. \n\n&amp;#x200B;\n\nAre there any more modern companies that handle this stuff better?",
        "subreddit": "investing",
        "title": "Looking for Vanguard alternative (poor security options)",
        "url": "https://www.reddit.com/r/investing/comments/geafjr/looking_for_vanguard_alternative_poor_security/",
        "created": 1588756411.0
    },
    {
        "author": "Kindofathrowawayidk",
        "created_utc": 1590951555,
        "id": "gu4pfg",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " I’m pretty young, so until I am a bit older and wiser and trust myself to invest a bit more aggressively, I have been putting my money into index funds. I go through fidelity, so I have an international fund, their 500 fund, and their expanded market fund. \n\n I also invest some cash into a few common stock, so I can reap a little bit of money in the short occasionally, and have the satisfaction of owning shares of companies that I have faith in. These are almost always tech, but sometimes I dip my toes into retail and more recently have been buying some fractional shares of Tesla.\n\n I have been wondering, would it be stupid to buy into Fidelity’s FTEC ETF rather than owning some shares of tech companies outright? It seems like for most people it is either ETFs or Index funds depending on whether or not you want tax benefits, but I feel like putting my tech money into FTEC would give me more diversity in the sector, and ensure stronger gains in the future considering that I am so young.",
        "subreddit": "investing",
        "title": "Is it unwise to own ETFs and Index Funds?",
        "url": "https://www.reddit.com/r/investing/comments/gu4pfg/is_it_unwise_to_own_etfs_and_index_funds/",
        "created": 1590980355.0
    },
    {
        "author": "withoutbliss",
        "created_utc": 1589984347,
        "id": "gnc5qw",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "got in @1.2",
        "subreddit": "shroomstocks",
        "title": "NUMI:CA US fidelity",
        "url": "https://www.reddit.com/r/shroomstocks/comments/gnc5qw/numica_us_fidelity/",
        "created": 1590013147.0
    },
    {
        "author": "investinchuck",
        "created_utc": 1588898746,
        "id": "gfj28o",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hey fellas, I’m a novice trader who’s still trying to learn and I do all my trading through fidelity. \n\nI’m up pretty big on a pennystock after hours, and my question is can I sell after hours for the price that it’s at, or would it not go through until the market opens, at which it would sell at the price it is whatever it opens at? \n\nThanks in advance",
        "subreddit": "stocks",
        "title": "Question about selling after hours",
        "url": "https://www.reddit.com/r/stocks/comments/gfj28o/question_about_selling_after_hours/",
        "created": 1588927546.0
    },
    {
        "author": "songtailor",
        "created_utc": 1589241335,
        "id": "ghzltm",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Question: I already have like 6,200 shares in the stock DECN through Fidelity. I bought those like a month ago before the stock was suspended. It seems like all other companies BUT Fidelity are trading it now. I get the message: \"(TC9050) Opening transactions for Caveat Emptor are not permitted because of the risks associated with these securities and all Microcap securities.\"\n\nThere is no ask or bid price listed on Fidelity. Both are 0. I called and spoke to a Fidelity trading rep and I asked what that message means. She said, \"I don't know.\"  She basically said to keep checking it every day until it is trading. Doesn't make any sense. \n\nCan anyone explain what this is and why they won't let me buy it? DTTC reinstated the stock last week, obviously. The price is visible bouncing up and down on Fidelity's website all throughout the day, which is ignorant because they won't let me buy it. Every time I call, they keep asking, \"Are you trying to sell?\"  It was like talking to a wall with two different people. I said, \"No, I'm trying to BUY MORE\" and they were clueless.\n\nI'm reading that other people on Schwab, Vanguard, etc., are trading this stock. Why would Fidelity block it? I'm puzzled by the part of their message that particularly says, \"...because of the risks associated with these securities and all Microcap securities.\"\n\nWhat the heck? ALL stocks and securities have risks associated with them. You could lose money at any time.",
        "subreddit": "pennystocks",
        "title": "What does this stock trading message actually mean?",
        "url": "https://www.reddit.com/r/pennystocks/comments/ghzltm/what_does_this_stock_trading_message_actually_mean/",
        "created": 1589270135.0
    },
    {
        "author": "16CCZ71RG",
        "created_utc": 1588972183,
        "id": "gg1qti",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Fidelity Go once again ranked high in Backend Benchmarking's Q1 2020 Robo Report.\n\nFor 3-year trailing results, SigFig, Fidelty Go, and Axos Invest (formerly WiseBanyan) placed 1st, 2nd, and 3rd, respectively, for total performance compared to the benchmark.\n\nAmong the trends noted in the quarterly report, large-cap stocks outperformed small-cap, domestic equities outpaced international, and growth stocks performed significantly better than value. Best performing sectors included technology, healthcare, and consumer staples.\n\nThese trends reflect the Q1 instability caused by the Covid-19 global pandemic.\n\nI have a Fidelity Go account, which has held up surprisingly well considering the market volatility. Performance as of 5/8/2020:\n\nLife of account (8/19) - (-) 5.22%\nYTD - (-)11.58%\n3-Month - (-)10.89%\n1-Month - (+) 9.27%\n\nThe Robo Report can be accessed here:\n\n[Q1 2020 BackendBenchmarking Robo Report](https://www.backendbenchmarking.com/the-robo-report/)",
        "subreddit": "investing",
        "title": "SigFig, Fidelity Go and Axos Invest ranked Top 3 Robo platforms fot Q1 2020 in new Robo Ranking report",
        "url": "https://www.reddit.com/r/investing/comments/gg1qti/sigfig_fidelity_go_and_axos_invest_ranked_top_3/",
        "created": 1589000983.0
    },
    {
        "author": "honeycall",
        "created_utc": 1589614813,
        "id": "gkqrvu",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Title says it all. I noticed all three companies launched this service with zero commissions. All seem tempting but I thought I’d do some research and hear some of your personal experiences.",
        "subreddit": "investing",
        "title": "Schwab, Fidelity, and RH all rolled out fractional shares. Which have you had the best experience with?",
        "url": "https://www.reddit.com/r/investing/comments/gkqrvu/schwab_fidelity_and_rh_all_rolled_out_fractional/",
        "created": 1589643613.0
    },
    {
        "author": "bigtitfilipino",
        "created_utc": 1588839149,
        "id": "gf2i6k",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hi! I am a 21f (only included my gender if someone has a gender specific suggestion like taking into account pregnancy or something) looking to buy stocks for long term gains, not primary income or short term profit. The only account I have is a ROTH IRA with fidelity and ~$5000 in the account. When I graduate college my financial goals will change as I will most likely be saving for more short term expenses, but for right now, my goal is to begin saving up for retirement. Before I spend any of my money, though, I want to educate myself as much as possible. Essentially, I want to learn from you. If you started out with the same goals as mine and have been in the game long, are there any advices you could give me? Even if our goals are not the same, i would still appreciate any input you are willing to offer. \n\nThank you so much! All your responses, no matter how brief, will help me prepare for my future.",
        "subreddit": "stocks",
        "title": "I want to learn from you — what would you have done differently?",
        "url": "https://www.reddit.com/r/stocks/comments/gf2i6k/i_want_to_learn_from_you_what_would_you_have_done/",
        "created": 1588867949.0
    },
    {
        "author": "benztof",
        "created_utc": 1589031187,
        "id": "ggfhpe",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "If the VTIQW warrant option is at $5.50 and from what I understand it gives you a few years to purchase at $11.  VTIQ is at $16+ so why not just purchase the warrant option and claim it to get in at a lower price of $11.\n\nAlso, how would you go about claiming the warrant option at a later date.  Is it an option on my Fidelity account that’s easy to use?",
        "subreddit": "stocks",
        "title": "VTIQW Question",
        "url": "https://www.reddit.com/r/stocks/comments/ggfhpe/vtiqw_question/",
        "created": 1589059987.0
    },
    {
        "author": "johnwhick1",
        "created_utc": 1588792650,
        "id": "geqhqb",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Are you only able to buy fractional shares on the fidelity app? and not the website",
        "subreddit": "investing",
        "title": "Fidelity Fractional Shares",
        "url": "https://www.reddit.com/r/investing/comments/geqhqb/fidelity_fractional_shares/",
        "created": 1588821450.0
    },
    {
        "author": "jmr106",
        "created_utc": 1589561189,
        "id": "gkcoh4",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I have thousandsof shares locked in Fidelity. They aren't trading the stock anymore at all per a broker. Are there any companies out there where I can trade in a Roth IRA or is it strictly stuff like TD Ameritrade where I can only buy grey stocks? Not looking for stock opinions, just where I can currently buy it.",
        "subreddit": "stocks",
        "title": "Where can I buy DECN shares on grey market?",
        "url": "https://www.reddit.com/r/stocks/comments/gkcoh4/where_can_i_buy_decn_shares_on_grey_market/",
        "created": 1589589989.0
    },
    {
        "author": "PsilocybinAlpha",
        "created_utc": 1589846681,
        "id": "gmdjji",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Just an FYI for those of you that are hoping Fidelity will allow access to NUMI on TSXV, you must first request international trading permissions on your account (if you haven't done so already).\n\nThe process involves a phone call, so if you're planning to trade Wednesday morning it is best to do so ASAP. [More information here](https://www.fidelity.com/customer-service/how-to-enable-international-trading). \n\nThere is a lot of uncertainty over which brokerages will allow non-Canadians to access NUMI this Wednesday. If anyone has any reliable information, please do let us know.",
        "subreddit": "shroomstocks",
        "title": "FYI: Anyone planning to buy NUMI via Fidelity must sign up for international trading in advance",
        "url": "https://www.reddit.com/r/shroomstocks/comments/gmdjji/fyi_anyone_planning_to_buy_numi_via_fidelity_must/",
        "created": 1589875481.0
    },
    {
        "author": "LostCucumber69",
        "created_utc": 1589377582,
        "id": "gizc5o",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I just like many people bought DECN before their suspension. On fidelity it doesn’t let me sell or buy more because there isn’t a bid or ask price. Is there something I’m missing or is everyone the same? I’m pretty new at this so not to knowledgeable about OTC",
        "subreddit": "pennystocks",
        "title": "Why can’t I sell?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gizc5o/why_cant_i_sell/",
        "created": 1589406382.0
    },
    {
        "author": "wives_boyfriend",
        "created_utc": 1590044081,
        "id": "gnry1m",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Whenever looking at the options spreads on TOS compared to say Fidelity Active Trader Pro TOS always seems to lack at least 1-2 seconds for me. Is there something wrong in my TOS settings?\n\nI have a trading computer (128GB RAM 2 TB HD top AMD chip excellent graphics card etc etc) and I have 400 speed internet wired in... \n\n&amp;#x200B;\n\nIs there something  I need to do on TOS or is it truly a little laggy these days?\n\nIt sucks trying to execute an option trade to already be 5-10 cents the other direction or even in the right direction. .",
        "subreddit": "options",
        "title": "Has Anyone Noticed that Think or Swim Seems to Be Delayed 1-2 Seconds on Options Spreads?",
        "url": "https://www.reddit.com/r/options/comments/gnry1m/has_anyone_noticed_that_think_or_swim_seems_to_be/",
        "created": 1590072881.0
    },
    {
        "author": "Silent71Knight",
        "created_utc": 1589021311,
        "id": "ggde39",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "So currently I use Robinhood and plan on switching. Yes they do offer fractional shares but when your on a waiting list behind 2.7mil people it's kinda pointless lol. \n\n\nThere are companies now that I would love to invest in but don't have the funds to purchase them TSLA, AMZN ect. \n\nI've heard M1 Finance has fractional shares and I believe fidelity. Anyways if you guys have any recommendations please let me know!",
        "subreddit": "investing",
        "title": "Can anyone recommend a decent Broker w/ fractional shares?",
        "url": "https://www.reddit.com/r/investing/comments/ggde39/can_anyone_recommend_a_decent_broker_w_fractional/",
        "created": 1589050111.0
    },
    {
        "author": "Coolin_N_Booted",
        "created_utc": 1589768979,
        "id": "glstpe",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "This may be a simple/ dumb question but here it goes. Using Fidelity, could I place an after hours trade now ( Sunday 10:30pm)? I know there has to be the volume for it etc., but is it possible for the order to execute this late or will it carry over to 7am tomorrow? I'm using a limit order also if that matters.",
        "subreddit": "stocks",
        "title": "After Hours Trading",
        "url": "https://www.reddit.com/r/stocks/comments/glstpe/after_hours_trading/",
        "created": 1589797779.0
    },
    {
        "author": "BamBamBrowning",
        "created_utc": 1590515451,
        "id": "gr1vco",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hope y’all are sifting through google and fidelity news tubes",
        "subreddit": "investing",
        "title": "Space X is launching tomorrow!",
        "url": "https://www.reddit.com/r/investing/comments/gr1vco/space_x_is_launching_tomorrow/",
        "created": 1590544251.0
    },
    {
        "author": "jasonbdt666",
        "created_utc": 1590639735,
        "id": "grzceu",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hello, I'm thinking to change my broker and need opinions on which broker is better and why. I would appreciate if you guys could tell me what you think about Fidelity, Charles Schwab, Etrade, TD ameritrade based on their trading tools, news and research, trade execution quality, paid/free subscriptions etc.",
        "subreddit": "stocks",
        "title": "Fidelity, Charles Schwab, Etrade, TD ameritrade...which one's better?",
        "url": "https://www.reddit.com/r/stocks/comments/grzceu/fidelity_charles_schwab_etrade_td_ameritradewhich/",
        "created": 1590668535.0
    },
    {
        "author": "mtdiaboman",
        "created_utc": 1590739402,
        "id": "gsooqb",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I am posting this for a group of us at work, so your input is important.  \n\n**Background:**   Our 401K's provided by our company, and managed by Fidelity, do not allow us to purchase any individual stocks (exception is our own company stock)... only funds and ETFs.   Most of my friends at work were hit hard by the downturn, and lost approximately 35% of their value.   I am a pretty active options trader outside of work, and have a number of research subscriptions and tools at my disposal, so I exited my S&amp;P heavy 401K postitions almost concurrent to the decline in February.   I carried cash all the way to the bottom, repurchased near/at the bottom, and rode it back until last week.  My 158K portfolio pre-crash is up approximately 40K.   As of last week, I was 100% back in Money Market funds, because I  believe the S&amp;P and Nasdaq is just being propped up too much by 20% of the companies listed.   Individual PE ratios are three digits on most, and nobody wants to admit the emperor has no clothes.  I intend to wait with cash until June, July, or even August if I have to before buying. (Please don't hate on me for \"market timing\" my 401K, but I'm 8 years from retirement)  One of the my co-workers is frozen right now in fear of losing his hard earned gains, and looking at different, more focused ETFs and Funds instead of pushing into money market funds or bonds.    This is a focused and well educated investor, and the fear on his face is palpable. \n\n**This brings us to today.**   My Co-workers are today (almost) back in the green,  having made adjustments to their portfolio, and asked me what I would do to protect the impending crash.  Your thoughts?",
        "subreddit": "investing",
        "title": "401K Portfolio Decisions to Make",
        "url": "https://www.reddit.com/r/investing/comments/gsooqb/401k_portfolio_decisions_to_make/",
        "created": 1590768202.0
    },
    {
        "author": "bennybouch",
        "created_utc": 1590073987,
        "id": "gnyn9h",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Has anyone been able to do this? Trying to protect some profits in TLSS but it won't let me put the order in. Have only tried online, but not on their Active Trader Pro or the app yet...",
        "subreddit": "pennystocks",
        "title": "Stop Loss or Stop Limit on OTC stocks with Fidelity?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gnyn9h/stop_loss_or_stop_limit_on_otc_stocks_with/",
        "created": 1590102787.0
    },
    {
        "author": "obsidian1293",
        "created_utc": 1588548020,
        "id": "gd0fw1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I've been trading FNILX recently and it usually takes several days between when I place an order and when it's actually filled. During this time the price can change 5-10% in this market and it's very frustrating for a newer investor. I'm aware of the times and days that the market is open but my orders are going multiple days where they could be traded but they aren't. \n\nAre there other trading platforms or index funds that will not have this same problem? Is this just how all index funds work?",
        "subreddit": "investing",
        "title": "Why does it take so long to confirm an order on fidelity?",
        "url": "https://www.reddit.com/r/investing/comments/gd0fw1/why_does_it_take_so_long_to_confirm_an_order_on/",
        "created": 1588576820.0
    },
    {
        "author": "goodbrews",
        "created_utc": 1588912349,
        "id": "gfmdmn",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I am new to trading so please bear with me.   I have quickly come to realize how important it is to set stop losses.  I signed up with Fidelity bc I heard that they have a pretty good selection of stop loss options.  I bought a few shares of VUZI today to play around with the stop loss options.  I chose to do a   trailing stop loss by percentage.   I bought in at  2.1656.  I set a trailing stop loss at 4% based on bid for half the shares and it sold almost immediately at 2.3006.  I wasn't sure why it sold almost immediately so i tried again for the remainder at 7% and it sold shortly thereafter (at 2.3315 - again seemed premature).   Missed the ride to the top.   if you look at the ride from 10-11 am today (2.15-2.38), there were barely any dips.  Certainly not a 7% dip.  It would have had to dip from 2.5-2.38 for a 7% change.   What am I doing wrong?   Am I misunderstanding this?\n\nAlso, I see that I was charged .1 fees for these small share test runs.  Not a big deal, but I thought Fidelity was no fee and no commission.  I'm trying to learn how to do all of this and don't want to put any significant money into play right now.  E-trade wouldn't allow me to do stop-loss trail on penny stocks.  I tried webull and had an issue there as well.   Why is Fidelity charging fees?",
        "subreddit": "stocks",
        "title": "Stop losses",
        "url": "https://www.reddit.com/r/stocks/comments/gfmdmn/stop_losses/",
        "created": 1588941149.0
    },
    {
        "author": "InformalNature5",
        "created_utc": 1589087873,
        "id": "ggvgyp",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nDoes anyone know where I can find the exact composition and weightage of the individual stocks which make up any given ETF?\n\nFor example:\n\nAn ETF is XLF (Financial Select Sector SPDR Fund). How do I know what stocks exactly it is made up of and what is the weightage of each of those stocks making up this ETF?\n\nWhere can I find this info?\n\nI googled around and the most I could find is that Fidelity seems to provide \"portfolio composition file (PCF)\" for ETFs but I am guessing it would be a paid service.\n\nDTCC also seems to provide something similar, but based on their website I could not find anything other than \"Interested in ..........? Contact us\"\n\nDoes anyone know a free way to find this info? or can point me in the direction to find this?\n\nThanks",
        "subreddit": "investing",
        "title": "Composition and weightage of ETF components",
        "url": "https://www.reddit.com/r/investing/comments/ggvgyp/composition_and_weightage_of_etf_components/",
        "created": 1589116673.0
    },
    {
        "author": "UnlimitedBurners001",
        "created_utc": 1589838122,
        "id": "gmaxfu",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hello, everyone,three-fund I'm new to the investing world and about to start a three-fund portfolio with Fidelity. I'm planning to invest $10k, but before I confirm my choices I just want your opinions on my choices.\n\n1) Fidelity® Total Market Index Fund(FSKAX) \n\n2) Fidelity® Total International Index Fund (FTIHX)\n\n3) Fidelity® U.S. Bond Index Fund(FTBFX)\n\nI'm still thinking about the percentage for each one but I'm thinking 60-20-20. Thank you for your time and suggestions.",
        "subreddit": "investing",
        "title": "Fidelity Three Fund Portfolio Help",
        "url": "https://www.reddit.com/r/investing/comments/gmaxfu/fidelity_three_fund_portfolio_help/",
        "created": 1589866922.0
    },
    {
        "author": "fuckingstruggling",
        "created_utc": 1588471913,
        "id": "gciouh",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "What would my best option be, putting money in a mutual fund or an ETF? If I go the mutual fund route, it would be through Fidelity. Are there any specific ones I should be looking out for that are worthwhile?",
        "subreddit": "investing",
        "title": "Mutual Fund or ETFs",
        "url": "https://www.reddit.com/r/investing/comments/gciouh/mutual_fund_or_etfs/",
        "created": 1588500713.0
    },
    {
        "author": "cj-psych-54",
        "created_utc": 1589992329,
        "id": "gnemd4",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "shroomstocks",
        "title": "Why don’t I see NUMI on Fidelity?",
        "url": "https://www.reddit.com/r/shroomstocks/comments/gnemd4/why_dont_i_see_numi_on_fidelity/",
        "created": 1590021129.0
    },
    {
        "author": "gotem232",
        "created_utc": 1589223831,
        "id": "ghu26f",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Hello everyone my first time selling options on Fidelity. I see that after I sold to open some contracts, the contract value is actually being counted towards my account balance (if the contract goes up in price its showing a negative to my balance). In reality it shouldn't right? Either I get exercised and need to pay the strike on the shares or I collect the premium, my balance shouldn't be affected by the actual contract prices. Im also not seeing the premium paid out anywhere in my account",
        "subreddit": "options",
        "title": "Selling naked puts on Fidelity",
        "url": "https://www.reddit.com/r/options/comments/ghu26f/selling_naked_puts_on_fidelity/",
        "created": 1589252631.0
    },
    {
        "author": "Fresh2Trades",
        "created_utc": 1590189723,
        "id": "gou6wg",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I’m relatively new to investing and have tried TDA, Fidelity, Robinhood, and Webull for investing. I’m moving more towards dividend investing for long term growth and want a broker that keeps up with me (in terms of keeps up to date with looks, functionality, other “trends” with other brokerages). \n\nI wasn’t the biggest fan of TDA and was unsure with the Schwab buyout if I would continue to like it after the changes. I kept my account, but for minor trades. \n\nRobinhood is where I started a couple years back before I got serious. I’m keeping the account, but I’m not sure I want to keep it for long term investments. Love the UI and ease of use. Fractional shares on the way. \n\nWebull is awesome, but customer service is probably the lowest out of this list. But I really like the interface and the information available. Plus it shows you the incoming dividend amounts as well as historical dividends. Fractional shares coming soon so I hear. \n\nFidelity is smooth, but has a very clunky interface. I have a Roth here as well as employer 401k. If they would just update their app some, this one may be the top of the line. Plus fractional shares are awesome. \n\nThoughts? Any options would be appreciated.",
        "subreddit": "investing",
        "title": "Getting into dividend investing",
        "url": "https://www.reddit.com/r/investing/comments/gou6wg/getting_into_dividend_investing/",
        "created": 1590218523.0
    },
    {
        "author": "ReadTheStatement",
        "created_utc": 1590014814,
        "id": "gnkwyk",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "# **Comparison of Online Investment Services**\n\nHello, r/Investing! I am back again, this time with a comparison of online investment services, like the ones listed below. As this is version 1, any suggestions on information to include in future versions would be helpful!\n\nThank you to the few people who followed my profile page yesterday, I will make that worth your while soon. The best thank you I can get is an upvote here.\n\nIf you know any other services you would like to be added, or a community that would benefit from this information, please let me know.\n\nLet’s get into it...\n\n||[**Charles Schwab**](https://www.schwab.com/)|[**Fidelity**](https://www.fidelity.com/)|[**E*Trade**](https://us.etrade.com/home)|[**TD Ameritrade**](https://www.tdameritrade.com/home.page)|[**Ally Invest**](https://www.ally.com/)|[**M1 Finance**](https://www.m1finance.com/)|[**SoFi Invest**](https://www.sofi.com/)|[**Robinhood**](https://robinhood.com/us/en/)|[**Cash App**](https://cash.app/)|[**Public**](https://public.com/)|\n|--|--|--|--|--|--|--|--|--|--|--|\n|[*Account Maintenance Fee*](https://www.finder.com/common-monthly-maintenance-fees)|$0|$0|$0|$0|$0|$0|$0|$0|$0|$0|\n|*Account Minimum*|$0|$0|$0|$0|$0|$0|$0|$0|$0|$0|\n|*Trading Fees (Stock &amp; ETF)*|$0|$0|$0|$0|$0|$0|$0|$0|$0|$0|\n|[*Idle Cash Interest*](https://www.investopedia.com/terms/s/sweepaccount.asp)|0.17%|0.01%|0.01%|0.01%|0%|0%|0%|0.3%|0%|0%|\n|[*Insurance*](https://www.sipc.org/)|$600M ($1.15M Cash)|$1B ($1.9M Cash)|$600M ($900K Cash)|$500M ($2M Cash)|$150M ($900K Cash)|$150M ($900K Cash)|$500K ($250K Cash)|$500K ($250K Cash)|$500K ($250K Cash)|$500K ($250K Cash)|\n|[*Mutual Funds*](https://www.investopedia.com/terms/m/mutualfund.asp)|Yes|Yes|Yes|Yes|Yes|No|No|No|No|No|\n|[*Retirement Accounts*](https://www.investopedia.com/terms/i/ira.asp)|Yes|Yes|Yes|Yes|Yes|Yes|Yes|No|No|No|\n|[*Taxable Accounts*](https://www.bogleheads.org/wiki/Taxable_account)|Yes|Yes|Yes|Yes|Yes|Yes|Yes|Yes|Yes|Yes|\n|[*College Savings Plan*](https://www.sec.gov/reportspubs/investor-publications/investorpubsintro529htm.html)|Yes|Yes|Yes|Yes|No|No|No|No|No|No|\n|[*Options*](https://www.investopedia.com/terms/o/option.asp)|Yes|Yes|Yes|Yes|Yes|No|No|Yes|No|No|\n|*Options Fee*|$0.65 / Contract|$0.65 / Contract|$0.65 / Contract|$0.65 / Contract|$0.50 / Contract|N/A|N/A|$0 / Contract|N/A|N/A|\n|[*Futures*](https://www.investopedia.com/terms/f/futurescontract.asp)|Yes|No|Yes|Yes|No|No|No|No|No|No|\n|*Futures Fee*|$1.50 / Contract|N/A|$1.50 / Contract|$2.25 / Contract|N/A|N/A|N/A|N/A|N/A|N/A|\n|[*Cryptocurrency (BTC)*](https://www.investopedia.com/terms/c/cryptocurrency.asp)|No|No|No|No|No|No|Yes|Yes|Yes|No|\n|[*Fractional Shares*](https://www.investopedia.com/terms/f/fractionalshare.asp)|Yes|Yes|No|No|No|Yes|Yes|Yes|Yes|Yes|\n\n## **Future Chart Ideas**\n\n - Number of Customers\n - Years since Founding\n - Assets Under Management\n - Minimum Investments\n - Data Rate\n - Average Customer Rating\n - ”Unique Features”\n - International Access\n - Limits\n\n(Will add suggestions here with each edit)\n\n## **Future Service Additions**\n\n - Interactive Brokers\n - Meryl Edge\n - Tastyworks\n - thinkorswim\n - TradeStation\n\n(Will add suggestions here with each edit)",
        "subreddit": "investing",
        "title": "Comparison of Online Investment Services",
        "url": "https://www.reddit.com/r/investing/comments/gnkwyk/comparison_of_online_investment_services/",
        "created": 1590043614.0
    },
    {
        "author": "chp110",
        "created_utc": 1590540672,
        "id": "gr9jij",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I've done tons of buys for Calls and Puts on RH, very easy to do and easy to know how fast i'm losing money.  I've tried moving over to my fidelity account and they have only allowed me to work with level 1 Option trading,  'Covered call writing of equity options.'\n\nOn my Fidelity account I've under stood this as selling calls.  I've tried this on some banking stocks as i don't see them going up any time soon.  I've purchased CIT at $16.08 per share, 200 shares.  I've sold 1 option contract to open a position at $0.62 contract for a 6/19 $19c strike.\n\n[Positions](https://imgur.com/a/OtfWwiq)\n\nFrom my understanding, i already have the shares, so my risk is limited; if the contract is exercised, i sell the shares at $19 per share, i already own, them i make $3 per share.  Plus i get the contract premium from the buyer.\n\nWhen do i get the $62 for the options contract?  \n\nMy position is showing -57% loss at this time.  Is this correct?\n\nAm i completely wrong here?",
        "subreddit": "options",
        "title": "Am I doing this right? Selling to Open a new position.",
        "url": "https://www.reddit.com/r/options/comments/gr9jij/am_i_doing_this_right_selling_to_open_a_new/",
        "created": 1590569472.0
    },
    {
        "author": "ChrisF12000",
        "created_utc": 1588965368,
        "id": "gfzk2s",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "On fidelity it said that DECN went down to .2 for a few minutes, and my holdings were near worthless. It's fine now back at .18 though. What's up with this?",
        "subreddit": "pennystocks",
        "title": "Did my app glitch or did DECN just drop to 0.2 for a minute there?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gfzk2s/did_my_app_glitch_or_did_decn_just_drop_to_02_for/",
        "created": 1588994168.0
    },
    {
        "author": "psychoticempanada",
        "created_utc": 1589810580,
        "id": "gm20pg",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I’m curious about the best blend of security/reliability but also immediate trading once you make a deposit? I have a decent amount of money on fidelity and whenever I deposit $5-20K I can’t access it immediately. I then have to call, waste 30-90 minutes working with fidelity to execute the trade.",
        "subreddit": "wallstreetbets",
        "title": "Best platform for trading options immediately once you deposit the money?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gm20pg/best_platform_for_trading_options_immediately/",
        "created": 1589839380.0
    },
    {
        "author": "jpark4696",
        "created_utc": 1590223101,
        "id": "gp1k49",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "\n\nI just graduated from college and finally started making money, I want to set aside some money into roth IRA. After some research, I’m thinking of these fidelity funds but I can't really decide between the followings:\n\nFSKAX vs FZROX - US\n\nFTIHX vs FZILX - International \n\nI read some articles and reddit posts and it seems like they both are equally good???\n\n I'm still totally new at this so any insights would be helpful!  Also, dumb question, but is it a bad time to invest right now? I assumed no since market is low right but eventually it would recover?",
        "subreddit": "investing",
        "title": "ROTH IRA?",
        "url": "https://www.reddit.com/r/investing/comments/gp1k49/roth_ira/",
        "created": 1590251901.0
    },
    {
        "author": "CorgiLady",
        "created_utc": 1589512497,
        "id": "gk1dhf",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I’m transferring both my husbands and I’s Roth IRAs to Fidelity and I’ve already moved my previous employers 401k to a rollover IRA with Fidelity. We’re open to moderate risk, something like 80% stocks and 30% bonds. Any suggestions on what ETFs to go with?",
        "subreddit": "investing",
        "title": "Betterment to Vanguard ETF",
        "url": "https://www.reddit.com/r/investing/comments/gk1dhf/betterment_to_vanguard_etf/",
        "created": 1589541297.0
    },
    {
        "author": "jusjudge",
        "created_utc": 1590347245,
        "id": "gpvciq",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "So I'm thinking about stepping away from Crypto. I would like to take that money and invest in stocks instead. Any good YouTube videos or articles I can watch as a beginner? I have an acc with Fidelity but I usually focus on mutual funds. Would I be better off getting stocks on a different website/application?",
        "subreddit": "investing",
        "title": "Thinking about stepping away from Crypto...",
        "url": "https://www.reddit.com/r/investing/comments/gpvciq/thinking_about_stepping_away_from_crypto/",
        "created": 1590376045.0
    },
    {
        "author": "Halcyon2021",
        "created_utc": 1590522064,
        "id": "gr41ki",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hey all,\n\nWent through the portfolio with my Fidelity advisor last week, big takeaway is that I'm too heavy on S&amp;P 500 index funds, which I knew. My perspective was that it's just been doing so well why bother going into international to get a worse return? In any event, I really should and plan to diversify. Wanted to get thoughts on some good potential funds out there, maybe some small cap and international is way to go? nasdaq index? and may be a smidge, 5-10% in bonds. I'm an aggressive investor knowing that in the long run it pays to be in stocks. In my 40's currently. \n\nLastly, will likely put some money into Fidelity separately managed accounts to give it a try. curious if anyone had any thoughts there. Thanks in advance!",
        "subreddit": "investing",
        "title": "Too heavy into S&amp;P 500. Need to diversify... suggestions?",
        "url": "https://www.reddit.com/r/investing/comments/gr41ki/too_heavy_into_sp_500_need_to_diversify/",
        "created": 1590550864.0
    },
    {
        "author": "Tostitos153",
        "created_utc": 1589946339,
        "id": "gn41y7",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Investing vs Saving\n\nHello friends. So ever since this pandemic hit, I’ve been floating around the idea of financial freedom, so I’ve been researching a lot deeper into the stock market and investing. Since March, I’ve learned an exponential amount thanks to YouTube. I just opened up my first fidelity investment account and have invested into one mutual fund. I am planning on opening up a Roth IRA as well as investing in more index funds. \nAlthough investing is one of the best ways to use your money, I’ve also been flirting with researching into real estate. According to many wealthy people, real estate has the most potential to become very wealthy much faster than investing a few decades into the stock market. Ideally, I would like to buy a duplex or triplex, and reside in one so I can have it all paid off while I work. The thing is, in order to do this I need to have money saved to put down at least 20%. \nSo my question is, should I continue to invest tiny amounts into the stock market every month while saving to buy my first property, or should I invest larger amounts and ave up slowly? I make a little less than the average American income. For those who are experienced in both fields, what would you advise? \nThank you",
        "subreddit": "investing",
        "title": "Saving vs investing",
        "url": "https://www.reddit.com/r/investing/comments/gn41y7/saving_vs_investing/",
        "created": 1589975139.0
    },
    {
        "author": "mycoalswin",
        "created_utc": 1589658677,
        "id": "gl14as",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi all! Trading on RH but I don't have access to my Fidelity Active Trader Pro for a while, and my current laptop I have is probably too slow to run it lol. Any suggestions for websites or iPad apps that have real-time quotes? Thank you!",
        "subreddit": "pennystocks",
        "title": "Need Suggestions for Real-Time Tracking",
        "url": "https://www.reddit.com/r/pennystocks/comments/gl14as/need_suggestions_for_realtime_tracking/",
        "created": 1589687477.0
    },
    {
        "author": "hoppycolt",
        "created_utc": 1588820630,
        "id": "geyn2o",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "So I was under the impression that if you sell a covered call and the contract ends up being ITM upon expiration that you *could* be assigned and your shares be sold to whoever decided to exercise their option. I use Fidelity and it seems they will always assign your shares if it ends up ITM. Do all brokerages do this?",
        "subreddit": "options",
        "title": "Covered call question regarding assignment",
        "url": "https://www.reddit.com/r/options/comments/geyn2o/covered_call_question_regarding_assignment/",
        "created": 1588849430.0
    },
    {
        "author": "jmr106",
        "created_utc": 1590197224,
        "id": "gow5i4",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I've been buying a certain stock through Fidelity Roth IRA. They have stopped trading the stock. It shows up on their website every day with a price that is going up and down based on the trading from other platforms that are trading it (Schwab, TD Ameritrade, etc.), but Fidelity has a 0 Ask and 0 Bid price every single day for the stock. I've been told by one of their reps that they aren't trading the stock.\n\nThe stock went from Pink Sheets to grey and likely will go back to Pink Sheets in the future, but probably not within a reasonable time frame. That happened because of the SEC taking a peek at the stock, suspending it and then basically \"timing out\" in their response and not even issuing a reason as to why they suspended it. Nothing wrong was found and it has been restored on some platforms, just not on Fidelity.\n\nOther people on various forums who trade the same stock are saying that I should open a TD Ameritrade account. What kind of taxes do I have to pay for something like that? Say that I transfer money into it, buy into a stock and it makes me like $100K that I want to sell. What happens with that? Am I taxing it like regular income, under some kind of odd trade income or what? I want to make sure that my tax stuff is in order before doing any trading like that. I've never done it outside of a Roth IRA. Got any advice?",
        "subreddit": "stocks",
        "title": "What kind of taxes are paid for standard trading accounts?",
        "url": "https://www.reddit.com/r/stocks/comments/gow5i4/what_kind_of_taxes_are_paid_for_standard_trading/",
        "created": 1590226024.0
    },
    {
        "author": "dazacr7",
        "created_utc": 1590253841,
        "id": "gp8j1d",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hello, \nI used to have a 401k company account with fidelity I’m allowed to leave it in their account but I’m not happy with the way the money is invested. Could I roll it over into an IRA account and buy individual stocks without getting penalized by the IRS ?",
        "subreddit": "investing",
        "title": "401k fidelity",
        "url": "https://www.reddit.com/r/investing/comments/gp8j1d/401k_fidelity/",
        "created": 1590282641.0
    },
    {
        "author": "PostNoctem",
        "created_utc": 1588712532,
        "id": "ge63g1",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I'd like to be able to do custom analyses on my overall portfolio.  Unfortunately, my brokerage account is with Fidelity and their options for customized analysis are, imho, painfully feeble and cumbersome.  For example, if I want to look at a spreadsheet that includes TTM dividends paid, TTM earnings, beta, etc., I have to *look each one up and manually enter all of those data by hand* for every stock.  \n\nI'd like something more robust and, more importantly, with automated data entry.  For example, I'd like to be able to enter AAPL - 200 shares, BAC - 300 shares, MSFT - 100 shares, etc., specify which pieces of data I want and then have it all filled in automatically, spreadsheet-like, for each position.\n\nWhat are my options for doing this?  A free service is preferred but I'm willing to pay for something that does the job if I have to.",
        "subreddit": "investing",
        "title": "What portfolio analysis tools -- looking for robust, flexible analysis (without hand entering data)",
        "url": "https://www.reddit.com/r/investing/comments/ge63g1/what_portfolio_analysis_tools_looking_for_robust/",
        "created": 1588741332.0
    },
    {
        "author": "CD_Johanna",
        "created_utc": 1588969900,
        "id": "gg10pb",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I bought this fund to serve as the REIT portion of my portfolio, and I noticed it lost 72% of its value as a result of the pandemic during March.\n\nIt's been very slow to recover. Why do you think that is?",
        "subreddit": "investing",
        "title": "(FSRNX) Fidelity Real Estate Index Fund - Why would this fund be hit so hard by COVID-19?",
        "url": "https://www.reddit.com/r/investing/comments/gg10pb/fsrnx_fidelity_real_estate_index_fund_why_would/",
        "created": 1588998700.0
    },
    {
        "author": "ThinkLongterm",
        "created_utc": 1590370115,
        "id": "gq1qz7",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Fidelity approved me for options. Mailed this book -1994",
        "url": "https://i.redd.it/3cenfojcdt051.jpg",
        "created": 1590398915.0
    },
    {
        "author": "nilbus",
        "created_utc": 1589914447,
        "id": "gmuqet",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Fidelity is my broker, and I can't change that. Active Trader Pro on Mac is terrible though. Are there any alternative native Mac OSX trading platforms that integrate with Fidelity as a broker? It seems not.",
        "subreddit": "investing",
        "title": "Any alternatives to Active Trader Pro for trading with Fidelity?",
        "url": "https://www.reddit.com/r/investing/comments/gmuqet/any_alternatives_to_active_trader_pro_for_trading/",
        "created": 1589943247.0
    },
    {
        "author": "ThatGuyHasBeats2",
        "created_utc": 1590859079,
        "id": "gtht8g",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "How do you see your total realized gains or loses on your closed positions? I am talking about the mobile app by the way,I know where to find it on active trader pro. Thanks guys",
        "subreddit": "investing",
        "title": "Fidelity help",
        "url": "https://www.reddit.com/r/investing/comments/gtht8g/fidelity_help/",
        "created": 1590887879.0
    },
    {
        "author": "weissruss",
        "created_utc": 1588532362,
        "id": "gcw2eo",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi! Does anybody has experience wirh the Fidelity - Global Technology Fund? It looks verypromising with the Tech Companies as main investing Area.\n\nThanks for the replies!",
        "subreddit": "investing",
        "title": "Fidelity - Global Technology Fund",
        "url": "https://www.reddit.com/r/investing/comments/gcw2eo/fidelity_global_technology_fund/",
        "created": 1588561162.0
    },
    {
        "author": "ayy_zed",
        "created_utc": 1589247100,
        "id": "gi18zm",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "$LVGO\n$SQ \n$SE\n$AYX\n$PINS\n$CRWD\n\nlooking to diversify from tech a little too. Want to hold 10 max also have a fidelity world index fund.",
        "subreddit": "stocks",
        "title": "My current portfolio!",
        "url": "https://www.reddit.com/r/stocks/comments/gi18zm/my_current_portfolio/",
        "created": 1589275900.0
    },
    {
        "author": "lewiswc17",
        "created_utc": 1590863909,
        "id": "gtjafb",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "\nI’m looking for a alternative to the S&amp;amp;P 500. I’m in the UK, I’m planning to put £500 - £1000 a month into a fund. I’m currently 18 and am planning to start at 20.\n\nFunds I’ve considered:\n\nFidelity Advisor Growth Opportunity Fund - M \nVanguards S&amp;amp;P 500 Index",
        "subreddit": "investing_discussion",
        "title": "High return funds UK ?",
        "url": "https://www.reddit.com/r/investing_discussion/comments/gtjafb/high_return_funds_uk/",
        "created": 1590892709.0
    },
    {
        "author": "DreamStocks",
        "created_utc": 1589292196,
        "id": "gibsyy",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Anyone here use Fidelity or E-Trade? I want to do E-Trade but they make me wait two days for verification before adding funds from bank. E*Trade also has a better app interface and charts than Fidelity I believe (at least based on real time). \n\nHowever, with Fidelity, I could deposit the funds immediately and they withdraw the money next day, but it’s available for use even before. \n\nThoughts or suggestions?\n\nWhich one of these two platforms do you use, and why? What features sets it apart from the other?",
        "subreddit": "stocks",
        "title": "Fidelity vs E-Trade",
        "url": "https://www.reddit.com/r/stocks/comments/gibsyy/fidelity_vs_etrade/",
        "created": 1589320996.0
    },
    {
        "author": "throwaway040920",
        "created_utc": 1590532116,
        "id": "gr75os",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I don’t see any distributions and it’s top 10 holdings are Blue Chips.",
        "subreddit": "investing",
        "title": "Why is Fidelity Contrafund down 0.35% today?",
        "url": "https://www.reddit.com/r/investing/comments/gr75os/why_is_fidelity_contrafund_down_035_today/",
        "created": 1590560916.0
    },
    {
        "author": "living_or_dead",
        "created_utc": 1590099108,
        "id": "go6i16",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I was looking for Options in ACB to sell and i saw that there is this jan 2022 Adjusted ACB option with strike of 12 and price of 11.15. Its not on Robinhood but i can see it on Fidelity. So for selling this put i have max loss of 85 but profit of 1115. Whats the deal here? This is too good to be true right?\n\nP.S. Can’t post image of the option as I dont have enough repo i think.",
        "subreddit": "investing",
        "title": "Adjusted ACB option: How does it work",
        "url": "https://www.reddit.com/r/investing/comments/go6i16/adjusted_acb_option_how_does_it_work/",
        "created": 1590127908.0
    },
    {
        "author": "vc-itsafunnystory",
        "created_utc": 1588633729,
        "id": "gdmbbb",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I currently have about 10k in my Roth IRA with fidelity which is just sitting in a money market. I called in recently to have $1000 pulled out from my Roth and invested into FXAIX index fund since I’ve heard good returns with long term. I’m planning on dollar cost averaging, and putting in $500 every week till I hit the 10k with the same fund. \n\nShould I continue putting it all into this one index fund or diversify with another fidelity fund? Also is there a fee or interests from the index funds gains using my Roth IRA? \n\nI’m open to any advice!",
        "subreddit": "investing",
        "title": "Roth IRA into index funds",
        "url": "https://www.reddit.com/r/investing/comments/gdmbbb/roth_ira_into_index_funds/",
        "created": 1588662529.0
    },
    {
        "author": "verdict0224",
        "created_utc": 1589119238,
        "id": "gh1zjt",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "For someone who is new to investing, it seems that there are comparable Fidelity and vanguard funds for each category. Healthcare, technology, total stock market, etc..\n\n\nwhen you choose between vanguard and Fidelity managed funds with low expense ratios, are you just choosing who is managing the fund? For example for the vanguard healthcare vht stock ticker, this fund is obviously managed by vanguard as a company right?",
        "subreddit": "investing",
        "title": "What are the Cardinal differences between vanguard funds and Fidelity funds?",
        "url": "https://www.reddit.com/r/investing/comments/gh1zjt/what_are_the_cardinal_differences_between/",
        "created": 1589148038.0
    },
    {
        "author": "The_Collector4",
        "created_utc": 1590273148,
        "id": "gpe478",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I have Fidelity and Wells Fargo brokerage accounts, and I get inundated with emails reminding me to vote via proxy, which I always ignore.  They usually send a notice of a shareholder's meeting too.  Do any of you actually attend these, or at the very least cast your vote? Usually they are votes to select board members.  And I realize, you actually have to own shares to vote, so these meetings are inherently quite literally gay.",
        "subreddit": "wallstreetbets",
        "title": "Do you guys vote?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gpe478/do_you_guys_vote/",
        "created": 1590301948.0
    },
    {
        "author": "bradleyxxii",
        "created_utc": 1590699558,
        "id": "gseot7",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I was looking at brokers to get into trading OTCs with due to their high success lately. Do you guys have any recommendations on good ones w no fees. I just want to trade OTCs on them. I was looking at CS or Fidelity. Lemme know what y’all think.",
        "subreddit": "pennystocks",
        "title": "OTC Broker",
        "url": "https://www.reddit.com/r/pennystocks/comments/gseot7/otc_broker/",
        "created": 1590728358.0
    },
    {
        "author": "Fresh2Trades",
        "created_utc": 1588628312,
        "id": "gdkrcn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I have a question on which brokers to use. I’m still relatively new (starting to swing trade and get more involved since I’m working from home) and I’m looking for a “forever” broker. \n\nI’ve got three currently: Robinhood (used when I was new, but recently have stopped using), TDA, and Webull. \n\nI don’t trust Webull due to their sketchy customer service, so I’m beginning to pull my money out slowly as I sell my shares when profitable. I’ve only placed 1k in to Webull. I have 2k in TDA, but I’m not the biggest fan of their mobile platform. Webull is literally exactly what I feel I gravitate to in terms of UI, charts, etc. \n\nI’ve checked out Fidelity, Etrade, Interactive Brokers, Tasty, and Schwab. I’m not sure I want to keep TDA as my main account due to the Schwab buyout. I’m not looking to have changes to things right when I’m getting started. Whichever I choose, I’d like to get a Roth going with too. \n\nAny thoughts/suggestions? I’m mobile some for work so won’t have the ability to do a ton on my laptop, otherwise I would put an emphasis on web/desktop platforms. Should I just go all in with Webull? Stick with TDA? Try IBKR? I’m down to have several brokers with small sums of money, but just want a main one I leave long term investments in as well as focus most of my swings within.",
        "subreddit": "StockMarket",
        "title": "Advice On Brokers",
        "url": "https://www.reddit.com/r/StockMarket/comments/gdkrcn/advice_on_brokers/",
        "created": 1588657112.0
    },
    {
        "author": "brosque",
        "created_utc": 1589430449,
        "id": "gjf9mf",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Do any online brokerages offer tax loss harvesting? I know it’s a core feature of Betterment/Weathfront but I’m wondering if Fidelity, IB, Etrade, etc offer it. Looks like TD might—can anyone confirm?",
        "subreddit": "investing",
        "title": "Online brokerages with tax loss harvesting",
        "url": "https://www.reddit.com/r/investing/comments/gjf9mf/online_brokerages_with_tax_loss_harvesting/",
        "created": 1589459249.0
    },
    {
        "author": "camark08",
        "created_utc": 1588918618,
        "id": "gfnonn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I am fairly young and what to get ahead on investing. Would 10+ years of pumping\n\nFXAIX 75%\n\nFSPHX 25% \n\nbe worth my while in the long run? The only thing that scares me is FSPHX expense ratio. if you guys have anything to recommend in its place I would be more than happy to here.",
        "subreddit": "StockMarket",
        "title": "Fidelity Portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/gfnonn/fidelity_portfolio/",
        "created": 1588947418.0
    },
    {
        "author": "ia1v1chem",
        "created_utc": 1588888990,
        "id": "gfg9p0",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Anyone use fidelity ?",
        "url": "https://www.reddit.com/r/investing/comments/gfg9p0/anyone_use_fidelity/",
        "created": 1588917790.0
    },
    {
        "author": "johnco1126",
        "created_utc": 1589662844,
        "id": "gl2aau",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Fidelity Mutual Fund recommendations for IRA",
        "url": "https://www.reddit.com/r/investing/comments/gl2aau/fidelity_mutual_fund_recommendations_for_ira/",
        "created": 1589691644.0
    },
    {
        "author": "ReadTheStatement",
        "created_utc": 1590240096,
        "id": "gp4tnn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "# **Comparison of Online Investment Services**\n\nHello, r/Stocks! I doing a comparison of online investment services, like the ones listed below today. As this is version 1, any suggestions on information to include in future versions would be helpful!\n\nI will do my best to update this community with new info, but all posts can be found on my profile (not every post fits nicely in every community). The biggest thanks I can get is an upvote here so more people can see it.\n\nIf you know any other services you would like to be added, or a community that would benefit from this information, please let me know.\n\nLet’s get into it...\n\n||**Charles Schwab**|**Fidelity**|**E*Trade**|**TD Ameritrade**|**Ally Invest**|**M1 Finance**|**SoFi Invest**|**Robinhood**|**Cash App**|**Public**|\n|--|--|--|--|--|--|--|--|--|--|--|\n|*Account Maintenance Fee*|$0|$0|$0|$0|$0|$0|$0|$0|$0|$0|\n|*Account Minimum*|$0|$0|$0|$0|$0|$0|$0|$0|$0|$0|\n|*Trading Fees (Stock &amp; ETF)*|$0|$0|$0|$0|$0|$0|$0|$0|$0|$0|\n|*Idle Cash Interest*|0.17%|0.01%|0.01%|0.01%|0%|0%|0%|0.3%|0%|0%|\n|*Insurance*|$600M ($1.15M Cash)|$1B ($1.9M Cash)|$600M ($900K Cash)|$500M ($2M Cash)|$150M ($900K Cash)|$37.5M ($900K Cash)|$500K ($250K Cash)|$500K ($250K Cash)|$500K ($250K Cash)|$500K ($250K Cash)|\n|*Mutual Funds*|Yes|Yes|Yes|Yes|Yes|No|No|No|No|No|\n|*Retirement Accounts*|Yes|Yes|Yes|Yes|Yes|Yes|Yes|No|No|No|\n|*Taxable Accounts*|Yes|Yes|Yes|Yes|Yes|Yes|Yes|Yes|Yes|Yes|\n|*College Savings Plan*|Yes|Yes|Yes|Yes|No|No|No|No|No|No|\n|*Options*|Yes|Yes|Yes|Yes|Yes|No|No|Yes|No|No|\n|*Options Fee*|$0.65 / Contract|$0.65 / Contract|$0.65 / Contract|$0.65 / Contract|$0.50 / Contract|N/A|N/A|$0 / Contract|N/A|N/A|\n|*Futures*|Yes|No|Yes|Yes|No|No|No|No|No|No|\n|*Futures Fee*|$1.50 / Contract|N/A|$1.50 / Contract|$2.25 / Contract|N/A|N/A|N/A|N/A|N/A|N/A|\n|*Fractional Shares*|Yes|Yes|No|No|No|Yes|Yes|Yes|Yes|Yes|\n\n## **Future Chart Ideas**\n\n - Number of Customers\n - Years since Founding\n - Assets Under Management\n - Minimum Investments\n - Data Rate\n - Average Customer Rating\n - ”Unique Features”\n - International Access\n - Limits\n - Money Market Account Availability\n\n(Will add suggestions here with each edit)\n\n## **Future Service Additions**\n\n - Interactive Brokers\n - Meryl Edge\n - Tastyworks\n - thinkorswim\n - TradeStation\n - Vanguard\n\n(Will add suggestions here with each edit)",
        "subreddit": "stocks",
        "title": "Comparison of Online Investment Services",
        "url": "https://www.reddit.com/r/stocks/comments/gp4tnn/comparison_of_online_investment_services/",
        "created": 1590268896.0
    },
    {
        "author": "Eff_taxes",
        "created_utc": 1589151066,
        "id": "ghbgai",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Anyone have a Fidelity HSA?",
        "url": "https://www.reddit.com/r/investing/comments/ghbgai/anyone_have_a_fidelity_hsa/",
        "created": 1589179866.0
    },
    {
        "author": "Hollisb1001",
        "created_utc": 1590019027,
        "id": "gnm2ku",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "For a good while now I've kept nearly all my retirement investments in FZROX. I figure zero fees is best, indexed to the market, simple. I still don't think it's a bad plan. But I finally changed. My new mix is in ALMOST free funds. Tell me what you think. (Still very simple)\n\n75% FXAIX \n25% FNBGX \n\nMy main reasoning:\n\nRegular dividends to compound regularly. And the long term treasury bond index fund has outperformed stocks lately.",
        "subreddit": "stocks",
        "title": "Changed up my Fidelity mix",
        "url": "https://www.reddit.com/r/stocks/comments/gnm2ku/changed_up_my_fidelity_mix/",
        "created": 1590047827.0
    },
    {
        "author": "myFIREjourney",
        "created_utc": 1590532196,
        "id": "gr76ji",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I currently have an Asset Allocation Target Date 2055 fund. I’m 100% invested in this fund. I would like something with lower fees and decent returns. I recently started contributing to my 401K and I’m a bit unclear about the various funds.  I plan to max out my contributions from here in out.  I’d prefer to retire earlier than 65 if that changes anything.",
        "subreddit": "investing",
        "title": "Best Fidelity 401K Funds?",
        "url": "https://www.reddit.com/r/investing/comments/gr76ji/best_fidelity_401k_funds/",
        "created": 1590560996.0
    },
    {
        "author": "lilkhmerkid4u",
        "created_utc": 1589936014,
        "id": "gn1d4x",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Would I need to call and get international trading privileges?",
        "subreddit": "shroomstocks",
        "title": "Who all will be buying NUMI on Fidelity tomorrow?",
        "url": "https://www.reddit.com/r/shroomstocks/comments/gn1d4x/who_all_will_be_buying_numi_on_fidelity_tomorrow/",
        "created": 1589964814.0
    },
    {
        "author": "Cjanak17",
        "created_utc": 1590122503,
        "id": "gocqle",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I know VTI is a bit more diversified than VOO, and over the long term I believe VOO has had a slightly higher return.... \n\nwhich one of the two are you investing in for long term? (If any) \n\nAlso: is it worth buying VOO/VTI in a Fidelity account or buy FXAIX? Comparisons? Thanks!",
        "subreddit": "investing",
        "title": "VOO vs VTI",
        "url": "https://www.reddit.com/r/investing/comments/gocqle/voo_vs_vti/",
        "created": 1590151303.0
    },
    {
        "author": "ayy_zed",
        "created_utc": 1589037709,
        "id": "ggh85a",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "So I have a fidelity world index which I pay into monthly.\n\nI also have these individual stocks which I feed monthly too\n\n$LVGO\n$CRWD\n$SE \n$SQ\n$PINS\n$HAL\n\nlooking to stick to 8-10 solid won’t add anymore tech, looking to diversify into 2/3 other sectors to make up my 10. What does everyone think?",
        "subreddit": "investing",
        "title": "Thoughts my friends?",
        "url": "https://www.reddit.com/r/investing/comments/ggh85a/thoughts_my_friends/",
        "created": 1589066509.0
    },
    {
        "author": "Medschoolstudent04",
        "created_utc": 1589205157,
        "id": "ghnx3d",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hey, \n\nI just started a ROTH IRA. Pretty new to all this. I was looking for some advice, looking for long time growth. Most people say go with ( FZROX, FZILX, FXNAX). I thought ETF was better than a mutual fund for a ROTH IRA? Also, I plan on adding money monthly, any way to automatically add it to portfolio.\n\nThank you",
        "subreddit": "investing",
        "title": "ROTH IRA &amp; Fidelity",
        "url": "https://www.reddit.com/r/investing/comments/ghnx3d/roth_ira_fidelity/",
        "created": 1589233957.0
    },
    {
        "author": "XtianS",
        "created_utc": 1588957945,
        "id": "gfx5du",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Relatively new to options trading, but I had an earnings play on BYND this week. \n\nI use Fidelity as a broker and if you have multiple open strategies on a stock, they will sometimes regroup them. I think they do this to minimize the margin requirements, but it can be extremely confusing. \n\nIt regrouped a spread to show about 50% profit, so I closed it without realizing that one of the positions was actually the long leg on a call spread. It was outside the predicted post-earnings move, but that stock skyrocketed. What would have been a loss at $500 - had that long leg remained open - ended up costing me about $1,200. \n\nMostly just sharing this but wondering if other broker platforms do this? I know better now but it's not the first time it messed up my trades, just the most costly.",
        "subreddit": "options",
        "title": "Broker Bungle on Beyond Meat BYND",
        "url": "https://www.reddit.com/r/options/comments/gfx5du/broker_bungle_on_beyond_meat_bynd/",
        "created": 1588986745.0
    },
    {
        "author": "brotherhef",
        "created_utc": 1589332392,
        "id": "gioujs",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Trying to up my stocks knowledge. The day if LYFTs Q1 earnings report came out, they shot up 20 something percent. I also saw a cpl articles that said, “LYFT stock goes up after they beat estimates.”  I googled “LYFT stock earnings”. It shows -.63 expected eps and reported -.32%. Made sense except my Fidelity page shows -1.31 eps, and therefore did not meet estimates. What am I missing? Can upload screenshots if needed.",
        "subreddit": "stocks",
        "title": "Help me understand earnings reports. Using LYFT as my example",
        "url": "https://www.reddit.com/r/stocks/comments/gioujs/help_me_understand_earnings_reports_using_lyft_as/",
        "created": 1589361192.0
    },
    {
        "author": "vsgeo",
        "created_utc": 1589872475,
        "id": "gmjr1p",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "90% of my investing money is allocated between various mutual funds in a Fidelity brokerage account. So far I’m up about 16% on the year with those so I can’t complain. I also have a separate brokerage account where I have (had) 26 individual stocks. This is just 10% of my money but I’ve been debating what I should do with this account. \n\nI used to have Google, Microsoft, NVIDIA, Amazon, (and other big players in major sectors) but many of these companies are heavily weighted in my mutual funds so I figured I could sell them. I have about 40 stocks I’ve researched heavily that I really like but I’m having trouble narrowing them down.\n\nDoes anyone have any suggestions for what I should do? I keep track of my account consistently but I’m definitely not a day trader. \n\nShould I just forget the individual stocks and use that money for my mutual funds?\n\nShould I just grab like a few... maybe like 5 stocks that I think have a lot of potential and allocate the money between? I’m okay with going aggressive with my individual stocks since the vast majority of my money is in mutual funds anyways.\n\nI’m newish to this and trying to figure out the smartest way to go about this so any advice is greatly appreciated!",
        "subreddit": "stocks",
        "title": "Portfolio Suggestions?",
        "url": "https://www.reddit.com/r/stocks/comments/gmjr1p/portfolio_suggestions/",
        "created": 1589901275.0
    }
]