[
    {
        "author": "DJDunnoe",
        "created_utc": 1599349498,
        "id": "inbnuo",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "See my post history on $CRM &amp; $CSCO, I am going to keep this short &amp; sweet this time around. $CHWY has great fundamentals &amp; is coming off a massive pull back $75 to $56 (Closed $61) created thanks to the $SPY sell off, Earnings Thursday AHs. IV premiums relatively low atm because of the heavy selling pressure. I see a likely bounce up to $66-68 range on Tuesday/Wednesday, calls should near double if not more on the bounce &amp; should be a great ER run up play. As usual, sell before Earnings Thursday but milk the run up.   \n\n\nDisclosure: Long $CHWY 9/18 $75 calls",
        "subreddit": "wallstreetbets",
        "title": "Why I think $CHWY will run up next week to earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/inbnuo/why_i_think_chwy_will_run_up_next_week_to_earnings/",
        "created": 1599378298.0
    },
    {
        "author": "BitcoinLover12312",
        "created_utc": 1599493583,
        "id": "io9thb",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Okay its not zoom but its almost exactly like it from what I've read.. It competes with salesforce/zoom/slack and cisco. (CRM/ZM have been on fire as you may know). The market marker shows a move of a little over 23%.. This could be the next ZM..\n\nposition: 9/11 ZS 140c",
        "subreddit": "wallstreetbets",
        "title": "Why is nobody talking about upcoming ZS earnings? The MM has it set for a move over 23%",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/io9thb/why_is_nobody_talking_about_upcoming_zs_earnings/",
        "created": 1599522383.0
    },
    {
        "author": "haasvacado",
        "created_utc": 1601074721,
        "id": "izu3i0",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "The Boomer Weekly\n\n*Where dreams die. Slowly*\n\nAlright, folks, hop aboard and keep the butt cheeks clenched tight because we’re about to re-live the drama of Boomerland for the week.\n\n$X (US Steel) might be the coolest ticker on the street but it also carries the distinction of being one of the worst still-traded performers ever and this week it completely shit the bed. -15.76%. Fun fact: in June of 2008, the stock was trading at 196. Now? Well, it ain’t much; maybe we should just talk about it’s glory days and shove some more of that Boomer money their way.\n\nSpeaking of dramatically poor-performing companies, GE, maker of dishwashers and airplane parts, took a bit of a tumble this week after investors woke up from the inexplicable trance they were in last week. It closed on Friday down -7.8% for the week. It’s hard to believe but that bitch is flirting with the 5s again. And most of that movement happened before the piss poor durable goods numbers were released. \n\nKO, after defending the 50.00 mark last week, stayed true to last weeks’ Spartan-at-the-Hot-Gates-of-Thermopylae analogy and was ultimately overran by market forces. Closed the week down -2.5% to 48.50.\n\nUL (Unilever), maker of pretty much everything I guess, stunned the world by doing nothing different than it did all summer. Hung on to 60. Closed the week out +1.45% as the world around it either imploded or launched.\n\nF came in at -7.64% for the week. Pay respects. \n\nBanks showed a bit more independent movement than they have been as of late. As expected, the bank that got slapped with a billion dollar fine for cheating (JPM) fared significantly better than a few who didn’t (BAC for instance). There’s a lesson in there, I think: just because it’s illegal and you get caught, it doesn’t mean it wasn’t profitable. \n\nCSCO, on the shortlist of China’s shitlist, was straight up not having a good time as it not only failed to make a measurable rebound from last quarters’ fumbled guidance, but gave up another -2.5% on the week. \n\nNow let’s take a brief minute to talk about bonds. Just kidding; fuck that noise. Hope you enjoyed this week’s tour through Boomerland for the week ending September 25th, 2020. It was mostly just carnage. Enjoy your weekend .",
        "subreddit": "wallstreetbets",
        "title": "The Boomer Weekly September 25, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/izu3i0/the_boomer_weekly_september_25_2020/",
        "created": 1601103521.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1601326705,
        "id": "j1ks29",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n\n* The S&amp;P 500 increased +1.66% today while the NASDaq added (+2.01%). The Russell 2000 rose by (+2.47%). The Dow ended in positive territory at (+1.55%)\n* All sectors ended in positive territory today. The best performing sector was Financials(+2.38%) while Utilities(+0.26%)was the worst performer.\n* Analyst upgrades, M&amp;A activity, and another positive vaccine update from Johnson &amp; Johnson (JNJ 147.11, +1.45, +1.0%) were corporate-related drivers of sentiment for many cyclical stocks. Other positive factors were House Speaker Pelosi saying a stimulus bill is still possible and quarter-end rebalancing, which favored the financial and energy sectors. \n* A separate viewpoint was rooted more in technical observation than news. The lack of volatility, and market-moving events, suggested today was a momentum trade from Friday, with performance aided by a recognition the S&amp;P 500 and Dow had declined for four straight weeks. \n* U.S. Treasuries were stagnant during today's stock market gains. The 2-yr yield increased one basis point to 0.14%, and the 10-yr yield was unchanged at 0.66%. The U.S. Dollar Index declined 0.4% to 94.27. WTI crude futures rose 0.7%, or $0.29, to $40.54/bbl.\n* Investors did not receive any economic data on Monday. The Conference Board's Consumer Confidence Index for September, the S&amp;P Case-Shiller Home Price Index for July, and the Advance August reports for Intl Trade in Goods, Retail Inventories, and Wholesale Inventories will be released on Tuesday. \n\n## Index Summary\n\n**S&amp;P 500 :** (+1.66%);  **NasDaq :** (+2.01%);  \n**Russell 2000 :**(+2.47%);  **Dow :**(+1.55%);  \n**Vix :**26.38 (-0.72%); \\[-5.72%\\]; {+2.34%}\n\n## Sectors Summary \n\n## Commodities/Futures\n\n(1-day %), \\[5-day %\\], {10-day %}\n\n***Currency -***  \n**USD Index :**94.682 (-0.39%); \\[-0.14%\\]; {+1.44%}  \n**BC :**10825 (+1.39%); \\[+6.76%\\]; {+0.23%}\n\n***Precious Metals -***  \n**Gold :**1866.3 (+1.07%); \\[+1.41%\\]; {-2.77%}  \n**Silver :**23.093 (+3.08%); \\[+3.44%\\]; {-11.78%}\n\n***Farming -***  \n**Soybeans :**1002.5 (-0.75%); \\[-1.92%\\]; {-3.26%}  \n**Corn :**365.25 (+0.55%); \\[-0.34%\\]; {-2.13%}  \n**Coffee :**113.65 (-4.14%); \\[-1.4%\\]; {-7.75%}\n\n***Industrials -***  \n**Crude :**40.25 (+0.84%); \\[+1.65%\\]; {-0.93%}  \n**Nat Gas :**2.139 (-2.76%); \\[-2.12%\\]; {+1.86%}  \n**Copper :**2.971 (+0.91%); \\[+0.15%\\]; {-2.23%}\n\n## Dark Pool Summary\n\nHighest Dark Pool buys by rank -  \n1. JPM 1 buys totalling 1,667,239 shares. Average Price : 95.06, Cost : $158,487,739  \n2. CSCO 1 buys totalling 2,602,296 shares. Average Price : 39.15, Cost : $101,879,888  \n3.AVGO 1 buys totalling 233,390 shares. Average Price : 361.68, Cost : $84,412,495  \n4.DHR 1 buys totalling 380,953 shares. Average Price : 208.75, Cost : $79,523,939  \n5. BMY 1 buys totalling 1,234,416 shares. Average Price : 59.35, Cost : $73,262,590  \n\n\n## Options Fast Facts\n\n***CBOE Put/Call Ratio - 0.56***  \n***Highest Multiple Over Daily Average -*** DVN with 11x the ADV of 4517. There were 14176 calls and 37044 puts.  \n***Ticker with Most Contracts -***SPCE with 361243 contracts traded today with an AVD of 79131. There were 271812 calls and 89431 puts.  \n***Largest Put / Call Ratio -*** MPLX with a 25 P/C ratio. There were 16693puts and 671 calls.  \n***Largest Call / Put Ratio -*** NTR with a57 C/P ratio. There were 12675 calls and 223 puts.  \n\n\n\\*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "wallstreetbets",
        "title": "Market and Options Summary for September 28th, 2020 -",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j1ks29/market_and_options_summary_for_september_28th_2020/",
        "created": 1601355505.0
    },
    {
        "author": "mowingwithscissors",
        "created_utc": 1599853551,
        "id": "iqxsph",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "  \n\nJust to provide an example, Apple shares are currently about $110. Let’s say you are very bullish on it and buy a single long term call, 195C expry Jan 2022. That would set you back about $400 ($4.03), or about 4 share’s worth. Let’s say your hunch was right and the share values doubles by Jan 2022. Your gamble earned you ($220-195)\\*100, or roughly $2500. Not bad.\n\nNow let’s take a look at CISCO. Shares currently at $40. Again, let’s say you are very bullish and think it will double and buy a similarly OTM leap call, 75C expry Jan 2022. Interestingly, the cost for that is $20 ($0.20). Let’s think about that for a second. For the price of one share, you can literally buy two of those options. So if you invested the same $400 to buy twenty(!) CSCO 75C expry Jan 2022 options, and CSCO doubles by Jan 2022, you’ve earned roughly (80-75) \\*2000, or roughly $10,000. Four times the upside of the apple leap call.\n\nYes, Apple is apple, and Cisco is Cisco, but at least from a math perspective the Cisco play has MUCH more upside. I would even argue that the Cisco play (it being also a well established tech company, big potential upsides such as IoT and cyber security) is not necessarily that much riskier than the apple play. To me Cisco is much more attractive.\n\nIs my logic at least somewhat sound? Or am I crazy? \n\nIf you agree with my thinking, any thoughts on other examples of “high upside” leap plays that you see currently on the board? Let’s share!\n\nDisclosure: I’ve invested 5% or $700 of my measly portfolio in that exact CSCO play mentioned above.",
        "subreddit": "wallstreetbets",
        "title": "Buying OTM LEAPs: what are the most high upside plays in your opinion?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqxsph/buying_otm_leaps_what_are_the_most_high_upside/",
        "created": 1599882351.0
    },
    {
        "author": "hrm015",
        "created_utc": 1599776938,
        "id": "iqdvmg",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Down about 10% on Cisco, which I’ve been DCAing since April. Planning on holding for at least a year and collecting the dividend, but wondering if anyone thinks it’s unlikely they get back to $44-45+ by then.\n\nI personally thought they were a good WFH play on numerous fronts, and it feels like the sell off after earnings was a bit of an overreaction. \n\nAnyone have any opinions?",
        "subreddit": "stocks",
        "title": "Cisco",
        "url": "https://www.reddit.com/r/stocks/comments/iqdvmg/cisco/",
        "created": 1599805738.0
    },
    {
        "author": "RosmarysBabyBjorn",
        "created_utc": 1599099683,
        "id": "ilkw0n",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Folks argue that we're not in a tech bubble because today's tech companies make real money. The FANG stocks, they say, create real products and bring in billions of dollars a year. Not like the pets.com companies of the dot-com crash, which were just over-hyped websites. But didn't lots of tech companies like Cisco make real products and real money? Haven't most of these companies too experience their ATHs back during that previous bubble? How can we be sure we're not in another tech bubble?",
        "subreddit": "investing",
        "title": "Weren't plenty of tech firms profitable before the dot com crash?",
        "url": "https://www.reddit.com/r/investing/comments/ilkw0n/werent_plenty_of_tech_firms_profitable_before_the/",
        "created": 1599128483.0
    },
    {
        "author": "brintoul",
        "created_utc": 1599247575,
        "id": "immj6m",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I loved the \"dot com\" boom/bust.  There were so many good stories to come out of it and so few people really seem to remember it.  I'm going to post a few of my favorites over the next few days and I hope someone out there finds them interesting.\n\nHere's a quick blurb on [Lernout &amp; Hauspie](https://money.cnn.com/2000/12/19/companies/lernout/index.htm) \\- worth close to $10B at one time.\n\nAnd here's another one [about Cisco](https://www.networkworld.com/article/2229885/cisco-s-storied-past-as-the-most-valuable-company-on-earth.html) (there are tons about Cisco from that period, of course) - worth $569B in 2000.\n\nThere are plenty of stories to choose from.  Maybe some other folks have some favorites.  Commerce One?  Ariba, anyone?",
        "subreddit": "StockMarket",
        "title": "Finding Myself Nostalgic for 1999. Gonna Bring Up Some Blasts From the Past",
        "url": "https://www.reddit.com/r/StockMarket/comments/immj6m/finding_myself_nostalgic_for_1999_gonna_bring_up/",
        "created": 1599276375.0
    },
    {
        "author": "frankenbarrie",
        "created_utc": 1599146202,
        "id": "ilvcfi",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Thinking about doing my first options trade and betting on the mooning of Cisco. If any of you retards want to tell me something I'm not seeing or want to join me let me know. I'm a network engineer and Cisco is the king of the mountain no way this shit keeps sliding.\n\nAlso call me retarded, I want to feel apart of the club finally.",
        "subreddit": "wallstreetbets",
        "title": "$CSCO is prime for a comeback",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilvcfi/csco_is_prime_for_a_comeback/",
        "created": 1599175002.0
    },
    {
        "author": "AUSTINpowers050",
        "created_utc": 1600095652,
        "id": "ismil5",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Cisco gapped down after earnings and I did my DD and I think they make cable boxes, not really sure though. I personally like cable TV because I can watch Impractical Jokers 24/7 and $45 calls for 10/16 are only $0.08 which is important after I lost everything on TSLA 3500C. I see Cisco as a $1000 stock in the near future, buying it now would be like buying Amazon or Microsoft in the 90s.",
        "subreddit": "wallstreetbets",
        "title": "All in on Cisco calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ismil5/all_in_on_cisco_calls/",
        "created": 1600124452.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1599574432,
        "id": "ioual0",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Nutanix has been a leader in hyper-converged infrastructure (HCI) since its founding in 2009. HCI technology modernizes data center infrastructure   by integrating compute, storage, and networking into a unified pool of  software-defined resources. The previous reliance on a three-tier  architecture of separate compute, storage, and networking hardware  limited the ability to scale and increased the costs and resources   associated with data center management. \n\nWith growing adoption of the public cloud over the past decade, enterprises began shifting more and more workloads to remote data centers to boost   agility and gain access to additional computing power. However, not all   applications can or should be run from a public cloud environment. And   for companies seeking better control and security, hybrid cloud became  a  popular approach. As the hybrid cloud – or the combined use of  public  cloud and on-premise data center – emerged, so too did HCI. \n\nThe HCI market has grown from a non-material level only several years ago   to $3.9bn in the first quarter of 2020 according to IDC. But as HCI   experienced rapid growth, larger players entered the space, such as,  VMware and Dell EMC, Cisco, HPE, and Microsoft. Despite initial success  following its 2016 IPO, Nutanix shares have steadily declined from over  $60 in 2018 to $25.07 today. During that time, VMware began to take   market share from Nutanix. In the same report from IDC, VMware market   share stood at 41.1% compared to 27% for Nutanix.\n\nSo  far this year, resiliency in tech earnings in the face of the worst economic climate since the financial crisis has led to considerable outperformance for the Nasdaq. As investors piled into the tech trade  and bid up cloud, software, and work-from-home stocks to all-time highs,  the momentum has distorted risk-pricing  of mega cap and hypergrowth tech equities and created a perceived   invulnerability of the largest YTD gainers. However, given the role of   passive investing and ETFs in boosting the overall performance of the   market, near-term the mega cap hypergrowth tech trade remains   disproportionately exposed to significant recalibration as we have pointed out recently. \n\nIn this environment of tech exuberance, hyper growth companies like Okta, CrowdStrike, and Datadog trade from anywhere between 30x to 50x sales.  There are even more extreme examples like Shopify (61x) or Zoom (80x). At only 3.73X sales, Nutanix offers much better short-term downside  protection relative to other companies while also providing exposure to   several important cloud-based technology trends. [More  importantly, over the long-term, Nutanix is starting to show  significant momentum in its  transformation from a hardware company to  hybrid and multicloud  enterprise software provider](https://blackjacketco.com/f/nutanix-enterprise-software-strategy-poised-to-pay-off). \n\nAt current valuations, Nutanix is priced for further market share erosion, low probability of market share recovery or revenue growth  reacceleration, and minimal value in its non-core software. Therefore   the combination between the broader market climate and several important   developments set Nutanix up for market outperformance over the next  few years.\n\n*  Lost market share in part worsened by shift towards software/subscription model \n*  New business strategy increasing revenue stability and driving significant gross margin expansion \n*  Nutanix has large amount of deferred revenue and impending renewals\n*  Increased hybrid and multicloud software offerings increase value proposition of core HCI product \n*  New enterprise software capabilities have greatly expanded TAM\n* Assigning CY23 PT of $75 on Nutanix shares\n\n**HCI for Hybrid and Multicloud** \n\nWith all of the attention given to public cloud platforms, mainly AWS and  Azure, it could be easy to overlook just how popular hybrid cloud has   become. Software company Flexera conducted a survey in 2020 and found   that 87% of enterprise cloud users deploy a hybrid strategy. And in a  2019 study by Gartner, 81% of respondents said they work with at least   two public cloud providers as part of a multicloud strategy. Between   hybrid and multicloud use cases, HCI is projected to grow at a CAGR of   over 25% over the next five years and pass $25bn in total market value   in that time. \n\nFor hybrid cloud  customers, the combination of pooled data center resources and   virtualization makes it easier to scale up or down while reducing CAPEX   spend and risks of upgrading IT infrastructure. HCI also helps   multicloud users by optimizing containerization and maintaining more   consistent performance across public cloud platforms and instances. In  computing, containers are simply a standardized packaging unit that  simplifies the transfer and deployment of applications across different   computing environments. \n\nAlthough VMware has continued to take market share in HCI to the detriment of  Nutanix, the two companies are considered peer players and the two   market leaders by Gartner (whereas Forrester gives an edge to Nutanix).   The Nutanix core HCI product is called Acropolis (AOS). It is a  software-defined HCI stack that includes a user-friendly control console   called Prism and the optional use of the free Nutanix hypervisor AHV  (a  hypervisor is software or hardware the creates, initializes, and   monitors virtual machines). \n\nThe main advantages claimed by Nutanix to using AOS over competing offerings  is the flexibility to choose the right hypervisor for the right  workload. With AOS, customers can either use Nutanix AHV, VMware  ESXi,  or Microsoft Hyper-V. Moreover, AOS keeps data local to the application  to speed performance times and optimize network traffic.  According to  Nutanix, IT organizations can reduce total cost of  infrastructure  operation up to 60% using AOS. \n\n**Shift to Software and Subscription Model**\n\nAt  the beginning of FY18, Nutanix began to transition from a hardware   provider to a software-centric model. The following year, the company   announced a shift to a subscription-based approach. The goal of the dual   strategy is to optimize Nutanix as a cloud and hardware agnostic   platform, giving customers greater choice over hardware systems and   reducing the risk of single-vendor lock-in. In the near-term, the move   to subscriptions caused some temporary pressure on revenues and   exacerbated declining market share. For example, without the model   transition, FY19 revenue would have risen 26% versus the 7% reported. \n\nUnder a subscription model, SaaS companies receive less money up front and  tend to report the health of the pipeline in billings rather than purely   revenue. However, Nutanix reported in August that 88% of total  billings  are now subscription-based. This means that the transition to  the new  model is almost complete. And while there was some initial pain   associated with the move, the combination of deferred revenue and   impending renewals sets the company up for revenue acceleration in   coming quarters.\n\nNutanix ended the most recent quarter with $1.18bn in deferred revenue, marking growth of  30% YoY. Average contract values were up 125%. In addition, renewal  billings only contributed 10% to overall FY20 revenues. With a 96%  customer retention rate, an uptick in renewals could provide a  sizeable  bump to billings beyond what is currently captured in the  average  contract values. Perhaps most importantly, though, the new model  has  enabled Nutanix to drastically improve gross margins. Non-GAPP gross  margins were 81% in August after being as low as 59% in April 2017. \n\nWhile  the company will  certainly have to address its growing losses at some  point, the recent  investment of $750mn by Bain Capital buys Nutanix  more time to build out  its software suite and improve its competitive  positioning and sales posture within the enterprise SaaS market. Once  the company begins to  focus on leveraging free cash flow, earnings  power should greatly  improve and contribute to multiple expansion. \n\n**Nutanix Xi, TAM, and RegTech** \n\nApart from simply packaging the core HCI platform as a software service,   Nutanix has spent the last two years building out a broader range of   enterprise cloud software solutions under the Nutanix Xi brand. Some of   the products include database-as-a-service (Nutanix Era), application   lifecycle management (Nutanix Calm), networking, application, and   virtualization security (Nutanix Flow), unified public/private cloud   monitoring, data security, and compliance (Xi Beam), and an edge device   and IoT application and data management solution (Xi IoT), among  others. \n\nWhen including these new  markets, Nutanix now sees a TAM of $200bn – nearly double the value  attributed to the core HCI business. Within the Nutanix  TAM breakdown,  the company does not specify the areas of hybrid cloud  and edge that it  plans to pursue. One rapidly growing area of  edge-to-cloud that the  company is exposed to, though, is RegTech. RegTech as a broad concept  leverages software solutions to help  companies optimize reporting, risk  management, and regulatory compliance associated with user data.  Although originally associated with the financial industry for functions  such as anti-money laundering, RegTech will also benefit hybrid,  multicloud, and edge-enabled computing, networking, and services by  making regulatory compliance more efficient and less costly. \n\nAs 5G network buildouts mature, the use of edge computing expands, and  billions of IoT devices start to come online, up to 175 ZB of data will  be generated by  2025. And as regulatory frameworks become more complex,  AI/ML RegTech  in particular can improve data discovery and controls  and eventually  automate the compliance lifecycle. All of these features  greatly lower  risk of non-compliance and reduce management and  reporting costs  required by a growing number of regulations - on top of  existing  frameworks such as GDPR, HIPPA, PCI DSS, NIST, SOX, and  numerous others.\n\nBecause RegTech  is starting to expand beyond the financial industry, market  forecasts  vary greatly. However, software-based regulatory compliance is  already a  multi-billion-dollar industry. And studies project the market  could be  worth anywhere from $16bn to $55bn by 2025. While some more   security-oriented technology companies are present in the cloud   compliance space, and there are startups looking to augment the AI/ML   aspects of the process, there is an opportunity for a more integrated   approach. A dedicated edge-to-cloud RegTech service under Nutanix Xi   Beam cloud fill that gap by specifically targeting use cases across   multiple clouds and with a mixture of public cloud and on-premise   compute. \n\nAlthough primarily a  cloud cost optimization tool at first, Xi Beam has out-of-the-box  regulatory compliance policies that can help determine the extent to   which cloud environments remain in compliance with important frameworks   such as PCI-DSS, HIPAA, NIST, CIS, and others. Beam’s compliance tools   enable customers to visualize their data, potential risks, and  necessary  configuration adjustments to keep costs down and free up  valuable IT  staffing resources. \n\nNutanix notes that Beam can help companies save up to 35% on multicloud spend,  but that figure is likely to rise as hybrid, multicloud, and edge  customers are forced to dedicate resources to managing compliance with a   massive stream of new data. Xi Beam already utilizes machine-learning   to optimize cost controls and cloud resources to improve spend and   consumption. Leveraging machine-learning to likewise automate more   aspects of the regulatory compliance and reporting cycle – in   combination with the range of features for more general cloud cost   controls – could make Xi Beam an early leader in what is likely to   become a lucrative end market, adding another growth driver for the   company.\n\n**Conclusion**\n\nDeclining market share in HCI, increased competition, and  near-term pressures  associated with the shift from a hardware to  software company have  contributed to declines in Nutanix shares over the  past couple of  years. At current multiples, market is pricing in low  probability of  recovery in market share while also assigning little  value to the  broader platform of enterprise SaaS offerings. Given the  mega cap and  hyper growth tech trade has become overheated, and  companies with  sky-high price-to-sales multiples have become  increasingly vulnerable  to a near-term reversion, companies with more  attractive valuations and  exposure to high-growth end markets are likely  to outperform. \n\n*  Looking  beyond this, though, weaker revenue growth in recent  quarters was also  exacerbated by temporary top line headwinds due to the  shift to a  subscription model. With a large and growing amount of deferred revenue  and low percentage of contract renewals contributing to revenue in the  most recent quarter, Nutanix could see market share  recovery in HCI –  aided by more comprehensive platform offerings. \n*  Alongside  strengthening of HCI platform, greater emphasis on  hybrid and  multicloud enterprise software services has significantly  expanded the  TAM for Nutanix and opened more opportunities to cross-sell  and  leverage multi-channel partners. With growth of software-based,  AI/ML  augmented data compliance solutions over the next five years, Nutanix  could develop into a market leader in the edge-to-cloud RegTech  space.\n*  With  a revamped corporate strategy, improved competitive  positioning, more  stable revenues, and considerably higher gross  margins, Nutanix is well  positioned to deliver on the promise of its  transformation and develop  into a more diversified enterprise software player with more  predictable growth. As the company leverages the  ability to deliver  positive free cash flow and more steadily growing  revenues, Nutanix is  set to experienced considerable multiple expansion  in the coming  years. \n\n*You can also find me on Twitter* [*@BlackjacketCo*](https://twitter.com/BlackjacketCo) *where I write about emerging technologies and long-term market trends. Thanks for reading!*",
        "subreddit": "investing",
        "title": "Nutanix: Exposure to Cloud and SaaS for More Reasonable Price",
        "url": "https://www.reddit.com/r/investing/comments/ioual0/nutanix_exposure_to_cloud_and_saas_for_more/",
        "created": 1599603232.0
    },
    {
        "author": "AmericanSpirit4",
        "created_utc": 1599013625,
        "id": "ikycqo",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Looking to add covered calls to my IRA. Seeing as how this is my first year opening an IRA, I only have $6,000 invested in it.  So a stock under $50 would be ideal.  Would invest more into a separate account if it seemed worthwhile.\n\nWas thinking about doing it for CISCO given how they have a solid dividend rate and has a small chance at a large jump in price.\n\nAny thoughts?",
        "subreddit": "investing",
        "title": "Any advice on a good covered call company to invest in?",
        "url": "https://www.reddit.com/r/investing/comments/ikycqo/any_advice_on_a_good_covered_call_company_to/",
        "created": 1599042425.0
    },
    {
        "author": "jerklewd",
        "created_utc": 1600484681,
        "id": "ivkk97",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Simply put it, are there any examples where a insane rally of certain shares did not result in a crash that took a long time to recover.\n\nAs I am rather new to this, from my limited view, most insane rallies took close to a decade to recover. I.E. the dot.com bubble where solid firms like AMZN, MSFT, MCD. Soms firms like CSCO, XRX never reach their ATH. Other non dot.com bubble examples are X (US STEEL CORP), POLAROID (went private) and many others that no longer are public or exists.\n\nI know of one that is still going strong despite insane rally, FB are there any strong examples or are insane rallys usually irrational exuberance and are bound to fail.",
        "subreddit": "investing",
        "title": "A question about high flying stocks and reversion to the mean",
        "url": "https://www.reddit.com/r/investing/comments/ivkk97/a_question_about_high_flying_stocks_and_reversion/",
        "created": 1600513481.0
    },
    {
        "author": "Cache_Flow",
        "created_utc": 1600544559,
        "id": "ivzcdn",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "So I jumped in the market early this year. I've started with some ETFs and then moved to some growth and dividend stocks of companies or industries I'm interested in or knowledgeable about. I feel like I went too far with 23 positions (although 3 are very small) and want to grow or consolidate some of them (buy more, not sell, recommendations welcome). I keep seeing opportunities and still have individual companies im interested in investing but know I'm potentially missing out on gainz with over diversification. Still have 30+yrs until retirement age. Also feel i could be slightly overexposed in my industry - Tech/telecom makes up 46% (25% and 21%), 3rd heaviest is real estate at 18.5%. \n\nBelow are full weighting with my thought process notes. I realize there's some overlap with the individual picks and sector ETFs - which should i prioritize at this point?\n\n Thoughts, advice? TIA\n\nVOO 14.87% - core holding\nGD 9.58% - dividend/defense trends \nQCOM 8.09% - 5G play\nCCI 5.84% - dividend \nVBR 5.55% - small cap exposure \nIWP 5.09% - mid cap exposure \nATVI 4.88% - growth play \nTTWO 4.83% - growth play\nDLR 4.41% - dividend/company\nFTNT 4.29%- growth play\nTMUS 4.05%- growth play/company\nCSCO 3.64% - dividend/company\nT 3.53% - dividend \nXLI 3.36% - industrials exposure, like the holdings\nXLRE 3.25%- additional RE exposure\nXLF 3.01%- financials exposure\nSPG 2.98% dividend and high bounce back potential \nXLK 2.72%- additional exposure tech growth\nXLC 1.79%- like the holdings \nRDS.B 1.72% - international, worst pick, down 30%\nNRZ 1.87% - dividend \nNTNX 0.67% - growth play",
        "subreddit": "stocks",
        "title": "Recommendations for portfolio weighting/consolidation and feedback",
        "url": "https://www.reddit.com/r/stocks/comments/ivzcdn/recommendations_for_portfolio/",
        "created": 1600573359.0
    },
    {
        "author": "BitcoinLover12312",
        "created_utc": 1599493497,
        "id": "io9si5",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Okay its not zoom but its almost exactly like it from what I've read.. It competes with salesforce/zoom/slack and cisco. (CRM/ZM have been on fire as you may know). The market marker shows a move of a little over 23%.. This could be the next ZM..\n\nposition: 9/11 ZS 140c",
        "subreddit": "wallstreetbets",
        "title": "Why is nobody talking about upcoming ZS earnings? The MMM is expecting a 23.179%",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/io9si5/why_is_nobody_talking_about_upcoming_zs_earnings/",
        "created": 1599522297.0
    },
    {
        "author": "uoftsucks",
        "created_utc": 1599620143,
        "id": "ip7z5w",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "my criteria for picking these stocks is mainly:\n\n-low P/E ratio (in the teens or lower)\n\n- low debt \n\n- low payout ratio (&lt;50%)\n\nINTC -&gt; this one is down 28% from Feb highs\n\nCSCO -&gt; this one is down 30% from 2019 highs\n\nTSN -&gt; this one is down 34% from Feb highs\n\nGD -&gt; this one is down 34% from 2018 highs\n\nPFE -&gt; this one is down 21% from 2018 highs\n\nBMY -&gt; this one is down 21 from 2016 highs\n\nI bought 2k worth of each today",
        "subreddit": "CanadianInvestor",
        "title": "my dividend payer (US) picks during this crash",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/ip7z5w/my_dividend_payer_us_picks_during_this_crash/",
        "created": 1599648943.0
    },
    {
        "author": "Okmanl",
        "created_utc": 1599681989,
        "id": "ipnzna",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Found a pretty strong DD post on uranium on both Quora and Reddit where both users came to the same conclusion. \n\n&amp;#x200B;\n\nHow likely is the stock market crash in 2021?\n\nNobody knows the timing, but we ought to know what’s happening in order to make a sound investment decision TODAY in preparation for the highest probable future.\n\nI believe the next stock market crash will be led by the crazy growth valuations set by the precedence of unicorn companies like Facebook, Apple, Alphabet (Google), Amazon, Netflix, Microsoft.\n\nTake a look below…\n\nDid you know that for Uber tried to file for a $100B valuation for their IPO? They were still burning billions of cash and still negative in profits.\n\nHow about WeWork’s failed IPO and how their $47B valuation in 2019 became $2.9B in 2020?\n\nOh, and don’t forget, it was basically Softbank bidding up WeWork’s valuation against themselves!\n\nTo give you a sense of how ridiculous these numbers sound, the entire uranium sector, which accounts for 10% of the world’s electricity, is worth \\~$10B.\n\nAnyway, the market has been infatuated with these kinds of “growth” companies for more than a decade now, and they still are, as evidenced by…\n\nThe S&amp;P 500 doesn’t look so impressive without the large-cap tech companies.\n\nTruth is, comps will be tough from 2021 and onwards; growth will slow; supply and competition is ramping, and when supply &gt; demand, things will fall apart.\n\nDuring the dot-com bubble, everyone forgot tech companies are subject to the same prosaic laws of demand &amp; supply and competition as other industries.\n\nThe pandemic has accelerated growth temporarily, and almost every software/tech company you look at is growing very rapidly at present.\n\nThis is not only unsustainable, but also a temporary demand/supply imbalance.\n\nJust like in the dot-com bubble, top-line growth will slow and profits will disappoint. Consequently, there will be a massive downward cascade.\n\nRemember when Cisco leaked 1% lower every day for 2 years when the dot-com bubble popped in 2000?\n\nWe are already seeing access to funding becoming more challenging, and this will only become more challenging as growth and profitability slows.\n\nAt the top of bubbles, people extrapolate top of cycle revenue growth rates &amp; margins way into the future. And this is happening now.\n\nWhen you revise down revenue growth estimates &amp; margin expectations, multiples also fall and the multiplicative impact can be catastrophic.\n\nTake a look at Uber…\n\nUber literally had the worst-case scenario happen to them (COVID-19 causing people to avoid ride-sharing AND having to treat drivers as actual employees), and it’s still trading flat/a bit higher than the beginning of 2020.\n\nThis isn’t supposed to happen under normal market conditions, as there should always be competitive jostle, which just doesn’t exist today.\n\nEven if the industry is doing well overall, there should be winner and losers.\n\nHowever, as of present, even the losers are either neutral or winners.\n\nAll this said, this isn’t normal. This is a bubble.\n\nIn 1999, the momentum of the growth narrative was so strong that growth potential seemed unlimited to a point where growth limitations and reality are ignored. Just look at Apple…\n\nIt took 42 years for Apple to reach a market cap of $1T, yet only 2 more years for it to get to $2.15T.\n\nYou have to remember, the world is of a finite size and it’s impossible to sustain high growth rates as you increase your scale.\n\nAnd this is a reality even for tech giants.\n\nIt’s a matter of when, not if, everything collapses.\n\nNow, since history rhymes, what exactly happened after the dot-com bubble popped?\n\nCommodities and value investing came back in fashion and went into an explosive bull market…\n\nAnd this is exactly where I’ve positioned my portfolio.\n\nAgain, I can’t call when, but commodities trading at all-time lows signals to me that they just might be overdue for a mean reversion and an upcoming bull market.\n\nThis will be one of the biggest wealth transfer opportunities in history, so position your portfolio accordingly. Get rid of deflationary assets (tech) and long inflationary hedge assets (energy, materials, commodities), as they are still dirt cheap!\n\n[https://www.quora.com/How-likely-is-the-stock-market-crash-in-2021/answer/Josh-Lin-3?ch=10&amp;share=5b0c9231&amp;srid=uumtx](https://www.quora.com/How-likely-is-the-stock-market-crash-in-2021/answer/Josh-Lin-3?ch=10&amp;share=5b0c9231&amp;srid=uumtx)\n\n————-\n\n&amp;#x200B;\n\nThen there’s another user on Reddit that made a very strong case for uranium. Uranium powers 10% of the world's energy, has half the market cap of Pinterest (a website that lets you look up furniture). Furthermore Uranium is used to power EV, which is going to be the future.\n\n&amp;#x200B;\n\n[https://www.reddit.com/r/investing/comments/ia7el4/the\\_coiled\\_spring\\_that\\_is\\_the\\_uranium\\_market\\_an/](https://www.reddit.com/r/investing/comments/ia7el4/the_coiled_spring_that_is_the_uranium_market_an/)",
        "subreddit": "stocks",
        "title": "Uranium, and other commodities... One of the biggest wealth transfer opportunities in history?",
        "url": "https://www.reddit.com/r/stocks/comments/ipnzna/uranium_and_other_commodities_one_of_the_biggest/",
        "created": 1599710789.0
    },
    {
        "author": "londongirl42",
        "created_utc": 1600908750,
        "id": "iymteh",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "What about Csco about to pay dividends way down from it's high",
        "url": "https://www.reddit.com/r/options/comments/iymteh/what_about_csco_about_to_pay_dividends_way_down/",
        "created": 1600937550.0
    },
    {
        "author": "aek427",
        "created_utc": 1600189988,
        "id": "itd3g7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "When my friends and I YOLO, I like to send them chart watching videos with disturbing commentary...this is CSCO and we’re all in the midst of being tits up on 9/18 $42.50 calls",
        "url": "https://v.redd.it/jge8w3msgcn51",
        "created": 1600218788.0
    }
]