[
    {
        "author": "WSBConsensus",
        "created_utc": 1585059617,
        "id": "fo5vm5",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "*Sorry for being late this morning guys, I had a long night. Hopefully everyone is on the right side of trade, as always, good luck today degenerates.* \n\n\n**Of note for Airlines (LUV, AAL, DAL, UAL)** – WSJ reports US airlines are drafting plans for a voluntary shutdown of almost all passenger flights across the US as the government is also mulling such a move amid the COVID-19 pandemic.\n\n**Of note for banking names (C, DB), Citi and Deutsche Bank (DB)** are among lenders stuck with billions of dollars of debt backed by **MGM Grand (MGP)** and Mandalay bay properties in La Vegas as the outbreak of COVID-10 has hampered the banks' ability to syndicate the loan.\n\n**Of note for Semiconductors (SOX)** RBC highlight reports which state Huawei announced the launch of its latest 5G Kirin chip and that it is continuing its 5G infrastructure build, while **Taiwan Semiconductor (TSMC)** new 5nm chip is 84-87% superior to the 7nm node in transistor density\n\n#Dow Jones\n\n\n**3M Company (MMM), Ford Motor (F) and General Electric (GE)** are teaming up to manufacture respirators and ventilators to help tackle the coronavirus.\n\n**Boeing Company (BA)** – After yesterday’s announcement, it is to suspend production at its Puget Sound, Washington facility. \n\n**Spirit AeroSystems (SPR)** announced it is to suspend production for **Boeing (BA) (Note, SPR manufacture the fuselages)** at its Wichita, Kansas, Tulsa, McAlester and Oklahoma facilities, but will continue work at its Charleston and South Carolina facility. Elsewhere, BA CEO states it has ample liquidity and that the situation is normalizing in China, with 737 return still scheduled for “mid-year”.\n\n**Chevron Corp. (CVX)** announced it is reducing Capex guidance by 20% (USD 4bln) and is suspending its USD 5bln annual share repurchase programme but has no plans to cut its dividend. It also added the impact of COVID-1 is expected to negatively impact its future financial operating results.\n\n**Intel (INTC)** was upgraded t Neutral from Sell at Goldman Sachs; PT USD 54 (Prev. PT USD 55, Prev. closing price 49.58/shr) in a research note where the analyst, Toshiya Hari, stated despite COVID-19 headwinds, it has multiple near term positive development such as the potential resilience in the high-end client CPU markets as people are encouraged to work from home which could offset the headwinds of weaker consumption and spending from enterprises. Elsewhere, it announced it is to suspend its share repurchase programme due to COVID-19.\n\n**Johnson &amp; Johnson (JNJ)** CFO announced that the uncertainty surrounding COVID-19 will make it difficult to accurately predict financials in guidance.\n\n#Nasdaq 100\n\n\n**Amazon.com Inc. (AMZN)** suspended over 3900 selling accounts on its platform for violating fair pricing policies.\n\n**Applied Materials Inc. (AMAT)** withdrew its Q2 guidance, noting it will provide an update at its upcoming earnings webcast. Applied Materials added it remains committed to its proposed acquisition of Kokusai Electric and it is working to close the deal, subject to approval.\n\n**Comcast Corp. (CMCSA)** holds the rights to the 2020 Olympics, although WSJ reports the Co has been assuming the games will be postponed, according to people familiar with the matter. Note that it has just been announced the games will be delayed till 2021.\n\n**Gilead Sciences (GILD)** announced the FDA has designated its remdesivir as an orphan treatment for COVID-19.\n\n**Mondelez International (MDLZ)** announced it is to increase hourly wages by USD 2/hr and pay a USD 125 weekly bonus for its sales representatives as it deals with a surge in demand.\n\n**PACCAR Inc. (PCAR)** announced it will suspend its truck and engine production at factories globally from today to April 6th\n\n#S&amp;P 500\n\n\n**Aptiv Plc (APTV)** announced it has withdrawn guidance and suspend its dividend of roughly USD 225mln annually while drawing down the remainder of its revolving credit facility of USD 1.4bln.\n\n**Constellation Brands (STZ)** announced it will continue working with local authorities and government officials on the next steps in relation to its brewery project in Mexicali and other options in Mexico.\n\n**FedEx Corporation (FDX)** announced it set up a special operation to help the government transport COVID-19 tests from over 50 drive through testing centres across 12 states.\n\n**General Motors (GM)** intends to draw down about USD 16bln from its revolving credit facilities and announced it has withdrawn its FY20 guidance.\n\n**Honeywell Int'l Inc. (HON)** is reportedly in talks to raise over USD 5bln in a new 2-year term loan, according to people familiar with the matter.\n\n**IHS Markit Ltd. (INFO)** Q1 20 (USD): adj. EPS 0.66 (exp. 0.64), Revenue 1.081bln (exp. 1.08bln). CEO announced it is aiming for double-digit earnings growth in 2020 and over the coming years.\n\n**Nordstrom (JWN)** announced it is suspending its quarterly dividend from Q2, drawing down USD 800mln on its revolving credit line and suspending its share repurchase programme.\n\n**Twitter, Inc. (TWTR)** withdrew its Q1 guidance due to the impact of COVID-19 but expects Q1 revenue to be down slightly Y/Y.\n\n**Wells Fargo (WFC)** announced it would be paying compensation to front-line employees where its domestic full-time employees on under USD 100k/yr would receive a pre-tax payment of USD 600 and part-time workers would get a bonus of USD 300.\n\n**Yum! Brands Inc (YUM)** Pizza Hut is now offering contactless delivery nationwide.\n\n#Other\n\n\n**AB InBev (BUD)** announced it has withdrawn its FY20 guidance.\n\n**Alibaba (BABA)** – SoftBank is reportedly planning a USD 14bln BABA share sale.\n\n**Dana (DAN)** announced it has withdrawn its FY20 guidance.\n\n**Elanco (ELAN)** announced it withdrew its FY20 guidance but notes its acquisition of **Bayer’s (BAYN GY, BAYRY)** animal health business is unaffected by the COVID-10 and it is aiming towards the deal being closed by the middle of this year.\n\n**Goodyear Tire (GT)** announced its Just Tires will remain open to help essential workers.\n\n**iRobot (IRBT)** has withdrawn its FY20 guidance and expects Q1 revenue between 175-185mln (exp. 210.24mln).\n\n**Qiagen (QGEN)** announced it has begun shipping the diagnostic COVID-19 tests to the US.\n\n**SeaWorld (SEAS)** announced it no longer expects to achieve its FY20 Adj. EBITDA target of USD 475-500mln.\n\n**Suncor (SU)** revised its 2020 guidance and expects capital to be between USD 3.9-4.5bln, a 1.5bln or 26% decrease compared to previous guidance. The co. also cut its 2020 production outlook and suspended its share repurchase programme for the next year.\n\n**Toyota (TM) and Nippon Telegraph and Telephone (NTTYY)** are teaming up and have signed a capital and business tie-up deal to spend USD 1.81bln to build a smart city on a former TM site.\n\n**Uber (UBER)** announced it has named Robert Eckert, former CEO of **Mattel (MAT)**, to its board as an independent director.\n\n**Wabco (WBC)** announced its merger with ZF Friedrichshafen received all approvals from authorities apart from the Chinese State Administration for Market Regulation to close the deal. The two expect it will receive approval without too much delay and expects it to close in Q2 of this year.\n\n**Zillow (Z)** announced it has withdrawn its FY20 guidance.\n\n\n#Additional US Equity Stories\n\n\n**Comcast (CMCSA)** announced the impact of COVID-19 could have a material adverse impact on its financial results. Meanwhile, Japan’s PM Abe stated the government agreed to postpone 2020 Olympics and the IOC board are to meet later.\n\n**Of note for Airlines (UAL, DAL, LUV, AAL),** the IATA head economist expects airline capacity to be down 90% in Europe in Q2 20 and the head of IATA states over half of airlines could go bust in the coming weeks if there is no assistance.\n\n**Raytheon (RTN)** announced it is going to be modernising the Brazilian Air Force’s surveilance radars and will upgrade them to next-gen Monopulse Secondary Surveillance Radar Systems and Condor MK3’s to increase efficiency and reduce consumption of energy.\n\n**Wedbush created a “shopping list”** by compiling each analyst’s two top long-term ideas and believes currently on sale with confidence on each company balance sheet and how well it can pass through the COVID-19 outbreak if it were to be longer lasting. The list includes **American Eagle (AEO), AMD (AMD), Abercrombie &amp; Fitch (ANF), Activision Blizzard (ATVI), Autozone (AZO), Chipotle (CMG), Salesforce (CRM), Alphabet (GOOG), Lowe’s (LOW), Microsoft (MSFT), Nike (NKE), Nvidia (NVDA) and Wingstop (WING).**\n\n *Nvidia (NVDA) &amp; AMD (AMD) were added to Wedbush’s Best Ideas list.*",
        "subreddit": "wallstreetbets",
        "title": "Bippity BOPPITY give me the zoppity!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fo5vm5/bippity_boppity_give_me_the_zoppity/",
        "created": 1585088417.0
    },
    {
        "author": "RssnGopnik",
        "created_utc": 1583755253,
        "id": "fftl4p",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Applied material company is that supplies semi conductors with the silicone and other crap to make processors and memory modules. The problem that we are running into you in 2020 is that we are short on ddr6 modules to begin with and we’re really short on some of the silicone semi conductor processing units a.k.a. your L2 and L3 cashier level memories. So with already problem of shortage and now with coronavirus supply export and import it’s a good time to short a met their plunge 15% in the last week",
        "subreddit": "wallstreetbets",
        "title": "Short $AMAT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fftl4p/short_amat/",
        "created": 1583784053.0
    },
    {
        "author": "CryptoSir",
        "created_utc": 1584729309,
        "id": "fm04uv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$SPCE and $AMAT calls... I sold my $SPCE calls but kept my $AMAT calls my peak was Feb 19th $10,350",
        "url": "https://i.redd.it/yb4jswbcgvn41.jpg",
        "created": 1584758109.0
    }
]