[
    {
        "author": "pickbot",
        "created_utc": 1605503704,
        "id": "jv154s",
        "num_comments": 131,
        "num_crossposts": 0,
        "selftext": "Hello fellow degenerates. I have been tracking all of the terrible decisions of this community through my automated collection techniques. Here is the weekly summary of best performing picks and pickers. I take no accountability for any mistakes in this data, as I am a computer program created by a r/wallstreetsbets user, which we all know means he has limited intellectual capabilities.\n\n# As a whole I tracked 119 picks on WSB this week, 32 picks with positive ROI and 69 picks with negative ROI for a combined ROI of -11.99%\n\nStarting with the good news: \n\n**Best** Performing **Bull** picks in the **last 7 days**:\n\n[Best Performing Bull WSB picks Nov 8th 2020 to Nov 15th 2020](https://preview.redd.it/tozurumvcjz51.png?width=1092&amp;format=png&amp;auto=webp&amp;s=0fb0a4aa2ded1ffc4c935ce87c6ce0502ccf97a5)\n\n1. [\"DRIP 11/20 $70 calls guy\"](https://reddit.com/r/wallstreetbets/comments/jrbjm0/drip_1120_70_calls_guy) by u/lurkkkknnnng2 Tickers: $DRIP ROI: 218% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhbbhipv0m6m0709we3xhmsf) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/lurkkkknnnng2)\n2. [\"I thought this was America!\"](https://reddit.com/r/wallstreetbets/comments/jqvf6c/i_thought_this_was_america) by u/Ckynash Tickers: $GM ROI: 132% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhafc331861h0738w4gvqq5f) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/Ckynash)\n3. [\"$JD\"](https://reddit.com/r/wallstreetbets/comments/jsolcn/jd) by u/CrabCakeandFootball Tickers: $JD ROI: 124% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhed5juojwj40749avsn6npy) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/CrabCakeandFootball)\n\n**Best** Performing **Bear** picks in the **last 7 days**:\n\n[Best Performing Bear WSB picks Nov 8th 2020 to Nov 15th 2020](https://preview.redd.it/8by8g0g1djz51.png?width=1092&amp;format=png&amp;auto=webp&amp;s=8611bd002d662a4571fd93e49a4650cf65d29f0f)\n\n1. [\"Did E-Trade just fuck me?\"](https://reddit.com/r/wallstreetbets/comments/jt6tet/did_etrade_just_fuck_me) by u/rieslingmagic Tickers: $BABA ROI: 31% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhfiy7bnfzlb0770ecxr4sv2) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/rieslingmagic)\n2. [\"Travel industries 🌈 🐻 🌈 and Chy-nah Bulls quick huddle\"](https://reddit.com/r/wallstreetbets/comments/jro61m/travel_industries_and_chynah_bulls_quick_huddle) by u/3103MGunner Tickers: $CCL ROI: 18% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhc7a20kd1ii070940b3hx7j) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/3103MGunner)\n3. [\"BYND stock DD\"](https://reddit.com/r/wallstreetbets/comments/jrfxve/bynd_stock_dd) by u/programmer1853 Tickers: $BYND ROI: 5% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhblhkzh4cbd0709c2ptqsmw) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/programmer1853)\n\nNow for the data **you are all really looking for**:\n\n**Worst** Performing **Bull** picks in the **last 7 days**:\n\n[Worst Performing Bull WSB picks Nov 8th 2020 to Nov 15th 2020](https://preview.redd.it/s13rypr3djz51.png?width=1092&amp;format=png&amp;auto=webp&amp;s=bf5a5f72001debe95597d7ef888ed2d718607299)\n\n1. [\"RKT gonna make us all rich\"](https://reddit.com/r/wallstreetbets/comments/jrqq6x/rkt_gonna_make_us_all_rich) by u/sjtomcat Tickers: $RKT ROI: -99% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhcbx8h2f76b0709tj1g4bwd) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/sjtomcat)\n2. \"I mean... Basically ( NVDA 11/13 600C )\" by u/Responsible-Intern31 Tickers: $NVDA ROI: -99% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhay9q65g9pi0738stz11xja) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/Responsible-Intern31)\n3. [\"What will AMC $3c expiry 11/13 be worth at open?\"](https://reddit.com/r/wallstreetbets/comments/jrjwd7/what_will_amc_3c_expiry_1113_be_worth_at_open) by u/O_Wagons Tickers: $AMC ROI: -99% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhbxzojf949f0709li3703sx) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/O_Wagons)\n\n**Worst** Performing **Bear** picks in the **last 7 days**:\n\n&amp;#x200B;\n\n[Worst Performing Bear WSB picks Nov 8th 2020 to Nov 15th 2020](https://preview.redd.it/f73a5hm5djz51.png?width=1092&amp;format=png&amp;auto=webp&amp;s=d04eeb8906ab61f9969e5251cd8c6aee7d80988b)\n\n1. [\"QQQ Support at 281.9\"](https://reddit.com/r/wallstreetbets/comments/jrnffn/qqq_support_at_2819) by u/CuckyMonstr Tickers: $QQQ ROI: -99% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhc5ulqpce500709bb5q1n4t) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/CuckyMonstr)\n2. [\"PDD rally going to see a slight pullback tomorrow?\"](https://reddit.com/r/wallstreetbets/comments/jswjzr/pdd_rally_going_to_see_a_slight_pullback_tomorrow) by u/ze_kraken Tickers: $PDD ROI: -99% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckheznu9587zo0770llzcfm3c) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/ze_kraken)\n3. [\"Spy PUT YOLO\"](https://reddit.com/r/wallstreetbets/comments/jr16ol/spy_put_yolo) by u/CuckyMonstr Tickers: $SPY ROI: -99% [^(\\[Realtime Pick ROI\\])](https://www.pickmojo.com/pick/ckhasjxjmdnoi0738iv8u38uk) [^(\\[User Track Record\\])](https://www.pickmojo.com/user/CuckyMonstr)\n\n# Here is a breakdown of the most picked tickers for this week:\n\nhttps://preview.redd.it/z058g517djz51.png?width=653&amp;format=png&amp;auto=webp&amp;s=9074f8d4d7e5a20504c5d70eaa2726d76059a03b\n\nAs always if you would like any more information tracked or have any suggestions let me know in the comments! Thanks!",
        "subreddit": "wallstreetbets",
        "title": "WSB Performace: Best, Worst and other data for last 7 days",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jv154s/wsb_performace_best_worst_and_other_data_for_last/",
        "created": 1605532504.0
    },
    {
        "author": "Nydas",
        "created_utc": 1605413761,
        "id": "jufuq6",
        "num_comments": 112,
        "num_crossposts": 0,
        "selftext": "Was hoping it would get around $2.50 again, but it seems like $2.80 -$3 might be the new floor. \n\nThinking about going hard on some 2023 call options on the next big red day.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Anyone going in big on AMC?",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/jufuq6/anyone_going_in_big_on_amc/",
        "created": 1605442561.0
    },
    {
        "author": "LouisHillberry",
        "created_utc": 1606329636,
        "id": "k0xzhk",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": " \n\nWe all know SPY at ATHs, Dow 30k, PLTR is fucking moving, EV insanity blah blah blah. But I just know there is some bleary eyed idiot from Stocks and Investing here that is like I just CANT bring myself to take these kind of risks, look how expensive the market is!!!\n\nEven though the market is at all time highs, and basically the market has been trading flat other than yesterday, there is crazy volatility underneath the surface. For almost a decade, growth stocks (high top line growth, high multiples, etc) have outperformed value because 1) growth was hard to find as the economy was dog shit 2) interest rates dropped like a stone from 4 down to 1.4% pre-covid which makes cash flows in the out year more valuable today when you discount them back 3) usually high period of disruption due to technology (connectivity, shift to mobile, computing increases, etc). **But basically, when growth is hard to find, you are willing to pay the fuck up for future earnings growth.**\n\nBut boys. Let me tell ya, economic growth is coming the fuck back. One, the Fed goes fucking brrr - and ole Yellen is back in the saddle.1) The Fed is basically a permeant backstop now which basically changes the equation of risk for both investors and companies. 2) The Dems will, and should, print money with reckless abandon. Because the US dollar is the global reserve currency they should print dough until the dollar fucking breaks. And it basically hasn't budged even though the US has spent 7 trilly on Stimulus. 3) Savings rates in both the US and Canada are at all time highs, with interest rates at all time lows. Have you seen the fucking housing market? Not only is there lots of money on the sidelines, **demand is coming online in sync across the globe.** You may never see a demand spike like you are about to see in areas like Leisure / Travel. Hotels in Honolulu aren't going from 150$/night back to $400 next year. Mother fucker they are going to 600. Every live sporting event, concert, festival, restaurant will be fucking PACKED. **4)** The fed changed their inflation policy from 2%, to an average metric - basically meaning they will run the economy hot to bring average inflation up to 2-2.5% over an observed time period. Well inflation has been sub 1.5% for YEARS and they will run this fucker HOT at 5-6% GDP before they touch rates. **Most important thing here is that rates are going up on the ten year, there will be unreal demand for things most affected by the virus, and the relative valuation of low pe stocks is going to start looking reallll good realll fast.**\n\nSo what does this mean? You want to be in early cycle cyclicals right now. Industrials, Materials, Banks. You also wanna be in travel/restaurants. Energy will rock too, but its kind of dog shit and you can leave it be.\n\nCurve ball though - I'm one of those blind ass tech bulls. I'm not here to tell you that GM is better than TSLA, they aren't. But when you can pay 15x for 100% EPS growth from GM you're going to do that instead of paying 300x for the same rate at Tesla. Same thing with software. I jerk off that business model and the trap door isn't going to fall out, its just not going to do fucking well on a relative basis.\n\nI don't wanna sell my tech shit, but I wanna participate in this reopening lunacy. So how do I do it? Buy shit thats going to do well if some government shut the place down. I'm talking DOCU, PTON, ZM, COUP, OKTA, I dunno, whatever software you want. But balance this shit with long dated calls in reopening stuff. If your calls expiry worthless, your tech shit will be up so much you won't care. If tech is flat to down you'll mint on the calls. I control 16x in shares vs my outlay for the calls, basically the size of the rest of my portfolio in Reopening calls June 21-Jan 22. Sharpe ratio (return/vol) for the last two months is 5.2. Psychologically, the lockdown headlines just aren't doing it anymore. LA, NYC, Chicago, France, Germany, Canada, all locked down, market it looking through it. AZN puts out a garbage vaccine release and value is smoking hot. You'll see more catalysts as these places reopen, first innoculations are announced, general availability, etc. AND cases will start to seasonally decline around March when it gets warmer out. And if you don't think this shit is seasonal, you're dumb. You think we just found the magic in July? Shut up.\n\nLong WFH - AMD, PLTR, ZM, PTON, DOCU, SQ\n\nLong Reopening Calls - AMC, XLF, KRE, XLE, LYFT, JETS",
        "subreddit": "wallstreetbets",
        "title": "Real Institutional DD for you losers, how to play this market",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k0xzhk/real_institutional_dd_for_you_losers_how_to_play/",
        "created": 1606358436.0
    },
    {
        "author": "expander2",
        "created_utc": 1605743336,
        "id": "jwrgxl",
        "num_comments": 98,
        "num_crossposts": 0,
        "selftext": "**Welcome back to the WSB DD Summary!** For those of you that don’t remember me, I am the sick fuck that used to comb through all the DD you idiots post and combine all the relevant information into one post a few times a week. That’s how I got the flair. I took a break but now I’m back and have fewer brain cells than ever! As in previous posts, the ticker will be in bold on the left and I write this so that the info I deem most “important” will be near the top. I would ask you to read all the way through to get the most information you can, but honestly I don’t give a shit. As always a follow-up from previous DD summaries (not this time), TLDR, and plays will be at the bottom. I know you cucks are greedy so this info can give you a little more variety instead of only playing with Elons testes all day.\n\n&amp;#x200B;\n\n**CNK**\\- Cinemark is a movie theatre company and before you roll your eyes and scroll on, take a look because it has a lot more potential than you think. Cinemark owns theatres in 42 states and 16 countries totaling over 6,000 screens. Granted they are not being used right now but that is a lot of assets. For being shutdown, they are doing surprisingly well. They have more than enough cash on hand to last many more months and that is if they make no profits at all which is highly unlikely. Even if this were to last longer than their cash, they have very manageable debt and more than enough assets to cover it. The majority of their debt is long-term and most of it isn't even due until 2023 which gives them more than enough time to either roll it over or generate enough capital to pay it down. The positive information above isn’t even taking into account the [deal they just made](https://ir.cinemark.com/news-events/press-releases/detail/478/universal-filmed-entertainment-group-and-cinemark-theaters) with Universal (which includes DreamWorks) to release in their theatres for at least 3 weeks before they can release the movies anywhere else. This is fantastic news because it gives them exclusive access to the opening few weeks of any movie which historically is when they make their most money. \n\nWhat can you take away from this? This is a company that is being managed very well given the circumstances. Long term movie theatres are not going away. They may change but for many people, nothing beats going and seeing something on the big screen. Given the fact that AMC is gasping for air, CNK has the potential to become the leading movie theatre in the nation. To me, shares are the best idea. Long term and at this discount they will net you some good profits. But I know that's not how you fucks work, you want options. The [original poster](https://www.reddit.com/r/wallstreetbets/comments/jvxjpu/cinemarks_cnk_free_tendies/) advocated for 20c for 4/21 and 30c for 12/21 which is very reasonable. THIS IS A LONG TERM PLAY. For more info take a look at their [10-k](https://ir.cinemark.com/sec-filings/all-sec-filings/content/0001564590-20-005646/0001564590-20-005646.pdf) and previous [earnings](https://d1io3yog0oux5.cloudfront.net/_529fa8877bd02a78fc90e3d84715e621/cinemark/news/2020-11-05_Cinemark_Holdings_Inc_Reports_Results_for_the_475.pdf). \n\n&amp;#x200B;\n\n**EBAY-** We all know eBay. A substantial online consumer sales company that has been around for years. What some of you don't know is that they are at 3-month lows GOING INTO BLACK FRIDAY. Are you fucking kidding me? An online store that makes money every Black Friday is down on a year where online shopping is at numbers never seen before in history? Seems like people are confused. Last year they made 2.8 billion in their [4th quarter](https://ebay.q4cdn.com/610426115/files/doc_financials/2019/q4/Exhibit-99.1-ER-eBay-Q4-2019_FINAL.pdf) which includes Black Friday and Christmas. Just last earnings (3rd Quarter 2020) they [reported earnings](https://ebay.q4cdn.com/610426115/files/doc_financials/2020/q3/Exhibit-99.1-ER-eBay-Q3-2020_FINAL.pdf) of **2.6 billion**. A quarter without Black Friday and Christmas made almost as much as they did last year doing those times. Using just 9 out of the total of 15 brain cells I have and a little bit of extrapolation, I can say that they are going to crush last year's Q4 numbers. [This post](https://www.reddit.com/r/wallstreetbets/comments/jwls84/ebay_call_the_safest_option_you_can_get/) has some more information you can take a look there and at the other links to further decide for yourself. OP says 55 or 60c for January 21 which seems like a safe bet, but if you want a shorter-term play, I would say around 49.5-51 for mid to late December would work just as well. This will be closing the holiday shopping season and locking in profits for eBay.\n\n&amp;#x200B;\n\n**HDS-** I'll just pull stuff straight from the [original post](https://www.reddit.com/r/wallstreetbets/comments/jwk6iq/the_knock_off_home_depot/), \n\n&gt;HD Supply is an industrial distributor in North America. Their revenue is 7.39 billion. Home Depot has decided to acquire it...\n\nAfter news of the acquisition hit the price jumped to 55 from 44. Home Depot plans to acquire them for 56 a share cash. This news, however, disregards the fact that FOUR INDEPENDENT LAW FIRMS for possibly breaching their fiduciary duties or violating the federal securities laws in connection with the company’s acquisition by The Home Depot, Inc. Uh oh, that's not good. If these firms find anything, and they very well could, expect acquisition talks to breakdown completely and the stock price to tank. And guess what, they dropped a bit after market close as well. Watch the news closely because this is quite possibly a slamdunk for puts given how quickly the price rises and falls. The price may hover around 55 for a while given Home Depot but just watch. This could be a nightmare for both companies. Given all that, make sure you do a little of your own research. \n\n&amp;#x200B;\n\n**Knowledge-** Now back in May, I made [this post explaining how to play earnings](https://www.reddit.com/r/wallstreetbets/comments/ge06g7/how_to_play_earnings_like_youre_not_a_retard_tldr/) like you were not completely incompetent. There is a lot more that goes into it than just earnings. You also have to understand the psychology of the market which is really fucking difficult. We have all lost a shit ton of money because a company did good on earnings and the market decided it wasn’t good enough. Or they took a shit on earnings but not a huge shit and the market sent it to the moon. I have a bit of experience in this sector knowing quite a bit about mass psychology so if you would like a post similar to the earnings one about market psychology then let me know.\n\n&amp;#x200B;\n\nThat’s all I’ve got for today. Good luck fuckers and, for those of you that remember, instead of doing these summaries 3 times a week I will be doing them after market close on Wednesday and Sunday nights so that you can work through all the big words in your head before market open the next day.\n\n&amp;#x200B;\n\n**TLDR;** Cinemark has a pretty good chance of pulling out of this a bigger player in the movie industry. eBay is undervalued given their extremely high likelihood of killing earnings and raking in cash because of the holiday season. HD Supply is being investigated and acquisition talks could take a turn for the worst. I know about market psychology, would you like to?\n\n**Plays;** CNK 20c 4/21 or 30c 12/21, EBAY 55-60c 1/21 or 49-51c 12/20, HDS 55p 12/20 1/21 or 3/21 with 3/21 being the safest bet.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nDISCLAIMER; Do your own god damn research before going all-in on something I say. I am not telling you this will work, I simply go through posts and do my own research then compile it here. PLAY AT YOUR OWN RISK.",
        "subreddit": "wallstreetbets",
        "title": "I’m back dipshits. DD Summary for 11/15-11/18 Cinemark, eBay, HD Supply, and The Return of Your DD Daddy, TLDR and plays included",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwrgxl/im_back_dipshits_dd_summary_for_11151118_cinemark/",
        "created": 1605772136.0
    },
    {
        "author": "beachbum7",
        "created_utc": 1605550171,
        "id": "jvbosc",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "Alright, fellas -- the election is behind us so it's time to unite behind AMC to save America. If we don't buy AMC calls and pump AMC's stock price up, they are going to go bankrupt, Russia will buy up all their locations and turn America's movie theaters into cheap vodka distilleries. \n\nAMC is as American as cheating on your wife and fucking an apple pie.   \n\n\nCurrently trading at \\~ $3.15 with vaccine distribution + targeted stimulus.... $10 by Kwanzaa",
        "subreddit": "wallstreetbets",
        "title": "Buy AMC to save America",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvbosc/buy_amc_to_save_america/",
        "created": 1605578971.0
    },
    {
        "author": "squid_ink_paella",
        "created_utc": 1605377403,
        "id": "ju6b2g",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "AMCX is AMC networks, the media company/ TV channel. You may know them from Breaking Bad, The Walking Dead, Mad Men.\n\nHow short is short? AMCX has a float of 25 million shares, and short interest of 18 million shares. About 70%. With daily average volume of 1-1.5 million, it would take about 2 weeks for every short to cover. It is one of the most shorted companies on the market, and currently \"hard to borrow,\" indicating it's not cheap to stay short.\n\nWhy is it a value stock? AMCX has a market cap of a billion dollars. AMCX also has cash reserves of... a billion dollars. It has a PE ratio of 10 and a PS ratio of 0.5. In their most recent earnings, they beat. AMCX is a profitable company! \n\nHow is it going to squeeze? One good acquisition rumor should do it. There will be consolidation in the streaming content world, and AMCX would be a good pickup for one of the big names. It just popped above its 200 dMA and is looking relatively strong, so it may be slow-motion squeezing already. The company recently bought back 10 million shares, tightening the float. \n\nIMO, it's not a matter of if, but when. Anyone short this name is out of their freakin minds.\n\nPosition: March '21 OTM calls.",
        "subreddit": "wallstreetbets",
        "title": "AMCX : a short squeeze value stock",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ju6b2g/amcx_a_short_squeeze_value_stock/",
        "created": 1605406203.0
    },
    {
        "author": "AcroyearOfSPartak",
        "created_utc": 1605701538,
        "id": "jwep3u",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "How are people feeling about AMC...? On the one hand, you have the news of the vaccine, which could be the proverbial white knight for the embattled franchise. At the same time, you have the huge competition from streaming services, not to mention other theaters, independent and otherwise, and the delayed release for basically every major blockbuster. I also have heard that they are knocking on the door of bankruptcy and bleeding money. Their theater rental plan--from what I have heard--has been a huge failure. Nonetheless, if AMC can make a comeback, it would be a huge payoff for investors.\n\nAny thoughts on this?",
        "subreddit": "investing",
        "title": "The AMC question",
        "url": "https://www.reddit.com/r/investing/comments/jwep3u/the_amc_question/",
        "created": 1605730338.0
    },
    {
        "author": "No_Fap_Till_Midnight",
        "created_utc": 1605563329,
        "id": "jvfzy9",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "The past few weeks I gained roughly 70K just from vaccine pumps. Lol, pathetic. This is wallstreetbets and 70K ain't enough to buy a decent car let alone expensive cocaine and hookers. So retards, I am YOLO'ing a portion of my capital on AAL puts and AMC puts expiring on the 27 of November. This is the way and you know it. Fuck risk management and fuck safe investing.\n\nYOLO 4 LIFE! FREE MONEY! COCAINE AND HOOKERS!\n\nhttps://preview.redd.it/pbpcz5uoaoz51.png?width=1441&amp;format=png&amp;auto=webp&amp;s=49207bd402f33f94dd00e03bb71a36f2392228cd",
        "subreddit": "wallstreetbets",
        "title": "Time to ride the dump - YOLO AGAIN!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvfzy9/time_to_ride_the_dump_yolo_again/",
        "created": 1605592129.0
    },
    {
        "author": "InfiniteAccuracy",
        "created_utc": 1605538732,
        "id": "jv84gf",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "Sure, it might go bankrupt, but that didn't stop Hertz.  \n\nAMC is sitting on a solid 50% short interest, and as we go forward, anything looking like good news will make that absolutely skyrocket.  If we can get a short squeeze going, this would be an easy short squeeze.  \n\nA short squeeze on a stock with 50% short interest is a straight up rocket.  \n\nMeme stock potential?  Or going outta business?",
        "subreddit": "wallstreetbets",
        "title": "AMC is sitting on a potential rocket",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jv84gf/amc_is_sitting_on_a_potential_rocket/",
        "created": 1605567532.0
    },
    {
        "author": "alex824",
        "created_utc": 1605635269,
        "id": "jvxjpu",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "Ok retards, we have here the most undervalued stock on the market. You want FREE tendies? Listen to this= \n\n- CNK fair value is 29.69 (every fucking analyst, just do your own research) so it’s minimum 100% gainz\n- AMC is on the verge of bankruptcy (one month left in cash) if they lose CNK will explode 100-200% \n- AMC is already selling their theater to stay afloat you know what is mean for CNK (bigger market pie)\n- Retard thinks that CNK is the same shit as AMC \n- CNK just close a deal to have 20% of profit sharing when the movie release in retails for 14 days (most profitable time) \n- 5 fucking Millions in insiders buying in the last 6 month (no selling)\n- NO SHARE DILUTION in the last year (NCLH/AAL retards)\n- Just check the freaking 10 years graph to know if we are in a bottom or not \n- CNK have 13 month in cash and they are already profitable with private movie watching and attending as low as 25%\n- We don’t have a good vaccine yet but when we have one it will shoot up to 30$ (wait they will start to vaccinate in December with a 90%+ good vaccine ??)\n- Popcorn have a profit margin of 99%%\n- a lot more but I’m on my dinner break so do you own research retard \n\nCNK 20c 4/21 30c 12/21  AMC bankruptcy??? 40c 4/21",
        "subreddit": "wallstreetbets",
        "title": "Cinemarks (CNK) free tendies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvxjpu/cinemarks_cnk_free_tendies/",
        "created": 1605664069.0
    },
    {
        "author": "KRAndrews",
        "created_utc": 1604366845,
        "id": "jn10s2",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "It's so, so tempting, even though it's obviously a terrible idea. Maybe just $1000 for the heck of it? As far as I can tell, the only reason to go for it would be in hopes of either (1) a buyout from a company like Disney, (2) a very successful vaccine coming very soon, or (3) greater than expected success from their new private screening service.",
        "subreddit": "stocks",
        "title": "AMC just reached an all-time low price. On a scale from 1 to 10, how stupid is it to invest in?",
        "url": "https://www.reddit.com/r/stocks/comments/jn10s2/amc_just_reached_an_alltime_low_price_on_a_scale/",
        "created": 1604395645.0
    },
    {
        "author": "SilbergleitJunior",
        "created_utc": 1604373219,
        "id": "jn2qz4",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Hello my fellow autists,\n\nHow are your *\"the market is going to collapse because of US the election\"* puts treating ya?\n\nAnyway... Today I'm not here to make fun of your poor decisions, I'm here to talk RECOVERY!\n\nI'll jump straight to the point. Dr. Scott Gottlieb, member of the board of Pfizer, went on CNBC and gave us the timeline of the vaccine, so that we can all load up and make some cash.\n\nSome things to understand:\n\n* **There is already a vaccine!** Pfizer made it, they are testing it already on tens of thousands of people before they release to the masses.\n* Trial results will be announced at some point this month. Yes, **November 2020**.\n* Authorization to use the vaccine on older population will come some point this year. That's within the **next two months**.\n* People need to get **2 doses of vaccine**, spaced about **a month apart**.\n* We'll have the **first group** of **immune** fellows from the vaccine around **February/March 2021**.\n* **General population** vaccine **late Q2 2021**, **early Q3 2021**, in time for fall season of 2021.\n\nHere is the exact video if you want to hear it yourself: [https://youtu.be/pq44IBjcd7c?t=101](https://youtu.be/pq44IBjcd7c?t=101)\n\nNow is the time to load up on calls, stocks, sell puts on beaten down sectors that will explode as soon as something about a vaccine hits the news.\n\nAirlines, cruises, tourism, retail, cinemas, oil, you pick. Easy 100% recoveries. Take a look at CCL for example:\n\n* April 2nd - Corona is bad. CCL is at $7.97.\n* June 8th - We realize corona is not that bad. CCL hits $24.91. That's a 212% jump in two months.\n* Today - Corona is bad again. CCL is at $13.55.\n* A few months from now - Corona is not that bad. CCL hits - you tell me!\n\nDo this same exercise with JWN, AMC, XOM, AAL. Get it?\n\nAnd for the love of God, stop wasting money on puts. It makes me sad to watch how JPM, GS and other market makers are laughing as your options expire worthless.",
        "subreddit": "wallstreetbets",
        "title": "Let's talk recovery - Timeline to load up before it's too late",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jn2qz4/lets_talk_recovery_timeline_to_load_up_before_its/",
        "created": 1604402019.0
    },
    {
        "author": "MillaShows",
        "created_utc": 1604347372,
        "id": "jmuyec",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "This is some small street bets exclusive DD, since I was banned from WSB for not having big enough losses I thought Id share some of my epic analysis on AMC Theaters for earnings.\n\nNow obviously, we all know they will report a massive loss. This is already priced into the stock and analysts are expecting a -4.95 eps this is a greater expected loss than the expected eps from q2. Now looking at most companies in the entertainment sector and most companies in general q2 was the worst quarter. Why do analysts expect q3 to be even worse? I have no idea. I believe they will have a loss of -2.80 to -4.00 eps for q3. Why exactly? Well they big movie release Tenet should've generated at least some income even though it was a considered quite a fail. But even bigger than that, their partnership with Universal in which they collect some of the money earned in digital releases after it is shown in theaters should show some effect into their q3 results. \n\nLastly using google trends, we can see there was an increase in terms like \"movie theater\" , \"movie times\".  Yes these increases are very small and nothing compared to the pre corona search volume but and increase nonetheless meaning they shouldn't be reporting the massive loss that's even worse than q2 that analysts expect. \n\nGoogle trends:  https://imgur.com/ycVScCW \n\nas you can see there was a little increase from the april may range to the q3 range. In q2 the intrest was as low as 6 and now the search intrest is in 15-20 range. \n\nAll in all, this is still nothing but a very risky high reward high loss play. \n\nMy current play is selling the 2 put 11/6 for .20 and buying some lotto call debit spreads. Buying the 2 and selling the 2.5 for 11/6 24 dollar premium cost and a potential $26 gain. I think it crossing 2.5 is more likely than not. Also this is forgetting to mention the retard strength this stock will have on any sign of positive or hopeful news. Anyways GL!",
        "subreddit": "smallstreetbets",
        "title": "AMC earnings after hours. lotto play &amp; and why I think they will slightly beat expectations",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jmuyec/amc_earnings_after_hours_lotto_play_and_why_i/",
        "created": 1604376172.0
    },
    {
        "author": "dogstronauts",
        "created_utc": 1606263554,
        "id": "k0h8d9",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "So I’m starting to build my thesis and ideas to set positions for 2021. It’s looking like 2021 will be a recovery year and a step into normalcy. What are some stocks that are solid companies with upside to get to where they were pre March 2020? Here’s my list so far.\n\nLUV and SAVE - I think 2021 will be a recovery for travel but mostly domestic. Both of these companies have cash on hand and can operate closer to capacity with domestic. I like them to recover quicker than other airlines LUV still has about $19 upside to get back to pre covid levels and SAVE about $40ish\n\nBUD - I think clubs, events, parties will slowly step in the direction along with restaurants. People will consumer more alcohol This is still about $32 pre covid upside. \n\nSIX - Theme parks opening up again. Sea World and Disney already kind of priced in, although I think Disney will continue to grow. Six Flags still have about $30 from pre covid level upside. \n\nJWN - Although Nordstrom popped today, you still have $15 upside for a solid brand. \n\nDDS - Same as Nordstrom. Dillards has a good following and $30 upside. I think Nordstrom has a better online presence though. \n\nAMC - Risky play here as they don’t have a good balance sheet, but $3 and potentially more upside long term. \n\nCNK - From my understanding, Cinemark has a better balance sheet than AMC and still has about $13 upside. I’m thinking of selling AMC and jumping in this. \n\nJust about all Bank Stocks. All banks are still down good but. The ones I like the most are C, JPM, and BAP. \n\nWhat are some I’m missing? Any ideas are greatly appreciated for me to research. Think entertainment, products, events, travel, consumables etc.",
        "subreddit": "stocks",
        "title": "Help me think of recovery stocks for 2021",
        "url": "https://www.reddit.com/r/stocks/comments/k0h8d9/help_me_think_of_recovery_stocks_for_2021/",
        "created": 1606292354.0
    },
    {
        "author": "Jaque8",
        "created_utc": 1605548730,
        "id": "jvb825",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "I know betting agains't the mouse is ill advised but come on, this is ridiculous, Disney is trading at almost ATH, its worth more right now than before the pandemic and most of its parks aren't even open....\n\nAm I missing something?? Seems like it wouldn't take much for this stock to get spooked in the next few weeks given we're at the beginning of a serious 2nd wave.\n\nI also picked up some zoom shares hoping this is a dip. After Thanksgiving I'm betting zoom rallies and covid sensitive stocks like theatres, airlines and entertainment tank again.\n\nPositions:  \nDIS 12/18 $125P  \nDIS 1/15 $125P  \nAMC 11/27 $3.5P (been holding this one for a while, but shoulda sold when it was up 90% lol)\n\n40 shares of ZM\n\nI already bought them but no problem being called a retard, just tell me why lol",
        "subreddit": "wallstreetbets",
        "title": "Disney Puts??",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvb825/disney_puts/",
        "created": 1605577530.0
    },
    {
        "author": "not_a_cup",
        "created_utc": 1606631197,
        "id": "k34lpy",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "I ain't posting a long fucking DD post because this should be clear as fucking day. \n\nFDA currently reviewing PFE vaccine Emergency Use Authorization proposal (EUA), they will meet to have a vote for recommendation for approval on 12/10. Announcement would be expected to follow a few days after, my assumption is 12/12 (following Saturday).\n\n12/14 should be a massive green day across the board, ESPECIALLY for stocks that desperately need on positive Covid vaccine news.\n\n*plays: CCL / AAL / AMC / PFE / GPS / CNK / ULA / what the fuck ever stock had a pump on 11/09*. I am loaded to my TEETS in 1/15 calls on just about all of these. This gives me time for news to be announced. Also I am cheap as fuck so most of my plays are under $0.50/contract. AMC up 80% on 11/09 due to PFE efficacy news alone, is that not fucking clear?\n\nI cannot see any Governor announcing any form of extensive lockdowns until after this FDA meeting, which they're fully aware of, so everyone hoping for bad covid news is about to get 'bears R' fuk'd\".\n\nToo stupid to make your own plays and want some lottos? I'll be more clear:\n\n*1/15 exp: AMC $10C, AAL $20C, PFE $40C, GPS $25C*\n\nNeed news that isn't some retard on the internet?\n\nhttps://www.bloomberg.com/news/articles/2020-11-28/u-k-poised-to-be-first-to-approve-pfizer-biontech-covid-vaccine\n\nhttps://www.cnbc.com/2020/11/24/us-to-test-run-covid-vaccine-distribution-networks-as-it-awaits-fda-clearance-in-just-a-few-weeks.html\n\nhttps://www.wsj.com/articles/palantir-to-help-u-s-track-covid-19-vaccines-11603367276\n\nhttps://thehill.com/policy/transportation/aviation/527835-first-doses-of-pfizer-vaccine-being-flown-to-us-from-belgium",
        "subreddit": "smallstreetbets",
        "title": "Get your vaccine-news stocks now while they are on sale.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/k34lpy/get_your_vaccinenews_stocks_now_while_they_are_on/",
        "created": 1606659997.0
    },
    {
        "author": "augusttrip2019",
        "created_utc": 1605637252,
        "id": "jvy75f",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Open to discussion here - thinking about BABA as my next \"catalyst driven\" play. I was long AMC and TSLA (sold this morning) if you remember from post history. I think about stocks from a catalyst perspective (e.g. with AMC, all you need is one day of good news and it skyrocketed). \n\nFor BABA - some of you may know the stock fell due to Ant Group pausing their IPO. Stock is down almost 20% since October 27th. Personally I think it's oversold and PE ratio is low (30) compared to some comparables (amazon at 90). I'm thinking about picking up some March/April calls for around $300. IV is also relatively low compared to others in the sector. As soon as the Ant IPO is back on we're back to where we were.",
        "subreddit": "wallstreetbets",
        "title": "$BABA - primed for a runup?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jvy75f/baba_primed_for_a_runup/",
        "created": 1605666052.0
    },
    {
        "author": "PenerPicker",
        "created_utc": 1605217196,
        "id": "jt3vn2",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I know that AMC Theaters is extremely risky right now, and there's a lot of things that need to go right in order for them to avoid bankruptcy, but if they're able to weather the storm, wouldn't the theater industry be in a much better place come 2021? \n\nI guess my logic is that, all of the movies that were delayed in 2020 now are going to release in 2021, on top of all the movies originally slated to release in 2021. So the amount of tent pole movies have now doubled for them next year. \n\nTo me, it seems like a unique advantage that only the theater industry has when it comes to these recovery stocks. Someone that has to reschedule a vacation in 2020 won't then book two vacations in 2021. But people who want to see Black Widow, will see it 2021 as well as another movie like Suicide Squad. \n\nIdk, I could be looking into things too much. And they pretty much need Wonder Woman 1984 to keep its Christmas release date, but just something I thought was interesting and unique to theaters. AMC stock ran up to about $7 when Tenet released, so it seems like the idea of a bunch of huge block busters coming out in 2021 would drive the stock up.",
        "subreddit": "stocks",
        "title": "AMC Entertainment Stock 2021",
        "url": "https://www.reddit.com/r/stocks/comments/jt3vn2/amc_entertainment_stock_2021/",
        "created": 1605245996.0
    },
    {
        "author": "panthers-fan1",
        "created_utc": 1604934794,
        "id": "jqzcax",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I wanna know. Which one of you autists doubted my amc calls that are up 133% right now. That doubter made me doubt myself and then I only put a pussy amount of money into the calls. May have missed the bandwagon now",
        "subreddit": "wallstreetbets",
        "title": "Who the fuck made fun of my AMC calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jqzcax/who_the_fuck_made_fun_of_my_amc_calls/",
        "created": 1604963594.0
    },
    {
        "author": "OogdayAyday",
        "created_utc": 1605782442,
        "id": "jx0ip1",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "For the 1 or 2 humans left who aren't trading NIO, PLTR, and soon CIIC, this is something different at least. Hope you enjoy it.\n\n# TL;DR and Positions:\n\n**This is a reasonably short-term bet that WYNN, which rose over 25% on vaccine news, is overextended and will pull back.**\n\n* Dec 18 ’20 $75p and 85p\n* Jan 15 ’21 $80p and $90p\n\nhttps://preview.redd.it/vt2w0cvda6061.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=f13f6b240e8e72e55cce658080a23f21552763c9\n\n# Thesis, for anyone interested:\n\nThis is partially a play on vaccine exuberance (targeting cyclical/reopening names), and partially a play on Wynn specifically\n\n***Vaccine Exuberance***\n\n* As everyone knows, Pfizer and Moderna have recently reported stellar efficacy data on their COVID-19 vaccines. Last week’s Pfizer vaccine pump, in particular, sent cyclical names (i.e. cruise lines, airlines, casinos, AMC, etc.) soaring.\n* IMO, these names went too far ahead of themselves. It’s true that the strong data is a triumph for science and signals that there’s a light at the end of the COVID-19 tunnel. However, once the euphoria dissipates, we have to confront a basic truth-: the vaccine isn’t going to be widely available until sometime in 2Q 2021, possibly later.\n* For context, PFE and MRNA will apply for Emergency Use Authorization (EUA), with an FDA decision expected sometime in December. But even if the FDA issues EUA, the limited doses of vaccines that are currently available will only be provided to very select populations, e.g. high-risk populations. Full approval (not EUA) for the vaccines are expected in 1Q 2021, meaning most people will not be getting vaxxed until next year.\n* This means that in the short term, nothing about the cyclical names has fundamentally changed. Their businesses will continue to struggle, especially with the looming threat of additional stay-at-home orders. Further, those who have watched the market this year know that every subsequent vaccine news generally provides diminishing pumps (unless it's something new altogether, like the Pfizer/Moderna efficacy data). **I believe that the recent pump in the cyclicals was built on euphoria that will fade in the coming weeks.**\n\n***Wynn***\n\n* Disclaimer: if you think the thesis above makes sense, **you might also consider playing names like CCL and AMC**. I personally chose WYNN for a couple of reasons-:\n* The stock has been hovering in the $70-75 range for a while (since April 8, it has closed below $70 only thrice). I consider the recent runup to $100+ way too much given that no material news was released by the company specifically.\n* Nevada is having a hard time with covid right now. On Nov 10 Governor Sisolak advised citizens to stay at home for 2 weeks, giving them the [ultimatum](https://www.tahoedailytribune.com/news/sisolak-gives-nevada-2-weeks-to-get-virus-under-control/) that if things don’t get better, “I will be forced to take action in 14 days,” he said, although he mentioned that “I don’t want to take enforcement. I want to lift restrictions.”\n* Yet the [usual facts abound:](https://www.nytimes.com/interactive/2020/us/nevada-coronavirus-cases.html) cases are at an all time high and continue to grow, while hospitalizations are rising as well. I expect that this trend continues post Thanksgiving.\n* Clearly shutdowns and business restrictions are unpopular, but the [latest news](https://www.reviewjournal.com/news/politics-and-government/nevada/sisolak-restrictions-to-slow-spread-of-covid-19-coming-very-soon-2186014/) is that Sisolak might take some sort of action soon. **Any talk (or action, of course) of shutting casinos down may send Wynn spiraling back down.**\n* (Sidenote: Puts on LVS, CZR, MGM seem viable too, but Wynn has run up the most)\n\n***Several Counterarguments/Things That Can Derail This Trade***\n\n* It is unclear that casinos will close down again. From the [same article](https://www.reviewjournal.com/news/politics-and-government/nevada/sisolak-restrictions-to-slow-spread-of-covid-19-coming-very-soon-2186014/): “in responding to other questions about potentially keeping casinos open, the governor said he doesn’t want to “shut down all of the economy if we can avoid it.”\n* In fact, Sisolak has [encouraged tourists to continue coming to Nevada](https://news3lv.com/news/local/tourists-welcome-in-nevada-locals-asked-to-stay-home-for-two-weeks). There is pressure to keep businesses open, so he may not bend the knee for shutdowns.\n* Additional good vaccine news (particularly an EUA approval) might send all the cyclical names rocketing up again, and Wynn would be no exception.\n* J Pow turns on the money printer and massacres all puts.\n\n***Positions***\n\n* I’m thinking that a stream of bad news will overshadow the good news in the next few weeks. That said, December puts are a little risky because the timing will probably coincide with further good vaccine news, so slightly smaller positions here. The bulk of the position is in Jan puts as you can tell.\n* For strikes, I just chose a few that make sense to me, along with a speculative $75p. I reinforce once again, with some exceptions, Wynn does not stay below $70 for long, so if the stock does drop bigly, I will be cashing out before it teases low $70's.\n\nLet me know what y'all think",
        "subreddit": "wallstreetbets",
        "title": "$12k in Wynn Puts (Dec/Jan Expiry)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jx0ip1/12k_in_wynn_puts_decjan_expiry/",
        "created": 1605811242.0
    },
    {
        "author": "bungus_45",
        "created_utc": 1604397848,
        "id": "jn7r52",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "TDLR; LONG AMC \n\nOkay so let me tell you I work at some theaters in Cali right now (won’t say where and who for anonymity reasons) but we are currently do 1/3rd of our ticket sales AND PEOPLE GENUINELY LIKE GOING TO THE THEATERS. Most people I ask didn’t even know we were open and just like going there for some reason. And not to mention the concessions just absolutely rip you off on popcorn and drinks.  A lot of people who come in tho buy drinks and popcorn and the margins on those are Insane. \n\nAlso new movies comming out after COVID will drive ticket sales through the roof!!!\n\nNEW MOVIES COMMING OUT!!!\nBAT MAN \nINDIANA JONES\nJAMES BOND \nSTAR WARS",
        "subreddit": "wallstreetbets",
        "title": "I work at the theaters and how $AMC could be saved!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jn7r52/i_work_at_the_theaters_and_how_amc_could_be_saved/",
        "created": 1604426648.0
    },
    {
        "author": "QuasiPinoy",
        "created_utc": 1605528743,
        "id": "jv5r75",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "What the fuck. In a matter of minutes after Moderna results announced.",
        "subreddit": "wallstreetbets",
        "title": "AMC pre-market soaring through the roof",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jv5r75/amc_premarket_soaring_through_the_roof/",
        "created": 1605557543.0
    },
    {
        "author": "Bolkonsky999",
        "created_utc": 1604932769,
        "id": "jqyqei",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Look at the peak of June 8th, that's what this rally is gonna look like. So check out these stocks with upside potential:\n\n**Airlines/INdustrials**\n\nBA, RTX, NOC, HII, AAL, SAVE,SPR, DFEN, MAXR\n\n**Oil**\n\nFANG, PSX, XOM, GUSH, MPC\n\n**REIT**\n\nIVR, MITT, TWO\n\n**Others**\n\nAMC, COTY, EHTH,CSCO,JWN\n\nEnjoy the rain, lads.\n\nFeel free to add more beaten-down stocks with huge upside potential in the comments. Let's get rich!",
        "subreddit": "wallstreetbets",
        "title": "This is the most important DD right now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jqyqei/this_is_the_most_important_dd_right_now/",
        "created": 1604961569.0
    },
    {
        "author": "solidmussel",
        "created_utc": 1606081597,
        "id": "jz4a6r",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "A few companies I'm invested in (RDFN and NCLH) have recently done stock offerings and the share price drops immediately after.  It means that if I used to own 100 shares out of 1 million for example, I now only own 100 shares out of 1.1 million.  In other words, my stake in the company has been reduced wtihout my approval.\n\nLot's of other companies have been raising money through offerings lately.  TSLA, DKNG, AMC, CCL, PLUG, just to name a few.  \n\nSo my question is are there any restrictions on how much and how often a company can do this?  Otherwise it seems like a company could really take advantage of the public by constantly diluting their ownership.",
        "subreddit": "investing",
        "title": "Are there any rules behind stock offerings? It seems like a company could really take advantage of public investors by constantly diluting their ownership",
        "url": "https://www.reddit.com/r/investing/comments/jz4a6r/are_there_any_rules_behind_stock_offerings_it/",
        "created": 1606110397.0
    },
    {
        "author": "AlexHalo96",
        "created_utc": 1604253783,
        "id": "jm6rf3",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "All in on AMC 3.5 11/6 puts? New to options trading. Any advice?",
        "url": "https://i.redd.it/bwh8tnom4ow51.jpg",
        "created": 1604282583.0
    },
    {
        "author": "panthers-fan1",
        "created_utc": 1604430647,
        "id": "jngn54",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Yesterday I saw some retard in here talking about amc June $3C @.75 options and I think I’m honestly In. Fuck it I’ll liquidate my portfolio and go balls deep on this but I want to see some agreement from the rest of you autists.",
        "subreddit": "wallstreetbets",
        "title": "Let’s hertz the fuck out of amc tards",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jngn54/lets_hertz_the_fuck_out_of_amc_tards/",
        "created": 1604459447.0
    },
    {
        "author": "duncansomedonuts",
        "created_utc": 1605060654,
        "id": "jrz5gi",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "When your friends tell you not to go all in on one stonk but you do it any way. AMC gains yesterday.",
        "url": "https://i.redd.it/ex64fx6vriy51.jpg",
        "created": 1605089454.0
    },
    {
        "author": "alex824",
        "created_utc": 1606240422,
        "id": "k09yki",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "[amc retards](https://imgur.com/gallery/MsgZmLJ)\n\nOk retards, it’s me again. So I guess you miss my last post? I am a good person so here is the link. \n\n\nYou know in life there is thing thats isn’t logic but in the end logic always win. So as you can see in the little picture, this is the most no sense shit the market have ever seen. Also, as you can see in your robinhoodautistapp these two stocks have the same YTD performance. This my friend, is insane. We have a bankrupt company VS a company that continue to make tendies even with low attendees and will survive easily the Chinese virus.\n\nThe problems is MM know it, it’s just a matter of time before it let CNK shoot up in the universe. So I repeat CNK is FREE TENDIES, the problem is robinhood user THINK THAT AMC IS THE SAME SHIT AS CNK. Please my friend transfer all your cash, shares, call, whatever you have in AMC to CNK. Thanks in advance.",
        "subreddit": "wallstreetbets",
        "title": "AMC retards CNK FREE TENDIES",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k09yki/amc_retards_cnk_free_tendies/",
        "created": 1606269222.0
    },
    {
        "author": "CANT_RUN_DICK_2_BIG",
        "created_utc": 1605109293,
        "id": "jsaclh",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "The average low for the past few weeks has been 2.45 i think excluding that jump they had reopening. Should i expect a new low?",
        "subreddit": "smallstreetbets",
        "title": "Question. I see that amc is adding 20mil more shares. Will that dilute the price?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jsaclh/question_i_see_that_amc_is_adding_20mil_more/",
        "created": 1605138093.0
    },
    {
        "author": "JanixWright",
        "created_utc": 1604435253,
        "id": "jni4bl",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/gca5plei23x51.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=d4b696d33fe1f322d31dac2c957517936a8a8109\n\nHello WSBros,\n\nAMC is about to shit the bed like HTZ before it. Last night was the earnings call, and it was nothing but bad news. Between the increased costs, low revenues, and dependency on the idea that things will change for the better, it has no chance of recovering any time soon. The prospect of another US shutdown, as well as the current EU shutdown are going to completely strangle AMC to death.\n\nIf you are holding AMC and looking to save any tendies, you should get out now while the stock is artificially inflated and before the likely big sell off later this week. Don't get caught with your pants down on this one.\n\nSincerely,\n\nThe bigest, gayest bear",
        "subreddit": "wallstreetbets",
        "title": "SELL AMC WHILE YOU CAN!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jni4bl/sell_amc_while_you_can/",
        "created": 1604464053.0
    },
    {
        "author": "11PercentBattery",
        "created_utc": 1604964712,
        "id": "jr96qs",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Posted this under an edit but putting here for easier visibility. Not sure if anyone will tail but if so good luck and let me know.\n\nI grabbed a PFE 40c for 3/19/21 today, I'm selling it tomorrow for a loss of 75 dollars(🤞🤞🤞), along with CCL 16.5c 12/24 +55, AMC 1.5c +20, APHA 4c 1/15/21 -30, AAL 14c 2/19/21 +5, PLAY 30c 12/18 -30, and FUV 7.5c 11/20 -2.\n\nTaking this cash, plus other cash fresh from Powells printer, plus 1k in margin (interest free courtesy of robinhood, thanks bros.) to go all in on \n\nNIO 40c 12/4 ×2\n\n PLTR 17c 11/27\n\nMay everyone see green and their gains reach +80%. That is all.",
        "subreddit": "options",
        "title": "Moves for tomorrow",
        "url": "https://www.reddit.com/r/options/comments/jr96qs/moves_for_tomorrow/",
        "created": 1604993512.0
    },
    {
        "author": "AcroyearOfSPartak",
        "created_utc": 1606153899,
        "id": "jzmjke",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I suppose based on vaccine anticipations and the news that Wonderwoman 1984 will not be HBO Max exclusive, but also released theatrically. AMC is also surging today, no doubt for the same reasons. Will either maintain or will it just be another temporary bounce on their bumpy road?\n\nThe fact that they are sharing a release with HBO Max and that audiences may not be all that interested in the film itself, however well its predecessor failed, all seem like strong caveats. On the other hand, there is certainly going to be a strong segment of hardcore fans that will no doubt watch the film however they can and also a segment of people who have probably been chomping at the bits to get back to theaters. Whether or not these groups crossover sufficiently is one of the big questions, in my opinion. And while Wonderwoman was a hit, it was no Avengers: Infinity War, i.e., a mega-event which united and galvanized franchise fans.\n\nI would have more confidence if I saw stronger marketing for the film and of course, if hope wasn't resting on a single movie. What gives me hope is the fact that people take dates to movies and Wonderwoman is, in many ways, a perfect \"compromise movie\" for many couples; it features action and superheroes, which would attract many men, and romance and themes of female empowerment which could bring in women (to speak in generalities).",
        "subreddit": "investing",
        "title": "IMAX is surging, will it maintain?",
        "url": "https://www.reddit.com/r/investing/comments/jzmjke/imax_is_surging_will_it_maintain/",
        "created": 1606182699.0
    },
    {
        "author": "augusttrip2019",
        "created_utc": 1604932238,
        "id": "jqykzf",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/0dluki1068y51.png?width=1338&amp;format=png&amp;auto=webp&amp;s=7c2d71277b429f6b304bfa7e702b2f1f12a0a7c7",
        "subreddit": "wallstreetbets",
        "title": "AMC Gang RISE UP!! Up 76%!! MOVIE THEATERS ARE BACK BABY!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jqykzf/amc_gang_rise_up_up_76_movie_theaters_are_back/",
        "created": 1604961038.0
    },
    {
        "author": "its_Tow",
        "created_utc": 1604938940,
        "id": "jr0mwe",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "tl;dr: buy shares of CNK!  \n\n&amp;#x200B;\n\nListen you fucks... I'm a little salty that I spent a ton of time researching and typing a full-up DD for CNK last Thursday and Friday.  I got lazy and left early friday, figuring I'd finish today... Now it's irrelevant.  Even you, yeah you, with the smooth brain, can see that CNK is up bigly today.  **But you have not missed the boat yet!**\n\nI dare say the words short squeeze, but hear me out.  I know everyone is sick of hearing it after the GME thing still hasn't panned out, but CNK is 30% shorted, and most of them have gotten in since the BK news from AMC.  **CNK IS NOT AMC**.  Thats I'll I need to say about that.  Back to the numbers:\n\nShort interest has been increasing since the end of April, when there was roughly 11m shorted.  We've now increased to 30M shares short, as of last month.  Using data from marketbea, the average share price shorted at from Apr until now is 12.40--that's completely unweighted for number of shares shorted, just a pure average for a stake in the ground.  More importantly, from 15 September to 15 October, shares shorted went from 23-29 M, at a weighted average of $8.87 per share.  [https://www.marketbeat.com/stocks/NYSE/CNK/short-interest/](https://www.marketbeat.com/stocks/NYSE/CNK/short-interest/)\n\nCool.  Now lets look at the shareholders.  Institutional investors own 85% of the float, according to CNN money.  **The top 10 institutional owners** and fund managers own 67% of the company (79M shares), or --get this-- **89.3% of the float!** \n\nWith 30 M shares (33% of the float) shorted as of last count, this has the potential to really explode.  \n\nPos: long 2k shares.  Had planned on jumping in on some sweet Mar '21 calls, but missed the boat.  Buy shares, ride it up to 20+ and then do what you wish.  CNK will be back to 30+ by EOY 21 as long as the divvy is reinstated.",
        "subreddit": "wallstreetbets",
        "title": "BUY CNK! You haven't missed the boat. (Squeeze inbound!)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jr0mwe/buy_cnk_you_havent_missed_the_boat_squeeze_inbound/",
        "created": 1604967740.0
    },
    {
        "author": "No_Fap_Till_Midnight",
        "created_utc": 1604964643,
        "id": "jr961b",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC Jan15'21 5 Call",
        "url": "https://i.redd.it/b4l4300cuay51.png",
        "created": 1604993443.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1605517395,
        "id": "jv3q5p",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "With More Lockdowns Coming AMC is Going to Continue Bleeding",
        "url": "https://www.reddit.com/gallery/jv3q5p",
        "created": 1605546195.0
    },
    {
        "author": "ConsiderationOk794",
        "created_utc": 1605195226,
        "id": "jswmz6",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I thought the first one was free 🥺 (nio and amc calls)",
        "url": "https://i.redd.it/rikyasi0wty51.jpg",
        "created": 1605224026.0
    },
    {
        "author": "TechHedz",
        "created_utc": 1606538120,
        "id": "k2h99b",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "What do you guys think? I thought it was going to tank this week but it held up pretty well. Someone dropped a 100k order when it was crashing in pre-market that it never touched. Felt like manipulation to me but it caused it to rebound. Lost about 8k on puts I had. I feel as if it's riding the Cineplex funding and Trump vaccine news high. People on Stocktwits think it's a good buy. Most people are touting Trump and Vaccine news there. All which I think is the same BS when he said we would have a vaccine in October back in September and AMC pumped then as well. \n\nWhat do you guys think. I got some 4.50 puts for this week but debating on selling them.",
        "subreddit": "wallstreetbets",
        "title": "AMC, up or down next week?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k2h99b/amc_up_or_down_next_week/",
        "created": 1606566920.0
    },
    {
        "author": "KingN0",
        "created_utc": 1606320398,
        "id": "k0uvpr",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Think I’ll have any luck in the finance world?\n\nThroughout the pandemic, I have made really good trades, and also some very poor ones. Most of my losses have been due to emotional trading rather than being wrong. Currently down about 6.8K for the entire year. My dad started investing in webull when the market was literally at bottom and scooped up BBBY, AMC, MRNA, NVAX and a bunch of other tickers that went ballistic. In total my old man went from about 4K to 10K from March to now. Along the way I advised him to buy JWN at 12.55 in September, PLAY at 12.50 in July, and a penny stock called DFFN at .60 in may which I begged him to sell at 1.50 and thankfully he listened, now it’s down to .67. In total, the plays that I have given him throughout the year netted him at least $1,400. Told him to sell half of JWN before earnings in case they shat the bed, but they pulled the rabbit out the hat as y’all saw yesterday and this morning. The latest thing I told him to buy was $720 worth of a certain SPAC that is banned on this forum now at 11.20 with the funds he gained from selling half of his JWN at 24.49. I know why my dad is making money and I’m not, because he’s not looking at the plays I give him every 5 seconds like I do. \n\nDo you guys think I would be a shit investment banker, or perhaps produce similar results like I have with my dad’s portfolio. Forced myself to give up trading for the time being to guard myself from further losses. Gave him full access to my trading account so he can withdraw for me. Still got 1.5K liquid waiting to be settled to cash out and more paychecks coming in. So I’ll be okay. But damn losing sucks. Have to keep telling myself that I literally can’t win bc of my emotional trading patterns.",
        "subreddit": "wallstreetbets",
        "title": "Think I’ll have any luck in the finance world?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k0uvpr/think_ill_have_any_luck_in_the_finance_world/",
        "created": 1606349198.0
    },
    {
        "author": "KineadV",
        "created_utc": 1606102048,
        "id": "jz9x83",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "AMC ---- to the fucking moon,\n\n&amp;#x200B;\n\nHere's the reasoning, \n\nOne - American - These jingoistic gravy SEAL boomers will buy anything with America in the name\n\nTwo  - Movies - Everyone watches movies, who doesn't watch movies? Movies SELL! \n\nThree - Classics - Classics brings to mind shit like Corvettes, again, boomers buy this shit up.\n\n&amp;#x200B;\n\nHuh? ... What? That isn't even the fucking companies name? Suck my autistic cock and bring me some tendies! AMC $7C 12/5",
        "subreddit": "wallstreetbets",
        "title": "🐱‍🏍🐱‍🏍🐱‍🏍True DD inside, BULL Dicks only 🐱‍🏍🐱‍🏍🐱‍🏍",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jz9x83/true_dd_inside_bull_dicks_only/",
        "created": 1606130848.0
    },
    {
        "author": "kkB1airs",
        "created_utc": 1606757643,
        "id": "k40k8z",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Basically title. I’m confident movie theatres will make a comeback. Both our culture/Hollywood isn’t quite ready to make the transition to “straight to streaming” with regards to all blockbuster films. It’s a convenient option now, and will provide a reference point for the future, but we’re not there. \n\nSo do folks here like a recovery cinema play? \n\nLooks to me like CNK could be the one. The risk vs. reward is better there? AMC appears to be crumbling, but that’s most speculation from the last report, which honestly I’ve only glanced at. \n\nJust curious. Thanks",
        "subreddit": "stocks",
        "title": "Thoughts on Cinema recovery play?",
        "url": "https://www.reddit.com/r/stocks/comments/k40k8z/thoughts_on_cinema_recovery_play/",
        "created": 1606786443.0
    },
    {
        "author": "Three-OneLmao",
        "created_utc": 1606229142,
        "id": "k069tc",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC TAKE ME TO THE MOON 🚀🌙 (+14%)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k069tc/amc_take_me_to_the_moon_14/",
        "created": 1606257942.0
    },
    {
        "author": "a941guy",
        "created_utc": 1606156190,
        "id": "jznbyk",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "How much fuel is left in the tank for AMC with this news? Think it still has legs to grow short term?",
        "url": "https://i.redd.it/ecjg5bkg91161.jpg",
        "created": 1606184990.0
    },
    {
        "author": "JTurner82",
        "created_utc": 1606716180,
        "id": "k3q38b",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Okay, for all the talk of AMC going bankrupt... Each week that I have seen positive vaccine news their stock has gotten bumps.  Three weeks in a row.  Now there might be another reason they go up:  the surprise success of Croods 2.  That film did better than expected.  It brought some jolt to struggling theaters.  Makes me wonder if talks of their demise are premature or not.",
        "subreddit": "stocks",
        "title": "Observations of AMC",
        "url": "https://www.reddit.com/r/stocks/comments/k3q38b/observations_of_amc/",
        "created": 1606744980.0
    },
    {
        "author": "thelazyprepper",
        "created_utc": 1606239109,
        "id": "k09im3",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "no one is going to theaters.  they still paying rent on the empty theaters?",
        "subreddit": "wallstreetbets",
        "title": "i got no balls buying SPY puts. too rich for my blood. I'm thinking buying PUTS for AMC - how are they making any money???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k09im3/i_got_no_balls_buying_spy_puts_too_rich_for_my/",
        "created": 1606267909.0
    },
    {
        "author": "ProvidenceXz",
        "created_utc": 1604929723,
        "id": "jqxwam",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "As you've heard the news about vaccines. People are looking to go out again. AMC is up 70% premarket. What are your thoughts?",
        "subreddit": "pennystocks",
        "title": "AMC worth hopping back in?",
        "url": "https://www.reddit.com/r/pennystocks/comments/jqxwam/amc_worth_hopping_back_in/",
        "created": 1604958523.0
    },
    {
        "author": "eyo_maya",
        "created_utc": 1606670717,
        "id": "k3d965",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Hello, college student here. Im am currently taking and accounting class and doing some research on cinemark and AMC thearters. Both cinemark and AMC have a negative eps. Does this mean they will not be able to pay dividend to their shareholders?",
        "subreddit": "stocks",
        "title": "Can a company have a negative EPS ans still pay a Dividend?",
        "url": "https://www.reddit.com/r/stocks/comments/k3d965/can_a_company_have_a_negative_eps_ans_still_pay_a/",
        "created": 1606699517.0
    },
    {
        "author": "PrismasticxO",
        "created_utc": 1604517221,
        "id": "jo2vz4",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I wanna try options trading should I yolo some amc puts? Pls respond",
        "subreddit": "wallstreetbets",
        "title": "AMC Puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jo2vz4/amc_puts/",
        "created": 1604546021.0
    },
    {
        "author": "sarftmfb",
        "created_utc": 1606659799,
        "id": "k3a5un",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Thoughts on AMC leaps for 1/2022? Is this a smart bet?  I mean if movie theaters don’t come back by 2022, wtf are we even doing? I’m not watching new full feature blockbuster movies from my living room for the rest of my life.",
        "subreddit": "wallstreetbets",
        "title": "AMC Leaps?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k3a5un/amc_leaps/",
        "created": 1606688599.0
    },
    {
        "author": "jloy88",
        "created_utc": 1606304913,
        "id": "k0qsbz",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Noticed a big drop in AMC call option price yesterday and YOLO'd everything I could on 80 contracts. +165% daily gain to go with a +500% KSS",
        "url": "https://www.reddit.com/gallery/k0qsbz",
        "created": 1606333713.0
    },
    {
        "author": "SoupSeeker",
        "created_utc": 1606280373,
        "id": "k0ll27",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Think about it",
        "subreddit": "wallstreetbets",
        "title": "America won't let CNK / AMC die",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k0ll27/america_wont_let_cnk_amc_die/",
        "created": 1606309173.0
    },
    {
        "author": "bsparks027",
        "created_utc": 1604927953,
        "id": "jqxg68",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I bought a few $4 AMC calls for shits and gigs a few weeks ago and just expected all that money to vanish into thin air. This shit really might open above strike price. Thanks Miracle Vaccine. \n\nOh and my $40 Pfizer calls about to be printing some of that green stuff",
        "subreddit": "wallstreetbets",
        "title": "AMC Call",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jqxg68/amc_call/",
        "created": 1604956753.0
    },
    {
        "author": "ROSS_P88",
        "created_utc": 1606172890,
        "id": "jzsuzn",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I know that this is probably kind of a noob question, but does anyone have any experience of holding bonds in a company that has a high risk of going into Chapter 11? Right now I hold bonds in AMC and Transocean Offshore, both look likely that they are not going to hang on through the pandemic. For what it matters my Transocean is senior unsecured and AMC is subordinated. Should I unload these prior to any potential bankruptcy or hold in the hopes that the bankruptcy court will give a fair outcome?",
        "subreddit": "investing",
        "title": "Bonds and Chapter 11",
        "url": "https://www.reddit.com/r/investing/comments/jzsuzn/bonds_and_chapter_11/",
        "created": 1606201690.0
    },
    {
        "author": "O_Wagons",
        "created_utc": 1605010312,
        "id": "jrjwd7",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "What will AMC $3c expiry 11/13 be worth at open?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jrjwd7/what_will_amc_3c_expiry_1113_be_worth_at_open/",
        "created": 1605039112.0
    },
    {
        "author": "juaggo_",
        "created_utc": 1606157376,
        "id": "jznqit",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "My portfolio will consist about 10-15% of Realty Income Corporation. It should be closer to that 10% mark, since I’m young and able to take risks. In order to invest in this REIT company I’ve done research. Here’s what I’ve found out so far. Youc can look these things up very easily, but decided to put some of them here.\n\n- It’s real estate portfolio is well exposed to many industries. Mostly in convenience stores and drug stores. They have about 600 tenants\n \n- They are also exposed to the UK, which is nice. It indicates that they are activeky trying to grow their area of influence outside the US.\n\n- Their net debt is about 27% of their enterprise value, which I think is fine. They aren’t too badly on debt.\n\n- They have a VERY solid dividend. They are one of the S&amp;P 500’s dividend aristocrats. They were able to keep a steady dividend and annual growth during 2007-2009, which were of course very hard years in the stock market. They pay a MONTHLY dividend, which I think many of us know already.\n\n- Their theaters are doing a bit badly, since all of their tenants aren’t paying their rent. I think this happened a few months ago. 51% of their theaters are closed. If AMC goes bankrupt, this will take a hit under their belt.\n\n- They have a strategy, which works in the long-term. I think yous should be in it for the long term.\n\nIn short, this is a long-term, conservative and well diversed REIT company with good dividends.\n\nPlease add more to this list. Thanks in advance.",
        "subreddit": "stocks",
        "title": "About Realty Income Corporation ($O) and what it does.",
        "url": "https://www.reddit.com/r/stocks/comments/jznqit/about_realty_income_corporation_o_and_what_it_does/",
        "created": 1606186176.0
    },
    {
        "author": "PretendImFamous",
        "created_utc": 1606240115,
        "id": "k09us8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "I put $1,000 into a Webull account last month, doubled it with CNK, AMC, and GME",
        "url": "https://www.reddit.com/gallery/k09us8",
        "created": 1606268915.0
    },
    {
        "author": "TheTrueMarketMaker",
        "created_utc": 1604319536,
        "id": "jmmegg",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**Penny Stock Pre-Market News**\n\n$AMC AMC Entertainment Holdings Inc Files For Shelf Offering Of Up To 20M Shares Of Class A Common Stock\n\n$DBVT DBV  Technologies Announces Filing and Validation of Marketing Authorization  Application for Viaskin™ Peanut by European Medicines Agency\n\n$GNW Genworth and Oceanwide Provide Transaction Update\n\n$GRWG GrowGeneration Signs Asset Purchase Agreement to Acquire Nation's Third-Largest Chain of Hydroponic Garden Centers \n\n$HERTF Heritage Cannabis Receives Inaugural Order from Saskatchewan's  Weed Pool Cannabis Co-operative for Pura Vida and Purefarma Brands \n\n$LCA Golden Nugget Online Gaming Wins \"Operator of the Year\" Four Years In A Row\n\n$MCLDF mCloud to Host Third Quarter 2020 Financial Results Conference Call on November 12, 2020\n\n$MRKR Marker Therapeutics to Host Third Quarter 2020 Operating and Financial Results Conference Call and Webcast on Monday, November 9, 2020\n\n$NEWA Newater Technology, Inc. Announces Rescheduled Date for its Annual Meeting of Stockholders now to be held on December 29, 2020\n\n$OPK OPKO HEALTH, INC.: Frost Gamma Investments Trust (10%+) Buys 600,000 @ Avg Price: $3.45 (Form4)\n\n$ORTX Orchard Therapeutics to Host Virtual R&amp;D Investor Event on Friday, November 13, 2020\n\n$SUP Superior Industries Intl Q3 EPS $0.12 Beats $(0.34) Estimate, Sales $317.00M Beat $313.12M Estimate \n\n$XERS Xeris Pharmaceuticals to Announce Third Quarter 2020 Financial Results and Host Conference Call and Webcast on November 9, 2020\n\n&amp;#x200B;\n\n**Pre-Market Watch List (Long the Pops, Short the Drops)**\n\n$DBVT $GNW $ISIG\n\n&amp;#x200B;\n\n**Opening Watch List (Long the Pops, Short the Drops)**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n***Most Content Created By (Slightly Edited By Me)***\n\nhttps://preview.redd.it/5usaq7i4ktw51.jpg?width=483&amp;format=pjpg&amp;auto=webp&amp;s=a572ffcfb7f527a5512a7c55ac605dd3050091f5",
        "subreddit": "pennystocks",
        "title": "Penny Stock Pre-Market News (Just The Headlines), Pre-Market Watch List and Opening Watch List for 02 November 2020 (Will Update to 9:20 a.m EST)",
        "url": "https://www.reddit.com/r/pennystocks/comments/jmmegg/penny_stock_premarket_news_just_the_headlines/",
        "created": 1604348336.0
    },
    {
        "author": "JJtheBigThot",
        "created_utc": 1605022216,
        "id": "jrmy6e",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "title says it, bought calls yesterday before market close. am i boned",
        "subreddit": "wallstreetbets",
        "title": "will amc bounce back to around 4 or is my call fucked",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jrmy6e/will_amc_bounce_back_to_around_4_or_is_my_call/",
        "created": 1605051016.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1605558386,
        "id": "jvee56",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "RobinHood",
        "title": "Purchased AMC when the market opened today. Why is my average cost per share $3.36 instead of $3.13?",
        "url": "https://www.reddit.com/gallery/jvee56",
        "created": 1605587186.0
    },
    {
        "author": "KPalm_The_Wise",
        "created_utc": 1604925636,
        "id": "jqww6m",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Probably going to pull back on open, but will explode later this week. Get ready retards.",
        "subreddit": "wallstreetbets",
        "title": "Wee woo wee woo! AMC up 70% in aftermarket. Seriously regretting not getting calls last week.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jqww6m/wee_woo_wee_woo_amc_up_70_in_aftermarket/",
        "created": 1604954436.0
    },
    {
        "author": "itsgoggles",
        "created_utc": 1604925696,
        "id": "jqwwof",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " ***$YCBD, ACB, TLRY, CGC:***\n\nOver the weekend the general media has announced Joe Biden as the president elect. We have been preparing for this moment for weaks, so now it's time to watch these hot sectors. Cannabis is one of them. Just overnight, TLRY reached a new high almost returning it to pre-covid levels. We saw decriminalization and legalization pass in many states throughout the country, and I only expect this sector to main in the spotlight as we move into next year.\n\nEveryone is jumping on this bandwagon, so make sure you take profits when you can. If you bought TLRY last time it was on my watchlist, you already saw this stock run 100%+.\n\n&amp;#x200B;\n\n[Weed, weed, and weed](https://preview.redd.it/f8vt878cm7y51.png?width=1618&amp;format=png&amp;auto=webp&amp;s=f369765b90c223ae53efd8e75c3d4f77ed724652)\n\n***$AMC, $CNK $IMAX:***\n\nMovie theater companies have all gapped up this morning on positive results news testing Pfizer Covid Vaccines.\n\n\\- Pfizer, BioNTech Covid-19 Vaccine 90% Effective in Interim Analysis of Phase 3 Trial, Companies Say\n\n\\- Phase 3 Trial of Pfizer, BioNTech Covid-19 Vaccine Could Furnish Safety Data During Third Week of November, Pfizer Says\n\n\\- Pfizer, BioNTech on Track to Seek Regulatory Authorization of Covid-19 Vaccine as Early as This Month, Pfizer Says\n\nMovie theaters have been beaten down so low that people are capitalizing on the possibility of being able to go to the movies again. Some of these have gapped up immensely already, but could make for some good momentum plays or scalps throughout the day.\n\n&amp;#x200B;\n\n[Some of these still have large gaps to fill, be prepared for a correction.](https://preview.redd.it/8qn5gkdem7y51.png?width=1609&amp;format=png&amp;auto=webp&amp;s=b1828d7e78ad2ddb2adbcb475a8a2a0cd7ec7fd2)\n\n***$APVO:***\n\nPre-market gapper this morning, going from $22 to a high of $82.84 before selling off to the current price of $46. Will be watching this stock for volume/momentum plays today.\n\nAptevo Therapeutics Inc.  almost tripled to  $68.24  in premarket trading Monday after the company said it saw positive results in its ongoing APVO436 Phase 1 clinical trial.\n\nThe biotechnology company's APVO436 is an anti-CD123 x anti-CD3 targeted investigational bispecific antibody therapy being evaluated for the treatment of acute myeloid leukemia and myelodysplastic syndrome in a Phase 1/1b dose- escalation study evaluating the safety and pharmacokinetic profile. Aptevo said it received preliminary data that indicated complete remission in a second patient, in addition to the one previously announced. In total, there are now two patients with clinical remission in cohort 6.\n\nThe company said the data received also showed one patient exhibiting stable disease status, and six patients where the disease had progressed. A total of nine patients were listed in cohort 6 of the clinical trial.  Aptevo Therapeutics  said the second patient with complete remission showed bone marrow blasts of 33% at screen, then exhibited a rise in blasts to 46% after the first cycle of treatment. Subsequently, the bone marrow blasts dropped to 8% after the second cycle, and to 4% after the fourth cycle of treatment. The patient's platelet count and absolute neutrophil count met complete remission criteria.\n\n&amp;#x200B;\n\n[Not a pennystock, but insane price action this morning.](https://preview.redd.it/injtl7vgm7y51.png?width=1615&amp;format=png&amp;auto=webp&amp;s=03b34672a882d72155857178a4926e7d6468081b)\n\n**Never forget to do your own DD; remember: For all you know, all the stocks that I mention here will dip 90% tomorrow; Do your own DD, I'm not some magic fairy. Trading will never come this easy to you. If all the stocks on here went up, I'd be chilling on my own Island.**   \n*This is a watch list, not a buy list*",
        "subreddit": "pennystocks",
        "title": "November 9th | Templar Trading Daily Watchlist",
        "url": "https://www.reddit.com/r/pennystocks/comments/jqwwof/november_9th_templar_trading_daily_watchlist/",
        "created": 1604954496.0
    },
    {
        "author": "11PercentBattery",
        "created_utc": 1604947774,
        "id": "jr3lgf",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "pfe calls aal calls  play calls ccl calls amc calls. Expiration dates after earnings.",
        "subreddit": "smallstreetbets",
        "title": "11/09/2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jr3lgf/11092020/",
        "created": 1604976574.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1605517202,
        "id": "jv3ovo",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "With more lockdowns imminent AMC is gonna continue hurting",
        "url": "https://i.redd.it/4spygr6fhkz51.jpg",
        "created": 1605546002.0
    },
    {
        "author": "hyperion_king_",
        "created_utc": 1605033658,
        "id": "jrqot6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "3 shares of sony around 89\n2 shares of nintendo around 67\n1 share of microsoft around 211\n1 share of apple around 116\n1 share of intel @ 45\n2 shares of xpeng @ 33\n1 share of nio @ 41\n1 share of wpx energy it was free\n2 shares of acb @10\n1 share of coke at 49\n1 share each of pfe and fixx\n2 shares of amc\n\nAnd I sold 2 shares of my cinenark which I made a 10 dollar profit lol.\n\nWhen we had that big dip November 3rd or 4th I chickened out thinking shit would drop more...it didn't and so I started to chase cause I wanted to get Into the game. I chased acb, sony, microsoft, apple and tesla it was 379 but did not buy even when it dropped today to 400 and that acb and amc i should have never bought.\n\nBesides me  needing to stop floating around so much and ticking to a few stocks and buying more volume any advice you guys can give.",
        "subreddit": "stocks",
        "title": "Advice On Stocks I Currently Own as a Novice",
        "url": "https://www.reddit.com/r/stocks/comments/jrqot6/advice_on_stocks_i_currently_own_as_a_novice/",
        "created": 1605062458.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1605017328,
        "id": "jrljsb",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hey everyone and Welcome I am going to talk about the impact of the announced vaccine on the stock market and what is happening to tech companies as well as the recovery plays [BANNER](https://ibb.co/TYKs2FB)\n\nYesterday there was a lot of movement in the stock market as companies that benefited a lot from the stay and work from home environment saw a huge drop with gaming companies like EA or Take Two interactive tumbling as well as Peloton and Zoom who fell more than 15% while even the biggest companies like Amazon felt the shift being down more than 5% [NEWS](https://ibb.co/72kPtK3) [NEWS](https://ibb.co/GQY3p1t)\n\nMeanwhile any stock that included in person participation like airline and travel stocks saw a huge spike in price, as they finally have some end point of the pandemic in sight with some big gains from companies like AMC, Cinemark, Carnival  [MOVEMENTS](https://ibb.co/HzfLkQM)\n\nWhile Starbucks also made a new all time high as the company will benefit a lot from the reopening as well as improved Us-China relationship. [STARBUCKS](https://ibb.co/j9CW5Z4)\n\nOther companies that saw a big drop yesterday were Bed Bath &amp;Beyond, Chewy, Domino’s &amp; Papa John’s and many more. [NEWS](https://ibb.co/51Rfx9N)\n\nHere are more market movers from yesterday in different sectors  [NEWS](https://ibb.co/WpT1Frx)\n\nWith huge gains being made in the financial sectors with most banks soaring while credit card companies also joined the rally [NEWS](https://ibb.co/nkCD15q) [NEWS](https://ibb.co/0Z2hzv6)\n\nThe announcement made yesterday will also impact the eventual stimulus bill size, as it is likely the bill will be smaller with a more limited time horizon, but this stimulus is still needed as a bridge between now and the time the benefits of the vaccine as lots of businesses still are under a lot of pressure.  [STIMULUS UPDATE](https://ibb.co/mRsgpK1)\n\nWe will also have to wait and see other companies finishing vaccines as the Pfizer one is very hard to deliver from a logistics standpoint it needs to be kept at very low temperatures well below freezing. [LOGISTICS PROBLEM](https://ibb.co/fvVFKyc)\n\nFortunately treatments of the illness are also progressing with Eli Lilly getting emergency use authorization for a new treatment [Eli Lilly NEWS](https://ibb.co/9HwPPsH)\n\nSo yesterday there was a lot of movement in the stocks as more than 70% were advancing with a 96% of new highs vs lows and the volume was up but in this case it was massive with more than 70% percent of companies having above average volume, this lead to a lot of brokers having issues handling the stocks. [CHART](https://ibb.co/x2dTdMc)\n\nThe Dow was the biggest gainer up almost 3% with intraday gains of more than 5% at one point [DOW CHART](https://ibb.co/TTb7kdR) , The Nasdaq had a wild ride being up and down but eventually finishing the day down more than 1,5%[NASDAQ CHART](https://ibb.co/N2KNBCV)  and the S&amp;P making new highs but eventually dropping back finishing the day just over 1% up [SP CHART](https://ibb.co/HdfLtq2)\n\nThe biggest gainers came from the energy and financial sectors yesterday with tech and comms suffering the most while small cap and value plays outperformed the market [SIZE CHART](https://ibb.co/zQ1r1bf) with the volatility index not moving to much as I expect this to remain at this level for the next months until we get some more updates on vaccines, stimulus debates and finally with the next president taking over. [VIX CHART](https://ibb.co/BGfLKLs)\n\nHere is the heat map for yesterday as you can see the market was pretty split with the tech and stay at home names being punished while the recovery plays were up big.  [HEAT MAP](https://ibb.co/MDMbDFp)\n\nWhile pre-market has started and the tech heavy Nasdaq is being punished again while the Dow is barely up. [PRE-MARKET](https://ibb.co/zPLMRt2)\n\nToday Microsoft will launch the new xBox series X and S just before the biggest competitor for the xBox is due to unveil the new PlayStation5, this is a growing part of Microsoft business and i really like they’re products for gaming despite the PS being more popular. [xBox](https://ibb.co/dMd9JcC)\n\nApple is expected to announce the new Macs, this is expected to present a more than 15 billion dollars opportunity for Apple [NEWS](https://ibb.co/kgK5bMK). Also the company will start taking orders at the end of this week in more than 50 countries [NEWS](https://ibb.co/hYTsn4p), I believe this is a great opportunity to buy the stock at a lower price with this drop in tech companies. They are my favorite company to own as they are expanding the company vertically and are releasing great new subscriptions based services while also benefiting from the cycle of moving phones to 5G.\n\nThe watchdogs seem to be going after big tech as Amazon has been hit with a couple of bad news in the last couple of days, as the vaccine coming out will likely slow the growth of the company beyond 2021, another news came today as the European Union will announce antitrust charges against them, i don’t see this as a big problem for the company as the charges are not very solid.[AMAZON NEWS](https://ibb.co/M25SZ6q)  So I still believe in the company and i will wait for the markets to calm down after the recent drop in stay at home plays to add to my position to the company. Likewise google is being investigated in India for potentially squeezing out competitor in payment processing with Google Pay. [GOOGLE NEWS](https://ibb.co/Jv6h4Lh)\n\nToday Disney also announced that they will cut even more into the employed staff, but they will strongly come back late next year, they are one of my favorite companies as i really like the expansion to the streaming business with Disney+ and Hulu. [DISNEY NEWS](https://ibb.co/vd90pJ4)\n\nSo Beyond Meat has been up and down in the last 36hours as the company was down big after McDonalds announced a new plant based product that didn’t include the company [NEWS](https://ibb.co/gJsvQyd) , afterwards the company jumped back up to positive [NEWS](https://ibb.co/DVj49S6) before eventually finishing the day down huge after they announced a huge miss on estimates, as the gross profit margin fell 6% since a year ago [FINANCIALS](https://ibb.co/gzPbxMY), while the EBITDA result was a loss of over 4 million dollars versus a more than 13 million profit expected [BYND EPS](https://ibb.co/tPn21Fp). This was followed but another set of news that they will partner with Pizza Hut to offer a plant-based pizza so a huge roller coaster for Beyond Meat. [PIZZA NEWS](https://ibb.co/WzQ6MbW)\n\nMeanwhile McDonalds beat earnings expectations and outlined a new growth strategy while also improving the taste and delivery of its burgers [MCD NEWS](https://ibb.co/j3hC5x2). They beat the EPS handily and also beat on revenue expectations with a big operating margin as the company did very well with its drive thru business [MCD EPS](https://ibb.co/8rgJJhV)\n\nA couple of other news are that one of my favorite companies in the communications sector, T-Mobile announced the expansion of home internet in more than 100 markets. [T-MOBILE](https://ibb.co/tx575z4)\n\nWhile the FAA is expected to end the 737 MAX grounding next week, which combined with the vaccine news will be a great return for Boeing. [BOEING NEWS](https://ibb.co/pPCWbcB)\n\nSo be aware and stay sharp when trading, despite infections rising in more than 60 countries with the US leading the pack in both cases and death and with new records and the highest moving average since march, I believe this will be a great time to own stocks as the political landscape is the most favorable one, [GLOBAL STATS](https://ibb.co/NTYDShp) [US DAILY STATS](https://ibb.co/0tHtRDf)\n\nWith investors being encouraged after the elections, with a split congress and a democratic president the average returns are the best in the last 100 years. [AVG RETURNS](https://ibb.co/rHSqKV8) [INVESTORS SENTIMENT](https://ibb.co/qd5Rwc7)\n\nThank you everyone for reading! Be sure to leave a comment down below!\n\nHave a great day and see you next time!",
        "subreddit": "stocks",
        "title": "Vaccine News| What’s next for the stock market? |Tech stock or recovery plays? [11-10-2020]",
        "url": "https://www.reddit.com/r/stocks/comments/jrljsb/vaccine_news_whats_next_for_the_stock_market_tech/",
        "created": 1605046128.0
    },
    {
        "author": "No_Fap_Till_Midnight",
        "created_utc": 1604963386,
        "id": "jr8sci",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "AMC Jan15'21 5 Call\n\nhttps://preview.redd.it/0sw7mwflqay51.png?width=1473&amp;format=png&amp;auto=webp&amp;s=ad8bb378eea9bc72919cc1b5f769e69c7651a584",
        "subreddit": "wallstreetbets",
        "title": "I mean.......come on.....still too early",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jr8sci/i_meancome_onstill_too_early/",
        "created": 1604992186.0
    },
    {
        "author": "gonzalezs97",
        "created_utc": 1604796288,
        "id": "jq2527",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Predictions? \n\nI've read they will likely go bankrupt (like Hertz) they are trying to survive so hard... you can now rent a whole theater for ur self for $99, like wtf... those are trully emergency measures. Fot me it sounds like they will not hold 2 more months. Short it? \n\nAny thoughts on this?",
        "subreddit": "stocks",
        "title": "Lets talk about AMC",
        "url": "https://www.reddit.com/r/stocks/comments/jq2527/lets_talk_about_amc/",
        "created": 1604825088.0
    },
    {
        "author": "carolbaskinsfellit",
        "created_utc": 1604348250,
        "id": "jmv80p",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Is there any websites that outlines new IPO’s with summaries of the companies that is easy to evaluate and look at?\nI done well from one once so I think that’s why I’m leaning towards that now. And of course because I caught onto NIO at 26.\nI’m only investing a small amount of savings each month probably into two companies. I’d prefer money in a few places. Is that a good or bad idea?\n\nAlso, since AMC has plummeted.. is there any point in putting a small amount on it hoping it bounces back?\nWhat’s the view on JMIA. I’m sitting on them for the next 6 months at least.",
        "subreddit": "investing",
        "title": "Apps or Websites with upcoming IPO’s, and views on some shares",
        "url": "https://www.reddit.com/r/investing/comments/jmv80p/apps_or_websites_with_upcoming_ipos_and_views_on/",
        "created": 1604377050.0
    },
    {
        "author": "UnusualW_Mod",
        "created_utc": 1604288765,
        "id": "jmggjq",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Often, pennystocks are hard to predict, but are largely news drive. They, too, however follow the general trends of certainty.\n\nCurrently it seems whales are hedged on volatility, and have numerous OTM shorts for an increased potential downturn over the November.\n\nMany whales have made huge bets for 2021 on the bullish side. [Here is an image of numerous $SPY whales](ttps://twitter.com/unusual_whales/status/1322983168861827072).\n\nWhat about pennystocks? The same has been seen, [with both bearish and bullish bids being asked for numerous plays](https://unusualwhales.com/pennies). One example is [GNUS, which is bullish on the ask side](https://unusualwhales.com/alerts/6f944b03-dfbc-45e5-ada5-ec6f91b2a0d0), but has also seen hedges on the bear-side.\n\nAMC is interesting given earnings this week. https://gyazo.com/61e5a18a04842ff9b007e1350831608b. Personally we might see a squeeze on the theatres but Monday will tell. HL also represented an interesting bid given the election, highlighted here: https://gyazo.com/4faad147f66ae452738f6e30b1f59381\n\nSo what do you do? Get gains when you can consistently in these volatile times, and play that volatility. Contracts are more expensive, so feel empowered to straddle, and expect big movements Monday-Friday this week.\n\nExpect coronapennies to perform horrible if Trump wins, do well if Biden wins, etc.",
        "subreddit": "pennystocks",
        "title": "Pennystocks and the elections",
        "url": "https://www.reddit.com/r/pennystocks/comments/jmggjq/pennystocks_and_the_elections/",
        "created": 1604317565.0
    },
    {
        "author": "UnusualW_Mod",
        "created_utc": 1604289450,
        "id": "jmgm9t",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Often, pennystocks are hard to predict, but are largely news drive. They, too, however follow the general trends of certainty.\n\nCurrently it seems whales are hedged on volatility, and have numerous OTM shorts for an increased potential downturn over the November.\n\nMany whales have made huge bets for 2021 on the bullish side. [Here is an image of numerous $SPY whales](ttps://twitter.com/unusual_whales/status/1322983168861827072).\n\nWhat about pennystocks? The same has been seen, [with both bearish and bullish bids being asked for numerous plays](https://unusualwhales.com/pennies). One example is [GNUS, which is bullish on the ask side](https://unusualwhales.com/alerts/6f944b03-dfbc-45e5-ada5-ec6f91b2a0d0), but has also seen hedges on the bear-side.\n\nAMC is interesting given earnings [this week](https://gyazo.com/61e5a18a04842ff9b007e1350831608b). Personally we might see a squeeze on the theatres but Monday will tell. HL also represented an interesting bid given the election, highlighted here: https://gyazo.com/4faad147f66ae452738f6e30b1f59381\n\nSo what do you do? Get gains when you can consistently in these volatile times, and play that volatility. Contracts are more expensive, so feel empowered to straddle, and expect big movements Monday-Friday this week.\n\nExpect coronapennies to perform horrible if Trump wins, do well if Biden wins, etc.",
        "subreddit": "smallstreetbets",
        "title": "Pennystocks and the elections",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jmgm9t/pennystocks_and_the_elections/",
        "created": 1604318250.0
    },
    {
        "author": "TheTrueMarketMaker",
        "created_utc": 1604279371,
        "id": "jme3xs",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**Penny Stock Earnings for 2 November 2020**\n\n**Pre-Market**\n\n$CCLP $CPLP $CRNT $EXTN $ISEE $LPG $MFIN $MSGN\n\n$NERV $NWHM $OXLC $PARR $QTNT $RGS $STIM $SUP\n\n&amp;#x200B;\n\n**After Hours**\n\n$AMC $BSM $BTE $CDEV $CORR $CPE $CRD/A $CRD/B \n\n$DRRX $EEX $EVRI $GIFI $GORO $GTE $HNRG $JAKK \n\n$MEC $NCMI $NPTN $PAA $PAGP $PUMP $RIG $RPAI\n\n$TRVG $UAN $UROV $WPX $YRCW\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Pre-Market Watch List for 2 November 2020**\n\n&amp;#x200B;\n\n***(All   had a decent move in Friday After Hours or Got News Over The Weekend.   Looking at some getting a continuation pop in the Pre-Market. This list   should be mainly used by people who have access to 4am trading, as  that  is when the second run/pop is likely to occur, IF it occurs.)***\n\n&amp;#x200B;\n\n***$DSKE $ISIG $VHC $ZDGE $VTVT***\n\n&amp;#x200B;\n\nDo   your own due diligence first, do not just enter blindly because  someone  suggested it to you. If you do not want to learn how to be a  trader,  please do not try to be a trader. Thank you and I wish you all  good  luck.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n***Creator of Most of The Content (Slightly Edited By Me)***\n\nhttps://preview.redd.it/rhs99v8l8qw51.jpg?width=483&amp;format=pjpg&amp;auto=webp&amp;s=f1275f821cc747e91f87f73f2ecd7de7e62a3d3c",
        "subreddit": "pennystocks",
        "title": "Penny Stock Earnings and Pre-Market Watch List for 2 November 2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/jme3xs/penny_stock_earnings_and_premarket_watch_list_for/",
        "created": 1604308171.0
    },
    {
        "author": "No_Fap_Till_Midnight",
        "created_utc": 1604817840,
        "id": "jq7853",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hear me out y'all. AMC is at it's worst and OTM calls are trading for peanuts. This is one of those opportunities that you wished you had placed a massive position instead of $ROPE. There is no way that mickey mouse is going to let such favorable circumstances for a cheap acquisition slip away.   \n\n\nAnd the case holds for other big companies that can afford to acquire the company at this stage. If you are looking for the next HTZ then this is your opportunity right here.  I am YOLOing all of my capital on calls expiring on 15 of January. ALL IN BABY!  \n\n\nNEXT HTZ!  \nFREE MONEY!  \nCOCAINE &amp; HOOKERS!  \nYOLO 4 LIFE!\n\nhttps://preview.redd.it/81022mc1pyx51.png?width=1440&amp;format=png&amp;auto=webp&amp;s=1b64522cdcce77599b75438280de4c3cdacad4bc",
        "subreddit": "wallstreetbets",
        "title": "YOLO AMC - ALL IN!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jq7853/yolo_amc_all_in/",
        "created": 1604846640.0
    },
    {
        "author": "augusttrip2019",
        "created_utc": 1604932075,
        "id": "jqyjee",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC Gang RISE UP!!! Up 72%!! MOVIE THEATERS ARE BACK BABY!!",
        "url": "https://i.redd.it/daj1regi58y51.png",
        "created": 1604960875.0
    },
    {
        "author": "interestingstuff6",
        "created_utc": 1604933940,
        "id": "jqz2m3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SecurityAnalysis",
        "title": "Cinema stock AMC soars 59% premarket, Live Nation up 14% as Pfizer vaccine news sparks rally in event stocks",
        "url": "https://www.marketwatch.com/story/cinema-stock-amc-soars-59-premarket-live-nation-up-14-as-pfizer-vaccine-news-sparks-rally-in-event-stocks-2020-11-09",
        "created": 1604962740.0
    },
    {
        "author": "Youkiame",
        "created_utc": 1604927727,
        "id": "jqxe73",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Holy mother of fuck we just witnessed a fucking Hertz 2.0. History do repeat itself. Who's got calls or shares??",
        "subreddit": "wallstreetbets",
        "title": "AMC gang where ya fuking at!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jqxe73/amc_gang_where_ya_fuking_at/",
        "created": 1604956527.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1605017304,
        "id": "jrljji",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey everyone and Welcome I am going to talk about the impact of the announced vaccine on the stock market and what is happening to tech companies as well as the recovery plays [BANNER](https://ibb.co/TYKs2FB)\n\nYesterday there was a lot of movement in the stock market as companies that benefited a lot from the stay and work from home environment saw a huge drop with gaming companies like EA or Take Two interactive tumbling as well as Peloton and Zoom who fell more than 15% while even the biggest companies like Amazon felt the shift being down more than 5% [NEWS](https://ibb.co/72kPtK3) [NEWS](https://ibb.co/GQY3p1t)\n\nMeanwhile any stock that included in person participation like airline and travel stocks saw a huge spike in price, as they finally have some end point of the pandemic in sight with some big gains from companies like AMC, Cinemark, Carnival  [MOVEMENTS](https://ibb.co/HzfLkQM)\n\nWhile Starbucks also made a new all time high as the company will benefit a lot from the reopening as well as improved Us-China relationship. [STARBUCKS](https://ibb.co/j9CW5Z4)\n\nOther companies that saw a big drop yesterday were Bed Bath &amp;Beyond, Chewy, Domino’s &amp; Papa John’s and many more. [NEWS](https://ibb.co/51Rfx9N)\n\nHere are more market movers from yesterday in different sectors  [NEWS](https://ibb.co/WpT1Frx)\n\nWith huge gains being made in the financial sectors with most banks soaring while credit card companies also joined the rally [NEWS](https://ibb.co/nkCD15q) [NEWS](https://ibb.co/0Z2hzv6)\n\nThe announcement made yesterday will also impact the eventual stimulus bill size, as it is likely the bill will be smaller with a more limited time horizon, but this stimulus is still needed as a bridge between now and the time the benefits of the vaccine as lots of businesses still are under a lot of pressure.  [STIMULUS UPDATE](https://ibb.co/mRsgpK1)\n\nWe will also have to wait and see other companies finishing vaccines as the Pfizer one is very hard to deliver from a logistics standpoint it needs to be kept at very low temperatures well below freezing. [LOGISTICS PROBLEM](https://ibb.co/fvVFKyc)\n\nFortunately treatments of the illness are also progressing with Eli Lilly getting emergency use authorization for a new treatment [Eli Lilly NEWS](https://ibb.co/9HwPPsH)\n\nSo yesterday there was a lot of movement in the stocks as more than 70% were advancing with a 96% of new highs vs lows and the volume was up but in this case it was massive with more than 70% percent of companies having above average volume, this lead to a lot of brokers having issues handling the stocks. [CHART](https://ibb.co/x2dTdMc)\n\nThe Dow was the biggest gainer up almost 3% with intraday gains of more than 5% at one point [DOW CHART](https://ibb.co/TTb7kdR) , The Nasdaq had a wild ride being up and down but eventually finishing the day down more than 1,5%[NASDAQ CHART](https://ibb.co/N2KNBCV)  and the S&amp;P making new highs but eventually dropping back finishing the day just over 1% up [SP CHART](https://ibb.co/HdfLtq2)\n\nThe biggest gainers came from the energy and financial sectors yesterday with tech and comms suffering the most while small cap and value plays outperformed the market [SIZE CHART](https://ibb.co/zQ1r1bf) with the volatility index not moving to much as I expect this to remain at this level for the next months until we get some more updates on vaccines, stimulus debates and finally with the next president taking over. [VIX CHART](https://ibb.co/BGfLKLs)\n\nHere is the heat map for yesterday as you can see the market was pretty split with the tech and stay at home names being punished while the recovery plays were up big.  [HEAT MAP](https://ibb.co/MDMbDFp)\n\nWhile pre-market has started and the tech heavy Nasdaq is being punished again while the Dow is barely up. [PRE-MARKET](https://ibb.co/zPLMRt2)\n\nToday Microsoft will launch the new xBox series X and S just before the biggest competitor for the xBox is due to unveil the new PlayStation5, this is a growing part of Microsoft business and i really like they’re products for gaming despite the PS being more popular. [xBox](https://ibb.co/dMd9JcC)\n\nApple is expected to announce the new Macs, this is expected to present a more than 15 billion dollars opportunity for Apple [NEWS](https://ibb.co/kgK5bMK). Also the company will start taking orders at the end of this week in more than 50 countries [NEWS](https://ibb.co/hYTsn4p), I believe this is a great opportunity to buy the stock at a lower price with this drop in tech companies. They are my favorite company to own as they are expanding the company vertically and are releasing great new subscriptions based services while also benefiting from the cycle of moving phones to 5G.\n\nThe watchdogs seem to be going after big tech as Amazon has been hit with a couple of bad news in the last couple of days, as the vaccine coming out will likely slow the growth of the company beyond 2021, another news came today as the European Union will announce antitrust charges against them, i don’t see this as a big problem for the company as the charges are not very solid.[AMAZON NEWS](https://ibb.co/M25SZ6q)  So I still believe in the company and i will wait for the markets to calm down after the recent drop in stay at home plays to add to my position to the company. Likewise google is being investigated in India for potentially squeezing out competitor in payment processing with Google Pay. [GOOGLE NEWS](https://ibb.co/Jv6h4Lh)\n\nToday Disney also announced that they will cut even more into the employed staff, but they will strongly come back late next year, they are one of my favorite companies as i really like the expansion to the streaming business with Disney+ and Hulu. [DISNEY NEWS](https://ibb.co/vd90pJ4)\n\nSo Beyond Meat has been up and down in the last 36hours as the company was down big after McDonalds announced a new plant based product that didn’t include the company [NEWS](https://ibb.co/gJsvQyd) , afterwards the company jumped back up to positive [NEWS](https://ibb.co/DVj49S6) before eventually finishing the day down huge after they announced a huge miss on estimates, as the gross profit margin fell 6% since a year ago [FINANCIALS](https://ibb.co/gzPbxMY), while the EBITDA result was a loss of over 4 million dollars versus a more than 13 million profit expected [BYND EPS](https://ibb.co/tPn21Fp). This was followed but another set of news that they will partner with Pizza Hut to offer a plant-based pizza so a huge roller coaster for Beyond Meat. [PIZZA NEWS](https://ibb.co/WzQ6MbW)\n\nMeanwhile McDonalds beat earnings expectations and outlined a new growth strategy while also improving the taste and delivery of its burgers [MCD NEWS](https://ibb.co/j3hC5x2). They beat the EPS handily and also beat on revenue expectations with a big operating margin as the company did very well with its drive thru business [MCD EPS](https://ibb.co/8rgJJhV)\n\nA couple of other news are that one of my favorite companies in the communications sector, T-Mobile announced the expansion of home internet in more than 100 markets. [T-MOBILE](https://ibb.co/tx575z4)\n\nWhile the FAA is expected to end the 737 MAX grounding next week, which combined with the vaccine news will be a great return for Boeing. [BOEING NEWS](https://ibb.co/pPCWbcB)\n\nSo be aware and stay sharp when trading, despite infections rising in more than 60 countries with the US leading the pack in both cases and death and with new records and the highest moving average since march, I believe this will be a great time to own stocks as the political landscape is the most favorable one, [GLOBAL STATS](https://ibb.co/NTYDShp) [US DAILY STATS](https://ibb.co/0tHtRDf)\n\nWith investors being encouraged after the elections, with a split congress and a democratic president the average returns are the best in the last 100 years. [AVG RETURNS](https://ibb.co/rHSqKV8) [INVESTORS SENTIMENT](https://ibb.co/qd5Rwc7)\n\nThank you everyone for reading! Be sure to leave a comment down below!\n\nHave a great day and see you next time!",
        "subreddit": "StockMarket",
        "title": "Vaccine News| What’s next for the stock market? |Tech stock or recovery plays? [11-10-2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/jrljji/vaccine_news_whats_next_for_the_stock_market_tech/",
        "created": 1605046104.0
    },
    {
        "author": "jagerade",
        "created_utc": 1606427875,
        "id": "k1oan8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "AMC squeeze this week. Got those 4$ calls and broke 4 figures. Rolling out to UAA for January.",
        "url": "https://i.redd.it/lahvcqnbpn161.jpg",
        "created": 1606456675.0
    },
    {
        "author": "carrythevoid",
        "created_utc": 1606617817,
        "id": "k31fw0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on AMC?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k31fw0/thoughts_on_amc/",
        "created": 1606646617.0
    },
    {
        "author": "EggNasty11",
        "created_utc": 1606760537,
        "id": "k41oj9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "CrowdStrike (CRWD) BULLISH with ER 12/2 AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k41oj9/crowdstrike_crwd_bullish_with_er_122_amc/",
        "created": 1606789337.0
    },
    {
        "author": "TheTrueMarketMaker",
        "created_utc": 1604365803,
        "id": "jn0qdh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**After Hours News (2 November 2020, Just The Headlines)**\n\n$AMC AMC Entertainment Hldgs Q3 Adj. EPS $(5.70) Misses $(4.95) Estimate, Sales $119.50M Miss $160.89M Estimate \n\n$CGIX Cancer  Genetics, Inc. Announces Closing of Public Offering and Full Exercise  of the Underwriter's Option to Purchase Additional Shares\n\n$CRIS Curis to Release Third Quarter 2020 Financial Results and Hold Conference Call on November 10, 2020\n\n$CDEV Centennial Resource Dev Q3 EPS $(0.19), Inline, Sales $149.10M Beat $115.26M Estimate \n\n$CORR CorEnergy Infr Trust Q3 EPS $(0.31) Down From $0.94 YoY, Sales $4.63M Miss $5.55M Estimate \n\n$DRRX Durect Q3 EPS $(0.05) Misses $(0.04) Estimate, Sales $2.70M Miss $3.56M Estimate \n\n$EEX Emerald Expositions Q3 Adj. EPS $(0.08) Misses $0.08 Estimate, Sales $8.50M Down From $75.60M YoY\n\n$EIGR Eiger  Announces Abstracts Highlighting Peginterferon Lambda And Lonafarnib in  Chronic Hepatitis Delta Virus (HDV) Infection Accepted For Presentation  At The Liver Meeting Digital Experience™ 2020\n\n$GIFI Gulf Island Fabrication Q3 EPS $(0.81) Down From $(0.44) YoY, Sales $54.87M Down From $75.80M YoY\n\n$GRIL Muscle Maker Grill Acquires Previously Franchise-Owned  Philadelphia Location\n\n$HPE Global Biotech Firm Macrogen Selects HPE GreenLake to Accelerate Genomic Analysis and DNA Sequencing\n\n$HTGM HTG Demonstrates Technical Feasibility For A Whole Transcriptome Panel Using HTG EdgeSeq Technology\n\n$IEA Infrastructure and Energy Alternatives, Inc. Enters Into $550 Million Joint Venture With F.H. Paschen For the West Lake Corridor Rail Expansion in Indiana\n\n$IMMP Immutep's TACTI-002 Data to Be Presented at Society for Immunotherapy of Cancer 2020 Annual Meeting\n\n$JAKK Jakks Pacific Q3 EPS $4.76 Beats $3.09 Estimate, Sales $242.30M Beat $230.10M Estimate \n\n$MDWD MediWound to Report Third Quarter 2020 Financial Results and Host a Conference Call and Webcast on November 10, 2020\n\n$MNXXF Manganese X Receives Eligibility for DTC Trading in the U.S.\n\n$NCMI National CineMedia Q3 EPS $(0.16) Beats $(0.17) Estimate, Sales $6.00M Miss $11.03M Estimate\n\n$ORGO Organogenesis  Holdings Announces Research On Its PuraPly AM, Affinity, Apligraf,  NuShield And Dermagraft Will Be Presented At 2020 Symposium on Advanced  Wound Care (SAWC) Fall Virtual Meeting Nov. 4-6\n\n$OXBR Oxbridge Re Announce 2020 Third Quarter Results on November 10, 2020\n\n$PGEN Precigen to Announce Third Quarter 2020 Financial Results on November 9th: Will host Pipeline and Data Update Call in Early December\n\n$PRQR ProQR Therapeutics Shares Higher After Hours As Hearing Cantor Assuming Coverage With Overweight Rating, $22 Price Target\n\n$PUMP ProPetro Holding Q3 EPS $(0.29) Misses $(0.25) Estimate, Sales $133.70M Miss $138.20M Estimate \n\n$SANW S&amp;W Seed Company to Report First Quarter Fiscal Year 2021 Financial Results on Wednesday, November 11, 2020\n\n$STIM Neuronetics Q3 EPS $(0.18) Beats $(0.27) Estimate, Sales $12.40M Beat $11.56M Estimate \n\n$UROV Urovant Sciences Q2 EPS $(1.12) Beats $(1.50) Estimate \n\n$VNOM Viper Energy Partners Q3 EPS $(0.01) Beats $(0.07) Estimate, Sales $62.94M Beat $49.43M Estimate \n\n$WPX WPX Energy Q3 Adj. EPS $0.11 Beats $0.06 Estimate, Sales $473.00M Miss $593.02M Estimate\n\n$YRCW YRC Worldwide Q3 EPS $(0.04) Beats $(0.28) Estimate, Sales $1.18B Beat $1.18B Estimate \n\n \n\n**Penny Stock Earnings for 3 November 2020**\n\n**Pre-Market**\n\n$ATAX $BBGI $EAF $FI $GCI $HUD $ICD $KOPN $TRMT $TTI $WBT\n\n&amp;#x200B;\n\n**After Hours**\n\n$AAIC $ACOR $ANH $BRY $BTG $DS $FPRX $FSP $HBM $INN $ITUB \n\n$KRMD $METC $NEX $NR $QUAD $RNWK $RYAM $TREC $WTTR\n\n&amp;#x200B;\n\n**Potential Near Future Catalysts**\n\n**$VTVT**\n\n**Drug:** *Azeliragon*\n\n**Date:** *Phase 2 Presentation On 4 November 2020*\n\n**$BLPH**\n\n**Drug:** *INOpulse delivery device*\n\n**Date:** *Phase 2 Data On 5 November 2020*\n\n&amp;#x200B;\n\n**Pre-Market Opening Watch List for 3 November 2020**\n\n***(This  list  should be mainly used by people who have access to 4am trading,  as that  is when the second run/pop is likely to occur, IF it occurs.)*** \n\n&amp;#x200B;\n\n***$ACOR $DGLY $IEA $JAKK $VISL***\n\n&amp;#x200B;\n\n***Creator of the Above Content (Slightly Edited By Me)***\n\nhttps://preview.redd.it/kdjt1oqjyww51.jpg?width=476&amp;format=pjpg&amp;auto=webp&amp;s=33081053599b107e345b6464442c02d4b4d01778",
        "subreddit": "pennystocks",
        "title": "After Hours News (2 November 2020, Just The Headlines), Penny Stock Earnings, Near Future Potential Catalysts and Pre-Market Opening Watch List for 3 November 2020",
        "url": "https://www.reddit.com/r/pennystocks/comments/jn0qdh/after_hours_news_2_november_2020_just_the/",
        "created": 1604394603.0
    },
    {
        "author": "No_Fap_Till_Midnight",
        "created_utc": 1604962872,
        "id": "jr8mhs",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "AMC Jan15'21 5 Call\n\nhttps://preview.redd.it/hcts7ts2pay51.png?width=1473&amp;format=png&amp;auto=webp&amp;s=a14ada563c2304825dffeb5d62e6159ddb44453e",
        "subreddit": "wallstreetbets",
        "title": "Still too early",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jr8mhs/still_too_early/",
        "created": 1604991672.0
    },
    {
        "author": "wa11str33tbettor",
        "created_utc": 1605882438,
        "id": "jxpy1a",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Made $8 off AMC puts yesterday!",
        "url": "https://i.redd.it/61260t3gne061.jpg",
        "created": 1605911238.0
    },
    {
        "author": "wa11str33tbettor",
        "created_utc": 1605732738,
        "id": "jwo6ad",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Made $8 off my AMC put today!!",
        "url": "https://i.redd.it/8q8k087ba2061.jpg",
        "created": 1605761538.0
    }
]