[
    {
        "author": "Avaronah",
        "created_utc": 1600261736,
        "id": "itv4t4",
        "num_comments": 507,
        "num_crossposts": 0,
        "selftext": "Snowflake (SNOW) will go public today. The data warehousing company will be the biggest IPO of the year and it has gotten a lot of attention lately. Salesforce and even Berkshire Hathaway will both be buying 3.1 million stocks, good for $500,000,000 in total. They got to buy them for $80 per share.\n\nThis week, the company's underwriters have upped the price range from $75-$85 to $100-$110, which is an increase of 31% due to greater demand. They then decided that this was still not good enough so the stock will go public at $120 per share.\n\nCan this be justified? Maybe. Their revenue increased with 130% in the first half of the year yoy. They're on track to bring in $500 mln in revenue this year. We all know that investors get really excited by cloud companies and pay a hefty premium for them, because they keep generating revenue during lockdowns and high growth rates are expected to continue over the coming years.\n\nNow, here's the quote we've all been waiting for:\n\n\"For the investor, a too-high purchase price for the stock of an excellent company can undo the effects of a subsequent decade of favorable business developments.\"\n\nThe irony is that Buffet himself is involved in this highly priced IPO. Yes, we all know that the company will probably do great over the next few years. The data warehousing industry will have a size of around $35 bln in 2025. That's just a little bigger than the current market cap of Snowflake($33.3 bln). Last February, they were only valued at $12.7 bln, and with a P/S ratio of 50, the stock is more expensive than Zoom. What you really should be asking yourself is: how much of their expected growth is already priced in? Are you willing to pay 50% more than that institutional parties had to?\n\nI'm not saying whether to buy in or not, I just wanted to give this piece of advice by the Oracle to you. Never buy out of FOMO and good luck investing y'all.",
        "subreddit": "investing",
        "title": "Let this Buffet quote guide you with your decision on $SNOW",
        "url": "https://www.reddit.com/r/investing/comments/itv4t4/let_this_buffet_quote_guide_you_with_your/",
        "created": 1600290536.0
    },
    {
        "author": "catfishman112",
        "created_utc": 1600429882,
        "id": "iv4lfk",
        "num_comments": 411,
        "num_crossposts": 0,
        "selftext": "Well maybe it’s time to buy oracle puts\n\nhttps://www.google.com/amp/s/mobile.reuters.com/article/amp/idUSKBN2691QO\n\nText text text text text text text",
        "subreddit": "wallstreetbets",
        "title": "Exclusive: Trump to block U.S. downloads of TikTok, WeChat on Sunday - officials",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iv4lfk/exclusive_trump_to_block_us_downloads_of_tiktok/",
        "created": 1600458682.0
    },
    {
        "author": "theflyingredditor",
        "created_utc": 1600040235,
        "id": "is9f4j",
        "num_comments": 380,
        "num_crossposts": 0,
        "selftext": "https://www.wsj.com/articles/microsoft-drops-out-of-bidding-for-tiktoks-u-s-operations-11600039821\n\nMicrosoft [US:MSFT] drops out of bidding for TikTok’s U.S. operations—Microsoft statement\n\nTikTok parent ByteDance told Microsoft its offer wasn’t accepted—Microsoft statement\n\nUpdate: Oracle Chosen as Winner in Deal for TikTok’s U.S. Operations",
        "subreddit": "investing",
        "title": "Microsoft Drops Out of Bidding for TikTok’s U.S. Operations",
        "url": "https://www.reddit.com/r/investing/comments/is9f4j/microsoft_drops_out_of_bidding_for_tiktoks_us/",
        "created": 1600069035.0
    },
    {
        "author": "RemarkableTry9",
        "created_utc": 1600039298,
        "id": "is95kv",
        "num_comments": 379,
        "num_crossposts": 1,
        "selftext": "[tiktok rejects Microsoft deal](https://www.google.ca/amp/s/www.nytimes.com/2020/09/13/technology/tiktok-microsoft-oracle-bytedance.amp.html)\n\nLooks like the Microsoft-Tiktok deal has fallen through. \n\n\n“The owner of the Chinese app TikTok rejected an offer on Sunday from Microsoft to take over the firm’s U.S. operations, according to Microsoft officials and other people involved in the negotiations, as time runs out on an executive order from President Trump threatening to ban the popular app unless its American operations are sold.”\n\nHowever, it appears Oracle is still in the running. \n\n“The move leaves Oracle — one of the few Silicon Valley firms to publicly ally with Mr. Trump — as the sole publicly known remaining bidder for TikTok.” \n\nOnce there were rumours going around of a potential deal MSFT share price began to rise, but now that the deal’s fallen through, what could this mean for MSFT tomorrow?",
        "subreddit": "stocks",
        "title": "TikTok rejects Microsoft deal",
        "url": "https://www.reddit.com/r/stocks/comments/is95kv/tiktok_rejects_microsoft_deal/",
        "created": 1600068098.0
    },
    {
        "author": "xbordermike",
        "created_utc": 1600043930,
        "id": "isafix",
        "num_comments": 299,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Oracle wins Tik Tok sweepstakes",
        "url": "https://finance.yahoo.com/news/bytedance-picks-oracle-winning-bidder-000109920.html",
        "created": 1600072730.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1600607867,
        "id": "iwdooh",
        "num_comments": 192,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/chinas-bytedance-seeks-60-billion-085951999.html\n\nOracle will take a 12.5% stake in TikTok Global and store all its U.S. user data in its cloud to comply with U.S. national security requirements, the companies said on Saturday. Retail giant Walmart said it would take a 7.5% stake.\n\nThe two companies would pay a combined $12 billion for their stakes if they agree to a $60 billion asking price, Bloomberg reported.",
        "subreddit": "stocks",
        "title": "China's ByteDance seeks $60 billion TikTok valuation in U.S. deal - Bloomberg News",
        "url": "https://www.reddit.com/r/stocks/comments/iwdooh/chinas_bytedance_seeks_60_billion_tiktok/",
        "created": 1600636667.0
    },
    {
        "author": "essexrt",
        "created_utc": 1600043185,
        "id": "isa8ii",
        "num_comments": 167,
        "num_crossposts": 0,
        "selftext": "I’m sure everyone has heard about the microsoft news. They did not get the bid for tik tok. Oracle won it. Is this good or bad for microsoft? I’ve heard many different opinions on this. \n\n1. Clearly it could go down and they could tank \nor \n2. They might be green tomorrow because the deal wouldn’t have benefited microsoft anyways rather causing them more of a headache.  \n\nThere is also news about Microsoft’s new ultimate game pass being released Tuesday. \nAt this point I thought the whole tik tok news was old news but it seems people are freaking out and thinking it will tank. \n\nI have two 225c 10/16. I’m very worried at this point this news will affect them negatively. \n\nedit: should I sell or hold onto them?\n\nWhat are people opinions on this ?",
        "subreddit": "wallstreetbets",
        "title": "MICROSOFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/isa8ii/microsoft/",
        "created": 1600071985.0
    },
    {
        "author": "zsx00",
        "created_utc": 1600049712,
        "id": "isbyqy",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "If yall don't buy oracle calls at open please stop trading",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/isbyqy/if_yall_dont_buy_oracle_calls_at_open_please_stop/",
        "created": 1600078512.0
    },
    {
        "author": "jeff4tech",
        "created_utc": 1600550824,
        "id": "iw14wn",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "[https://www.bloomberg.com/news/articles/2020-09-19/trump-says-he-s-approved-oracle-deal-for-u-s-tiktok-operations?srnd=markets-vp](https://www.bloomberg.com/news/articles/2020-09-19/trump-says-he-s-approved-oracle-deal-for-u-s-tiktok-operations?srnd=markets-vp)\n\nDonald Trump said he’s approved [Oracle Corp.](https://www.bloomberg.com/quote/ORCL:US)’s bid for the U.S. operations of TikTok “in concept,” a deal forced by the president’s orders last month declaring the popular video-sharing app a national security threat.\n\n“I have given the deal my blessing,” Trump told reporters Saturday as he left the White House for a campaign rally in Fayetteville, N.C. “I approved the deal in concept.”\n\nThe Chinese government must now sign off on the transaction for it to go forward.",
        "subreddit": "wallstreetbets",
        "title": "Trump Says He’s Approved Oracle Deal For U.S. Tiktok Operations",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iw14wn/trump_says_hes_approved_oracle_deal_for_us_tiktok/",
        "created": 1600579624.0
    },
    {
        "author": "postallyouwant",
        "created_utc": 1600476067,
        "id": "ivibx1",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "There used to be very frequent DDs from some active users at least a few every week. They used to get some big attention, huge upvotes and rewards. Now there's barely any left. If you check their history, they all stopped posting \\~3 months ago. Now WSB seems much smaller.\n\n&amp;#x200B;\n\nWhat happened?\n\n&amp;#x200B;\n\nPositions: $COST 9/25 340C, $SPY 9/28 336C, $ORCL 9/25 65C, $AAPL 9/25 115C",
        "subreddit": "wallstreetbets",
        "title": "Where Did All The BIG DD WSBers Go?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivibx1/where_did_all_the_big_dd_wsbers_go/",
        "created": 1600504867.0
    },
    {
        "author": "UsedButtPlugsForSale",
        "created_utc": 1600042419,
        "id": "isa15s",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "A penny for your thot: really, ByteDance byte (sorry) the bullet and rejected [WMT + MSFT](https://www.cnn.com/2020/09/13/tech/microsoft-tiktok-bytedance/index.html). Previously, the news reacted well with calls performing for both WMT and MSFT.\n\nBut why was it rejected? ORCL is still running for TikTok, but more importantly, the deadline for TikTok to sell operation is coming as early as this Tuesday.\n\nWhat does that mean? A shutdown for 100M monthly users, with FB's copycat Reels possible pulling in the users as a result.  \n\nPrediction for this week: puts on MSFT. ORCL calls.",
        "subreddit": "options",
        "title": "MSFT's offer rejected by TikTok",
        "url": "https://www.reddit.com/r/options/comments/isa15s/msfts_offer_rejected_by_tiktok/",
        "created": 1600071219.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "created_utc": 1600062251,
        "id": "isf0yb",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "Source: https://twitter.com/LiveSquawk/status/1305379350750146560?s=20  \n  \nThis is the most stupid saga I have ever been a part of. Tired of the merry go round between MSFT, WMT, ORCL, FB, TWTR and SNAP calls. Each time there is some development, China cockblocks these at will. MSFT would be much better without buying TikTok and all the baggage that comes with it.  \n  \nWhat are your thoughts on this long running TikTok play. It's been 2 months and even puts the other gang I've been a part of (clang gang) to shame.  \n  \nPositions: MSFT 220C 10/16, WMT 145C 10/16, FB 300C 10/16, SNAP 25C 10/16",
        "subreddit": "wallstreetbets",
        "title": "ByteDance Won't Sell Tiktok U.S. Operations To Microsoft Or Oracle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/isf0yb/bytedance_wont_sell_tiktok_us_operations_to/",
        "created": 1600091051.0
    },
    {
        "author": "BuzzLima",
        "created_utc": 1600455278,
        "id": "ivc58m",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "TikTok interim CEO Vanessa Pappas invited Facebook (FB) and Instagram to \"publicly join\" the company's challenge Trump's ban of the video-sharing app and \"support our litigation.\" \"This is a moment to put aside our competition and focus on core principles like freedom of expression and due process of law,\" Pappas tweeted. The comments come as the Commerce Department announced prohibitions on transactions relating to WeChat and TikTok as of Sunday on \"national security\" grounds. The Fly notes that TikTok's Chinese owner ByteDance has reached an agreement with Oracle (ORCL)\n\n[https://twitter.com/v\\_ness/status/1306956276761415681](https://twitter.com/v_ness/status/1306956276761415681)\n\n***Why would Facebook support Tik Tok when they just make a mirror copy of Tik Tok using Instagram? Either I am true blue retard or this Tik Tok CEO Vanessa Pappas is a pussy degenerate***",
        "subreddit": "wallstreetbets",
        "title": "TikTok's reatrded CEO invites Facebook to help fight TikTok ban",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivc58m/tiktoks_reatrded_ceo_invites_facebook_to_help/",
        "created": 1600484078.0
    },
    {
        "author": "manhattanabe",
        "created_utc": 1600041934,
        "id": "is9w9p",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": "\nhttps://www.bloomberg.com/news/articles/2020-09-13/oracle-is-said-to-gain-advantage-in-deal-for-tiktok-in-u-s\n\nOracle has a pretty big cloud infra so they can host all the TikTok data in house.  It will also showcase their capabilities.    On the other hand, they probably paid around $30bn (a guess at this time), and will not have full control.     Also, they don’t have a brand name in social media.",
        "subreddit": "investing",
        "title": "So is Oracle getting TikTok a buy?",
        "url": "https://www.reddit.com/r/investing/comments/is9w9p/so_is_oracle_getting_tiktok_a_buy/",
        "created": 1600070734.0
    },
    {
        "author": "refroni",
        "created_utc": 1600358149,
        "id": "ium8n5",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": " \n\nI think that after this post I will turn the list just into a link.\n\nHope you all enjoyed my last 6 DDs on [WIX](https://www.reddit.com/r/wallstreetbets/comments/ghc9d9/wixcom_earnings_coming_up_discussion/), [TTWO](https://www.reddit.com/r/wallstreetbets/comments/gjzud8/ttwo_earnings_coming_up_discussion/), [CLDR](https://www.reddit.com/r/wallstreetbets/comments/gnoy6r/heads_up_on_cloudera_cldr_discussion/) , [ORCL](https://www.reddit.com/r/wallstreetbets/comments/gvky4l/heads_up_on_orcl_discussion/), [SMPL](https://www.reddit.com/r/wallstreetbets/comments/hicsdc/heads_up_on_smpl_discussion/), [ATVI](https://www.reddit.com/r/wallstreetbets/comments/hsf6xa/heads_up_on_atvi_discussion/), and [FDX](https://www.reddit.com/r/wallstreetbets/comments/ikeptw/heads_up_on_fdx_discussion/) which netted over 1000% profits from the day I posted about them. This time it's another non tech play!\n\n**TL;DR** \\- Rite Aid(RAD) has earning coming up on 9/24 (Pre Market). Rite Aid range seems prime for going back to previous highs especially with the bump they are getting from the ongoing pandemic. Rite Aid generates a good amount of money on \"shots &amp; vaccines\" every year. This year more people are worried about getting sick = more flu shots = more money for RAD + the minute we have any sort of vaccine Rite Aid should become a main distribution source.\n\n**Play - RAD $14C 9/25 &amp; RAD $15C 10/16**\n\n**Noteworthy Fedex Operations**\n\n* [Rite Aid announcing they are ready to administer the highest number of flu shots than in any previous year.](https://www.erienewsnow.com/story/42640448/rite-aid-now-offering-seasonal-flu-shots)\n* [Rising need for flu shots](https://observerxtra.com/2020/09/17/health-experts-expect-to-see-rise-in-flu-shots-amid-coronavirus/)\n* [Pharmacies preparing for Covid-19 Vaccine case](https://www.drugtopics.com/view/pharmacies-must-prepare-for-a-covid-19-vaccine)\n\n**Financials**\n\n* Short term assets of $3.88B cover their short term liabilities of $2.64B\n\n**Play**\n\n**RAD $14C 9/25 &amp; RAD $15C 10/16**\n\n**What are your thoughts?**",
        "subreddit": "wallstreetbets",
        "title": "Heads up on RAD - Discussion",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ium8n5/heads_up_on_rad_discussion/",
        "created": 1600386949.0
    },
    {
        "author": "InTheGreen303",
        "created_utc": 1600458430,
        "id": "ivd4zc",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "Took the L holding RKT after earnings\n\nI held those fuckers out of spite 💎 🙌🏼 foreva \n\nAnd a big fuck you goes out to Donny and the gang for crushin my Oracle &amp; Walmart calls \n\nI hate you all",
        "subreddit": "wallstreetbets",
        "title": "RIP RKT 9/18c",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivd4zc/rip_rkt_918c/",
        "created": 1600487230.0
    },
    {
        "author": "naeschll",
        "created_utc": 1600103860,
        "id": "ispc5a",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "So now after monday morning's optimism sparked by some company takeovers (NVID/ARM + TikTok/Oracle) we are basically back were we were the last two weeks. Everybody is aware of the tech bubble. Retail investors are panicing creating immense selling pressure. FED already got all their tools in place and really cannot do much more. Smart money is getting pulled out of the market in order to secure profits. Environmental issues like burning california and hurricanes are just rounding up the second COVID wave that is coming when flue season hits and the second lockdown will wreck the economy even more. Plus election volatility. \n\n&amp;#x200B;\n\nI see a really dark picture painting at the near horizon. What do you think?",
        "subreddit": "wallstreetbets",
        "title": "Tech Sell-Off / Tech Bubble / Market Crash",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ispc5a/tech_selloff_tech_bubble_market_crash/",
        "created": 1600132660.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1599685167,
        "id": "ipp1dp",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, September 9, 2020**\n\nStocks shot up today and recovered some losses after sharp declines in big tech stocks. After several red days, shares of Amazon (AAPL), Apple (AAPL), Microsoft (MSFT) and other big companies rallied. On a dour note, reopening stocks (travel, cruise lines, airlines, hotels, etc) were down after AstraZeneca (AZN) announced it had its COVID-19 vaccine trial paused. \n\nThe S&amp;P finished 2.08% up, the Nasdaq was 2.92%, leading the day, and the Dow finished 1.68% up. The volatility index (VIX) was down 4.8%, indicating increased risk appetite in traders.\n\nToday, it was announced that AstraZeneca, a forerunner in the development of the COVID vaccine announced a pause of their experimental trial after one patient became more ill, pledging to make safety a priority and take the time necessary to let science prevail. This setback comes in stark contrast to politicians and governments who seem to imply a cure is just around the corner. Shares of AstraZeneca sank 2%, while those of companies competing to develop a Covid-19 vaccine including Moderna (MRNA) and Novavax (NVAX) rose. \n\nUS oil prices plunged nearly 7% today, after Saudi Aramco, the largest oil producer in the world, announced it would be slashing its selling price to Asia and the United States, per Bloomberg. \"Oil demand globally is really sluggish. All of the low hanging fruit from the global oil recovery has already happened,\" said Michael Tran, managing director of global energy strategy at RBC Capital Markets.\n\nAsia-Us cargo rates are at the highest since March lows. For bulls evidence of a rebounding economy, for bears activity is fueled by liquidity and the shoe has yet to drop.\n\n**Highlights**\n\n* After falling nearly 20% in the week, Tesla (TSLA) stock roared back today, finishing the day 10.9% up.\n* Big Commerce (BIGC) reported earnings today. While estimates were beaten, investors were not impressed. Stock is down 10% today (4% during session (6% after-hour)\n   * EPS of -$0.38 v -$0.43 estimate\n   * Revenue of 36.3 million v 35.6 million estimate\n* Facebook (FB) underperformed the market, finishing a modest 0.94% up. \n* Precious metals were up today, with gold miners ($GDX) leading, up 4.34%. Silver was up 1.58% and gold was 0.92% up.\n* McConnell announced plans to unveil the new $300B relief bill and took procedural steps needed to set up a vote \"as soon as this week.\" Schumer and Pelosi said \"Republicans bill which doesn't come close to addressing the problems and is headed nowhere\"\n* Analyst Upgrades:\n   * $MSFT Microsoft had a nice boost by Morgan Stanley $MS who raised its price target from $230 to $245 \n   * $PTON Peloton had Price Target raised by Wedbush from $66 to $100\n   * $RPD Rapid7 Target raised by $MS Morgan Stanley $55 to $60 (nice stock check it out)\n   * $SFIX Stich Fix initiated by Deutsche Bank at BUY with pt $34\n   * $SPCE Virgin Galactic Upgraded by Credit Suisse from $22 to $24 and NEUTRAL to OUTPERFORM.\n\nNotable Earnings for Tomorrow Thur Sept 10: FuelCell FCEL (BO), Chewy CHWY (AH), Dave &amp; Busters PLAY (AH),  Oracle ORCL (AH), Peloton PTON (AH)\n\nInteresting recent CEO transactions: MNLO $100k, CWH $3MM, VST $750k, BKR $1MM, FRG $4.5MM, IVZ $3MM, SDC $10MM, PLAG $1.7MM",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today, Wed, Sept 9. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/ipp1dp/here_is_a_market_recap_for_today_wed_sept_9/",
        "created": 1599713967.0
    },
    {
        "author": "Leylinus",
        "created_utc": 1600185278,
        "id": "itbj8w",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "I'm not sure I buy this Oracle deal. \n\n**The \"Trump Connection\"**\n\nThe supposed close connection is one guy who hosted a fundraiser for him and is connected to a lady that was part of his transition team. The single fundraiser wouldn't likely represent something significant to Trump, as there are far bigger boosters that Trump seems to be genuinely unaware of ever meeting. \n\nMore significantly, the guy also has ties to China, so the \"connection\" that he might trust would be the woman from Trump's transition team. \n\nThe thing is, Trump was infamously uninvolved in his transition team. When he was told that, before you even know if you won, you put out millions to fund a transition team he balked at the idea. Instead he sat down with Chris Christie and another guy to quickly throw together a list, mostly consisting of people he's never heard of. \n\nThe refusal to pay for the traditional transition process was ultimately the cause of many of Trump's political problems. His administration was plagued from the onset by leaks and administration officials actively working against the administration's agenda. \n\n**The Deal**\n\nThe deal doesn't accomplish anything Trump set out to do. He would have to publicly change the stated terms of his executive order in order for this to be allowed.\n\nIt also does nothing significant to protect American data from spying. Without access to the algorithm, this basically just amounts to an American company with Chinese ties vouching for Tik Tok.\n\n**Trump absolutely prefers a deal with Microsoft**\n\nHe recently redirected the money the US was sending to the WHO to a Gates charity. They're also one of the only companies that isn't being actively targeted by the FCC or the DOJ.\n\nFurther, as Tik Tok's data and algorithm could be used to enhance Bing and finally make it viable MSFT would then pose a serious threat to Google, a company Trump has very publicly opposed due to perceived bias against him. \n\n**China doesn't actually have leverage**\n\nRetaliatory tech tariffs imposed by China would injure companies that Trump largely considers enemies. His proposed change in regulations such that moderated social media would be considered a publisher poses a far greater threat to those companies financially than anything China could do.\n\nFurther, if China doesn't ultimately capitulate Bytedance will lose billions and there will be a looming threat of similar restrictions being placed on other Chinese tech firms. It would likely result in companies like TENCENT taking significant hits. \n\n**Bad Optics**\n\nChanging the terms of his executive order to fit this deal would essentially be conceding defeat. As both candidates have argued that they will take firm stances against China, giving this much ground here would make Trump look incredibly weak. The fact that it might also be spun as corruption to benefit a campaign donor only makes the optics worse. \n\n**Kushner**\n\nThey sent Kushner on CNBC this morning to talk about the deal. While many of you will recognize that name as a significant Trump official, a couple months ago he was quietly demoted as the Trump campaign decided to go in a different direction.\n\nEven in his discussion of the deal this morning, he continued to stress that it will be reviewed by the appropriate regulatory agency and never gave any indication he believes it will pass that review. He had a poker face throughout the interview and had little hopeful commentary. \n\nTL;DR- I don't think this ORCL deal goes through.",
        "subreddit": "wallstreetbets",
        "title": "The Oracle Deal Isn't Going to Happen, here's why",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itbj8w/the_oracle_deal_isnt_going_to_happen_heres_why/",
        "created": 1600214078.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1600553908,
        "id": "iw1y2d",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "President Donald Trump said Saturday he has approved in principle a deal in which [Oracle](https://www.cnbc.com/quotes/?symbol=ORCL) and [Walmart](https://www.cnbc.com/quotes/?symbol=WMT) would partner with the viral video-sharing app TikTok in the U.S., allowing the popular app to [avoid a shutdown](https://www.cnbc.com/2020/09/18/trump-to-block-us-downloads-of-tiktok-wechat-on-sunday-officials-tell-reuters.html).\n\n“I have given the deal my blessing -- if they get it done that’s great, if they don’t that’s okay too,” Trump told reporters on the White House South Lawn before departing for North Carolina . “I approved the deal in concept.”\n\nTrump said the new company will likely be incorporated in Texas. \n\nOracle, Walmart and Tiktok could not be immediately reached for comment. \n\nThe outcome could boost Oracle’s position as a company that can handle challenging computing workloads and help to resolve a geopolitical dispute between the U.S. and China.\n\nTikTok and Oracle [both said Monday](https://www.cnbc.com/2020/09/14/oracle-confirms-deal-with-tiktok-owner-bytedance-to-become-trusted-technology-provider.html) that ByteDance, the Chinese owner of TikTok, had sent a proposal to the U.S. Treasury Department over the weekend. Reports throughout the week said that negotiations were bogged down on the precise details of the deal, including the ownership stakes of Oracle and ByteDance, and control of the recommendation algorithms TikTok uses to promote particular material. \n\nOracle CEO Safra Catz was a member of President Trump’s transition team, and Oracle Chairman Larry Ellison threw a fundraising event for Trump earlier this year.\n\nOracle already provides cloud infrastructure to online video services [8x8](https://www.cnbc.com/quotes/?symbol=EGHT) and [Zoom](https://www.cnbc.com/quotes/?symbol=ZM), among other clients, although [Amazon](https://www.cnbc.com/quotes/?symbol=AMZN), Microsoft and other companies picked up more cloud revenue than Oracle in 2019, according to [estimates](https://www.gartner.com/en/newsroom/press-releases/2020-08-10-gartner-says-worldwide-iaas-public-cloud-services-market-grew-37-point-3-percent-in-2019) from industry research company [Gartner](https://www.cnbc.com/quotes/?symbol=IT).\n\n[Microsoft](https://www.cnbc.com/quotes/?symbol=MSFT) had sought to acquire TikTok’s operations in the U.S. Canada, Australia and New Zealand, with [Walmart](https://www.cnbc.com/quotes/?symbol=WMT) as a partner, but on Sunday said [ByteDance had decided not to do that deal](https://www.cnbc.com/2020/09/14/microsoft-bid-for-tiktoks-us-operations-rejected-by-bytedance.html).\n\nChina and the Trump administration have used tariffs in their trade war in recent years, and their disagreements have spilled over into the technology industry. The Treasury Department’s Committee on Foreign Investment in the United States [pushed for a sale](https://www.cnbc.com/2020/03/06/grindrs-chinese-owner-says-to-sell-social-media-app-for-608-million.html) of dating app Grindr by the Chinese company that bought it in 2016, and the committee later [looked into ByteDance’s 2017 acquisition](https://www.cnbc.com/2020/07/29/mnuchin-confirms-tiktok-is-under-cfius-review.html) of Musical.ly, a video sharing app that ByteDance merged with TikTok in 2018, because of national security concerns. A Trump executive order in August in August sought to [block U.S. transactions](https://www.cnbc.com/2020/08/07/trump-issues-executive-orders-to-ban-us-transactions-with-wechat-tiktok.html) with ByteDance, as well as [Tencent](https://www.cnbc.com/quotes/?symbol=700-HK), which owns messaging app WeChat.\n\nPresident Trump had taken steps to [ban TikTok in the U.S.](https://www.cnbc.com/2020/07/31/trump-says-he-will-ban-tiktok-through-executive-action-as-soon-as-saturday.html) or make ByteDance [sell the app’s U.S. assets](https://www.cnbc.com/2020/08/14/president-trump-orders-bytedance-to-divest-from-its-us-tiktok-business-within-90-days.html). The Chinese government subsequently revised export restrictions so that they now cover “recommendation of personalized information services based on data analysis,” among other things. TikTok’s app draws on recommendation systems to select videos to show each user.\n\n[https://www.cnbc.com/2020/09/19/trump-says-he-has-approved-tiktok-oracle-deal-in-concept.html](https://www.cnbc.com/2020/09/19/trump-says-he-has-approved-tiktok-oracle-deal-in-concept.html)",
        "subreddit": "stocks",
        "title": "Trump says he has agreed to deal in which TikTok will partner with Oracle and Walmart",
        "url": "https://www.reddit.com/r/stocks/comments/iw1y2d/trump_says_he_has_agreed_to_deal_in_which_tiktok/",
        "created": 1600582708.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1600043264,
        "id": "isa99l",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/09/14/microsoft-bid-for-tiktoks-us-operations-rejected-by-bytedance.html\n\nByteDance, the Chinese owner of social video app TikTok, has chosen Oracle to be TikTok’s U.S. technology partner, and Oracle will take a significant stake in the business, according to a person familiar with the discussions. Microsoft said Sunday that ByteDance had chosen not to sell it TikTok’s U.S. assets.\n\nMicrosoft’s failure to buy TikTok amounts to a symbolic loss for Satya Nadella, who took over Microsoft from Steve Ballmer in 2014. Under Ballmer, Microsoft had sought to buy Yahoo in 2008 but ultimately withdrew the bid after Yahoo rejected the offer, even as Microsoft increased the amount it was willing to pay.",
        "subreddit": "stocks",
        "title": "Oracle poised to become TikTok’s U.S. technology partner after Chinese owners reject Microsoft’s bid",
        "url": "https://www.reddit.com/r/stocks/comments/isa99l/oracle_poised_to_become_tiktoks_us_technology/",
        "created": 1600072064.0
    },
    {
        "author": "KL5400",
        "created_utc": 1599936157,
        "id": "iri5vc",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Tik Tok and byte dance have until Tuesday to decide whether they want to sell to the U.S, they said they rather have tik Tok banned in the United States than have to do a forced sale. I think that’s a dumb move and they should just take the sale, but regardless my\nPlays for this are mainly Microsoft, Oracle And Walmart. Since it’s either gonna be Microsoft and Walmart buying together or Oracle, it could be a big move if the sales goes thru",
        "subreddit": "stocks",
        "title": "Monday Tik Tok Plays",
        "url": "https://www.reddit.com/r/stocks/comments/iri5vc/monday_tik_tok_plays/",
        "created": 1599964957.0
    },
    {
        "author": "ehchoices",
        "created_utc": 1600551701,
        "id": "iw1dax",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Partnership between oracle and wmt\n\nhttps://www.wsj.com/articles/trump-signs-off-on-deal-allowing-tiktok-to-continue-u-s-operations-11600551352?st=8n2f5s9lsrosp5q&amp;reflink=article_copyURL_share",
        "subreddit": "wallstreetbets",
        "title": "Trump signs off on deal allowing TikTok to continue U.S. Operations",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iw1dax/trump_signs_off_on_deal_allowing_tiktok_to/",
        "created": 1600580501.0
    },
    {
        "author": "ahdude1",
        "created_utc": 1600576936,
        "id": "iw7hio",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "From my perspective, fastly should benefit from this mess. Ragardless, tiktok still have to continue use fastly service (oracle won’t be able to find or provide any edge compute technology anytime soon), let alone to move the whole tiktok infrastructure into oracle cloud network. Love to hear your opinions on this",
        "subreddit": "stocks",
        "title": "How does Oracle + WMT and tiktok deal affect FSLY stock?",
        "url": "https://www.reddit.com/r/stocks/comments/iw7hio/how_does_oracle_wmt_and_tiktok_deal_affect_fsly/",
        "created": 1600605736.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1601254414,
        "id": "j12giu",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "The ruling followed an emergency hearing Sunday morning in which lawyers for TikTok argued that the administration’s app-store ban would infringe on the company’s First Amendment rights and do irreparable harm to the business.\n\nEarlier this year, President Donald Trump declared that TikTok was a threat to national security and that it must either sell its U.S. operations to U.S. companies or be barred from the country.\n\nNEW YORK (AP) — Lawyers for TikTok pleaded with a U.S. federal judge on Sunday to delay the Trump Administration’s ban of the popular video sharing program from app stores set to take effect at the end of the day, arguing the move would infringe on First Amendment rights and do irreparable harm to the business.\n\nThe 90-minute hearing came after President Donald Trump declared this summer that TikTok was a threat to national security and that it either sold its U.S. operations to U.S. companies or the app would be barred from the country.\n\nTikTok, owned by Chinese company ByteDance, is scrambling to firm up a deal tentatively struck a week ago in which it would partner with tech company Oracle and retailer Walmart and that would get the blessing of the Chinese and American governments. In the meantime, it is fighting to keep the app available in the U.S.\n\nThe ban on new downloads of TikTok, which has about 100 million users in the U.S, was delayed once by the government. A more comprehensive ban is scheduled for November, about a week after the presidential election. Judge Carl Nichols of the U.S. District Court for the District of Columbia said he would make a decision by late Sunday, leaving TikTok’s fate hanging.\n\nIn arguments to Judge Nichols, TikTok lawyer John Hall said that TikTok is more than an app but rather is a “modern day version of a town square.”\n\n“If that prohibition goes into effect at midnight, the consequences immediately are grave,’” Hall said. “It would be no different than the government locking the doors to a public forum, roping off that town square” at a time when a free exchange of ideas is necessary heading into a polarized election.\n\nHall called the ban “punitive,” noting that this is “just a blunt way to whack the company now while doing nothing to achieve the stated objective of the prohibition. “\n\nTikTok lawyers also argued that a ban on the app would stop tens of thousands of potential viewers and content creators every month and would also hurt its ability to hire new talent. In addition, Hall argued that a ban would prevent existing users from automatically receiving security updates, eroding national security.\n\nJustice Department lawyer Daniel Schwei sought to undercut TikTok lawyers’ argument, saying that Chinese companies are not purely private and are subject to intrusive laws compelling their cooperation with intelligence agencies. The Justice Department has also argued that economic regulations of this nature generally are not subject to First Amendment scrutiny. Plaintiffs can’t claim a First Amendment right in hosting TikTok itself as a platform for others’ speech because merely hosting a platform is not an exercise of the First Amendment, the Justice Department contends.\n\n“This is the most immediate national security threat,” argued Schwei. “It is a threat today. It is a risk today and therefore it deserves to be addressed today even while other things are ongoing and playing out.”\n\nSchwei also argued that TikTok lawyers failed to prove it would suffer irreparable business harm.\n\nThe Justice Department laid out its objections to TikTok’s motion for a temporary injunction in a brief under seal, but it was unsealed in redacted form to protect confidential business information.\n\nTrump set the process in motion with executive orders in August that declared TikTok and another Chinese app, WeChat, as threats to national security. The White House says the video service is a security risk because the personal information of its millions of U.S. users could be handed over to Chinese authorities.\n\nTrump has said he would approve a proposed deal in which Oracle and Walmart could initially own a combined 20% of a new U.S. entity, TikTok Global. Trump also said he could retract his approval if Oracle doesn’t have “total control.”\n\nThe two sides of the TikTok deal have also appeared at odds over the corporate structure of TikTok Global. ByteDance said last week that it will still own 80% of the U.S. entity after a financing round. Oracle, meanwhile, put out a statement saying that Americans “will be the majority and ByteDance will have no ownership in TikTok Global.”\n\nChinese media have criticized the deal as bullying and extortion, suggesting that the Chinese government is not happy with the arrangement. ByteDance said Thursday it has applied for a Chinese technology export license after Beijing tightened control over exports last month in an effort to gain leverage over Washington’s attempt to force an outright sale of TikTok to U.S. owners.\n\nhttps://apnews.com/article/archive-donald-trump-ad614fb615efe904057a1911985bb108?utm_medium=AP&amp;utm_campaign=SocialFlow&amp;utm_source=Twitter",
        "subreddit": "stocks",
        "title": "Federal judge postpones Trump ban on popular app TikTok",
        "url": "https://www.reddit.com/r/stocks/comments/j12giu/federal_judge_postpones_trump_ban_on_popular_app/",
        "created": 1601283214.0
    },
    {
        "author": "CMShortboy",
        "created_utc": 1600052509,
        "id": "iscow0",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "With the acquisition of Tiktok, what's your play? Is it worth the buy, because it's Tiktok? Or, should we be super skeptical about this, because of all the privacy issues and whatnot? Are you buying Oracle?",
        "subreddit": "stocks",
        "title": "Is Oracle a buy?",
        "url": "https://www.reddit.com/r/stocks/comments/iscow0/is_oracle_a_buy/",
        "created": 1600081309.0
    },
    {
        "author": "htotheizzostocks",
        "created_utc": 1600206625,
        "id": "itiiug",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "Thank you WSB for some of the tips I am almost back to where I started. Had 70k, ran it up to 146k, down to 14k then back up to 20k! Let's go!! Almost there\n\n**Positions: PTON 81.5 9/25, ORCL 60.5 9/25, WMT 138 9/25**\n\nhttps://preview.redd.it/wmj39iqxtdn51.png?width=719&amp;format=png&amp;auto=webp&amp;s=25d28d853eb413f0963d16109c0198520a4adb5c",
        "subreddit": "wallstreetbets",
        "title": "Almost back to where I started, thank you WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itiiug/almost_back_to_where_i_started_thank_you_wsb/",
        "created": 1600235425.0
    },
    {
        "author": "81Gdummy",
        "created_utc": 1600092299,
        "id": "islhdq",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "It seems at market open oracle stock was halted. Perhaps this is in preparation for a major announcement? Any idea what it may be or alternative reason why it hasn’t been trading?",
        "subreddit": "wallstreetbets",
        "title": "Oracle trading halted",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/islhdq/oracle_trading_halted/",
        "created": 1600121099.0
    },
    {
        "author": "moaimaea",
        "created_utc": 1600100599,
        "id": "iso7dg",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Oracle Corp. ORCL +5.49% won the bidding for the U.S. operations of the video-sharing app TikTok, people familiar with the matter said, beating out Microsoft Corp. MSFT +1.90% in a high-profile deal to salvage a social-media sensation that has been caught in the middle of a geopolitical standoff.\n\nOracle is set to be announced as TikTok’s “trusted tech partner” in the U.S., and the deal is likely not to be structured as an outright sale, the people said.\n\nThe next step is for the White House and the Committee on Foreign Investment in the U.S. to approve the deal, said one of the people, adding that the participants believe it satisfies the concerns around data security that have been previously raised by the U.S. government.\n\nOn Monday, Treasury Secretary Steven Mnuchin confirmed that his office received a bid proposal from Oracle for TikTok’s operations over the weekend and said that the Treasury-led Committee on Foreign Investment in the U.S. would review it this week.\n\n“We will be reviewing that at the CFIUS committee this week and then will be making a recommendation to the president and reviewing it with him,” Mr. Mnuchin said on CNBC. “From our standpoint, we’ll need to make sure that the code is, one, secure, Americans’ data is secure, that the phones are secure and we’ll be looking to have discussions with Oracle over the next few days with our technical teams.”\n\nMr. Mnuchin also said the Oracle deal includes a commitment to establish TikTok as a global company headquartered in the U.S., which he said would mean 20,000 new jobs.\n\nThe Treasury secretary said he wouldn’t go into all the details of the plan, but clarified that the deadline for the sale of TikTok’s U.S. operations is Sept. 20.\n\nThe move by TikTok’s parent company, Beijing-based ByteDance Ltd., comes days after the Chinese government threw negotiations into doubt when it issued new export restrictions late last month on the kind of artificial intelligence technology TikTok uses. The algorithms, which determine the videos served to users and are seen as TikTok’s secret sauce, were considered part of the deal negotiations up until the Chinese policy change raising questions among the parties involved in negotiations over how to value the social-media business.\n\nThe structure of Oracle’s deal wasn’t immediately known, including whether it includes transfer of the algorithms.\n\nTwo people familiar with the Oracle deal said it was more appropriate to call it a partnership, rather than an acquisition, suggesting that there wasn’t an exchange of significant assets. At least some of ByteDance’s existing investors, including U.S. investment firms Sequoia Capital and General Atlantic, will get stakes in the venture as part of the deal, said people familiar with the matter.\n\nThe possibility that a deal might not involve an outright sale was previously reported by The Wall Street Journal.\n\nPresident Trump has said repeatedly that he would shut down TikTok in the U.S. if it isn’t sold to an American company. In an Aug. 6 executive order, the White House gave ByteDance a 45-day deadline before it would ban the app, which the Trump administration says poses an economic and national-security threat to U.S. interests, if it isn’t sold to a U.S. buyer.\n\nMicrosoft, which had teamed up with Walmart Inc., earlier Sunday said in a statement that it was notified earlier in the day of the decision by ByteDance.\n\n“We are confident our proposal would have been good for TikTok’s users, while protecting national security interests,” the statement said. “To do this, we would have made significant changes to ensure the service met the highest standards for security, privacy, online safety, and combatting disinformation, and we made these principles clear in our August statement.”\n\nDOES ORACLE’S WINNING BID AVERT A BAN?\n\nA look at the state of play for the video app’s ownership and the prospects for a deal.\n\nIn a statement late Sunday, Walmart suggested it is considering joining the Oracle group, saying it is continuing “discussions with ByteDance leadership and other interested parties.”\n\nWhile China’s recently announced trade restrictions made acquiring TikTok’s algorithm tricky, Microsoft remained committed to acquiring the app’s powerful suggestion algorithms, said a person familiar with the matter. Without outright purchase of the algorithms, Microsoft wouldn’t be able to follow through with its stated commitment to national security issues.\n\nOracle’s interest in TikTok is primarily driven by kick-starting its fledgling cloud-computing business, which remains far behind market leaders Amazon.com Inc. and Microsoft, people familiar with the matter said.\n\nMicrosoft’s plans were more ambitious than Oracle, said one person. Owning TikTok would help Microsoft have more presence among everyday consumers, an area it had mostly abandoned to chase after corporate users with the exception of its Xbox gaming business. TikTok would also give Microsoft a treasure trove of data on young and mostly female users, an area it doesn’t have much insight into now.\n\nThe New York Times reported earlier that Microsoft had been notified of the ByteDance decision.\n\nTikTok has soared to around 100 million monthly users in the U.S., from about 11 million in early 2018, and they are considered among the most lucrative in the app’s global user base of about 689 million, though the app still loses money.\n\nOracle wasn’t as obvious a winner in the race for TikTok as Microsoft. While both tech companies have sizable cloud-computing operations and technical capabilities, Oracle is mainly focused on serving business clients and has virtually no experience running a social-media platform or other major consumer-facing business. Microsoft is an even bigger player in business computing but also owns the LinkedIn social-media site and the Xbox videogame business. It also is a much bigger company and has about $136 billion of cash, some three times what Oracle has on hand.",
        "subreddit": "investing",
        "title": "Oracle wins race to bottom to acquire TikTok US Operations as “trusted partner”",
        "url": "https://www.reddit.com/r/investing/comments/iso7dg/oracle_wins_race_to_bottom_to_acquire_tiktok_us/",
        "created": 1600129399.0
    },
    {
        "author": "Fictional-adult",
        "created_utc": 1600537101,
        "id": "ivx0s7",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Every bit of DD on WSB is a three piece tendies from Popeyes ready to go. Some people will say there's a lot of bad DD. Those people are idiots. Every single piece of DD that hits the front page of this forum is great... for about 20 minutes. \n\nIs VALE going to print a buffet of tendies? Maybe. The thesis seems solid, but at the end of the day nobody really knows. Not me, not you, not the guy who posted it. But do you know what I can tell you? My calls purchased 15 minutes after that post hit sold for 40% profit the next morning.\n\nI got burned hard on JAMF by actually believing in one of these idiots and holding, but do you know what my calls were worth the day after I bought them? 80% more than I paid. I watched plenty of idiots do the same things with PRPL, waiting for the promised buffet of tendies while holding a perfectly good to go order.\n\nThe same was true for every single flop in this subs history. If you don't know a fucking thing about the company, buy it when the DD is fresh, unload it the next day. Don't be the smooth brained idiot buying it day two. Definitely don't be the idiot who holds out for the promised buffet. \n\nGet in early, and take your to go order home. Also in case this post gets traction, I need some help offloading my Tiktok gamble Monday without my asshole bleeding. Thanks.\n\nORCL 10/16 $65c",
        "subreddit": "wallstreetbets",
        "title": "Understanding DD posts: Why you're the idiot who keeps getting burned",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivx0s7/understanding_dd_posts_why_youre_the_idiot_who/",
        "created": 1600565901.0
    },
    {
        "author": "Ace_JayL",
        "created_utc": 1600050467,
        "id": "isc5xe",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "So would the smart thing to do for a stock I know is going to go up like Oracle probably will because of the TikTok deal, should I buy shares as soon as premarket opens or should I wait till the market actually opens?",
        "subreddit": "stocks",
        "title": "Oracle Pre-Market Trading",
        "url": "https://www.reddit.com/r/stocks/comments/isc5xe/oracle_premarket_trading/",
        "created": 1600079267.0
    },
    {
        "author": "AxlToTheMaxl",
        "created_utc": 1600362566,
        "id": "iunr05",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Hey all,\n\nI'm sure some of it is sympathy for SBE's sudden news, by APXT is on pace for 1,000,000 volume today, which is not intriguing, and could point to someone knowing something.\n\nFYI I have a small stake around 450 shares, so I'm not unbiased, I worked adjacent to APXT chief Jeffrey Epstein (yes, that's his name) when he was an Oracle guy, and felt as if he was a bright guy.",
        "subreddit": "SPACs",
        "title": "Weird APXT Volume today",
        "url": "https://www.reddit.com/r/SPACs/comments/iunr05/weird_apxt_volume_today/",
        "created": 1600391366.0
    },
    {
        "author": "746J",
        "created_utc": 1600043095,
        "id": "isa7n0",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "With Microsoft and Walmart failing to secure the contract with Tik Tok, are you guys going to be buying puts on Microsoft and/or Walmart or buying calls on Oracle . I’m curious to see where people’s heads are at in this situation.",
        "subreddit": "stocks",
        "title": "Puts on Microsoft?",
        "url": "https://www.reddit.com/r/stocks/comments/isa7n0/puts_on_microsoft/",
        "created": 1600071895.0
    },
    {
        "author": "jarvisjg",
        "created_utc": 1600554589,
        "id": "iw24ez",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Trump gave his blessing on Tiktok/ ORCL/ WMT deal sat afternoon. China left to approve... Will they sugn off? And will my ORCL print on Monday?\n\nHere is what he said:\n\n\"I have given the deal my blessing — if they get it done that's great, if they don't that's okay too,\" Trump told reporters on the White House South Lawn before departing for North Carolina. \"I approved the deal in concept.\"",
        "subreddit": "wallstreetbets",
        "title": "ORCL / WMT WILL GO BRRRRRR ON MONDAY?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iw24ez/orcl_wmt_will_go_brrrrrr_on_monday/",
        "created": 1600583389.0
    },
    {
        "author": "earnings_call",
        "created_utc": 1599798108,
        "id": "iqjozo",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "These are all daily momentum trade ideas that could be entered at market open and closed same day. \n\n- ORCL: “Oracle shares rose as much as 6% in extended trading on Thursday after the software maker reported fiscal first-quarter earnings and quarterly guidance that were better than analysts had expected” [CNBC]. I’m looking at short-term weekly or potentially even daily calls that could be entered at market open as an earnings continuation play if the overall market is trending upwards.\n\n- PTON: “Peloton crushes estimates as sales surge 172%, expects strong demand to continue into 2021. With such strong demand for its bike and treadmill, it said it doesn’t expect to return to “normalized order-to-delivery windows” in the U.S. before the end of the fiscal second quarter” [CNBC]. I suggested this as an earnings run-up play and we could now potentially play this similar to ORCL as mentioned above. Slightly OTM weekly calls at market open if the overall market sentiment is positive might be a viable option. These could be sold as early as end of day tomorrow.\n\n- AAPL: Apple continued to sell-off today after yesterday bounce-back and has established itself as the QQQ momentum leader over the last days. Short-term calls or puts depending on market sentiment at open might be a viable trade.\n\n- NKLA: Nikola might be the most overvalued company with a market cap &gt; $10B in the US market. I am expecting yesterday’s sell-off to continue and I am looking at short-term OTM puts &gt;$30 that could be flipped before market close. Catalyst: “Nikola: How to Parlay An Ocean of Lies Into a Partnership With the Largest Auto OEM in America”.\n\nHave a successful Friday :) \n\nAll my thoughts here daily (free): https://options.substack.com",
        "subreddit": "wallstreetbets",
        "title": "PTON, ORCL, AAPL, NKLA continuation plays...expecting a lot of movement",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqjozo/pton_orcl_aapl_nkla_continuation_playsexpecting_a/",
        "created": 1599826908.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1599686186,
        "id": "ippdmi",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, September 9, 2020**\n\nStocks shot up today and recovered some losses after sharp declines in big tech stocks. After several red days, shares of Amazon (AAPL), Apple (AAPL), Microsoft (MSFT) and other big companies rallied. On a sour note, reopening stocks (travel, cruise lines, airlines, hotels, etc) were down after AstraZeneca (AZN) announced it had its COVID-19 vaccine trial paused.\n\nThe S&amp;P finished 2.08% up, the Nasdaq was 2.92%, leading the day, and the Dow finished 1.68% up. The volatility index (VIX) was down 4.8%, indicating increased risk appetite in traders.\n\nToday, it was announced that AstraZeneca, a forerunner in the development of the COVID vaccine announced a pause of their experimental trial after one patient became more ill, pledging to make safety a priority and take the time necessary to let science prevail. This setback comes in stark contrast to politicians and governments who seem to imply a cure is just around the corner. Shares of AstraZeneca sank 2%, while those of companies competing to develop a Covid-19 vaccine including Moderna (MRNA) and Novavax (NVAX) rose.\n\nUS oil prices plunged nearly 7% today, after Saudi Aramco, the largest oil producer in the world, announced it would be slashing its selling price to Asia and the United States, per Bloomberg. \"Oil demand globally is really sluggish. All of the low hanging fruit from the global oil recovery has already happened,\" said Michael Tran, managing director of global energy strategy at RBC Capital Markets.\n\nAsia-Us cargo rates are at the highest since March lows. For bulls evidence of a rebounding economy, for bears activity is fueled by liquidity and the shoe has yet to drop.\n\n**Highlights**\n\n* After falling nearly 20% in the week, Tesla (TSLA) stock roared back today, finishing the day 10.9% up.\n* Big Commerce (BIGC) reported earnings today. While estimates were beaten, investors were not impressed. Stock is down 10% today (4% during session (6% after-hour)  \n\n   * EPS of -$0.38 v -$0.43 estimate\n   * Revenue of 36.3 million v 35.6 million estimate\n* Facebook (FB) underperformed the market, finishing a modest 0.94% up.\n* Precious metals were up today, with gold miners ($GDX) leading, up 4.34%. Silver was up 1.58% and gold was 0.92% up.\n* McConnell announced plans to unveil the new $300B relief bill and took procedural steps needed to set up a vote \"as soon as this week.\" Schumer and Pelosi said \"Republicans bill which doesn't come close to addressing the problems and is headed nowhere\"\n* Analyst Upgrades:  \n\n   * $MSFT Microsoft had a nice boost by Morgan Stanley $MS who raised its price target from $230 to $245\n   * $PTON Peloton had Price Target raised by Wedbush from $66 to $100\n   * $RPD Rapid7 Target raised by $MS Morgan Stanley $55 to $60 (nice stock check it out)\n   * $SFIX Stitch Fix initiated by Deutsche Bank at BUY with pt $34\n   * $SPCE Virgin Galactic Upgraded by Credit Suisse from $22 to $24 and NEUTRAL to OUTPERFORM.\n\nNotable Earnings for Tomorrow Thur Sept 10: Chewy CHWY (AH), Dave &amp; Busters PLAY (AH), Oracle ORCL (AH), Peloton PTON (AH)\n\nInteresting recent CEO purchase transactions: CWH $3MM, VST $750k, BKR $1MM, FRG $4.5MM, IVZ $3MM, SDC $10MM, PLAG $1.7MM",
        "subreddit": "stocks",
        "title": "Market Recap for today Wed Sept 9 - Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/ippdmi/market_recap_for_today_wed_sept_9_please_enjoy/",
        "created": 1599714986.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600461075,
        "id": "ivdycc",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - September 18, 2020**\n\nStocks dropped again today, closing out a volatile week on a sour note. Tech stocks continued pulling back, with many notable stocks breaking through well-established supports. In spite of the Fed’s commitment to keep interest rates low until 2023 and mostly positive economic data, the sell off in tech, which is the largest holding in the three major benchmarks, has dragged the market down. \n\nThis week, tech stocks like Apple (AMZN), Amazon (AMZN), Facebook (FB), Microsoft (MSFT), and Alphabet (GOOG, GOOGL) have declined sharply after hitting consecutive record highs in August. The tech-heavy Nasdaq is the hardest hit, with prices at similar levels to early August. The S&amp;P finished the day 1.12% down, the Nasdaq 1.28% down, the Dow was 0.87% down.\n\nAfter a historic August led by tech stocks, the current volatility in the market has sharply lowered investor sentiment and belief in the prospect of a sharp recovery for the virus-ravaged economy.The still raging pandemic, combined with no fiscal stimulus from Congress, has economists lowering expectations for the remainder of the year. In a note to clients today, Goldman Sachs (GS) said, “At this point, a major stimulus package before the election looks like a long shot and we expect Congress to leave at the end of September without extending the extra unemployment insurance payment, approving another round of stimulus payments, or providing additional support to small businesses or state and local governments. Failure to pass any additional fiscal measures would likely lead us to downgrade our growth estimates for Q4”\n\nEconomic data has been surprisingly good in spite of the circumstances. 860,000 people filed unemployment claims, while that’s a lot normally, it has been less than 1 million for the third week straight. Continuing Claims, which are the number of people filing for unemployment benefits who have already filed an initial claim, fell below 13 million for the first time since March highs, an encouraging sign. \n\nConfidence in the market, right now, is dependent on Congress passing more fiscal stimulus. Top FOMC officials, including Jerome Powell, and Pres. Trump have publicly endorsed the passage of more fiscal stimulus. Economists and politicians agree that more stimulus is needed to boost consumer confidence and provide much-needed support to cash-strapped families and small businesses. \n\n**Highlights**\n\n* United Airlines (UAL) tells Congress 16k jobs at risk without aid. - Politico\n* Walt Disney (DIS) World Swan and Dolphin Resort to Lay Off 1,100 Employees Due to Low Occupancy \n* Grow Generation (GRWG): Roth Capital maintains BUY and raises price target to $20. Disclaimer: I own this stock. It's been a beast for me, reported record quarters and beat expectations the last 10 quarters. A couple of weeks ago had a 100% return on stock trade.\n* Gilead Sciences (GILD): RBC Capital maintains OUTPERFORM and raises price target to $86\n* Moderna (MRNA) says in 8K filing it currently anticipates production of its COVID vaccine MRNA-1273 will be approx 20M doses by end of year\n* The Center for Pharmaceutical Research is moving forward with trials of a DNA vaccine developed by pharmaceutical company Inovio (INO).\n* Blink Charging Announces Acquisition of BlueLA Carsharing Expanding Affordable Electric Vehicle Accessibility For Underserved Communities Across the City of Los Angeles\n* What a crazy ride… apparently now TikTok and WeChat will be removed from the Store on Sept 20, despite recent report that a deal was agreed between Bytedance and Oracle (ORCL).\n* Salesforce (CRM) to add 12,000 jobs by next year, according to Reuters. \n* Stichfix (SFIX) had target raised by Telsey Advisory Group from $29 to $33 OUTPERFORM\n* Shopify (SHOP) reiterated by Wedbush at HOLD\n* UTZ Brands (UTZ) initiated by Citigroup (C) at BUY\n* Wix.com (WIX) Wix reiterated by Wedbush BUY",
        "subreddit": "stocks",
        "title": "Here is a Market Recap I wrote for today Sept 18, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/ivdycc/here_is_a_market_recap_i_wrote_for_today_sept_18/",
        "created": 1600489875.0
    },
    {
        "author": "db664804",
        "created_utc": 1599784696,
        "id": "iqg4db",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Oracle just released their earning and they beat the expectation by 8 %. The stock is already up 3%. What are your thoughts on this one for tomorrow? Any chance this might see 65+ in the coming weeks?",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on oracle ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqg4db/thoughts_on_oracle/",
        "created": 1599813496.0
    },
    {
        "author": "modernmarcus",
        "created_utc": 1600116832,
        "id": "istvpj",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I’m normally a buy the dip, bull team kind of guy, but I just couldn’t pass up on this. Tik Tok seems dumb and a distraction, what possible strategic value could this bring? Also Oracle makes everything shit and would they even be able to manage a trendy social network? Tell me why I’m wrong, change my mind",
        "subreddit": "wallstreetbets",
        "title": "ORCL 57.50p",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/istvpj/orcl_5750p/",
        "created": 1600145632.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1600209748,
        "id": "itjfel",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "So today being the last day of the TikTok thing not mean anything?\n\nTrump said ban fucking TikTok if they’re not bought out by September 15, 2020, isn’t that today?\n\nLike is anyone buying them?\n\nOracle is “partnering” up with them? Wtf kind of bullshit is that?\n\nMSFT no longer a bidder?\n\nWhere the fuck is Walmart in all of this?\n\nTL;DR SOMEONE GET JA! What does Ja Rule think of all this?!?!?",
        "subreddit": "wallstreetbets",
        "title": "So wtf is happening with TikTok then?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itjfel/so_wtf_is_happening_with_tiktok_then/",
        "created": 1600238548.0
    },
    {
        "author": "Comprehensive_Cell65",
        "created_utc": 1600041491,
        "id": "is9rsv",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "What is everyones thought on orcl now that seems its the one that will merge with tiktok.. long calls?",
        "subreddit": "options",
        "title": "TikTok and Orcl",
        "url": "https://www.reddit.com/r/options/comments/is9rsv/tiktok_and_orcl/",
        "created": 1600070291.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600373341,
        "id": "iurbkw",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": " **PsychoMarket Recap - Thursday, Sept 17, 2020**\n\nStocks ended sharply down in a volatile trading session, as investors and traders became more cautious following the Federal Reserve’s announcement yesterday and conflicting information and timeframes regarding a potential coronavirus vaccine.\n\nThe sell-off was led by big tech stocks, like Amazon (AMZN), Facebook (FB), and Apple (AAPL), which extended yesterday’s losses and soured overall market sentiment. It appears that after the historic rally in August and since the March bottom, traders are rethinking the prospects of a continued, sharp economic recovery in the face of no additional fiscal stimulus. The volatility this month highlights the effects this still-raging pandemic has on the economy. \n\nAnother 860,000 workers filed for unemployment claims this week, with claims remaining below 1 million for a third straight week. The number of unemployed persons also fell below 13 million, an encouraging sign for a recovering labor market.  \n\nFed officials upgraded their economic projections for this year, and now anticipate a shallower decline in real GDP and a lower unemployment rate by year-end versus their early-summer projections. Still, officials suggested that the quicker-than-expected early economic recovery could be jeopardized in absence of further fiscal stimulus. Powell said, “It will take a while to get back to the levels of economic activity and employment that prevailed at the beginning of this year, and it may take continued support from both monetary and fiscal policy to achieve that.” Again, Powell is urging Congressional lawmakers to pass additional fiscal stimulus.\n\nThe expiration of the CARES Act and enhanced unemployment benefits have left millions of Americans unemployed and without support in the middle of a pandemic. While the stock market is okay (relatively), Powell and other FOMC members have stressed the financial burden this pandemic has placed on small businesses and individuals, urging Congress to pass more fiscal stimulus. \n\nPresident Trump agrees with Powell and on Wednesday called on congressional Republicans to support a massive economic relief bill with “much higher numbers” and stimulus payments for Americans, abruptly proposing an entirely different plan from what the Senate GOP sought to advance in recent days. Trump advocated for the $1.5 trillion plan unveiled by the bipartisan house committee, the Problem Solvers Caucus.  The proposal includes a new round of $1,200 stimulus checks to individual Americans, a provision omitted from an approximately $300 billion plan Senate Republicans tried unsuccessfully to pass last week. Pres. Trump said, “I like the larger amount, I’ve said that. Some of the Republicans disagree, but I think I can convince them to go along with that because I like the larger number. I want to see people get money.”\n\nTrump’s claim yesterday that a coronavirus vaccine could be ready by November went against statements made the same day by Robert Redfield, the head of the CDC. Redfield said he does not expect a vaccine to be ‘widely available’ until the third quarter of next year. White House Chief of Staff Mark Meadows responded by saying “not sure where Dr. Redfield got his particular timetable, but it’s not based on those that are closest to the process.” In response, the WHO said, “It is important  we have consistent messaging by officials worldwide”.\n\nIn an unfortunate development, WHO officials warned that the spread of coronavirus in Europe now is worse than it was in March, near the start of the pandemic. Europe has reported 300,000 cases in one week, the highest 7-day total since the start of the pandemic. In total, Europe has reported about 4.9 million coronavirus cases and 226,524 deaths.\n\n**Highlights**\n\n* Dave &amp; Busters warned that it would go bankrupt if they could not reach an agreement with lenders. Stock was down more than 20% today.\n* Zynerba Pharmaceuticals (ZYNE) receives Orphan Drug Designation for a (CBD) Cannabidiol based treatment on the treatment of \"22q 11.2 deletion syndrome\".\n* According to reports, Oracle (ORCL) and Bytedance are planning a TikTok IPO in about a year\n* Walmart Raising Wages For About 165K Hourly Associates Across All Walmart U.S. Stores\n* Cardiff Oncology (CRDF) just reported positive data on its treatment for KRAS-Mutated metastatic colorectal cancer shares are trading 57% higher\n* Nvidia’s (NVDA) new RTX 3080 graphics card went on sale earlier today, but it seems the new GPU is already sold out. Stock has been on a tear lately, this is one to watch\n* Herman Miller (MLHR) being quite the little beast today! up 23% so far for the day on the back of those nice earnings.\n* Sorrento Therapeutics (SRNE): Received today FDA nod to proceed with phase 1 trials of STI-1499 (COVI-Guard) neutralizing antibody in COVID19 patients.\n* Chewy (CHWY) announced a public offering of $275 Million of shares of its Class A common stock. stock has been weak, down 3%\n* Moderna (MRNA) reported collaboration to develop treatment for pulmonary arterial hypertension with Chiesi Group. Furthermore, announced collaboration with Vertex[ (VRTX)](https://twitter.com/search?q=%24VRTX&amp;src=cashtag_click) to treat cystic fibrosis.\n* Penn National Gaming (PENN) target raised by Steifel Nicolaus from $47 to $85 at BUY\n* Lexin Fintech (LX): National Securities reiterated $11.80 at BUY, Credit Suisse Group reiterated $11.50 at BUY. The stock is currently at $7. This is a fintech company catering to young adults in China\n* JP Morgan (JPM):  Had target raised by Royal Bank of Canada from $99 to $110 at OUTPERFORM",
        "subreddit": "stocks",
        "title": "Here is a MArket Recap for today, Sept 17, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/iurbkw/here_is_a_market_recap_for_today_sept_17_2020/",
        "created": 1600402141.0
    },
    {
        "author": "jpowprints",
        "created_utc": 1600444721,
        "id": "iv8rlj",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "It’s happening, after weeks of rumours: https://www.cbc.ca/news/world/u-s-bans-wechat-tiktok-1.5729249\n\nThe politics of it matter less, more than the fallout. Since the ORCL-TikTok deal, and ByteDance rejecting WMT + MSFT, ORCL calls initially performed well.\n\nWith the ban, however, FB reels will pick up audience. So next week, short FB calls will perform well and ORCL puts.\n\nThoughts?",
        "subreddit": "options",
        "title": "TitTok, WeChat bans this Sunday",
        "url": "https://www.reddit.com/r/options/comments/iv8rlj/tittok_wechat_bans_this_sunday/",
        "created": 1600473521.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600461027,
        "id": "ivdxu2",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": " **PsychoMarket Recap - September 18, 2020**\n\nStocks dropped again today, closing out a volatile week on a sour note. Tech stocks continued pulling back, with many notable stocks breaking through well-established supports. In spite of the Fed’s commitment to keep interest rates low until 2023 and mostly positive economic data, the sell off in tech, which is the largest holding in the three major benchmarks, has dragged the market down. \n\nThis week, tech stocks like Apple (AMZN), Amazon (AMZN), Facebook (FB), Microsoft (MSFT), and Alphabet (GOOG, GOOGL) have declined sharply after hitting consecutive record highs in August. The tech-heavy Nasdaq is the hardest hit, with prices at similar levels to early August. The S&amp;P finished the day 1.12% down, the Nasdaq 1.28% down, the Dow was 0.87% down.\n\nAfter a historic August led by tech stocks, the current volatility in the market has sharply lowered investor sentiment and belief in the prospect of a sharp recovery for the virus-ravaged economy.The still raging pandemic, combined with no fiscal stimulus from Congress, has economists lowering expectations for the remainder of the year. In a note to clients today, Goldman Sachs (GS) said, “At this point, a major stimulus package before the election looks like a long shot and we expect Congress to leave at the end of September without extending the extra unemployment insurance payment, approving another round of stimulus payments, or providing additional support to small businesses or state and local governments. Failure to pass any additional fiscal measures would likely lead us to downgrade our growth estimates for Q4”\n\nEconomic data has been surprisingly good in spite of the circumstances. 860,000 people filed unemployment claims, while that’s a lot normally, it has been less than 1 million for the third week straight. Continuing Claims, which are the number of people filing for unemployment benefits who have already filed an initial claim, fell below 13 million for the first time since March highs, an encouraging sign. \n\nConfidence in the market, right now, is dependent on Congress passing more fiscal stimulus. Top FOMC officials, including Jerome Powell, and Pres. Trump have publicly endorsed the passage of more fiscal stimulus. Economists and politicians agree that more stimulus is needed to boost consumer confidence and provide much-needed support to cash-strapped families and small businesses. \n\n**Highlights**\n\n* United Airlines (UAL) tells Congress 16k jobs at risk without aid. - Politico\n* Walt Disney (DIS) World Swan and Dolphin Resort to Lay Off 1,100 Employees Due to Low Occupancy \n* Grow Generation (GRWG): Roth Capital maintains BUY and raises price target to $20. Disclaimer: I own this stock. It's been a beast for me, reported record quarters and beat expectations the last 10 quarters. A couple of weeks ago had a 100% return on stock trade.\n* Gilead Sciences (GILD): RBC Capital maintains OUTPERFORM and raises price target to $86\n* Moderna (MRNA) says in 8K filing it currently anticipates production of its COVID vaccine MRNA-1273 will be approx 20M doses by end of year\n* The Center for Pharmaceutical Research is moving forward with trials of a DNA vaccine developed by pharmaceutical company Inovio (INO).\n* Blink Charging Announces Acquisition of BlueLA Carsharing Expanding Affordable Electric Vehicle Accessibility For Underserved Communities Across the City of Los Angeles\n* What a crazy ride… apparently now TikTok and WeChat will be removed from the Store on Sept 20, despite recent report that a deal was agreed between Bytedance and Oracle (ORCL).\n* Salesforce (CRM) to add 12,000 jobs by next year, according to Reuters. \n* Stichfix (SFIX) had target raised by Telsey Advisory Group from $29 to $33 OUTPERFORM\n* Shopify (SHOP) reiterated by Wedbush at HOLD\n* UTZ Brands (UTZ) initiated by Citigroup (C) at BUY\n* Wix.com (WIX) Wix reiterated by Wedbush BUY",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Sept 18, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/ivdxu2/here_is_a_market_recap_for_today_sept_18_2020/",
        "created": 1600489827.0
    },
    {
        "author": "InTheGreen303",
        "created_utc": 1600356701,
        "id": "iulrh4",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "According to Bloomberg radio, Oracle and bytedance agree on amended terms pushed by the Secretary of Treasury Mnuchin. While the exact details of the amended terms were not revealed, it is a positive headline and looks more and more like the deal could get done by Friday.",
        "subreddit": "wallstreetbets",
        "title": "Oracle and bytedance agree to amended terms pushed by Sec. of Treasury Mnuchin",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iulrh4/oracle_and_bytedance_agree_to_amended_terms/",
        "created": 1600385501.0
    },
    {
        "author": "Neehous",
        "created_utc": 1599595039,
        "id": "ip0uu7",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": " What’s up idiots. \n\nRecently the selloff has fucked every bull sideways, but to be fair this correction was overdue. This does not mean the party stops, though .. we just needed a quick break. \n\nWhat’s the play to take us to the moon? MSFT Calls and ORCL lottos to hedge. \n\nTwo reasons:\n\n1. The election. Presidential debates are slated to start soon, and the election is creeping up. Trump’s hallmark has been a strong stock market. There is no way he does not pump the markets soon. In fact, we are already seeing signs of this with Trump floating the idea of a second stimulus ***yesterday*** ([https://www.foxbusiness.com/money/trump-leftover-coronavirus-relief-second-stimulus-check)](https://www.foxbusiness.com/money/trump-leftover-coronavirus-relief-second-stimulus-check))\n\n2. TikTok catalyst. Given the recent selloff, I don’t think news is being properly priced in. Don’t just listen to me on this: “Mr. Mayer, a former Disney executive who had announced he was joining TikTok in May, said[ he was resigning](https://www.nytimes.com/2020/08/27/technology/tiktok-kevin-mayer-resign.html) because he had signed on for a global role, not to run a carved-up version of the company. In a note to employees, he also indicated that a deal for TikTok might be close. “We expect to reach a resolution very soon.”” The same article continues:  Dan Ives, an analyst at Wedbush Securities, said in a note to investors that “the participation of Walmart was likely “the final piece of the puzzle that ultimately cements Microsoft successfully acquiring TikTok’s U.S. operations for likely $35 billion to $40billion.” ([https://www.nytimes.com/2020/08/27/technology/walmart-tiktok-deal.html](https://www.nytimes.com/2020/08/27/technology/walmart-tiktok-deal.html))\n\nThis catalyst is obviously a huge trigger for a potential reversal. Beyond this, the fed has basically been signaling for us to hold assets, so a reversal of current trends is essentially inevitable.\n\n**Positions: MSFT 220c 10/16, ORCL 60c 9/25 (to hedge)**\n\nTo the moon brethren",
        "subreddit": "wallstreetbets",
        "title": "[DD] MSFT &amp; ORCL -- fly me to the moon, let me play among the stars",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ip0uu7/dd_msft_orcl_fly_me_to_the_moon_let_me_play_among/",
        "created": 1599623839.0
    },
    {
        "author": "ShadeSlayxr",
        "created_utc": 1600103206,
        "id": "isp472",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Guys.\n\nI've figured it out.\nI've been statistically calculating if I'm actually a Genius or a simply an autist. I know that when you predict a short term call or put, the adrenaline rush must be absolutely insane. I can feel it when I close my eyes picturing myself rolling in my millions. \n\nNow, when it comes to determining whether I'm a genius or a an autist, here's what I've statistically concluded - I'm actually both. \n\nIn 50 \"predictions\" I've been right about my outlook (if I'm half right, I round UP) 74% of the time. I started off with some rough ones but over time I'm getting better and from each mistake I make, I learn something I didn't know before. I will say that when I'm wrong, I'm VERY wrong. So that means ~ 1/3 times I should do the COMPLETE opposite of what I want to do to make up for this mathematical error. \n\nAnd remember boys. It is EINSTEIN who questioned, \"the one question that drives me hazy -- is it ME, or the others that are crazy?\". \n\nTSLA Puts \nOracle Calls \nGNUS CALLS \n\n(see what I did there?) \n\nP. S. TSLA won't push through 10% today (if it does, NO WAY past 11), and tomorrow it's going to do down atleast 2-3% throughout the day.",
        "subreddit": "wallstreetbets",
        "title": "I've figured it out boys",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/isp472/ive_figured_it_out_boys/",
        "created": 1600132006.0
    },
    {
        "author": "water_boat",
        "created_utc": 1600185192,
        "id": "itbi49",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "MSFT’s tiktok acquisition rumor made it grow more than 100b, but after its rejection, thus, making ORCL the next runner up, ORCL has only seen like 15b growth. Sure ORCL might get rejected like MSFT, but the upside, being, the acquisition of tiktok is bigly. If ORCL does in fact acquire tiktok US ops, I expect it to at least go to $80 pps. That being said, I think the calls at this price are really worth it. Obviously, don’t all-in since we don’t know how the deal is going to go through but the decision will be made very soon. Let’s try seeing this through.\n\nORCL 61c 05/25",
        "subreddit": "wallstreetbets",
        "title": "Why is ORCL so cheap right now?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itbi49/why_is_orcl_so_cheap_right_now/",
        "created": 1600213992.0
    },
    {
        "author": "moaimaea",
        "created_utc": 1600100731,
        "id": "iso96d",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Oracle Corp. ORCL +5.49% won the bidding for the U.S. operations of the video-sharing app TikTok, people familiar with the matter said, beating out Microsoft Corp. MSFT +1.90% in a high-profile deal to salvage a social-media sensation that has been caught in the middle of a geopolitical standoff.\n\nOracle is set to be announced as TikTok’s “trusted tech partner” in the U.S., and the deal is likely not to be structured as an outright sale, the people said.\n\nThe next step is for the White House and the Committee on Foreign Investment in the U.S. to approve the deal, said one of the people, adding that the participants believe it satisfies the concerns around data security that have been previously raised by the U.S. government.\n\nOn Monday, Treasury Secretary Steven Mnuchin confirmed that his office received a bid proposal from Oracle for TikTok’s operations over the weekend and said that the Treasury-led Committee on Foreign Investment in the U.S. would review it this week.\n\n“We will be reviewing that at the CFIUS committee this week and then will be making a recommendation to the president and reviewing it with him,” Mr. Mnuchin said on CNBC. “From our standpoint, we’ll need to make sure that the code is, one, secure, Americans’ data is secure, that the phones are secure and we’ll be looking to have discussions with Oracle over the next few days with our technical teams.”\n\nMr. Mnuchin also said the Oracle deal includes a commitment to establish TikTok as a global company headquartered in the U.S., which he said would mean 20,000 new jobs.\n\nThe Treasury secretary said he wouldn’t go into all the details of the plan, but clarified that the deadline for the sale of TikTok’s U.S. operations is Sept. 20.\n\nMORE ON TIKTOK’S BUSINESS\n\nThe move by TikTok’s parent company, Beijing-based ByteDance Ltd., comes days after the Chinese government threw negotiations into doubt when it issued new export restrictions late last month on the kind of artificial intelligence technology TikTok uses. The algorithms, which determine the videos served to users and are seen as TikTok’s secret sauce, were considered part of the deal negotiations up until the Chinese policy change raising questions among the parties involved in negotiations over how to value the social-media business.\n\nThe structure of Oracle’s deal wasn’t immediately known, including whether it includes transfer of the algorithms.\n\nTwo people familiar with the Oracle deal said it was more appropriate to call it a partnership, rather than an acquisition, suggesting that there wasn’t an exchange of significant assets. At least some of ByteDance’s existing investors, including U.S. investment firms Sequoia Capital and General Atlantic, will get stakes in the venture as part of the deal, said people familiar with the matter.\n\nThe possibility that a deal might not involve an outright sale was previously reported by The Wall Street Journal.\n\nPresident Trump has said repeatedly that he would shut down TikTok in the U.S. if it isn’t sold to an American company. In an Aug. 6 executive order, the White House gave ByteDance a 45-day deadline before it would ban the app, which the Trump administration says poses an economic and national-security threat to U.S. interests, if it isn’t sold to a U.S. buyer.\n\nMicrosoft, which had teamed up with Walmart Inc., earlier Sunday said in a statement that it was notified earlier in the day of the decision by ByteDance.\n\n“We are confident our proposal would have been good for TikTok’s users, while protecting national security interests,” the statement said. “To do this, we would have made significant changes to ensure the service met the highest standards for security, privacy, online safety, and combatting disinformation, and we made these principles clear in our August statement.”\n\nDOES ORACLE’S WINNING BID AVERT A BAN?\n\nA look at the state of play for the video app’s ownership and the prospects for a deal.\n\nIn a statement late Sunday, Walmart suggested it is considering joining the Oracle group, saying it is continuing “discussions with ByteDance leadership and other interested parties.”\n\nWhile China’s recently announced trade restrictions made acquiring TikTok’s algorithm tricky, Microsoft remained committed to acquiring the app’s powerful suggestion algorithms, said a person familiar with the matter. Without outright purchase of the algorithms, Microsoft wouldn’t be able to follow through with its stated commitment to national security issues.\n\nOracle’s interest in TikTok is primarily driven by kick-starting its fledgling cloud-computing business, which remains far behind market leaders Amazon.com Inc. and Microsoft, people familiar with the matter said.\n\nMicrosoft’s plans were more ambitious than Oracle, said one person. Owning TikTok would help Microsoft have more presence among everyday consumers, an area it had mostly abandoned to chase after corporate users with the exception of its Xbox gaming business. TikTok would also give Microsoft a treasure trove of data on young and mostly female users, an area it doesn’t have much insight into now.\n\nThe New York Times reported earlier that Microsoft had been notified of the ByteDance decision.\n\nTikTok has soared to around 100 million monthly users in the U.S., from about 11 million in early 2018, and they are considered among the most lucrative in the app’s global user base of about 689 million, though the app still loses money.\n\nOracle wasn’t as obvious a winner in the race for TikTok as Microsoft. While both tech companies have sizable cloud-computing operations and technical capabilities, Oracle is mainly focused on serving business clients and has virtually no experience running a social-media platform or other major consumer-facing business. Microsoft is an even bigger player in business computing but also owns the LinkedIn social-media site and the Xbox videogame business. It also is a much bigger company and has about $136 billion of cash, some three times what Oracle has on hand.",
        "subreddit": "wallstreetbets",
        "title": "Oracle Wins Race to Bottom to Acquire TikTok US operations",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iso96d/oracle_wins_race_to_bottom_to_acquire_tiktok_us/",
        "created": 1600129531.0
    },
    {
        "author": "joeskunk",
        "created_utc": 1600224153,
        "id": "itn769",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "ORCL has this in bag. And plenty of folks are getting their beak wet - ORCL, WMT, and whoever owns the HQ real estate TikTok is buying in the US. So it's going through.\n\nNaive interpretation is it's priced in already. Deal was announced a few days ago. And no one is biting because consensus among experienced traders is ORCL is shit. \n\nThe thing is the TikTok deal is Trumps baby - not only that, his only clear cut V with China in forever. So Trump will be running laps with this one. Pounding the podium talking about how great ORCL is - and how this is the best deal america has made - maybe better than the Louisiana purchase. \n\nWhen that happens - everyone tuned into Fox is gonna hit buy.\n\nAnd once a tech stock has momentum - even the experienced traders get FOMO. Now the story is what if ORCL has similar arrangements for other China companies. And what a stud Larry is. And so on. \n\nI say it in advance - all the shit talk about how its not a buyout does not matter - I don't care if ORCL would even lose money from the deal. \n\nWhat matters is how Trump is gonna pitch it to the public.\n\nCalls on ORCL.",
        "subreddit": "wallstreetbets",
        "title": "ORCL - Catalyst is Trump",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itn769/orcl_catalyst_is_trump/",
        "created": 1600252953.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1600115739,
        "id": "istiiq",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": " **PyschoMarket Recap - Monday, September 14, 2020**\n\nStocks rose Monday as investors eyes newly announced mergers &amp; acquisitions, positive vaccine news, and a lowering coronavirus infection rate in hotspot states. Tech shares appear to be recovering, opening the day high before paring gains to finish mostly even.\n\nToday it was announced Oracle (ORCL) made a deal with TikTok parent company ByteDance to become the company’s “trusted technology provider.” The new deal between TikTok and Oracle comes after Microsoft Corporation (MSFT) said Sunday that ByteDance had rejected its buyout offer. National Security Concerns: On Monday, U.S. Treasury Secretary Steven Mnuchin said he will be reviewing the proposed deal between ByteDance and Oracle this week. “I will just say from our standpoint, we’ll need to make sure that the code is, one, secure, Americans’ data is secure, that the phones are secure and we’ll be looking to have discussions with Oracle over the next few days with our technical teams,” Mnuchin said.\n\nElsewhere, NVIDIA (NVDA) announced it was purchasing Arm, semiconductor and software design company from SoftBank Group for $40 billion, the largest ever M&amp;A in the semiconductor industry. Jensen Huang, the CEO of NVIDIA, said “ Uniting NVIDIA’s AI computing capabilities with the vast ecosystem of Arm’s CPU, we can advance computing from the cloud, smartphones, PCs, self-driving cars and robotics, to edge IoT, and expand AI computing to every corner of the globe. \n\nGilead (GILD) announced it was acquiring biotech company Immunomedics (IMMU) for $21 billion. Immunomedics developed Trodelvy, an antibody-drug conjugate used to treat triple-negative breast cancer. Trodelvy received FDA approval in April and recorded $20 million in sales in its first two months on the market. Shares of GILD were up 2.22% and IMMU finished 97% up.\n\nAstraZeneca (AZN) announced over the weekend that its late-stage Covid-19 vaccine trials with the University of Oxford resumed after safety concerns over a suspected adverse reaction from a participant made the company pause trials temporarily last week. Shares rose 0.52% today. \n\nAndrew Cuomo reported today, “Of the 63,358 tests reported yesterday, 583 were positive (0.92% of total). Total hospitalizations are at 464. Sadly, there were 4 COVID fatalities yesterday.” The numbers in New York have been steadily decreasing, according to a chart accompanying the statement.\n\n**Highlights**\n\n* DraftKings (DKNG) says it entered into a multi-year agreement with ESPN to become a co-exclusive sportsbook link-out provider and exclusive daily fantasy sports provider of the media giant. DKNG finished the day 17.27% up.\n* Nikola (NKLA), recently published their response to the fraud allegations being levied at the company and its founder, Trevor Milton.\n* NFL Media and DISH Network (DISH) have reached an agreement on a new multi-year contract for NFL Network and NFL RedZone.\n* Snowflake (SNOW) lifts IPO price to $100-110 range. IPO date expected Wednesday. Keep a close eye out!\n* Overstock (OSTK) coverage initiated by Needham &amp; Company Llc. $96 at BUY (implies a 20% upside). \n* Penn International Gaming (PENN) reiterated by Goldman Sachs $66 BUY\n* Micron Technology (MU) upgraded by[ ](https://twitter.com/search?q=%24GS&amp;src=cashtag_click)Goldman Sachs (GS) $58 NEUTRAL to BUY.\n* Apple (AAPL) reiterated by Oppenheimer at BUY $125\n* \\-Adobe (ADBE) Target Raised by Morgan Stanley (MS) $450 to $560 OVERWEIGHT",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today, Sept 14. Enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/istiiq/here_is_a_market_recap_for_today_sept_14_enjoy/",
        "created": 1600144539.0
    },
    {
        "author": "n0r4grets",
        "created_utc": 1600662060,
        "id": "iwtez3",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "ByteDance says it will not transfer algorithm and technology to Oracle as part of TikTok deal\n\n&amp;#x200B;\n\nIts when you approve a deal that's missing the key component for which you started the deal in the first place lol \n\n&amp;#x200B;\n\nRIP ORACLE AND WMT CALL HOLDERS\n\n&amp;#x200B;\n\nPOS: 09/25 $450c TSLA \n\n&amp;#x200B;\n\nP.S. FCK MILTON AND NKLA LOLOL",
        "subreddit": "wallstreetbets",
        "title": "\"The Art of the Deal\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iwtez3/the_art_of_the_deal/",
        "created": 1600690860.0
    },
    {
        "author": "undefinednullzero",
        "created_utc": 1600115161,
        "id": "istbc9",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I was so curious and saw the price were increasing before the opening bell and invested in them. But the stock later consolidated after opening at a higher price. Bought ORCL, because of the tiktok and NVDA because of ARM acquisition.",
        "subreddit": "stocks",
        "title": "TIL: Never ever buy the stocks before opening call",
        "url": "https://www.reddit.com/r/stocks/comments/istbc9/til_never_ever_buy_the_stocks_before_opening_call/",
        "created": 1600143961.0
    },
    {
        "author": "novemberblueelephant",
        "created_utc": 1600102741,
        "id": "isoyej",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "# Snowflake in 1 minute\n\nSince its founding in 2012, Snowflake has grown into a leader in the cloud data warehousing space. The company's intuitive solution makes it easy to run analytical queries with a customer-aligned billing model. Intriguingly, Snowflake has established itself without the founder-led culture that dominates most of the tech industry. Instead, three external CEOs have guided the company to a \\~$500M annual revenue run rate, with 132% year-over-year growth. That's attracted pre-IPO investment from Warren Buffett — a rare foray into tech for the Oracle of Omaha. Big winners of the listing include the secretive Sutter Hill Ventures and Altimeter Partners.\n\nSnowflake's toughest task may be in weathering the coming storm. Amazon, Microsoft, and Google all have products in the space, and with limited enduring defensibility, the company could see its position pressured.\n\n&amp;#x200B;\n\nFull analysis (free): [https://thegeneralist.substack.com/p/the-s-1-club-snowflake-and-the-data](https://thegeneralist.substack.com/p/the-s-1-club-snowflake-and-the-data)",
        "subreddit": "stocks",
        "title": "Rundown on $SNOW",
        "url": "https://www.reddit.com/r/stocks/comments/isoyej/rundown_on_snow/",
        "created": 1600131541.0
    },
    {
        "author": "BuzzLima",
        "created_utc": 1600363041,
        "id": "iunwy4",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": " Stocks slide day after Fed signals caution about pace of recovery\n\nWall Street is weaker in afternoon trading as Chair Powell's uncertainty over the pace of the economic recovery has weighed on sentiment in an apparent delayed reaction to yesterday's policy update and press conference from the leader of the central bank. Meanwhile, profit taking may also be playing a role following the tech-led gains on Monday and Tuesday of this week.\n\n**ECONOMIC EVENTS:** In the U.S., initial jobless claims fell 33,000 to 860,000 in the week ended September 12. Housing starts dipped 5.1% to a 1.416M pace in August. The Philly Fed index fell 2.2 points to 15.0 in September, which was weaker than expected.\n\n**TOP NEWS:** Reports flooded in about ByteDance's proposed agreement with Oracle (ORCL) over TikTok, with [CNBC reporting](https://www.cnbc.com/2020/09/17/trump-to-rule-on-tiktok-deal-in-24-36-hours-oracle-to-take-20percent-stake.html) that President Donald Trump is expected to rule on the agreement in the next 24-36 hours. CNBC's David Faber noted in his reporting that under the proposed deal, Oracle will own roughly 20% of the new entity and Walmart (WMT) will be involved in some capacity. Meanwhile, Bloomberg said that the U.S. Treasury Department sent ByteDance a revised terms sheet late yesterday and the company and Oracle have accepted it. The changes address national security concerns about the deal, according to Bloomberg.\n\nShares of AstraZeneca (AZN) were in focus after [CNN said](https://www.cnn.com/2020/09/17/health/astrazeneca-vaccine-trial-document/index.html) that an internal safety report by the company sheds light on the neurological condition suffered by one of the participants in its coronavirus vaccine clinical trial, detailing how the 37-year-old study volunteer \"experienced confirmed transverse myelitis\" after receiving her second dose of the vaccine, and was hospitalized on September 5.\" In response, AstraZeneca [disputed the report](https://twitter.com/megtirrell/status/1306594370855088128), saying it contains \"inaccuracies,\" including hte diagnosis, which is based on preliminary findings. The company added that the information shared by CNN \"was not obtained from internal documents, but rather sent to investigators and doctors running trials that should not be shared because they contain confidential patient records.\"   \n\n\nMeanwhile, Moderna (MRNA) shares were 4% lower near 1 pm ET after CEO Stephan bancel said that the company anticipates a base plan for efficacy for the first interim readout of its coronavirus vaccine data to be in November and the best case scenario plan being in October. He also said October is unlikely, but it is possible and that the worst case scenario would be in December.\n\n**MAJOR MOVERS:** Among the noteworthy gainers was Sorrento Therapeutics (SRNE), which surged 11% after it received FDA clearance to proceed with its STI-1499 trial. Also higher was Herman Miller (MLHR), which gained 34% after reporting quarterly results.\n\nAmong the notable losers was Dave &amp; Buster's (PLAY), which fell 25% after a Wall Street Journal [report ](https://www.wsj.com/articles/dave-busters-warns-of-bankruptcy-if-no-lender-deal-struck-11600292027)that the company has warned of bankruptcy potential. Also lower was Nano-X Imaging (NNOX), which declined 18% after Empire Financial Research's Whitney Tilson [said ](https://empirefinancialresearch.com/articles/nnox-is-theranos-2-0-short-report-on-lumber-liquidators-interviews-with-carson-block-and-dan-david-snowflakes-ipo-working-remotely-from-bermuda)that Citron's Andrew Left is right about Nano-X, as its \"stock is worthless.\" \n\n**INDEXES:** Near 1 pm ET, the Dow was down 211.02, or 0.75%, to 27,821.36, the Nasdaq was down 213.57, or 1.93%, to 10,836.90, and the S&amp;P 500 was down 42.69, or 1.26%, to 3,342.80.",
        "subreddit": "wallstreetbets",
        "title": "Autistic Top Stories at midday Sept 17",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iunwy4/autistic_top_stories_at_midday_sept_17/",
        "created": 1600391841.0
    },
    {
        "author": "1AFirst",
        "created_utc": 1601045384,
        "id": "izkt0h",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Greetings autists, its anon Moses here to lead you to the land of milk and tendies:\n\nWhile you fucking retards are fruitlessly chasing Tesla tendies, praying on the whims of the whales, you’re stepping right over all the little nuggets along the way. Small companies will always have more value to you “professional day traders” than any of the big name slot machine tickers. Their humble size is their biggest strength, not because they have some untapped potential to moon or they happen to be some diamond in the rough, just the opposite in fact. These companies are quite fragile, most rely on just a few clients, largely government and corporate contracts. But one wrong move, and their entire income is in jeopardy.\nTake Digital Ally (DGLY) for instance: They specialize in body cam and dash cam equipment for law enforcement applications. Despite numerous controversies about the integrity or their equipment, they’ve also been managed about as well as the Cincinnati Bengals. Yet they continue to get away with it because a $5 million market cap, hyper-specialized, tactical equipment company doesn’t draw many flashy headlines. Their most glaring flaw, besides one of their 2 customers being the oh-so-loyal U.S. government, are their absolutely disgusting finances:\n&gt; DGLY booked profit margins of -97.30%, and its Return on Assets is -67.50%. (Oracle Dispatch)\nShilling my personal positions aside, you autsits can do so much better feeding on smaller fish, there are hundreds just waiting to be outed, and I know at least one of you out there has the autism to to get it done.\nGodSpeed, Retards.",
        "subreddit": "wallstreetbets",
        "title": "Whales, Minnows, Retards and You.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/izkt0h/whales_minnows_retards_and_you/",
        "created": 1601074184.0
    },
    {
        "author": "Smagiic",
        "created_utc": 1600052590,
        "id": "iscpn4",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I feel like the easy thing to do here is buy Oracle calls, but what do you guys think about Microsoft puts? Not too sure what to do..guess ill keep reading",
        "subreddit": "options",
        "title": "ORACLE partnership for tiktok",
        "url": "https://www.reddit.com/r/options/comments/iscpn4/oracle_partnership_for_tiktok/",
        "created": 1600081390.0
    },
    {
        "author": "omdesign123",
        "created_utc": 1600196357,
        "id": "itf68y",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Due to Travis Scott keeping me in business I spend night and day flipping travy patties for my king Cactus Jack Hoff.  My paycheck finally came in with overtime pay, you could imagine how excited I was after receiving $160.  I thought it was time to be a professional chad broker and decided to create a 50/50 plan.  50% of my income will be put into ORCL due to that lit TikTok purchase and the other 50% will be flipped on roobet's best game \"crash\".  Simply bet $80 and pull at 6.90x for a quick $550.  Thoughts on this new concept of being a tech guru trader?",
        "subreddit": "wallstreetbets",
        "title": "Spending My McDonalds Paycheck on a New 50/50 Financial Plan",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itf68y/spending_my_mcdonalds_paycheck_on_a_new_5050/",
        "created": 1600225157.0
    },
    {
        "author": "cclagator",
        "created_utc": 1599583179,
        "id": "iowzoz",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "What a difference a week makes. As [I wrote previously](https://www.reddit.com/r/options/comments/idxxe2/a_lot_of_gamma_expiring_today_will_volatility/) how a lot of gamma was set to roll off after August expiration and it looks like that's partially responsible for some of the bigger moves in the market this past week. I also [wrote](https://www.optionseye.com/draftkings-dkng-earnings-preview/) about how a lot of that upside skew we were seeing in big tech names and story stocks had the options market all out of whack. I attributed it to retail flow (YOLO) crowd and it turns out Softbank was in on that game. Wild stuff. That was partially responsible for some of those blow-off tops we saw in names like TSLA.\n\nAs far as what's next, options are back to pricing in wild swings across the market and that may mean looking at some of the earnings moves a little differently. How much are the expected moves in the earnings stocks (below) this week pricing their earnings, and how much is pricing big market moves. My guess is options are now overpricing earnings moves themselves, so the market is the bigger driver for now. Let me know if anything missing you want to see of have any questions below. Full post over at [optionseye](https://www.optionseye.com/the-moves-the-options-market-expects-this-week-spy-qqq/).\n\n**Last Week**\n\n* VIX closed Friday at 30.75, up sharply on the week (from the low 20's) and is higher again this morning, near 32.50.\n* Last week's expected move in SPY: 1.3%\n* Last week’s actual move SPY: -2.5%\n* Last week's expected move in QQQ: 2.3%\n* Last week's actual move in QQQ: -3.0%\n\n**This Week**\n\nThis week’s expected move in SPY, via Options AI technology: 2.8% [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.28.20-AM.png)\n\nThis week’s expected move in QQQ: 4.6%: [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.29.09-AM.png)\n\n&amp;#x200B;\n\n**Earnings Calendar**\n\nThis week's earnings of note, expected move and its actual move last earnings.\n\n**Tuesday 4:05pm - LULU |** expected move: 9.2% (last earnings: -3.8%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.39.26-AM.png)\n\n**Tuesday 4:10pm - WORK |** expected move: 14.7%  (last earnings: -14.0%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.35.56-AM.png)\n\n**Wednesday 4:05pm - GME |** expected move: 22.0%  (last earnings: +2.2%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.43.55-AM.png)\n\n**Wednesday 4:05pm - RH |** expected move: 12.5%  (last earnings: -0.9%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.46.58-AM.png)\n\n**Wednesday 4:05pm - ZS |** expected move: 16.3%  (last earnings: +29.5%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.48.31-AM.png)\n\n**Thursday 4:00pm - ORCL |** expected move: 5.8%  (last earnings: -5.6%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.52.33-AM.png)\n\n**Thursday 4:05pm - PTON |** expected move: 17.4%  (last earnings: +16.0%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.50.42-AM.png)\n\n**Thursday 4:10pm - CHWY |** expected move: 14.6%  (last earnings: -3.6%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.55.11-AM.png)\n\n**Friday 7:30am - KR |** expected move: 5.6%  (last earnings: -3.0%) [Chart](https://www.optionseye.com/content/images/2020/09/Screen-Shot-2020-09-08-at-6.57.23-AM.png)",
        "subreddit": "options",
        "title": "Expected moves for the market and earnings this week.",
        "url": "https://www.reddit.com/r/options/comments/iowzoz/expected_moves_for_the_market_and_earnings_this/",
        "created": 1599611979.0
    },
    {
        "author": "ihopemyfriendslikeme",
        "created_utc": 1598971168,
        "id": "iklgb4",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I posted yesterday about the upcoming tik tok deal and what it could mean regarding Microsoft stock price. As I’m currently heavily invested in Microsoft calls I thought I’d share with you all this incredible opportunity for a big cash out. \n\nContext: ByteDance is a Chinese company that owns tik tok. US Companies have been looking to purchase the US version of TikTok. Trumpie doesn’t like the idea of the Chinese owning tik tok to SPY on us, and last month signed an executive order that will effectively ban tik tok unless it is sold to a US company by mid September. \n\nCurrently, the main players looking to purchase tik tok are Microsoft teamed up with Walmart, and oracle. \n\nNow between the top bidders it makes much more sense for Microsoft to be selected as the winning buyer. Oracle does not own any type of social platform whereas Microsoft owns Xbox and other communication channels such as teams. Additionally, the tik tok interim CEO herself said that she saw great synergy potential with Walmart as they could sell products through the app. \n\nBased on the above, it seems like a no brainer that Tik Tok will be sold to Microsoft and Walmart....\n\nBut hold the phone, yesterday news came out that China has now put a limit on its data exports which would include tik tok. This limit acts as a retaliation against trumpie and many believe it could prolong the deal. \n\nNow if you’ve seen anything this administration it’s Trump not giving a shit about the right thing to do. He stated 9/20 as tik tok shutting off unless it’s sold and honestly seems like a win win if the deal goes through. \n\nBecause there is uncertainty on if the deal goes through, but it should theoretically happen, this makes NOW a great time to buy MSFT/WMT calls. \n\nMy guess is that if the biggest new social media platform is sold to Microsoft, you could see a jump up to $240-$250 overnight for some hugeeee gains. \n\nHappy trading! \n\nMSFT $230 c 9/18, 10/2",
        "subreddit": "wallstreetbets",
        "title": "Get Huge and Hard, buy MSFT Calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iklgb4/get_huge_and_hard_buy_msft_calls/",
        "created": 1598999968.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1600618991,
        "id": "iwgvqc",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Deal was approved an hour ago by trump\n\nI’ve been holding Walmart month out calls since last week\n\nWhat are some other good plays, Facebook puts?",
        "subreddit": "options",
        "title": "Walmart Calls on Oracle/WMT TikTok deal approval",
        "url": "https://www.reddit.com/r/options/comments/iwgvqc/walmart_calls_on_oraclewmt_tiktok_deal_approval/",
        "created": 1600647791.0
    },
    {
        "author": "KhAiMeLioN",
        "created_utc": 1600095914,
        "id": "ismls4",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "So I heard a buncha guys from here saying over that Oracle is a boring boomer stock. \n\nLot of em were like ya it will boom for a sec then drop back down to boomer status @ around 50 bucks. \n\nListen. Boring can be fun. \n\nFly the Iron Condor and just collect premium while you ride the 50's boomer rollercoaster. \n\nHas anyone actually tried this?",
        "subreddit": "wallstreetbets",
        "title": "How to win at Oracle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ismls4/how_to_win_at_oracle/",
        "created": 1600124714.0
    },
    {
        "author": "AlphaFuchs",
        "created_utc": 1600683346,
        "id": "iwxonj",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I have 2 shares for oracle in the pipe, but you guys are making me horny for more Tesla. Should i cancel and invest more in Musk? \n\nPlan was to wait for oracle to go up, sell later today and buy more $TSLA.",
        "subreddit": "wallstreetbets",
        "title": "Cancel oracle order, buy more $TSLA?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iwxonj/cancel_oracle_order_buy_more_tsla/",
        "created": 1600712146.0
    },
    {
        "author": "jpowprints",
        "created_utc": 1600557807,
        "id": "iw2xqz",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Trump gave his blessing on Tiktok/ ORCL/ WMT deal sat afternoon. China left to approve... Will they sign off? And will my ORCL print on Monday?\n\nHere is what he said:\n\n\"I have given the deal my blessing — if they get it done that's great, if they don't that's okay too,\" Trump told reporters on the White House South Lawn before departing for North Carolina. \"I approved the deal in concept.\"\n\nLink: www.cnbc.com/amp/2020/09/19/trump-says-he-has-approved-tiktok-oracle-deal-in-concept.html",
        "subreddit": "options",
        "title": "ORCL TikTok provider, and Trump",
        "url": "https://www.reddit.com/r/options/comments/iw2xqz/orcl_tiktok_provider_and_trump/",
        "created": 1600586607.0
    },
    {
        "author": "Tom_Bone",
        "created_utc": 1600092137,
        "id": "islfj6",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I’m following ORCL this morning with a set plan in my head not using any money just practicing but I can’t find any new updates . Most recent update everywhere I look is from 9:33. It’s just throwing me through a loop cause it hasn’t moved since then.",
        "subreddit": "stocks",
        "title": "How often do sites and apps update",
        "url": "https://www.reddit.com/r/stocks/comments/islfj6/how_often_do_sites_and_apps_update/",
        "created": 1600120937.0
    },
    {
        "author": "Johnone2",
        "created_utc": 1600351573,
        "id": "iuk4sd",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Walmart partnering with oracle to get TikTok!\n\nBuy now retards this shit going to the fucking mooooooooooo !!!!📈📈📈📈📈📈📈📈📈📈📈📈📈📈📈🌚🌚🌚\n\n\nhttps://twitter.com/cnbcnow/status/1306592497343160320?s=21",
        "subreddit": "wallstreetbets",
        "title": "Walmart to the fucking moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iuk4sd/walmart_to_the_fucking_moon/",
        "created": 1600380373.0
    },
    {
        "author": "drksntt",
        "created_utc": 1600059540,
        "id": "isef1q",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "oracle dis week (pic from twitter)",
        "url": "https://i.redd.it/sf4ps4szo1n51.jpg",
        "created": 1600088340.0
    },
    {
        "author": "KL5400",
        "created_utc": 1600055984,
        "id": "isdkm8",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Oracle wins tik tok bid, now waiting for US Gov approval to allow Oracle as partners instead of an outright sale \n\n\nhttps://www.google.com/amp/s/www.wsj.com/amp/articles/microsoft-drops-out-of-bidding-for-tiktoks-u-s-operations-11600039821",
        "subreddit": "stocks",
        "title": "Oracle Wins Tik Tok Bid",
        "url": "https://www.reddit.com/r/stocks/comments/isdkm8/oracle_wins_tik_tok_bid/",
        "created": 1600084784.0
    },
    {
        "author": "moaimaea",
        "created_utc": 1600100225,
        "id": "iso2gb",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "The Treasury Department said it would review a deal by Oracle Corp. ORCL +5.51% for TikTok’s U.S. operations aimed at avoiding a ban of the popular video-sharing app because of its Chinese ownership.\n\nBusiness software provider Oracle on Monday said it was part of the proposal submitted by TikTok’s Chinese parent ByteDance Ltd. to the U.S. government in which the American tech company would “serve as the trusted technology provider.” It beat out Microsoft Corp. MSFT +1.94% to work with TikTok to address Trump administration concerns that the popular video-sharing app’s ownership by a Chinese company posed a national security risk, people familiar with the situation said Sunday.\n\nPresident Trump was pushing for a sale of TikTok’s U.S. business and has said, absent a deal, those operations would be shut down.\n\nTreasury Secretary Steven Mnuchin on Monday confirmed that his office received a bid proposal from Oracle for TikTok’s operations over the weekend and said that the Treasury-led Committee on Foreign Investment in the U.S. would review it this week. “We will be reviewing that at the Cfius committee this week and then will be making a recommendation to the president and reviewing it with him,” Mr. Mnuchin said on CNBC. Presidents have the power to overrule Cfius recommendations to either clear or block a deal.\n\nDetails of the Oracle arrangement with TikTok weren’t immediately disclosed, but it is expected to involve moving TikTok’s data on American users to Oracle’s cloud-computing infrastructure and housing that information only in the U.S. Oracle is joining with some of ByteDance’s U.S. investors, and Walmart Inc., which had been working with Microsoft, suggested late Sunday that it is considering joining the Oracle group, according to the people.\n\nFor Oracle, the arrangement could give a jolt to the Silicon Valley stalwart’s efforts to transform its staid database business into a major player in cloud computing—if the companies can secure government approval for the plan.\n\nThe principal attraction of a TikTok deal is adding a flagship customer to its cloud, people familiar with the arrangement said. TikTok is a globally recognized client and comes with a coveted user base for Chairman Larry Ellison as he seeks to accelerate the shift of the Redwood City, Calif.-based company he founded into a force in cloud computing, one of the most dynamic areas of tech.\n\nOracle currently lags far behind cloud leaders including Amazon.com Inc. and Microsoft. It mainly provides enterprise customers software to help run their business.",
        "subreddit": "stocks",
        "title": "Oracle/TikTok deal undergo national security review",
        "url": "https://www.reddit.com/r/stocks/comments/iso2gb/oracletiktok_deal_undergo_national_security_review/",
        "created": 1600129025.0
    },
    {
        "author": "G_Bartan",
        "created_utc": 1600352388,
        "id": "iukdt7",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Walmart is gonna partner with oracle and get Tik Tok. Buy now while it’s still low. Trump is gonna pump this full of his love. Basically free tendies you smoothbrain retards. JUMP ON NOW BEFORE THE TRAIN LEAVES THE STATION!!",
        "subreddit": "wallstreetbets",
        "title": "But Walmart You Fucks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iukdt7/but_walmart_you_fucks/",
        "created": 1600381188.0
    },
    {
        "author": "Xieqianqi",
        "created_utc": 1600134688,
        "id": "isz837",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "\\* Nvidia climbs because it will acquire chip design company Arm for $40 billion\n\n&amp;#x200B;\n\n\\* Pfizer and BioNTech expand the scale of late-stage COVID-19 vaccine trials\n\n&amp;#x200B;\n\n\\* Oracle soars due to a partnership with TikTok parent company\n\n&amp;#x200B;\n\n\\* The Dow closed up 1.2%, the S&amp;P 500 closed up 1.3%, and the Nasdaq closed up 1.9%",
        "subreddit": "investing",
        "title": "U.S. stock market: closed sharply higher, boosted by new crown vaccine hopes and a wave of corporate mergers and acquisitions (Reuters News)",
        "url": "https://www.reddit.com/r/investing/comments/isz837/us_stock_market_closed_sharply_higher_boosted_by/",
        "created": 1600163488.0
    },
    {
        "author": "CiceroTheAbsurd",
        "created_utc": 1600454551,
        "id": "ivbwy4",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "TikTok may or may not be “banned”/restricted on Sunday. I believe it will be. One would assume $FB tiktok equivalent—reels for Instagram—will see a spike as a percentage of investors pull from $ORCL and $WMT. \n\nI’m thinking call spread 9/25 $260 ~ $270.\n\nThoughts?",
        "subreddit": "wallstreetbets",
        "title": "I need some $FB DD Advice",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivbwy4/i_need_some_fb_dd_advice/",
        "created": 1600483351.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1600449344,
        "id": "iva9px",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Summarized to save you time.\n\n**Another day of FAANG underperformance weighing on sectors:**\n\n* **REITs** and **utilities** trailing, but session characterized by continued underperformance from the FAANGs and pressure on the requisite sectors. In addition to declines in AAPL-US and MSFT-US , **tech** seeing weakness in semis. **Consumer discretionary** seeing a fair number of gainers outside AMZN-US , though some weakness in specialty retailers and hotel/leisure names. **Communication services** feeling some drag from select media and entertainment names alongside the drop by GOOGL-US (FB-US a slight gainer). Industrial metals (particularly steel) stronger in **materials**. **Consumer staples** beating the tape with help from select grocers and food-products companies. **Energy** helped by higher crude. **Healthcare** slightly positive, with pharma and managed care largely better. **Industrials** outperforming thanks to some strength in A&amp;D and machinery. **Financials** leading the market. Insurers, online brokers, credit cards some of the better performers.\n\n**Fed considering whether to extend restrictions on dividends and share buybacks:**\n\n* [Fed](https://www.federalreserve.gov/newsevents/pressreleases/bcreg20200917a.htm) said that it will announce by the end of September whether to extend current restrictions on dividends and share buybacks into Q4. Board released its two hypothetical scenarios for a second round of bank stress tests, both of which envisage severe global downturns with substantial stress in financial markets and include a global market shock component that will be applied to banks with large trading operations. One scenario features a faster and higher peak in unemployment while the second sees a lower unemployment peak but a slower descent. Board will release firm-specific results from banks' performance under both scenarios by the end of 2020. [Bloomberg](https://www.bloomberg.com/news/articles/2020-09-17/fed-weighs-extending-bank-dividend-caps-re-starts-stress-tests?srnd=premium&amp;sref=4uo0B65n) noted update particularly of note for GS-US , MS-US , who are more reliant on capital market. Fed hasn't made clear whether second set of tests will replace earlier set of tests, which would raise each firm's capital minimum.\n\n**Preliminary Michigan consumer sentiment rose in early September:**\n\n* Preliminary **Michigan Consumer Sentiment** for Sep of 78.9 versus cons 75, up 4.8 pts from last month. Noted a modest improvement to the top of the range since April with consumers beginning to look towards the presidential election and for release of a coronavirus vaccine. Current conditions index up 4.6 pts to 87.5. Expectations index 4.8 pts higher to 73.3. One-year and five-year inflation expectations fell with the former down 0.4% to 2.7% and the latter down a tenth to 2.6%. Next week will bring August **existing home sales** (5.925M cons vs 5.86M prior) and September **Richmond Fed index** (12 cons vs 18 prior) on Tuesday, a slight deceleration expected in preliminary **Markit PMIs** Wednesday, **initial claims** (850k exp vs 860k prior) and August **new home sales** Thursday (875K exp vs 901K prior), and August **durable goods orders** Friday (1.4% exp vs 11.4% prior).\n\n**Covid-19 vaccine developers bow to calls for greater transparency, states face logistical challenges:**\n\n* [NY Times](https://www.nytimes.com/2020/09/17/health/covid-moderna-vaccine.html?action=click&amp;module=Top%20Stories&amp;pgtype=Homepage.) reported Moderna (MRNA-US ) and Pfizer (PFE-US ) released comprehensive details of their vaccine evaluation process, including how participants are monitored, conditions that could force early stop to trials, and evidence used to determine whether vaccine protected participants against Covid-19. Marks a departure from standard practice where documents are shared after studies are complete. Demand for greater transparency from vaccine developers fueled in part by concerns about political interference in regulatory approval process. Separately, [Politico](https://www.politico.com/news/2020/09/17/coronavirus-vaccine-distribution-trump-states-417407) highlighted how states tasked with leading vaccine distribution efforts face logistical and supply chain challenges that could thwart Trump's optimistic timeline for delivery.\n\n**Stimulus deal remains elusive:**\n\n* [Politico](https://www.politico.com/news/2020/09/17/coronavirus-stimulus-deal-417142) reported Democrats and Republicans appeared further apart on key components of a fifth coronavirus relief bill on Thursday. House Speaker Pelosi said Democrats could push for more than their previous offer of $2.2T given financial imperative has grown since May, though suggested Democrats aren't prepared to accept less than that ([The Hill](https://thehill.com/homenews/house/516904-pelosi-hard-to-see-dems-supporting-less-than-22t-in-covid-aid)). However, little appetite from Senate Republicans on going above their 'skinny' stimulus bill. [Washington Post](https://www.washingtonpost.com/politics/pelosi-trump-stimulus-checks/2020/09/17/7e507a74-f90c-11ea-a510-f57d8ce76e11_story.html) highlighted how Trump's call this week for Republicans to embrace a larger stimulus has put Pelosi in a bind over whether to hold her ground on the $2.2T or negotiate with White House and placate centrist Democrats fearful of voter blowback. Article noted that with Congress set to leave town in first week of October and not return until after election, situation puts some Democrats facing tough reelection chances in difficult spot.\n\n**Unlike stimulus talks, government-funding negotiations remain on track:**\n\n* [WSJ](https://www.wsj.com/articles/lawmakers-close-in-on-spending-deal-to-avert-shutdown-11600379832) the latest to highlight continued progress on congressional negotiations about a short-term funding package to keep the government from shutting down after 1-Oct, sidestepping a potential confrontation ahead of the 3-Nov elections. Recall Treasury Secretary Mnuchin and House Speaker Pelosi agreed earlier this month to pursue a \"clean\" funding bill unburdened by politically sensitive additions ([The Hill](https://thehill.com/policy/finance/515060-mnuchin-pelosi-reach-informal-deal-to-avoid-government-shutdown)), though today's WSJ notes there have been some discussions about whether to add an extension for flood insurance, funding for highways, or funding to give the government extra time to complete the decennial census. Lawmakers and aides said they were finishing up discussions and could have a bill ready for introduction to the House around midday today.\n\n**A busy day of Fedspeak ahead after this week's FOMC meeting:**\n\n* In an essay \"[Why I Dissented](https://www.minneapolisfed.org/article/2020/why-i-dissented),\" Minneapolis Fed President Neel Kashkari (voter) said the Fed should hold off on rate hikes until roughly a year of 2% core inflation. He also said he dissented because he wanted a stronger commitment to zero rates, and said sustained core inflation at 2% would demonstrate the economy was at full employment. St. Louis' Bullard (non-voter) said that we may be at a moment where there may be some inflation given loose policy, government deficits, and supply deficits across the economy. He also said that he's optimistic the US economy can get back to where it was pre-pandemic, and that 100% of GDP can be produced safely despite COVID-19. Atlanta's Bostic (non-voter) told [Bloomberg](https://www.bloomberg.com/news/articles/2020-09-18/slowing-u-s-economy-needs-more-fiscal-aid-fed-s-bostic-says?sref=4uo0B65n) he will wait for evidence of overheating before taking action, and that he's more concerned with the trajectory of inflation than specific levels.\n\n**US to block TikTok downloads starting Sunday, shutdown app in November if no deal reached:**\n\n* Commerce Secretary Wilbur Ross said Friday that US users will be blocked from downloading TikTok and WeChat starting 20-Sep. TikTok will also be shut down would come 12-Nov if no deal is reached ([statement](https://www.commerce.gov/news/press-releases/2020/09/commerce-department-prohibits-wechat-and-tiktok-transactions-protect), [Reuters](https://www.reuters.com/article/us-usa-tiktok-ban-exclusive/exclusive-trump-to-block-u-s-downloads-of-tiktok-wechat-on-sunday-officials-idUSKBN2691QO?il=0), [FT](https://www.ft.com/content/c460ce4c-c691-4df5-af49-47a395429fe8?shareType=nongift)). The statement also said that WeChat would also be removed from app stores, and that transactions and payments would be banned on the app Monday. Reports yesterday noted TikTok and Oracle have agreed to the US Treasury terms to complete the transaction though Trump has not issued final approval ([Bloomberg](https://www.bloomberg.com/news/articles/2020-09-17/oracle-bytedance-said-to-accept-new-treasury-terms-on-tiktok), [NYT](https://www.nytimes.com/2020/09/17/technology/tiktok-deal-revisions-trump-review.html?smid=tw-share)), while [WSJ](https://www.nytimes.com/2020/09/17/technology/tiktok-deal-revisions-trump-review.html?smid=tw-share) reported the deal will still need signoff from China. [WSJ](https://www.wsj.com/articles/trump-administration-pushes-for-u-s-control-of-tiktok-11600295711?mod=hp_lead_pos2) also reported Trump administration officials have sought to ensure US investors hold significant majority stake in the company that will take over TikTok, headlined by Oracle (ORCL-US ) and Walmart (WMT-US ).\n\n**Fed survey shows improvement to households' financial strain from government support:**\n\n* The Fed's [update](https://www.federalreserve.gov/publications/files/2019-report-economic-well-being-us-households-update-202009.pdf) to its Report on the Economic Well-Being of US Households survey, which was conducted in July, said that employment outcomes differed markedly across workers of different incomes and education levels. It also said that the extraordinary governmental measures in response to the pandemic helped ease families' financial strain, with financial well-being higher in the July survey than early April before the financial relief efforts were in place. The report was in line with recent Fed commentary on the need for more fiscal policy stimulus. Fed Chair Powell said in the post-FOMC press conference this week that while fiscal support has been essential to the recent recovery, more fiscal support is likely to be needed given the 11M people still out of work due to the pandemic, struggling small businesses, and declining revenues across state and local governments.\n\n**Companies see higher taxes post-election, no matter who wins:**\n\n* [WSJ](https://www.wsj.com/articles/companies-brace-for-higher-taxes-after-u-s-election-11600366918) reported that financial executives at major US companies expect corporate tax rates to rise following the November election, no matter who wins, according to PwC survey. Former VP Biden said he supports raising corporate tax rate from 21% to 28%, add new surtax to companies that make products overseas and sell them back to US and raise minimum tax on foreign income. Trump hasn't proposed any changes, but the article noted that executives anticipate higher taxes on expectation government will have to fund stimulus spending, tax deferrals, and other federal COVID-related relief. Also said if Trump is re-elected, executives will likely spend more on companies' supply chains to protect against fallout of US-China tensions.",
        "subreddit": "stocks",
        "title": "Top Stories - Friday, Sept. 18, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/iva9px/top_stories_friday_sept_18_2020/",
        "created": 1600478144.0
    },
    {
        "author": "MrTrader007",
        "created_utc": 1600551157,
        "id": "iw185p",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "ORCL",
        "url": "https://i.redd.it/rp13ckcta6o51.jpg",
        "created": 1600579957.0
    },
    {
        "author": "MrTrader007",
        "created_utc": 1600551022,
        "id": "iw16st",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "ORCL got approval from trump",
        "url": "https://i.redd.it/tziqy7zea6o51.jpg",
        "created": 1600579822.0
    },
    {
        "author": "LurKingKoala",
        "created_utc": 1599498358,
        "id": "iobedk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Ok  guys, I know this long weekend is tough on us all.  Not being able to  throw my portfolio 100% into a stock I haven't researched whatsoever is  making me wonder if it really is Monday or if my Step-Dad actually  turned the stock market off like he kept threatening to do...\n\nI've decided to help my WSB brethren through this long and difficult day of no ~~investing~~  gambling by sharing a newfound gift with you all.  For those out of the  loop, I have been chosen by the Gods as the new Prophet, translator of  strange tongues and oracle of oration.  I first discovered this gift 2  days ago while deciphering the sacred writings of [u/Jaecer](https://www.reddit.com/u/Jaecer/) and his [Divine Prophecy of GDP Q3 up BIGLY: The Coming of Hulk Dildo Tuesday](https://www.reddit.com/r/wallstreetbets/comments/impkrk/donald_pump_said_gdp_in_3rd_quarter_and_other/g42e9b2/?utm_source=share&amp;utm_medium=web2x&amp;context=3).   While pouring over the manuscript I felt a strange power grip hold of  me tighter than a Bear's rectum gripping green candlesticks.  It was as  though the matrix were shooting up, through my balls and out my finger  tips as my hands flew across the keyboard.  Rainman had been awakened  and through my body, a mere vessel of foot fungus and dandruff, he was  decoding the gibberish and nonsensical ramblings posted to WSB to  uncover their true meaning.\n\n\"blsh blsh blshjshfjenmrjg fuck auto mod your gay af eriahjguwehbtinu askjryhdnviSZJUEf\"\n\nIt was so obvious, this simple acronym contained the codex:\n\n\"*Buy  Low Sell High, Buy Low Sell  High, Buy Low Sell High Just Sell High For  Jerome Even Noobs Make Retard  Jerkoff Gains fuck auto mod your gay af,  Every Retard Is A Hero Just  Going Up With Each Heroic Bullish Trade  Inflation's Not Unflation, Any  Savant Knows Jerome Recently YOLO'ed His  Donald November Volatility  Investment SHORT ZOOM JAN800c ELON faggots\"*\n\n...and then a new vision emerged!  The angel [u/greenpaint11](https://www.reddit.com/u/greenpaint11/)  appeared, as if to tell me I was right to transcribe the acronyms so  that the retards would know what to trade, to push me to fulfill my  destiny, and bearing this message from God himself: \"Jakriisbwsb\"\n\nFaster than a fapping fucktard the message: \"*Jaecer And Koala Recommend Inversing Intelligent Strategies Because Wall Street Bets*\" shot out my thumbs and I came all over my screen.\n\nSo  anyway, that made two successfully translated acronyms in a row so  we're clearly on a hot streak, and you always double down on a hot  streak.  Anyone ever won their first roll at a craps table and walked  away?  Of course not, that would be ridiculous.\n\nWhat's the plan?  When our divine beings [u/Jaecer](https://www.reddit.com/u/Jaecer/) and [u/greenpaint11](https://www.reddit.com/u/greenpaint11/)  grace us with their presence, the first reply to their comments that is  a string of gibberish letters (no numbers, can't have your autism  manipulating God's message,) shall be translated by yours truly, in an  attempt to combine the unintelligible ramblings of Wall Street Babylon's  many tongues to reveal what J-Po &amp; Elon are planning.  From these  translations we will know what this week brings and I will update OP  with positions based upon these holy translated acronyms.  Acronyms  should be between 11 and 58 letters, as these were the lengths of the  first two messages from the endless above where the great Battery lives.\n\nAND SO IT SHALL BE DONE.  I HAVE SPOKEN.",
        "subreddit": "wallstreetbets",
        "title": "The 2nd Coming",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iobedk/the_2nd_coming/",
        "created": 1599527158.0
    },
    {
        "author": "Liblingsfarbe",
        "created_utc": 1600722532,
        "id": "ix9f72",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Screenshot: [https://i.imgur.com/xOHjWWx.png](https://i.imgur.com/xOHjWWx.png)\n\nVideo proof: [https://i.imgur.com/jbVvRhD.mp4](https://i.imgur.com/jbVvRhD.mp4)\n\nToo many trades to post all here. Highlight plays:\n\n* TikTok deal (MSFT, WMT, ORCL, SNAP)\n* PTON (both calls &amp; puts)\n* NVDA, AMD, ZM, ROKU calls\n* AAPL (both calls &amp; puts)",
        "subreddit": "wallstreetbets",
        "title": "$500 to $50,000 (+10,000%) in 3 months - gain porn",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ix9f72/500_to_50000_10000_in_3_months_gain_porn/",
        "created": 1600751332.0
    },
    {
        "author": "ghathawayjunior",
        "created_utc": 1600062861,
        "id": "isf5o6",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[Source](http://www.ecns.cn/m/news/economy/2020-09-14/detail-ifzzykiy4584365.shtml)\n\n&gt;ByteDance will not sell TikTok's U.S. operations to Microsoft or Oracle, nor will the company give the source code to any U.S. buyers, sources said. \nMicrosoft on Sunday said ByteDance will not be selling TikTok's U.S. operations to the company. \n\n&gt;\"ByteDance let us know today they would not be selling TikTok's U.S. operations to Microsoft. We are confident our proposal would have been good for TikTok's users, while protecting national security interests,\" Microsoft said in a statement.\n\n&gt;The sources confirmed the statement.",
        "subreddit": "stocks",
        "title": "ByteDance will not sell TikTok's U.S. operations to Microsoft or Oracle: Sources",
        "url": "https://www.reddit.com/r/stocks/comments/isf5o6/bytedance_will_not_sell_tiktoks_us_operations_to/",
        "created": 1600091661.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1601215901,
        "id": "j0rqo7",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "What's up people of stocks, some of you may have seen my unusual options activity posts in other option's trading sub-reddits. I've decided to put together a little summary for the week that details some trending tickers, option activity, and some setups for next week ( + reasoning for the setup). Mods if this isn't allowed, I won't post again. Here we go:\n\n&amp;#x200B;\n\n# Upcoming Earnings\n\nMicron (MU) Earnings are coming up this week. The semi-conductor company has been consistently beating earnings and has seen some growth throughout the pandemic as more companies become increasingly tech-focused with work-from-home orders. Here’s a snapshot of their most recent earnings and performance moves day-after the report. \n\n[https://imgur.com/stDsUEx](https://imgur.com/stDsUEx)\n\n**What to look for**\n\nBy proxy, companies that will see some related movements to MU’s earnings are: AMD, INTC, and NVDA. A good showing from MU will also mean good things for other semi-conductor companies.\n\nHere’s a look at MU’s average options’ Implied Volatility (IV) over the last month. We can see that typical IV is in the 40-45% range. When the stock price dropped early September during the crash, we saw IV get up to the 60’s. IV has begun to dip back into the 40’s meaning there is not a huge move expected off the earnings report. (Stock price is gold vs IV blue line). \n\n[https://imgur.com/87nthwQ](https://imgur.com/87nthwQ)\n\n# Economic Calendar\n\nWe have some important economic data coming out this week. Here’s the outlook:\n\nTuesday 10am: Consumer Confidence\n\nWednesday 8:30am: GDP Q2, Pending Home Sales\n\nThursday 8:30am: Jobless claims\n\nFriday 8:30am: Unemployment Rate\n\n**Full Calendar of Important Events w/ Forecasts (via Bloomberg):** \n\n[https://imgur.com/1XEHPyC](https://imgur.com/1XEHPyC)\n\n# Trending Stocks\n\nMost Mentioned Tickers + Sentiment from Friday \n\n[https://imgur.com/jTw7JiO](https://imgur.com/jTw7JiO)\n\n# This week’s trend gainers and losers\n\n**Losing Hype:** TSLA, VALE, NKLA, MSFT, WMT, AAPL\\*\n\n[https://imgur.com/0wdvTJB](https://imgur.com/0wdvTJB)\n\n**Gaining Hype:** BA, VXX, ZM, AAL, UPS, PTON, MU\n\n[https://imgur.com/hpakS2h](https://imgur.com/hpakS2h)\n\n\\*AAPL was losing hype on the weekly trend, but up on the daily trend Thursday &amp; Friday from a good performance.  \n\n# Consolidating Tickers\n\nThese tickers are ones that have once been a “meme”, but have since settled down, and perhaps a good entry point if your technicals are right, it aligns with your strategy, and want to avoid FOMO-ing into hot stocks. \n\n[https://imgur.com/5YsYE1a](https://imgur.com/5YsYE1a)\n\n# The classic tale of doing the inverse of WSB\n\nToday we’ll take a look at VALE, a stock that was almost never mentioned a single time in the last month on r/WallStreetBets until September 18th. At that point, the stock had risen 10% in the week before and VALE was then seen all over the comment section of the sub. Comment volume for VALE jumped to 10% of total comment volume on the sub-reddit at which point many WSB members initiated positions. Within the next several trading days the stock tanked 15% leaving WSB holding the bag (yet again). For more details on this, please read “How not to FOMO into trades”. \n\n[https://imgur.com/oZ7xY0B](https://imgur.com/oZ7xY0B)\n\n**Swaggy DD (due diligence) released this week - GME (Gamestop)** \n\n**I. INTRODUCTION**\n\nWhen I look at the sentiment surrounding GameStop, it doesn’t take very long to see comments like these, yet here we are. What’s going on? Are people that stupid? Just jumping on the new console cycle? Idiots not pulling their gains and going to zero? When even r/wallstreetbets thinks the stock is a dud, it must be right? Nearly 120% short interest, yet the stock is up nearly 40% this week.\n\nIts no secret GameStop has been hurting. The secular shift to digital has been pressuring them for some time with their highest margin category - used video software – under significant distress. Each year their gross margins contract with net income in the red these past few quarters. Everybody has written them off as the easiest short in the world, however I'm going to try to explain whats going on and tell you that buying GameStop may not be as bad as you think.\n\n**II. CONSOLES**\n\nJust to start things off, you have to remember we’re in the beginnings of the new console cycle. But what does that even mean? Well the advent of new consoles means new trade-ins, new product, new customers, and a fresh spike in GameStop’s popularity. Sales have stagnated the years prior, and they are all but certain to go up and remain elevated for the next 1-2 years. Note that against all counts, the company was actually profitable during the 2019 holiday season, with new consoles you can bet that they will annihilate all expectations and proceed into 4-8 more positive quarters off the cyclic shift. This is pretty unanimous, and everyone accepts that they will start reporting positive going forward. In fact, new console cycles are where GME has historically spiked.\n\n[Click here to continue reading the DD](https://www.reddit.com/r/wallstreetbets/comments/ivs6dw/bankrupting_institutional_investors_for_dummies/)\n\n# Swaggy Play &amp; Trade Idea - JPM\n\nWhat's up everyone, market has been choppy as FK and almost un-tradeable the last several weeks. Still, not much has changed fundamentally over the last 3-4 weeks and here we are with a 10-20% haircut on stocks depending which tickers you follow. I've been sitting on my hands for a while, but entered a trade today. Keep in mind this is not advice on what or how to trade, simply posting my trade here and if you want to discuss some opinions, lets do it.\n\nWhy JPM? It has been in a fairly tight channel over the last 3-4 months, staying in the range of $90-100. I entered this exact play back in July when the stock dropped to similar levels to where it is currently at right now, and closed at max profit back then. \n\n[Check out the full play details (reasoning + risks)](https://www.reddit.com/r/SwaggyStocks/comments/izmt2r/swaggyplay_trade_idea_jpm/)\n\n# Unusual Option Activity\n\nSome big volume in option flow was spotted this week in some names: AAPL, ADBE, C, CLDR, ORCL, PBR, and WRTC.\n\n**ADBE – Adobe**\n\nADBE saw a massive call block come through on Friday. 5,000 January 2021 CALLs at the $420 strike (10% ITM). Total position size was $40 million. ADBE was about 10-15% off the recent highs and has bounced multiple times off the $470 level. IF this sell-off is truly over, we might see a good bounce in tech and some of these block purchases seem to be positioning for it. \n\n[Read Full Post: Weekly Option Flow Summary, Week of Sept 20-2020: AAPL, ADBE, C, CLDR, ORCL, PBR, WRTC](https://www.reddit.com/r/options/comments/j0rev4/unusual_option_flow_summary_for_the_week_aapl/)\n\n**What’s on the watchlist this week**\n\nStill looking for a bounce in tech. Here are some stocks I either like and have a position or I’m looking for entry points on (stock price + Implied Volatility charts)\n\n**AAPL - Apple**  \n\nAAPL is currently near a short-term low. Does it have room to go down more? Sure, but I think when you dig below the current levels you will be finding more buyers as we get closer to $100. IMO a good entry point for a long-term hold. IV is also moderately high for options. They are set to report earnings by end of October and also have catalyst of rumored 5g iPhone release.\n\n**AMD - Advanced Micro Devices**  \n\nAMD has shown some strength at the $78 level of support through these last few weeks of downside pressure. AMD also reports towards the end of October, but will have some volatility into MU (Micron Technology) earnings next week. IV is pretty high right now for AMD to buy calls. A more efficient play might be to sell CSP (cash-secured put), credit PUT spreads, or purchase shares.\n\n**DOCU - Docusign**  \n\nA second-wave covid-play I’m looking at is DOCU. DOCU just reported earnings that weren’t accepted well by Wall Street. The stock has dropped nearly 30% since it’s peak of $290 not long ago. You can also see the IV has dropped significantly after earnings. Average IV was as high as 140% pre-earnings and is now sitting around 55%. IMO this is a fundamentally strong company with solid branding. If you’ve ever needed to sign important documents online, chances are you’ve used Docusign before and it is quickly becoming a household name. I like this play for a long-term hold and also as we get into the fall months as a covid play.",
        "subreddit": "stocks",
        "title": "Swaggy's weekend summary of unusual option activity, trending tickers, and some setups for next week.",
        "url": "https://www.reddit.com/r/stocks/comments/j0rqo7/swaggys_weekend_summary_of_unusual_option/",
        "created": 1601244701.0
    },
    {
        "author": "KL5400",
        "created_utc": 1600056833,
        "id": "isds3o",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "The only reason Oracle would be a play is because they won the bid. But that doesn’t mean China will sell, they are offering a US based partnership that needs to be approved by the White House. I’m assuming it could go up because of this news and rise before an approval date",
        "subreddit": "stocks",
        "title": "Oracle News means nothing",
        "url": "https://www.reddit.com/r/stocks/comments/isds3o/oracle_news_means_nothing/",
        "created": 1600085633.0
    },
    {
        "author": "Prewrkout_CashFlows",
        "created_utc": 1600348079,
        "id": "iuj3d7",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "So i’ve been following the stock $SLV for awhile now and haven’t seen any recent earnings reports. Im confused. My Robinhood isn’t giving me a date and My trusted oracle, Jim Cramer, has not said anything about it. Anyone know why this may be? I feel that with the recent selloff after the big run-up a few months ago, they are set for a huge spike if they can beat EPS and especially revenue. So if you know when their earnings are LMK.",
        "subreddit": "wallstreetbets",
        "title": "$SLV Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iuj3d7/slv_earnings/",
        "created": 1600376879.0
    },
    {
        "author": "LurKingKoala",
        "created_utc": 1599497417,
        "id": "iob3b4",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Ok guys, I know this long weekend is tough on us all.  Not being able to throw my portfolio 100% into a stock I haven't researched whatsoever is making me wonder if it really is Monday or if my Step-Dad actually turned the stock market off like he kept threatening to do...\n\nI've decided to help my WSB brethren through this long and difficult day of no ~~investing~~ gambling by sharing a newfound gift with you all.  For those out of the loop, I have been chosen by the Gods as the new Prophet, translator of strange tongues and oracle of oration.  I first discovered this gift 2 days ago while deciphering the sacred writings of u/Jaecer and his [Divine Prophecy of GDP Q3 up BIGLY: The Coming of Hulk Dildo Tuesday](https://www.reddit.com/r/wallstreetbets/comments/impkrk/donald_pump_said_gdp_in_3rd_quarter_and_other/g42e9b2/?utm_source=share&amp;utm_medium=web2x&amp;context=3).  While pouring over the manuscript I felt a strange power grip hold of me tighter than a Bear's rectum gripping green candlesticks.  It was as though the matrix were shooting up, through my balls and out my finger tips as my hands flew across the keyboard.  Rainman had been awakened and through my body, a mere vessel of foot fungus and dandruff, he was decoding the gibberish and nonsensical ramblings posted to WSB to uncover their true meaning.\n\n\"blsh blsh blshjshfjenmrjg fuck auto mod your gay af eriahjguwehbtinu askjryhdnviSZJUEf\"\n\nIt was so obvious, this simple acronym contained the codex:\n\n \"*Buy Low Sell High, Buy Low Sell  High, Buy Low Sell High Just Sell High For Jerome Even Noobs Make Retard  Jerkoff Gains fuck auto mod your gay af, Every Retard Is A Hero Just  Going Up With Each Heroic Bullish Trade Inflation's Not Unflation, Any  Savant Knows Jerome Recently YOLO'ed His Donald November Volatility  Investment SHORT ZOOM JAN800c ELON faggots\"*\n\n...and then a new vision emerged!  The angel u/greenpaint11 appeared, as if to tell me I was right to transcribe the acronyms so that the retards would know what to trade, to push me to fulfill my destiny, and bearing this message from God himself: \"Jakriisbwsb\"\n\nFaster than a fapping fucktard the message: \"*Jaecer And Koala Recommend Inversing Intelligent Strategies Because Wall Street Bets*\" shot out my thumbs and I came all over my screen.\n\nSo anyway, that made two successfully translated acronyms in a row so we're clearly on a hot streak, and you always double down on a hot streak.  Anyone ever won their first roll at a craps table and walked away?  Of course not, that would be ridiculous.\n\nWhat's the plan?  When our divine beings u/Jaecer and u/greenpaint11 grace us with their presence, the first reply to their comments that is a string of gibberish letters (no numbers, can't have your autism manipulating God's message,) shall be translated by yours truly, in an attempt to combine the unintelligible ramblings of Wall Street Babylon's many tongues to reveal what J-Po &amp; Elon are planning.  From these translations we will know what this week brings and I will update OP with positions based upon these holy translated acronyms.  Acronyms should be between 11 and 58 letters, as these were the lengths of the first two messages from the endless above where the great Battery lives.\n\nAND SO IT SHALL BE DONE.  I HAVE SPOKEN.",
        "subreddit": "wallstreetbets",
        "title": "Your Labor Day Withdrawals Can Be Cured By The MESSIAH OF AUTISM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iob3b4/your_labor_day_withdrawals_can_be_cured_by_the/",
        "created": 1599526217.0
    },
    {
        "author": "novemberblueelephant",
        "created_utc": 1599855015,
        "id": "iqy9bm",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Good brief on the company below. \n\n&amp;#x200B;\n\n**Summary**\n\nSince its founding in 2012, Snowflake has grown into a leader in the cloud data warehousing space. The company's intuitive solution makes it easy to run analytical queries with a customer-aligned billing model. Intriguingly, Snowflake has established itself without the founder-led culture that dominates most of the tech industry. Instead, three external CEOs have guided the company to a \\~$500M annual revenue run rate, with 132% year-over-year growth. That's attracted pre-IPO investment from Warren Buffett — a rare foray into tech for the Oracle of Omaha. Big winners of the listing include the secretive Sutter Hill Ventures and Altimeter Partners.\n\nSnowflake's toughest task may be in weathering the coming storm. Amazon, Microsoft, and Google all have products in the space, and with limited enduring defensibility, the company could see its position pressured.\n\n&amp;#x200B;\n\n[Longer analysis here](https://thegeneralist.substack.com/p/the-s-1-club-snowflake-and-the-data)",
        "subreddit": "StockMarket",
        "title": "Analysis of $SNOW ahead of IPO",
        "url": "https://www.reddit.com/r/StockMarket/comments/iqy9bm/analysis_of_snow_ahead_of_ipo/",
        "created": 1599883815.0
    },
    {
        "author": "noentic",
        "created_utc": 1600472940,
        "id": "ivhham",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n\n* The S&amp;P 500 fell 1.1% on this quadruple-witching expiration Friday, as losses spread out from technology stocks to all 11 S&amp;P 500 sectors. The Nasdaq Composite also declined 1.1%, followed by the Dow Jones Industrial Average (-0.9%) and Russell 2000 (-0.4%). \n* Many viewed the download ban as a negotiation tactic to get a revised deal between Oracle (ORCL 59.75, -0.43, -0.7%) and TikTok that better protects U.S. data. Tencent's WeChat called the decision \"unfortunate\" and said it will continue to discuss solutions with the U.S., but there were still concerns about potential retaliation against U.S. technology companies. \n* The information technology sector (-1.7%) exerted influential weakness as a result, and an early rotational trade into cyclical/value stocks lost some stream as tech stocks accelerated losses. The materials (-1.7%), utilities (-1.8%), and real estate (-2.0%) sectors were other laggards, while the health care (-0.1%) and financials (-0.2%) sectors outperformed on a relative basis. \n* The market did close off session lows, thanks to a buy-the-dip mindset in the afternoon, but it's worth noting that the S&amp;P 500 closed below its 50-day moving average (3343). \n* Tesla (TSLA 442.15, +18.72, +4.4%) was a notable exception to the negative trend, rising 4.4% after Piper Sandler raised its price target on the stock to $515 from $480 ahead of its Battery Day event next week. \n* U.S. Treasuries finished little changed in a tight-ranged session. The 2-yr yield remained unchanged at 0.13%, and the 10-yr yield increased one basis point to 0.69%. The U.S. Dollar Index was flat at 92.95. WTI crude futures increased 0.2% to $41.09/bbl, bringing its weekly gain to 10%.\n\n## Index Summary\n\n**S&amp;P 500 :** (-1.54%);  **NasDaq :** (-1.33%);  \n**Russell 2000 :**(-0.26%);  **Dow :**(-1.09%);  \n**Vix :**26.46 (-2.38%); \\[-3.87%\\]; {-16.0%}\n\n## Sector Summary -\n\n*Three highest sectors for today were -*  \n**Health Care:** (-0.15%); **Financials:** (-0.2%); **Consumer Staples:** (-0.92%)  \n*Three lowest sectors for today were -*  \n**Real Estate:** (-1.98%); **Utilities:** (-1.76%); **Information Technology:** (-1.72%)  \n\n\n## Commodities/Futures\n\n(1-day %), \\[5-day %\\], {10-day %}\n\n***Currency -***  \n**USD Index :**92.912 (+0.09%); \\[-0.1%\\]; {-0.28%}  \n**BC :**10950 (-0.5%); \\[+0.74%\\]; {+5.57%}\n\n***Precious Metals -***  \n**Gold :**1949.9 (+0.36%); \\[+0.03%\\]; {+0.63%}  \n**Silver :**27.1 (-0.35%); \\[-1.25%\\]; {+0.19%}\n\n***Farming -***  \n**Soybeans :**1028.5 (+1.48%); \\[+5.27%\\]; {+6.53%}  \n**Corn :**375.25 (+0.8%); \\[+3.35%\\]; {+8.07%}  \n**Coffee :**118 (-3.26%); \\[-6.59%\\]; {-11.96%}\n\n***Industrials -***  \n**Crude :**40.97 (+0.05%); \\[+7.08%\\]; {+7.73%}  \n**Nat Gas :**2.042 (+0.88%); \\[-12.79%\\]; {-14.38%}  \n**Copper :**3.071 (+1.2%); \\[+1.47%\\]; {+2.24%}\n\n## Options Fast Facts\n\n***CBOE Put/Call Ratio - 0.63***  \n***Highest Multiple Over Daily Average -*** MT with 25x the ADV of 2909. There were 65278 calls and 7317 puts.  \n***Ticker with Most Contracts -***VALE with 680443 contracts traded today with an AVD of 52408. There were 628134 calls and 52309 puts.  \n***Largest Put / Call Ratio -*** ATUS with a 63 P/C ratio. There were 20149puts and 318 calls.  \n***Largest Call / Put Ratio -*** BGFV with a 40 C/P ratio. There were 10196 calls and 253 puts.  \n\n\n\\*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "wallstreetbets",
        "title": "Daily Market and Options Summary for September 18th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivhham/daily_market_and_options_summary_for_september/",
        "created": 1600501740.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1600608083,
        "id": "iwdqoa",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/oracle-plans-12-5-stake-002819351.html\n\nOracle and Walmart together could end up with as much as 20% of the entity, purchased in a round of financing that would precede an initial public offering, the companies said Saturday. Sequoia Capital and General Altantic, current investors in TikTok parent ByteDance Ltd., could also pursue stakes in the fundraising round, a person with knowledge of the matter said. ByteDance will retain majority control.\n\nTikTok’s decision to pick Oracle was influenced by another company, Zoom Video Communications Inc., which recently moved some of its videoconferencing capacity to Oracle’s cloud business, Redwood City, California-based Oracle said Saturday in a statement.\n\nWalmart said that while terms aren’t final, it has tentatively agreed to buy 7.5% of TikTok Global and that it would provide services including payments, e-commerce and order fulfillment to the new company. Walmart Chief Executive Officer Doug McMillon will also serve as one of five board members of TikTok Global.",
        "subreddit": "StockMarket",
        "title": "Oracle, Walmart Invest in TikTok to Gain Social Media Toehold",
        "url": "https://www.reddit.com/r/StockMarket/comments/iwdqoa/oracle_walmart_invest_in_tiktok_to_gain_social/",
        "created": 1600636883.0
    },
    {
        "author": "Trueslyforaniceguy",
        "created_utc": 1600092426,
        "id": "islir0",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ORCL trading halted",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/islir0/orcl_trading_halted/",
        "created": 1600121226.0
    },
    {
        "author": "Zekator",
        "created_utc": 1599592775,
        "id": "ip04na",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "The renowned Drill Team 26 has risen.\n\n🌈🐻 team has awaken.\n\nRun, you TSLA call holders.\n\nBuy all the poots you cans!\n\n\nThe oracle has outspoken the bullies.",
        "subreddit": "wallstreetbets",
        "title": "Drill Team 26 REVIVE!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ip04na/drill_team_26_revive/",
        "created": 1599621575.0
    },
    {
        "author": "tradingguides",
        "created_utc": 1600057121,
        "id": "isduis",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "ByteDance drops TikTok's U.S. sale, to partner with Oracle: sources",
        "url": "https://finance.yahoo.com/news/bytedance-picks-oracle-winning-bidder-000109920.html",
        "created": 1600085921.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1600429631,
        "id": "iv4je2",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Buy oracle calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iv4je2/buy_oracle_calls/",
        "created": 1600458431.0
    },
    {
        "author": "Spidda",
        "created_utc": 1600066987,
        "id": "isg0rs",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Read this before you go YOLOing oracle",
        "url": "https://news.cgtn.com/news/2020-09-14/ByteDance-rejects-Microsoft-s-bid-for-TikTok-TLLgABWx56/index.html",
        "created": 1600095787.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1599319849,
        "id": "in322p",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 7th, 2020.\n\n# **The stock market shakeout is likely not over yet, even with Friday’s comeback  - [(Source)](https://www.cnbc.com/2020/09/04/the-stock-market-shakeout-is-likely-not-over-yet-even-with-fridays-comeback.html)**\n*****\n&gt; The tech wreck is probably not over, despite Friday’s market comeback.\n*****\n&gt; Analysts expect the shakeout in stocks to continue after the long Labor Day weekend, especially in technology names and the Nasdaq, areas of the market that notched the sharpest gains.\n*****\n&gt; After August’s 7% gain in the S&amp;P 500, stocks started September strong, and then just as quickly rolled over. The Nasdaq lost 5% Thursday and was down sharply Friday but pared losses to decline 1.5%. The S&amp;P 500 was down about 2.3% for the week, even after a 3.5% loss Thursday.\n*****\n&gt; “I think this is a good wake-up call and a reminder that there are risks out there,” said Leo Grohowski, chief investment officer at BNY Mellon Wealth Management. “In August, we did take a little bit off the table.”\n*****\n&gt; Analysts expect the week ahead to be busy, with holidays ending and more market pros back at their desks. There is some economic data, most importantly Friday’s consumer price index. The reading on consumer inflation is expected to show little change in core inflation with forecasts for a gain of just 0.2% in August, or 1.6% year over year.\n*****\n&gt; # Froth blowing off\n&gt; The stock sell-off came as market pros were becoming increasingly wary of froth in the market, particularly in tech and momentum names. On Friday, it was revealed that SoftBank was behind billions in large options bets on individual tech stocks, like Amazon, Microsoft, Apple and Tesla. News reports said the trades were made over the past month, and SoftBank had been building unusually large positions in call options, or those that bet the prices of underlying stocks would rise.\n*****\n&gt; One analyst said the fact that SoftBank was “gunning the market” makes him worry that there is more selling to come in Nasdaq names. As SoftBank bought call options, the sellers had to buy stocks, conceivably driving up prices in a trading feedback loop.\n*****\n&gt; “It’s just a trip to the casino,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “If they’re supposed to be an investment company taking a long-term horizon, then trying to juice your short-term return through options, you’ve turned into a hedge fund.”\n*****\n&gt; JPMorgan strategists said they expect the market to recover gradually, but there are still presidential election uncertainties looming in the next couple of months.\n*****\n&gt; “The significant reduction in previously extreme long positions in Nasdaq by momentum traders should allow the equity market to recover over the coming weeks, as happened after the June 11th correction,” noted JPMorgan analysts. “But a repeat of the strong gains seen during July and August is less likely over the next two months.”\n*****\n&gt; Grohowski said there could be more selling in the tech and internet companies, or those that were viewed did well as workers stayed home and the economy was shutdown. “It’s not the start of a big lasting correction, but a forewarning the next couple of weeks and months are going to be choppy. I think it’s going to be a sideways kind of market,” Grohowski said. He added the market could be choppy in the week ahead.\n*****\n&gt; “We’re a little more cautious, not to mention the market is trading at 23 times our earnings estimates for 2021,” said Grohowski. He said the fact there is about $4.5 trillion in money market funds is a bullish signm since that money could find its way into the stock market.\n*****\n&gt; Julian Emanuel, head of equities and derivatives strategy at BTIG, said the S&amp;P 500 could dip to its 200-day moving average, or 3,092, before rebounding, which would be about a 15% move in total.\n*****\n&gt; “I don’t think the sell-off is over. Nasdaq is up 83%s since March 23, the S&amp;P is up 63%,” said Emanuel.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/34qCxpv.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/1u5feMS.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/WfvTGox.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/sDw87zF7/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/bUFp72p.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cgvDyfD.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SJ4plDu.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/g1WP8F6.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NcrK823.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/NkAezup.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/D3X10mF.png))**\n\n*****\n\n&gt; # Small Caps Best Day After Labor Day\n\n&gt; In the last 21 years, only Russell 2000 has registered an average gain of 0.16% on the Tuesday after the long Labor Day weekend. DJIA, S&amp;P 500 and NASDAQ have struggled with negative average performance. NASDAQ and Russell 2000 have been up five of the last eight years, but DJIA, S&amp;P 500, NASDAQ and Russell 2000 all have fallen for the last three years on Tuesday. On Wednesday the market’s performance has been varied. DJIA has performed the best, up 76.2% of the time with an average gain of 0.25%. S&amp;P 500 is worst, up only 42.9% of the time with an average gain of 0.13%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/1422a049f2b0dbca39b1543c5cff0a42/172c7870552d9912-60/s500x750/ff92c03e01c3e886a523a64381a9c44745538da2.jpg))**\n\n*****\n\n&gt; # Big August: Bullish or Bearish?\n\n&gt; Big August 2020 logged the 4th biggest August percent gain for the S&amp;P 500 since 1949 and the 6th biggest since 1930. But, is this bullish or bearish for the market in the coming months? Hopefully the table below provides some perspective by comparing the previous Top 20 S&amp;P 500 Augusts since 1949 to July, September, Q4 and the succeeding “Best Six Months” November-April.\n\n&gt; Subsequent Septembers were down 15 of 20 years for an average loss of -1.0% (median loss of -0.7%). Q4 is positive with gains in 13 of the 20 years for an average gain of 1.0% (median gain of 3.0%). The following Best Six Months are more bullish, up 16 of the 20 years with an average gain of 7.6% (median gain of 8.5%).\n\n&gt; Looking at just the 7 years that were preceded by big Julys shows some improvement for September but Q4s are worse, containing the largest Q4 losses. Back-to-back big Julys and big Augusts were followed by improved Best Six Months results, up in all 7 instances with a higher average and median gain and the top gain.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/7bd7299f2e7714adc709577da928964e/bd54fb998db4a9e1-46/s1280x1920/3363ff03bfc2dead6e88b387771b6bbad2aafece.jpg))**\n\n*****\n\n&gt; # Analyzing the Jobs Report\n\n&gt; The jobs market remains strong, as the August nonfarm payrolls came in at a solid 1.37 million jobs created, right in line with expectations. This was the fourth consecutive month of gains, up 10.6 million over this time frame. In March and April more than 22 million jobs were lost, so we still aren’t quite to half of the jobs recovered though.\n\n&gt; This was the second consecutive month there was a very weak ADP private payrolls number ahead of the monthly jobs report, adding to the worries, but the actual nonfarm payroll number was once again quite solid. Don’t forget, just yesterday we saw initial jobless claims come in at 881,000, the lowest number since the week ending March 14, another improving employment number.\n\n&gt; The big surprise in today’s report though was the unemployment rate fell to 8.4%, from 10.2% last month and an expected 9.8%. This was the lowest unemployment rate since 4.4% in March.\n\n&gt; “This was an impressive report and once again showed the economy remained quite resilient,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But 8% unemployment is 8% unemployment, so let’s not get too excited, but we’ll still take this improving trend in the employment picture.”\n\n&gt; As shown in the LPL Chart of the Day, even though more than 10 million jobs have been created in the past four months, the sad truth is we are still quite a long way from recovering all the jobs lost due to the pandemic. In fact, looking at previous cycles, it has taken years for all of the lost jobs to come back and this time doesn’t appear any different.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20.png?ssl=1))**\n\n&gt; One thing to consider is could this solid number make it harder for Washington to agree on the next stimulus plan? We are watching this closely, but with the two sides still close to a trillion dollars apart, today’s report will likely do little to help the two sides come to a quick resolution.\n\n&gt; Last, don’t forget that stocks gained more than 60% in less than six months, so some weakness would be perfectly normal. In fact, looking at the two previous strongest starts to a bull market ever (’82 and ’09) both saw some weakness right around now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/Blog-9.4.20-2.png?ssl=1))**\n\n*****\n\n&gt; # 3 Charts To Watch If You Are Bullish\n\n&gt; The S&amp;P 500 Index just closed the door on its best August since 1986, making new all-time highs along the way, while also closing up five months in a row.\n\n&gt; First things first, make no mistake about it; this is a new bull market. That of course doesn’t mean it will last years like previous bull markets, but a nearly 57% gain in 5 months is what we’d classify as a bull market.\n\n&gt; Here are all the bull markets going back to the Great Depression and where this one ranks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-1.png?ssl=1))**\n\n&gt; Now let’s dig into the 5 month win streak. It is quite rare for stocks to gain from April through August, as the summer months tend to be somewhat tricky. Yet, we found there were six other years that saw these 5 months all close higher and the rest of the year was higher five times, with some solid returns in there. In fact, the only year that was lower the rest of the year was 2018, mainly due to the Fed policy mistake in December 2018.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-2.png?ssl=1))**\n\n&gt; “What might surprise many investors is 5 month win streaks are actually incredibly bullish going forward,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, a year after a 5 month win streak has seen the S&amp;P 500 higher 25 of the past 26 times.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 Index gained more than 35% during this 5 month win streak, the most ever. Yet, the future gains after 5 month win streaks is very impressive, higher 25 out of 26 times a year later. An object in motion tends to stay in motion and this sure seems to be the case here.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/09/9.2.20-blog-chart-3.png?ssl=1))**\n\n*****\n\n&gt; # Historic August Opens Door To Worst Month Of The Year\n\n&gt; What a month August has been so far, with the S&amp;P 500 Index up more than 7%, for the best August since 1984. Not to be outdone, this is the first time in history August saw two separate 6-day (or more) win streaks. Last, with one day to go, the S&amp;P 500 has gained 16 days so far this month, for the most since 16 in April 2019. Meanwhile, it is the most up days for any August since 2003.\n\n&gt; “Well, 2020 has laughed at many of these things, but be aware September is indeed the worst month of the year on average,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But what caught our attention was both September and October have a negative return during election years, with October the worst month of the year. Could investors get election jitters again in 2020?”\n\n&gt; As show in the LPL Chart of the Day, September tends to be a weak month. In fact, it is the weakest month on average since 1950. Additionally, the last two times August was up more than 5% were 1986 and 2000; the S&amp;P 500 fell 8.5% and 5.4% in September those years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Breaking things down by just an election year shows that August actually tends to be strong. That obviously played out this year, but now will the weakness we usually see in September and October play out?\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chart-2.png?ssl=1))**\n\n&gt; Finally, after today, the S&amp;P 500 will be up 5 consecutive months. Looking at the other years that saw a similar summer rallies, there tended to be more strength the final 4 months of the year, with only the Federal Reserve policy mistake of December 2018 blemishing this impressive track record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/08/8.31.20-Blog-Chaert-3.png?ssl=1))**\n\n&gt; Yes, this record equity run is extremely stretched, but we would continue to use any pullbacks as an opportunity to add to longer-term core equity holdings, as the economy continues to come back quicker than most expected.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending September 4th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 9.6.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED!)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$PTON** \n&gt; * **$WORK** \n&gt; * **$LULU** \n&gt; * **$CHWY** \n&gt; * **$KR** \n&gt; * **$ZS** \n&gt; * **$COUP** \n&gt; * **$LOVE** \n&gt; * **$AEO** \n&gt; * **$HQY** \n&gt; * **$GFN** \n&gt; * **$GME** \n&gt; * **$ORCL** \n&gt; * **$PLAY** \n&gt; * **$RH** \n&gt; * **$HDS** \n&gt; * **$UXIN** \n&gt; * **$MCFT** \n&gt; * **$FCEL** \n&gt; * **$CASY** \n&gt; * **$MEIP** \n&gt; * **$NAV** \n&gt; * **$REVG** \n&gt; * **$NSSC** \n&gt; * **$ABM** \n&gt; * **$SCWX** \n&gt; * **$PHR** \n&gt; * **$ALOT** \n&gt; * **$CVGW** \n&gt; * **$DSGX** \n&gt; * **$ZUMZ** \n&gt; * **$GIII** \n&gt; * **$AVAV** \n&gt; * **$BIOX** \n&gt; * **$BIGC** \n&gt; * **$LAKE** \n&gt; * **$LTRX** \n&gt; * **$BBCP** \n&gt; * **$VRNT** \n&gt; * **$FARM**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/GtFbRTWy/er1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/2yRCg7KY/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 9.7.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n&gt; # ***Monday 9.7.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF LABOR DAY.)\n\n*****\n\n&gt; # ***Tuesday  9.8.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/U3gzGVc.png))\n\n&gt; # ***Tuesday 9.8.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/KToPkBD.png))\n\n*****\n\n&gt; # ***Wednesday 9.9.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0aK2q13.png))\n\n&gt; # ***Wednesday 9.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ku04emu.png))\n\n*****\n\n&gt; # ***Thursday 9.10.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Thursday 9.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/T5g4xA6.png))\n\n*****\n\n&gt; # ***Friday 9.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.11.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Peloton Interactive $80.63\n**Peloton Interactive (PTON)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 10, 2020. The consensus earnings estimate is $0.10 per share on revenue of $566.53 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat The company's guidance was for revenue of $500.00 million to $520.00 million. Short interest has decreased by 62.5% since the company's last earnings release while the stock has drifted higher by 78.8% from its open following the earnings release to be 92.6% above its 200 day moving average of $41.86. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 11.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PTON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Slack Technologies, Inc. $29.07\n**Slack Technologies, Inc. (WORK)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, September 8, 2020. The consensus estimate is for a loss of $0.03 per share on revenue of $208.33 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for a loss of $0.04 to $0.03 per share on revenue of $206.00 million to $209.00 million. Consensus estimates are for year-over-year earnings growth of 96.94% with revenue increasing by 43.70%. Short interest has increased by 93.1% since the company's last earnings release while the stock has drifted lower by 8.5% from its open following the earnings release to be 6.8% above its 200 day moving average of $27.22. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 7.8% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WORK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # lululemon athletica inc. $361.41\n**lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.56 per share on revenue of $832.92 million and the Earnings Whisper ® number is $0.60 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 41.67% with revenue decreasing by 5.71%. Short interest has decreased by 16.0% since the company's last earnings release while the stock has drifted higher by 19.3% from its open following the earnings release to be 38.7% above its 200 day moving average of $260.62. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 11.0% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $61.18\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:10 PM ET on Thursday, September 10, 2020. The consensus estimate is for a loss of $0.15 per share on revenue of $1.64 billion and the Earnings Whisper ® number is ($0.14) per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 28.57% with revenue increasing by 42.17%. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 20.1% from its open following the earnings release to be 57.3% above its 200 day moving average of $38.89. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Kroger Co. $35.47\n**Kroger Co. (KR)** is confirmed to report earnings at approximately 7:30 AM ET on Friday, September 11, 2020. The consensus earnings estimate is $0.50 per share on revenue of $29.66 billion and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.64% with revenue increasing by 5.30%. Short interest has increased by 8.3% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 13.1% above its 200 day moving average of $31.36. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, August 24, 2020 there was some notable buying of 2,648 contracts of the $33.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 7.5% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Zscaler, Inc. $134.34\n**Zscaler, Inc. (ZS)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 9, 2020. The consensus earnings estimate is $0.03 per share on revenue of $118.41 million and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for earnings of $0.02 to $0.03 per share on revenue of $117.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 57.14% with revenue increasing by 37.51%. Short interest has decreased by 23.9% since the company's last earnings release while the stock has drifted higher by 54.3% from its open following the earnings release to be 68.5% above its 200 day moving average of $79.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, August 20, 2020 there was some notable buying of 1,017 contracts of the $115.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 16.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Coupa Software $285.81\n**Coupa Software (COUP)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.08 per share on revenue of $118.84 million and the Earnings Whisper ® number is $0.14 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat The company's guidance was for earnings of $0.06 to $0.08 per share on revenue of $118.00 million to $119.00 million. Consensus estimates are for earnings to decline year-over-year by 11.11% with revenue increasing by 24.91%. Short interest has decreased by 12.9% since the company's last earnings release while the stock has drifted higher by 34.2% from its open following the earnings release to be 41.3% above its 200 day moving average of $202.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, August 17, 2020 there was some notable buying of 538 contracts of the $270.00 put expiring on Friday, September 18, 2020. Option traders are pricing in a 18.8% move on earnings and the stock has averaged a 8.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lovesac Company $29.44\n**Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.55 per share on revenue of $52.58 million and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 77.42% with revenue increasing by 9.21%. Short interest has decreased by 29.1% since the company's last earnings release while the stock has drifted higher by 41.0% from its open following the earnings release to be 74.7% above its 200 day moving average of $16.85. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 20.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # American Eagle Outfitters, Inc. $12.86\n**American Eagle Outfitters, Inc. (AEO)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, September 9, 2020. The consensus estimate is for a loss of $0.14 per share on revenue of $833.66 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.90% with revenue decreasing by 19.91%. Short interest has increased by 45.8% since the company's last earnings release while the stock has drifted higher by 13.8% from its open following the earnings release to be 11.4% above its 200 day moving average of $11.54. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 21, 2020 there was some notable buying of 5,605 contracts of the $11.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 13.8% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AEO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HealthEquity, Inc. $58.47\n**HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, September 8, 2020. The consensus earnings estimate is $0.27 per share on revenue of $171.32 million and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat The company's guidance was for earnings of $0.23 to $0.30 per share on revenue of $168.00 million to $173.00 million. Consensus estimates are for earnings to decline year-over-year by 40.00% with revenue increasing by 97.78%. Short interest has decreased by 3.6% since the company's last earnings release while the stock has drifted higher by 2.7% from its open following the earnings release to be 3.5% below its 200 day moving average of $60.62. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming holiday-shortened trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning September 7th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/in322p/wall_street_week_ahead_for_the_trading_week/",
        "created": 1599348649.0
    },
    {
        "author": "cclagator",
        "created_utc": 1599583052,
        "id": "iowy9u",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Expected moves and what's next: SPY, QQQ, ORCL, PTON, LULU, WORK and more.",
        "url": "https://www.reddit.com/r/options/comments/iowy9u/expected_moves_and_whats_next_spy_qqq_orcl_pton/",
        "created": 1599611852.0
    },
    {
        "author": "Thekisk",
        "created_utc": 1600045835,
        "id": "isaxf3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Thoughts on Oracle buying TikTok",
        "url": "https://www.reddit.com/r/RobinHood/comments/isaxf3/thoughts_on_oracle_buying_tiktok/",
        "created": 1600074635.0
    },
    {
        "author": "Poboxjosh",
        "created_utc": 1600040891,
        "id": "is9lpm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Oracle Chosen as Winner in Deal for TikTok’s U.S. Operations — The Wall Street Journal",
        "url": "https://apple.news/AhCgqwCSARkiXY8tXvyCBqw",
        "created": 1600069691.0
    },
    {
        "author": "strategicplanner",
        "created_utc": 1600043939,
        "id": "isafm1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Oracle won Tik Tok battle",
        "url": "https://www.reddit.com/r/stocks/comments/isafm1/oracle_won_tik_tok_battle/",
        "created": 1600072739.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1600040648,
        "id": "is9j9t",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "ByteDance Picks Oracle As Winning Bidder For TikTok’s US Operations - RTRS Citing Sources",
        "url": "https://twitter.com/LiveSquawk/status/1305290003635933184",
        "created": 1600069448.0
    },
    {
        "author": "Bdavid5",
        "created_utc": 1600086706,
        "id": "isjy8n",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "# Is the U.S. market sell-off coming to an end this week?\n\n# U.S. Stock Futures Push Higher Amid 3 Merger Deals\n\n[U.S. stock futures](http://www.stockmarket.com/investing) are rising after two weeks of [stock market](https://stockmarket.com/stock-market-trends-articles/what-is-the-stock-market-2020-06-01) sell-off. Is this a sign of bigger upward movements to come? The positive sentiments came from news of high profile acquisition over the weekend. The Dow futures traded 0.82% higher. The [S&amp;P 500](https://stockmarket.com/ticker?symbol=SPY) and [Nasdaq 100](https://stockmarket.com/ticker?symbol=QQQ) futures were also in positive territory, moving 1.18% and 1.7% higher respectively as of 6.58 a.m. ET.\n\nThere are a few reasons for the strong start of the week. This came after Nvidia ([NVDA Stock Report](https://stockmarket.com/ticker?symbol=NVDA)) reported that it will acquire wireless chip designer Arm Holdings from SoftBank for $40 billion. In addition, China’s ByteDance has reportedly agreed to sell the U.S. operations of TikTok to Oracle ([ORCL Stock Report](https://stockmarket.com/ticker?symbol=ORCL)). So if you’re looking for any trading activity on Monday, the tech sector could be a good place to start.\n\n## Coronavirus Vaccine Hopes Boosts Market Confidence\n\nCoronavirus cases worldwide have surpassed 29 million. Covid-19 deaths are now more than 900,000. In the U.S. alone, coronavirus cases have hit 6.70 million, with deaths above 198,000. However, most importantly will be the impact on market sentiment this week as AstraZeneca ([AZN Stock Report](https://stockmarket.com/ticker?symbol=AZN)) restarted their final-stage trial of its coronavirus vaccine. The trial was paused last week after one fell ill. Thus far, it’s still unclear what the reason was. Perhaps it was related to the vaccine. But it is just as likely that it was totally unrelated.\n\nPfizer ([PFE Stock Report](https://stockmarket.com/ticker?symbol=PFE)) and BioNTech ([BNTX Stock Report](https://stockmarket.com/ticker?symbol=BNTX)) are looking to expand their late-stage coronavirus vaccine trial to 44,000 people, from 30,000. That would allow testing on a more diverse population. The AstraZeneca and Pfizer-BioNTech vaccine candidates are generally seen as furthest along, with Moderna ([MRNA Stock Report](https://stockmarket.com/ticker?symbol=MRNA)) following closely behind. With a slight ‘positive’ development from the vaccine manufacturers, the market appears to be optimistic. This likely contributed partly to the rise of the U.S. stock futures on Sunday evening.\n\n## Apple’s September 15 “Time Flies” Event; What To Expect?\n\nApple ([AAPL Stock Report](https://stockmarket.com/ticker?symbol=AAPL)) unveils its new lineup of Apple devices on September 15 at 10 a.m PT.  This may pave the way for the arrival of the iPhone 12, which will finally find the company embracing 5G technology. On top of that, almost certainly, the trillion-dollar tech company would also introduce a new Apple Watch. The device continues to be a big seller for the company, not to mention being a category-leading product. \n\nAnd strings for an “Apple One” bundle have shown up in code for an Apple Music app for Android. This is suggesting that Apple may be close to launching its rumored range of subscription bundles. While consumers are no doubt very excited to check out the latest products and services from Apple, investors are trying to get a grasp on how the stock would perform around the event date. Will Apple surprise investors with news that can send AAPL stock higher this week? Stay tuned.\n\n## Federal Reserve Policy Meeting\n\nThe Federal Open Market Committee’s (FOMC) meeting on Tuesday and Wednesday should be closely watched by investors. This comes after weeks following the central bank’s annual economic policy symposium. Recall that officials announced a new framework that is more tolerant of inflation overshooting the 2% target. This reduces the need for officials to raise rates to curtail a run-up in inflation.\n\nWith many expecting the Fed to maintain its dovish stance on policy, investors will continue assessing the recovery of the global economy from the pandemic. Traders are mindful of recent news on volatility in the options markets. After all, that poses a question mark on the sustainability of the market rally in the past few months. \n\n## Gold Gains On Weaker Dollar\n\n[Gold prices](https://stockmarket.com/featured/top-gold-stocks-to-watch-in-september-2020-2020-09-01) rose on Monday, supported by a weaker dollar and expectations that the Fed will adopt a dovish stance like we just mentioned. It rose nearly 0.3% to $1,946.67 per ounce as of 3.43 a.m. ET. As major central banks continue to roll out stimulus measures and keep interest rates low, gold prices will continue to find strong support because of its role as a hedge against inflation.\n\n“The gold market is leaning towards the Fed’s policy,” said Stephen Innes, chief market strategist at AxiCorp, adding that the U.S. central bank might not change the current narrative, but there is a strong belief in the market that it would be able to trigger inflation.",
        "subreddit": "StockMarket",
        "title": "Top 5 Things To Watch In The Stock Market This Week",
        "url": "https://www.reddit.com/r/StockMarket/comments/isjy8n/top_5_things_to_watch_in_the_stock_market_this/",
        "created": 1600115506.0
    },
    {
        "author": "pizzasorus",
        "created_utc": 1600228125,
        "id": "ito7xc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ORCL to the moon?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ito7xc/orcl_to_the_moon/",
        "created": 1600256925.0
    },
    {
        "author": "Astro1T",
        "created_utc": 1600092489,
        "id": "isljen",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "oracle stock halted",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/isljen/oracle_stock_halted/",
        "created": 1600121289.0
    },
    {
        "author": "xwaytoohot",
        "created_utc": 1600094002,
        "id": "islzw7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Oracle successfully completes deal to provide cloud computing for Tik Tok = Next meme stock. Get in now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/islzw7/oracle_successfully_completes_deal_to_provide/",
        "created": 1600122802.0
    }
]