[
    {
        "author": "keenanodonnell1",
        "created_utc": 1606829771,
        "id": "k4kxnc",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "New computer parts like Graphics cards and CPU’s are selling out immediately and selling for a lot higher than their retail price on the secondary market. This is something the Gaming PC space has not seen at this level before and it shows just how high the demand is for gaming PC’s right now. Stocks like AMD and Nvidia might seem like the best stocks to buy because it’s their parts that are selling out selling out. However they are such big companies and we wont see their prices go to the moon. While I do recommend buying AMD because of their recent leaps in CPU dominance over intel, their new  gaming GPU (6900XT) that is faster than Nvidia for the first time in years (and for 2/3 the price no less) and the fact that they make the Silicon for both the PS5 and new Xbox. I would not expect AMD to moon just became of Christmas Sales, it’s more of a long term play. However With this new spotlight on the PC gaming market, Corsair should see a massive increase in revenue. If you know anything about PC gaming you know the name Corsair. I for one own multiple Corsair products and am very happy with them, which is why I bought Corsair at IPO a few months ago. All kids want this year is Consoles and Gaming PC’s and even professionals have started investing more money into the PC space because they are on their computers all day due to the pandemic. All this crazy demand around the PC space 100% helps Corsair. They are a huge player in the PC market and they make everything from custom water cooling parts for PC enthusiasts to headsets for console gamers. Corsair also owns El Gato. El Gato makes products such as screen capture cards and webcams, things that have seen a huge increase in sales during the pandemic due to their usefulness in online meetings. All this combined makes Corsair a necessary stock to own this Christmas Season.",
        "subreddit": "wallstreetbets",
        "title": "Corsair Going Up More... A lot More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k4kxnc/corsair_going_up_more_a_lot_more/",
        "created": 1606858571.0
    },
    {
        "author": "FinishRegular1623",
        "created_utc": 1606811490,
        "id": "k4h1mu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi guys. I have about 2k to invest and can't decide between the two. Before anyone says do both, I'm looking to see which is a better investment? They both seem like amazing investment opportunities.\n\n\nSales force has a potential client in Any worldwide company in sales. Cloud is expanding exponentially. \n\nNvidia seems like it will be the AI winner and the future of robotics, autonomous cars, etc will be an enormous market. \n\nThoughts?",
        "subreddit": "StockMarket",
        "title": "Sales force or nvidia long term",
        "url": "https://www.reddit.com/r/StockMarket/comments/k4h1mu/sales_force_or_nvidia_long_term/",
        "created": 1606840290.0
    }
]