[
    {
        "author": "GatoAmarillo",
        "created_utc": 1600279925,
        "id": "iu12f6",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Ok i didn't intend on rhyming the title but I like it. Six Flags is a popular amusement park chain with 26 different parks spread across America. When the coronavirus happened, they quickly adapted the necessary changes they needed to re-open their parks as fast as possible and keep them clean.\n\nAccording to [this article](https://www.businesswire.com/news/home/20200526005337/en/%C2%A0Six-Flags-Announces-Extensive-New-Safety-Measures-for-Reopening-Parks) they reopened their park, Frontier City on June 5th. (AMC finally opened their theaters last weekend  [😴](https://emojipedia.org/sleeping-face/#:~:text=A%20yellow%20face%20with%20eyes,to%20indicate%20it's%20sound%20asleep.&amp;text=Generally%20used%20instead%20of%20%F0%9F%98%AA,to%20Emoji%201.0%20in%202015.)) Six Flags started with a minimal guest policy at first because of corona, and over time are becoming more lenient and letting more people in to keep boosting revenue.\n\nAlso they now use some king of IR thermal imaging device on your eyeball to see if you're healthy. They do that to everyone who goes in the park including employees. The rest of the article goes on about their social distancing policies and being sanitary.\n\nThey've been slowly opening up all of their parks and as of now Hurricane Harbor is the only park that's closed. That leaves them with 25 open parks to rake in those tendies for their earnings date (10/27/20) For people that had the season pass to that closed park, Six Flags guaranteed them free admission for all of 2021. They truly have very friendly staff  and with all the activities to do it's easy to be there literally all day. I've been to Six Flags Great America countless times. Go on the Raging Bull pussy, it's not that bad.\n\nThey had a fairly stable stock for years hovering around the high $50s to the high $60s. As of this very second $SIX is at $25.30 and their stock went up by over a dollar today alone with 3 hours left to go until the market closes. It's moving upwards at a modest pace and headed back towards their old levels. I suspect it will be at least two or three years before we see their old stock prices back again, but they're for sure on the road to success. This is such an easy play. to hop on.\n\nThis might be one of the rare DD you read about BEFORE it moons. \"~~This stock is up over 200% this year and 35% this week alone and you should buy it~~\" There's still time left with this one! Although I wish I learned all this back in June...we're not late to this bus.  \n\nI already bought my position this morning. I would buy two but I'm limited on capital.  Pretty sure I overpaid for the option by $40, but less than ten minutes later I was green. Up $45 right now\n\nPosition: 01/22/2022 $SIX $15c                                  Earnings: 10/27/2020\n\nAlternative Position: 01/20/2023 $SIX $12.5c\n\nI only bought the first position, but if you want to milk the living shit out of this I would go with the alternative position or why not both? I wouldn't skimp on the strike prices and go OTM because you'll wind up with theta deep up your ass. This stock doesn't have a whole lot to run, only up to $50 or so and if you're buying OTM leaps you will have to wait a long time for serious movement to get any decent gains that theta will rob from you anyways These ITM LEAPS only cost around twice as much as the slightly OTM LEAPS. My position above has 0.85 delta, so for every $1 the stock moves my/your contract value goes up $85.\n\nyes these are long-dated positions but you don't have to hold it for very long if you don't want to. I could cash out of this play right now and move on, but I know there's just so much more potential left inside. \n\n[Position Screenshot](https://i.imgur.com/JHqo3ga.png)\n\n[My All-Time Screenshot](https://i.imgur.com/6lVD2gb.png) ($3.8k buying power is because I just sold my MSFT leap at the beginning of today's dip but I plan on re-entering)\n\nWhy should you listen to me? Yes my account is small, but I only saved $300/paycheck for maybe 6 or 8 months and I played the stock market until the march crash where I was down around 30%. I spent two months learning about options during lockdown and made damn sure I knew what I was doing before trying it. May 14th was the first day I bought options, That's also exactly when the graph starts going vertical. See that peak? That's what happens when you buy TSLA calls pre-split and panic sell them. Also SNAP earnings followed by some SPY puts [🤡](https://emojipedia.org/clown-face/)\n\nAnyway, this is the only play on a company I've come up with where I can confidently share it with everyone knowing that you will make some money. It ain't super fast money but over time it will add up.  Good luck!",
        "subreddit": "wallstreetbets",
        "title": "Six Flag's Great Recovery - Buying calls is easy money! $SIX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iu12f6/six_flags_great_recovery_buying_calls_is_easy/",
        "created": 1600308725.0
    },
    {
        "author": "cnarberry",
        "created_utc": 1599455849,
        "id": "io1iof",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hey guys. \n\nLearned a valuable and expensive lesson with this correction about risk management - safe to say it won't be happening again. \n\nCurrently in damage control mode.\n\nOn the 2nd of September, I purchased:\n\n&amp;#x200B;\n\n*  LULU18Sep2020C400 x 6\n*  TSM16Oct20C85.00  x 31\n*  COST09Oct20C355.00 x 8\n*  PTON25Sep20C90.00  x 9\n\nAt the end of the trading day I was up 14k - this reaffirmed my decision in these options. Should have definitely locked in the gains and walked away with the profits but I didn't. Another valuable lesson there.\n\nMy plan was to ride the pre- anticipatory hype prior to each earnings report on all of these then sell most if not all prior to the ER.\n\nCurrently, as of Friday market close my positions stand\n\nLULU -57% . ER on SEP 8 AMC  \nPTON -24%. ER on SEP 10 AMC  \nCOST -7%.. ER on Sep 24 AMC  \nTSM  -11% . ER on Oct 15th\n\n&amp;#x200B;\n\nMy current plan is to let COST &amp; TSM run its course but LULU and PTON got decimated. Would it be a terrible idea to hold two through earnings in hopes of recovering some premium?\n\n&amp;#x200B;\n\nAny productive insight appreciated. \n\nThanks",
        "subreddit": "options",
        "title": "Purchased 40k calls prior to correction - $LULU $PTON $COST $TSM.",
        "url": "https://www.reddit.com/r/options/comments/io1iof/purchased_40k_calls_prior_to_correction_lulu_pton/",
        "created": 1599484649.0
    },
    {
        "author": "Ryanhockey33",
        "created_utc": 1599667140,
        "id": "ipio7j",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "I bought my first call with AMC and I don’t know when to get out... any tips?",
        "url": "https://i.redd.it/5xll4po6a5m51.jpg",
        "created": 1599695940.0
    },
    {
        "author": "kshdheuh",
        "created_utc": 1599244281,
        "id": "imlhso",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Which one of you retards told my brother that AMC was a good call? My brothers wife’s boyfriend beat the shit out of him for losing the cigarette budget for this week. Now how will he ever get to eat at the table again? I hope you fucks are happy",
        "subreddit": "wallstreetbets",
        "title": "AMC???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imlhso/amc/",
        "created": 1599273081.0
    },
    {
        "author": "L_O_Pluto",
        "created_utc": 1600206602,
        "id": "itiiln",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "So, I'm relatively new to the market. I'm a day trader and I've been doing a lot of learning on technical analysis and studies to help me minimize risk and increase gains. Lately, I've been a little frustrated because no matter how much I learn, nothing feels or looks like the tight trade. Before anyone says that I should not trade with feelings, I know this. I try to see all the evidence that predicts the movement of a stock and make a move from it, but fear usually ends up wining and I miss out on the trade. Back on topic, I think I've hit a wall, and AMC today is the best example. And just to clarify, I had no stake in any of the two instances I'm going to point out. I'm just dumbfound and perplexed and want to understand.\n\n[Chart](https://imgur.com/a/KvgSlx9)\n\nNow, there are only two things i know about that could have predicted or called the rise I circled, but even then it feels like I'm missing more information, or rather, making a trade out of those two things alone seems very risky. The two things are: usually, when the MACD histogram goes \"dead\" for a while, the stock tend to go boom in either direction, but here the histogram wasn't even that dead. The only other thing is what appears to be a 3 bar play. Are there any other factors that I could have taken into account to predict such violent rise?\n\nNow, regarding that thick yellow regression line I drew on the chart, how could I have seen such regression coming? Aside from the fact that that big previous jump in price had to be corrected, how could I have predicted that that's when it would fall?\n\n\"Predict\" is probably the wrong word but it's the best one I can think of right now. I appreciate any and all pointers. If all you feel like answering is a simple subject that i can do research on (i.e. technical analysis) I will very gladly take it and appreciate it. Thank you for taking the time to read this wall of text :)",
        "subreddit": "StockMarket",
        "title": "[QUESTION] Can someone help me understand what happened with AMC today please?",
        "url": "https://www.reddit.com/r/StockMarket/comments/itiiln/question_can_someone_help_me_understand_what/",
        "created": 1600235402.0
    },
    {
        "author": "carlosccextractor",
        "created_utc": 1599256704,
        "id": "imp8wf",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "AMC, a movie theater chain in the middle of a pandemic.\n\nIt was a pity buy during a stock buy buffet!\n\nBy the way - a shoutout to those of you that called me a retard for selling TSLA 3 days ago. I am a retard but not because of that.",
        "subreddit": "wallstreetbets",
        "title": "You know things are going to shit when you top performer is",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imp8wf/you_know_things_are_going_to_shit_when_you_top/",
        "created": 1599285504.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1599078618,
        "id": "ilex2y",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, September 2, 2020**\n\nStocks continued advancing on Wednesday, with investors encouraged by positive economic data and moderating COVID-19 infection rate in previous epicenters. Tech stocks once again led the charge, with industry bellwethers like Amazon ($AMZN) and Google ($GOOG) all opening at new record high. Apple ($AAPL) and Tesla ($TSLA) pulled back sharply from their post-stock split highs.\n\nTreasury Secretary Steven Mnuchin said Tuesday during a congressional hearing of the Select Subcommittee on the Coronavirus Crisis that he believed a bipartisan agreement on further fiscal stimulus “still should be reached. \n\nNewly announced economic data continues to surpass Wall St estimates. The ISM manufacturing index hit its highest levels since Aug 2018 and construction spending increasing. However, reports on the labor market are showing slower recovery. Per CNBC, ‘private payroll gains in August totaled 428,000, or less than half the 1 million jobs expected’.\n\nFollowing the best month in decades, investors appear hopeful and active in a usually slow month. There’s hope that increasingly better economic data, support from the Federal Reserve, the potential for fiscal stimulus, and a vaccine in the short, and states reopening can continue to push the market higher.\n\n**Highlights**\n\n* Macy’s ($M) temporarily alleviated fears of bankruptcy with a surprisingly encouraging earnings report. Stock was modestly down today.\n* AMC’s ($AMC) news that it would be reopening more theaters this weekend. Stock was up 16% today.\n* Intel $INTC launches 11th Gen Intel processors with, reportedly the world’s best processors for thin-and-light laptops. More than 150 designs based on 11th  Gen Intel Core processors are expected\n* Amarin[ $](https://twitter.com/search?q=%24AMRN&amp;src=cashtag_click)AMRN declined 28% on midday Wednesday as oral arguments on its appeal of a March ruling invalidating certain patents of its heart drug Vascepa begin\n* Berenberg decreased ($AAL) American Airlines price target from $14 to $10. (which is strange considering that today, they upgraded ($LUV) Southwest Airlines)\n* ($SDC) Smile Direct Club insiders (CEO, CFO and Director) purchased a combined 1.96 Million shares of stock for about $16 Million. Shares are up 23% so far in the day\n* Nvidia ($NVDA) has been on a tear recently. Stock is up 11.9% since Friday.\n\n**Notable Earnings for tomorrow, Sept 3:** Broadcom Inc ($AVGO), Campbell Soup ($CPB), Cooper Companies Inc ($COO), Docusign Inc ($DOCU),",
        "subreddit": "StockMarket",
        "title": "Here is a Market recap for today, Wed, Sept 2. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/ilex2y/here_is_a_market_recap_for_today_wed_sept_2/",
        "created": 1599107418.0
    },
    {
        "author": "Spirited_Sale_4972",
        "created_utc": 1599767255,
        "id": "iqarh8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "AMC Entertainment Holdings Inc\nNYSE: AMC are a company i entered today for a long view.\n\nA very profitable entertainment company with cinema/theaters etc. \n\nI feel we know enough about covid now to see the end of it around the corner of next year for rich western countries.\nThe stock price took a hammering as expected..and is only now starting to recover.\n\nTheir cash took a huge hit of course, but they've been getting enough investment to continue expansion!",
        "subreddit": "stocks",
        "title": "Amc",
        "url": "https://www.reddit.com/r/stocks/comments/iqarh8/amc/",
        "created": 1599796055.0
    },
    {
        "author": "pcw2019",
        "created_utc": 1599069885,
        "id": "ilbym6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "With movie theaters starting to slowly reopen, we’ve seen AMC start to make a comeback. Where do y’all see this stock going within a few months? A year? Will it retake its spot at $15 or will it remain permanently dwarfed from COVID?",
        "subreddit": "stocks",
        "title": "AMC movement",
        "url": "https://www.reddit.com/r/stocks/comments/ilbym6/amc_movement/",
        "created": 1599098685.0
    },
    {
        "author": "KL5400",
        "created_utc": 1599179781,
        "id": "im5up5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I know it’s not technically a penny stock but it’s around $6 rn, by mid September theatres are gonna open up again and volume is starting to pick up. Any thoughts on this being a play",
        "subreddit": "pennystocks",
        "title": "$AMC POTENTIAL PLAY",
        "url": "https://www.reddit.com/r/pennystocks/comments/im5up5/amc_potential_play/",
        "created": 1599208581.0
    },
    {
        "author": "Wiletj1",
        "created_utc": 1599089415,
        "id": "ili63n",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "When Are Your AMC Puts Expiring",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ili63n/when_are_your_amc_puts_expiring/",
        "created": 1599118215.0
    },
    {
        "author": "kushkiller1",
        "created_utc": 1599832625,
        "id": "iqqyc6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC CALLS? 80% of the theaters have reopened!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqqyc6/amc_calls_80_of_the_theaters_have_reopened/",
        "created": 1599861425.0
    },
    {
        "author": "GoldPitch",
        "created_utc": 1600698424,
        "id": "ix1g0c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I'm still pretty new at this, so constructive feedback much appreciated!\n\nAMC Networks ($AMCX) is a media company that owns cable channels, including AMC and BBC America. It’s also the channel responsible for some of the most iconic television shows of the past two decades, including *Mad Men* and *Breaking Bad*. \n\n**Thesis:**\n\nAMC is a deep value play currently trading at an 5-6x EV/EBIT and 50% FCF yield that offers a near-term catalyst in the form of a 20% buy-back program over the next month. Combined with the fact that \\~20% of the float is currently short, there is the potential for a rapid rise in price.\n\n**Decline of Linear TV**\n\nThe major concern of cable companies is the trend of cord cutting and the rise of streaming services. I am not here to argue against this trend — I think it is one that will continue to prove itself true in the coming years. AMC, however, is doing a reasonable job of adjusting to this new medium, and it is still in fairly good financial health. Let’s unpack both of these points further:\n\n1.  The transition into streaming\n\n* AMC currently has niche programming that is available via streaming video on demand (SVOD). AMC currently projects its five SVOD programs will have between 3.5-4million subscribers at $5/month. Assuming it hits the lower end of that estimate brings AMC an addition $210 million of revenue, good for over 16% of its current market cap. By comparison, Disney+ has over 60 million subscribers. While AMC’s SVOD caters only to niche audiences, that may be enough. SVOD is not meant to compete against Netflix or Disney+; it’s meant to complement these other streaming services. During the Q2 call, AMC noted that 80% of its SVOD subscribers also subscribe to a mainstream streaming service\n\n2.  Financial Viability\n\n* Revenue has continued to grow in the sub-5% clip, YoY pre-Covid. Revenue is down this year due to decrease in ad spending, though it is reasonable to expect an uptick due to Election season. The company has also earned in the neighborhood $6-7 per share in the past three years, though numbers are again down Q1 and Q2 2020 ($1.47 and $0.28, respectively). The company has \\~$800 million in cash, but it also has $2 billion in net debt. However, the company has consistently earned their market cap in free cash flow for the past few years, and I don’t view this debt as a major risk.\n\n**Catalyst**\n\nThe company announced a $250 million share buyback (all in cash) this past week that will be completed in the coming month, which represents about 20% of all shares outstanding. Combine this with the fact that \\~20% of the current float is short, and you have the potential for a major short squeeze.",
        "subreddit": "SecurityAnalysis",
        "title": "AMC Networks ($AMCX) -- A Deep Value Play with a Near-Term Catalyst",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/ix1g0c/amc_networks_amcx_a_deep_value_play_with_a/",
        "created": 1600727224.0
    },
    {
        "author": "JackMaverick7",
        "created_utc": 1599057722,
        "id": "il81vu",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMC up 15% today already and labor day weekend hasn't even started. Expect big viewing numbers coming out of this weekend as people head back to the big screen. Thoughts?",
        "url": "https://movieweb.com/amc-theatres-reopening-september-tenet/",
        "created": 1599086522.0
    },
    {
        "author": "Steelers6304",
        "created_utc": 1599332756,
        "id": "in6uq0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "How do you think AMC stock is going to do this weekend?",
        "url": "https://www.reddit.com/r/investing/comments/in6uq0/how_do_you_think_amc_stock_is_going_to_do_this/",
        "created": 1599361556.0
    },
    {
        "author": "FFunSize",
        "created_utc": 1599551882,
        "id": "iopltq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "With the release of Mulan on streaming services, what does this mean for movie theatres stocks like $AMC $IMAX $CGX.",
        "url": "https://www.reddit.com/r/stocks/comments/iopltq/with_the_release_of_mulan_on_streaming_services/",
        "created": 1599580682.0
    },
    {
        "author": "Curio5g3org3",
        "created_utc": 1600209680,
        "id": "itjept",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC network",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itjept/amc_network/",
        "created": 1600238480.0
    },
    {
        "author": "L_O_Pluto",
        "created_utc": 1600272639,
        "id": "itym3d",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Alright idiots everyone but AMC RIGHT NOW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itym3d/alright_idiots_everyone_but_amc_right_now/",
        "created": 1600301439.0
    },
    {
        "author": "tradingforkeeps",
        "created_utc": 1599137445,
        "id": "ilsrwf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Market Notes:**\n\nMarkets surged higher to another record high close yesterday. It looked like a massive short squeeze to me. The bulls are strong so I wouldn't look to fight them at this point. The trend is your friend.\n\nNew unemployment numbers are out, job losses remain steady just short of 1 million this week. Futures are in the red this morning, I'm expecting that to get bought up after the open.\n\nThe **VIX** remains relatively high for how bullish the market is.\n\nSeveral gambling stocks are in play today, I've got several on my watchlist.\n\n**Watchlist:**\n\n**TRNE** is a low float, resistance at $12.60\n\n**STRO** is a lowish float, support $11.50\n\n**CNTY** is a lowish float, key level around $6.80-6.90\n\n**ACEL** has resistance at $13.40\n\n**GMHI** has resistance at $12.20\n\n**GOGO** is on watch\n\n**TWI** watching for a setup above $2.60\n\n**GME** has resistance at $8\n\n**ATNX** has resistance at $14.40\n\n**AMC** is on watch\n\n**FBIO** has resistance at $4.20\n\n**FEAC** is on watch\n\n**DBD** has resistance at $9.40\n\n**SDC** watching for a setup above $10\n\n**IGT** has resistance at $12.20",
        "subreddit": "StockMarket",
        "title": "Watchlist: 9/3 Making Money, Jobs and Gambling",
        "url": "https://www.reddit.com/r/StockMarket/comments/ilsrwf/watchlist_93_making_money_jobs_and_gambling/",
        "created": 1599166245.0
    },
    {
        "author": "Wiletj1",
        "created_utc": 1599087565,
        "id": "ilhn1t",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Good Expiration Date for Shorting AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilhn1t/good_expiration_date_for_shorting_amc/",
        "created": 1599116365.0
    },
    {
        "author": "JackMaverick7",
        "created_utc": 1599057930,
        "id": "il848o",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMC up 15% today already and big viewing numbers expected out of labor day weekend as people head back to the big screen.",
        "url": "https://screenrant.com/amc-theaters-70-reopening-california-tenet-movie-release/",
        "created": 1599086730.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1599856596,
        "id": "iqyr5o",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, September 11, 2020**\n\nBefore we go on... we'd like to send our respect and honor all those fallen and affected by the events that took place 19 years ago in New York. Our thoughts and prayers...\n\nStocks again traded choppily today as market volatility continued. Tech shares continued to slide after last month’s historic rally. The S&amp;P and Dow finished slightly green, while the Nasdaq underperformed to finish firmly in the red. \n\nThe Dow led the session, finishing 0.47% up, the S&amp;P was 0.06% up and the Nasdaq underperformed, ending the day 0.69%. Precious metals were modestly up (Gold 0.11%, Silver 0.24%), but gold miners were firmly down (GDX 1.03% down)\n\nThe Nasdaq sank 1.4%, as the index was pressured by an ongoing rout in some of their most heavily weighed big tech shares. Apple (AAPL) shares dropped 1.35% and tracked toward a weekly loss of more than 8%. Amazon (AMZN) was down 1.85%, Microsoft (MSFT) was 0.56% down, Facebook was 0.55% down, and Alphabet (GOOG, GOOGL) was 0.73% down.  \n\nThe New York Stock Exchange is signaling that it will move its electronic trading systems out of New Jersey if the state implements a proposed tax on financial transactions. The NYSE said it will run one of its exchanges from a backup site in Chicago for a week as a demonstration of its readiness to quit the state, according to a notice sent to clients, per the Wall Street Journal\n\nThe federal budget deficit surpassed $3 trillion through August, according to official Treasury data released Friday, and is expected to hit $3.3 trillion when the fiscal year wraps up at the end of this month. The figures, which confirm earlier estimates from the Congressional Budget Office (CBO), show that the deficit is on track to be the largest in the country’s financial history. The $3.3 trillion figure is well over double the largest previous record of $1.4 trillion in 2009, during the financial crisis. Meanwhile in congress hopes for a new stimulus are looking bleak for now.\n\n**Highlights**\n\n* Nikola (NKLA) was 15% down after the company dismissed fraud allegations from short-seller Hindenburg research. This comes days after NKLA and GM announced a strategic partnership \n* Genetic Technologies ($GENE) +23% on availability of breast cancer risk assessment test in U.S.\n* The Consumer Price Index (CPI) rose 0.4% vs an expected 0.3%. Third month in a row that it rises. Experts note that inflation still remains low.\n* Earlier this week, AMC shares jumped after the company revealed U.S. attendance had exceeded 1M in less than three weeks of opening. As of tomorrow, nearly 80% of AMC's U.S. circuit will have reopened, up from the 70% last weekend.\n* Tesla had its target set by The UBS Group at $325 at NEUTRAL, which is way below its current price at $375.\n* Sage Therapeutics\n   * \\- Wedbush upgraded to OUTPERFORM\n   * \\- Citigroup raised PT from $54 to $67\n   * note that Insiders bought over $2MM back in Dec.\n* Peloton (PTON) reported a 170% increase in fourth-quarter sales\n   * Earnings per share: 27 cents vs. 10 cents expected \n   * Revenue: $607.1 million vs. $582.5 million expected \n   * After opening more than 10% up, the stock was dragged down by the market and finished 4% down.\n* Trump said the administration is NOT extending the deadline for the sale of TikTok.",
        "subreddit": "StockMarket",
        "title": "PsychoMarket Recap - Friday Sept 11 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/iqyr5o/psychomarket_recap_friday_sept_11_2020/",
        "created": 1599885396.0
    },
    {
        "author": "kushkiller1",
        "created_utc": 1599703074,
        "id": "ipu68n",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC $7 Calls 9/18? Going up?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ipu68n/amc_7_calls_918_going_up/",
        "created": 1599731874.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1599856665,
        "id": "iqyryr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, September 11, 2020**\n\nBefore we go on... we'd like to send our respect and honor all those fallen and affected by the events that took place 19 years ago in New York. Our thoughts and prayers...\n\nToday was tough, stocks again traded choppily today as market volatility continued. Tech shares continued to slide after last month’s historic rally. The S&amp;P and Dow finished slightly green, while the Nasdaq underperformed to finish firmly in the red.\n\nThe Dow led the session, finishing 0.47% up, the S&amp;P was 0.06% up and the Nasdaq underperformed, ending the day 0.69%. Precious metals were modestly up (Gold 0.11%, Silver 0.24%), but gold miners were firmly down (GDX 1.03% down)\n\nThe Nasdaq sank 1.4%, as the index was pressured by an ongoing rout in some of their most heavily weighed big tech shares. Apple (AAPL) shares dropped 1.35% and tracked toward a weekly loss of more than 8%. Amazon (AMZN) was down 1.85%, Microsoft (MSFT) was 0.56% down, Facebook was 0.55% down, and Alphabet (GOOG, GOOGL) was 0.73% down.\n\nThe New York Stock Exchange is signaling that it will move its electronic trading systems out of New Jersey if the state implements a proposed tax on financial transactions. The NYSE said it will run one of its exchanges from a backup site in Chicago for a week as a demonstration of its readiness to quit the state, according to a notice sent to clients, per the Wall Street Journal\n\nThe federal budget deficit surpassed $3 trillion through August, according to official Treasury data released Friday, and is expected to hit $3.3 trillion when the fiscal year wraps up at the end of this month. The figures, which confirm earlier estimates from the Congressional Budget Office (CBO), show that the deficit is on track to be the largest in the country’s financial history. The $3.3 trillion figure is well over double the largest previous record of $1.4 trillion in 2009, during the financial crisis. Meanwhile in congress hopes for a new stimulus are looking bleak for now.\n\n**Highlights**\n\n* Nikola (NKLA) was 15% down after the company dismissed fraud allegations from short-seller Hindenburg research. This comes days after NKLA and GM announced a strategic partnership\n* Genetic Technologies ($GENE) +23% on availability of breast cancer risk assessment test in U.S.\n* The Consumer Price Index (CPI) rose 0.4% vs an expected 0.3%. Third month in a row that it rises. Experts note that inflation still remains low.\n* Earlier this week, AMC shares jumped after the company revealed U.S. attendance had exceeded 1M in less than three weeks of opening. As of tomorrow, nearly 80% of AMC's U.S. circuit will have reopened, up from the 70% last weekend.\n* Tesla had its target set by The UBS Group at $325 at NEUTRAL, which is way below its current price at $375.\n* Sage Therapeutics  \n\n   * \\- Wedbush upgraded to OUTPERFORM\n   * \\- Citigroup raised PT from $54 to $67\n   * note that Insiders bought over $2MM back in Dec.\n* Peloton (PTON) reported a 170% increase in fourth-quarter sales  \n\n   * Earnings per share: 27 cents vs. 10 cents expected\n   * Revenue: $607.1 million vs. $582.5 million expected\n   * After opening more than 10% up, the stock was dragged down by the market and finished 4% down.\n* Trump said the administration is NOT extending the deadline for the sale of TikTok.",
        "subreddit": "stocks",
        "title": "PsychoMarket Recap - Friday, September 11, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/iqyryr/psychomarket_recap_friday_september_11_2020/",
        "created": 1599885465.0
    },
    {
        "author": "futureusernamehere",
        "created_utc": 1599771078,
        "id": "iqc1j3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Pretty Cool. If Amazon buys AMC then they can have exclusive rights to movies and stop Walmart from making crappy movies in the parking lot. Then use them for Prime. It's a no-brainer",
        "url": "https://i.redd.it/bij6vcl8vdm51.jpg",
        "created": 1599799878.0
    },
    {
        "author": "futureusernamehere",
        "created_utc": 1599657080,
        "id": "ipflrj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Amazon buying AMC? Word on the street...",
        "url": "https://www.reddit.com/r/RobinHood/comments/ipflrj/amazon_buying_amc_word_on_the_street/",
        "created": 1599685880.0
    },
    {
        "author": "linkonacid",
        "created_utc": 1600110928,
        "id": "isrspv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "How it feels recouping my TSLA losses with AMC and NFLX puts",
        "url": "https://i.redd.it/piftiposx5n51.jpg",
        "created": 1600139728.0
    },
    {
        "author": "Curio5g3org3",
        "created_utc": 1600209747,
        "id": "itjfe6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC Networks Announces Details of Planned Modified Dutch Auction Tender Offer",
        "url": "https://www.globenewswire.com/news-release/2020/09/15/2094144/0/en/AMC-Networks-Announces-Details-of-Planned-Modified-Dutch-Auction-Tender-Offer.html",
        "created": 1600238547.0
    }
]