[
    {
        "author": "baodad",
        "created_utc": 1581666082,
        "id": "f3owno",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Background: married, employed w/benefits, with several kids.  Will be 50 in a few years.\n\nAbout a year and a half ago, I discovered Robinhood and options trading.  For reasons involving mid-life crisis issues, feeling stagnant in my job, etc., I transferred all my Roth IRA funds (&lt;100K) to brokers like TastyWorks, IB, and TDAmeritrade, to Roth IRA accounts there where I could trade them.  I dabbled in futures as well, and now my accounts are down about 30%, which feels worse since it's been during one of the best market periods ever and if I'd have left it alone I'd be up significantly right now.  To say I've had some dark days would be an understatement.\n\nI'd like to share some of what I've learned, and I welcome any advice going forward.\n\n### What I've learned (about short-term trading)\n\n1. Day trading/short-term trading is exciting, addictive, and exhausting (for me).  You can tell an accomplished trader not by how much she watches the screens, but by how much time she can enjoy *not watching* them.  There are absolutely people who are successful at short-term trading (although most of us fail).  I've glimpsed them in the wild.  I *know* how to fail at day trading, but here's what I believe it takes to succeed:\n    * **Work** - short-term trading requires a lot of work, time, and study, especially at first. Once you find an edge or niche you can consistently work, perhaps the effort and energy are somewhat reduced (not that I know personally, this is just hearsay).  I underestimated just how much work and time it would take to learn the game, and that's time away from my family and other life pursuits.\n    * **Nerve** - If you're like me, and losing devastates you far more than a similar winning, that will be a big hindrance. The emotions we have attached to money numbers are very powerful.  It can be a roller coaster of euphoria and anguish.  There is manipulation (I believe) in markets, but if you start to feel like the market is personally taunting you - moving against you right after you take a position - then it's time to take a break and get some perspective.\n    * **Discipline**  - in so many fucking ways: the discipline to track all your trades; not giving in to your emotions when either winning or losing; the discipline to find a system or set of rules that work, and trading accordingly; the discipline to analyze your win-loss rates and percentages and understand if what you're doing is really working and worth the effort.\n    * **Judgment and Risk management** - in a game where you must lose some of the time, you must understand risk and how to manage it.  You must use stops and know where to put them.\n2. **He who lives by the YOLO dies by the YOLO**?  Let's face it, if I happen to be lucky enough to pick the right stock or option at the right time, and exit at the right time, I can make a lot of money very quickly.  It's a real possibility that you will observe with a thousand \"if only I'd have\"-thoughts as you watch what the market does.  However, the type of person who risks to win big on just the right stock pick is the same person who will lose at times on similar risks.  I'm sure there are exceptions.  Some people are very risk tolerant, place good bets, and ride their winnings.  I'm not sure I'm one of those types of people.\n2. **Money is not everything** - health is important, and this includes mental and emotional health.  Relationships are important.  I often get the sense that money is a drug we can use to mask the pain, fear, and failure in other aspects of our lives.  I'm not sure that's entirely healthy.\n3. **The market is not random** - This was one of my main takeaways from Larry Williams' book \"Long Term Secrets to Short Term Trading.\"  Just flipping a coin repeatedly and charting the result can show a market-like graph.  There certainly is a lot of chaos and unpredictability in markets, but there is also memory.  Support and Resistance are real.  There are millions of people with billions of dollars invested in markets, and you can see their psychology in market behavior.  In hindsight, market behavior is almost obviously apparent, which makes it all the more tempting to think we can predict its behavior in the future, and to an extent, perhaps we can.  But a Trump tweet could come at any time and send markets sprawling.\n3. **Do not fight the trend** - perhaps my biggest reason for failure is my bearish bias.  I get so bent out of shape over news and politics, I wonder if I secretly harbor a wish that things would come crashing down.  But markets don't care what I think or how I feel.  It's tempting to try to anticipate a change in the trend, but it is unwise to fight the overall direction of the market.\n4. **Taxes on short-term vs. long-term capital gains** - Even if I am a successful day trader and get, say, a 50% return in a year, any trade closed in less than a year is taxed as short-term gains at rates of up to 37% (depending on your bracket).  Positions held longer than a year have lower tax rates.  Money in a Roth IRA is not taxed, so you might think it's a good place to trade, but there is no margin in IRAs to trade with, and you can't hold naked positions, and you need to maintain $25K or more in order to trade frequently and not be flagged as a pattern day trader.\n\n### Where to go from here?\n* I'd like to remove myself from some of the pressure of trading my retirement account for myself.  Part of me wishes I'd never done what I did and just left my retirement funds alone.  Another part of me wants my painful and hard-earned experience not to go to waste.  I want to salvage something from it.&lt;br&gt;\n    With great and continued effort, I could probably beat the returns I would make over investing with a financial company like Edward Jones, Merrill Lynch, or Bernstein, but at what cost?  I'm not sure the money is worth the time, effort, and emotional toll this has taken on me. Perhaps I can keep a small account to trade for myself, and put the majority of what IRA funds I have left with a \"professional.\"  The question is, who? which firm? and can they do significantly better than the market over time?\n* I'm worried about a crash. I know people say just stick your money in VTI and forget about it, but when I look at the chart for SPY, if I had invested a fixed amount in March of 2000 when the bubble burst, it would have taken until 2007 to reach that same level, whereupon the 2008 financial crisis happened, and it took until 2013 to reach that same 2000 pre-bubble burst level.  That's 13 years!  Now, if I had been dollar-cost averaging by investing regularly that whole time, things would be different.&lt;br&gt;\nI'm kind of a \"chicken little\" in that I always fear that the sky is falling.  What will cause the next big crash?  WWIII? Massive cyber-attack? Nuclear holocaust? a super-virus? If the U.S. is running a &gt;$1T deficit, who do we owe that money to?  It will take something really significant to derail the bullish trend that's been going on for the last 10 years.  How should I plan to weather that, if or when it occurs?  I admit these aren't totally rational fears, but I sure don't want to be old, grumpy, and living in my kids' basement when I'm 70.\n\nBasically, I'm coming out of a mid-life crisis, having been hit hard with a realization that my body is wearing out, and my professional prospects need improvement if I'm not to become obsolete. In the meantime, I don't want to miss my kids growing up.  I need to make some kind of peace with money: I don't want to fret so much about it that I can't find satisfaction and joy in life.\n\nOne of my biggest problems is goals.  What do I want?  Part of me is terrified of becoming my parents: repeating the pattern of working my whole life to save up enough just to be grumpy and retired.  Perhaps I need to accept that that's all most of us can expect out of life.\n\nSorry this is all kind of raw, but it's helpful for me to type it out. Thanks for listening.",
        "subreddit": "investing",
        "title": "What I've Learned and What I Need Help With",
        "url": "https://www.reddit.com/r/investing/comments/f3owno/what_ive_learned_and_what_i_need_help_with/",
        "created": 1581694882.0
    },
    {
        "author": "badtradesguy",
        "created_utc": 1582900316,
        "id": "favjhp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Like the title says, you have a whole bunch of assholes waiting to take a position between now and the next 5-10%.\n\nOnce it hits to around way the buying will start to happen, so the market will start its recovery, which will be based on the politicians who will soon br elected.\n\nAs we approach the actual election, youll see a slight drop based on who the expected winner is.\n\nFrom there on, who the fuck knows..",
        "subreddit": "wallstreetbets",
        "title": "Listen you idiots, the market is going to tank for a bit, then by around may, it will start to climb due to w.e election bullshit is going on",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/favjhp/listen_you_idiots_the_market_is_going_to_tank_for/",
        "created": 1582929116.0
    }
]