[
    {
        "author": "noentic",
        "created_utc": 1593637966,
        "id": "hjj7x6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Welcome to another Unusual Options Activity post. Why do DD when you can see what stocks people are heavily investing in? I post these daily.\n\n**Context -**\n\nThe S&amp;P 500 increased by 0.5% today. There was positive news recording a vaccine and Pfizer. PFE notably had the highest number of contracts traded for the day. The ADP Employment Change Report for June again showed gains for private-sector payrolls. The ISM Manufacturing Index for June beat consensus with 52.6% (consensus was 49.2%). The communication services, utilities, and real estate sector led the market higher, increasing +1.8%, +1.9%, +1.9%, respectively.\n\n*Today’s Option Activity Fast Facts -*\n\n***Sentiment – CBOE Put/Call Ratio -*** 0.90, VIX: (28.96, -1.47, -4.8%). \n\n***Highest Multiple Over Daily Average -*** DXC with 46 x the ADV of 4173. There were 96199 calls and 94803 puts.\n\n***Ticker with Most Contracts -*** PFE with 329836 contracts traded today with an AVD of 95042. There were 277805 calls and 52031 puts.\n\n***Largest Put / Call Ratio -*** MUR with a 102.87 P/C ratio. There were 30142 puts and 293 calls.\n\n***Largest Call / Put Ratio -*** SKX with a 97.16 C/P ratio. There were 34978 calls and 360 puts. \n\n*\\*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k*\n\n*MOMENTUM UNUSUAL OPTION ACTIVITY -*\n\n***First Momentum Stock Pick -***\n\n**Ticker :**  AA 10.95  -0.29 ,( -2.58 %)  **Earnings :** 2020-07-15\n\n**Name :** Alcoa Corp.  **Sector :** Non-Energy Minerals\n\n**Special Considerations :**   **Industry :** Aluminum\n\n**Option Information -**\n\n *Today’s Option Volume:* 41029  *OptionOI:* 208019\n\n *ADV:* 10621  ***Multiple of ADV:*** **4**\n\n *Total Calls:* 37921  *Total Puts:* 3108\n\n ***Calls at Ask:*** **43.0 %**  *Calls at Bid:* 32.3 %  ***C/P Ratio:*** **12.2**\n\n *Puts at Ask:* 28.1 %  *Puts at Bid:* 21.4 %   *P/C Ratio:* 0.1 \n\n**Notable Strikes :**\n\n**JUL 10 ’20 12C** had 29.9k VLM with a 2.12k OI. \n\n**DarkPool Prints :**\n\nNone \n\n**News : 24-Jun-20 6:10 pm:** **USTR conducting review that could lead to $3.1 bln in additional tariffs on EU imports**\n\n**My Impression :**\n\nYesterday featured MT which is a steel company. The hypothesis was the call volume at the time may have been related to some sort of new tariffs being enacted. It appears there was confirmation of this yesterday after I posted.  I’ll likely be picking up some shares of this tomorrow. \n\n***Featured Trade: SHLL***\n\nI don’t make featured trade posts often, because these opportunities do not come around all that frequently.\n\nSHLL added options today. There has been significant number of comparisons between NKLA and SHLL. The premiums are very high, especially for the puts. SHLL is a SPAC - or a Special Acquisition Company. These stocks typically have a floor of $10.\n\n\"A typical SPAC will offer stock at $10 per share and give the management team two years to find a suitable target. If the SPAC doesn’t find a good merger candidate, then its terms call for it to liquidate. Unless the SPAC finds a candidate, the money raised in the IPO is held in trust, and so IPO investors typically get most or all of their $10 initial investment back.\" - Sorry can't provide links, but it was a motley fool article. You can search for it if you are interested. \n\nThe Hyliion and SHLL merger is slated to go through sometime in Q3, September or October. **The premium for the OCT 16 '20 25Ps is high. I sold 10 of them for 11.70.** I was the only volume at this strike price at the time. A few others have decided to follow the trade, but the volume is still low. This makes my break-even price for SHLL 13.30. \n\nHypothetically, if the merger does not go through the floor for the stock should be right around $10. It can go lower, but it is less likely. **You are essentially risking about 3.30 for a maximum upside profit of 11.70.** Not a bad return. Other risks include SHLL being sub $10 after the merger. \n\nThis is the first day that SHLL has had options. The option chain was not available on all brokers, however, it was present on IB. The option OI and VLM reflects that it is not available on all brokers. You should exercise caution because as of right now the low volume is causing wide spreads, which likely helped my fill. Right now, the largest call that can be bought is the 30C. I would expect the option chain to be extended tomorrow or in the next few days. People are likely to buy a lot of OTM calls and force the MMs to start delta hedging the sold call so there is a potential catalyst for this stock to move significantly higher in the nearer term.\n\n**There is no such thing as a risk free trade, but there are good bets. I think this is a good bet with limited downside risk.**\n\nDISCLAIMER – These are my observations that I have made at the end of each day and trades that I am considering placing or watching. I am not responsible for your financial losses if you follow any of these trades. As always, do your due diligence.",
        "subreddit": "wallstreetbets",
        "title": "Unusual Option Activity for July 1, 2020 - AA - Featured Trade: SHLL OCT 16 '20 - 25P",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hjj7x6/unusual_option_activity_for_july_1_2020_aa/",
        "created": 1593666766.0
    },
    {
        "author": "jalatorre",
        "created_utc": 1593636932,
        "id": "hjivu3",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hi everyone! I am fairly new to investing in my Roth IRA and appreciate all the advice this stocks reddit has provided to us new investors without judgement.  I am curious to know what you guys think about BA? With it previously trading in the 380s and now sitting low at 180, I feel like it sounds like a great choice since I plan to stay with it for many many years. But the advice on fidelity essentially says, bear- sell sell sell so it makes me hesitant. What is your opinion?",
        "subreddit": "stocks",
        "title": "Boeing stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/hjivu3/boeing_stocks/",
        "created": 1593665732.0
    },
    {
        "author": "rb1754",
        "created_utc": 1593613116,
        "id": "hjb250",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I have been keeping all my cash in a high interest investment account on Fidelity but every month the dividend reinvestment keeps getting lower. \n\nApril: $100\nMay: $80\nJune: $40\n\nWhat are the odds we see this turn negative sooner or later? What can I do to prevent that from happening, if at all?",
        "subreddit": "stocks",
        "title": "Possibility of negative interest?",
        "url": "https://www.reddit.com/r/stocks/comments/hjb250/possibility_of_negative_interest/",
        "created": 1593641916.0
    },
    {
        "author": "flintzke",
        "created_utc": 1593624008,
        "id": "hjeleq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Cannot Buy to Open in Fidelity (noob)",
        "url": "https://www.reddit.com/r/options/comments/hjeleq/cannot_buy_to_open_in_fidelity_noob/",
        "created": 1593652808.0
    },
    {
        "author": "Millertime_18",
        "created_utc": 1593612290,
        "id": "hjat38",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Worth opening a TD or Fidelity account for this one",
        "url": "https://www.globenewswire.com/news-release/2020/07/01/2056175/0/en/Sugarmade-Announces-June-Performance-Record-Growth-in-Every-Metric-Annualized-Sales-Pass-6M.html",
        "created": 1593641090.0
    }
]