[
    {
        "author": "AutoModerator",
        "created_utc": 1591013433,
        "id": "guji5e",
        "num_comments": 3203,
        "num_crossposts": 0,
        "selftext": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.\n\nWhy quarterly?  Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios.  We highly recommend you do some reading:  A list of [relevant posts &amp; book recommendations.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations)\n\nYou can find stocks on your own by using a scanner like your broker's or [Finviz.](https://finviz.com/screener.ashx)  To help further, here's a list of [relevant websites.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_websites.2Fapps)\n\nIf you don't have a broker yet, see our [list of brokers](https://www.reddit.com/r/stocks/wiki/index#wiki_brokers_for_investing) or search old posts.  If you haven't started investing or trading yet, then setup your [paper trading.](https://www.reddit.com/r/stocks/wiki/index#wiki_is_there_a_way_to_practice.3F)\n\nBe aware of [Business Cycle Investing](https://eresearch.fidelity.com/eresearch/markets_sectors/sectors/si_business_cycle.jhtml?tab=sibusiness) which Fidelity issues updates to the state of global business cycles every 1 to 3 months (note: Fidelity changes their links often, so search for it since their take on it is enlightening).  [Investopedia's take on the Business Cycle](https://www.investopedia.com/articles/investing/061316/business-cycle-investing-ratios-use-each-cycle.asp) and their [video.](https://www.investopedia.com/video/play/business-cycle/)\n\nIf you need help with a falling stock price, check out Investopedia's [The Art of Selling A Losing Position](https://www.investopedia.com/articles/02/022002.asp) and their [list of biases.](https://www.investopedia.com/articles/stocks/08/capital-losses.asp)\n\nHere's a list of all the [previous portfolio stickies.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)",
        "subreddit": "stocks",
        "title": "Rate My Portfolio - r/Stocks Quarterly Thread June 2020",
        "url": "https://www.reddit.com/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/",
        "created": 1591042233.0
    },
    {
        "author": "Start155",
        "created_utc": 1592579342,
        "id": "hc2d92",
        "num_comments": 301,
        "num_crossposts": 0,
        "selftext": "Noticed that Broadway financial stock was going crazy from my Fidelity dashboard. Decided to go in, 10K shares at a time, sold it when increased by 20 cents or so. Repeated 3 times and now I am sitting over a net profit of $7.4K. Learned the lesson from Genius stock not to be greedy, where I gained $33K and lost $17K. But this time I am done with Broadway. $7.4K is a lot of money and I am not touching anything today. You all make shit ton of money and enjoy. Here is my gain\n\n[https://imgur.com/a/6qmnx3f](https://imgur.com/a/6qmnx3f)\n\nEdit: Not sure why some of you are thinking that I put $200K on this stock. I did not, I put lets say $50K to buy 10K shares, then sold them when the price was up by 10 cents. Then bought bought 10K shares again at a different price and sold them with 20 cents profit. I did this 4 times, 10K, 10K, 10K and 8K shares at a time. Fidelity shows the total as a summary that you see on the screen shot. When I place a order for 10K shares, does not execute for whole 10K share always. Here is how the breakdown looks like\n\n[**https://imgur.com/a/qAKl1Dr**](https://imgur.com/a/qAKl1Dr)\n\nEdit 2: Someone one was asking me if I use any kind of screener or where I see the activities in Fidelity. In the homepage of the Fidelity you can see something like \n\n[https://imgur.com/a/T2z3HnB](https://imgur.com/a/T2z3HnB)\n\nor\n\n[https://imgur.com/a/PJB2SWx](https://imgur.com/a/PJB2SWx)\n\nWhich would give me an idea of the hot stocks of the day. Hope this helps. ",
        "subreddit": "pennystocks",
        "title": "Made $7.4K in less than 1 hour",
        "url": "https://www.reddit.com/r/pennystocks/comments/hc2d92/made_74k_in_less_than_1_hour/",
        "created": 1592608142.0
    },
    {
        "author": "dyiddo",
        "created_utc": 1593367421,
        "id": "hhj3f2",
        "num_comments": 156,
        "num_crossposts": 0,
        "selftext": "Opened a Fidelity ROTH IRA. Have $5000 in funds. 28 years old. How is this portfolio allocation?\n\nVTI 45% (Vanguard Total Stock Market)\n\nVXUS 15% (Vanguard Total International Stock)\n\nVGT 15% (Vanguard Information Technology)\n\nVIG 10% (Vanguard Dividend Appreciation)\n\nVNQ 5% (Vanguard Real Estate)\n\nBND 10% (Vanguard Total Bond Market)\n\n&amp;#x200B;\n\n1. Are the allocation amounts good? Any I should increase or decrease?\n2. Any ETFs that you think I should remove or add?\n3. Should I decrease BND to 5%?\n4. Thoughts on adding VHT (Vanguard Healthcare ETF) at 10%?\n\nTHANKS!",
        "subreddit": "stocks",
        "title": "How is my ETF portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/hhj3f2/how_is_my_etf_portfolio/",
        "created": 1593396221.0
    },
    {
        "author": "TheGreekFreak-",
        "created_utc": 1592565198,
        "id": "hbyu9p",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "I was doing a bit of DD on NBRV since I’ve been a bag holder for a while and the FDA approval is scheduled for today. Wanted to share it if anyone else was starting to contemplate selling like I was but it’s reassuring to see Fidelity owns 10.5M shares of this.",
        "url": "https://i.redd.it/u9lv5rsgou551.jpg",
        "created": 1592593998.0
    },
    {
        "author": "SaaS-Stonks",
        "created_utc": 1592480225,
        "id": "hbcyiz",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "Listen up ye autists\n\nThis here is a can’t lose trade. Repeat after me. CANT LOSE. JPump is literally paying you to make this trade. \n\nThe play is a NKLA put credit spread. You sell NKLA $20p expiring 1/15/21, and buy NKLA $15p 1/15/21.\n\nThat creates a SPREAD where you’re getting paid about $800 for the $20 put, and paying about $400 to buy the $15p. \n\nThat means you are guaranteed to make $400 as long as the stock stays above $20 by January. And you profit as long as the stock is above $16. If it does fall below that, your max loss is $100.\n\nThis is the easiest money you’ll ever make. I’ve personally sold 10+ of the $20 puts because of the insane money and my close friends have collectively sold another 20+. Sure NKLA is a pump and dump stock, but it IPOd around $20, no way it goes bankrupt by January, and in almost any scenario you’re making thicc cash on this trade. \n\nAdditional DD:\n\n\\* Fidelity and ValueAct (a top quartile returning hedge fund) and the PIPE was priced at $10 which means some analyst had to justify the numbers such that they could make at least a 50%+ gain from that price suggesting a floor price of $10-$15. This isn’t going to be a quick flip from these guys, Fidelity is a boomer bagholder for life and straight from the ValueAct website: “ValueAct Spring is a highly engaged, long-term investor in pursuit of a healthy planet and the health of its inhabitants.”\n\n\\* Their CEO is a born salesman and he’s literally been a mormon missionary (Portugese/Spanish). You can trust this guy knows how to keep manufacturing positive news for the next year plus to keep this stock pumped\n\n\\* The implied volatility on NKLA is over 270%, that’s a crazy number. The implied volatility on Virgin Galactic is only 110%, DraftKings is 100% and Beyond Meat is 80%. The value of these options will fall significantly as NKLA’s implied volatility goes down creating an opportunity to lock in 50%+ gains early for the weak hands\n\n\\* NKLA has 12,000 pre-orders for their semi with pretty much no brand while Telsa has only 2,000 pre-orders on their semi with a huge brand name\n\n\\* Warrants are going to exercise/new shares are going to get dumped on the market, etc. etc. but this is priced into the options market, there’s a reason these puts are too expensive to make a profit buying them. TIME TO SELL THEM.\n\n\\* This trade is literally just 7 months away, but implied volatility should fall to Virgin Galactic/Draftking levels within 2 months which enables the weak hands to walk away with a quick profit\n\n\\* Jeff Ubben (CEO of ValueAct) says it’s a $100B company, Andrew Left @ citron research (big time gay bear) says this stock is worth \\~$40, and some “equity research analyst” covering Tesla says this stock is only worth $15, all good prices for this trade",
        "subreddit": "wallstreetbets",
        "title": "YOLO Opportunity: NKLA Jan 15th 20/15 put spread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hbcyiz/yolo_opportunity_nkla_jan_15th_2015_put_spread/",
        "created": 1592509025.0
    },
    {
        "author": "Ricky-Retardo",
        "created_utc": 1592408322,
        "id": "hatkjj",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "TLDR for the kids that don't read good and want to do other stuff good to: is that PCG is a huge gamble, lots of good, lots of bad, only buy if you have balls of steel and are comfortable with &lt;50% losses because god hates me.\n\n&amp;#x200B;\n\nOkay I will apologize in advance, my brain don't work in linear fashion so big paragraph don't come easy to me in organize fashion\n\nOkay so we can clearly see we've been getting dunked on for the past 3 weeks. I bought it right before the pump to 13.30 (so around 12.50 or something) so I've been bag holding for some time. Feels good.\n\nRecent Bloomberg article points to the fact that with the new Fed bond buying SPV that there's a potential the PCG could qualify for free printer money, I see this as good.\n\nPCG owes victims lots of money, they plan to issue money in the form of shares with a 90 day lockout. Problem is we don't know what the issuing price will be, although it was proposed (and attacked by victim lawyer) that the issuing price be based on when the fires occurred (maybe around $30, the rough november 8th price). I don't know if the lawyer for the victims was successful in that argument, I didn't get to finish watching.\n\nThey are selling 3.25 Billion to Fidelity, Appaloosa, Third Point, and Zimmer partners. Based on the article from a few weeks ago that will be UP TO 10.50 a share. This could be bad, if they are receiving them at a percentage based discount from market, it would be in there best interest to keep the share price low. The deal is contingent on the emergence approval.\n\nLast thing I feel is semi-important is the judge is supposedly going to confirm whether the emergence is approved or denied today, but there's still details to work out and those may impact future prices.\n\n**Conclusion: Do not buy PCG calls, this is more for the fags that have calls already (myself). It hurts real bad.** ***Think of it as a support thread, the support is life support.***\n\nAlso every time this comes up someone comments \"but they just plead guilty to killing a bunch of people\". Yes you are correct and this has been known about for a while. The reason they are in this situation is exactly this. Since then They have changed management, got lots of debt monies, and HUGE upgrades to existing infrastructure (by the way the assets of the company are around 90 Billion, they are valued at like 6 Billion market cap).\n\nBiggest takeaway is that **nobody knows what they don't know.** And for that I ask that you **do not listen to me**. ( I don't know what I'm doing, what are calls?)\n\n&amp;#x200B;\n\n[https://imgur.com/a/UsaSmyE](https://imgur.com/a/UsaSmyE) also check this guy out (judge)\n\n[https://finance.yahoo.com/news/pg-e-bankruptcy-judge-says-180857710.html](https://finance.yahoo.com/news/pg-e-bankruptcy-judge-says-180857710.html)\n\nThat's bloomberg saying they don't know if PCG qualifies for bonds but maybe.\n\n&amp;#x200B;\n\n [https://www.helpguide.org/articles/addictions/gambling-addiction-and-problem-gambling.htm](https://www.helpguide.org/articles/addictions/gambling-addiction-and-problem-gambling.htm) ",
        "subreddit": "wallstreetbets",
        "title": "Another PCG shitpost",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hatkjj/another_pcg_shitpost/",
        "created": 1592437122.0
    },
    {
        "author": "TaylorBeezy",
        "created_utc": 1592496932,
        "id": "hbhosa",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "Robinhood is good for beginners I get it. Yes it’s easy to use, yes it’s somewhat “free”. But how can I expect to make real $$$ when it crashes everytime my Portillo makes a jump? Then, half the stocks making gains aren’t even listed.. \nThis just seems like a scam broker taking advantage of 15 year olds(which makes up a majority of Robinhood users). Finally I’ve opened my eyes to this joke of a broker. \nFidelity here I come.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Robinhood is trash. We deserve better.",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/hbhosa/robinhood_is_trash_we_deserve_better/",
        "created": 1592525732.0
    },
    {
        "author": "WraithN",
        "created_utc": 1592249011,
        "id": "h9myb4",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "Currently I am using RH and and tired of it for many reasons. I have been searching around and these three seem to be the top 3. Anyone have any advice on which they prefer?",
        "subreddit": "pennystocks",
        "title": "E*Trade vs. TD Ameritrade vs. Fidelity",
        "url": "https://www.reddit.com/r/pennystocks/comments/h9myb4/etrade_vs_td_ameritrade_vs_fidelity/",
        "created": 1592277811.0
    },
    {
        "author": "Autonomous-Human",
        "created_utc": 1593375512,
        "id": "hhllh7",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": " Hey everyone,\n\nI work as an engineer at a major player in the autonomous vehicle (AV) space. The news that GRAF is in negotiations with Velodyne is exciting, and I'll give you some insight as to why.\n\n**What is lidar?**\n\nLidar is a sensor that functions similarly to radar, except instead of using sound, it uses light. In simplistic terms, it revolves around itself, shooting lasers, and collects information based on the light received back. Based on the returned lidar point, you can determine how far away the object is, the height of the object, and the position of the object. You can even get a sense of the type of surface the point hit based on the intensity of the returned light. All of this happens for millions of points around the lidar sensor kit every second. \n\n**Does lidar matter? Is it valid?**\n\nIt's pretty much accepted (except maybe by Elon Musk/Tesla) that lidar will play a major role in AV development going forward. Sure, it has certain limitations like it doesn't perform well in certain types of weather, but pair lidar with other types of sensor (thermal cameras for snow, etc) and you're good to go. Lidar is used by almost every major AV player.\n\nI work with lidar and other sensor data on a daily basis, and it's amazing how clear of a picture you get from lidar. Using aggregated lidar points, you can clearly make out objects all around the vehicle. That picture is only getting clearer as lidar producers continue to figure out ways to increase fidelity. In fact, the models we use heavily depend on lidar data, while some other sensors on the car are ignored (due to processing power limitations on the car). Lidar will play a major part in pushing AV development forward.\n\n**What's good about Velodyne?**\n\nI've worked with velodyne sensors and other lidar sensors, and Velodyne lidar produces more points than others I've worked with. More points means more information and a clearer picture.\n\nVelodyne is widely used amongst AV companies--it has ties to Baidu and Ford. I don't see Velodyne leaving the AV space anytime soon.\n\n**You don't know shit! I heard AVs were years and years away! Does Velodyne even matter?**\n\nMost people seem to think that one day AVs will be solved and all of a sudden will be used everywhere in every situation. In reality, the plan is to roll out AVs in a tiered approach.\n\nAVs actually perform very well in certain situations. In sunny weather and on wide roads, you could argue that an AV drives better than a human. Blind folded, you wouldn't be able to tell the difference. It's likely that AVs will be rolled out in these areas first. Think Arizona with paths that have a lot of demand like airport trips. And interest has been shifting to AV trucks, as AVs perform very well in the more simple case of highway driving. Sure, AVs probably won't be used heavily during snow storms in the next year, but we'll start seeing AVs more and more as their capabilities develop. Lidar is key to unlocking these capabilities. \n\n**Velodyne in the near future**\n\nZoox, an AV startup, was just purchased by Amazon. Zoox uses Velodyne sensors, and Amazon has deep pockets. In the near future, it's likely that Amazon will scale out Zoox's operation which means many more lidar orders. \n\nI should also mention that anytime a new version of lidar is produced, the old lidar sensors aren't useful anymore. Machine learning models trained on the old lidar sensor kit won't behave well when thrown data from a new lidar sensor kit. Meaning, every improvement made by Velodyne will cause customers to replace all existing lidar in favor of the new kit.\n\nThis is likely a long hold, but Velodyne shows promise. Velodyne has done well and is extremely well positioned in the lidar AV space going forward.",
        "subreddit": "SPACs",
        "title": "Why You Should Consider Buying GRAF",
        "url": "https://www.reddit.com/r/SPACs/comments/hhllh7/why_you_should_consider_buying_graf/",
        "created": 1593404312.0
    },
    {
        "author": "PillarsBliz",
        "created_utc": 1592228633,
        "id": "h9glwa",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "During the critical 5-10 minutes immediately after opening bell (it was fine during premarket when I was already logged in), thinkorswim froze and prevented logins.  This is the second or third time it's happened in the last month or so, and twice on big opening days which can cause huge losses or missed opportunities.\n\nThis is becoming the last straw for me.  I went to the website and was able to immediate fill a basic stock purchase order, after which TOS finally worked the order so I ended up buying double the stock I meant to.\n\nDid any other platform stay working this opening bell?  I'm considering TastyTrade or Fidelity to switch.",
        "subreddit": "options",
        "title": "Did any non-TD platform go down on opening bell this morning?",
        "url": "https://www.reddit.com/r/options/comments/h9glwa/did_any_nontd_platform_go_down_on_opening_bell/",
        "created": 1592257433.0
    },
    {
        "author": "Pea_Tear_Griffin11",
        "created_utc": 1592943137,
        "id": "hem1hh",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": " I have seen quite a few posts asking how Robinhood stacks up against Webull, and having used most of the major platforms, I would like to offer up my personal Pros &amp; Cons list. None of these brokerages charge for exchange-traded stocks, although I believe Charles Schwab does have an account maintenance minimum.\n\n&amp;#x200B;\n\n**Robinhood** – Fine for folks just getting into trading.\n\nPros: Easy to use interface. Level II data is only $5 a month and easy to access.\n\nCons: Prone to crashing at the worst times, when trading volume is high. Finding open orders that you may want to cancel is not intuitive. Very limited extended-hours trading. OTC not available. \n\n**Main reason I stopped using** – limited extended hours trading\n\n&amp;#x200B;\n\n**Webull** – Similar Robinhood but with better extended hours and better research tools.\n\nPros: Extended hours trading\n\nCons: Cannot place trades outside of trading hours. Level II data is $24 per month.\n\n**Reason I stopped using** – Extended trading hours are great if I can place an order the night before to execute at market opening because I am not getting up at 3 AM my time to do so.\n\n&amp;#x200B;\n\n**Vanguard** – I only use Vanguard to manage my Roth IRA, 100% VOO.\n\nPros: Great customer service, ETFs, and Mutual Funds. Ideal for hands-off, long-term investments.\n\nCons: I have not used for day trading, but to my understanding, they require a call-in to confirm some high-risk (OTC penny stocks) trades\n\n&amp;#x200B;\n\n**Fidelity –** I use this for my 401K through my employer. It is fine, but I feel like I am bowling with bumpers in the gutter when I use their app. I do like that I can easily flip my 401k from an S&amp;P500 pegged mutual fund to a money market account if I believe the market is heading south. I have found other brokerages to be stricter about pulling in and out of mutual funds. \n\n&amp;#x200B;\n\n**Charles Schwab** – I use this account for my long-term individual equity holds and day-to-day banking.\n\nPros: Fantastic customer service. OTC trades are dirt cheap and easy to execute (I was in and out of DLOC this morning in under 30 minutes, and it cost something like $.03 in fees each way). Cash ATM transactions are completely free anywhere in the world. Great analytic resources for those that do not want to do the DD themselves, which is me 95% of the time. \n\nCons: App does not provide as much detail as Think or Swim. Level II data appears only to be available if you are using their Streetsmart desktop software. \n\n&amp;#x200B;\n\n**TD Ameritrade** – In my opinion, this is the best platform for day trading. \n\nPros: Level II data is free. The Think or Swim app is awesome; you can easily view MACD, RSI, and many other indicators from their Think or Swim app. Has the ability to place orders outside of trading &amp; extended trading hours to be executed at market opening.\n\nCons: OTC trades are $6.95 each. Takes a little longer than the others to open an account, verify you are not a professional trader, and then subscribe for the free Level II data.\n\n&amp;#x200B;\n\n**E\\*Trade** – I have not used this app, maybe others will be able to share the pros &amp; cons for it. \n\n&amp;#x200B;\n\nI am sure I missed something, and this is just my 2¢, please feel free to add anything I missed or share additional thoughts in the comments.",
        "subreddit": "pennystocks",
        "title": "Trading Platforms - Pros &amp; Cons",
        "url": "https://www.reddit.com/r/pennystocks/comments/hem1hh/trading_platforms_pros_cons/",
        "created": 1592971937.0
    },
    {
        "author": "mosdefinite09",
        "created_utc": 1593368842,
        "id": "hhjj66",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\n  \n\n\nSo just came across some no expense etfs on fidelity. I was looking into FNILX. It's holdings look great for growth.I love ftec and have been dca into that for years now, but with no expense ratio why not switch? Is there something I am missing?",
        "subreddit": "stocks",
        "title": "Opinions on Fidelity no expense etf",
        "url": "https://www.reddit.com/r/stocks/comments/hhjj66/opinions_on_fidelity_no_expense_etf/",
        "created": 1593397642.0
    },
    {
        "author": "RCROBINSON2000",
        "created_utc": 1591981804,
        "id": "h7orpm",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Does anyone know if the order execution on fidelity is better than robinhood? I’ve been struggling with selling and buying options on robinhood as well as stocks and i’ve heard fidelity is great at order execution. I also heard Fidelity has fractional shares that you dont have to wait for. So which brokerage is better?",
        "subreddit": "StockMarket",
        "title": "Robinhood or Fidelity ?",
        "url": "https://www.reddit.com/r/StockMarket/comments/h7orpm/robinhood_or_fidelity/",
        "created": 1592010604.0
    },
    {
        "author": "Sushi-Rice",
        "created_utc": 1593453203,
        "id": "hi4slj",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Is it possible to buy and sell a stock the same day with settled funds without getting good faith violations using a cash account, broker is fidelity.\n\nHere is the error I get when i try to sell a stock bought with settled funds :\n\nThe  sell order you are about to place includes shares that are not yet  settled (paid for).  Please be aware that if the funds used to purchase  these shares are not settled, this sale may result in a Good Faith  Violation.   Read [Avoiding Cash Account Trading Violations](https://www.fidelity.com/learning-center/trading-investing/trading/avoiding-cash-trading-violations) for further clarification\n\nThat stock was 2 days old, but when i tryed to sell a stock bought with settled funds the same day there isnt a warning.\n\nThis is copied from fidelity\"\n\n**Good faith violation example, Trudy:**\n\n&amp;#x200B;\n\n* Cash available to trade = $10,000, all of which is settled\n* On Monday morning, Trudy buys $10,000 of XYZ stock\n* On Monday mid-day, she sells XYZ stock for $10,500\n\nAt this point, Trudy has not incurred a good faith violation because  she had sufficient settled funds to pay for the purchase of XYZ stock at  the time of the purchase.",
        "subreddit": "investing",
        "title": "Good faith violations",
        "url": "https://www.reddit.com/r/investing/comments/hi4slj/good_faith_violations/",
        "created": 1593482003.0
    },
    {
        "author": "CasserolePalpatine",
        "created_utc": 1592629294,
        "id": "hcg4no",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I am young (20) and looking for long term funds. Currently investing some into Fidelity Blue Chip Growth and not here to debate that one. I am interested in the usefulness of dividend funds. I have around 45 years to invest but the yields are low and the growth isn't great so would it make sense to go all in on funds or like 50/50 fund and dividend reinvesting funds? I'm fairly new to investing so it's unclear to me",
        "subreddit": "investing",
        "title": "Is dividend investing actually good?",
        "url": "https://www.reddit.com/r/investing/comments/hcg4no/is_dividend_investing_actually_good/",
        "created": 1592658094.0
    },
    {
        "author": "shockwave06",
        "created_utc": 1591655521,
        "id": "gz9x0b",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "The new RTX 3080ti is coming out soon and will be a revolutionary new graphics card. Leaks and hype are starting. The stock is at a good jumping in point too. I’m a fairly new investor and I saw on fidelity that is has a high equity summary score but a low analyst opinion score. Any help is appreciated, thank you :)",
        "subreddit": "stocks",
        "title": "Should I invest in Nvidia?",
        "url": "https://www.reddit.com/r/stocks/comments/gz9x0b/should_i_invest_in_nvidia/",
        "created": 1591684321.0
    },
    {
        "author": "slapchopchap",
        "created_utc": 1592226508,
        "id": "h9g0y6",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "My oldest kid is a gem :) he asked me why only only some traders get to trade premarket. \n\nI said they have it set so more experienced traders that understand the risks can get it unlocked on their account. \n\n“Are you sure any of that is true? Because I heard when you called Fidelity and ask them to do it and they were like ‘ok’\n\nThis kid! Lol",
        "subreddit": "pennystocks",
        "title": "fact checked by an 11 year old",
        "url": "https://www.reddit.com/r/pennystocks/comments/h9g0y6/fact_checked_by_an_11_year_old/",
        "created": 1592255308.0
    },
    {
        "author": "NeverGiveupLearning",
        "created_utc": 1593303852,
        "id": "hh4wbu",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "I took the Trade Options course only with the intention to get the certificate. I recently moved $25K into TD Ameritrade from Fidelity just  to try out their ToS platform. Based on what I saw, I think I'll like it. I was honest when I applied for the option trading level stating I had &lt;1 year experience. As a result, I didn't get the level to trade spreads. I read here that someone was able to get level raised by getting the certificate, so I figured, why not.\n\nInitially, I thought I'd just skip the course content and just take the quizzes, as suggested by other users, because I have studied hard already and have done some trading with Fidelity. But I ended up going through some chapters at a slower pace because the content made me think hard. Oh... the greeks! \n\nI'll be a life long learner, so this is only a start...\n\nhttps://preview.redd.it/8oqz7ugnoj751.jpg?width=1550&amp;format=pjpg&amp;auto=webp&amp;s=b6421c34f3d03b98d321cf0c0ba176045333bb83",
        "subreddit": "options",
        "title": "Have you ever taken the TD Ameritrade Options courses?",
        "url": "https://www.reddit.com/r/options/comments/hh4wbu/have_you_ever_taken_the_td_ameritrade_options/",
        "created": 1593332652.0
    },
    {
        "author": "TA72845",
        "created_utc": 1591271212,
        "id": "gwfwn7",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "29 years old. Right now my 401k is 100% invested in a 500 Index fund. I'd like some feedback on the ideal investments given my fund options. Thank you!\n\n**Funds offered by my 401k include:**\n\n2055 Target date with 0.4% expense ratio (ER) - 9.2% 10 yr returns\n\n**Growth:**\n\n500 Index Fund - Large Blend - 0.04% ER **(100% of my current investments in 401k) -** 11.67% 10 yr returns\n\nBlue Chip Growth Fund - Large Growth - 0.34% ER - 15.63% 10 yr returns\n\nCapital World Growth &amp; Income - World Large Stock - 0.42% ER - 7.38% 10 yr returns\n\nJohn Hancock Disciplined Value - Large Value - 0.27% ER - 8.64% 10 yr returns\n\n**Aggressive Growth:**\n\nDFA Intl Small Company Fund - Foreign Small/mid Blend - 0.52% ER - 4.68% 10 yr returns\n\nDFA International Value - Foreign large blend - 0.39% ER - 0.82% 10 yr returns\n\nDFA US Targeted Value - DFA Small value - 0.36% ER - 5.28% 10 yr returns\n\nEuroPacific Growth Fund - Foreign Large Growth - 0.48% ER - 5.02% 10 yr returns\n\nFidelity International Index - Foreign Large Blend - 0.05% ER - 3.67% 10 yr returns\n\nFidelity Real Estate Index - Real Estate - 0.07% ER - 1.2% 5 yr returns - 10 yr returns unknown\n\nHarbor Mid Cap Value Fund - 0.76% ER - 6.01% 10 yr returns\n\nMid-Cap Index Fund - 0.06% ER - 8.86% 10 yr returns\n\nNew World Fund - Diversified Emerging Markets - 0.6% ER - 4.73% 10 yr returns\n\nPGIM Jennison Mid-Cap Growth - 0.54% ER - 10.66% 10 yr returns\n\nTIAA-CREF Small-Cap Blend Idx - Small blend 0 0.06% ER - 7.86% 10 yr returns\n\nVanguard Explorer Fund - Small growth - 0.34% ER -  10.78% 10 yr returns\n\n**Income:**\n\nTotal Bond market fund - 0.08% ER - 3.92% 10 yr returns\n\nPGIM Total Return Bond Fund - 0.24% ER - 5.18% 10 yr returns\n\nFederated High Yield Bond - 0.45% ER - 6.09% 10 yr returns\n\nDFA Inflation Protected SEC - 0.11% ER - 3.59% 10 yr returns",
        "subreddit": "investing",
        "title": "Need help with ideal 401k investments",
        "url": "https://www.reddit.com/r/investing/comments/gwfwn7/need_help_with_ideal_401k_investments/",
        "created": 1591300012.0
    },
    {
        "author": "augustusbennius",
        "created_utc": 1593055926,
        "id": "hffaal",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hey guys, been a lurker for a while on this sub and some others like it.\n\nI live in AZ and our moving average for the number of cases from COVID19 is rising at a rate faster than most states, so my outlook on the economic state of things is most likely biased.\n\nFor the past 2 weeks the market seems to be gapping in one direction and stabilizing during the day - kinda like a tug-of-war. I am currently taking the thesis that states like AZ, TX, CAL, FL will have to reinstate some lockdown procedures leading to another crash, albeit smaller than the march crash. There is a lot of debate on this thesis but my question is in regards to something else, but similar.\n\nUsing the thesis, **we can know when a crash is imminent if states start to enact lockdown procedures again. In other words, this would be the most likely catalyst for a dip. But how would we know when everything's alright market-wise? What would be the most likely catalyst in moving the markets up again and staying in this direction?**\n\nIt might not be the best idea to make high-fidelity market predictions rn. The thesis might be complete garbage. Or lockdown may not budge but market one bit. In other words, everything I said might be completely wrong. But, I was wondering what yall think about the question?\n\nThanks in advance",
        "subreddit": "investing",
        "title": "How do we know if the markets are not going to crash?",
        "url": "https://www.reddit.com/r/investing/comments/hffaal/how_do_we_know_if_the_markets_are_not_going_to/",
        "created": 1593084726.0
    },
    {
        "author": "Junior_Arino",
        "created_utc": 1591018478,
        "id": "gukqmo",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Anyone else?",
        "subreddit": "pennystocks",
        "title": "Fidelity shitting the bed right now",
        "url": "https://www.reddit.com/r/pennystocks/comments/gukqmo/fidelity_shitting_the_bed_right_now/",
        "created": 1591047278.0
    },
    {
        "author": "JamieOvechkin",
        "created_utc": 1591031498,
        "id": "guoi98",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Let's say one wanted their entire salary to be in a publicly traded stock like FB. Assuming the stock was granted bi-monthly like a normal paycheck, just to a site like Fidelity or Etrade instead of a bank account, would that salary still be taxed through income tax, or would only Capital Gains apply?\n\nBeyond prices fluctuating wildly, are there any other disadvantages to doing this?",
        "subreddit": "investing",
        "title": "If one takes a salary entirely in company stock is that salary subject to income tax?",
        "url": "https://www.reddit.com/r/investing/comments/guoi98/if_one_takes_a_salary_entirely_in_company_stock/",
        "created": 1591060298.0
    },
    {
        "author": "mynameisnottakenn",
        "created_utc": 1593028761,
        "id": "hf87je",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hey guys. I'm new here. I recently started doing forec with a friend of mine. I want to invest in a low risk fund like vanguard or Fidelity. Looking to put 1000 dollars. I'm also an international student. I really dont understand the concept of putting money in a fund that much tho. Help please.",
        "subreddit": "stocks",
        "title": "19 yrs old trying to invest.",
        "url": "https://www.reddit.com/r/stocks/comments/hf87je/19_yrs_old_trying_to_invest/",
        "created": 1593057561.0
    },
    {
        "author": "marxr87",
        "created_utc": 1591558504,
        "id": "gyirln",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nI have a TDA and Robinhood account. I've done well in robinhood, and think I am ready to upgrade to something a bit more robust and safe (seeing too much about RH accounts getting hacked, and RH going down).\n\nI already use ToS to monitor my stocks in realtime, but the system is honestly still pretty overwhelming besides watching tickers. I think I'd like something a bit more userfriendly.\n\nRH also seems to be missing a lot of pennies. I downloaded WeBull, and it seems pretty promising. I checked some of the pennies that RH doesn't have, like BBRW, and webull does have it. I don't do cryptos, so I don't care about the broker having that. Webull seems to have more robust data and the extra trading hours sound nice.\n\nI have also heard good things about fidelity, schwab, and interactive brokers. I understand that many use a variety of brokers to avoid getting hit as a ptd, but which is your favorite for pennies?\n\nThanks!",
        "subreddit": "pennystocks",
        "title": "Favorite pennies broker?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gyirln/favorite_pennies_broker/",
        "created": 1591587304.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1592662035,
        "id": "hcmu8l",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 22nd, 2020.\n\n# **The stock market is running out of steam with reopening trades fading and economic data ‘uneven’  - [(Source)](https://www.cnbc.com/2020/06/19/the-stock-market-is-running-out-of-steam-with-reopening-trades-fading-and-economic-data-uneven.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The stock market, so eager to put the entire blow from the pandemic behind it, is now coming to terms that a “V-shaped” recovery might be too rosy a scenario. \n*****\n&gt; With recent spikes in coronavirus cases and fluctuations in the economic data, the market seems to be stuck in a range amid elevated volatility. Market analysts said investors should expect more turbulence ahead because the economic recovery is most likely to be bumpy.\n*****\n&gt; “The market was priced for a continuation of improvement and I think that’s overstating what’s going to happen,” said Brian Levitt, Invesco’s global market strategist. “We are going to have episodes of cases rising. We are going to have a very slow and uneven improvement in the jobs market.”\n*****\n&gt; After soaring more than 40% from the March lows, the S&amp;P 500 turned sideways in the past two weeks, trading at similar levels to early June. The market, which used to turn a blind eye to disastrous news on the thinking that the economy had already bottomed, has become more vulnerable to negative economic headlines as the data begins to give a read on the shape of the recovery.\n*****\n&gt; Stocks came under pressure earlier this week after data showed weekly jobless claims rose more than expected last week, and the number stayed above 1 million for the 13th consecutive week. \n*****\n&gt; And on the virus front, California, Texas, Florida and Arizona have reported an uptick in new infections and hospitalizations amid the reopening. Apple said Friday that it’s again closing some stores in Florida, North Carolina and Arizona due to the spikes in coronavirus cases, which sparked a sell-off in the market, especially among retail stocks.\n*****\n&gt; “The economy is going to need more help to bounce back in months to come,” said Matt Miskin, co-chief investment strategist at John Hancock Investment Management. “For now, volatility and choppy markets remain our base case as an uneven economic recovery likely unfolds.”\n*****\n&gt; # ‘Rolling Ws’\n&gt; The rally in those popular reopening trades — airlines, cruise lines and hotels — is seemingly losing steam. Shares of American Airlines and Delta posted their second straight weekly losses. So did Carnival, Norwegian Cruise and MGM Resorts. Those stocks were once the high-beta leaders of the market comeback as investors bet that a successful reopening would take hold. \n*****\n&gt; “Although the stock market was suggesting a V-shaped recovery, the more likely scenario is rolling Ws,” Liz Ann Sonders, chief investment strategist at Charles Schwab, said in a note.\n*****\n&gt; A similar market pattern happened during the financial crisis, pointed out by Nicholas Colas, co-founder of DataTrek Research. After stocks rallied nearly 40% from the 2009 bottom, the market was range-bound for about seven weeks so the fundamentals could catch up, Colas noted.\n*****\n&gt; From a technical perspective, Matthew Maley, chief market strategist at Miller Tabak, is watching if the S&amp;P 500 can break above its recent high of 3,232 or drop below the 3,000 threshold or its 200-day moving average of 3,018 as of Friday.\n*****\n&gt; “Whichever way it breaks...should be an very important development in trying to determine how this critical juncture in the stock market will be resolved,” Maley said in a note.\n*****\n&gt; # Fed can’t prevent volatility\n&gt; While the flattening virus curve played a big role in the market rebound, it’s no denying that the Federal Reserve’s unprecedented stimulus has been a key driver in lifting stocks from the coronavirus slump. The central bank unleashed another weapon in its arsenal this week, saying it will start buying individual corporate bonds.\n*****\n&gt; As comforting as it is to have the Fed’s support, the central bank can only do so much to ease investor fears.\n*****\n&gt; “The Fed can’t prevent the volatility we’re seeing in stocks,” Lindsey Bell, chief investment strategist at Ally Invest, said in a note. “It will likely take years for the economy to fully recover and there remain other uncertainties on the path ahead. As such, investors may continue to struggle with this mismatch between markets and the economy before seeing the case for new highs.”\n*****\n&gt; Fed Chairman Jerome Powell reminded investors again this week in his semiannual testimony before Congress that “significant uncertainty remains about the timing and strength of the recovery.”\n*****\n&gt; Many on Wall Street have also warned that extended policy measures including injection of trillions of cheap money would lead to problems down the road such as hyperinflation.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.postimg.cc/bNCgvcfK/finvizmaps2.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.postimg.cc/mkTjPTDG/alphatrends61920.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.postimg.cc/pTfkVmPZ/finvizfuts1.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/KYZ2133z/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/3JRjVS09/marketdata1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/SQV7ZFRJ/spxsectors1.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/QMkWH1WH/marketpullbacklevels1.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/xCfNH8Kg/marketrallylevels1.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/3w88YJPH/ercal1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Dzzn76x5/ipos1.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.postimg.cc/XqFWYcpP/upgradesdowngrades1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.postimg.cc/C19Y06LD/upgradesdowngrades2.png))**\n\n*****\n\n# 100 Days\n\n&gt; 100 days ago today on March 11th, the WHO made it official and declared the COVID-19 outbreak a pandemic. Markets were already under a lot of pressure before the WHO declared the pandemic, but the 100 days since will probably go down as some of the craziest 100 days we'll ever experience, not only in the market but in general society as well. More than enough ink and pixels have been spent discussing the societal impact at large, so we'll spare you and just focus on the markets.\n\n&gt; While much of the declines were already in the rearview mirror by the time the WHO made its announcement, equities still had a steep decline in the immediate aftermath. The large-cap Russell 1000, for example, fell another 19% to its March 23rd closing low, but after the rebound, the net change since the pandemic was officially declared &gt; has been a gain of 14.3%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Russell-1000.png))**\n\n&gt; As impressive as the Russell 1000's gain has been in the face of the global pandemic, many stocks have done a lot better than that. The table below lists the 25 stocks in the index that have seen the biggest gains so far during this pandemic. Topping the list is Wayfair (W) which has rallied more than 350%. If there is one thing Americans must have realized while they were stuck at home under lockdown it was that they needed some new furniture! Behind Wayfair, two other stocks have more than tripled and both were beaten down stocks from the Energy sector that were trading at less than $2 per share on March 11th. A number of familiar names standout including Moderna (MRNA), Twilio (TWLO), DocuSign (DOCU), Beyond Meat (BYND), and Etsy (ETSY), but looking through the list, there's really a diverse group of names ranging from bombed-out stocks from the Energy sector (8 stocks), Consumer names (7 stocks), and the ever-popular software stocks from the Technology sector (6 stocks). It's definitely been a rocky road for the markets over the last 100 days, but for anyone who had these names in their portfolio, they aren't complaining. Click here to view Bespoke's premium membership options for access to our weekly Bespoke Report which includes an update to our Stocks for the COVID economy portfolio that was released on March 11th.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Russell-1000-Best.png))**\n\n*****\n\n# S&amp;P 500 Industry Group Breadth Remains Positive\n\n&gt; Equity markets have become a bit wobbly in the last week or so, but breadth, in terms of large-cap industry groups, still remains pretty robust. Relative to their 50-DMAs, all 24 S&amp;P 500 industry groups still have rising 50-DMAs. When you consider the fact that the 50-day window spans the period going back to early April, a period encompassing most of what was one of the strongest 50-day rallies on record, the fact that every industry group has a rising 50-DMA isn't all that surprising.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Rising-50DMA.png))**\n\n&gt; Even though all their 50-DMAs are rising, not every industry group is currently trading above its 50-DMA. While the reading briefly reached 100% in late May and early June, two industry groups have since pulled back below their 50-DMAs, putting the percentage at a still impressive 91.7%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Above-50-DMA.png))**\n\n&gt; The table below summarizes industry group performance showing YTD performance, where each one is trading relative to its 50-DMA, as well as where the group is trading relative to its 52-week high.\n\n&gt; As mentioned above, all but two groups (Drugs &amp; Biotech and Food &amp; Staples Retail) remain above their 50-DMAs, and another four are less than 2% above their 50-DMA. If Friday's sell-off deepens into next week, the percentage of industry groups above their 50-DMAs has the potential to quickly sink as low as 75%. Of the 22 industry groups that are above their 50-DMAs, Autos and Tech Hardware are the only two greater than 10% above.\n\n&gt; On a YTD basis, the S&amp;P 500 is down less than 4%, but for the vast majority of industry groups, performance has been worse than that. Of the 24 groups shown, 16 are down more than 4% YTD, including eleven that are down over 10%. The worst performers of these losers include Energy, Banks, and Autos. While Energy gets most of the attention for being so weak, Banks are essentially down just as much! On the upside, just two industry groups are up over 10% (Retailers, which is basically Amazon, and Software &amp; Services). Retailing is also the one industry group that is within 1% of a 52-week high and one of seven that is within 4% of a 52-week high.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Groups-vs-50-DMA.png))**\n\n*****\n\n# Credit Market Reversals\n\n&gt; We've noted in detail the massive reversals seen in global equities over the last three months, but outside of equities, we've also seen some other massive moves. One example is credit spreads between the yields of corporate and high yield bonds relative to Treasuries.\n\n&gt; The top chart below shows the spread in yields between the B of A Corporate Index relative to Treasuries going back to 1997, and below that, we show the 50-day rate of change in the spread. Heading into the COVID-crash, spreads on corporate bonds were less than 100 basis points (bps), meaning the corporate bond index was yielding only 1 percentage point more than comparable Treasury yields. In the span of less than two months, though, spreads surged by more than 300 bps to over 400 bps. Not since the depths of the credit crisis in 2009 had we seen spreads widen out more than they did in March. Just as notable as the level is the fact that the speed with which spreads widened during the COVID-crash was similar to the pace during the credit crisis.\n\n&gt; While spreads were quick to spike during both crises, they narrowed nearly as fast both times. Going back to 1997, the most corporate spreads have ever narrowed over a 50-day period was in June 2009. Coming in at a close second place, though, the 50-day period ending in early June was nearly as extreme.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061820-Corporates.png))**\n\n&gt; Similar to spreads on corporate bonds, the movement in spreads on high yield (junk) credit has been nearly as extreme. While spreads on the B of A High Yield Master Index widened out by only half as much during the COVID-crash as they did during the Financial Crisis, the 50-day move ending in late March was easily more extreme than any other period outside of the credit crisis.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061820-High-Yield.png))**\n\n&gt; A shown in both charts above, the only time both corporate and high yield spreads narrowed by an amount anywhere close to the amount they narrowed from late March through early June was back in early June of 2009. The chart below of the S&amp;P 500 shows that point from the perspective of the S&amp;P 500. That period in June 2009 was right in the early stages of what turned out to be a multi-year bull market. Given the similar tightening in the credit market now versus back then, should we assume a similar move for equities going forward?\n\n&gt; After the last five months, we'll be the first to say that anything is possible. However, while there are plenty of similarities between the moves in credit markets over the last three months versus the first half of 2009, there are also important distinctions. The most important of these has to do with where the S&amp;P 500 is trading right now. The second chart below shows the historical levels the S&amp;P 500 has traded at relative to its all-time high. Even after the initial narrowing of credit spreads from March through early June 2009, the S&amp;P 500 was still more than 40% off its all-time highs, and therefore still had a lot of climbing to do to get out of the hole. Back in June 2009, to get back to its all-time high from October 2007, the S&amp;P 500 still had to rally another 75%. Today, it's a much different picture as the S&amp;P 500 is already within 10% of its February 2020 all-time high. Could we be in the earlier stages of what turns out to be another long-term bull market? Sure. Will the magnitude of the gains be anything like the gains early on in the bull market that began in 2009? It's unlikely.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061820-SP500.png))**\n\n*****\n\n# The Very Slow Recovery In Economic Activity Is Continuing\n\n&gt; As economies around the country slowly recover from COVID-19 and reopenings proceed, economic activity is slowly recovering. For the hardest-hit sectors, though, the recovery is only inching forward. Security checkpoint volumes at US airports are still down 80% YoY, and the trend of improvement is only set to return travel activity to 50% of 2019 levels in September.\n\n&gt; For restaurants, OpenTable data shows covers down by two-thirds from last year, though some of that is because many restaurants remain closed. Among reopened establishments, the number of seated customers are still down almost 40% YoY. About half of restaurants remain closed per the OpenTable data. We discussed this chart and other retail enthusiasm indicators in last night's Closer report, which is available to Bespoke Institutional members.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061720-High-Frequencyt.png))**\n\n*****\n\n# Leading Indicators Turn Positive\n\n&gt; Yesterday, The Conference Board released last month’s reading for its Leading Economic Index (LEI), a composite of leading data series, which showed a month-over-month increase of 2.8%. As seen in the LPL Chart of the Day, the return to positive territory follows three straight months of negative monthly growth.\n\n&gt; ”We noted that the pace of the LEI’s deterioration slowed in the April report, potentially suggesting a bottom forming in the US economy,” said LPL Financial Senior Market Strategist Ryan Detrick. “Yesterday’s print was one of several positive economic data surprises we’ve observed recently, bolstering our optimistic view for economic growth in the second half of the year.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.19.20-blog-chart.png?ssl=1))**\n\n&gt; While the economy still has a ways to go in order to recover from the damage of the prior three months, the composition of May’s LEI advance encourages us. We noted a disconnect in April’s readout in which the financial market indicators tended to be net positive contributors while the “real economy” indicators detracted. May’s release saw a reversal of that trend whereby the economic subindexes played catch-up. Seven of the 10 components were positive contributors led by an improvement in average weekly initial unemployment claims, average weekly manufacturing hours, and building permits. The three negative contributors were the Institute for Supply Management (ISM) New Orders Index, average consumer expectations for business conditions, and the Leading Credit Index.\n\n&gt; The most recent LEI release reinforces our view that an economic bottom is likely behind us. Workers starting to return to jobs that they were unable to do remotely had material effects on May’s readout, and if that trend continues, a stock market trading at stretched valuations would have a stronger foundation under it.\n\n*****\n\n# 3 Charts That Have Our Attention\n\n&gt; Stocks have shaken off the 5.9% S&amp;P 500 Index drop last Thursday by gaining three days in a row before yesterday’s modest weakness. While researching and reading this week, three charts stood out that tell us quite a good deal about how investors have reacted during this volatile market and what could be next.\n\n&gt; “Incredibly, we saw nearly a third of all investors over 65 years old sell their full equity holdings,” explained LPL Financial Senior Market Strategist Ryan Detrick. “With stocks now back near highs, this is yet another reason to have a plan in place before trouble comes, as making decisions when under duress can lead to the exact wrong decision.”\n\n&gt; As shown in the LPL Chart of the Day, according to data from Fidelity Investments, nearly 18% of all investors sold their full equity holdings between February and May, while a much higher percentage that were closer to retirement (or in retirement) sold. Some might have bought back in, but odds are that many are feeling quite upset with the record bounce back in stocks here.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-1.png?ssl=1))**\n\n&gt; Along these same lines, investors have recently moved to cash at a record pace. In fact, there is now nearly $5 trillion in money market funds, almost twice the levels we saw this time only five years ago. Also, the past three months saw the largest three-month change ever, as investors ran to the safety of cash. If you were looking for a reason stocks could continue to go higher over the longer term, there really is a lot of cash on the sidelines right now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-2.png?ssl=1))**\n\n&gt; Last, we noted last week that the extreme overbought nature of stocks here is actually consistent with the start of a new bull run, not a bear market bounce, or the end of a bull market. Adding to this, the spread between the number of stocks above their 50-day moving average and 200-day moving average was near the highest level ever. Think about it; with the 45% bounce in the S&amp;P 500, many stocks were above their 50-day moving average, but not nearly as many were above their 200-day moving average. So from a longer-term perspective, there could still be gains to be had.\n\n&gt; Sure enough, looking at other times that had wide spreads, they took place near the start of major bull markets. Near-term the potential is there for a well-deserved pullback, but going out 6 to 12 months, stocks have consistently outperformed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-3.png?ssl=1))**\n\n*****\n\n# Election Year July Performance Tepid\n\n&gt; July historically is the best performing month of the third quarter however, the mostly negative results in August and September tend to make the comparison easy. Two “hot” Julys in 2009 and 2010 where DJIA and S&amp;P 500 both gained greater than 6% and a strong performance in 2013 and 2018 have boosted July’s average gains since 1950 to 1.2% and 1.1% respectively. Such strength inevitability stirs talk of a “summer rally”, but beware the hype, as it has historically been the weakest rally of all seasons (page 74, Stock Trader’s Almanac 2020).\n\n&gt; July begins NASDAQ’s worst four months and is the third weakest performing NASDAQ month since 1971, posting a 0.5% average gain. Dynamic trading often accompanies the first full month of summer as the beginning of the second half of the year brings an inflow of new capital. This creates a bullish beginning, a soft week after options expiration and some strength towards the end.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/f885bb39aabd998cfc1457d4a0cbfb36/6b8e9304ec3e7ef8-8a/s400x600/ea91fed87507aed1f64cc4ae460a0006a0a987a5.jpg))**\n\n&gt; Election year Julys rank in the bottom half of all election year months. DJIA: 0.5%, 6th worst; S&amp;P 0.4% 6th worst; NASDAQ (since 1972): -0.7% 3rd worst; Russell 2000 (since 1980): -0.2% 3rd worst.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-2.png?ssl=1))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NKE** \n&gt; * **$RAD** \n&gt; * **$DRI** \n&gt; * **$WGO** \n&gt; * **$MKC** \n&gt; * **$WTI** \n&gt; * **$INFO** \n&gt; * **$ACN** \n&gt; * **$KBH** \n&gt; * **$SOHO** \n&gt; * **$FDS** \n&gt; * **$BB** \n&gt; * **$AVAV** \n&gt; * **$LZB** \n&gt; * **$XAIR** \n&gt; * **$CAAS** \n&gt; * **$MCF** \n&gt; * **$BWAY** \n&gt; * **$SNX** \n&gt; * **$GMS** \n&gt; * **$WOR** \n&gt; * **$QMCO** \n&gt; * **$AFMD** \n&gt; * **$EPAC** \n&gt; * **$WUBA** \n&gt; * **$USAT** \n&gt; * **$NG** \n&gt; * **$PDCO** \n&gt; * **$APOG** \n&gt; * **$PRGS** \n&gt; * **$FUL** \n&gt; * **$AEMD** \n&gt; * **$AIH** \n&gt; * **$YRD** \n&gt; * **$STAF** \n&gt; * **$UFAB** \n&gt; * **$CAMP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/3w88YJPH/ercal1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/Bvmq6f0P/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.22.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n&gt; # ***Monday 6.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oRk1EWr.png))\n\n*****\n\n&gt; # ***Tuesday 6.23.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/o3y0OMu.png))\n\n&gt; # ***Tuesday 6.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/LnfpSm3.png))\n\n*****\n\n&gt; # ***Wednesday 6.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Fo1uuw1.png))\n\n&gt; # ***Wednesday 6.24.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/IUlzLOq.pngg))\n\n*****\n\n&gt; # ***Thursday 6.25.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ygKaF2x.png))\n\n&gt; # ***Thursday 6.25.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/PlIFXwS.png))\n\n*****\n\n&gt; # ***Friday 6.26.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/U4g7nNG.png))\n\n*****\n\n&gt; # ***Friday 6.26.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Nike Inc $95.78\n&gt; **Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, June 25, 2020. The consensus earnings estimate is $0.03 per share on revenue of $8.35 billion and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 95.16% with revenue decreasing by 18.01%. Short interest has decreased by 0.8% since the company's last earnings release while the stock has drifted higher by 19.6% from its open following the earnings release to be 3.9% above its 200 day moving average of $92.17. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 11, 2020 there was some notable buying of 7,691 contracts of the $102.00 call expiring on Friday, July 10, 2020. Option traders are pricing in a 6.6% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Darden Restaurants, Inc. $70.27\n&gt; **Darden Restaurants, Inc. (DRI)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, June 25, 2020. The consensus estimate is for a loss of $1.78 per share on revenue of $1.25 billion and the Earnings Whisper ® number is ($1.68) per share. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 201.14% with revenue decreasing by 43.92%. Short interest has increased by 33.2% since the company's last earnings release while the stock has drifted higher by 108.3% from its open following the earnings release to be 27.4% below its 200 day moving average of $96.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 9, 2020 there was some notable buying of 3,882 contracts of the $70.00 call and 814 contracts of the $80.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 8.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DRI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Rite Aid Corp. $12.41\n&gt; **Rite Aid Corp. (RAD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, June 25, 2020. The consensus estimate is for a loss of $0.38 per share on revenue of $5.60 billion and the Earnings Whisper ® number is ($0.35) per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 171.43% with revenue increasing by 4.23%. Short interest has increased by 11.0% since the company's last earnings release while the stock has drifted higher by 0.6% from its open following the earnings release to be 1.6% below its 200 day moving average of $12.61. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, June 15, 2020 there was some notable buying of 1,617 contracts of the $14.00 call expiring on Friday, June 26, 2020. Option traders are pricing in a 18.4% move on earnings and the stock has averaged a 21.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RAD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Winnebago Industries, Inc. $68.36\n&gt; **Winnebago Industries, Inc. (WGO)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 24, 2020. The consensus estimate is for a loss of $0.41 per share on revenue of $325.94 million and the Earnings Whisper ® number is ($0.35) per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.96% with revenue decreasing by 38.38%. Short interest has increased by 12.4% since the company's last earnings release while the stock has drifted higher by 156.7% from its open following the earnings release to be 46.4% above its 200 day moving average of $46.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 19, 2020 there was some notable buying of 583 contracts of the $55.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 13.5% move on earnings and the stock has averaged a 10.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# McCormick &amp; Company, Incorporated $172.20\n&gt; **McCormick &amp; Company, Incorporated (MKC)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, June 25, 2020. The consensus earnings estimate is $1.14 per share on revenue of $1.29 billion and the Earnings Whisper ® number is $1.18 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.72% with revenue decreasing by 0.91%. Short interest has decreased by 27.3% since the company's last earnings release while the stock has drifted higher by 23.1% from its open following the earnings release to be 7.4% above its 200 day moving average of $160.35. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MKC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# W&amp;T Offshore Inc. $2.57\n&gt; **W&amp;T Offshore Inc. (WTI)** is confirmed to report earnings at approximately 4:45 PM ET on Monday, June 22, 2020. The consensus earnings estimate is $0.03 per share on revenue of $129.93 million and the Earnings Whisper ® number is $0.01 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 40.00% with revenue increasing by 11.93%. Short interest has increased by 95.3% since the company's last earnings release while the stock has drifted higher by 3.6% from its open following the earnings release to be 33.8% below its 200 day moving average of $3.88. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WTI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# IHS Markit Ltd. $72.03\n&gt; **IHS Markit Ltd. (INFO)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, June 23, 2020. The consensus earnings estimate is $0.67 per share on revenue of $1.05 billion and the Earnings Whisper ® number is $0.68 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.63% with revenue decreasing by 7.53%. Short interest has decreased by 27.7% since the company's last earnings release while the stock has drifted higher by 44.2% from its open following the earnings release to be 3.4% above its 200 day moving average of $69.69. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INFO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Accenture Ltd. $201.55\n&gt; **Accenture Ltd. (ACN)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, June 25, 2020. The consensus earnings estimate is $1.84 per share on revenue of $10.94 billion and the Earnings Whisper ® number is $1.89 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.66% with revenue decreasing by 1.44%. Short interest has increased by 20.0% since the company's last earnings release while the stock has drifted higher by 33.2% from its open following the earnings release to be 5.6% above its 200 day moving average of $190.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 1,740 contracts of the $190.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.8% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ACN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Sotherly Hotels Inc. $2.96\n&gt; **Sotherly Hotels Inc. (SOHO)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 24, 2020. The consensus earnings estimate is $0.16 per share on revenue of $16.30 million. Investor sentiment going into the company's earnings release has 26% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 48.39% with revenue decreasing by 65.60%. Short interest has increased by 2,813.7% since the company's last earnings release while the stock has drifted lower by 43.4% from its open following the earnings release to be 39.4% below its 200 day moving average of $4.88. The stock has averaged a 3.0% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SOHO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# KB Home $32.29\n&gt; **KB Home (KBH)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, June 24, 2020. The consensus earnings estimate is $0.57 per share on revenue of $1.17 billion and the Earnings Whisper ® number is $0.49 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.76% with revenue increasing by 14.50%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 65.5% from its open following the earnings release to be 3.6% above its 200 day moving average of $31.18. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 4.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KBH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning June 22nd, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/hcmu8l/wall_street_week_ahead_for_the_trading_week/",
        "created": 1592690835.0
    },
    {
        "author": "Firehighbot",
        "created_utc": 1591834217,
        "id": "h0nw12",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I see so many strong buys at fidelity stock screening, but some of them did not perform well, and no good news about them in future. How reliable are they ? and what can we take away from these picks\n\n1. INTC is strong buy, but I dont see any good news in future. AMD, NVIDIA has results and momentum but already high. how good is INTC positioned across semi-conductors\n2. ABBV vs JNJ. Both are blue chip, but could not find strong news on ABBV conducting covid trials. Long term, growth is subpar compared to tech. what happens if Gilead, INO or moderna finds vaccine before ABBV/JNJ finds it. How much beating will it take",
        "subreddit": "investing",
        "title": "How reliable are Fidelity strong buy indicators. Also some stock questions",
        "url": "https://www.reddit.com/r/investing/comments/h0nw12/how_reliable_are_fidelity_strong_buy_indicators/",
        "created": 1591863017.0
    },
    {
        "author": "kj922",
        "created_utc": 1592378072,
        "id": "hamdu6",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "no option trading here. just my bank kicking back 25k after depositing. down like 300$ but the lady at fidelity talked to me like i owe them the world. lemme hear it. plz i need this \n\nhttps://preview.redd.it/nuq2knnn7f551.png?width=545&amp;format=png&amp;auto=webp&amp;s=f30776b14031d138b03c6d22e9d84e370620861c",
        "subreddit": "wallstreetbets",
        "title": "this is a story alllll about how my life got flipped turned upsidedown",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hamdu6/this_is_a_story_alllll_about_how_my_life_got/",
        "created": 1592406872.0
    },
    {
        "author": "NeverGiveupLearning",
        "created_utc": 1591820934,
        "id": "h0jg81",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Almost all my accounts are with **Fidelity** (individual, IRA, 401K, joint shared, etc.). Only just started trading options and noticed the $0.65 contract fee. With the Collar order I placed this morning, $2.6 (1 sell and 1 buy with both ends) was already accounted towards commission.\n\nIs it worth it to move / open individual account with **Robinhood** just for its $0 option trading commission?",
        "subreddit": "options",
        "title": "Worth it to move individual (taxable) account from Fidelity to Robinhood for $0 option commission?",
        "url": "https://www.reddit.com/r/options/comments/h0jg81/worth_it_to_move_individual_taxable_account_from/",
        "created": 1591849734.0
    },
    {
        "author": "mattcapra",
        "created_utc": 1592719306,
        "id": "hd1t1o",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nI was just learning about the different sources of passive income and I came up with a situation that I was curious about. Let's say I either win the lottery for or save up overtime $2,000,000.\n\nFrom there i would put that $2,000,000 into a regular taxable brokerage account (like fidelity or robinhood), which I would then invest into an index fund returning 10% annually.\n\nWith this 10% return, I would be making 200,000 a year in interest, which I would then sell the position and withdraw this amount and use it as if it were my yearly income to cover all my expenses and other costs.\n\nSince this is a regular taxable account, I would likely bring back about 125k-150k that I will be able to use.\n\nI was wondering if this is a valid situation that you could FIRE, and if any of you have tried this. I'm not entirely sure that this process works in this way, so that is why I am here to share it with you guys.",
        "subreddit": "investing",
        "title": "Hypothetical FIRE situation",
        "url": "https://www.reddit.com/r/investing/comments/hd1t1o/hypothetical_fire_situation/",
        "created": 1592748106.0
    },
    {
        "author": "Paul-Cheenis",
        "created_utc": 1591019207,
        "id": "gukxb0",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "After reading a previous post about $ITCI, I decided to dive into all of the data and break down all the technical jargon in an attempt to better understand the opportunity here. This is my first attempt at writing up my DD.\n\n**Positions:**\n\n**$ITCI Stock**\n\nPotential options:\n\n**$ITCI 6/19 $25c**\n\n**$ITCI 7/17 $25c**\n\n**Also a TL;DR at the bottom**\n\n&amp;#x200B;\n\n**WHAT is $ITCI?**\n\n$ITCI is Intra-Cellular Therapies, a biopharmaceutical company based in New York most known for its recently FDA-approved drug lumateperone (CAPLYTA), offering a unique take on schizophrenia treatment with very minimal side effects.\n\n**WHY are we looking at $ITCI?**\n\nThey have imminent data releases regarding large clinical trials that are expected to show positive results. One data release set for Q2, another set for mid-year 2020.\n\n**HOW do we profit from this?**\n\nHistorically, $ITCI has had large price spikes when positive data is released. Data release is imminent, likely beginning in June. Longer term outlook, if trial data is positive, further FDA approval and marketable drugs will provide ITCI with a much larger market in which to make money.\n\nLet's dive in.\n\nITCI has just recently had their drug, lumateperone (labeled CAPLYTA), approved by FDA for use at the end of 2019 after very positive clinical trials. This drug is used to treat schizophrenia, and compared to existing treatments, is novel in that the side effects are much more minimal. CAPLYTA sales/marketing began at the end of March, reporting \\~$880,000 in sales in just the last one or two weeks of Q1 (mainly to supply wholesalers). It's still early, but results from the clinical trials and the initial physician and patient reception has been positive.\n\nHowever, what we're looking at for the price spike is not the success of CAPLYTA, but rather the results of not one, but two upcoming data releases.\n\nThe first data release is regarding a clinical trial using lumateperone for treatment in bipolar disorder, which if successful, would greatly expand the market for ITCI's drug. This data release date per the most recent earnings call is “mid-year 2020”, however, another autist [makes the case for a June release here](https://medium.com/@codyenexile/another-itci-spike-incoming-diligence-done-8d625ff29754). The results of this trial are assumed to be positive because similar results were found in previous trials, [mentioned here](https://ir.intracellulartherapies.com/news-releases/news-release-details/intra-cellular-therapies-announces-positive-top-line-results-0).  This trial is Phase 3, which is the last step before FDA approval is granted.\n\nThe second release is regarding ITI-214, a separate treatment targeting patients with chronic systolic heart failure. This treatment acts as a PDE-1 inhibitor, which has shown positive results in heart treatment [example](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5513860/)\n\n[example 2](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6023290/).\n\nTI-214 has completed Phase 1-2 clinical trials and is awaiting results data “later this quarter” per the Q1 2020 earnings call this May (so, June 2020 release). Positive data from this trial would be very bullish for ITCI, as it could potentially open a whole new market for them - cardiac treatment in addition to psychoactive treatment.\n\n**ADDITIONAL PROS AND CONS:**\n\n**Pros:**\n\n1. Per the earnings call, the recent COVID events have not impeded the clinical trials. The launch of the CAPLYTA drug has also been successful in spite of COVID, thanks to telemedicine and online capability. In addition, patients have not stopped seeking treatment for mental conditions and physicians have not stopped providing care.\n2. Some large institutional investors, including BlackRock, have recently [increased their stake in ITCI](https://www.tickerreport.com/banking-finance/5649746/blackrock-inc-buys-527274-shares-of-intra-cellular-therapies-inc-nasdaqitci.html)\n3. In general, institutions have put in [$156M in Q2 2020 alone](https://www.marketbeat.com/stocks/NASDAQ/ITCI/institutional-ownership/), largest being Fidelity and BlackRock. This is much much larger than any other quarter so far\n4. Recent analyst price targets for ITCI have been positive, ranging from $26, to $35, to $50+.\n5. A competitor in schizophrenia treatment, Minerva Neurosciences ($NERV), recently reported disappointing Phase 3 trial results of their own, easing pressure on upcoming competitive threats.\n\n**Cons:**\n\n1. Despite reporting \\~$450 million in cash/cash equivalents and investment on the last earnings call, ITCI continues to burn money and is not yet in a position to reap big profits from CAPLYTA. Will need to keep an eye on financials if taking a long position.\n2. Although approved by the FDA and showing positive clinical trial results, CAPLYTA is very early and there are little real-world results to show for it as of now. Success of this drug is necessary for ITCI to stay relevant.\n3. Insider selling may be [a concern](https://www.gurufocus.com/stock/ITCI/insider). There has also been very recent [insider buying though](https://newsfilter.io/articles/4-form-ac9be466332a794a156140ff7d3f1e06),I don't know enough about this shit to form an opinion so I'm putting it in Cons because brainlet.\n\n**//--TL;DR--//**\n\n**The Good:** history of price spikes on positive data, drug recently approved by FDA, next data releases imminent and likely to be positive based on past results\n\n**The Bad:** company has $450 mil cash but isn't making money yet; drug released and approved only recently, little data available on sales outlook and patient reception. Questionable insider buys/sells?\n\n**The Ugly:** look in the mirror\n\n**Positions: $ITCI Stock** (for the longer hold)\n\n**$ITCI 6/19 $25c** (banking on June data releases)\n\n**$ITCI 7/17 $25c** (coverage in case data is released late June or early July)",
        "subreddit": "wallstreetbets",
        "title": "Taking a second look at $ITCI",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gukxb0/taking_a_second_look_at_itci/",
        "created": 1591048007.0
    },
    {
        "author": "jackis41",
        "created_utc": 1591326987,
        "id": "gwwnso",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Trying to buy $BETZ. New iGaming ETF that just came out. Never bought an ETF before and Fidelity is saying I need to make a market limit order. Do I just set a high price so it is purchased right when the market opens? I want to buy ASAP.",
        "subreddit": "stocks",
        "title": "Having a hard time buying an ETF...",
        "url": "https://www.reddit.com/r/stocks/comments/gwwnso/having_a_hard_time_buying_an_etf/",
        "created": 1591355787.0
    },
    {
        "author": "j_solberg7",
        "created_utc": 1592361667,
        "id": "haifba",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "DD - BioSolar, Inc (BSRC), as of 6/16/2020 (https://biosolar.com/) \n\nBioSolar, Inc is an OTC traded sub-penny stock traded under the symbol BRSC. (https://www.bloomberg.com/quote/BSRC:US) \n\nAbout 5 weeks ago, few early callers had been buzzing about BSRC.\n\nI couldn't sleep, so I got onto r/pennystocks to watch Salm get crucified, and I saw someone mention it again. So I decided to look into it back in early April to see if there was anything to this random ticker. \n\nBioSolar is a Renewable Energy Equipment technology company, trading as part of the Renewable Energy industry and Energy sector. \n\nThe company board is comprised of Dr. Donghie \"David\" Lee and partner Dennis Lepon. BSRC officially only employs, and is run by Dr. Donghie (David) Lee (professional profile: https://www.bloomberg.com/profile/person/15905709).\n\nDr. Lee is the CEO, and acting CFO of this company. He's a brilliant mind in his field (http://keenforgreen.com/b/interview-dr-david-lee-ceo-biosolar-renewable-plastics-solar). \n- PhD at Purdue in Electrical Engineering.\n- Master of Science at University of Michigan in Electrical Engineering.\n- Bachelor of Science at University of Texas in (you guessed it by now) Electrical Engineering. The man knows his chops in electrical engineering and is highly respected in his field. \nHe is partnered with Dr. Stanley B Levy as a chief technology officer, and Tom Becker runs investor relations. \n\nWhile initially the low employees and small figures seem too small to be significant, or almost as if this is just another pump and dump, this is actually a wise move on BSRC's part: \n- The research staff are 1099 contractors [low/no overhead].\n- BSRC doesn't consistently need sprawling expensive labratories for proof of concepts [low/no overhead].\n- The focus of this business is not large scale production or continuous product launches. \nWhat BioSolar deals in are intellectual properties of Dr. Lee. The patents (see below) are what make this company valuable. \n\nBSRC recently (and quietly) filed a patent early in the morning on June 2, when all US exchanges were asleep, and most sites and bulletins overlooked it. (https://www.bloomberg.com/press-releases/2020-06-02/biosolar-files-patent-for-silicon-alloy-anode-for-high-power-batteries) (https://www.globenewswire.com/news-release/2020/06/02/2041942/0/en/BioSolar-Files-Patent-for-Silicon-Alloy-Anode-for-High-Power-Batteries.html) \n\nThis patent is a fundamental and crucial shift in the design and durability of lithium rechargable batteries. This technology allows a fragile and expensive component in a battery (see the patent for details of the anode changes). The patent that BSRC holds swaps an extremely inexpensive silica replacement which eliminates the need for a heat expulsion in high discharge batteries. Presently, they have prototypes that are cheaper and many magnitudes more durable than present options on the market. \n\nTL;DR - The company owns the tech to make expensive short-lived batteries (like in Teslas, Volts, power tools, phones) cheap and much more durable. They are making a necessary process much cheaper and easier on producers - Suppliers and producers always bid on either the cheapest or most durable option. This is both. \n\nIt is almost certain that the producers of the batteries we are becoming more and more reliant on will migrate to this technology. It makes production cheaper, rely less on silver (expensive and fragile), uses readily available silica compounds (cheap and durable), and eliminates heat in high energy expenditure. This is immensely useful in power tools and electric cars and vehicles, as well as in cell phones, laptops, and tablets. The applications are virtually universal to any battery-reliant device. \n\nThe patent these guys own will be licensed and the company value will soar when this happens. \n\nToday alone, the stock is up 22% EOD. \n\nAll of this is in addition to BSRC already owning Dr. Lee's research on a more efficient biodigradable backing and packaging for solar panel cells. \n\nLooking at BSRC as a stock, and not just the tech they hold: \n\nBSRC is a 221.64M outstanding share company, that moves on a 30 day volume around 5.6M shares. Don't be fooled - those shares are at or under .01$. Bonus! They have earnings announcement on 08/07/2020. With this new patent to market, these are likely to be positive results, and today's climb of over 20% shows interest is growing. For dumbed-down math sakes; at only $0.01 (actual price is .006), they are still only at 25% of their 52 week high of $0.04. That is only a small percentage of their 5y high of $0.52!\nThese prices were before the company had ANY sort of patent this valuable or immediately useful to an exploding market. This shows there is definite history of higher trade and expansion within the recent past, showing over 400% potential valuation change from today's close. They are in the recovering Energy sector, and are a green energy focused company. This is a double-win, as both these sectors are up. \n\nSome risks: They trade OTC. They will not be available unless your broker does Pink papers (Fidelity is good). They are LOW market cap: 1.330 M. You read that right. This is risky to some investors, because they aren't listed on NASDAQ or anything like that. Harder to find means fewer (and no RH or Blue Chip Only) investors. Further, BSRC is literally a sub- .01 penny stock at the time of writing this. This means it's got a ways to go to listing, and a reverse split is likely on its way to the stratosphere. \nTheir EPS is a nasty .-03, because they have been virtually dormant while Dr. Lee has been developing this most recent patent. \nTheir 1 year return for their small handful of investors during this inactive period was a heartbreaking -70%. \n\nThis should be much different in the coming year. \n\nThis is not your volatile temper-tantrum throwing GNUS or DGLY, (currently, at least). It is a small, low-volume company still. This is also off-putting to many investors, because this means no giant leaps or immediate 2-day get rich explosions. \n\nMy thoughts: \nThis is a ticking time bomb of inexpensive profitability that will give impressive results when the company's patented technology becomes mainstream. BSRC is a long hold, but it is still so inexpensive that getting in is cheap enough to buy many shares even for 1.00$. With little to lose at such a low price, it's easy to test the waters and decide if you're confident in BSRC. \n\nI am not a financial advisor at all. Please do your own Due Diligence. This is just some research I did to enlighten the curious and inform anyone looking for a cheap, slow rocket to Pluto.",
        "subreddit": "StockMarket",
        "title": "DD - BioSolar, Inc (BSRC), as of 6/16/2020 (https://biosolar.com/)",
        "url": "https://www.reddit.com/r/StockMarket/comments/haifba/dd_biosolar_inc_bsrc_as_of_6162020/",
        "created": 1592390467.0
    },
    {
        "author": "NeverGiveupLearning",
        "created_utc": 1591748896,
        "id": "h001o5",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I searched on the Net and was not able to find the answer. Hope someone in the known can shed some light. The 24/7 support from Fidelity can only answer very basic questions, and they ask me to call during market hours when their advanced support is online, but I can never find time during that window for the call.\n\nEdit: It's interesting how almost nobody understood my question.I'm not asking whether one can trade options in IRA.  My stocks are already in a taxable account (not IRA). Can I sell covered call **on the same underlying** in Roth IRA? I'm actually thinking about Collar strategy in IRA because the earnings report is coming up soon, but I don't want to complicate the question more.  I honestly do not know how else to make the question clearer. Maybe I should just call Fidelity during market hours tomorrow.\n\n**Update**: Talked to Fidelity rep. No, I cannot do what I wanted to do. Not even when the stocks and options are in two different taxable accounts (let alone IRA). Posting this in case others are searching for answer to a similar question.",
        "subreddit": "options",
        "title": "Long stock in taxable account, can I sell covered call in Roth IRA? (Fidelity)",
        "url": "https://www.reddit.com/r/options/comments/h001o5/long_stock_in_taxable_account_can_i_sell_covered/",
        "created": 1591777696.0
    },
    {
        "author": "simpsonb1",
        "created_utc": 1591548228,
        "id": "gyfonu",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So since about January I've been learning a lot of coding and programming lately while also getting into the stock market and I've been using APIs a lot to quickly and securely send/receive data from other sources particularly with FileMaker right now as that is the program that we have used to develop our business's management software.  As I've gotten more familiar with it I'm realizing just how impressive it is and has me wondering what I could do with a fully custom developed FileMaker solution retrieving market data and processing it according to the scripts that I run for it.  I have been thinking about this all weekend and I know I could do a lot with it but I wanted to see if anybody else has done something similar.  \n\nI know there are a lot of programs out there already that essentially a prepackaged version of what I'm looking to create but none of them are customizable to the level that I'm looking for.  Plus it's kinda fun creating stuff like this...\n\nI'm using Fidelity but it seems like they don't have a public API like TD Ameritrade does apparently, they have an API but you have to apply as a software developer with them to use it due to security concerns.  \n\nI've found a few different sources to query market data from online but they all seem to have a monthly call/data limit which depending on how I script this could be easily exceeded.  \n\nSo has anybody else tinkered with this sort of thing?",
        "subreddit": "investing",
        "title": "Anybody use APIs to retrieve data and analyze it for yourself? What platforms do you use?",
        "url": "https://www.reddit.com/r/investing/comments/gyfonu/anybody_use_apis_to_retrieve_data_and_analyze_it/",
        "created": 1591577028.0
    },
    {
        "author": "ObviousEconomy",
        "created_utc": 1592591241,
        "id": "hc5z4u",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So I opened credit spreads for Spotify yesterday. I used Fidelity to sell some 235 calls and buy some 240 calls that expire today. It was looking iffy at the start of the day but I was looking to close it out when it fell in the middle of the day. [I didn't make it to the middle of the day.](https://imgur.com/a/WozB1YR)\n\nPositions were liquidated. Look where [Spotify was](https://imgur.com/a/vGwlZiC) when I logged in to close out my positions.\n\nNot a smart trade by me. On the other hand, their timing was uncanny and suspicious. The stock dropped 2.5% immediately and I would've gained about $2k had I closed out my positions an hour later.",
        "subreddit": "wallstreetbets",
        "title": "Cucked by Fidelity",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hc5z4u/cucked_by_fidelity/",
        "created": 1592620041.0
    },
    {
        "author": "atmus_fear",
        "created_utc": 1593128843,
        "id": "hfwxq6",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Thinking about going thru fidelity (for consolidation purposes). Does anybody here use them and are they good for mutual funds? Thanks",
        "subreddit": "stocks",
        "title": "Fidelity for mutual funds?",
        "url": "https://www.reddit.com/r/stocks/comments/hfwxq6/fidelity_for_mutual_funds/",
        "created": 1593157643.0
    },
    {
        "author": "freedom_taco",
        "created_utc": 1593217792,
        "id": "hgjko4",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Recently logged into my brokerage account where I hold shares of T-Moible (TMUS) and saw my original shares and shares of TMUSR. The activity feed on Fidelity says this was a distribution of TMUSR expiring July 27th. \n\nHere is what I already know: The share price of T-Mobile Common Stock is $105.20 as of June 26th, while the share price of TMUSR is $0.26. My 1,600.05 shares of TMUS remain unchanged in the brokerage account, but there is also 1,600 shares of TMUSR.\n\nFor what it's worth I also found [this](https://www.theocc.com/webapps/infomemos;OCCPROD0PUBSESSION=C08E712BACBF39AB22ABA0D25087E446.occ-ppube4l?number=47186&amp;date=202006&amp;lastModifiedDate=06%2F24%2F2020+08%3A05%3A38) but can not make any sense of it. Any insight is appreciated.",
        "subreddit": "investing",
        "title": "T-Mobile vs. T-Mobile Rights",
        "url": "https://www.reddit.com/r/investing/comments/hgjko4/tmobile_vs_tmobile_rights/",
        "created": 1593246592.0
    },
    {
        "author": "HHKB_",
        "created_utc": 1592103726,
        "id": "h8lysn",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hello! First post here, hopefully I'm doing this correctly.\n\n##TLDR: IRA is with Fidelity, Roth IRA is with Vanguard, non-tax-advantaged mutual funds are in Schwab. How do I manage a three-fund portfolio when everything is spread out?\n\nI've been reading a ton on investing and have been strapping down to prepare for retirement. Here is my current setup:\n\n1. Wife has a Traditional IRA with Fidelity and we will be maxing out the annual contribution ($6,000).\n2. I have a Roth IRA with Vanguard and we will be maxing out here as well ($6,000).\n3. Non-tax-advantaged accounts in Schwab will be seeing $24,000 annual contributions to the investment account which is funding the Bogle three-fund portfolio.\n4. Direct deposit goes into a Chase checkings account.\n\nI've started a three fund portfolio in the Schwab account using their mutual funds (SWTSX, SWISX, SWAGX). I'm starting with a 64%, 16%, 20% allocation, respectively, and I plan on balancing that portfolio annually so that in 20 years it's at 14%, 6%, 80%.",
        "subreddit": "investing",
        "title": "How do I properly manage a three-fund portfolio when I have multiple accounts spread out over different banks?",
        "url": "https://www.reddit.com/r/investing/comments/h8lysn/how_do_i_properly_manage_a_threefund_portfolio/",
        "created": 1592132526.0
    },
    {
        "author": "carrros",
        "created_utc": 1591157234,
        "id": "gvmp94",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hey do you guys know if I'm buying LKYSD tmrw do I need international approval with a fidelity account or can I just go ahead and buy it?",
        "subreddit": "shroomstocks",
        "title": "Numinus",
        "url": "https://www.reddit.com/r/shroomstocks/comments/gvmp94/numinus/",
        "created": 1591186034.0
    },
    {
        "author": "artofdeception-",
        "created_utc": 1591298124,
        "id": "gwo1n7",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Does anyone use the fidelity app? I keep trying to enable real time quotes but when I tap the banner nothing happens. Do I need a certain type of account for this? Sorry if this is sort of unrelated, but I’m getting annoyed with this.",
        "subreddit": "StockMarket",
        "title": "Fidelity App",
        "url": "https://www.reddit.com/r/StockMarket/comments/gwo1n7/fidelity_app/",
        "created": 1591326924.0
    },
    {
        "author": "PM-me-your-butts-thx",
        "created_utc": 1592536459,
        "id": "hbt0ll",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Is there any penalty/issues for that? Is it allowed?",
        "subreddit": "pennystocks",
        "title": "Fidelity: What happens if I buy Stonk A on the open and then sell it at end of day?",
        "url": "https://www.reddit.com/r/pennystocks/comments/hbt0ll/fidelity_what_happens_if_i_buy_stonk_a_on_the/",
        "created": 1592565259.0
    },
    {
        "author": "frank_ly3",
        "created_utc": 1591023774,
        "id": "gum6f6",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "For those of you who use Fidelity and experienced this mornings bullsh\\*t, how common is this?  Something to just anticipate and get ready for from time to time?  I figured it could be slow because of a huge rush on Monday, but I'm pretty new so I'm unsure if this is the case or if this was a one time sort of event.   Screwed me this morning... I'm sure I'm not alone as the other two Fidelity posts this morning show...",
        "subreddit": "pennystocks",
        "title": "Fidelity Screwing the Pooch Question:",
        "url": "https://www.reddit.com/r/pennystocks/comments/gum6f6/fidelity_screwing_the_pooch_question/",
        "created": 1591052574.0
    },
    {
        "author": "FinancialLine7",
        "created_utc": 1591141031,
        "id": "gvin8v",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Lost a chunk of my account on TLSS yesterday and more today. I want to hold long term to gain some back, hopefully break even or even better profit... But what will happen if I enter negative territory? Will I owe money or will fidelity just let my account be negative til the stock starts tending upwards again?",
        "subreddit": "pennystocks",
        "title": "What happens if my fidelity cash account goes into negative territory?",
        "url": "https://www.reddit.com/r/pennystocks/comments/gvin8v/what_happens_if_my_fidelity_cash_account_goes/",
        "created": 1591169831.0
    },
    {
        "author": "razzy57",
        "created_utc": 1591805678,
        "id": "h0e439",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I bought Tesla around $750. I’m expecting it to crash or at least drop soon, and then scoop it back up. Most of my stock is in the fidelity contrafund which it has been for years. Only other stock I hold is DVAX but only have a few hundred dollars worth. Is it worth selling with a limit of $1,100? I haven’t owned the stock for over a year.",
        "subreddit": "stocks",
        "title": "Sell Tesla ?",
        "url": "https://www.reddit.com/r/stocks/comments/h0e439/sell_tesla/",
        "created": 1591834478.0
    },
    {
        "author": "hockeyfreak1118",
        "created_utc": 1593114031,
        "id": "hfsnbf",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "My uncle wants me to manage his $3mm fidelity account. He’s sitting on 100% cash. I have a finance background and a value investor myself. I was thinking about putting $2mm into a core group of stocks by selling put options and letting the prices come to me. Then using the rest for some option plays. Thoughts? Suggestions?",
        "subreddit": "investing",
        "title": "What to do with $3 million",
        "url": "https://www.reddit.com/r/investing/comments/hfsnbf/what_to_do_with_3_million/",
        "created": 1593142831.0
    },
    {
        "author": "eiapsearoo",
        "created_utc": 1591216841,
        "id": "gw25rd",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "What is the best way to legally day trade on fidelity? Does it cost more money and do any of you day trade through fidelity?",
        "subreddit": "pennystocks",
        "title": "Day Trading",
        "url": "https://www.reddit.com/r/pennystocks/comments/gw25rd/day_trading/",
        "created": 1591245641.0
    },
    {
        "author": "tom_lettuce",
        "created_utc": 1591301968,
        "id": "gwpbh8",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hey there,\n\nI just started my career and my 401k, so I'm not too worried about my 401k tanking, however, I am curious to know how I could protect it if I wanted to. So I was wondering if I take out a loan against my 401k (fidelity 500), and take it's worth ($10k at $108.60/share), what happens if I pay back the loan when the economy is at its lowest point (let's say $50/share)? Am I buying back $10k worth of shares at $50? If so I would have more than doubled my 401k when the economy comes back around. It would be great to hear other's thoughts. Thanks!",
        "subreddit": "StockMarket",
        "title": "Protecting 401k by taking out loan?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gwpbh8/protecting_401k_by_taking_out_loan/",
        "created": 1591330768.0
    },
    {
        "author": "iggy555",
        "created_utc": 1591142881,
        "id": "gvj5rn",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "It’s been available on their app for few months but for some reason they don’t support it on desktop.\n\nAny idea what behind this strategy? Are they just waiting for someone to kick it off and then they follow like everyone did with zero commissions?",
        "subreddit": "investing",
        "title": "Any idea why fidelity does not have fractional shares on desktop?",
        "url": "https://www.reddit.com/r/investing/comments/gvj5rn/any_idea_why_fidelity_does_not_have_fractional/",
        "created": 1591171681.0
    },
    {
        "author": "rb1754",
        "created_utc": 1591027732,
        "id": "gunbt5",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hey Folks,\n\nNeeding a little advice... Covid-19 pretty much shut down my business anywhere from 10-18 months (...can't be too exact...) and I'm not sure what to do with my $100k that was helping to operate my business. I had planned to leave the funds in a high-yield account with Fidelity but interest rates over the past couple months are pretty pathetic and I've only gained $100/month.\n\n&amp;#x200B;\n\nI'm wondering what other options I might have available to me? I thought about pumping the money into conservative dividend stocks, but I'm not sure I want the money to enter the market at this time.",
        "subreddit": "investing",
        "title": "What to do with cash short-term",
        "url": "https://www.reddit.com/r/investing/comments/gunbt5/what_to_do_with_cash_shortterm/",
        "created": 1591056532.0
    },
    {
        "author": "awornpear",
        "created_utc": 1591631623,
        "id": "gz1wh6",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hello everybody I recently turned 18 and I just opened a Roth IRA (through fidelity) and have $2.5k to invest. I’ve been doing a decent amount of research for the past couple of days and it seems like QQQ and SPY are both good choices; however, before I just say fuck it and buy it straight away I could use some advice from you guys as you are definitely more knowledgeable about stuff like this. So, do you guys think investing in QQQ and SPY is a good idea? Or are there bet there options for the ROTH IRA. Thank you!",
        "subreddit": "stocks",
        "title": "Roth IRA",
        "url": "https://www.reddit.com/r/stocks/comments/gz1wh6/roth_ira/",
        "created": 1591660423.0
    },
    {
        "author": "LosMets69",
        "created_utc": 1591884538,
        "id": "h0zzq0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I just bought GNUS on a limit order at 3.29 a share. In my account it’s telling me I have a cost basis per share of 3.61 for GNUS. Any idea as to why it could be off by 32 cents?",
        "subreddit": "pennystocks",
        "title": "Fidelity App question",
        "url": "https://www.reddit.com/r/pennystocks/comments/h0zzq0/fidelity_app_question/",
        "created": 1591913338.0
    },
    {
        "author": "nattybber",
        "created_utc": 1591958994,
        "id": "h7ihu4",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So in the Fidelity app, I can refresh my portfolio and it’ll give me real-time info on my price changes during market hours.\n\nBut, extended hours do not show up, and I end up going to RH to check it out.\n\nIs there any way in the app where I can customize my view to check out what my portfolio is doing during extended hours???",
        "subreddit": "stocks",
        "title": "Fidelity app - how can I see after-hour changes??",
        "url": "https://www.reddit.com/r/stocks/comments/h7ihu4/fidelity_app_how_can_i_see_afterhour_changes/",
        "created": 1591987794.0
    },
    {
        "author": "rms313",
        "created_utc": 1591841427,
        "id": "h0pxub",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "***(edit: I'm going into some detail on my personal portfolio allocation, but within the larger topic of where we all see the bigger opportunities given recent market performance, namely whether the big growth names like AMZN, AAPL, GOOG, TSLA are more likely to continue to rip, or if it's a good time to take some profits there and move into areas that haven't rebounded as well, be it just broader S&amp;P or mid/small)***\n\nMy 401k is through Fidelity and I'm currently about half allocated to US large cap (will give that breakdown below), then smaller amounts to US mid cap (15%), US small cap (15%), international (10%), bonds (7%), and real estate (3%)\n\nThat big half of the portfolio to US large cap is itself split between a \"blue chip growth fund\" (20%) which top holdings include AMZN, APPL, GOOG, MSFT, FB, V, even TSLA... then 20% to S&amp;P 500, and 10% to a large cap dividend fund.\n\nThe blue chip growth fund has been on a tear lately with those top names, for years I had been strongly just in the S&amp;P500 fund but believed that \"blue chips\" were likely to better weather covid issues than the broad index funds, so I changed that up. My dilemma at this point is whether to stay allocated like this or shift even more heavily into that growth fund (w/ AMZN, APPL, MSFT) OR take some profits *from that* and reallocate into the areas that haven't bounced back as well, to capture such a rebound. The S&amp;P500 hasn't done as well as those big name growth stocks, and small caps lag way behind that.\n\nI had also considered going to even less on international, real estate, and near zero on bonds (my horizon is another 20 years), and again a question of what to put that into: growth, S&amp;P, mid, small...\n\nI know I can stick to a typical rebalancing strategy, but I'm willing to risk a bit more on a good thesis, for example I'm leaning to going even heavier toward those growth names now and further away from S&amp;P, but also interested putting more into the small caps should they bounce back.\n\nWhat are you all doing along these lines?",
        "subreddit": "investing",
        "title": "Any current thesis on large cap vs mid vs small, growth vs value...",
        "url": "https://www.reddit.com/r/investing/comments/h0pxub/any_current_thesis_on_large_cap_vs_mid_vs_small/",
        "created": 1591870227.0
    },
    {
        "author": "nxnchx117",
        "created_utc": 1593179763,
        "id": "hg816k",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hey guys,   \nI have been reading a lot about Ark invest recently and I want to start investing in couple of their ETF's. My question is, which broker in Europe supports their products? I have been looking at Fidelity but I want to see what other options there are",
        "subreddit": "investing",
        "title": "Ark invest in Europe",
        "url": "https://www.reddit.com/r/investing/comments/hg816k/ark_invest_in_europe/",
        "created": 1593208563.0
    },
    {
        "author": "HiiAndByee",
        "created_utc": 1592378384,
        "id": "hamfzb",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hi everyone, \n\nI had a question regarding the difference between Bank CD and Brokered CD. I can see on Fidelity that i’m able to purchase Brokered CD’s, but not bank CD’s. I thought it’d be nice to be able to purchase bank CD’s (like Capital One) through fidelity instead of doing all the busy work of creating a new account at Capital One and transferring money there. I guess my question is why doesn’t Fidelity sell Bank CD’s? is it that it’s not a profitable business or just legally not possible? \n\nThank you in advance!",
        "subreddit": "investing",
        "title": "Fidelity — Bank CD vs. Brokered CD",
        "url": "https://www.reddit.com/r/investing/comments/hamfzb/fidelity_bank_cd_vs_brokered_cd/",
        "created": 1592407184.0
    },
    {
        "author": "pythonicprime",
        "created_utc": 1591026836,
        "id": "gun25l",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[Payout profiles - Vanilla put vs inverted 1x2 put spread](https://preview.redd.it/g96ctvidlb251.jpg?width=2588&amp;format=pjpg&amp;auto=webp&amp;s=3ceb4752d2a00e0f9bf399c853defc9c3c004be9)\n\nHello, first time posting in WSB\n\nI see some traders struggling with losses as they try to to express bearish views on the market, so I thought it might be useful to post a reminder about a nifty and simple structure that even professional managers use at times when it’s hard to time the market (source: I work in a well known macro hf)\n\nFor those who have never seen this structure yet, please meet the **inverted 1x2 put spread**\n\n# What is it\n\nIt’s a combo of 2 puts that costs 0 net premium and has limited downside. It can be used to express a bearish view on the market, if you expect the market to **fall fast or fall a lot**\n\nYou can find a lot about it on the internet and it’s really not rocket science so I’ll [send you to Fidelity for the technical deets](https://www.fidelity.com/learning-center/investment-products/options/options-strategy-guide/1x2-ratio-vertical-spread-puts) and just focus on how we use it to fade a rally.\n\n# How do you use it\n\nWhen the market is toppy and vols are coming down, it’s an easy way to fade the market with limited risk in case the rally continues hard.\n\nYou deploy it with 1-2m tenor options and keep it for 2w at most. The key aspect is that the option has a good payout profile as shown above: **on a short-term horizon your loss profile is very contained** even in the triangular loss area where the loss is highest.\n\nIf market falls fast you profit, if markets rally hard you lose 0, if markets move sideways you bleed a bit of theta. The point being, if the market keeps rallying you get a second chance to try again.\n\n# Pros\n\n1. Protects you from bad timing: if you want to go short and the market rallies, you lose nothing and try again\n2. It works well to fade an equity rally because usually at the top of the market i) vols are low and ii) the fall can be fast\n3. *Bonus: you see the triangular loss area? When you fall there, usually vols are moving up and this gives you another boost to limit losses*\n\n# Cons\n\n1. Works only if the drop is large and/or fast, and profits will always lag a vanilla put\n2. Has negative theta at-the-money for the first week - if the market stays flat, you bleed some\n3. Has 3x transaction costs than a normal put\n\n# Is now a good moment to use it\n\nIt beats buying vanilla outright puts for sure in terms of premium deployed, but with VIX at 29 it's still nowhere near a good moment to be long vol - but again, beats buying outrights. With vols &lt;15 at index level, this becomes a no-brainer\n\n# Disclaimer\n\nRemember that like any other option structure, this a specialized tool for a specific task. It will not make money per se, rather it will help you express a view with a control on the loss profile.",
        "subreddit": "wallstreetbets",
        "title": "Fading the rally with contained risk: the 1x2 put spread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gun25l/fading_the_rally_with_contained_risk_the_1x2_put/",
        "created": 1591055636.0
    },
    {
        "author": "TriggerWarning9",
        "created_utc": 1591757678,
        "id": "h02dea",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "If, say after years of bagholding and DCAing, you have about 20-100k+ in Robinhood. How secure is that actually? In terms of hacking/safety/insurance etc. What happens if Robinhood goes awry as a company and closes or something similar? I hear a lot of people say fidelity and others, but what are the major differences security wise? Sorry for noob q. Thanks to anyone for their time.",
        "subreddit": "RobinHood",
        "title": "Is it a bad idea to have a “big” holding in Robinhood?",
        "url": "https://www.reddit.com/r/RobinHood/comments/h02dea/is_it_a_bad_idea_to_have_a_big_holding_in/",
        "created": 1591786478.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1592661531,
        "id": "hcmpne",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning June 22nd, 2020.\n\n# **The stock market is running out of steam with reopening trades fading and economic data ‘uneven’  - [(Source)](https://www.cnbc.com/2020/06/19/the-stock-market-is-running-out-of-steam-with-reopening-trades-fading-and-economic-data-uneven.html)**\n*****\n&gt; Federal Reserve Chairman Jerome Powell is expected to reassure markets next week the central bank will do whatever it takes to help the economy heal. That should be enough to keep investors moving into stocks that benefit from an economic rebound and push the S&amp;P 500 into the green for 2020.\n*****\n&gt; The stock market, so eager to put the entire blow from the pandemic behind it, is now coming to terms that a “V-shaped” recovery might be too rosy a scenario. \n*****\n&gt; With recent spikes in coronavirus cases and fluctuations in the economic data, the market seems to be stuck in a range amid elevated volatility. Market analysts said investors should expect more turbulence ahead because the economic recovery is most likely to be bumpy.\n*****\n&gt; “The market was priced for a continuation of improvement and I think that’s overstating what’s going to happen,” said Brian Levitt, Invesco’s global market strategist. “We are going to have episodes of cases rising. We are going to have a very slow and uneven improvement in the jobs market.”\n*****\n&gt; After soaring more than 40% from the March lows, the S&amp;P 500 turned sideways in the past two weeks, trading at similar levels to early June. The market, which used to turn a blind eye to disastrous news on the thinking that the economy had already bottomed, has become more vulnerable to negative economic headlines as the data begins to give a read on the shape of the recovery.\n*****\n&gt; Stocks came under pressure earlier this week after data showed weekly jobless claims rose more than expected last week, and the number stayed above 1 million for the 13th consecutive week. \n*****\n&gt; And on the virus front, California, Texas, Florida and Arizona have reported an uptick in new infections and hospitalizations amid the reopening. Apple said Friday that it’s again closing some stores in Florida, North Carolina and Arizona due to the spikes in coronavirus cases, which sparked a sell-off in the market, especially among retail stocks.\n*****\n&gt; “The economy is going to need more help to bounce back in months to come,” said Matt Miskin, co-chief investment strategist at John Hancock Investment Management. “For now, volatility and choppy markets remain our base case as an uneven economic recovery likely unfolds.”\n*****\n&gt; # ‘Rolling Ws’\n&gt; The rally in those popular reopening trades — airlines, cruise lines and hotels — is seemingly losing steam. Shares of American Airlines and Delta posted their second straight weekly losses. So did Carnival, Norwegian Cruise and MGM Resorts. Those stocks were once the high-beta leaders of the market comeback as investors bet that a successful reopening would take hold. \n*****\n&gt; “Although the stock market was suggesting a V-shaped recovery, the more likely scenario is rolling Ws,” Liz Ann Sonders, chief investment strategist at Charles Schwab, said in a note.\n*****\n&gt; A similar market pattern happened during the financial crisis, pointed out by Nicholas Colas, co-founder of DataTrek Research. After stocks rallied nearly 40% from the 2009 bottom, the market was range-bound for about seven weeks so the fundamentals could catch up, Colas noted.\n*****\n&gt; From a technical perspective, Matthew Maley, chief market strategist at Miller Tabak, is watching if the S&amp;P 500 can break above its recent high of 3,232 or drop below the 3,000 threshold or its 200-day moving average of 3,018 as of Friday.\n*****\n&gt; “Whichever way it breaks...should be an very important development in trying to determine how this critical juncture in the stock market will be resolved,” Maley said in a note.\n*****\n&gt; # Fed can’t prevent volatility\n&gt; While the flattening virus curve played a big role in the market rebound, it’s no denying that the Federal Reserve’s unprecedented stimulus has been a key driver in lifting stocks from the coronavirus slump. The central bank unleashed another weapon in its arsenal this week, saying it will start buying individual corporate bonds.\n*****\n&gt; As comforting as it is to have the Fed’s support, the central bank can only do so much to ease investor fears.\n*****\n&gt; “The Fed can’t prevent the volatility we’re seeing in stocks,” Lindsey Bell, chief investment strategist at Ally Invest, said in a note. “It will likely take years for the economy to fully recover and there remain other uncertainties on the path ahead. As such, investors may continue to struggle with this mismatch between markets and the economy before seeing the case for new highs.”\n*****\n&gt; Fed Chairman Jerome Powell reminded investors again this week in his semiannual testimony before Congress that “significant uncertainty remains about the timing and strength of the recovery.”\n*****\n&gt; Many on Wall Street have also warned that extended policy measures including injection of trillions of cheap money would lead to problems down the road such as hyperinflation.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.postimg.cc/bNCgvcfK/finvizmaps2.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.postimg.cc/mkTjPTDG/alphatrends61920.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.postimg.cc/pTfkVmPZ/finvizfuts1.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.postimg.cc/KYZ2133z/econcal1.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/3JRjVS09/marketdata1.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/SQV7ZFRJ/spxsectors1.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/QMkWH1WH/marketpullbacklevels1.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/xCfNH8Kg/marketrallylevels1.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/3w88YJPH/ercal1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.postimg.cc/Dzzn76x5/ipos1.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.postimg.cc/XqFWYcpP/upgradesdowngrades1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.postimg.cc/C19Y06LD/upgradesdowngrades2.png))**\n\n*****\n\n# 100 Days\n\n&gt; 100 days ago today on March 11th, the WHO made it official and declared the COVID-19 outbreak a pandemic. Markets were already under a lot of pressure before the WHO declared the pandemic, but the 100 days since will probably go down as some of the craziest 100 days we'll ever experience, not only in the market but in general society as well. More than enough ink and pixels have been spent discussing the societal impact at large, so we'll spare you and just focus on the markets.\n\n&gt; While much of the declines were already in the rearview mirror by the time the WHO made its announcement, equities still had a steep decline in the immediate aftermath. The large-cap Russell 1000, for example, fell another 19% to its March 23rd closing low, but after the rebound, the net change since the pandemic was officially declared &gt; has been a gain of 14.3%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Russell-1000.png))**\n\n&gt; As impressive as the Russell 1000's gain has been in the face of the global pandemic, many stocks have done a lot better than that. The table below lists the 25 stocks in the index that have seen the biggest gains so far during this pandemic. Topping the list is Wayfair (W) which has rallied more than 350%. If there is one thing Americans must have realized while they were stuck at home under lockdown it was that they needed some new furniture! Behind Wayfair, two other stocks have more than tripled and both were beaten down stocks from the Energy sector that were trading at less than $2 per share on March 11th. A number of familiar names standout including Moderna (MRNA), Twilio (TWLO), DocuSign (DOCU), Beyond Meat (BYND), and Etsy (ETSY), but looking through the list, there's really a diverse group of names ranging from bombed-out stocks from the Energy sector (8 stocks), Consumer names (7 stocks), and the ever-popular software stocks from the Technology sector (6 stocks). It's definitely been a rocky road for the markets over the last 100 days, but for anyone who had these names in their portfolio, they aren't complaining. Click here to view Bespoke's premium membership options for access to our weekly Bespoke Report which includes an update to our Stocks for the COVID economy portfolio that was released on March 11th.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Russell-1000-Best.png))**\n\n*****\n\n# S&amp;P 500 Industry Group Breadth Remains Positive\n\n&gt; Equity markets have become a bit wobbly in the last week or so, but breadth, in terms of large-cap industry groups, still remains pretty robust. Relative to their 50-DMAs, all 24 S&amp;P 500 industry groups still have rising 50-DMAs. When you consider the fact that the 50-day window spans the period going back to early April, a period encompassing most of what was one of the strongest 50-day rallies on record, the fact that every industry group has a rising 50-DMA isn't all that surprising.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Rising-50DMA.png))**\n\n&gt; Even though all their 50-DMAs are rising, not every industry group is currently trading above its 50-DMA. While the reading briefly reached 100% in late May and early June, two industry groups have since pulled back below their 50-DMAs, putting the percentage at a still impressive 91.7%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Above-50-DMA.png))**\n\n&gt; The table below summarizes industry group performance showing YTD performance, where each one is trading relative to its 50-DMA, as well as where the group is trading relative to its 52-week high.\n\n&gt; As mentioned above, all but two groups (Drugs &amp; Biotech and Food &amp; Staples Retail) remain above their 50-DMAs, and another four are less than 2% above their 50-DMA. If Friday's sell-off deepens into next week, the percentage of industry groups above their 50-DMAs has the potential to quickly sink as low as 75%. Of the 22 industry groups that are above their 50-DMAs, Autos and Tech Hardware are the only two greater than 10% above.\n\n&gt; On a YTD basis, the S&amp;P 500 is down less than 4%, but for the vast majority of industry groups, performance has been worse than that. Of the 24 groups shown, 16 are down more than 4% YTD, including eleven that are down over 10%. The worst performers of these losers include Energy, Banks, and Autos. While Energy gets most of the attention for being so weak, Banks are essentially down just as much! On the upside, just two industry groups are up over 10% (Retailers, which is basically Amazon, and Software &amp; Services). Retailing is also the one industry group that is within 1% of a 52-week high and one of seven that is within 4% of a 52-week high.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061920-Groups-vs-50-DMA.png))**\n\n*****\n\n# Credit Market Reversals\n\n&gt; We've noted in detail the massive reversals seen in global equities over the last three months, but outside of equities, we've also seen some other massive moves. One example is credit spreads between the yields of corporate and high yield bonds relative to Treasuries.\n\n&gt; The top chart below shows the spread in yields between the B of A Corporate Index relative to Treasuries going back to 1997, and below that, we show the 50-day rate of change in the spread. Heading into the COVID-crash, spreads on corporate bonds were less than 100 basis points (bps), meaning the corporate bond index was yielding only 1 percentage point more than comparable Treasury yields. In the span of less than two months, though, spreads surged by more than 300 bps to over 400 bps. Not since the depths of the credit crisis in 2009 had we seen spreads widen out more than they did in March. Just as notable as the level is the fact that the speed with which spreads widened during the COVID-crash was similar to the pace during the credit crisis.\n\n&gt; While spreads were quick to spike during both crises, they narrowed nearly as fast both times. Going back to 1997, the most corporate spreads have ever narrowed over a 50-day period was in June 2009. Coming in at a close second place, though, the 50-day period ending in early June was nearly as extreme.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061820-Corporates.png))**\n\n&gt; Similar to spreads on corporate bonds, the movement in spreads on high yield (junk) credit has been nearly as extreme. While spreads on the B of A High Yield Master Index widened out by only half as much during the COVID-crash as they did during the Financial Crisis, the 50-day move ending in late March was easily more extreme than any other period outside of the credit crisis.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061820-High-Yield.png))**\n\n&gt; A shown in both charts above, the only time both corporate and high yield spreads narrowed by an amount anywhere close to the amount they narrowed from late March through early June was back in early June of 2009. The chart below of the S&amp;P 500 shows that point from the perspective of the S&amp;P 500. That period in June 2009 was right in the early stages of what turned out to be a multi-year bull market. Given the similar tightening in the credit market now versus back then, should we assume a similar move for equities going forward?\n\n&gt; After the last five months, we'll be the first to say that anything is possible. However, while there are plenty of similarities between the moves in credit markets over the last three months versus the first half of 2009, there are also important distinctions. The most important of these has to do with where the S&amp;P 500 is trading right now. The second chart below shows the historical levels the S&amp;P 500 has traded at relative to its all-time high. Even after the initial narrowing of credit spreads from March through early June 2009, the S&amp;P 500 was still more than 40% off its all-time highs, and therefore still had a lot of climbing to do to get out of the hole. Back in June 2009, to get back to its all-time high from October 2007, the S&amp;P 500 still had to rally another 75%. Today, it's a much different picture as the S&amp;P 500 is already within 10% of its February 2020 all-time high. Could we be in the earlier stages of what turns out to be another long-term bull market? Sure. Will the magnitude of the gains be anything like the gains early on in the bull market that began in 2009? It's unlikely.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061820-SP500.png))**\n\n*****\n\n# The Very Slow Recovery In Economic Activity Is Continuing\n\n&gt; As economies around the country slowly recover from COVID-19 and reopenings proceed, economic activity is slowly recovering. For the hardest-hit sectors, though, the recovery is only inching forward. Security checkpoint volumes at US airports are still down 80% YoY, and the trend of improvement is only set to return travel activity to 50% of 2019 levels in September.\n\n&gt; For restaurants, OpenTable data shows covers down by two-thirds from last year, though some of that is because many restaurants remain closed. Among reopened establishments, the number of seated customers are still down almost 40% YoY. About half of restaurants remain closed per the OpenTable data. We discussed this chart and other retail enthusiasm indicators in last night's Closer report, which is available to Bespoke Institutional members.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/06/061720-High-Frequencyt.png))**\n\n*****\n\n# Leading Indicators Turn Positive\n\n&gt; Yesterday, The Conference Board released last month’s reading for its Leading Economic Index (LEI), a composite of leading data series, which showed a month-over-month increase of 2.8%. As seen in the LPL Chart of the Day, the return to positive territory follows three straight months of negative monthly growth.\n\n&gt; ”We noted that the pace of the LEI’s deterioration slowed in the April report, potentially suggesting a bottom forming in the US economy,” said LPL Financial Senior Market Strategist Ryan Detrick. “Yesterday’s print was one of several positive economic data surprises we’ve observed recently, bolstering our optimistic view for economic growth in the second half of the year.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.19.20-blog-chart.png?ssl=1))**\n\n&gt; While the economy still has a ways to go in order to recover from the damage of the prior three months, the composition of May’s LEI advance encourages us. We noted a disconnect in April’s readout in which the financial market indicators tended to be net positive contributors while the “real economy” indicators detracted. May’s release saw a reversal of that trend whereby the economic subindexes played catch-up. Seven of the 10 components were positive contributors led by an improvement in average weekly initial unemployment claims, average weekly manufacturing hours, and building permits. The three negative contributors were the Institute for Supply Management (ISM) New Orders Index, average consumer expectations for business conditions, and the Leading Credit Index.\n\n&gt; The most recent LEI release reinforces our view that an economic bottom is likely behind us. Workers starting to return to jobs that they were unable to do remotely had material effects on May’s readout, and if that trend continues, a stock market trading at stretched valuations would have a stronger foundation under it.\n\n*****\n\n# 3 Charts That Have Our Attention\n\n&gt; Stocks have shaken off the 5.9% S&amp;P 500 Index drop last Thursday by gaining three days in a row before yesterday’s modest weakness. While researching and reading this week, three charts stood out that tell us quite a good deal about how investors have reacted during this volatile market and what could be next.\n\n&gt; “Incredibly, we saw nearly a third of all investors over 65 years old sell their full equity holdings,” explained LPL Financial Senior Market Strategist Ryan Detrick. “With stocks now back near highs, this is yet another reason to have a plan in place before trouble comes, as making decisions when under duress can lead to the exact wrong decision.”\n\n&gt; As shown in the LPL Chart of the Day, according to data from Fidelity Investments, nearly 18% of all investors sold their full equity holdings between February and May, while a much higher percentage that were closer to retirement (or in retirement) sold. Some might have bought back in, but odds are that many are feeling quite upset with the record bounce back in stocks here.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-1.png?ssl=1))**\n\n&gt; Along these same lines, investors have recently moved to cash at a record pace. In fact, there is now nearly $5 trillion in money market funds, almost twice the levels we saw this time only five years ago. Also, the past three months saw the largest three-month change ever, as investors ran to the safety of cash. If you were looking for a reason stocks could continue to go higher over the longer term, there really is a lot of cash on the sidelines right now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-2.png?ssl=1))**\n\n&gt; Last, we noted last week that the extreme overbought nature of stocks here is actually consistent with the start of a new bull run, not a bear market bounce, or the end of a bull market. Adding to this, the spread between the number of stocks above their 50-day moving average and 200-day moving average was near the highest level ever. Think about it; with the 45% bounce in the S&amp;P 500, many stocks were above their 50-day moving average, but not nearly as many were above their 200-day moving average. So from a longer-term perspective, there could still be gains to be had.\n\n&gt; Sure enough, looking at other times that had wide spreads, they took place near the start of major bull markets. Near-term the potential is there for a well-deserved pullback, but going out 6 to 12 months, stocks have consistently outperformed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-3.png?ssl=1))**\n\n*****\n\n# Election Year July Performance Tepid\n\n&gt; July historically is the best performing month of the third quarter however, the mostly negative results in August and September tend to make the comparison easy. Two “hot” Julys in 2009 and 2010 where DJIA and S&amp;P 500 both gained greater than 6% and a strong performance in 2013 and 2018 have boosted July’s average gains since 1950 to 1.2% and 1.1% respectively. Such strength inevitability stirs talk of a “summer rally”, but beware the hype, as it has historically been the weakest rally of all seasons (page 74, Stock Trader’s Almanac 2020).\n\n&gt; July begins NASDAQ’s worst four months and is the third weakest performing NASDAQ month since 1971, posting a 0.5% average gain. Dynamic trading often accompanies the first full month of summer as the beginning of the second half of the year brings an inflow of new capital. This creates a bullish beginning, a soft week after options expiration and some strength towards the end.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/f885bb39aabd998cfc1457d4a0cbfb36/6b8e9304ec3e7ef8-8a/s400x600/ea91fed87507aed1f64cc4ae460a0006a0a987a5.jpg))**\n\n&gt; Election year Julys rank in the bottom half of all election year months. DJIA: 0.5%, 6th worst; S&amp;P 0.4% 6th worst; NASDAQ (since 1972): -0.7% 3rd worst; Russell 2000 (since 1980): -0.2% 3rd worst.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/06/6.18.20-blog-chart-2.png?ssl=1))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending June 19th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=x-_dzt3pDt4)**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 6.21.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=am-semSdkNU))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NKE** \n&gt; * **$RAD** \n&gt; * **$DRI** \n&gt; * **$WGO** \n&gt; * **$MKC** \n&gt; * **$WTI** \n&gt; * **$INFO** \n&gt; * **$ACN** \n&gt; * **$KBH** \n&gt; * **$SOHO** \n&gt; * **$FDS** \n&gt; * **$BB** \n&gt; * **$AVAV** \n&gt; * **$LZB** \n&gt; * **$XAIR** \n&gt; * **$CAAS** \n&gt; * **$MCF** \n&gt; * **$BWAY** \n&gt; * **$SNX** \n&gt; * **$GMS** \n&gt; * **$WOR** \n&gt; * **$QMCO** \n&gt; * **$AFMD** \n&gt; * **$EPAC** \n&gt; * **$WUBA** \n&gt; * **$USAT** \n&gt; * **$NG** \n&gt; * **$PDCO** \n&gt; * **$APOG** \n&gt; * **$PRGS** \n&gt; * **$FUL** \n&gt; * **$AEMD** \n&gt; * **$AIH** \n&gt; * **$YRD** \n&gt; * **$STAF** \n&gt; * **$UFAB** \n&gt; * **$CAMP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.postimg.cc/3w88YJPH/ercal1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.postimg.cc/Bvmq6f0P/ervol1.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 6.22.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n&gt; # ***Monday 6.22.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oRk1EWr.png))\n\n*****\n\n&gt; # ***Tuesday 6.23.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/o3y0OMu.png))\n\n&gt; # ***Tuesday 6.23.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/LnfpSm3.png))\n\n*****\n\n&gt; # ***Wednesday 6.24.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Fo1uuw1.png))\n\n&gt; # ***Wednesday 6.24.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/IUlzLOq.pngg))\n\n*****\n\n&gt; # ***Thursday 6.25.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ygKaF2x.png))\n\n&gt; # ***Thursday 6.25.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/PlIFXwS.png))\n\n*****\n\n&gt; # ***Friday 6.26.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/U4g7nNG.png))\n\n*****\n\n&gt; # ***Friday 6.26.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Nike Inc $95.78\n&gt; **Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, June 25, 2020. The consensus earnings estimate is $0.03 per share on revenue of $8.35 billion and the Earnings Whisper ® number is $0.10 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 95.16% with revenue decreasing by 18.01%. Short interest has decreased by 0.8% since the company's last earnings release while the stock has drifted higher by 19.6% from its open following the earnings release to be 3.9% above its 200 day moving average of $92.17. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, June 11, 2020 there was some notable buying of 7,691 contracts of the $102.00 call expiring on Friday, July 10, 2020. Option traders are pricing in a 6.6% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Darden Restaurants, Inc. $70.27\n&gt; **Darden Restaurants, Inc. (DRI)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, June 25, 2020. The consensus estimate is for a loss of $1.78 per share on revenue of $1.25 billion and the Earnings Whisper ® number is ($1.68) per share. Investor sentiment going into the company's earnings release has 28% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 201.14% with revenue decreasing by 43.92%. Short interest has increased by 33.2% since the company's last earnings release while the stock has drifted higher by 108.3% from its open following the earnings release to be 27.4% below its 200 day moving average of $96.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, June 9, 2020 there was some notable buying of 3,882 contracts of the $70.00 call and 814 contracts of the $80.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 8.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DRI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Rite Aid Corp. $12.41\n&gt; **Rite Aid Corp. (RAD)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, June 25, 2020. The consensus estimate is for a loss of $0.38 per share on revenue of $5.60 billion and the Earnings Whisper ® number is ($0.35) per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 171.43% with revenue increasing by 4.23%. Short interest has increased by 11.0% since the company's last earnings release while the stock has drifted higher by 0.6% from its open following the earnings release to be 1.6% below its 200 day moving average of $12.61. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, June 15, 2020 there was some notable buying of 1,617 contracts of the $14.00 call expiring on Friday, June 26, 2020. Option traders are pricing in a 18.4% move on earnings and the stock has averaged a 21.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RAD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Winnebago Industries, Inc. $68.36\n&gt; **Winnebago Industries, Inc. (WGO)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, June 24, 2020. The consensus estimate is for a loss of $0.41 per share on revenue of $325.94 million and the Earnings Whisper ® number is ($0.35) per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 135.96% with revenue decreasing by 38.38%. Short interest has increased by 12.4% since the company's last earnings release while the stock has drifted higher by 156.7% from its open following the earnings release to be 46.4% above its 200 day moving average of $46.69. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 19, 2020 there was some notable buying of 583 contracts of the $55.00 put expiring on Friday, July 17, 2020. Option traders are pricing in a 13.5% move on earnings and the stock has averaged a 10.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# McCormick &amp; Company, Incorporated $172.20\n&gt; **McCormick &amp; Company, Incorporated (MKC)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, June 25, 2020. The consensus earnings estimate is $1.14 per share on revenue of $1.29 billion and the Earnings Whisper ® number is $1.18 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.72% with revenue decreasing by 0.91%. Short interest has decreased by 27.3% since the company's last earnings release while the stock has drifted higher by 23.1% from its open following the earnings release to be 7.4% above its 200 day moving average of $160.35. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MKC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# W&amp;T Offshore Inc. $2.57\n&gt; **W&amp;T Offshore Inc. (WTI)** is confirmed to report earnings at approximately 4:45 PM ET on Monday, June 22, 2020. The consensus earnings estimate is $0.03 per share on revenue of $129.93 million and the Earnings Whisper ® number is $0.01 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 40.00% with revenue increasing by 11.93%. Short interest has increased by 95.3% since the company's last earnings release while the stock has drifted higher by 3.6% from its open following the earnings release to be 33.8% below its 200 day moving average of $3.88. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.1% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WTI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# IHS Markit Ltd. $72.03\n&gt; **IHS Markit Ltd. (INFO)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, June 23, 2020. The consensus earnings estimate is $0.67 per share on revenue of $1.05 billion and the Earnings Whisper ® number is $0.68 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 5.63% with revenue decreasing by 7.53%. Short interest has decreased by 27.7% since the company's last earnings release while the stock has drifted higher by 44.2% from its open following the earnings release to be 3.4% above its 200 day moving average of $69.69. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.4% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=INFO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Accenture Ltd. $201.55\n&gt; **Accenture Ltd. (ACN)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, June 25, 2020. The consensus earnings estimate is $1.84 per share on revenue of $10.94 billion and the Earnings Whisper ® number is $1.89 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 4.66% with revenue decreasing by 1.44%. Short interest has increased by 20.0% since the company's last earnings release while the stock has drifted higher by 33.2% from its open following the earnings release to be 5.6% above its 200 day moving average of $190.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, June 5, 2020 there was some notable buying of 1,740 contracts of the $190.00 put expiring on Friday, August 21, 2020. Option traders are pricing in a 6.8% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ACN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Sotherly Hotels Inc. $2.96\n&gt; **Sotherly Hotels Inc. (SOHO)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, June 24, 2020. The consensus earnings estimate is $0.16 per share on revenue of $16.30 million. Investor sentiment going into the company's earnings release has 26% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 48.39% with revenue decreasing by 65.60%. Short interest has increased by 2,813.7% since the company's last earnings release while the stock has drifted lower by 43.4% from its open following the earnings release to be 39.4% below its 200 day moving average of $4.88. The stock has averaged a 3.0% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SOHO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# KB Home $32.29\n&gt; **KB Home (KBH)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, June 24, 2020. The consensus earnings estimate is $0.57 per share on revenue of $1.17 billion and the Earnings Whisper ® number is $0.49 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.76% with revenue increasing by 14.50%. Short interest has decreased by 2.1% since the company's last earnings release while the stock has drifted higher by 65.5% from its open following the earnings release to be 3.6% above its 200 day moving average of $31.18. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.7% move on earnings and the stock has averaged a 4.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KBH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning June 22nd, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/hcmpne/wall_street_week_ahead_for_the_trading_week/",
        "created": 1592690331.0
    },
    {
        "author": "Crazrwire999",
        "created_utc": 1593203661,
        "id": "hgfgle",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I don't have too much money tied up to bonds right now at all. I just started investing in the last few years. I have nearly all of my allocation in stocks right now. This was before I knew about investing in stocks at all. As far as stocks are concerned I think I have gotten a much better grasp about stock investing. I have been reading a lot of books on value investing and have a few metrics for how to find cheaply priced stocks. These range from low formula based metrics, to seeing improvements in earnings and free cash flow, to using the balance sheet and finding intrinsic value (such as the price relative to the cash and cash equivalents per shares outstanding). \n\nIt wasn't until now that I have been learning more about bonds. As we all probably know in the long term stocks outperform bonds. However, at the same time, there are many different reasons why people would want to invest in bonds. 1) to reduce volatility, 2) for fixed income (similar but not the same as dividends), and 3) for speculating purposes (you think that interest rates are quite high and can probably go lower in the near future). \n\nSome investors such as Peter Lynch are not big fans of bonds in general. Other investors such as Preston Pysch (a more contrarian value investor) believe in buying bonds during stock bull markets (when interest rates are higher) and stocks during stock bear markets. \n\nAs of right now I have a minor position in bond funds through Fidelity. Given that interest rates are very low (even negative) would it not make sense to sell bond funds right now since interest rates can probably only potentially go lower slightly and reput a position in bonds in years from now when we start reaching the heights of the economy again (when interest rates start climbing back up)? \n\nAs of right now, I am 26. I was planning on buying more bonds for my portfolio (30-year treasuries and other similar bonds) around age 30 and keep them for maturity or until interest rates fall again) and probably some shorter-term bonds. \n\nI figure as I get older it would be good to have a mixture of bonds and dividend-paying stocks.",
        "subreddit": "investing",
        "title": "Selling bond funds and optimizing bond investing",
        "url": "https://www.reddit.com/r/investing/comments/hgfgle/selling_bond_funds_and_optimizing_bond_investing/",
        "created": 1593232461.0
    },
    {
        "author": "UmbertoDee",
        "created_utc": 1592098300,
        "id": "h8kh8u",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Sorry if this is a dumb question.....  \n\n  \n\n I have a trust fund and two IRAs on Fidelity, one is traditional, one is a Roth. The IRAs dont have large amount of capital yet but i am contributing every year. One IRA is an index target fund, the other is a 3-4 fund type portfolio. The trust at the moment has mostly ETFs for long term growth and some stocks i trade for fun (and hopefully profit lol). I would guess it is better to start trading the stocks in the roth IRA for tax purposes? Any limitations or reason not to do this? Thanks.",
        "subreddit": "stocks",
        "title": "IRA trading",
        "url": "https://www.reddit.com/r/stocks/comments/h8kh8u/ira_trading/",
        "created": 1592127100.0
    },
    {
        "author": "LIT-BRO-DAD",
        "created_utc": 1591143839,
        "id": "gvjev5",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Buy as much as you can, speculators say it will happen any day. E\\*trade, Fidelity and Ally can trade it. A minimal amount of DD will do it for you.",
        "subreddit": "pennystocks",
        "title": "$ZEST",
        "url": "https://www.reddit.com/r/pennystocks/comments/gvjev5/zest/",
        "created": 1591172639.0
    },
    {
        "author": "frank_ly3",
        "created_utc": 1591261158,
        "id": "gwdrmn",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Realized I lost about 3-4K in cryptos about 2 years back... imagine if those had been put into penny stocks.... goddamn.....  that 3K is sitting at about $900 right now... they're on the rise but I'm thinking I'm gonna have to move them into this Fidelity account soon..  Anyone in a similar boat?",
        "subreddit": "pennystocks",
        "title": "Pennys &gt; Cryptos",
        "url": "https://www.reddit.com/r/pennystocks/comments/gwdrmn/pennys_cryptos/",
        "created": 1591289958.0
    },
    {
        "author": "mattcapra",
        "created_utc": 1591331691,
        "id": "gwxtpa",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nSo about a week ago I opened up a Roth IRA on Fidelity. I took my first 1000 out of my savings and contributed it into the roth, then I chose to invest that into FXAIX. Everything has been going fine, except I read earlier on a few websites that you actually have to be employed/have an earned income in order to have/contribute to a Roth. I have just been using money out of my savings since I'm 20 and a student in college without a job right now. I am wondering if I'm somehow breaking the law or the IRS is about to come for my ass, even though Fidelity hasn't told me anything regarding if I need to prove that i have an earned income or anything of the sort. Any advice is appreciated!",
        "subreddit": "investing",
        "title": "Opened Roth IRA while unemployed",
        "url": "https://www.reddit.com/r/investing/comments/gwxtpa/opened_roth_ira_while_unemployed/",
        "created": 1591360491.0
    },
    {
        "author": "j_solberg7",
        "created_utc": 1592247700,
        "id": "h9mix5",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I've been monitoring this company since before the spike that made it sail up 29% and make me a good chunk of change. One of my indicators to buy was a news catalyst about partnering with GNC and Vitamin Shoppe. That all led to a gradual increase in volume and the sudden spike later on. \n\nMoving on, this stock just had a few spikes in volume today, including a purchase of 1 million shares. They did have a nother tweet today about their Q2 revenues being \"beyond expectations\". I know some have talked about it being a possible shell corp, but the building its in has a Starbucks right there, which would make me think they're trying to slide their Secret Java line in. \n\nAnyway, just thought I'd let yall know. I'm going to monitor this potential beast for the next few days and see how that volume gets. But please, do your own DD before investing. Thank you!\n\n[GTEH Tweet 1](https://twitter.com/GenTechLeaf/status/1271429357119115265?s=19)\n\n[GTEH Tweet 2](https://twitter.com/GenTechLeaf/status/1271429357119115265?s=19)\n\nEdit: Just got told by a friend that GTEH isn't on RH. I use Fidelity, so I was unaware. I know a lot of you use two brokers. So switch over to the other and do that DD",
        "subreddit": "RobinHoodPennyStocks",
        "title": "A possible GTEH 🚀🚀",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/h9mix5/a_possible_gteh/",
        "created": 1592276500.0
    },
    {
        "author": "chadly117",
        "created_utc": 1592273794,
        "id": "h9ufxy",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hey guys. I already have a Vanguard ROTH IRA, so I figured I would also use Vanguard for my individual brokerage account to make more speculative/riskier options plays. I am currently in the process of transferring my assets from Robinhood to Vanguard.\n\nMy question is, does anyone here use Vanguard for options? And if so, how do you like the interface/experience? I would mostly be using it to sell cash covered puts and covered calls, nothing too crazy. I’m just a bit concerned cuz Vanguard seems a bit more archaic than the more modern traders like Schwab/Fidelity. Let me know what you guys think",
        "subreddit": "options",
        "title": "Anyone use Vanguard for options trading?",
        "url": "https://www.reddit.com/r/options/comments/h9ufxy/anyone_use_vanguard_for_options_trading/",
        "created": 1592302594.0
    },
    {
        "author": "AnonOptionsTrader",
        "created_utc": 1593025299,
        "id": "hf7364",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "FIDELITY Exposed My Account to Unlimited Risk",
        "url": "https://www.reddit.com/r/investing/comments/hf7364/fidelity_exposed_my_account_to_unlimited_risk/",
        "created": 1593054099.0
    },
    {
        "author": "MementoMori97",
        "created_utc": 1592940145,
        "id": "hel3de",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "**Note: I have a small options account on Robinhood separate from my actual brokerage account with Fidelity. This is just play money so thats why I have them separated to limit any risk I take.\n\nI understand the max loss and max gain concepts for options and different spreads. But I am unsure what is needed to open a credit spread on Robinhood. It sounds like you need enough cash or positions in your account to cover your max loss from the spread, am I understanding that correctly?\n\nI was looking at possibly opening some long dated put credit spreads for 2021or 2022 but do not have enough in my robinhood account to cover the max loss right now. I am fine with this as I could transfer some money no problem as it would only be a ~400$ loss or so.\n\nJust from reading on the robinhood website i'm not clear if that is an option or not. It seems like I would be unable to do that but just wanted to be sure I understood correctly.\n\nThanks if anyone can help me understand this better.",
        "subreddit": "options",
        "title": "Collateral on Robinhood for a Credit Spread",
        "url": "https://www.reddit.com/r/options/comments/hel3de/collateral_on_robinhood_for_a_credit_spread/",
        "created": 1592968945.0
    },
    {
        "author": "Tronn22",
        "created_utc": 1593534623,
        "id": "hiqp2z",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I’ve read on a few other subs that when LKNCY is delisted from NASDAQ that it becomes OTC and RH doesn’t support trading for OTC stocks, but others like Fidelity do. Will RH let me sit on what I own of LKNCY in hopes that in the future it may possibly be listed on NASDAQ again or maybe even that RH will eventually allow OTC stocks to be traded?",
        "subreddit": "RobinHood",
        "title": "What happens when LKNCY becomes officially delisted from NASDAQ and is OTC?",
        "url": "https://www.reddit.com/r/RobinHood/comments/hiqp2z/what_happens_when_lkncy_becomes_officially/",
        "created": 1593563423.0
    },
    {
        "author": "Used_Fleshlight",
        "created_utc": 1592340159,
        "id": "hacapr",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "This is specifically related to a Roth IRA account with Fidelity if that matters. Hopefully if this is a smart passive investment strategy I'm not limited to do this by this type of account.\n\nSo essentially, if I decide to loan out my shares, the only risk I take on is that the borrower defaults on the loan? Therefore, Fidelity would give me back the full cash amount of the loan on day 1? \n\nSo really, my only risk is that I would lose the shares but then get back the full cash value on the day that I started loaning out the shares? Would suck if you owned shares for years and wanted to buy back in at a much higher price though...\n\nI also understand the risk with dividends if I was on a normal account since they wouldn't be taxed as dividends or whatever, but seeing as I'm in a Roth IRA that doesn't matter to me. (Might suck if I'm trying to apply DRIP automatically and Fidelity's system doesn't offer that while loaning shares - but I can manually buy shares myself).\n\nAppreciate the help, thank you!",
        "subreddit": "investing",
        "title": "Am I understanding the risks of securities lending correctly?",
        "url": "https://www.reddit.com/r/investing/comments/hacapr/am_i_understanding_the_risks_of_securities/",
        "created": 1592368959.0
    },
    {
        "author": "rm49379",
        "created_utc": 1592490778,
        "id": "hbfpuj",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I'm a newbie I bought a half of a share of American Airlines and I am trying to sell it I'm with Fidelity and it tells me that I am in violation of the agreement that I signed can somebody please tell me what I should do thank you.",
        "subreddit": "stocks",
        "title": "Fraction",
        "url": "https://www.reddit.com/r/stocks/comments/hbfpuj/fraction/",
        "created": 1592519578.0
    },
    {
        "author": "sludgebeard",
        "created_utc": 1592274460,
        "id": "h9umh0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Last month I decided to get my finances in order, and one of those pillars was to start investing and gain a long-term foothold on my financial stability. \n\nSince that time, I have created a Fidelity (Moved from Ameritrade that I used 8 years ago) account, placed my Rollover IRA money into an ETF, added Investing money to my account, started researching different companies, learning the basics of investing and order types. \n\n...And have done ZERO investing. I feel like its incredibly hard to gauge when is the right time to buy into anything right now, so I've just kind of made the decision to keep trying to learn as much as I can, take some webinars, watch YT videos, and just look for a time that feels right. \n\nHas any potential new investors experienced this recently? Or an experiences investor in their past?",
        "subreddit": "investing",
        "title": "Waiting through the past month as a potential investor",
        "url": "https://www.reddit.com/r/investing/comments/h9umh0/waiting_through_the_past_month_as_a_potential/",
        "created": 1592303260.0
    },
    {
        "author": "slimarabia",
        "created_utc": 1591758872,
        "id": "h02o7x",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I’m brand new to trading stocks and am mostly just looking to buy and hold. I don’t have a huge amount of money to play with. I plan to just buy a couple hundred dollars of stocks monthly to start out. \n\nMy question is if it’s common for people to use Fidelity and RobinHood at the same time. Maybe for different kinds of investing? \n\nMy retirement account is through Fidelity, so my plan is to learn more about my Fidelity account as I continue to use RobinHood to acquaint myself to trading.",
        "subreddit": "RobinHood",
        "title": "I have a Fidelity account through work but just got RH",
        "url": "https://www.reddit.com/r/RobinHood/comments/h02o7x/i_have_a_fidelity_account_through_work_but_just/",
        "created": 1591787672.0
    },
    {
        "author": "ShigglyB002014",
        "created_utc": 1593328490,
        "id": "hha760",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Are there other brokers that have a real time quote like Webull and Robinhood for mobile? I have fidelity but I can't find a active chart like the other two have. Seems delayed or I have to refresh. Or maybe I'm missing it? TYIA",
        "subreddit": "pennystocks",
        "title": "Others besides Robinhood and Webull",
        "url": "https://www.reddit.com/r/pennystocks/comments/hha760/others_besides_robinhood_and_webull/",
        "created": 1593357290.0
    },
    {
        "author": "wrc-capital",
        "created_utc": 1591129140,
        "id": "gvexev",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Fron what I've read the top two seems to be interactive brokers and fidelity. For those of you who have traded on both, which gives you better fill? Any other brokers that is surprisingly good on order executions other than the two? I mostly trade equities and equity derivatives at the moment. I plan to expand my tools to include some futures in the near future. Bond trading might be in the distant future.",
        "subreddit": "investing",
        "title": "Best Broker for Order Execution",
        "url": "https://www.reddit.com/r/investing/comments/gvexev/best_broker_for_order_execution/",
        "created": 1591157940.0
    },
    {
        "author": "Jun1023",
        "created_utc": 1592365008,
        "id": "haj94m",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Can someone explain to me a bit more about the particulars of adjustment of cost basis with wash sales?\n\nFor example:\n\nJan 1, buy 10x Stock A at $100 each, cost basis of 1000.\n\nJan 10, sell 10x Stock A at loss of 90$ each, for net loss $100, but this is disallowed as within 30 days of the purchase.\n\nWhat happens now? Is there no cost basis adjustment unless you purchase stock again within 30 days of the sale? Alternatively, what happens if you don't buy anymore of Stock A, do you \"waste\" the adjustment to cost basis? Is this any different if you only sold 5 Stock instead of 10?\n\nUnder Fidelity, I have a fair amount of \"Disallowed Losses\" under \"Realized Gains/Losses\". I'm wondering if I should be repurchasing stock to at least take advantage of the wash sale as I believe that's what this number is reflecting. \n\n&amp;#x200B;\n\nThank you!",
        "subreddit": "investing_discussion",
        "title": "Question about Wash Sales",
        "url": "https://www.reddit.com/r/investing_discussion/comments/haj94m/question_about_wash_sales/",
        "created": 1592393808.0
    },
    {
        "author": "boldPlayIm",
        "created_utc": 1592538255,
        "id": "hbtg1w",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I  have 90 shares of AMZN in my Fidelity account and would like to sell covered call on margin  due to lack to of shares. The margin buying power buyer in my account is  shown as \\~200K.\n\nWhen I place sell to open call option it shows be below warning message:\n\n\"The sell call to open option order you entered is not covered by a long position in the underlying security.\"\n\nI'm  assuming that if I place this sell-to-open call order, it will be  connected to my already-holding 90 shares and the rest 10 shares to make  the covered call will go under my margin power.\n\nIf this is not the case, how can I do it?",
        "subreddit": "stocks",
        "title": "Selling Covered Call with &lt;100 shares",
        "url": "https://www.reddit.com/r/stocks/comments/hbtg1w/selling_covered_call_with_100_shares/",
        "created": 1592567055.0
    },
    {
        "author": "Captkirk91",
        "created_utc": 1592621476,
        "id": "hceerp",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hello. I am planning soon to transfer all of my stocks over to fidelity from webull. My main question is will I be able to see my gains / profit and losses and the total percentages from when I originally purchased my stocks and how long I have been holding them etc ? How exactly does this work ? Can anyone who has done a stock transfer answer this for me ?",
        "subreddit": "investing",
        "title": "Question about transferring my stocks to a different brokerage.",
        "url": "https://www.reddit.com/r/investing/comments/hceerp/question_about_transferring_my_stocks_to_a/",
        "created": 1592650276.0
    },
    {
        "author": "TheWings977",
        "created_utc": 1593177158,
        "id": "hg7bha",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "So I have both accounts set up through Fidelity at this point. Is there a specific way to invest with the Individual compared to the Roth? For example, should one be more ETF focused and the other more aggressive? I was with Webull at first but they don't offer fractional shares/DRIP, so now I can atleast purchase some $AMZN and $GOOG, I just don't know which account would be beneficial for me to do that. I do plan on taking some money out (not all of it) to pay off my student loans.",
        "subreddit": "stocks",
        "title": "Individual vs. Roth IRA",
        "url": "https://www.reddit.com/r/stocks/comments/hg7bha/individual_vs_roth_ira/",
        "created": 1593205958.0
    },
    {
        "author": "Kindofathrowawayidk",
        "created_utc": 1591211182,
        "id": "gw0asx",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Roth portfolio ideas with Fidelity",
        "url": "https://www.reddit.com/r/investing/comments/gw0asx/roth_portfolio_ideas_with_fidelity/",
        "created": 1591239982.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1591821683,
        "id": "h0jpu2",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Is was like any Wednesday morning. Woke up to my usual routine. Jerked it twice before market open and once after breakfast. \nMy side bitch was still fast asleep tied up against the bed. I kissed his boyfriend on the forehead and whispered gently in his ear that today is fed announcement day. \nI put on my fanciest clothing. The one that I picked up at Bloomingdales with the suede elbow pads and the silky interior. I was ready with one remote in hand and my pants was half done for the celebratory fourth go. \nI felt like time whizzed by so quickly. My ears must have been muffled, but I could have sworn I heard papa Pow say that he didn’t care about asset prices. \nNo way. I turned on my phone to gaze at the jpow brrrrr meme screen saver to reassure myself. Even put the anal beads upright and saw them fall down before my eyes. This was no dream. If it was, those beads would have floated peacefully, I disturbed. \nI came to the full realization that I had been gaped. I got violated, numb to the core. I don’t want to open fidelity account to see those calls tainted with that tampon red color. I can’t accept this. \nI’m currently sitting in my backyard, limp. Jerry, my side bitch, even called me to come in for dessert, but I wasn’t feeling it. It’s a bad day. A bad bad day.",
        "subreddit": "wallstreetbets",
        "title": "Story time",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0jpu2/story_time/",
        "created": 1591850483.0
    },
    {
        "author": "cbarr79",
        "created_utc": 1591824615,
        "id": "h0kqbx",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Talked to a fidelity advisor, wanted to get a second opinion on what was advised.",
        "url": "https://www.reddit.com/r/investing/comments/h0kqbx/talked_to_a_fidelity_advisor_wanted_to_get_a/",
        "created": 1591853415.0
    },
    {
        "author": "brian21",
        "created_utc": 1591723762,
        "id": "gzrq1b",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nI use fidelity for most of my trading and investing. However, their views of stocks don't seem to auto-update. Is there an app on my iPad I could get that I could just leave up that would live-update/refresh with current stock prices?\n\nThanks!",
        "subreddit": "stocks",
        "title": "Best iPad app for live prices?",
        "url": "https://www.reddit.com/r/stocks/comments/gzrq1b/best_ipad_app_for_live_prices/",
        "created": 1591752562.0
    },
    {
        "author": "Mrdaman2016",
        "created_utc": 1592380407,
        "id": "hamu3q",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Tried looking into it today and it seems so strange. Only one article online about it and it’s fidelity. [Gay Bear Pron](https://eresearch.fidelity.com/eresearch/evaluate/snapshot.jhtml?symbols=USBC)",
        "subreddit": "wallstreetbets",
        "title": "What the fuck is USBC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hamu3q/what_the_fuck_is_usbc/",
        "created": 1592409207.0
    },
    {
        "author": "Nateleb1234",
        "created_utc": 1591924813,
        "id": "h7b4ll",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "If my account falls below 25000 can I just keep the shares I own? I don't trade anymore I'm just holding but it's possible I could get below 25k. I want to hold on to my shares.  Will fidelity force me to sell my shares if my account goes below 25000?  Or will I be able to sell my shares just not buy?  I tried looking at the fidelity website but I could not find an answer",
        "subreddit": "stocks",
        "title": "My account is on pattern day trade status. If my account falls below 25000 can I keep my shares? I'm not using any margin. I have fidelity",
        "url": "https://www.reddit.com/r/stocks/comments/h7b4ll/my_account_is_on_pattern_day_trade_status_if_my/",
        "created": 1591953613.0
    },
    {
        "author": "Citynaut",
        "created_utc": 1591919558,
        "id": "h79mr0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Howdy everyone,   \nWhat are the risks associated with trading after hours, with Fidelity? I just called them and the rep read me a long list of the possible shortcomings of trading after hours....What's your take?",
        "subreddit": "stocks",
        "title": "Rookie Question: Trading after hours",
        "url": "https://www.reddit.com/r/stocks/comments/h79mr0/rookie_question_trading_after_hours/",
        "created": 1591948358.0
    },
    {
        "author": "nihilistictablelamp",
        "created_utc": 1591087433,
        "id": "gv3mht",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing",
        "title": "Fidelity Question - Can I still sell stock I own prior to receiving a 90 day trade restriction (I am unable to purchase securities unless I have sufficient, settled funds)?",
        "url": "https://www.reddit.com/r/investing/comments/gv3mht/fidelity_question_can_i_still_sell_stock_i_own/",
        "created": 1591116233.0
    },
    {
        "author": "fubai5407",
        "created_utc": 1592425308,
        "id": "hazb49",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Quick Fidelity Question/Unusual Activity TXN",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hazb49/quick_fidelity_questionunusual_activity_txn/",
        "created": 1592454108.0
    },
    {
        "author": "ForehandFinancial",
        "created_utc": 1591245592,
        "id": "gwad1o",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi Everyone, \n\nI am a relatively experienced investor, but I don't want to overwhelm my girlfriend with the depths and nuances of a full brokerage account (TD, Schwab, Fidelity, or Vanguard). \n\nI'm thinking of just having her go with Robinhood or Betterment. I want to explain things to her very easily and bring this up because I don't want my decade of finance experience to go in one ear and out the other. Has anybody else got their wife/girlfriend or significant other to start investing and what tactics have worked? Financial literacy and education are top priorities of mine, so this is the deal-breaker right here lol. I look forward to your responses! \n\nKind Regards,\n\nForehand Financial",
        "subreddit": "investing",
        "title": "What is the Best Way to Get Your Girlfriend to Start Investing?",
        "url": "https://www.reddit.com/r/investing/comments/gwad1o/what_is_the_best_way_to_get_your_girlfriend_to/",
        "created": 1591274392.0
    },
    {
        "author": "dbplunk",
        "created_utc": 1591454294,
        "id": "gxs4lp",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I've been with Schwabb for decades, since back when they had their own application for Windows 3.0.  Lately, Ive become somewhat disenchanted with them for a few reasons. One of them being the user friendliness of their web site.  I would consider switching to Fidelity or another low cost investment firm, but honestly, a big factor would be how easy it is to use their site.  Is this important to anyone else?  If so,  who stands out to you?",
        "subreddit": "investing",
        "title": "Most usable web site",
        "url": "https://www.reddit.com/r/investing/comments/gxs4lp/most_usable_web_site/",
        "created": 1591483094.0
    },
    {
        "author": "thelost_shadow",
        "created_utc": 1592226502,
        "id": "h9g0vi",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I'm referring to building a set of stocks at certain percentages up to 100% obviously.\n\nThen when I contribute say $100 it will distribute accordingly.\n\nI'm licensed so I can only use the approved brokers below.\n\nCharles Schwab  \nEdward Jones\nEtrade \nFidelity\nGoldman Sachs\nMerrill Lynch  \nMorgan Stanley  \nRaymond James  \nRBC Wealth Management  \nTD Ameritrade  \nVanguard  \nWells Fargo",
        "subreddit": "investing",
        "title": "Which brokerage company can I build my own \"mutual fund\"?",
        "url": "https://www.reddit.com/r/investing/comments/h9g0vi/which_brokerage_company_can_i_build_my_own_mutual/",
        "created": 1592255302.0
    },
    {
        "author": "WATCHMAKERUSA",
        "created_utc": 1592236967,
        "id": "h9j4gk",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I am currently investing all of my 401k contribution + employer match into a mutual fund that tracks the S&amp;P 500 bi-weekly. I stopped investing a small percentage into bonds.   \n\n\nFor my ROTH, I'm wondering if I should invest right now or wait for a drop that people think will be coming? I use FSKAX in my ROTH because I use Fidelity.",
        "subreddit": "stocks",
        "title": "Invest into Total Market mutual fund now or wait?",
        "url": "https://www.reddit.com/r/stocks/comments/h9j4gk/invest_into_total_market_mutual_fund_now_or_wait/",
        "created": 1592265767.0
    },
    {
        "author": "knuckles19",
        "created_utc": 1593304051,
        "id": "hh4y5g",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "So I have a Fidelity Blue Chip Growth. Let's say the market tanks this week like it began to on Friday.\n\nShould I sell it now and buy back in when it's lower? Or should I just hang on. It averages about 17% annu8ally.",
        "subreddit": "stocks",
        "title": "Mutual Fund Q",
        "url": "https://www.reddit.com/r/stocks/comments/hh4y5g/mutual_fund_q/",
        "created": 1593332851.0
    },
    {
        "author": "blek355",
        "created_utc": 1593451192,
        "id": "hi43hg",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I want to start trading general stocks (like apple, microsoft, tesla...) but I can't find any good platform. Most platforms don't allow trading from my country, and the ones that do have high fees. It is also important that platform has a good API so I can algo trade. I tried registering at TD Ameritrade, Fidelity and Tasty works (best online brokers according to Investopedia, they don't support trading from Croatia). Can you tell me are there any platforms that meet my criteria?",
        "subreddit": "stocks",
        "title": "What are good stock trading platforms for Europe(Croatia)?",
        "url": "https://www.reddit.com/r/stocks/comments/hi43hg/what_are_good_stock_trading_platforms_for/",
        "created": 1593479992.0
    },
    {
        "author": "wubbziee",
        "created_utc": 1592236087,
        "id": "h9iuyr",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "For starters, I have been primarily RH from portfolio value $2,000 up to Portfolio value of $20,000.\nHowever, I feel that I am blocking myself from a lot of good AH and PM profits.\n\nI am either a) losing money due to inability to sell or b) not making what I could be making due to inability to purchase.\n\nI have tried out Fidelity. I do not like it. RH triumphs over it, in terms of buy/sell speed. A few button presses, and 10-second window to buy/sell. Fidelity does not feel smooth and fast to me. \n\nI do HIGHLY prefer a phone app broker, as well as the ability to utilize a desktop app. I am about 50/50 phone and PC so would like to use both. \n\nFrom those who are actively daytrading the highs/lows, which broker seems to work best for you? \n\n*I am not looking to hear from those who “Hold Hold Hold” as this doesn’t apply to me 90% of the time. Also not looking to hear from anyone with a $200 portfolio. (No offense)",
        "subreddit": "pennystocks",
        "title": "Daytrading platform.",
        "url": "https://www.reddit.com/r/pennystocks/comments/h9iuyr/daytrading_platform/",
        "created": 1592264887.0
    },
    {
        "author": "boredguy01234",
        "created_utc": 1592855601,
        "id": "hdzh34",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Sorry I feel like this should if been asked before but I wanted to check. If I sell an option on a stock that is in my IRA it collects a premium. The cash generated from that, is that required to stay in the IRA?\n\nI have fidelity currently and it is in just a general cash holding that looks as though I could use that cash to purchase stock in my individual account with them or my IRA account. Just trying not to get myself taxes to bad \n\nThanks in advance",
        "subreddit": "investing",
        "title": "IRA options",
        "url": "https://www.reddit.com/r/investing/comments/hdzh34/ira_options/",
        "created": 1592884401.0
    },
    {
        "author": "sheesh-lxfty",
        "created_utc": 1592489463,
        "id": "hbfbcz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I can’t seem to navigate my way to investing in any precious metals on either fidelity or RH besides ETFs. Fidelity claims on their website that you can purchase Bullion bars or coins with a regular brokerage account. Anyone know something i dont?",
        "subreddit": "stocks",
        "title": "Precious metals?",
        "url": "https://www.reddit.com/r/stocks/comments/hbfbcz/precious_metals/",
        "created": 1592518263.0
    },
    {
        "author": "throwaway474673637",
        "created_utc": 1593203221,
        "id": "hgfbpi",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "For most retail investors, leverage is extremely expensive.\n\nVanguard, Fidelity, E-Trade and Schwab all charge 5-7%, even on large accounts.\n\nInteractive Brokers seems to be the cheapest option for most with rates as low 0.75-1%.\n\nI was curious and decided to check how much some banks with large prime brokerages charge their PMW clients and was quite surprised.\n\nFor example, UBS charges nearly 3% at 1,000,000$ and about 2% over 10,000,000 as seen here. \n\n(https://onlineservices.ubs.com/staticfiles/pws/adobe/Lending_Circular.pdf)\n\nMorgan Stanley charged nearly 6% at 1,000,000 and over 3% at even 50,000,000.\n\n(https://www.morganstanley.com/wealth-disclosures/pdf/Margin_Interest_Rate.pdf)\n\nIf the rates charged to their normal clients are so high, at least compared to IB, how much are these banks charging their hedge fund clients?",
        "subreddit": "investing",
        "title": "Margin rates at prime brokerages - where do they currently stand?",
        "url": "https://www.reddit.com/r/investing/comments/hgfbpi/margin_rates_at_prime_brokerages_where_do_they/",
        "created": 1593232021.0
    },
    {
        "author": "ProZedd34",
        "created_utc": 1591306209,
        "id": "gwqpf9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Is there a way to  partially sell my position with an active Stop Limit order?  It appears I have to cancel the Stop Limit, do my partial sell to take profits, then enter a new Stop Limit.  It's not that big of a pain, but I'm curious if there is a way to do this without cancelling.  I use both Fidelity and ToS",
        "subreddit": "investing",
        "title": "Taking profits with active Stop Limit",
        "url": "https://www.reddit.com/r/investing/comments/gwqpf9/taking_profits_with_active_stop_limit/",
        "created": 1591335009.0
    },
    {
        "author": "YoungBumi",
        "created_utc": 1591342525,
        "id": "gx01yl",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi all, \n\nAs I’m trying to *learn about value investing, this formula was brought up in one of the many **vids I’ve been watching:\n\nEstimated future stock price in 10 years = EPS x (1 + growth rate)^10 x PE\n\nBut I’m bothered by the inclusion of PE in this calculation because I feel like P is too subjective and based on consumer demand and perception rather than on a concrete data point like earnings. \n\nMy questions are:\n  1) Am I wrong to view this formula as somehow flawed?\n  2) Would this formula provide a somewhat decent starting point for ***price discovery? If not, could someone suggest a better launch point?\n  3) I know that I’m trying to find an launch point in a years long process of learning, but am I at least on the right track or is there a more appropriate approach?\n\n\n*I’m at the very beginning stage of learning about value investing now that my primary career is beginning to settle. I’m currently absorbing as much as I can in order to gain a basic understanding, and one of my current goals is to come up with a simple “starting formula” to evaluate stock prices so I can begin. I understand that there highly likely is no single formula for evaluation, that I’ll need to factor subjective inputs like preferred margin of safety or return % which change things, and many other things. But I want to start somewhere and want to start making informed decisions in my investments. I’ll be opening my first investment account, a Roth IRA through Fidelity, very soon. My background is in education and reading/writing, not finance, so maths is often a little challenging, and it often takes me a while to understand and ingrain concepts and usually requires much repetition.\n\n**I’ve been watching the Buffet’s Books lessons on Preston Push’s channel. I’ve seen all three units twice but am still reviewing them to better understand things. I’ve also ordered The Intelligent Investor and Security Analysis by Benjamin Graham, and plan on reading these texts once I’m done: The interpretation of financial statements by Benjamin Graham, Common Stocks and Uncommon Profits by Phil Fisher, and Irrational Exhuberance (2nd Ed., 2005) by Robert Shiller. These choices are based on what I’ve been reading so far (mostly Investopedia articles to get an understanding of basic terms and concepts). \n\n***is price discovery the right term? I think it is but please feel free to correct me. \n\nPlease feel free to comment, criticize, or dm. I’m seeking a community to learn from and I don’t care about how offensive or harsh you may be, only truth. Also, apologies for the length of my post. Brevity is something I’m working on.",
        "subreddit": "ValueInvesting",
        "title": "Question on estimated stock price formula. Also, hello to all.",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/gx01yl/question_on_estimated_stock_price_formula_also/",
        "created": 1591371325.0
    },
    {
        "author": "wild_turkey8",
        "created_utc": 1592347760,
        "id": "haeqaw",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi All,\n\nWith the market being so volatile, as the title says, I was wondering what is everyone’s day trading technique.  I’ve been a long holder of stocks and see opportunities to make money during the day.\n\nAs a day trader, what’s the safest and reserved method to make a few extra bucks?  I have fidelity active trader pro and have been getting familiar with candlestick charts, but no active day trading.  I’ve heard of the “scalping” technique, but don’t know where to begin finding stocks to trade.  Also heard the first 90 minutes after open is the best time.\n\nAny advice?  Thank you in advance.",
        "subreddit": "stocks",
        "title": "Day trading advice",
        "url": "https://www.reddit.com/r/stocks/comments/haeqaw/day_trading_advice/",
        "created": 1592376560.0
    }
]