[
    {
        "author": "looseboxers",
        "created_utc": 1591569983,
        "id": "gymi7o",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I am posting my portfolio and strategies here to gain insight and hopefully learn from those that are much smarter than I am. Please be critical and constructive! \n\nI have decided to split my cash into two portfolios: core holdings and secondary portfolio which has a worth of 50% of my core holdings portfolio (150% total).\n\nThese are my targets for my core holdings portfolio:\n\n|Canadian Utilities (CU)|10.53%|\n|:-|:-|\n|Enbridge (ENB)|10.53%|\n|TD Bank (TD)|13.16%|\n|Canada West Bank (CWB)|13.16%|\n|Northwest Healthcare Properties REIT (NWH)|10.53%|\n|Riocan (REI)|21.05%|\n|Telus (T)|10.53%|\n\n&amp;#x200B;\n\n* The reason I am drawn to these companies:\n   * I wanted to set up a dividend portfolio in my TFSA and reinvest dividends via DRIPs. These companies had high yields back in March when the pandemic hit and I saw an opportunity to lock in high yields with big, relatively safe Canadian companies that are an integral part of our economy. \n   * Other companies that I considered and may go back to:\n      * Financials: CIX, because it dropped harder than the banks and looking at the charts, I am expecting a breakout soon. I also considered all the other 5 big banks but went with TD due to their exposure to the US market. \n      * REITs: BPY, HR-UN. I am desperate to save enough money to open a DRIP with HR REIT. I believe they are undervalued according to their balance sheets and I did pick up a few shares at $8.20 and wish I had more cash to pour into it at that time. \n      * Communications: RCI, BCE, but decided on Telus due to their EMR market share. Also having first hand experience - their EMR is extremely user friendly and maintenance and administration is cheaper and easier than OSCAR based systems. This is especially true for rural communities with an aging population since all those patients still carry flip phones and most just rely on their landline. Using Facetime or smartphone based tech makes them uncomfortable. Seeing the system in action during this lockdown, especially how well it works with a work from home model has increased my liking for the company since everything is integrated into the EMR. The main problem with OSCAR systems is that not all hospitals are compatible with it and syncing medical records across two different systems is a pain. Telus has made their system compatible with a lot of rural hospitals and thus been able to connect the doctors offices with their local hospitals. \n      * I also considered Northwest Company, and in the future, when I have enough saved for a DRIP, I will be adding that to my TFSA also. The reasoning behind this is they have captured a niche market and are serving underserved areas and developing reliance on their product. The strength of this company is reflected in its' aggressive V-shaped recovery during the pandemic. \n      * I may also swap out ENB for AltaGas, but for now I am comfortable holding ENB at least for a year or so to see how it reacts to the market while I collect dividends. Though, eventually I'd like to transition out of oil and into renewable energy or possibly hold both at the same time depending on my cash at hand. \n* Currently I am DCA-ing my way into the positions of my core holdings. I have currently invested 50% of my total core holdings budget and have a remaining 50% currently sitting as cash, waiting to be deployed. I know everyone says you can't time the market and that's the reason I have decided to DCA - however, I feel like the current rally in markets is premature and a correction is on the horizon which is why I have paused my DCA contributions for now. I want to spread the money out for a longer period of time, possibly past September and into November and possibly even into December. \n* This is where I have my first question - am I just being overly speculative and cautious? Should I just blindly buy stocks systematically every two weeks or is my strategy to pause contributions viable? I found that I ended up DCA-ing upwards as the markets have rallied and missed out on opportunities which I wouldn't have missed out on if I had invested as a lump sum in March. \n* My secondary portfolio is a bit less organized. I have used this portfolio to buy and hold for a few days and then take profits. So basically swing trading, but I wish I had more cash so I could have held on to some of these for longer and bought them earlier. Here are a few trades that I made in the past:\n   * ATE.V: I've been holding this since early April. Currently sitting on about 500 shares. I believe in the product but boy, has management really been bad with communicating with their share holders. Its a long term play, and management has a decent strategy going forward and I will continue to hold unless the company shows signs of completely tanking. \n   * QSR: Bought and sold, made a few bucks in profit in early march. Never intended to hold this long term but I may reevaluate that in the future. Long term I would have to decide between this or A &amp; W income fund.\n   * ATZ: made a tidy profit off Aritizia too, looking to re enter possibly next quarter.\n   * ROOT: Same as ATZ. No intention of reentry. \n   * CGX: bought when it was around $12 and sold when it hit $14. No intention of reentry.\n   * MIR.V: made a 50% (FIFTY!) profit but only had about $50 to put in initially. Cashed out at $80. I want to re enter with about $1K on this.\n   * HR-UN: Yeah, I swing (swung?) traded a REIT. Bought at $8.20 and sold at $10.20 Would have liked to hold it longer but wanted to free up cash. Looking to re enter next quarter. \n   * BMO: So basically I had about $1K sitting in cash and BMO was lagging the other banks as the sector was recovering so I bought as much as I could. Now I feel trapped since I got a great deal at around $61 and am considering moving this to my core holdings, but I already have enough financial sector exposure in my core portfolio. I am up around 20% and feel like if I hold I can make more profit. I am also, at the same time, very tempted to liquidate and carry the funds forward into my future investments which I will highlight below. Any thoughts on strategy regarding this would be appreciated. \n* Future investments in my secondary portfolio:\n   * Currently I'm working on a strategy to invest with my secondary portfolio. Basically I just need to decide cut down this list to about 4-6 companies and decide on entry points:\n      * [WELL](https://WELL.TO)\n      * ATZ\n      * GOOS\n      * BB\n      * FLT\n      * LSPD\n      * CSH-UN\n      * HR-UN\n      * MIR.V\n      * I am also looking at the following but would need to research more and drop some other tickers to pick these up: SVI, PLC, TFII\n   * Basically, I am looking for value and growth in these companies and looking to enter with about $1k for each. Personally I am very drawn towards WELL, ATZ, GOOS, MIR, LSPD and CSH-UN\n* Another question I had was if I am swing trading, should I not do that in my TFSA? I can liquidate a few positions and put them into a taxable account just for swing trading. I would leave my secondary portfolio in my TFSA as a growth only portfolio and separate some funds solely for swing trading (basically play money). \n* Am I better off just converting my cash to USD and investing in TSLA, BRK.B, and Apple, AMD, etc?\n* The reason I am waiting for next quarter to re enter is because I fully believe there will be a market correction and a possible second downturn due to requirements for emergency subsidies being tightened up. The government can only sustain this for so long. Secondly, I don't think losses will be fully realized until next quarter. Thirdly, there is a possibility for a credit crisis and the big banks are fully expecting this which is why they increased their loss provisions according to the latest financial reports. \n\n&amp;#x200B;\n\nAnd now the age old question - \"Why not just buy a couple of ETfs and forget about it?\"\n\nI strongly considered XDV, XDIV, XEI as the majority investments in my core holdings along with a few exposure ETF's like TEC, VHT, some international exposure and small cap value ETFs.   \n\n\nWhy did I decide against it? I feel like ETFs offer less value when it comes to value investing. Sure, they dropped in price when the markets went down but I still feel like the rebound is dampened (as are the drops) which is to be expected because the risk is also lower. However, if I invest $1K into WELL for example, I will receive 100% of the value when it pops up, whereas if I purchase a small cap health/tech ETF which includes WELL,  the ETF would probably return much less value to me, not to mention that during re-balancing, the fund manager could classify WELL to be a large cap company and balance the company out of the ETF since it doesn't meet the requirements anymore and I would have to live with that decision, or go out and buy it but at that point I'd have missed out on most of the growth. \n\nSecondly, I found that most ETFs that hold Canadian banks have a lower dividend yield than if I had just held the banks directly. Granted, it wouldn't be at the same weight and I would probably only hold one or two banks instead of all 5 via an ETF but I don't really care for holding all 5 and especially so if the dividend yield is higher. \n\n&amp;#x200B;\n\nBefore I started investing, I paper traded for years just out of curiosity and I was always interested in stock prices. I did a lot of research and learning before starting to invest and felt like I knew what I was doing. Now I feel like I have no idea what I am doing (lol). My goal for the next year or so is to try and fully understand options trading in order to make weekly income, paper trade and develop a strategy and by next March start options trading. Currently learning about the wheel strategy and am really excited about trying it out. \n\nI also want to gain US market exposure, namely in the tech sector. I feel like a lot of growth is to be had there.\n\nPlease let me know what you think! I need to know where I stand with my investment strategy. Constructive criticism is most welcome!",
        "subreddit": "CanadianInvestor",
        "title": "Detailed breakdown of my portfolio and investment strategy. I want to generate discussion and hopefully learn from said discussion. Please be critical and constructive!",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/gymi7o/detailed_breakdown_of_my_portfolio_and_investment/",
        "created": 1591598783.0
    },
    {
        "author": "mat_raymond",
        "created_utc": 1591062650,
        "id": "guy3g9",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I know this is small stock on the TSX venture exchange which can be susceptible to pump in dump scams (which is against the rules), but my total position is only 640 shares purchased at $0.78. But mods delete if not allowed\n\nDisclaimer 2: Usual “this is not financial advice” disclaimer. I also have a long position in this security.\n\n*All numbers are in Canadian Dollars*\n\nDrone Delivery Canada (DDC) provides a drone delivery platform targeted towards various corporations including retailers, service organizations and government agencies. They have a patented hardware/software platform. DDC has been developing its drone delivery technology since 2014.\n\nThey are currently trading on the TSX.V Exchange under the symbol FLT, on the U.S. OTC Q B market with Nasdaq International Designation under the symbol TAKOF.\n\n&amp;#x200B;\n\nBasic Stats:\n\nPrice (as of creating post): 0.84\n\nMarket Cap: 148.79M\n\nEPS: -0.09\n\nNet Income: -15.6M\n\nShares Outstanding: 177.34M\n\n&amp;#x200B;\n\nObviously, this company is not making money, in 2019 they had a cash burn rate of $16M but they have extremely low debt and cash worth $14M, giving them a cash runway of approx. 10 months from September 2019. Analysts predict DDC will reach cashflow breakeven in 2 years.\n\n0.3% is held by private companies, 7.1% by individual insiders, 15.4% by institutions and 77.2% the general public.\n\nSource: [https://simplywall.st/news/is-drone-delivery-canada-cveflt-in-a-good-position-to-deliver-on-growth-plans/](https://simplywall.st/news/is-drone-delivery-canada-cveflt-in-a-good-position-to-deliver-on-growth-plans/)\n\n&amp;#x200B;\n\nLeadership:\n\nThe CEO Michael Zahra has been the President of Staples Business Advantage (B2B supplies), the president of Yahoo, and has been on the board of directors for Oak Ridges Moraine Land Trust and on the board of governors for North York General Hospital. So, while this is a start-up they have a veteran leader. They have a strong lineup of C-Suite executives with experienced CFO and CTO.  On top of this their board of advisors include the VP of Cargo at Air Canada, and a medical director for Sunnybrook Centre for Prehospital Medicine which is an important strategic piece. The downside of their leadership is they have very high salaries for a company not making any profit. But when looking at insider transactions they have been buying more shares than they have sold.\n\n&amp;#x200B;\n\nAs a venture company that is not profitable it is a risky investment but there are many upsides to investing in this new technology.\n\nI’m currently looking at 5 factors that have swayed me to open a bullish position\n\n1. Its current partnership with DSV\n2. Its partnership with Edmonton Airport\n3. Its 2 U.S. Patents\n4. Potential for medical response\n5. Move to TSX\n\n&amp;#x200B;\n\nPartnership with DSV:\n\nDDC entered in an agreement with DSV through its sales agent Air Canada that provides its drone delivery platform back in October 2019. The program became operational in March which was big for DDC as it is their first source of revenue. In which customers pay DDC a monthly fee for each drone route deployed. DSV provides and manages supply chain solutions for thousands of corporations. Which is a perfect partner for DDC. The initial agreement is for 15 months, with additional 1-year terms following the success of the first agreement. There is also a potential for over 20 routes to be implemented throughout 2020.\n\nSource: [http://www.newswire.ca/en/releases/archive/March2020/04/c8118.html](http://www.newswire.ca/en/releases/archive/March2020/04/c8118.html)\n\n&amp;#x200B;\n\nPartnership with Edmonton Airport:\n\nThis partnership creates the world’s first airport drone delivery hub at Edmonton Airport using DDC’s platform. DDC and Edmonton airport will implement promote and market DDC’s delivery services. The agreement is for 5 years initially with the possibility of an extension unless the agreement is terminated\n\nSource: [https://edmontonjournal.com/business/commercial-real-estate/edmonton-airport-becomes-canadas-first-drone-delivery-site](https://edmontonjournal.com/business/commercial-real-estate/edmonton-airport-becomes-canadas-first-drone-delivery-site)\n\n&amp;#x200B;\n\nPatents:\n\nDDC currently holds two US patents, one for its “FLYTE management” and one that covers aspects of its drone delivery technology and processes relating to controlled access zones for UAV landing and takeoff\n\nSource 1: [https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-first-114500552.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-first-114500552.html)\n\nSource 2: [https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-second-200500715.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-second-200500715.html)\n\n&amp;#x200B;\n\nMedical Response:\n\nIn 2019 researchers tested the speed of drones vs the speed of ambulances to respond to a 911 call. The drone carried an AED to the location which was approx. 8km away. The drone was allowed to fly at speeds of 80km/hr and arrived at the scene an average of three to four minutes before the ambulance. Those few minutes could make a life or death difference in a cardiac arrest patient’s outcome. This is why having the medical director for Sunnybrook Centre for Prehospital Medicine on the board of advisors could be a key to implementing their services to the medical field in the future. DDC has also reached out to the healthcare industry and governments for use case applications for drone delivery relating to COVID-19.\n\nSource 1: [https://www.ctvnews.ca/health/drone-defibrillator-delivery-researchers-say-it-may-be-faster-than-ambulances-1.4462022](https://www.ctvnews.ca/health/drone-defibrillator-delivery-researchers-say-it-may-be-faster-than-ambulances-1.4462022)\n\nSource 2: [https://ca.finance.yahoo.com/news/drone-delivery-canada-reaches-healthcare-190200559.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-reaches-healthcare-190200559.html)\n\n&amp;#x200B;\n\nPotential to move to TSX:\n\nMoving up from the venture exchange to the TSX can pose many benefits. A big one that we care about is increase in share price. “An observation of 34 companies that graduated between October 14, 2005 and August 10, 2006, found that almost sixty per cent of the companies had an average share price over the thirty trading days post-graduation that was higher than the thirty trading days preceding graduation. On average, the share price of all 34 issuers went up over three per cent in that time frame, with four companies showing an increase of over 25 per cent”.\n\nSource: [https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx](https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx)\n\n&amp;#x200B;\n\nThis is my first DD on reddit so I would love any feedback and would love to discuss your thoughts on this company. (Also still trying to learn formatting on reddit)\n\n&amp;#x200B;\n\n**tldr; Investing in DDC is an extremely risky bet but as they are innovating the delivery industry, we can see potential for very high growth in the future. Some of the points leading me to believe in DDC’s potential is their partnership with DSV, their partnership with Edmonton Airport, and their experienced leadership.**",
        "subreddit": "stocks",
        "title": "Drone Delivery Canada – FLT.V (DD)",
        "url": "https://www.reddit.com/r/stocks/comments/guy3g9/drone_delivery_canada_fltv_dd/",
        "created": 1591091450.0
    },
    {
        "author": "elvenrunelord",
        "created_utc": 1591484220,
        "id": "gy0twi",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Last time I bought T at this price I made a healthy sum over the following year. Perhaps I should have bout at $28 but the cash flt so good while covid-19-sars was running with the Demon.\n\n&amp;#x200B;\n\nNow...\n\n&amp;#x200B;\n\nScratch scratch scratch...This cash is getting all itchy as shit sitting in my pocket...",
        "subreddit": "stocks",
        "title": "I'm getting that itch again on T",
        "url": "https://www.reddit.com/r/stocks/comments/gy0twi/im_getting_that_itch_again_on_t/",
        "created": 1591513020.0
    },
    {
        "author": "DontDoTheDo",
        "created_utc": 1591444175,
        "id": "gxpknk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Anyone invested in FLT? Since Aussie and NZ air travel seems to be opening soon, do you think Flight Centre is in a unique position to rise sooner than other airline related stocks?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gxpknk/anyone_invested_in_flt_since_aussie_and_nz_air/",
        "created": 1591472975.0
    },
    {
        "author": "DontDoTheDo",
        "created_utc": 1591444063,
        "id": "gxpjsg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Anyone invested in FLT?",
        "url": "https://www.reddit.com/r/StockMarket/comments/gxpjsg/anyone_invested_in_flt/",
        "created": 1591472863.0
    },
    {
        "author": "mat_raymond",
        "created_utc": 1591062650,
        "id": "guy3g9",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I know this is small stock on the TSX venture exchange which can be susceptible to pump in dump scams (which is against the rules), but my total position is only 640 shares purchased at $0.78. But mods delete if not allowed\n\nDisclaimer 2: Usual “this is not financial advice” disclaimer. I also have a long position in this security.\n\n*All numbers are in Canadian Dollars*\n\nDrone Delivery Canada (DDC) provides a drone delivery platform targeted towards various corporations including retailers, service organizations and government agencies. They have a patented hardware/software platform. DDC has been developing its drone delivery technology since 2014.\n\nThey are currently trading on the TSX.V Exchange under the symbol FLT, on the U.S. OTC Q B market with Nasdaq International Designation under the symbol TAKOF.\n\n&amp;#x200B;\n\nBasic Stats:\n\nPrice (as of creating post): 0.84\n\nMarket Cap: 148.79M\n\nEPS: -0.09\n\nNet Income: -15.6M\n\nShares Outstanding: 177.34M\n\n&amp;#x200B;\n\nObviously, this company is not making money, in 2019 they had a cash burn rate of $16M but they have extremely low debt and cash worth $14M, giving them a cash runway of approx. 10 months from September 2019. Analysts predict DDC will reach cashflow breakeven in 2 years.\n\n0.3% is held by private companies, 7.1% by individual insiders, 15.4% by institutions and 77.2% the general public.\n\nSource: [https://simplywall.st/news/is-drone-delivery-canada-cveflt-in-a-good-position-to-deliver-on-growth-plans/](https://simplywall.st/news/is-drone-delivery-canada-cveflt-in-a-good-position-to-deliver-on-growth-plans/)\n\n&amp;#x200B;\n\nLeadership:\n\nThe CEO Michael Zahra has been the President of Staples Business Advantage (B2B supplies), the president of Yahoo, and has been on the board of directors for Oak Ridges Moraine Land Trust and on the board of governors for North York General Hospital. So, while this is a start-up they have a veteran leader. They have a strong lineup of C-Suite executives with experienced CFO and CTO.  On top of this their board of advisors include the VP of Cargo at Air Canada, and a medical director for Sunnybrook Centre for Prehospital Medicine which is an important strategic piece. The downside of their leadership is they have very high salaries for a company not making any profit. But when looking at insider transactions they have been buying more shares than they have sold.\n\n&amp;#x200B;\n\nAs a venture company that is not profitable it is a risky investment but there are many upsides to investing in this new technology.\n\nI’m currently looking at 5 factors that have swayed me to open a bullish position\n\n1. Its current partnership with DSV\n2. Its partnership with Edmonton Airport\n3. Its 2 U.S. Patents\n4. Potential for medical response\n5. Move to TSX\n\n&amp;#x200B;\n\nPartnership with DSV:\n\nDDC entered in an agreement with DSV through its sales agent Air Canada that provides its drone delivery platform back in October 2019. The program became operational in March which was big for DDC as it is their first source of revenue. In which customers pay DDC a monthly fee for each drone route deployed. DSV provides and manages supply chain solutions for thousands of corporations. Which is a perfect partner for DDC. The initial agreement is for 15 months, with additional 1-year terms following the success of the first agreement. There is also a potential for over 20 routes to be implemented throughout 2020.\n\nSource: [http://www.newswire.ca/en/releases/archive/March2020/04/c8118.html](http://www.newswire.ca/en/releases/archive/March2020/04/c8118.html)\n\n&amp;#x200B;\n\nPartnership with Edmonton Airport:\n\nThis partnership creates the world’s first airport drone delivery hub at Edmonton Airport using DDC’s platform. DDC and Edmonton airport will implement promote and market DDC’s delivery services. The agreement is for 5 years initially with the possibility of an extension unless the agreement is terminated\n\nSource: [https://edmontonjournal.com/business/commercial-real-estate/edmonton-airport-becomes-canadas-first-drone-delivery-site](https://edmontonjournal.com/business/commercial-real-estate/edmonton-airport-becomes-canadas-first-drone-delivery-site)\n\n&amp;#x200B;\n\nPatents:\n\nDDC currently holds two US patents, one for its “FLYTE management” and one that covers aspects of its drone delivery technology and processes relating to controlled access zones for UAV landing and takeoff\n\nSource 1: [https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-first-114500552.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-first-114500552.html)\n\nSource 2: [https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-second-200500715.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-second-200500715.html)\n\n&amp;#x200B;\n\nMedical Response:\n\nIn 2019 researchers tested the speed of drones vs the speed of ambulances to respond to a 911 call. The drone carried an AED to the location which was approx. 8km away. The drone was allowed to fly at speeds of 80km/hr and arrived at the scene an average of three to four minutes before the ambulance. Those few minutes could make a life or death difference in a cardiac arrest patient’s outcome. This is why having the medical director for Sunnybrook Centre for Prehospital Medicine on the board of advisors could be a key to implementing their services to the medical field in the future. DDC has also reached out to the healthcare industry and governments for use case applications for drone delivery relating to COVID-19.\n\nSource 1: [https://www.ctvnews.ca/health/drone-defibrillator-delivery-researchers-say-it-may-be-faster-than-ambulances-1.4462022](https://www.ctvnews.ca/health/drone-defibrillator-delivery-researchers-say-it-may-be-faster-than-ambulances-1.4462022)\n\nSource 2: [https://ca.finance.yahoo.com/news/drone-delivery-canada-reaches-healthcare-190200559.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-reaches-healthcare-190200559.html)\n\n&amp;#x200B;\n\nPotential to move to TSX:\n\nMoving up from the venture exchange to the TSX can pose many benefits. A big one that we care about is increase in share price. “An observation of 34 companies that graduated between October 14, 2005 and August 10, 2006, found that almost sixty per cent of the companies had an average share price over the thirty trading days post-graduation that was higher than the thirty trading days preceding graduation. On average, the share price of all 34 issuers went up over three per cent in that time frame, with four companies showing an increase of over 25 per cent”.\n\nSource: [https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx](https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx)\n\n&amp;#x200B;\n\nThis is my first DD on reddit so I would love any feedback and would love to discuss your thoughts on this company. (Also still trying to learn formatting on reddit)\n\n&amp;#x200B;\n\n**tldr; Investing in DDC is an extremely risky bet but as they are innovating the delivery industry, we can see potential for very high growth in the future. Some of the points leading me to believe in DDC’s potential is their partnership with DSV, their partnership with Edmonton Airport, and their experienced leadership.**",
        "subreddit": "stocks",
        "title": "Drone Delivery Canada – FLT.V (DD)",
        "url": "https://www.reddit.com/r/stocks/comments/guy3g9/drone_delivery_canada_fltv_dd/",
        "created": 1591091450.0
    }
]