[
    {
        "author": "pacosteles",
        "created_utc": 1578325244,
        "id": "ekvqb6",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "This time last year, Slack Technologies, the popular workplace chat provider, was one of the most eagerly anticipated public tech debuts of 2019. That seems like a long time ago. Since Slack went public in June, its stock has dropped about 40%.\n\n\nThe reason for the slump: Revenue growth at Slack is slowing and competition is intensifying, especially from Microsoft. The tech giant is relying on a familiar tactic—bundling a Slack killer with a widely used existing product, its Office 365 suite of apps. Given that competitive pressure, I predict 2020 will be the year that—after years of acquisition speculation—a larger tech company will finally buy Slack.\n\n\nPotential suitors could include Amazon—which has reportedly eyed Slack in the past—and Google. Both companies are top providers of cloud computing services and could plug Slack into their cloud units to increase the revenue they generate from online applications. \n\n\nAlready a big Amazon cloud customer, Slack has committed to spending a minimum of $250 million with the Amazon Web Services division between 2018 and 2023, according to regulatory filings. Becoming part of Amazon could help Slack—which is currently unprofitable—trim some costs.    \n\n\nCisco Systems and Salesforce, both of which could use a spark to fire up their collaboration software businesses, might also make sense as acquirers. Both companies have relationships with corporate chief information officers that could open the door to customers in the Fortune 500. \n\n\nA Slack purchase would be a sizable deal. Slack has a market capitalization of just over $12 billion, although its management would likely push for a higher price. One benchmark they might point to: A few weeks before it went public, Slack was valued in private market trades at about $19 billion. At that price, Slack would be the largest acquisition ever for the likes of Amazon, Google, Cisco, and Salesforce.  \n\n\nOne company that likely won’t buy Slack is the company that would arguably be most responsible for its sale: Microsoft. Owning Slack, along with its in-house Slack competitor, Teams, would give Microsoft a dominant position in workplace collaboration software. Microsoft reportedly considered offering an $8 billion bid for Slack in 2016 before deciding to funnel more investment into building out Teams. \n\n\nBut I’m skeptical that Microsoft could pull off such a deal. Gaining regulatory approval would be an ordeal, if not impossible, because Microsoft already offers a directly competitive product. Microsoft went through the antitrust wringer two decades ago and is happy to avoid joining other big tech companies in the regulatory spotlight now. \n\n\nSpokespeople from AWS and Salesforce declined to comment. A Microsoft spokesperson didn’t have a comment. Spokespeople from Cisco and Google didn’t respond to requests for comment. \n\n\nIf Slack CEO and co-founder Stewart Butterfield doesn’t want to sell, he will have to find a way to win back investor confidence. Clearly what is worrying Wall Street is Slack’s slowing revenue growth and increasing losses. \n\n\nThe company’s annual sales grew 110% in fiscal 2018, which ended last Jan. 31, from the prior year. In fiscal 2019, that figure fell to 82%. In its most recent earnings report, Slack forecast that revenue growth for fiscal 2020 will fall even further to around 55%. Meanwhile, its net loss rose to about $88 million in the third quarter, from nearly $48 million a year earlier.\n\n\nSlack has spread like wildfire as a business tool largely through a free version of its product. To continue to grow, it must find ways to convince these users to become paying ones. During its recent earnings call, for the quarter ended Oct. 31, the company said it had 105,000 paying customers, up 30% from the same period a year earlier. \n\n\nIn an interview, Daniel Newman, founder and principal analyst at Futurum Research, said Slack’s early growth was partly due to developers’ frustration with the limitations of older products like Microsoft’s Skype and Cisco’s Webex. Now, with Microsoft pouring money into Teams and making improvements to the product to entice large companies, Slack has to work much harder to attract customers, he said. And a host of younger companies, such as Zoom and Asana, and open source startups, including Mattermost and Rocket.Chat, also offer workplace collaboration tools. \n\n\n“There is a lot of competition in the collaboration space right now,” Newman said. \n\n\nThe growing competition highlights another issue for Slack. Having captured a loyal following of developers and technical users through word of mouth, it is now spending heavily on sales and marketing to show how its software can help companies be more productive. During the third quarter, its sales and marketing expenses jumped 42% to over $96 million. \n\n\nMicrosoft appears to have gotten into Butterfield’s head. This first became apparent in 2016 when Slack took out a full-page ad in The New York Times to “welcome” Microsoft to the market around the time it introduced Teams. More recently, Butterfield has sounded a defensive note on earnings calls, pointing out that Slack has to earn every customer and can’t rely on bundling its product with other business applications, as Microsoft does. \n\n\nHe often pushes back on Microsoft’s framing of its daily active user numbers for Teams, claiming that the company muddies the waters by counting people who make voice calls using Skype. Slack’s usage figures more accurately reflect the deep level of engagement its users have with the service, according to Butterfield. “The confusion is deliberately created,” Butterfield said on Slack’s recent fiscal third quarter earnings call with investors. \n\n\nWhatever the reason, Butterfield faces a choice: Keep fighting or surrender by selling.",
        "subreddit": "wallstreetbets",
        "title": "Why Slack Will be Acquired",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ekvqb6/why_slack_will_be_acquired/",
        "created": 1578354044.0
    },
    {
        "author": "yolo_sense",
        "created_utc": 1578372409,
        "id": "el6i4k",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": "Exhibit 1: MCD [https://www.tradingview.com/x/afwrNofN/](https://www.tradingview.com/x/afwrNofN/)  (I did not play this, sadly)\n\nExhibit 2: TEAM [https://www.tradingview.com/x/21KwT7Y7/](https://www.tradingview.com/x/21KwT7Y7/)   (I saw this forming and bought calls on Friday 1/3 and closed today for nice profits.)\n\nExhibit 3: CRWD [https://www.tradingview.com/x/HYaZlzif/](https://www.tradingview.com/x/HYaZlzif/)  (I had calls on this and closed today for a nice profit.)\n\nExhibit 4: SBUX [https://www.tradingview.com/x/YUlXSkNE/](https://www.tradingview.com/x/YUlXSkNE/)  **forming right now.**  I do not yet have a position, but I'm about to get calls, probably tomorrow. probably should have got them today. either way, this triangle is my favorite setup. \n\nExhibit 5: AMZN [https://www.tradingview.com/x/zxNalizg/](https://www.tradingview.com/x/zxNalizg/)   I picked one up today (1/10 1900c for 15.0) when I became convinced it was gonna break 1900 today and break above triangle). I could get fucked tomorrow, but I like the setup, so I play it because it's a high probability setup. \n\nExhibit 6: CRM **A weekly BIG boy triangle:** [https://www.tradingview.com/x/8hg3SEPH/](https://www.tradingview.com/x/8hg3SEPH/)   beautiful, ain't she? Zoomed in: [https://www.tradingview.com/x/8hg3SEPH/](https://www.tradingview.com/x/8hg3SEPH/)   You can see where I tried for an entry (blue arrow) but it didn't work out. Totally fine because stop was defined. \n\nThere are many more examples, but you get the point. These triangle are high probability setups for breakouts. Don't keep blindly throwing money at FD's.",
        "subreddit": "wallstreetbets",
        "title": "Look for this triangle, fam",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/el6i4k/look_for_this_triangle_fam/",
        "created": 1578401209.0
    },
    {
        "author": "Johnnybats330",
        "created_utc": 1579238027,
        "id": "epvvzf",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Every week the S&amp;P reaches new highs. A lot of stocks are reaching 52 wk highs like MSFT, Apple, CRM, Accenture.\n\nI have shorted and held aome of them, but currently holding back on putting more than 60% of my cash in equity thinking prices well fall.\n\nIs anyone else holding to cash like a dummy while the bulls run?",
        "subreddit": "investing",
        "title": "Is anyone sittin on cash?",
        "url": "https://www.reddit.com/r/investing/comments/epvvzf/is_anyone_sittin_on_cash/",
        "created": 1579266827.0
    },
    {
        "author": "dont-speak-everrr",
        "created_utc": 1578662447,
        "id": "emqtqv",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I’ve posted many a goldmine on here and here is my latest.\n\nI am hoping for a well informed, meaningful debate so I came to the busiest hive of intellectuals I know of. \n \nMy apologies, I am not going to call you retaRts or autists for free upvotes. I’ll treat you like the gentlemen you are... and then take you out to dinner... and then fuck you.\n\nSorry. So right now, all the popular people are influencing all the other people on Insta and getting paid mega bucks.  Those bucks are heavily restricted.  KimK and all the others are restricted to marketing what?  SAY IT WITH ME.  LOW BARRIER RETAIL GOODS.\n\nDrinks, sandals, makeup, subscriptions, parties, and a bunch of shit that most big bad business people don’t give a shit about.\n\nThey cannot sell software (salesforce, AWS), airplane parts, security systems and IT, industrial manufacturing lines, private equity channels, water systems, electricity, office space, waste management, pipelines, street lights.  To summarize, Instagram can’t sell big ticket items and big services (over 90% of the economy).\n\nFor people trying to sell those things, they only currently have traditional media streams. \n\nNow Imagine an inevitable world where the biggest influencers are Doug McMillon, CEO of Walmart, Chief of IT, Director of sales, etc. how much would I pay for one of them to hawk my product, millions and millions.\n\nThis WILL happen. Gradually, CEOs and the like will be more public online social figures, not number crunchers and operators.  Those people will still be at the top, but not the very top anymore. Hiring a new CEO for Sysco will become more of a review of social presence + leadership and know how and everything else.  In 10 years, it will feel silly to hire someone to head your company that has little or no online presence.\n\nWhen people see that they can make big money on LinkedIn, insta influencers will flock to it (“I’m ceo of my cool makeup business, bleh bleh, and they will make some change and then quickly fade out, to be supplanted by reals.\n\nNext point...\n\nInsta will fall out of favor.  This just happens. Sorry Zuck.\n\nNext point...\n\nCan you believe we live in a world today where you can put anything on your resume and no one can check it?  I used to work for Chad, CEO of protein powder where I exceeded all my goals every month and doubled sales.  Here is my brothers phone number who will answer as Chad.\n\nThis is not long meant for this world.  The days are over. If you worked at subway, then you worked at subway.  It will become strange to see someone applying who has no professional online presence. Think FB 2012.\n\nNext point...\n\nWho’s on LinkedIn and what is it?\n\nAlmost no one is on it. Bill gates gets like 2,000 likes for a post. CEO of spank girl is like the hottest thing going... \nTHAT is a classic value play. Nowhere to go but up.\n\nWhat is it? To most people, it is some website they tried once a long time ago and now emails them like 4 times a day.  They have been quietly working on their app, news feed, content, and algorithms to make it a much better product. It is. I see a lot more activity on there from a lot more important people than I used to.\nIMO, pretty fun app now.\n\nNext point,...\n\nWe are in “what to do limbo” in terms of what to do when you lose a job.  We know why people used to do, what do you do now?\n\nDo you post it on Snap, TT, Insta, or anywhere? No. Do you make a mass group email and email it to your professional network, because you have all of their emails ready to go? No. Do you text ya bois? No.  LinkedIn is the only option going forward.\n\nWhere do you find out who’s hiring and who to talk to? All on LinkedIn.\n\nGlassdoor, Indeed, ZIP, etc... ALL of them are trying to build a social network out of their product. It will never work.\n\nThere is only LinkedIn, and it is massively undervalued. It will be unheard of in the near future to not have a robust profile and presence on LinkedIn. In 10-20 years when boomers retire, it will be a fully mature product.\n\nWhat do you think? \n\nLinkedIn &gt; Insta?\n\nDo you agree with the timeframe?",
        "subreddit": "wallstreetbets",
        "title": "LinkedIn &gt; Instagram?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/emqtqv/linkedin_instagram/",
        "created": 1578691247.0
    },
    {
        "author": "googlme",
        "created_utc": 1577930384,
        "id": "eiri78",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Hi r/stocks, \n\nlast year I created a similar thread. ([https://www.reddit.com/r/stocks/comments/anbr7e/first\\_year\\_into\\_stocks\\_summary\\_all\\_tech/](https://www.reddit.com/r/stocks/comments/anbr7e/first_year_into_stocks_summary_all_tech/)). I still follow buy and hold strategy and only sell stocks when I don't like certain changes in a company. Sometimes those decisions paid off, sometimes (AAPL) I missed out a bit (nevertheless I don't regret those decisions). \n\nAt some point I was down 30-50% on both NVDA and TSLA, I do strongly believe in both those companies and will not sell either of them in the next 5y for sure. Hitting a bigger number on the portfolio I started diversifying a bit as well. (MA,V,MRK)\n\nStrategy for 2020 is pretty simple for me, I'll invest mostly in AI and cybersececurity companies: First priority is to add a ton of Tencent. Highly recommend the book: \"AI Superpowers Book by Kai-Fu Lee\". imo there is no way around AI and probably Asia will be in the driving seat for the first time in 5-10y.\n\n**Be patient, don't panic sell, it might be swingy here and there but if you invest in strong companies it will pay off.** \n\nCurrent portfolio:\n\n* TSLA +56%\n* CRM +46%\n* FTNT +37%\n* MSFT +35%\n* AMZN +31%\n* MRK +9%\n* MA + 9%\n* NNND +8%\n* NVDA +7%\n* V +1%\n\n[https://imgur.com/a/6RJNKXU](https://imgur.com/a/6RJNKXU)",
        "subreddit": "stocks",
        "title": "second year into stocks - mostly tech (summary)",
        "url": "https://www.reddit.com/r/stocks/comments/eiri78/second_year_into_stocks_mostly_tech_summary/",
        "created": 1577959184.0
    },
    {
        "author": "t3chb1zn3ss",
        "created_utc": 1580458094,
        "id": "ewl7aj",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "If you had 25K to enter the market tomorrow, what would you invest in?  Why?\n\nI'm interested in seeing what the responses will be.\n\nThese are the stocks I've been swinging lately:\n\nAAPL, ACN, ADSK, AMD, AMZN, BABA, BR, BZUN, C, COLL, CMG, CRM, CSCO, CTSH, DIS, DOX, EWZ, FB, GE, GOOGL, GPRO, GS, HTBX, MSFT, NET, NFLX, NKE, NVDA, OKTA, SBUX, SEIC, SHOP, SNA, SPOT, SQ, TEAM, TSLA, TTWO, TWTR, UBER, UPWK, V, WDAY, WORK, YEXT, ZEN, and ZS.\n\nMy largest position is in Apple, which I continue to add to and will hold until it reaches $1K per share.  At that point, I'll decide whether to sell.  $1K is a long ways away .... or is it?",
        "subreddit": "stocks",
        "title": "If you had 25K to enter the market tomorrow, what would you invest in?",
        "url": "https://www.reddit.com/r/stocks/comments/ewl7aj/if_you_had_25k_to_enter_the_market_tomorrow_what/",
        "created": 1580486894.0
    },
    {
        "author": "sillycoconutrebull",
        "created_utc": 1579105270,
        "id": "ep4d36",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Is there a reason that no one is?   \n\n\n[https://www.webpronews.com/google-may-buy-salesforce/](https://www.webpronews.com/google-may-buy-salesforce/)",
        "subreddit": "wallstreetbets",
        "title": "I don't see anyone posting about Salesforce?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ep4d36/i_dont_see_anyone_posting_about_salesforce/",
        "created": 1579134070.0
    },
    {
        "author": "keepitsimple456",
        "created_utc": 1578694205,
        "id": "emy32q",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I received feedback from several of you who have followed my postings. I will continue to post just not as often unless specifically requested. My idea for trading such a large volume of both underlyings and DTE's is so no one position can sink my account. As to how I pick my trades I've answered this in prior posts but, will answer it again. The first thing I do is chart it. I look for an upward bias or lack thereof in the underlying, I avoid stocks that look to be heading in a downwards direction then I do research on the stock to see if there is anything I feel I should be leary of. I set up an order ticket and look at my return as a percentage of my total risk. I'm looking for at least 20% and in most cases more like 25-30% of total risk. I look to stay at least one strike or more away from the current price of the underlying depending on the price movement of the underlying after all of that if the option still looks good to me I sell a put spread, or possibly an iron condor although that's not something I do very often. I trade about 30-50 underlyings and out to about 3 sometimes 4 weeks mostly though I try for 10 days or less. It seems to me that the closer to expiration I trade the higher the percentage return mostly due to the more turns I generate but also the percentage in premium I get per trade. I like to trade a few movers, (AAPL, GOOG, SHOP, TSLA, CRM as examples) as they add a higher percentage return for the same risk not counting volatility. I look to allocate approximately the same amount per trade (both by underlying and time) each time taking into consideration the difference in the price of the underlying. I maintain a watchlist which I posted on here as requested to both track events and to keep track of stocks for future consideration if I feel like one of the ones I've been trading has gotten to a place I'm not comfortable with.\n\nRight now I'm reducing the number/value of my trades outstanding as I'm a little nervous with the market behavior. I will still trade just a good bit less although subject to change at any time. I am looking for some new stocks ideas so will be perusing my watchlist going forward.\n\nThe trades you will see today were mostly closing trades as I decided to take some profits today and closed out about 20% of my trades outstanding for a profit or roughly $7400.00. It helps to offset the $9000 plus losses I closed out yesterday and leaves my up $97.79 for the week. My worst week in quite some time the reason is that I took losses going forward which should improve my margins going forward we will have to see if I'm right. I made a big mistake when I tried something different. I sold calls spreads on my losers trying to reduce my loss instead I increased my vulnerability to 2 directions and naturally the stocks moved up into the calls so I lost anyway. I still have to digest all of the info I have to see exactly where I goofed one of the disadvantages of trading the way I do is there is a lot of information to digest and learn from.\n\nAction\tQTY\tSymbol\tPrice\tAVG\tExe\tPrice \n\nSELL CLOSE\t5\tAMGN Jan 10 '20 $235 Put\t0.03\t0.01\t5\t Debit\n\nBUY CLOSE\t5\tAMGN Jan 10 '20 $237.50 Put\t0.03\t0.04\t5\t Debit\n\nBUY OPEN\t5\tAMGN Jan 17 '20 $235 Put\t0.73\t1.36\t5\t Credit\n\nSELL OPEN\t5\tAMGN Jan 17 '20 $237.50 Put\t0.73\t2.09\t5\t Credit\n\nSELL CLOSE\t20\tAXP Jan 17 '20 $122 Put\t0.04\t0.08\t20\t Debit\n\nBUY CLOSE\t20\tAXP Jan 17 '20 $123 Put\t0.04\t0.12\t20\t Debit\n\nSELL CLOSE\t10\tBMY Jan 17 '20 $61.50 Put\t0.03\t0.08\t10\t Debit\n\nBUY CLOSE\t10\tBMY Jan 17 '20 $62 Put\t0.03\t0.11\t10\t Debit\n\nSELL CLOSE\t5\tCOST Jan 17 '20 $280 Put\t0.03\t0.06\t5\t Debit\n\nBUY CLOSE\t5\tCOST Jan 17 '20 $282.50 Put\t0.03\t0.09\t5\t Debit\n\nSELL CLOSE\t5\tCOST Jan 17 '20 $285 Put\t0.06\t0.11\t5\t Debit\n\nBUY CLOSE\t5\tCOST Jan 17 '20 $287.50 Put\t0.06\t0.17\t5\t Debit\n\nSELL CLOSE\t5\tCOST Jan 24 '20 $285 Put\t0.15\t0.23\t5\t Debit\n\nBUY CLOSE\t5\tCOST Jan 24 '20 $287.50 Put\t0.15\t0.38\t5\t Debit\n\nBUY OPEN\t10\tCOST Jan 24 '20 $292.50 Put\t0.75\t1.35\t10\t Credit\n\nSELL OPEN\t10\tCOST Jan 24 '20 $295 Put\t0.75\t2.1\t10\t Credit\n\nSELL CLOSE\t7\tCRM Jan 17 '20 $160 Put\t0.02\t0.03\t7\t Debit\n\nBUY CLOSE\t7\tCRM Jan 17 '20 $162.50 Put\t0.02\t0.05\t7\t Debit\n\nBUY CLOSE\t20\tCVS Jan 10 '20 $74 Call\t0.02\t0.01\t20\tLimit\n\nSELL CLOSE\t30\tDIS Jan 10 '20 $143 Put\t0.02\t0.02\t30\t Debit\n\nBUY CLOSE\t30\tDIS Jan 10 '20 $144 Put\t0.02\t0.04\t30\t Debit\n\nBUY OPEN\t10\tDIS Jan 24 '20 $142 Put\t0.3\t0.84\t10\t Credit\n\nSELL OPEN\t10\tDIS Jan 24 '20 $143 Put\t0.3\t1.14\t10\t Credit\n\nSELL CLOSE\t10\tFB Jan 17 '20 $200 Put\t0.03\t0.08\t10\t Debit\n\nBUY CLOSE\t10\tFB Jan 17 '20 $202.50 Put\t0.03\t0.11\t10\t Debit\n\nSELL CLOSE\t10\tFB Jan 24 '20 $197.50 Put\t0.05\t0.16\t10\t Debit\n\nBUY CLOSE\t10\tFB Jan 24 '20 $200 Put\t0.05\t0.21\t10\t Debit\n\nSELL CLOSE\t1\tGRUB Jan 17 '20 $50 Put\t0.95\t0.97\t1\tLimit\n\nSELL CLOSE\t5\tHD Jan 24 '20 $210 Put\t0.09\t0.15\t5\t Debit\n\nBUY CLOSE\t5\tHD Jan 24 '20 $212.50 Put\t0.09\t0.24\t5\t Debit\n\nSELL CLOSE\t20\tJNJ Jan 10 '20 $143 Put\t0.04\t0.0525\t20\t Debit\n\nBUY CLOSE\t20\tJNJ Jan 10 '20 $144 Put\t0.04\t0.0925\t20\t Debit\n\nBUY CLOSE\t8\tJNJ Jan 17 '20 $145 Call\t0.53\t1.45\t8\t Debit\n\nSELL CLOSE\t8\tJNJ Jan 17 '20 $146 Call\t0.53\t0.92\t8\t Debit\n\nSELL CLOSE\t10\tMA Jan 17 '20 $292.50 Put\t0.06\t0.18\t10\t Debit\n\nBUY CLOSE\t10\tMA Jan 17 '20 $295 Put\t0.06\t0.23\t10\t Debit\n\nBUY OPEN\t20\tMET Jan 24 '20 $51.50 Put\t0.15\t0.35\t20\t Credit\n\nSELL OPEN\t20\tMET Jan 24 '20 $52 Put\t0.15\t0.5\t20\t Credit\n\nSELL CLOSE\t15\tMSFT Jan 17 '20 $152.50 Put\t0.05\t0.09\t15\t Debit\n\nBUY CLOSE\t15\tMSFT Jan 17 '20 $155 Put\t0.05\t0.14\t15\t Debit\n\nSELL OPEN\t10\tNKE Jan 17 '20 $100 Put\t0.12\t0.55\t10\t Credit\n\nBUY OPEN\t10\tNKE Jan 17 '20 $99.50 Put\t0.12\t0.43\t10\t Credit\n\nBUY CLOSE\t10\tPG Jan 10 '20 $122 Put\t0.01\t0.01\t10\tLimit\n\nBUY CLOSE\t5\tSHOP Jan 10 '20 $395 Put\t0.05\t0.05\t5\tLimit\n\nSELL CLOSE\t5\tSHOP Jan 17 '20 $382.50 Put\t0.1\t0.34\t5\t Debit\n\nBUY CLOSE\t5\tSHOP Jan 17 '20 $385 Put\t0.1\t0.43\t5\t Debit\n\nBUY CLOSE\t10\tTGT Jan 17 '20 $125 Call\t0.52\t3.33\t10\t Debit\n\nSELL CLOSE\t10\tTGT Jan 17 '20 $126 Call\t0.52\t2.81\t10\t Debit",
        "subreddit": "options",
        "title": "My trades for the day",
        "url": "https://www.reddit.com/r/options/comments/emy32q/my_trades_for_the_day/",
        "created": 1578723005.0
    },
    {
        "author": "WaxuTutu",
        "created_utc": 1578367415,
        "id": "el5h6d",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Gold can be a great way to make money off the possibility of war, but another great alternative is cyber security stocks. There is a strong possibility the war could create a strong demand for this service, The market showed today that this was indeed how it would react but it’s not too late.\n\nTop picks: CRWD, CRM",
        "subreddit": "stocks",
        "title": "Making money off Iran war",
        "url": "https://www.reddit.com/r/stocks/comments/el5h6d/making_money_off_iran_war/",
        "created": 1578396215.0
    },
    {
        "author": "NaturallyBlockheaded",
        "created_utc": 1578371433,
        "id": "el6au0",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "$SHOP is breaking out pretty nicely. Buy point was right around $409, closed the day $413.33 and set up to run, especially with the Salesforce upgrade generally boosting. \n\nFor those of you looking to buy some big-boy pants with your INPX profits 😉",
        "subreddit": "RobinHoodPennyStocks",
        "title": "If any of y'all really wanna get wild",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/el6au0/if_any_of_yall_really_wanna_get_wild/",
        "created": 1578400233.0
    },
    {
        "author": "Character-Tone",
        "created_utc": 1578548532,
        "id": "em5dca",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Have been reading/hearing a lot about this company. Hearing a lot of organizations are moving towards it. Reading feedback about the user experience, sounds like many are pleased. \n\nWhat are your thoughts on this? Could it become a market leader similar to salesforce? Or is it just another video company?",
        "subreddit": "stocks",
        "title": "Zoom Video (ZM) thoughts",
        "url": "https://www.reddit.com/r/stocks/comments/em5dca/zoom_video_zm_thoughts/",
        "created": 1578577332.0
    },
    {
        "author": "SeaOtterReddit",
        "created_utc": 1578954378,
        "id": "eobja2",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Like the title says ^",
        "subreddit": "stocks",
        "title": "Will salesforce (CRM) continue to grow?",
        "url": "https://www.reddit.com/r/stocks/comments/eobja2/will_salesforce_crm_continue_to_grow/",
        "created": 1578983178.0
    },
    {
        "author": "WSBConsensus",
        "created_utc": 1579109270,
        "id": "ep5a3g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "*1/8/20 1:42PM*\n&gt;Dropbox Option Alert: Jan 17 $19 Calls Sweep (44) near the Ask: 1024 @ $0.201 vs 5898 OI; Earnings 2/20 After Close [est] Ref=$18.46\n\n*1/8/20 1:48PM*\n&gt;Dropbox Option Alert: Jan 17 $19 Calls Sweep (19) near the Ask: 928 @ $0.25 vs 5898 OI; Earnings 2/20 After Close [est] Ref=$18.5089\n\n*1/15/20 10:24AM*\n&gt; Dropbox Option Alert: Feb 21 $20 Calls Sweep (3) near the midpoint: 787 @ $0.6 vs 7255 OI; Earnings 2/20 After Close [est] Ref=$18.5868",
        "subreddit": "wallstreetbets",
        "title": "What if, Salesforce (CRM) did in fact make that offer for Dropbox (DBX).",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ep5a3g/what_if_salesforce_crm_did_in_fact_make_that/",
        "created": 1579138070.0
    },
    {
        "author": "HenryLeeVince",
        "created_utc": 1579811704,
        "id": "esyzdy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "ROBINHOOD IS NOT SECURE. I have never traded options in my life. I have never shorted stock. Someone recently explained to me what all of that even means. I had bought and held shares in tesla, Twilio, Rakuten, Salesforce, canopy, and aurora. One morning I woke up and someone had taken control of my account and started using the \"instant deposit\" feature the withdrawal money that wasn't even there. They then proceeded to buy large amounts of puts in a company called \"tlry\" and sold all my current standing stocks. Robinhood has denied fraud on multiple occasions even when presented with numerous screenshots and help letters. It makes sense they don't want to admit a flaw in their software. I have never felt so defeated and frustrated in my life with no helpline to call and a useless thread of emails. BTW now my account says -4,500 and they want me to pay it to get my balance back to 0. HA fuking joke. I want my stocks I Had and never touched back.",
        "subreddit": "investing",
        "title": "ROBINHOOD STOLE MY MONEY/ THEIR SYSTEM IS FLAWED",
        "url": "https://www.reddit.com/r/investing/comments/esyzdy/robinhood_stole_my_money_their_system_is_flawed/",
        "created": 1579840504.0
    },
    {
        "author": "unkowngod",
        "created_utc": 1579552490,
        "id": "erj7af",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Does anyone have any theories as to what this means? I got a random text from someone. I assumed SFDC is salesforce getting a merger with WDAY???",
        "url": "https://i.redd.it/8b865i00vzb41.jpg",
        "created": 1579581290.0
    }
]