[
    {
        "author": "Isthiswittyenough92",
        "created_utc": 1597247197,
        "id": "i8g3bq",
        "num_comments": 394,
        "num_crossposts": 0,
        "selftext": "All you autists worried about RKT and will end up paper handing any dips need to wake up. RKT is one of the best deals on the market right now. Here's why:\n\n**RKT will undoubtedly eventually be valued as a Fintech Company.**\n\nWhy? Because it has all the core components of a fintech company. RKT at it's core is a consumer-facing, tech-based mortgage origination platform and it's productivity, Revenue per Employee, and margins are **in line if not better than fintech players**. Let's take a look:\n\n* RKT's Q1 2020 EBITDA Margin was a **blistering 44%!** Compare that other FinTechs latest EBITDA margins \n   * SHOP at negative 1.9%\n   * GWRE at 6%\n   * LMND at negative 73%!\n   * PYPL at 19%\n* RKT has an **Revenue per Employee (as of 3/31/20) figure of $300k**! Again, compare to other Fintechs, RKT is nearly the exact Median\n   * SHOP at $416k / employee\n   * GWRE at $276k / employee\n   * LMND at $251k / employee\n   * PYPL at $828k / employee\n* Now, let's look at the valuation for the other Fintechs. **RKT is very obviously undervalued compared to the segment**\n   * Enterprise Value / Revenue\n      * SHOP - 54.3x LTM Revenue\n      * GWRE - 11.7x LTM Revenue\n      * LMND - 44.3x LTM Revenue\n      * PYPL - 11.4x LTM Revenue\n      * **RKT - 2.2x LTM Revenue**\n   * P/E\n      * SHOP - N/A, negative EPS\n      * GWRE - 333x P/E\n      * LMND - N/A,negative EPS\n      * PYPL - 87x P/E\n      * **RKT - 7.7x P/E**\n\n**But, but, what about the mortgage volume? Isn't RKT exposed to interest rates and mortgage volume?**\n\nPlain and simple, there is no force that is going to stop volume right now. We can all say that fundamentals don't matter and for stock market pricing they may not. But in terms of interest rate action by the Fed, they very much do matter, and it is clear the Fed does not intend to raise rate until fundamentals truly stabilize. And if rates do come up, it will mean even J.Pow &amp; Co think inflation is getting too hot. Fuck SLV gang, **Real Estate is the ultimate anti-inflation safe-haven.** So volume should remain largely unaffected as investors seek inflation protection.\n\n**RKT continues to gain market share in an expanding market**\n\nLet's face it, eventually boomers will not be applying for new mortgages and millennials are not going to walk into Chase with a $100 fountain pen to apply for a mortgage. One of the biggest themes of the housing market today is increasing rate of home ownership among millenials. RKT's completely digitized offering positions them to capitalize on market trends. The numbers prove this as RKT's share of the total mortgage market has increased from 1.3% in 2009 to &gt;9% in the first quarter of 2020, making RKT the **largest mortgage originator in the US.**\n\n**RKT's technology drives faster, better outcomes for end consumer**\n\nRKT's application process can be understood as \"parallel\" vs. the traditional mortgage industry's \"linear\" process. This results in faster approvals and faster closing times. RKT closes loans 25% faster than the industry average - 29 days on average vs. the industry average of 40 days. Not only is this good for the end consumer (instant-gratification millennials), it means RKT's workforce is significantly more efficient than the industry average, closing average of **8.3 loans per month per team member** in YTD 2020 vs. the **industry average of 2.3 per moth per team member**\n\n**In summary, the retail mortgage industry is in desperate need of digitization. RKT is perfectly positioned to capitalize on this need.** After all, who else is going to do this? Penny-fucking-Mac?\n\nTLDR: Go long RKT, I am long shares and will continue to add on dips.",
        "subreddit": "wallstreetbets",
        "title": "Buying the RKT Dip is an Absolute No-Brainer",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8g3bq/buying_the_rkt_dip_is_an_absolute_nobrainer/",
        "created": 1597275997.0
    },
    {
        "author": "wileywyatt",
        "created_utc": 1598742102,
        "id": "ij24lk",
        "num_comments": 384,
        "num_crossposts": 0,
        "selftext": "Hi Friends,\n\nMy Stock Portfolio has been consistently outperforming the S&amp;P 500 index by 3x, for the past 5 years.\n\n**75% of my portfolio is made up of these 15 stocks**:\n\nAMZN, GOOGL, SQ, FB, WM, HD, BABA, \n\nFISV, MSFT, V, PYPL, CHGG, BIDU, TCEHY, IQ\n\n**[Here Is My Pie-Chart Stock Portfolio Diversity](https://i.imgur.com/HyjqZeA.png)**.\n\nPlease let me know what you think!\n\nI hope this helps you strengthen your own portfolio, and I wish you all the best!",
        "subreddit": "stocks",
        "title": "My Portfolio: Outperforming S&amp;P 500 By 3x, For 5 Years (See Picture).",
        "url": "https://www.reddit.com/r/stocks/comments/ij24lk/my_portfolio_outperforming_sp_500_by_3x_for_5/",
        "created": 1598770902.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1597731606,
        "id": "ibvpvx",
        "num_comments": 192,
        "num_crossposts": 0,
        "selftext": "TLDR: Feeling content and generous. Will send $200 to random comments on this post WHEN RKT hits $30. Will use random generator to choose one person. Payment will be via Paypal/Venmo. \n\nDisclaimer: This is not an attempt to pump the stock. Don’t pump it cause I’d like a gradual run up. Also, I have 25k in shares and 2k in calls, so $30 would be a big payday for me (just being as transparent as possible). \n\nI’m just feeling pretty content with the past couple weeks of trading. By no means am I one of those gain porn 2000% profit dudes, but I’ve been doing pretty good. I just want to show some appreciation for you comedians out there (the purple dudes, the nikola dudes, the Kodak dudes). Seeing your guys’ post prior to their earnings has saved me from buying in those sinking ships, so inverse was good.\n\nGood luck all! Spread the good karma.",
        "subreddit": "wallstreetbets",
        "title": "RKT: $30 PT Free Money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ibvpvx/rkt_30_pt_free_money/",
        "created": 1597760406.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1598326271,
        "id": "ig4gma",
        "num_comments": 123,
        "num_crossposts": 0,
        "selftext": "All entries are in! RKT hit $30 in the AH thanks to every one of your efforts! \n\nAt 10 PM, I will go on to a random number generator and will put in the number of unique (no duplicates) entries. In order to make this fair, I’ll be using a number generator instead of a name generator because I don’t want people to think I have some alt account that I’m sending to myself lol. Not about that shady stuff. \n\nWhatever number is generated, I’ll count down to that comment and select that winner. I’ll do this once for the $200 and another for the $100. \n\nThe winners will be notified via DM and I will also post their user name here when selected. Please be aware, if you do not claim this within 24 hours, a new winner will be selected! \n\nHave your Paypal acc ready. I prefer paypal just because it’s easier! Please make a post confirming receipt of the prize but please blur out any sensitive info! Thanks in advanced. \n\nGood luck all!",
        "subreddit": "wallstreetbets",
        "title": "RKT Hit $30! Selection Begins At 10PM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ig4gma/rkt_hit_30_selection_begins_at_10pm/",
        "created": 1598355071.0
    },
    {
        "author": "rs5-",
        "created_utc": 1596553149,
        "id": "i3ktgl",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "Hey yall was looking to put more money in the game. I was wondering if you guys have any suggestions. I hope you all don’t mind me asking/isn’t too low effort \n\nI currently own is there anything you recommend adding? Thank you so much \n\nApple \nMicrosoft \nFacebook \nVery very small portions of ual, luv, ccl \nUso \nNvda \nDocu \nVisa \nPaypal \nJpm \nDis \nLmt\nJnj \nTdoc",
        "subreddit": "stocks",
        "title": "Favourite growth stock?",
        "url": "https://www.reddit.com/r/stocks/comments/i3ktgl/favourite_growth_stock/",
        "created": 1596581949.0
    },
    {
        "author": "farting_tomato",
        "created_utc": 1597612865,
        "id": "ib0pdh",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": " [https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter](https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter)\n\nTL;DR\n\nADAGE CAPITAL PARTNERS\n\n* Top new buys: RPRX, ABBV, W, HZNP, FIVE, ST, CCK, TRV, USB, JCI\n* Top exits: BMY, GILD, ETN, PNC, MAS, EXC, AON, CCMP, NI, CX\n* Boosted stakes in: BURL, PYPL, FTV, ITT, LOW, GOOGL, TMUS, EYE, AZO, BMRN\n* Cut stakes in: LMT, JNJ, PFE, HON, VZ, VRTX, TGT, VMC, PXD, LLY\n\nAPPALOOSA\n\n* Top new buys: T, V, MA, PYPL, DIS, SYY, EMR, MO, SQ, TEN\n* Top exits: INTEQ, XLU, BKLN\n* Boosted stakes in: TMUS, BABA, MU, HCA, MSFT, BSX, TWTR, WFC, CRM, GT\n* Cut stakes in: PCG, UNH, TSLA, HUM, VST, AMLP, AVGO, NFLX, QCOM, ADBE\n\nBALYASNY ASSET MANAGEMENT\n\n* Top new buys: SCHW, ABT, TGT, HD, ADBE, SHOP, ITW, COST, C\n* Top exits: JCI, AMTD, INTC, CHTR, KR, TMUS, TTWO, NVDA, ICE, ROST\n* Boosted stakes in: PYPL, FISV, BABA, JPM, FLT, NSC, LITE, DKS, QCOM, LHX\n* Cut stakes in: BSX, LOW, DG, FIS, ABBV, BAX, INTU, JD, BK, ETFC\n\nBAUPOST GROUP\n\n* Top new buys: HCA, VRNT, VTR, SSNC\n* Top exits: LNG, ET, XPO, SPR, CARS\n* Boosted stakes in: LBTYK, TBIO, QRVO, ATRA, HDS\n* Cut stakes in: FB, GOOG, PCG, UNVR, ABC, HPQ, CLNY, VIST, AKBA\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: GOLD\n* Top exits: DAL, LUV, UAL, AAL, QSR, GS, OXY\n* Boosted stakes in: STOR, KR, SU\n* Cut stakes in: WFC, JPM, SIRI, PNC, MTB, BK, MA, V, CHTR, USB\n\nBRIDGEWATER ASSOCIATES\n\n* Top new buys: UPS, ZLAB, CSX, ECL, TT, RNG, PAYC, ROP, GWW, FICO\n* Top exits: TLT, HYG, EMB, RY, TD, TIP, CNI, BNS, TRP, BCE\n* Boosted stakes in: SPY, GLD, IVV, FXI, BABA, MCHI, IAU, JD, PDD, VEA\n* Cut stakes in: EWZ, LQD, INDA, EWY, EEM, IEMG, VWO, EWW, BAM, EWT\n\nCOATUE MANAGEMENT\n\n* Top new buys: BA, DOCU, INO, DXCM, WYNN, HWM, LYV, ALGN, TDG, DHT\n* Top exits: RNG, SNAP, BYND, LKNCY, GLUU, ISRG, CGC, STNE, MCD, VGK\n* Boosted stakes in: DIS, PYPL, ZM, SQ, CRWD, PTON, LRCX, SHOP, MU, PODD\n* Cut stakes in: MSFT, LBRDK, BABA, TWTR, JD, NKE, GPN, CREE, GH, NFLX\n\nCORSAIR CAPITAL MANAGEMENT\n\n* Top new buys: IWO, IWM, WMB, NATR, MFIN\n* Top exits: LAUR, RHP, ECPG, ATKR, NMRK, TROX, KRA, FSK, HHC, SATS\n* Boosted stakes in: VRT, WSC, GDDY, CC, BH, BBCP, METC, BRK/B\n* Cut stakes in: HGV, HMHC, FMC, NWSA, REPH, GOOG, CHDN, C, CUBI, PLYA\n\nCORVEX MANAGEMENT\n\n* Top new buys: TMUS, EXC, EVRG, CMCSA, JPM, IAA, TIF, LYV, PCG\n* Top exits: ZEN, CRM, FANG, UNP, VMC, MPC, UNH, ANTM, SPY\n* Boosted stakes in: MGM, GLD, BABA, CNP, NFLX, HUM, CNC, MSGS\n* Cut stakes in: ADBE, ATUS, ATVI, AMZN\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: JPM, AVB, EXPE, TGT, DEI, AAP, ESS, CVNA, SMAR, PNC\n* Top exits: LIN, GWRE, TME, NKE, UNH, BAC, PDD, DHI, INMD\n* Boosted stakes in: BABA, USB, JD, LVS, MSFT, HPP, KRC, CCC, LYV, HLT\n* Cut stakes in: NFLX, FB, AMZN, DIS, RACE, ORLY, PPD, AZO, SBUX, GOOGL\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: TMUS, JPM, XBI, SBUX, BKNG, SMAR, CCL, WFC, LYV, CB\n* Top exits: ABT, QCOM, NOW, ADBE, INDA, COUP, TWOU, EDU, SNE, TWLO\n* Boosted stakes in: MSFT, JD, FCX, FSLY, BABA, CRWD, RETA, PLAN, FLEX\n* Cut stakes in: NFLX, FB, AMZN, WDAY, ATVI, GOOGL, GE, IQV, FIS, DISH\n\nELLIOTT MANAGEMENT\n\n* Top new buys: WELL, FSCT\n* Top exits: LQD, RRTS, ESI, HYG, XOP, NEWR, CSOD, NTNX, CNHI, EGHT\n* Boosted stakes in: DELL, TWTR, RYAAY\n\nENGAGED CAPITAL\n\n* Top new buys: JACK, MGLN, SMPL, IWM\n* Top exits: APOG\n* Boosted stakes in: STKL, NCR\n* Cut stakes in: HAIN\n\nFIR TREE\n\n* Top new buys: SQ, LYV, PS, SNAP, VG, EIX, SABR, EXPE, J, PCPL\n* Top exits: FLT, FPAC, BKNG, SHLL, CCH, GOOG, APXT, OAC, DMS, EXPC\n* Boosted stakes in: CNC, CTXS\n* Cut stakes in: DIS, MSFT, TMUS, LAUR, ANTM, DELL, EXC, CMCSA, SLM, TRNE\n\nGREENLIGHT CAPITAL\n\n* Top new buys: GDX, AAWW, TECK, REZI, JACK, GLD, APG, TPX, SATS, WHR\n* Top exits: ATUS, ADNT, CNC, MO, PAYX, AXP, GS, DHR, BRK/B, DIS\n* Boosted stakes in: AER, CHNG, NBSE, GPOR\n* Cut stakes in: CNX, XELA, CC\n\nICAHN\n\n* Top exits: HPQ, HTZ, FCX\n* Boosted stakes in: IEP, LNG, TEN\n* Cut stakes in: CLDR\n\nIMPALA ASSET MANAGEMENT\n\n* Top new buys: LAD, DRI, NSC, HES, CMI, VAC, TOL, ADNT, DOOO, MU\n* Top exits: MSFT, PCAR, CSX, KBH, VMC, MA, AMZN, FDX, EXP\n* Boosted stakes in: HOG, RIO, AAWW, FUN, WYNN, UFI\n* Cut stakes in: TGT, QCOM, KSU, SBLK, TTWO, SIX, KNX, TCKRF, NVR, TECK\n\nJANA PARTNERS\n\n* Top exits: NEWR, JACK\n* Boosted stakes in: PRSP, SPY\n* Cut stakes in: AXTA, HDS, HI, BLMN, ELY, CAG\n\nLAKEWOOD CAPITAL MANAGEMENT\n\n* Top new buys: HDS, CRL, LBTYK, LBTYA, UE, CDK, NKLA, ABG, CROX, SHAK\n* Top exits: WUBA, AMZN, ICE, FNF, TWO, YY, RNR, TPR, WW, REAL\n* Boosted stakes in: FAF, BABA, ANTM, AXS, BIDU, BHC, HCA, SKX, C, ACGL\n* Cut stakes in: GOOGL, CI, FB, MA, DELL, GS, AGNC, APO, CMCSA, BC\n\nLANSDOWNE\n\n* Top new buys: C, VMC, LUV, ED, FCX, RYAAY, AES, COG, TMUS, BKNG\n* Top exits: DHT, NKLA, AGI, TT, IQ, BABA\n* Boosted stakes in: MU\n* Cut stakes in: UAL, DAL, FSLR, GE, ETN, ADI, REGI, LRCX, TSM, SMMT\n\nLONG POND\n\n* Top new buys: PEAK, LVS, DEI, EQR, SHO, WELL, SEAS, UDR, INVH, MAR\n* Top exits: H, DHI, VNO, PEB, PGRE, MGM, VAC, RRR, JLL, CUZ\n* Boosted stakes in: CPT, AVB, MAA, AIV, HLT, ESS, FR, KRC, JBGS\n* Cut stakes in: WH, HGV, RHP, HPP, SBRA\n\nMAGNETAR FINANCIAL\n\n* Top new buys: ADCT, NVS, PKI\n* Top exits: HPQ, TSG, DLR, DKNG, ET, EPD, KMI, LHCG, CRL\n* Boosted stakes in: GRUB, WLTW, LH, BDX, LCA, CPAA, SYNH, ABBV, CRSA, DGX\n* Cut stakes in: PFE, ADSW, TIF, UBER, NVST, BAX, WMB, PPD, MEET, FREE\n\nMAVERICK CAPITAL\n\n* Top new buys: AXP, LIVN, VFC, MKC, GE, BGS, THS, GIS, CRI, FL\n* Top exits: QSR, COMM, ALKS, H, BX, GME, WING, ARMK, ORCL, LB\n* Boosted stakes in: FB, AMZN, DLTR, MSFT, LRCX, APD, ATRA, NFLX, NKTR, UBER\n* Cut stakes in: FLT, BABA, DD, CCK, STNE, PRSP, TMUS, CNC, ADBE, KKR\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: DOCU, TWLO, SE, GOOGL, AEO, LOW, NUAN, HLT, TPX, PINS\n* Top exits: TTWO, CPRT, EDU, DG, ADYEN, EFX, ADI, LKNCY, IQV, QSR\n* Boosted stakes in: FISV, AZO, BKNG, JD, PYPL, LB, AAP, MA, FICO, DPZ\n* Cut stakes in: FIS, FB, CSGP, LH, NFLX, DRI, VRSN, AMZN, EL, PLAN\n\nOAKTREE CAPITAL MANAGEMENT\n\n* Top new buys: PCG, GTH, API, SRNE\n* Top exits: CEO, SRLP, WMB, BRFS, ASRT, ORCC, PVAC, MDRIQ\n* Boosted stakes in: TMHC, AU, TSM, CX, ITUB, MELI, BIDU, AFYA, IBN, AZUL\n* Cut stakes in: BABA, BCEI, CZR, CCS, SMCI\n\nOMEGA ADVISORS\n\n* Top new buys: DNRCQ\n* Top exits: GOOGL, SSSS, TWO, GPMT\n* Boosted stakes in: COOP, JPM, FOE, GTN, MGY, SNR, SRGA, AMCX\n* Cut stakes in: VICI, GCI, FCRD, NBR, ASPU, OCN, EFC, MVC, PE, ABR\n\nNEVER MISS THE NEWS THAT MATTERS MOST\n\nZEROHEDGE DIRECTLY TO YOUR INBOX\n\n*Receive a daily recap featuring a curated list of must-read stories.*\n\nPERSHING SQUARE\n\n* Top exits: BRK/B, BX, PK\n* Boosted stakes in: QSR, LOW\n* Cut stakes in: HHC\n\nSOROBAN CAPITAL\n\n* Top new buys: RTX, CMCSA, HLT, MAR, YUM\n* Top exits: LHX, QSR, NSC\n* Boosted stakes in: BABA, SNE\n* Cut stakes in: NOC, UNP, CSX, ATUS, AMZN, MSFT\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: IGSB, SLQT, HAIN, PCG, DKNG, DRI, SPSB, BAC, MS, C\n* Top exits: XLU, WMGI, UNH, LNT, SHW, ALL, CBOE, LEN, DIS, CVE\n* Boosted stakes in: LQD, TMUS, NLOK, VICI, TDG, ARMK, BK, GS, ETFC, FOCS\n* Cut stakes in: PTON, TIF, TCO, ORCC, VST, KKR, CLVS, AVTR, ATVI, DHI\n\nSTARBOARD\n\n* Top new buys: IWM, IWR\n* Top exits: REZI\n* Boosted stakes in: MD, ACIW\n* Cut stakes in: EBAY, IWN, CERN, NLOK, CVLT, BOX, MMSI, GDOT\n\nTEMASEK HOLDINGS\n\n* Top new buys: BLK, PDD, SBUX\n* Top exits: BMRN, UNVR, RDS/B, PAGS, STNE, TOUR, FSLY, WORK\n* Boosted stakes in: BGNE, HDB, IBN, CBPO, VMW\n* Cut stakes in: BABA, FIS, VIRT, NIO, DDOG, VNET, INFO\n\nTIGER GLOBAL\n\n* Top new buys: ZI, API, DADA\n* Top exits: IQ, LVGO, BILL, STG, JCPNQ\n* Boosted stakes in: JD, AMZN, MSFT, CRWD, SPOT, PDD, DDOG, CRM, WDAY, ZM\n* Cut stakes in: ATH, SVMK, RDFN, MA, STNE, PYPL\n\nTUDOR INVESTMENT\n\n* Top new buys: ADSW, PCG, TMUS, TME, LHX, ATHM, BXMT, NFLX, ESS, EQR\n* Top exits: TIP, DEI, ABBV, FHN, KRC, GLPI, COP, PEG, LAD, MS\n* Boosted stakes in: AMTD, ETFC, GLIBA, SOXX, X, O, AAPL, UBER, CRWD, TCO\n* Cut stakes in: SPY, JAZZ, CERN, TEAM, HPQ, MCD, EA, LRCX, CUZ, PSB\n\nVIKING GLOBAL INVESTORS\n\n* Top new buys: TMO, HLT, APG, NUAN, MCO, PH, ADI, SHW, DRI, ZNTL\n* Top exits: ANTM, GOOGL, FB, NSC, ORLY, A, NOW, PGR, BMRN, AJG\n* Boosted stakes in: AXP, CMCSA, FIS, LVS, TMUS, PLAN, JPM, AON, CB, SE\n* Cut stakes in: NFLX, BSX, JD, LOW, UBER, CME, MELI, MU, CRM, CHNG\n\nWHALE ROCK CAPITAL MANAGEMENT\n\n* Top new buys: SQ, NXPI, MELI, CREE, VRM, ZI\n* Top exits: DIS, BABA, INTC, MU, MIME, ZS, ATVI, TSM, KLIC, PLAN\n* Boosted stakes in: FSLY, SHOP, DOCU, TSLA, COUP, AMZN, W, FB, OKTA, BILL\n* Cut stakes in: NOW, MSFT, NET, PTON, SMAR, FTNT, CRWD, AVLR, ZM, DDOG",
        "subreddit": "StockMarket",
        "title": "This Is What Hedge Funds Bought And Sold In The Second Quarter",
        "url": "https://www.reddit.com/r/StockMarket/comments/ib0pdh/this_is_what_hedge_funds_bought_and_sold_in_the/",
        "created": 1597641665.0
    },
    {
        "author": "wileywyatt",
        "created_utc": 1598728318,
        "id": "iiy9su",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "Hi Friends,\n\nMy Stock Portfolio has been consistently outperforming the S&amp;P 500 index by 3x, for the past 5 years.\n\n75% of my portfolio is made up of these 15 stocks:\n\n**AMZN, GOOGL, SQ, FB, WM, HD, BABA, FISV, MSFT, V, PYPL, CHGG, BIDU, TCEHY, IQ**\n\n(Listed In Order Of Descending Equity)\n\nPlease see my comment for the Pie-Chart picture link (with %s in groups), and let me know what you think!\n\nI hope this helps you strengthen your own portfolio, and I wish you all the best!",
        "subreddit": "investing",
        "title": "My Portfolio: Outperforming S&amp;P 500 By 3x, For 5 Years (See Picture).",
        "url": "https://www.reddit.com/r/investing/comments/iiy9su/my_portfolio_outperforming_sp_500_by_3x_for_5/",
        "created": 1598757118.0
    },
    {
        "author": "fairytailzz",
        "created_utc": 1598368995,
        "id": "ige901",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": " \n\n*BigCommerce merchants now have the ability to enable customer checkout directly within Instagram*\n\n[BigCommerce](https://www.bigcommerce.com/?utm_source=BusinessWire&amp;utm_medium=pressrelease&amp;utm_campaign=InstagramCheckout)  (Nasdaq: BIGC), a leading open SaaS ecommerce platform for fast-growing  and established brands, today announced the availability of [checkout on Instagram](https://business.instagram.com/shopping/checkout)  for eligible US merchants. BigCommerce merchants can be among the first  to adopt the new feature, which provides shoppers an intuitive,  seamless and secure way to purchase products they discover on Instagram  in a few clicks, without leaving the app.\n\nLeveraging  BigCommerce’s native integration with Facebook Commerce Manager,  merchants can easily connect their ecommerce storefront’s catalog to  Instagram and give customers the ability to buy from their favorite  brands directly on Instagram—rather than navigating to a brand’s website  to make a purchase—and pay using PayPal, Visa, Mastercard, American  Express or Discover. After placing an order, customers can also use the  Instagram app to view their order status, estimated delivery date and  tracking number, as well as cancel orders, initiate returns or request  additional support.\n\n\"Creating  a streamlined checkout experience is paramount for merchants looking to  social commerce to drive revenue growth. The rollout of checkout on  Instagram is another significant step in Instagram’s evolution toward  becoming an essential commerce channel for customer-focused brands,\"  said Brent Bellm, chief executive officer at BigCommerce. \"BigCommerce  is proud to be one of a select group of partners to offer their  customers access to this innovative new feature at launch.\"\n\n&amp;#x200B;\n\n[https://finance.yahoo.com/news/bigcommerce-teams-facebook-unlock-checkout-150500474.html](https://finance.yahoo.com/news/bigcommerce-teams-facebook-unlock-checkout-150500474.html)",
        "subreddit": "stocks",
        "title": "BigCommerce Teams Up with Facebook to Unlock Checkout on Instagram Feature for US Merchants",
        "url": "https://www.reddit.com/r/stocks/comments/ige901/bigcommerce_teams_up_with_facebook_to_unlock/",
        "created": 1598397795.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1596436167,
        "id": "i2s2ng",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "[https://user-images.githubusercontent.com/37036296/89143295-ef4ffd80-d4fe-11ea-86da-df74f7a53784.png](https://user-images.githubusercontent.com/37036296/89143295-ef4ffd80-d4fe-11ea-86da-df74f7a53784.png)\n\n# \n\n&amp;#x200B;\n\n# # TL;DR \n\n* 22c for the rest of the year\n* 24c 8/21 DBX\n\n&amp;#x200B;\n\n# # WSB Learns Chapter 3: The Cloud Environment\n\n&amp;#x200B;\n\n[Integrations is the name of the game](https://preview.redd.it/dub3ijst3qe51.png?width=1926&amp;format=png&amp;auto=webp&amp;s=d5195a1b92558d93a9a042370b2710d051ab8651)\n\n# # About Me\n\nI am a \n\n* \\- Mexican (jajaja)\n* \\- Software engineer \n* \\- 8 years of experience in manufacturing\n* \\- 5 years studying education policy \n* \\- 4 years avocado farming\n* \\- 2 years in financial technology\n* \\- Made 20k so far on my DDs in profile\n* \\- Chicago hustle lets go\n\nI have somewhat of an interesting background as my parents were illegal teenagers in the US and we were accustomed to make a lot happen with very little. In some ways I was privileged because I got to work with my dad in factories during an era where manufacturing technology started to change in drastic ways. It inspired me as a young pup which eventually lead me down the road of online mathematics-related education. Lucky for you, this includes game theory and finances.\n\nI write these DD's because I believe I have an enormous advantage in the current climate. I love to distribute knowledge, love the process of learning and I consider it one of my hobbies.\n\nI self-taught myself serverless and cloud computing technologies while I was in school and moved to California to pursue building my dream company in education technology. It also appears that the US is shifting toward increased Mexican trade, which I understand quite closely and have written about before.\n\nI love education and I love teaching - it is my passion. The intent here is to spur imagination and debate on the subject. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Dropbox as an Education Company\n\n[Compliance is king](https://preview.redd.it/mil0bshb4qe51.png?width=2782&amp;format=png&amp;auto=webp&amp;s=b42c5173e74ab83bd9cc38b115796a772c6d5b43)\n\nDropbox has a wonderful history introducing the masses to cloud computing applications. It solved a real file problem at the time - Apple and Microsoft files were not intuitive and there was a split in adoption. Academics of various ages needed an elegant solution and that was Dropbox. Think about that; users looked to solve a File Operating System problem using cloud computing in 2007. \n\n&amp;#x200B;\n\nDropbox is an education company. The best education technology companies are those that support the flow of education with high quality tooling rather than trying to replace it. Under this framework, I regularly invest in things like Autodesk, Adobe, and Dropbox as the companies have created an environment where IT school administrators will offer Creative Cloud, Autodesk, and Dropbox services under their student email.\n\n&amp;#x200B;\n\nIf you are familiar with the American education system, you know that this is an absurdly slow dinosaur when it comes to getting changes in motion. Technology, as a result, has to execute in rather phenomenal way to even have a chance in the education space. This is why you'll see awfully accessible and robust technology exist in the space - Windows, Macs, Chromebooks, Khan Academy, Symbolab, Dropbox, Adobe, Autodesk, Oracle, Blackboard, Canvas, etc. They are convenient tools that pay a lot of attention to things like ADA (disabilities) compliance and the like.\n\nThere is a revolution occurring in education in the form of disabilities pedagogy (the study of how to teach). Unlocking a lot of understanding in children with non-verbal autism, PTSD, and other serious learning challenges is an enormous frontier in teaching, learning, and understanding human development. \\*\\*These technologies do not get in the way and exist to assist.\\*\\*\n\n&amp;#x200B;\n\n# # Dropbox as a Technical Product\n\nThe File &amp; Storage system in any given operating system will always be critically important to a user and the need will always be larger than you can anticipate. It extends from IT safety, banking, education, supercomputing, and so on. Can you evaluate the amount of storage and data needed after Machine Learning tools have grown for 10 years? It can not be determined, but it can be anticipated. Organizations that have built their own distributed infrastructure are advantaged. One can reasonably assume that these companies will distribute the building blocks to their products. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/xu67kf179qe51.png?width=2953&amp;format=png&amp;auto=webp&amp;s=16a1ce179420a08750c5df246064f6eebdad30cc\n\n&amp;#x200B;\n\nSide note: the CEO is currently in the Board of Directors of Facebook - who is also looking into workspace applications \\*\\*SPECIFICALLY TO SOLVE LONG TERM WORK-FROM-HOME COMMUNICATIONS\\*\\*\n\n&amp;#x200B;\n\n[Workplace @ Facebook](https://preview.redd.it/vpcnvvru4qe51.png?width=3382&amp;format=png&amp;auto=webp&amp;s=46b3f6da6502c53102a73047c4b13977f3d498b1)\n\n&amp;#x200B;\n\n[Workspace @ Dropbox](https://preview.redd.it/rr462ns25qe51.png?width=1026&amp;format=png&amp;auto=webp&amp;s=cb2ba0e8e4fcc2bc24e82129bd0e209bee2d55d8)\n\n&amp;#x200B;\n\nThere is an enormous list of high-quality features that Dropbox offer due to its integration and infrastructure approach across multiple platforms:\n\n* \\- File security\n\n[banned by xi](https://preview.redd.it/mtg94ntd8qe51.png?width=1411&amp;format=png&amp;auto=webp&amp;s=7e62965952b2e9b876860beede13c106b59115f6)\n\n* \\- Signatures\n\nhttps://preview.redd.it/ewaxdbdl8qe51.png?width=2791&amp;format=png&amp;auto=webp&amp;s=ce09ff54bad22b1920a33326478f69e11171a81d\n\n* \\- Computer vision document scanning\n\n&amp;#x200B;\n\n[OCR](https://preview.redd.it/0551mtwz8qe51.png?width=2413&amp;format=png&amp;auto=webp&amp;s=22ec6a63fe1fe5935dea0d7c743ea4a202f7a393)\n\n* \\- Workspace expectations (file syncing, large file transfers, organization,IT controls)\n* \\- Link generators to leak those sweet unreleased albums through zoom [https://www.dropbox.com/s/36pz554f6ds5eyu/Uzi%20Wheezy%20Zoom.wav.m4a?dl=0](https://www.dropbox.com/s/36pz554f6ds5eyu/Uzi%20Wheezy%20Zoom.wav.m4a?dl=0)\n* \\- File embedding \n* \\- Self-built storage infrastructure\n* \\- Deep industry wide integrations ranging from Zoom to Adobe\n* \\- Deep relationships in the education sector\n* \\- An unholy amount of other file solutions\n\nhttps://preview.redd.it/hicx44ptdqe51.png?width=2547&amp;format=png&amp;auto=webp&amp;s=dc087db00260d31a49e3c33a32020848f9d91e05\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # The Compliance Advantage\n\nCloud computing is no longer a mystery, nor is it an open secret. It's a necessary supply chain tool, demanded, and growing faster than imaginations can keep up. \n\n&amp;#x200B;\n\nI work in the fintech industry. Let me tell you, compliance is everything. There is no Square, Paypal, Dropbox, Cloudflare, or any of your favorite important apps without various degrees of compliance. It would be much more helpful to view Square as an organization that distributes compliance to it's small businesses.\n\n&amp;#x200B;\n\n* \\- For Banking it's the Bank Secrecy Act and PATRIOT Act\n* \\- For Education it's FERPA\n* \\- For Healthcare it's HIPAA\n* \\- The list goes on.\n\n&amp;#x200B;\n\nSo what does this mean? It's means that mature cloud companies like Cloudflare, Dropbox, and the like are in an excellent positions to \\*\\*satisfy the legal means to continue to grow at scale\\*\\*. This is an extremely important factor to consider in the next 5 years. **Dropbox is not something people \"get\" -  it's something that they're \"given\".** For example, when I signed my name to accept my first career job - I was given Dropbox's HelloSign to do so.\n\n&amp;#x200B;\n\n[Cloud Computing Hierarchy of needs](https://preview.redd.it/s3hfokxg5qe51.png?width=2981&amp;format=png&amp;auto=webp&amp;s=9ff1c87c8db5802df55d7f4156ee9b9f2e4f23c4)\n\n[Compliance advantage in education](https://preview.redd.it/s1qhcdxj5qe51.png?width=3821&amp;format=png&amp;auto=webp&amp;s=34678980f20b163d47ec041add6defae67720038)\n\n[Another example of compliance-focused approaches](https://preview.redd.it/6nhym58n5qe51.png?width=3821&amp;format=png&amp;auto=webp&amp;s=7bc8101854eaa2a29f643f630024be629b23b9de)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # The Monopoly Problem &amp; Integrations Competitors\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1d1vs3oy5qe51.png?width=1835&amp;format=png&amp;auto=webp&amp;s=81db898c8bd65364d7b2162ede4daecd5455547e\n\n&amp;#x200B;\n\nEverybody knows it. Facebook, Google, Amazon, Apple is a monopoly cluster on data. Breaking them up is not a complex equation. Much like the death of a drug or religious cartel; there are many other viable candidates eager to steer the wheel in another direction. \n\n&amp;#x200B;\n\nIt is possible to compete against them, as evidence by organizations like Dropbox, Cloudflare, TikTok, Zoom, and the like. These smaller companies combining is what I consider the Unicorn Operating System. There opportunity is by distributing infrastructure to overwhelm larger companies that depend on acquisitions.\n\n&amp;#x200B;\n\nThis is already happening. Zoom &amp; Dropbox distribute infrastructure.\n\n[Cloud Infrastructure is critical.](https://preview.redd.it/2entdn446qe51.png?width=2668&amp;format=png&amp;auto=webp&amp;s=f486402438fd28382c109b7e3cc6c62483f99a1a)\n\n[Dropbox executing like a pioneer, similar to Paypal](https://preview.redd.it/wfli2evh6qe51.png?width=1834&amp;format=png&amp;auto=webp&amp;s=e7e0ac53777e81ff94736208493a873475eed8ef)\n\n# # Dropbox Financially\n\n&amp;#x200B;\n\nhttps://preview.redd.it/x7s08qzcdqe51.png?width=1047&amp;format=png&amp;auto=webp&amp;s=b9ad76618cd785e924f3e2203480903a9e681e0d\n\nThis part easy. They are not built on empty promises. They want to grow at a steady rate and any increased used is always welcome. Gained users has a profound affect on their financial outcomes.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/f7h5ce7teqe51.png?width=926&amp;format=png&amp;auto=webp&amp;s=6404a7ca65a1e5e61559c023951199cf5221c31d\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/89148257-237eea80-d50e-11ea-8d26-501b49ca28cc.png](https://user-images.githubusercontent.com/37036296/89148257-237eea80-d50e-11ea-8d26-501b49ca28cc.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/89148125-c7b46180-d50d-11ea-9f31-707baeeb282b.png](https://user-images.githubusercontent.com/37036296/89148125-c7b46180-d50d-11ea-9f31-707baeeb282b.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/89148177-ef0b2e80-d50d-11ea-9e97-5d24393efeaa.png](https://user-images.githubusercontent.com/37036296/89148177-ef0b2e80-d50d-11ea-9e97-5d24393efeaa.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/89148202-02b69500-d50e-11ea-8d67-f61702bb99b4.png](https://user-images.githubusercontent.com/37036296/89148202-02b69500-d50e-11ea-8d67-f61702bb99b4.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/89129403-1502e580-d4b2-11ea-86c8-4a20d4e56fe8.png](https://user-images.githubusercontent.com/37036296/89129403-1502e580-d4b2-11ea-86c8-4a20d4e56fe8.png))",
        "subreddit": "wallstreetbets",
        "title": "Dropbox DD - Education Technology &amp; Cloud Operating Systems",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2s2ng/dropbox_dd_education_technology_cloud_operating/",
        "created": 1596464967.0
    },
    {
        "author": "1053_1053_1053",
        "created_utc": 1598623066,
        "id": "ii7hfa",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Started back in early March and figured I didn’t have enough capital to get into blue chips. Was gambling on fucking biotech penny stocks, moved on to metals FD, got greedy when gold hit ATH earlier this month and lost almost everything in the crash. Learned more about options, spreads, theta plays. Clawed my way back from $450 in the past three weeks on the back of tech calls and BuYiNg ThE dIp on TQQQ then selling after a day or two.\n\nPositions:\nAAPL debit spread 9/25 500c, 505c\nPYPL debit spread 10/2 215c, 217.5c\nDKNG debit spread 10/2 37.5c, 39c\nSLV debit spread 10/2 30c, 32c\nMSFT debit spread 10/16 260c, 265c\nShares: 2 TQQQ, 6 PLUG",
        "subreddit": "wallstreetbets",
        "title": "After 6 Months I’ve Finally Unlocked Green Mode",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ii7hfa/after_6_months_ive_finally_unlocked_green_mode/",
        "created": 1598651866.0
    },
    {
        "author": "kaushizzz",
        "created_utc": 1597118453,
        "id": "i7kq23",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Hi all! I am a 29M and still in school pursuing a PhD in the USA. I have no student loans/cc debt etc.  I am living off a stipend, but I manage to put aside $600 each month to invest. I just started investing a couple of months ago and since I am not confident about what I am doing, I opened two brokerage accounts, one with Robinhood and the other with Chase. The Chase account is an “aggressive” (meaning approx. 90% stocks) portfolio account, in which the bank handles my entire portfolio and I simply put money in it every month. The RH account is, of course, handled by me. My idea is to continue this for a year or two and ultimately consolidate all my money into one account and close the other one, depending on which performs better. \n\nIn my RH account I have/planning to have the following stocks:\n\n**Technology:** GOOG, AAPL, MSFT, FB, AMZN, BABA, INTC, TSM, QCOM, NVDA\n\n**Finance:**  BAC, JPM, PYPL, BRK.B, V, AXP, C\n\n**Communications:** T, VZ\n\n**Consumer Discretionary:** PG, MCD, WMT, DIS, KO\n\n**Industrial:** BA, LMT, DAL, AER\n\n**Healthcare:** JNJ, UNH\n\nI do not plan to invest in ETFs as of now since I am young and able to take risks. Out of the $600 I am investing each month, $300 goes to my Chase investment account and $300 goes to my RH account. I am planning to DCA by investing an equal amount in each of the stock I own in RH, so I would like to own no more than 30 stocks, preferably 25.\n\nI have two questions:\n\n1) Is my strategy of having an RH account and another investing account with Chase a good one? Or should I just stick to one or the other from the get-go? Will having two investment accounts be an issue when I file my taxes?\n\n2) Does my portfolio look good? Am I well / over-diversified? Am I missing some obvious sectors? I think I might end up with way too many similar companies e.g. INTC, TSM, QCOM, and NVDA which is not really diversification. Maybe I should just pick one out of all such companies?\n\nAny other advice/comments about my portfolio are welcome. TIA!",
        "subreddit": "investing",
        "title": "Chase You Invest Portfolios account vs. Robinhood + Portfolio advice",
        "url": "https://www.reddit.com/r/investing/comments/i7kq23/chase_you_invest_portfolios_account_vs_robinhood/",
        "created": 1597147253.0
    },
    {
        "author": "creich1",
        "created_utc": 1598385143,
        "id": "igjnwt",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Looking to get into one of these two.\n\nV - stable, smaller PE, has a dividend, still seems to have room for growth\n\nPYPL - less stable, skyrocketed during COVID, no dividend, but seems like the growth potential is a lot higher given the extreme e-commerce boom. \n\nBoth seem like really solid options to me, with PayPal being the higher risk/higher reward of the two. Which would you chose?",
        "subreddit": "stocks",
        "title": "V or PYPL?",
        "url": "https://www.reddit.com/r/stocks/comments/igjnwt/v_or_pypl/",
        "created": 1598413943.0
    },
    {
        "author": "rs5-",
        "created_utc": 1597644705,
        "id": "ib8qmf",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Hey yall so it pains me to look at my recent stock growth/loss and comparing it to the s and p 500 growth etfs and it pains me to see I could’ve made more into an etf than in my Individual stocks. Should I sell all my stock and go into an etf? My current holdings are Microsoft, Facebook, Apple, Nvidia, visa paypal, jpm, dis, lmt, jnj, tdoc, a little bit in some corona based stock ( airlines, mrna ) with most of the money in lmt and Apple. I have super proud of my portfolio but it might be smarter just going into a growth etf? What do yall with having more experience suggest? I have only done stocks and stuff for like 4 months.",
        "subreddit": "stocks",
        "title": "Going through a mental crisis keep individual stocks or go into an etf",
        "url": "https://www.reddit.com/r/stocks/comments/ib8qmf/going_through_a_mental_crisis_keep_individual/",
        "created": 1597673505.0
    },
    {
        "author": "Y_Beast",
        "created_utc": 1597259531,
        "id": "i8k1rl",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Buying the RKT Dip is an Absolute No-Brainer\n\nAll you autists worried about RKT and will end up paper handing any dips need to wake up. RKT is one of the best deals on the market right now. Here's why:\n\n**RKT will undoubtedly eventually be valued as a Fintech Company.**\n\nWhy? Because it has all the core components of a fintech company. RKT at it's core is a consumer-facing, tech-based mortgage origination platform and it's productivity, Revenue per Employee, and margins are **in line if not better than fintech players**. Let's take a look:\n\n* RKT's Q1 2020 EBITDA Margin was a **blistering 44%!** Compare that other FinTechs latest EBITDA margins \n   * SHOP at negative 1.9%\n   * GWRE at 6%\n   * LMND at negative 73%!\n   * PYPL at 19%\n* RKT has an **Revenue per Employee (as of 3/31/20) figure of $300k**! Again, compare to other Fintechs, RKT is nearly the exact Median\n   * SHOP at $416k / employee\n   * GWRE at $276k / employee\n   * LMND at $251k / employee\n   * PYPL at $828k / employee\n* Now, let's look at the valuation for the other Fintechs. **RKT is very obviously undervalued compared to the segment**\n   * Enterprise Value / Revenue\n      * SHOP - 54.3x LTM Revenue\n      * GWRE - 11.7x LTM Revenue\n      * LMND - 44.3x LTM Revenue\n      * PYPL - 11.4x LTM Revenue\n      * **RKT - 2.2x LTM Revenue**\n   * P/E\n      * SHOP - N/A, negative EPS\n      * GWRE - 333x P/E\n      * LMND - N/A,negative EPS\n      * PYPL - 87x P/E\n      * **RKT - 7.7x P/E**\n\n**But, but, what about the mortgage volume? Isn't RKT exposed to interest rates and mortgage volume?**\n\nPlain and simple, there is no force that is going to stop volume right now. We can all say that fundamentals don't matter and for stock market pricing they may not. But in terms of interest rate action by the Fed, they very much do matter, and it is clear the Fed does not intend to raise rate until fundamentals truly stabilize. And if rates do come up, it will mean even J.Pow &amp; Co think inflation is getting too hot. Fuck SLV gang, **Real Estate is the ultimate anti-inflation safe-haven.** So volume should remain largely unaffected as investors seek inflation protection.\n\n**RKT continues to gain market share in an expanding market**\n\nLet's face it, eventually boomers will not be applying for new mortgages and millennials are not going to walk into Chase with a $100 fountain pen to apply for a mortgage. One of the biggest themes of the housing market today is increasing rate of home ownership among millenials. RKT's completely digitized offering positions them to capitalize on market trends. The numbers prove this as RKT's share of the total mortgage market has increased from 1.3% in 2009 to &gt;9% in the first quarter of 2020, making RKT the **largest mortgage originator in the US.**\n\n**RKT's technology drives faster, better outcomes for end consumer**\n\nRKT's application process can be understood as \"parallel\" vs. the traditional mortgage industry's \"linear\" process. This results in faster approvals and faster closing times. RKT closes loans 25% faster than the industry average - 29 days on average vs. the industry average of 40 days. Not only is this good for the end consumer (instant-gratification millennials), it means RKT's workforce is significantly more efficient than the industry average, closing average of **8.3 loans per month per team member** in YTD 2020 vs. the **industry average of 2.3 per moth per team member**\n\n**In summary, the retail mortgage industry is in desperate need of digitization. RKT is perfectly positioned to capitalize on this need.** After all, who else is going to do this? Penny-fucking-Mac?\n\nTLDR: Go long RKT, I am long shares and will continue to add on dips.",
        "subreddit": "smallstreetbets",
        "title": "RKT to 🚀",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/i8k1rl/rkt_to/",
        "created": 1597288331.0
    },
    {
        "author": "1poundbookingfee",
        "created_utc": 1596737416,
        "id": "i4wvnl",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "CEO was a dumbass for letting the \"investors\" talk him down to being a consumer finance/bank and value at 10x or whatever. This is a PYPL and should get a tech valuation of at least 69x. (Really, no balance sheet risk, sell mortgages directly to the gov while taking a 1-3% cut every time). [Here are the reasons why you should consider joining Team RKT.](https://www.reddit.com/r/wallstreetbets/comments/i4unsv/i_work_in_the_industry_rkt_with_reasons_why/)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jj9383nhaff51.png?width=1582&amp;format=png&amp;auto=webp&amp;s=aa5493d9abd71cdaf0cef7ea1be8b27c502e5da1",
        "subreddit": "wallstreetbets",
        "title": "It's not too late for team RKT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4wvnl/its_not_too_late_for_team_rkt/",
        "created": 1596766216.0
    },
    {
        "author": "i-only-buy-leaps",
        "created_utc": 1598475030,
        "id": "ih75sr",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Bought these back in Nov 19 or something like that, and rode them through the Rona while dumping TSLA, PYPL, OLLI, and ZNGA leaps at -50% to +50% because I had a weak stomach.\n\nIf only I would have doubled down at $5/contract in Feb/March.\n\nhttps://i.imgur.com/HEYbZcD.jpg\n\nI sold 1 today @ $80 to get my initial buy back and now it’s house money.",
        "subreddit": "wallstreetbets",
        "title": "300% on FB calls thanks to 💎✋",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ih75sr/300_on_fb_calls_thanks_to/",
        "created": 1598503830.0
    },
    {
        "author": "Gothlander",
        "created_utc": 1597528746,
        "id": "iagd64",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "And what do you hold? I am new to investing and want to know what I should expect for the next five years. My goal is to make more than 10% a year, so any tips would be appreciated. I currently hold AAPL, MSFT, ARKW, ESPO, EA, ATVI and SE. I just got into FB, SQ, PYPL last Friday. Im thinking of dropping ATVI and putting more into AAPL. Its been my biggest gainer.",
        "subreddit": "stocks",
        "title": "What has been your return rate the past 5 years? Excluding the March drop from this year.",
        "url": "https://www.reddit.com/r/stocks/comments/iagd64/what_has_been_your_return_rate_the_past_5_years/",
        "created": 1597557546.0
    },
    {
        "author": "chelseaboy1234",
        "created_utc": 1598855965,
        "id": "ijt3h6",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "So I really like the look of these ETFS (with there holdings inclusive aswel as fees/divs) but im split with choice.. and whether or not i’d be better of just investing in the shares myself from the uk.\n\nMale 25\n£40,000 savings looking for a decent lump for when im about 40-50 so 15-25year timeframe.\n\nSMT 0.36% fees\nTesla\nAmazon\nAlibaba\nTencent\nSpotify\nNetflix\n\nXSTC 0.12% fees 0.27% div\nApple\nMicrosoft\nV\nMA\nNvidia\nCrm\nAdbe\nPaypal\nIntc\nCsco\n\nIITU 0.15% fee \nApple\nMicrosoft\nV\nMA\nNvidia\nCrm\nAdbe\nPaypal\nIntc\nCsco\n\nCSP1 0.07% fee\nMicrosoft\nApple\nAmazon\nFb\nAlohabet\nAlphabet\nJ&amp;j\nBrk\nV\nPg\n\n\nVUSA 0.07% fee 1.51% div\nApple\nMicrosoft\nAmazon\nAlphabet\nFb\nJ&amp;j\nBrk\nPg\nV\nJPM\n\nIm thinking to dca into SMT, XSTC and VUSA\n\nWhat do you guys recommend?\nIm nt a fan of EQQQ btw either\n\nThanks",
        "subreddit": "StockMarket",
        "title": "Help me choose my etfs!! Please",
        "url": "https://www.reddit.com/r/StockMarket/comments/ijt3h6/help_me_choose_my_etfs_please/",
        "created": 1598884765.0
    },
    {
        "author": "rawrtherapy",
        "created_utc": 1596822714,
        "id": "i5ihiy",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "So let’s start by getting the metrics and actual info off this thing and compare it to SHOP\n\nMkt Cap BIGC: 5.5Bn\nMkt Cap SHOP: 126Bn\n\nTop 100k E-commerce stores.\nSHOP entails 90% of them\nBIGC entails 10%\n\nBIGC focus is actually running enterprises\n\nSHOP focus is helping people like you and me start business\n\nSHOPs biggest e-commerce store is GymShark\nThey’ve been completely open about this\n\nGYMSHARK: 2019 Revenue ~$128 Million\n\nBIGC clients are: PayPal, Gillette, Camelbak, MLB, SkullCandy\n\nSee the pattern here?\n\nBIGC is focused on enterprises ACTUALLY making money.\n\nWhere SHOP might make $1000 off one e-commerce/Year\n\nBIGC makes hundreds of thousands off one client, possibly more\n\nRight now SHOP is valued 21 times more than BIGC\n\nNo way this stays like this.\n\nBIGC makes too much money to be THIS undervalued.\n\nCurrent position is 34 shares. My deposit is going through Wed for $50k. Throwing half at BIGC and half at RKT. Then buying leaps on both when Options becomes available.\n\nCurrent Positions: I’ll update positions when my Imgur app start working properly",
        "subreddit": "wallstreetbets",
        "title": "Why BIGC is a really good play and potentially a 10x in a year or two 🚀🌕",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5ihiy/why_bigc_is_a_really_good_play_and_potentially_a/",
        "created": 1596851514.0
    },
    {
        "author": "Ric231",
        "created_utc": 1596331184,
        "id": "i23p7c",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Currently holding about 100k in PYPL stock it is basically the best stock purchase of my life. It’s currently selling for about 195 is this an obvious hold? Or is there a good reason to sell my shares asap?",
        "subreddit": "stocks",
        "title": "PYPL hold or sell?",
        "url": "https://www.reddit.com/r/stocks/comments/i23p7c/pypl_hold_or_sell/",
        "created": 1596359984.0
    },
    {
        "author": "onsite-reflexology",
        "created_utc": 1597271733,
        "id": "i8nw0u",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Dont know If this post will go through mods, but here goes.\nI will PM $20 CDN tommorow at 4PM PST to the highest rated top comment. The comment will need to include fundamental analysis in a company, that is a good investment to make in stock market right now. The comoany should have good fututure long term prospects. Along with fundamental analysis I want to know your personal throught on why the company is a sound investment in the years to come.\nFollowing cannot be included:\n- EFTs, Bonds, Mutual funds, REIT, any index fund\n- Any canadian banks\n- Disney, IBM, Coke, Pepsi (own these already)\n- Tesla, Tencent, Microsoft, \n- Any FANG companies\n \nIf top comment us a joke or a snarky remark then I will move to next highest comment.\n\n\nThe $20 cdn will be paid in your form of your choosing (Etransfer, paypal, Amazon giftcard) Dont have venmo or cash app as I am in Canada.\n\nLooking forward to read some quality analysis. \n\nGood luck.",
        "subreddit": "investing",
        "title": "Contest time: $20 to the top rated comment with fundamental analysis of single comoany",
        "url": "https://www.reddit.com/r/investing/comments/i8nw0u/contest_time_20_to_the_top_rated_comment_with/",
        "created": 1597300533.0
    },
    {
        "author": "Klutzy_Hamster",
        "created_utc": 1596269258,
        "id": "i1oopd",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "SQ vs PYPL, V vs MA, AMD vs Intel, NET vs FSLY etc.\n\nI'm still kind of going back and forth on the optimal strategy. On the one hand it seems superfluous to hold two competing companies in the same sector. Just do the DD, pick the winner and run with it. On the other hand even competitors in the same niche tend to approach the problem in different ways. What is your general feeling on holding competitors?",
        "subreddit": "stocks",
        "title": "What is your view on holding competitors long term?",
        "url": "https://www.reddit.com/r/stocks/comments/i1oopd/what_is_your_view_on_holding_competitors_long_term/",
        "created": 1596298058.0
    },
    {
        "author": "eqpofr",
        "created_utc": 1596759886,
        "id": "i53pn9",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Since everyone has been talking about investing in SQ, I thought maybe we could start an open discussion about the risks of Square the business, whether or not we can continue to expect a skyrocketing share price in the years to come.\n\nI'll point out some things I'm iffy about, would like to get feedback on what you all think. Maybe there's things I'm not aware of.\n\n* Competitors. Square has a good product in an explosive growth industry, but I see their products easily replicable by Apple, Google, and PayPal. Should their business prove to have high demand and margins, there's no doubt FAANG giants will follow. Square has a head start, but do they have a competitive advantage? They have lots of commercial business data atm, but I'm doubtful of the value of that in today's market (more on that in my next point). They're beginning to collect consumer data, but imagine how much more data Visa and Mastercard has over them on that. Their technology is easily replicable by other big companies with enough resources to execute.\n* The limitations of the loan business. One of Square's most promising competitive advantages is that they provide loans to small businesses that show promising growth and room for expansion based on their revenue and profit which is logged into the Square system. There is an undeniable market of unserved small business owners that greatly benefit from this feature, but it's doubtful that this would unleash profits that wouldn't hit a low ceiling most of the time. For example, a hair salon can only purchase so many new salon chairs before they run out of customers to serve within that vicinity. Square could strike gold with a really profitable revolutionary small business, but I don't see why those businesses wouldn't be funded by VC's first before coming to Square. Even if they came to Square first, those businesses are one in a million. I do see Square making profits here, but not profits that would take them out of a niche player role.\n* The limitations of commercial business data. With current data limitations, it's impossible for Square's current technology to be an efficient evaluator of which businesses can achieve explosive growth and which ones will never escape low margins. There are too many non-numerical variables in determining a profitable business. Data technology and AI is not there yet.\n* Personal finance inertia. For Square to disrupt the banking industry, they need some clear advantage over banks. Why should we do the extra work of switching over if we are at an established bank? I'm not saying Square wouldn't be a better option than a traditional bank, but it takes a lot to turn the tide in an industry as conservative as the banking industry.\n\nFeel free to refute any of these concerns, maybe there's something really compelling to Square that I'm not seeing. If I'm wrong, I'd love to know.",
        "subreddit": "stocks",
        "title": "Doubts about Square (SQ) if they can continue to skyrocket in the next few years, open discussion on risks and competition",
        "url": "https://www.reddit.com/r/stocks/comments/i53pn9/doubts_about_square_sq_if_they_can_continue_to/",
        "created": 1596788686.0
    },
    {
        "author": "bioknockout",
        "created_utc": 1598458439,
        "id": "ih1sos",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Could Amazon theoretically spin off AWS and Whole foods into individual companies and trade as separate tickers?\n\nWould certainly buy into AMZN knowing that I'd get different assets after a split rather than just a multiple of the stonk\n\nEbay spun out Paypal successfully after first acquiring and integrating it.\n\nThoughts?",
        "subreddit": "wallstreetbets",
        "title": "AMZN split coming anytime soon?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ih1sos/amzn_split_coming_anytime_soon/",
        "created": 1598487239.0
    },
    {
        "author": "monkey7878",
        "created_utc": 1598430031,
        "id": "igv19e",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Im thinking of creating a diversified tech portfolio, with high growth potential. Do you have any recommendations or comments? \n\nMy idea of a portfolio:\n\nSplunk 5%  \nAtlassian 10%  \nService Now 10%  \nSalesForce 10%  \nPaypal 5%  \nAdobe 5%  \nFacebook 5%  \nGoogle 5%  \nMicrosoft 5%  \nAmazon 5%  \nApple 5%  \nSquare 5%  \nNvidia 5%  \nCloud Wisdom Tree 20%",
        "subreddit": "investing",
        "title": "Rate my Super Growth Tech portfolio",
        "url": "https://www.reddit.com/r/investing/comments/igv19e/rate_my_super_growth_tech_portfolio/",
        "created": 1598458831.0
    },
    {
        "author": "sathyaw",
        "created_utc": 1597288048,
        "id": "i8s8e6",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I sold a put, PYPL strike at 210 last week. Paypal was at 205 at that point. Two analysts increased the target price of PYPL to 228. However, the stock tanked and it is today at 190.   I sold the put for $13.50 and expiration is 09/18. So as long as it stays above 196.50. I am not making a loss. There is plenty of time to climb back.  I am thinking to further increase my downside to sell a call option at strike 195 or 200. I can net a premium of $7.  That way I make the naked put a short strangle. Another option is for me to wait till close to expiration and roll down and out. Any ideas or suggestions?",
        "subreddit": "options",
        "title": "Naked Put PYPL went bad",
        "url": "https://www.reddit.com/r/options/comments/i8s8e6/naked_put_pypl_went_bad/",
        "created": 1597316848.0
    },
    {
        "author": "Mnelly56",
        "created_utc": 1596745991,
        "id": "i4zm8k",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " I have been investing in stocks for a few months now but have a hard time sitting here watching you retards throw money around and make my total returns in 5 mins. Also, is buying slightly OTM calls for a month or two out on good companies like PayPal a decent strategy? I know its not retarded enough for WSB but would like to make some money first so I have something to YOLO. Any other tips for this shit would be helpful too. I have just started trading (gambling) and seem to only lose money.",
        "subreddit": "wallstreetbets",
        "title": "Can someone explain IV crush to me?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4zm8k/can_someone_explain_iv_crush_to_me/",
        "created": 1596774791.0
    },
    {
        "author": "Cattaphract",
        "created_utc": 1597864911,
        "id": "icudxi",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "So many people on this sub have ask this question and are worried about investing into the shares.\n\nDelisting in NYSE doesn't mean the company disappears from the public trade and our shares will not become worthless. We simply have to trade them somewhere else. As a European, I don't trade on NYSE anyway. It will likely lower the trade volume of the stock in the short term.\n\n&amp;#x200B;\n\nThere is a political strategic reason why we don't need to worry too much:\n\nI don't even think USA will push this agenda too much. China wants to have large corporations to use the Shanghai stock exchange. It increases their economical and political power a lot if NYSE is not dominating the stock market but instead have an equivalent in Shanghai.            \n\nThe fintech Paypal competitor Ant Group is going to be listed in Shanghai. This is seen as a breakthrough move. Imagine all the other companies returning to the Shanghai stock exchange. Asian start-ups might also consider listing there.          \n\n\n\nAll this would just reduce US power across the globe if they throw the large chinese companies out of NYSE. China is trying to replace the Dollar and gain political and economical power. The stock exchange is just another strategic target.",
        "subreddit": "stocks",
        "title": "The threat of delisting Chinese Stock is not as bad as it seems",
        "url": "https://www.reddit.com/r/stocks/comments/icudxi/the_threat_of_delisting_chinese_stock_is_not_as/",
        "created": 1597893711.0
    },
    {
        "author": "palindromicpseudonym",
        "created_utc": 1598395499,
        "id": "igmwse",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I don’t want to use my debit card with my trading account, but I’m having a hard time verifying my PayPal account. Any alternatives?",
        "subreddit": "pennystocks",
        "title": "Does everyone here use PayPal?",
        "url": "https://www.reddit.com/r/pennystocks/comments/igmwse/does_everyone_here_use_paypal/",
        "created": 1598424299.0
    },
    {
        "author": "fairytailzz",
        "created_utc": 1598369013,
        "id": "ige981",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": " *BigCommerce merchants now have the ability to enable customer checkout directly within Instagram*\n\n[BigCommerce](https://www.bigcommerce.com/?utm_source=BusinessWire&amp;utm_medium=pressrelease&amp;utm_campaign=InstagramCheckout)   (Nasdaq: BIGC), a leading open SaaS ecommerce platform for  fast-growing  and established brands, today announced the availability  of [checkout on Instagram](https://business.instagram.com/shopping/checkout)   for eligible US merchants. BigCommerce merchants can be among the  first  to adopt the new feature, which provides shoppers an intuitive,   seamless and secure way to purchase products they discover on Instagram   in a few clicks, without leaving the app.\n\nLeveraging   BigCommerce’s native integration with Facebook Commerce Manager,   merchants can easily connect their ecommerce storefront’s catalog to   Instagram and give customers the ability to buy from their favorite   brands directly on Instagram—rather than navigating to a brand’s website   to make a purchase—and pay using PayPal, Visa, Mastercard, American   Express or Discover. After placing an order, customers can also use the   Instagram app to view their order status, estimated delivery date and   tracking number, as well as cancel orders, initiate returns or request   additional support.\n\n\"Creating  a  streamlined checkout experience is paramount for merchants looking to   social commerce to drive revenue growth. The rollout of checkout on   Instagram is another significant step in Instagram’s evolution toward   becoming an essential commerce channel for customer-focused brands,\"   said Brent Bellm, chief executive officer at BigCommerce. \"BigCommerce   is proud to be one of a select group of partners to offer their   customers access to this innovative new feature at launch.\"\n\n[https://finance.yahoo.com/news/bigcommerce-teams-facebook-unlock-checkout-150500474.html](https://finance.yahoo.com/news/bigcommerce-teams-facebook-unlock-checkout-150500474.html)",
        "subreddit": "investing",
        "title": "BigCommerce Teams Up with Facebook to Unlock Checkout on Instagram Feature for US Merchants",
        "url": "https://www.reddit.com/r/investing/comments/ige981/bigcommerce_teams_up_with_facebook_to_unlock/",
        "created": 1598397813.0
    },
    {
        "author": "WhatCoreySaw",
        "created_utc": 1597855530,
        "id": "icras0",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Which one of you just spent $37K at  GA Dodge Dealer????\n\nhope you enjoy your whatever. I'd come get it  but you're already $10k upside done in it. Sorry, wounds a little fresh right now. Heres how you buy wifes boyfriend a car, and it looks like a bunch of stuff from Wayfair(???)\n\n1) Open joint account. Why? I dunno. There was a reason. Surely.\n\n2) Divorce. Keep it clean and amicable. Have a transport truck show up at 3AM at CVS down the street. load them cars up. Oops, don't forget the dog.\n\n3) Hide in Mom's boathouse for a while. till thing blow over. Set boathouse on fire with shop light. become homeless at  - um, too old to \"become\" anything.\n\n4) Get shit together mostly. Fund old trading account.  YOLO everything, because sometimes you can't drink away all the regret.  Live in a shitty rental ($675) - drive a $2K car. Hate everybody - really get determined to lose money(AAL calls in April - WTF - switch to puts in June,\n\n5) Shower. Get a Peleton Delivered. Leave it in box. Buy online HGH and testosterone. Get first unsolicited chubby in two years. Discover through PayPal Peleton transaction that the trading account is still jointly held.\n\n6) This is the important part - reach out to ex, because ya'll are cool now and boyfriends don't have to hide in the garage anymore. Send some docs for her to sign. Wait while she orders checks and debit cards.. Get alert about unusual activity. Realize at least one of her boyfriends was smarter than you think. You lost $67k. Over a weekend. $37K of which went to a Dodge dealer.\n\nSo probably don't do joint accounts - problem is, trading on a joint account was the same stupid that enabled all my option plays. You can't make tons of money in this market. But zippers and shit are hard.",
        "subreddit": "wallstreetbets",
        "title": "Joint Account.....How to fuck it all up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icras0/joint_accounthow_to_fuck_it_all_up/",
        "created": 1597884330.0
    },
    {
        "author": "sreejith30",
        "created_utc": 1598711633,
        "id": "iitd2b",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": " Hello people of reddit!\n\nI'm a 17 year old freelance graphic designer. I make around $400-700 a month doing designing. I currently have $1400 in my moms paypal that i've earned and i have $60 in bitcoin and Ethereum respectively.  I just don't want to keep this cash idle . How do i go on about investing this whole investing thing or what could i possible do that could double the current amount i have over a period of time.",
        "subreddit": "StockMarket",
        "title": "17 year old looking for some financial advice",
        "url": "https://www.reddit.com/r/StockMarket/comments/iitd2b/17_year_old_looking_for_some_financial_advice/",
        "created": 1598740433.0
    },
    {
        "author": "MrDopple68",
        "created_utc": 1598524354,
        "id": "ihin67",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I live in the UK and Ark's ETF's aren't available to me.\n\nSo using the free trading platform Trading212 (I invest long term, I don't trade), I've tried to replicate the holdings of Ark's 5 main ETFs: K, W, F, Q and G.\n\nBut there are about 100 companies over those five ETF's, some of which have less than a 0.10% holding. I've dropped some of those lesser holdings, but I stock pick myself I also hold a few stocks that are not in Ark (such a LuLu, Doms Pizza, Visa, Disney etc). \n\nSo I'm up to 70 holdings (55 Ark,15 my picks), ranging from my top holding that is 8% of my portfolio, to the smaller more speculative holdings of about 0.5%.\n\nSometimes I think my portfolio is well diversified and 70 holdings is fine (some people just have a S&amp;P 500 or Nasdaq 100 tracker), sometimes I think I need to trim it down to about 40 to have it more concentrated, and increase my main holdings (Fangs, SQ, PayPal, Roku, Pins, Meli, and yes Tesla).\n\nOpinions please, taking into account that I don't need any money out of my portfolio for at least ten years, so although I'm the opposite of a value investor, I do believe in the Buffett way of buy and hold. I mainly DCA it and have a bit in cash for dips.\n\nSorry for the waffle! Cheers.",
        "subreddit": "StockMarket",
        "title": "Replicating ARK",
        "url": "https://www.reddit.com/r/StockMarket/comments/ihin67/replicating_ark/",
        "created": 1598553154.0
    },
    {
        "author": "AdGdy7324",
        "created_utc": 1597417170,
        "id": "i9nhjg",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So I'm not exactly sure about it. Was just swing plays obviously. Their website is apparently completely in Chinese except for the part about investors. Their way of luring in customers is good. Reminds me a little of how PayPal got so huge.. If im reading their services correctly, they also act as a middleman for loans? Anyone got any info on this?",
        "subreddit": "pennystocks",
        "title": "Never heard of HX before today",
        "url": "https://www.reddit.com/r/pennystocks/comments/i9nhjg/never_heard_of_hx_before_today/",
        "created": 1597445970.0
    },
    {
        "author": "chelseaboy1234",
        "created_utc": 1598855932,
        "id": "ijt39l",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So I really like the look of these ETFS (with there holdings inclusive aswel as fees/divs) but im split with choice.. and whether or not i’d be better of just investing in the shares myself from the uk.\n\nMale 25\n£40,000 savings looking for a decent lump for when im about 40-50 so 15-25year timeframe.\n\nSMT 0.36% fees\nTesla\nAmazon\nAlibaba\nTencent\nSpotify\nNetflix\n\nXSTC 0.12% fees 0.27% div\nApple\nMicrosoft\nV\nMA\nNvidia\nCrm\nAdbe\nPaypal\nIntc\nCsco\n\nIITU 0.15% fee \nApple\nMicrosoft\nV\nMA\nNvidia\nCrm\nAdbe\nPaypal\nIntc\nCsco\n\nCSP1 0.07% fee\nMicrosoft\nApple\nAmazon\nFb\nAlohabet\nAlphabet\nJ&amp;j\nBrk\nV\nPg\n\n\nVUSA 0.07% fee 1.51% div\nApple\nMicrosoft\nAmazon\nAlphabet\nFb\nJ&amp;j\nBrk\nPg\nV\nJPM\n\nIm thinking to dca into SMT, XSTC and VUSA\n\nWhat do you guys recommend?\nIm nt a fan of EQQQ btw either\n\nThanks",
        "subreddit": "stocks",
        "title": "What ETFs to invest uk!?",
        "url": "https://www.reddit.com/r/stocks/comments/ijt39l/what_etfs_to_invest_uk/",
        "created": 1598884732.0
    },
    {
        "author": "royalshah10",
        "created_utc": 1598664067,
        "id": "iijp0v",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "What do you guys think of square with the cash app getting more popular can they catch up to PayPals valuation ???\n\nThe CEO is good\n\nCovid did hurt there business but it will recover and it helps the small business alot \n\nIt has gone up and doubled its value but is still far away from reaching PayPal valuation \n\nI think this is one of the best growth stocks and can disrupt the banking financial sector",
        "subreddit": "stocks",
        "title": "SQ. square ⬛◻️⬜🔲",
        "url": "https://www.reddit.com/r/stocks/comments/iijp0v/sq_square/",
        "created": 1598692867.0
    },
    {
        "author": "roma_blanutsa",
        "created_utc": 1597199332,
        "id": "i85ixt",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "My friend and I just started reselling and we have this problem with running out of money. Therefore, we have to make $150+ in 2-3 days. I know how but I’d be grateful if u shared ur ideas, ways. I have $92 now on PayPal. Looking for online ways of doing that.\nAlso our reselling account on instagram @kickin.stealz",
        "subreddit": "investing",
        "title": "Running out of money",
        "url": "https://www.reddit.com/r/investing/comments/i85ixt/running_out_of_money/",
        "created": 1597228132.0
    },
    {
        "author": "binary_beatz",
        "created_utc": 1597193471,
        "id": "i840bx",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hey guys, I'm a newbie to the stock market. I have a few stocks that I've bought and made some alright profit but nothing too big. I am looking to invest about 20k now, I am thinking of Apple, PayPal, or Tesla. Just looking for some advice, I want to be smart and invest into companies that I know are only going to go up in value. Any advice would help.",
        "subreddit": "StockMarket",
        "title": "Hey guys, new to the stock market game. Looking for some advice.",
        "url": "https://www.reddit.com/r/StockMarket/comments/i840bx/hey_guys_new_to_the_stock_market_game_looking_for/",
        "created": 1597222271.0
    },
    {
        "author": "bigdoink72",
        "created_utc": 1598489419,
        "id": "ihbans",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I currently have holdings in V, PYPL, JD, SQ. \n\nI’m thinking about adding a 5th e-commerce ticker to my portfolio but i’m not sure which one.\n\nThere are many like Amazon or MercadoLibre that are great companies but they don’t have immense room to grow. \n\nAny suggestions?",
        "subreddit": "StockMarket",
        "title": "E-Commerce Choices",
        "url": "https://www.reddit.com/r/StockMarket/comments/ihbans/ecommerce_choices/",
        "created": 1598518219.0
    },
    {
        "author": "tarkshank123",
        "created_utc": 1598339419,
        "id": "ig7an8",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I won your giveaway!!! \n\nYou stated that you were giving away money to random users through a generator if RKT hit $30... &amp; it did...WOOO!!! \n\nJust wanted to say thank you for your extreme generosity and gratitude. Feels good to win $200 :)\n\nTripleBrain did paypal me the giveaway gift of $200. \n\nHopefully this becomes more common among us all. May the gains be with us all, and the love of giving back . \n\nThank you TripleBrain for starting a legacy. I will pay it forward one day!",
        "subreddit": "wallstreetbets",
        "title": "To: Redditor TripleBrain From: Autist",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ig7an8/to_redditor_triplebrain_from_autist/",
        "created": 1598368219.0
    },
    {
        "author": "welcometotheendguys",
        "created_utc": 1598462935,
        "id": "ih381j",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "There are 4 key pieces to understand why Ally Bank ($ALLY) is a massive opportunity right now. \n\n1.  Ally Bank offers an innovative disruption to traditional banks. Being all online, they can massively cut costs and use that extra money to improve their business for their customers. This can already be seen in their market leading high yield savings accounts, and in their 24 hour customer service. \n2. Ally has consistently delivered a great product and great service. All my friends who use them love them, and they've been recommended by Graham Stephan a number of times because of this.\n3. Ally's biggest competitive advantage has always been their online first business model. \n4. This business model is built perfectly for this current pandemic, and life afterwards. And we've clearly seen this already. E-commerce giants like Amazon and Shopify are up 50-100% from pre-covid highs, as are digital first fin tech companies like Square and Paypal. Essentially all internet companies have shot up during the pandemic. Except, for some reason, Ally. To date it's only recovered about 50% of it's pandemic losses, and is still well below its pre-covid highs, even though similar fin tech companies have nearly doubled their stock prices.\n\nI'm very open to discussion. Am I missing something? This seems like a stock that would've shot up with the rest of them, but it hasn't. What gives?\n\nTLDR: the market is overlooking Ally Bank and it provides a great buying opportunity.\n\n&amp;#x200B;\n\n\\*Disclaimer: I own shares in Ally",
        "subreddit": "stocks",
        "title": "Why $ALLY is the ultimate quarantine opportunity that everyone else missed",
        "url": "https://www.reddit.com/r/stocks/comments/ih381j/why_ally_is_the_ultimate_quarantine_opportunity/",
        "created": 1598491735.0
    },
    {
        "author": "rydotank",
        "created_utc": 1598917301,
        "id": "ik9dc4",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "PayPal is ripe for the picking, next tech company to soar.\n\nPE is high but what tech company sticks to those fundamentals these days?\n\nEstablished, strong financials with impressive growth rates despite travel disruption. Competitor to SQ.\n\nI have various calls with strikes between 310-400 for October and Jan 2021.\n\nDo your own homework, seeking alpha just put an article out.",
        "subreddit": "wallstreetbets",
        "title": "PayPal DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik9dc4/paypal_dd/",
        "created": 1598946101.0
    },
    {
        "author": "Instant7Classic",
        "created_utc": 1596836379,
        "id": "i5mqgh",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I've been looking to invest in fintech using an ETF similar to IPAY but listed on the TSX. \n\nI found this new ETF by Hamilton ETFs that have similar holdings. It was only released 2 months ago.\n\nhttps://hamiltonetfs.com/etf/hft/\n\nWhat do you guys think about this? Does it seem like a good idea to invest in this or am I better off investing in IPAY or visa/mastercard/paypal etc directly?",
        "subreddit": "CanadianInvestor",
        "title": "Thoughts on this new fintech tsx ETF (HFT)",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/i5mqgh/thoughts_on_this_new_fintech_tsx_etf_hft/",
        "created": 1596865179.0
    },
    {
        "author": "SnooHesitations5454",
        "created_utc": 1596903889,
        "id": "i61ws9",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "So I have 3.5k invested at the moment. Not a lot, I know. But it would be life changing to me if this increased to even just 4k by the end of this year. That said, I'm not sure if I should sell everything I have right now given the volatility of the market, or if I should continue to hold until at least elections. Currently most of my stocks are in fractional shares of microsoft, apple, google, tesla, amazon, netflix, nvidia, amd, and paypal, as well as some more riskier buys like docusign, wix, square, and shopify (before rocketing).",
        "subreddit": "investing",
        "title": "Sell or hold?",
        "url": "https://www.reddit.com/r/investing/comments/i61ws9/sell_or_hold/",
        "created": 1596932689.0
    },
    {
        "author": "1poundbookingfee",
        "created_utc": 1597938440,
        "id": "idcr6e",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "As the autismos regret not fomoing every last cent of their student loans or plasma sales into TSLA, don't forget the company that first gave Elon's (blessed be his name) [hair back](https://www.reddit.com/r/wallstreetbets/comments/ic83ar/too_late_for_tsla_dont_forget_the_first_company/). \n\nFundamentals: \n\n* Congress expected to pass stimulus next week after getting everyone back in session for the USPS vote. More consumer spending = it will go to payment processors like PYPL. \n* Look at that luscious head of hair. \n* Without PYPL, Tesla, SpaceX, Starlink,  X Æ A-12 and His Highness wouldn't even exist. \n\nCrayons:\n\n* On 15min, PYPL is about to break out of its range. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/saz0jq5nh6i51.png?width=1814&amp;format=png&amp;auto=webp&amp;s=7252ad0b33e9e3e259cb2e552fca7a233d78a456\n\n* On 4hr, this would set up to be another flag, which would take it clear to $420 (more like around $220 for a $30 extension). \n\n&amp;#x200B;\n\nhttps://preview.redd.it/tgy0ithth6i51.png?width=1824&amp;format=png&amp;auto=webp&amp;s=c32371a68cd1818055ec97715cce1e76ba219a1a\n\ninb4 Positions or ban\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w5j58mvuh6i51.png?width=502&amp;format=png&amp;auto=webp&amp;s=af9e457fbd539b548ce9eeb196fe1fcf51304112",
        "subreddit": "wallstreetbets",
        "title": "Crayons on Elon's other stock (PYPL)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idcr6e/crayons_on_elons_other_stock_pypl/",
        "created": 1597967240.0
    },
    {
        "author": "SilentPhanto",
        "created_utc": 1597688793,
        "id": "ibjrvr",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "So, I sold out my SQ call today for a profit around 55% and bought PYPL Puts with those profits. I just opened up the RH app to see what the price is and was almost given a heart attack once I saw that SQ was up by $6 up from the time I sold, this almost made me nervous to see what happened to PYPL but I'm only down by a little under 13% on my positions. Anyone have any idea what is up with the news on SQ that they are now basically giving out payday loans? I know that they are only making 60% a year on those $200 loans and those aren't higher than avg payday loans of 400-600% but still, their are more options even easier to get like credit cards with max may only get up to 27% I believe. Anyone have any idea how this innovation will change SQ?",
        "subreddit": "smallstreetbets",
        "title": "So, I feel shit about my $SQ play today",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ibjrvr/so_i_feel_shit_about_my_sq_play_today/",
        "created": 1597717593.0
    },
    {
        "author": "Inveduco",
        "created_utc": 1598061967,
        "id": "iea7h7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "This week I added PayPal to Inveduco's experimental portfolio in case you would like to check it out :) So far, the portfolio has been outperforming the S&amp;P 500 but I'm focused on long-term performance.\n\n[Inveduco's experimental portfolio](https://www.inveduco.com/2020/06/05/an-experimental-portfolio/)\n\nRon",
        "subreddit": "StockMarket",
        "title": "Any PayPal investors out there?",
        "url": "https://www.reddit.com/r/StockMarket/comments/iea7h7/any_paypal_investors_out_there/",
        "created": 1598090767.0
    },
    {
        "author": "7thAccountDontDelete",
        "created_utc": 1597221650,
        "id": "i8a6dm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Right now my current personal investing portfolio is a shitshow. My Roth IRA ridiculously outperforms it and I just want to fix it but don’t know how or where to start. I have $12.5k in it. \n\nBABA 12%\n\nGOOGL 12%\n\nSNE 11%\n\nMSFT 8%\n\nV 8%\n\nPYPL 8%\n\nKO 6%\n\nNET 6%\n\nPEP 6%\n\nPG 6%\n\nAMD 4%\n\nXOM 3%\n\nAAPL 3%\n\nJPM 3%\n\nRDSA 3%\n\nI’m 20 years old with pretty high risk tolerance. I know my portfolio is a shitshow and I spent the last 2 months doing stupid shit like meme stocks (as you can see above) and I just want to clean up. My Roth IRA is 50% ETFs and 50% apple, Microsoft, Disney, Berkshire and baba. Thanks for any help.",
        "subreddit": "investing",
        "title": "Rebalancing my portfolio help",
        "url": "https://www.reddit.com/r/investing/comments/i8a6dm/rebalancing_my_portfolio_help/",
        "created": 1597250450.0
    },
    {
        "author": "MrMiles919",
        "created_utc": 1598559787,
        "id": "ihsrux",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I added up my overall net worth and broke it down to see whether I'm appropriately balanced and diversified. I'm interested in hearing your thoughts. I'm a 37 year old attorney with no wife and no kids earning $190k/year. \n\n&amp;#x200B;\n\n* 20% Retirement (401k)\n* 22% Home Equity (condo in downtown Chicago)\n* 36% ETFs (VTI, VGT and Betterment. This is long-term savings that I don't plan to touch for a while)\n* 16% Individual stocks (with 75% of that being PYPL from my ESPP)\n* 4% Cash in savings account\n* TOTAL \\~$775k",
        "subreddit": "investing",
        "title": "Breakdown of overall net worth.",
        "url": "https://www.reddit.com/r/investing/comments/ihsrux/breakdown_of_overall_net_worth/",
        "created": 1598588587.0
    },
    {
        "author": "JayMoney2424",
        "created_utc": 1597170536,
        "id": "i7x5tp",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "?",
        "subreddit": "RobinHood",
        "title": "SQ vs PYPL which is better for the long term?",
        "url": "https://www.reddit.com/r/RobinHood/comments/i7x5tp/sq_vs_pypl_which_is_better_for_the_long_term/",
        "created": 1597199336.0
    },
    {
        "author": "SteffooM",
        "created_utc": 1596450469,
        "id": "i2umzv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Stock service for small investment (Paypal) (Europe)",
        "url": "https://www.reddit.com/r/investing/comments/i2umzv/stock_service_for_small_investment_paypal_europe/",
        "created": 1596479269.0
    },
    {
        "author": "dataqueen2020",
        "created_utc": 1596731029,
        "id": "i4uuhf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "【Top 15】Best Tech Stocks in 1 Year 2020 |nflx googl aapl pinduoduo paypal stock fb stock msft stock",
        "url": "https://www.reddit.com/r/investing/comments/i4uuhf/top_15best_tech_stocks_in_1_year_2020_nflx_googl/",
        "created": 1596759829.0
    },
    {
        "author": "MoarTarriffs",
        "created_utc": 1598051557,
        "id": "ie7jjm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Ive heard from some people that you are able to do it if you request a PayPal cash card since is backed by Wells Fargo. Ive also heard that it doesnt work and will reverse the deposit. Does anyone have any insight or first hand experience with this? Thanks.",
        "subreddit": "RobinHood",
        "title": "Can I fund my account using PayPal?",
        "url": "https://www.reddit.com/r/RobinHood/comments/ie7jjm/can_i_fund_my_account_using_paypal/",
        "created": 1598080357.0
    },
    {
        "author": "TheNextBillionaire",
        "created_utc": 1596657102,
        "id": "i4cfw3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "In this post I will outline my thoughts on why PayPal is going to moon in the next 45 days.\n\n**Bitcoin &amp; Cryptocurrency Integration**\n\nPayPal has been working towards integrating crypto into its platform. This is evident due to their blockchain job postings and letter to the EU outlining their crypto plans. Prior to this, PayPal signaled interest in crypto when they joined the LIBRA clown circus -- but they have since dropped out and are definitely formulating their own platform plans for buying and selling.\n\n[Job postings listed on August 3rd.](https://jobsearch.paypal-corp.com/search?keywords=blockchain&amp;facetcountry=&amp;location=&amp;facetcategory=)\n\n[EU Crypto Letter](https://www.scribd.com/document/469126057/PayPal-Response-to-European-Commission-on-Crypto#from_embed)\n\n**Venmo, lol**\n\nEvery thot has a venmo. With the latest social conditioning we are seeing an increased understanding of QR codes -- which are now integrated for quick transactions. In fact, CVS has announced they will begin to accept Venmo payments using this feature.\n\n[CVS Venmo Integration on August 3rd](https://www.techandgeek.com/cvs-pharmacies-will-accept-venmo-and-paypal-qr-payments-soon/)\n\n\n**Highest Quarterly Earnings Ever**\n\nQ2’20 Financial Highlights\n\n* Strongest quarterly performance in PayPal’s history\n* Revenue of $5.26 billion; growing 22% on a spot basis and 25% FXN\n\n[Earnings Report Q2'20](https://investor.paypal-corp.com/static-files/ec252376-4083-4ffd-bd50-77b43b5a5424)\n\n09/18 $270 calls are $0.37.\n\nCall me retarded, but I'm in.",
        "subreddit": "wallstreetbets",
        "title": "$PYPL going to 🚀 with latest developments",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4cfw3/pypl_going_to_with_latest_developments/",
        "created": 1596685902.0
    },
    {
        "author": "amysteriousperson001",
        "created_utc": 1598387152,
        "id": "igkbkr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Adding Roinhood as a bank to Paypal",
        "url": "https://www.reddit.com/r/RobinHood/comments/igkbkr/adding_roinhood_as_a_bank_to_paypal/",
        "created": 1598415952.0
    },
    {
        "author": "TheNextBillionaire",
        "created_utc": 1596686161,
        "id": "i4kofl",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$PYPL going to 🚀 due to latest developments",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4kofl/pypl_going_to_due_to_latest_developments/",
        "created": 1596714961.0
    },
    {
        "author": "dataqueen2020",
        "created_utc": 1596731058,
        "id": "i4uuue",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "【Top 15】Best Tech Stocks in 1 Year 2020 |nflx googl aapl pinduoduo paypal stock fb stock msft stock",
        "url": "https://www.reddit.com/r/StockMarket/comments/i4uuue/top_15best_tech_stocks_in_1_year_2020_nflx_googl/",
        "created": 1596759858.0
    },
    {
        "author": "EquivalentHandle",
        "created_utc": 1597020426,
        "id": "i6uvnm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "From $171 to $30k in less than a year (3781% gains). Special thanks to DIS/PYPL and those sweet COVID puts",
        "url": "https://i.imgur.com/uRNhb4D.png",
        "created": 1597049226.0
    },
    {
        "author": "raytoei",
        "created_utc": 1596768152,
        "id": "i55sh2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "(writing this to remind myself why i do what i do)\n\nThis year my portfolio has been whipsawed from a positive +5% in Feb to a massive swan dive in March and April  (i didn't dare look) and  -14% in May. It  turned positive in a few times in June and July. And now on 7th August, I am back to 02 Jan 2020 nos.\n\nI own 30 stocks, 10 of which comprise of 66% of the total portfolio. The next 20 stocks 15% and the reminder 19% is in Cash. I also didn't trade much, I did 11 trades, 8 of which was in Feb, and only 3 in the last few months.\n\nI started 2020 with 20% in cash, and after T-Mobile completed the transaction with Sprint, I sold it off and maintained cash between 25% and 30%. And now I am keeping around 20% cash in case I need to average down.\n\nThis year all my value stocks didn't do well. My overvalued technology stocks on the other hand, did better than expected. I also broke a rule twice, which is not to invest &gt;10% of my beginning portfolio in any stock. I did it to average down my cost on this two turnaround stocks.\n\nMy performance year to date is 0.8%. I didn't beat the S&amp;P 500 (+2.5%) but I fared better against the Dow (-5%)\n\nI really do not know what is going to happen in the next five months. Some people have suggested this is 1999 all over again ( the S&amp;P took 17 before it reached the August 1999 levels again), some have predicted gloom and doom and more people realize that Covid-19 will get worse before it gets better. \n\nMy strategy will be to employ the \\~ 20% cash onto my existing stocks. The internal debate I have right now is that I have been averaging down on my value stocks, why shouldn't I buy more of my stocks trending upwards  instead ? (To paraphrase Peter Lynch, add to winners instead of losers). I will need to think this deeply on this topic, as the answer isn't that simple as PL invested in fast growing stocks and not turn-arounds or value stocks. I also do not think it is mutually exclusive  to add to both.\n\nI have a long investing horizon.\n\nMy stocks / gain and losses since the beginning (&gt;5 years ago)\n\n    CUSIP\t\t% of portfolio\tGains/Loss \n    \t\t\t\t\n    AMZN\t\t6.39%\t\t628.66%\n    BIP\t\t0.75%\t\t67.40%\n    BPY\t\t0.56%\t\t-40.81%\n    BAM\t\t0.36%\t\t-28.11%\n    BIPC\t\t0.09%\t\t19.58%\n    BRK.B\t\t10.16%\t\t215.86%\n    CDK \t\t0.40%\t\t-21.97%\n    CPB\t\t0.49%\t\t45.21%\n    CMG\t\t1.76%\t\t269.63%\n    CRM\t\t1.03%\t\t173.41%\n    DB \t\t0.50%\t\t-52.43%\n    DIS\t\t2.46%\t\t441.90%\n    FB \t\t10.89%\t\t199.96%\n    GE\t\t10.15%\t\t-25.46%\n    JBT \t\t2.94%\t\t549.53%\n    JCI \t\t0.97%\t\t4.03%\n    JNJ\t\t0.66%\t\t134.35%\n    JPM\t\t1.93%\t\t71.64%\n    LYG\t\t0.76%\t\t-61.42%\n    MAIN\t\t0.31%\t\t-15.20%\n    MCO \t\t2.63%\t\t643.12%\n    MDLZ\t\t0.83%\t\t73.85%\n    MSFT \t\t4.29%\t\t667.34%\n    PYPL \t\t4.75%\t\t627.99%\n    RHHBY\t\t0.75%\t\t52.23%\n    SPOT\t\t0.63%\t\t85.69%\n    UL \t\t1.56%\t\t84.76%\n    WAB\t\t0.05%\t\t42.54%\n    NYSE:WFC-Q\t0.38%\t\t-3.79%\n    LON:LLOY\t11.49%\t\t-30.77%\n    Cash\t\t19.05%\t\t19.05%",
        "subreddit": "ValueInvesting",
        "title": "Half time review",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/i55sh2/half_time_review/",
        "created": 1596796952.0
    },
    {
        "author": "Avengerthe1st",
        "created_utc": 1597679951,
        "id": "ibgtoi",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I put in a lot of work into getting this together but I'm still relatively new to investing and would like to have a job in the Finance sector but I'm still in High School so I'm a little limited. Thanks for reading this far, anything is appreciated!\n\nPortfolio:\n\n6.52 shares of Microsoft (MSFT)\n4.35 shares of Apple (AAPL)\n1 share of Amazon (AMZN)\n9.64 shares of Bank of America (BAC)\n2.48 shares of Chase (JPM)\n3.10 shares of Coca-Cola (KO)\n1.2 shares of Tesla (TSLA)\n5.91 shares of Walmart (WMT)\n10.42 shares of Allstate (ALL)\n6.38 shares of PayPal (PYPL)\n5.81 shares of Draftkings (DKNG)\n4.42 shares of Adobe (ADBE)\n4.96 shares of Copart (CPRT)\n1.07 shares of MasterCard (MA)",
        "subreddit": "stocks",
        "title": "I have made a lot of updates to my portfolio after joining this community, can anyone give me any advice?",
        "url": "https://www.reddit.com/r/stocks/comments/ibgtoi/i_have_made_a_lot_of_updates_to_my_portfolio/",
        "created": 1597708751.0
    },
    {
        "author": "MrDopple68",
        "created_utc": 1597915813,
        "id": "id74ue",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Results were out this morning and disappointed the market. Down about 5%. \n\nIs anyone still bullish on them? \n\nFor those who don't know about them they are the dutch equivalent of a Square or maybe PayPal and are in a couple of Arks ETFs.",
        "subreddit": "stocks",
        "title": "Anyone have shares in Adyen?",
        "url": "https://www.reddit.com/r/stocks/comments/id74ue/anyone_have_shares_in_adyen/",
        "created": 1597944613.0
    },
    {
        "author": "SPAC_Time",
        "created_utc": 1598480613,
        "id": "ih8wen",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "First, for everyone who thought FREE was a stupid ticker, how about \"one\" as a SPAC name and stock ticker. Try to search for THAT on Google or the SEC website. CIK number is 1816613. Only way you'll find the filings, at least for now.\n\n\" On August 20, 2020, **one** (the “Company”) consummated an initial public offering (the “IPO”) of 21,500,000 units (the “Units”), including the 1,500,000 Units as a result of the underwriters’ partial exercise of their over-allotment option, at an offering price of $10.00 per Unit and a private placement with A-star (the “Sponsor”) of **3,150,000 private placement warrants at a purchase price of $2.00 per warrant** (the “Private Placement”). Each Unit consists of one Class A ordinary share, $0.0001 par value per share (the “Class A Ordinary Shares”), and one-fourth of one redeemable warrant (the “Public Warrants”), each whole Public Warrant entitling the holder thereof to purchase one Class A Ordinary Share at an exercise price of $11.50 per share, subject to adjustment. The net proceeds from the IPO, together with certain of the proceeds from the Private Placement, **$215,000,000 in the aggregate** (the “Offering Proceeds”), were placed in a trust account established for the benefit of the Company’s public shareholders and the underwriters of the IPO with Continental Stock Transfer &amp; Trust Company acting as trustee. \"\n\n**Units, each consisting of one share of Class A ordinary shares, and one Warrant to acquire one-fourth of one Class A ordinary share** \n\n**Warrants, each whole warrant exercisable for one Class A ordinary share at an exercise price of $11.50** \n\n [https://www.sec.gov/Archives/edgar/data/1816613/000110465920098653/tm2029155d1\\_8k.htm](https://www.sec.gov/Archives/edgar/data/1816613/000110465920098653/tm2029155d1_8k.htm) \n\nAudited Balance Sheet:\n\n[https://www.sec.gov/Archives/edgar/data/1816613/000110465920098653/tm2029155d1\\_ex99-1.htm](https://www.sec.gov/Archives/edgar/data/1816613/000110465920098653/tm2029155d1_ex99-1.htm)\n\nProspectus:\n\n[https://www.sec.gov/Archives/edgar/data/1816613/000110465920096906/tm2023765-13\\_424b4.htm](https://www.sec.gov/Archives/edgar/data/1816613/000110465920096906/tm2023765-13_424b4.htm) \n\n\"We intend to partner with founders, operators, and entrepreneurs to build great companies that advance the technology industry, which we refer to herein as the Innovation Economy, by offering an alternate path to the public markets.\n\n We intend to partner with founders, employees, and shareholders to provide capital and unlock liquidity in the long path to building an enduring business. We believe that our approach, which allows private companies to access the public markets without requiring an initial public offering (an “IPO”), will help facilitate the discovery and development of unique opportunities. Importantly, participation in public markets will provide capital to support expansion, recruit talent and conduct M&amp;A. \"\n\n \"**Our Founders**\n\nWe are builders. We have witnessed the emergence and expansion of the Internet as investors, operators, executives and board members. Our founders have invested in great companies at their inception and early stages including PayPal, Trulia, Airbnb, Pinterest, and Opendoor. We are also entrepreneurs, Kevin E. Hartz, our Co-Founder and Chief Executive Officer, co-founded Xoom which went public in 2013 before being acquired by PayPal in 2015, and Eventbrite which went public in 2018. Spike Lipkin, our Co-Founder, founded Newfront Insurance, a technology-enabled insurance brokerage. Troy B. Steckenrider III, our Co-Founder and Chief Financial Officer, was the first finance hire at Opendoor, a real estate platform. We are students of technology, driven by the great challenges of our time, and inspired by the great founders of this era.\"",
        "subreddit": "SPACs",
        "title": "One (ONE.U) Completes IPO",
        "url": "https://www.reddit.com/r/SPACs/comments/ih8wen/one_oneu_completes_ipo/",
        "created": 1598509413.0
    },
    {
        "author": "dataqueen2020",
        "created_utc": 1596730873,
        "id": "i4uspv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "【Top 15】Best Tech Stocks in 1 Year 2020 |nflx googl aapl pinduoduo paypal stock fb stock msft stock",
        "url": "https://www.youtube.com/watch?v=xzsieXvth4I",
        "created": 1596759673.0
    },
    {
        "author": "FeCromartie",
        "created_utc": 1598456956,
        "id": "ih1b50",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "*Holy Smokes...*\n\n$CRM absolutely crushes earnings and adds a cool **$48B** to it's market cap pushing it past $NFLX, $DIS, and others.\n\n[Source](https://assetdash.com)",
        "subreddit": "stocks",
        "title": "Salesforce is now bigger than Netlifx, PayPal, Bank of America, and Disney.",
        "url": "https://www.reddit.com/r/stocks/comments/ih1b50/salesforce_is_now_bigger_than_netlifx_paypal_bank/",
        "created": 1598485756.0
    },
    {
        "author": "-tangentially",
        "created_utc": 1597587404,
        "id": "iat20w",
        "num_comments": 242,
        "num_crossposts": 0,
        "selftext": "You’ve probably seen a rising trend of bullish posts about Nvidia recently, whether it’s about recent acquisitions being included in revenue, its management, or the semiconductor industry in general.\n\nYesterday, Evening Standard reported that $NVDA has locked in a takeover of Arm Ltd. from SoftBank for a reported 40 billion.\n\nThe reason this is important is that Arm owns instructions-set architectures (ISAs) for the chips within nearly every smartphone, along with a handful of other products. Usually, this isn’t an issue, since SoftBank would sell the rights to produce these chips to Apple, Qualcomm, and others for a fee. \n\n$NVDA, unlike SoftBank, is an actual semiconductor company. They could potentially limit access to their ISAs so that $NVDA can become the sole producer of those chips. Or, due to SoftBank being in the sinosphere and $NVDA being American, potential tensions could arise from the recent economic sanctions.\n\nEither way, considering that the deal is essentially locked in, $NVDA is flying straight to tendie town. Arm is a powerful player in the semiconductor industry, and its acquisition by $NVDA demonstrates that the company is making big moves to become more prevalent. $NVDA could theoretically lockdown a subsector of the semiconductor market by restricting access to chips under Arm’s ISA. And if the Don requests $NVDA restrict Chinese access to the ISAs, you can bet that it will get a fucking BOATLOAD of government subsidies.\n\nTL;DR $NVDA 520c 9/18",
        "subreddit": "wallstreetbets",
        "title": "$NVDA is silently becoming the next tech powerhouse.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iat20w/nvda_is_silently_becoming_the_next_tech_powerhouse/",
        "created": 1597616204.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1596694538,
        "id": "i4mgq1",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "Alright guys so I'm one of the hosts on a YouTube channel named \"Max Tech\".  \nI previously did YouTube work for the channel \"Appleinsider\" since 2016, making videos on Apple products which include Mac computers with Intel chips. \n\nI also grew up playing video games and building custom PCs right when AMD started to release six-core and 8-core processors that were cheaper than Intel CPUs and targeted towards gamers.  \n\nEven though the Intel chips were better for gaming, I still bought AMD because they were cheaper. Intel maintained the lead for many years since games really only used 4 cores, and Intel chips gave more consistent frame rates for gaming.\n\nAt one point, it was clear to me and to everyone else that Intel was intentionally holding off from innovating and improving their performance because they already owned a bulk of the market share. They realized that they could make more profit by making small improvements every year, while AMD was busting their ass trying to figure out how they can compete. (it was ultimately the gaming and custom PC market) \n\nMeanwhile.. Apple was using Intel chips quite successfully in their Mac computers the like MacBooks and iMacs. And Apple was also using their XEON chips for their higher-end machines. And of course, Intel was killing it in the server market.\n\nNow in 2013, Intel announced that they were working on their new 10nm chip process and that it should be ready to launch in 2015, and they said their 7nm chips should launch in 2017. \n\nBack to Intel, over the new few years, Intel delayed 10nm to 2016... and then to 2017.. and then to late 2019... We are now in 2020 and Intel is still shipping 14+++++ nm chips for high-end machines like the 2020 5K Apple iMac that was just released yesterday. Only laptops are getting the actual 10nm chips right now. \n\nIn 2017, AMD shocked the world by announcing their new Ryzen chips, and then also their Threadripper chips, and ever since then, they've been quickly catching up to Intel in terms of both performance and price. \n\nBecause of this, Intel instantly started lowering the price of their chips, and in 2018, they finally made 6-core chips for the MacBook Pro. 8-core chips in 2019, and now 10-core chips in 2020. This is an obvious and desperate move to try and compete with AMD. \n\nBecause Intel's 10nm chips were not ready in 2015 or 2016, Apple's redesigned 2016 MacBook Pro which was thinner than ever before, had overheating issues. The overheating was severe in 2018 with the 6-core chips that Intel made in fear of AMD. \n\nThere were even leaked emails from Intel executives worried about AMD's price to performance beating out Intel. \n\nAnd right now, it is well known that AMD is making BETTER price-to-performance x86 chips. \n\nThe MOST important part of this discussion is that the tech community as a whole, including or YouTube and Reddit, are now convinced that AMD is the way to go. I've seen countless comments on my videos that are dissing on Intel chips and wishing that Apple would switch to using Intel. \n\nIf we make a build guide video using an Intel processor, we get shamed and called dumb for not using an AMD chip. Our Mac Pro videos got a ton of negative feedback because Apple is stupid for using Intel chips. Our 2020 MacBook Pro videos were getting comments dissing on Intel's 10th-gen chips. The entire community is starting to hate Intel and preferring AMD.  \n\nAMD stock has increased over 11x since they announced the first Ryzen chips in August of 2016.  \nIntel stock has only increased 38% since that same date. \n\nAnd looking towards the future.. Intel has recently delayed their 7nm chips until late 2022 or 2023. This caused their stock price to tank at they last earnings call. \n\nThere's even now a class-action lawsuit against Intel because of this delay. \n\nThis also caused their chief of chip engineering to resign, and they reorganized their entire chip team. \n\nThey've even discussed outsourcing their future 6nm, 5nm and 3nm chip production to their rival foundry TSMC because they've lost confidence in their own foundry. \n\nSo it's clear that Intel is getting killed by AMD with each passing year, and the tech community knows it. (Which is VERY important)   \n\n\nThis brings us into the Apple and TSMC portion of this DD.   \n\n\nBack in 2013, Apple announced their A7 chip for their iPhone 5s, the first 64 bit smartphone chip, and ever since then, there was a massive performance war between Apple and Qualcomm, fighting to create the fastest smartphone chips, in which Apple ultimately won. \n\n(The A13 in the iPhone 11 Pro is still much faster than the Snapdragon 865+ which was just recently released this year) \n\nStuck in the middle of this battle was TSMC, which has been the EXCLUSIVE manufacturer of Apple Silicon chips for their iPhones and iPads since the A10 chip in 2016. \n\nAnd in 2018, Apple released their 11\" iPad Pro with the A12X chip manufactured by TSMC's 7nm process. This iPad from 2 years ago is so powerful that it still outperforms the new 2020 13\" MacBook Pro with Intel's 10th gen chip in both processor AND graphics performance. \n\nNow, Apple is about to announce their iPhone 12 in about a month that's gonna pack the A14 chip which is being built on TSMC's brand new 5nm process. \n\nAnd of course, the next iPad Pro will get a much improved A14X 5nm chip, and it's the same story for the Apple Silicon Mac chips that will start being released later this year in October/November. \n\nI'm of course, talking about Apple finally ditching Intel and moving forward with their own chips. This makes sense for Apple for various different reasons.\n\n1: They can run iPhone &amp; iPad apps on their Macs.\n\n2: They control both the software and hardware for incredibly amounts of performance optimization.\n\n3: They can make sure every new Mac update gets a new chip with performance improvements instead of relying on Intel to release improved chips. \n\n4: This is of course, much cheaper for Apple since they don't have to pay Intel the high price of their chips. \n\n5: They don't have to deal with overheating issues since most Intel chips are still on 14nm technology, therefore running very hot and using a lot of power.   \n\n\nAnd there's a good chance that the very first Apple Silicon Mac chips are gonna outperform the current Intel chips, stay much cooler and give you much better battery life. \n\nJust to give you some perspective in terms of how Intel's 10nm compares to TSMC's 5nm..\n\nIntel 10nm transistor density: around 100 million transistors per square millimeter.\n\nTSMC 5nm transistor density: around 171 million transistors per square millimeter. \n\n  \nTSMC has already confirmed that they're working on risk production of their new 3nm process in 2021,  with those chips going into 2022 iPhones, iPads and Macs. \n\nSo here's what the future looks like:\n\n  \nIntel 7nm in late 2022/2023 : 240 million transistors per square millimeter\n\nTSMC 3nm shipping in 2022 Apple products: 290 million transistors per square millimeter\n\nAnd apparently, TSMC is already working on plans for their 2nm process for 2024.   \n\n\nAnd due to Intel's past, there's a very good chance that Intel could delay 7nm even further, especially since they had to restructure their entire chip team, while TSMC has been on point.   \n\n\nSo the future isn't looking very bright for Intel's chip technology compared to TSMC. No wonder why they wanted to outsource their chips from them.   \n\n\nAnd one last bit on Apple's switch to their own chips built by TSMC. \n\nApple has already given developers their transition kit which is a Mac Mini with an A12Z chip from their iPad Pro. \n\nOne developer tweeted this: \"At this point, I think that the first gen Apple Silicon machines will be faster at running x86 code than an actual x86...\"  \n\n\nWhat he means is that Apple's new Rosetta 2 emulation software is so good that he thinks it'll outperform Intel chips even though it's not running natively for ARM. \n\nSo basically, Apple made the right choice by ditching Intel.   \n\n\nAnd if Apple proves everyone wrong by coming out with incredibly great Macs thanks to their switch to their own Apple Silicon ARM-based chips, then there's a VERY good chance that the rest of the market will follow them and start developing ARM-based chips for laptops.\n\nThis will force Windows to start heavily investing in their ARM-based Windows software. \n\nAnd if you didn't already know.. Intel is FAR behind in the ARM-based chip world.   \n\n\nNow, the most common argument I hear is this: Apple is only a tiny part of Intel's business, and while that may be true.. the MOST important thing is the public's view of Intel.  \n\n\nThe tech community is already starting to despise Intel as a brand name because of their overpriced processors and the fact that AMD is beginning to CRUSH them. \n\nJust wait until Apple Silicon Macs start getting released and people realize that ARM-chips have a ton of potential, and they'll start hating Intel even more. \n\nThis will cause Intel's brand recognition and reputation to get absolutely destroyed in favor of AMD and Apple Silicon. This alone will lead to less market share. And what will happen if Nvidia or Apple buy out ARM? \n\nAnd by the way, there are now more and more ARM-based servers popping up, so there's a good chance that Intel will start to lose market share on the server side if ARM-based servers prove themselves. (They use less power so this makes sense for server farms)\n\n&amp;#x200B;\n\nBasically, what I'm trying to say is that Intel just got ditched by Apple.. and they're getting killed by AMD and TSMC. ARM is coming VERY quickly and Intel is NOT ready. They have been plagued with delay after delay, and all of this drama will ruin the confidence of their staff, leading to lowered productivity. It's not looking good for Intel for the long-term.  \n\n\nAs of right now, Intel stock is very cheap, and you might make a few bucks if you trade short term.. but I wouldn't hold Intel stock long term.   \n\n\nIf you want more in-depth info with visuals and extra details, you can check out two videos I made on the Max Tech Youtube channel: \n\n\"How Intel Lost the CPU Race..\"\n\n\"Apple Silicon ARM Chips vs Intel x86 Processors for Mac?\"\n\nHopefully you enjoyed this DD.",
        "subreddit": "wallstreetbets",
        "title": "INTC - Why you Should NOT hold Intel stock long term!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc_why_you_should_not_hold_intel_stock_long_term/",
        "created": 1596723338.0
    },
    {
        "author": "Kokodokoe",
        "created_utc": 1596342287,
        "id": "i266ax",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "TLDR: Long AMD. AMD will hit $100 by Feb 2021.\n\nSamsung is ditching expensive Qualcom Snapdragon 875 chipset and they will be mounting Exynos 1000 chipset with AMD's RADEON GPU for the new Galaxy s21.\n\nQualcom announced their new Snapdragon 875 chipset to be at least 25% more expensive than previous generation. That is $250 phone manufactures have to pay. Smartphones are becoming more and more expensive, and most of the flagship phones cost around $1k. That price tag is too high for average Joe and this price will go higher as Qualcom increasing their chipset price.\n\nGoogle, Xiaomi, LG are all using Qualcom chipset and they will soon follow what Samsung is doing.\n\nAlso with screens getting bigger, more GPU power is needed. That's where AMD comes in with their affordable GPU. Whether Galaxy s21 success or not, CPU Chipset + GPU will be the new trend in smartphone market, and bet my ass AMD will lead market as the front runner.\n\nsources:\n\n[https://www.notebookcheck.net/Samsung-Exynos-1000-with-AMD-Radeon-GPU-rumored-to-feature-only-in-the-Galaxy-S21-Ultra-Exynos-brand-change-being-contemplated-too.483452.0.html](https://www.notebookcheck.net/Samsung-Exynos-1000-with-AMD-Radeon-GPU-rumored-to-feature-only-in-the-Galaxy-S21-Ultra-Exynos-brand-change-being-contemplated-too.483452.0.html)\n\n[https://www.digit.in/news/mobile-phones/qualcomm-snapdragon-875-price-leaked-55100.html](https://www.digit.in/news/mobile-phones/qualcomm-snapdragon-875-price-leaked-55100.html)",
        "subreddit": "wallstreetbets",
        "title": "Long AMD. New Exynos 1000 chipset will take AMD stock to THE MOON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i266ax/long_amd_new_exynos_1000_chipset_will_take_amd/",
        "created": 1596371087.0
    },
    {
        "author": "Liquicity",
        "created_utc": 1597761637,
        "id": "ic285e",
        "num_comments": 86,
        "num_crossposts": 0,
        "selftext": "After seeing a lot of baseless speculation thrown around re: lofty price targets, I figured I'd take a crack at a DD with some real numbers, now that we have 2 Qs of FY20 earnings from the companies that actually have products in the market. \n\nEV losses got you down? Exact your revenge with the mighty potato! (And [veggie straws](https://www.utzsnacks.com/collections/good-health), pretzels, and [cheesy poofs](https://www.costco.com/utz-cheese-balls%2C-35-oz.product.100442621.html) and shit). I give you [Utz](https://youtu.be/vCadcBR95oU), the largest privately-held snack food company in the US. \n\nFor all you nerdy types, here's the [P&amp;L update](http://www.colliercreekholdings.com/Cache/IRCache/d251227c-5dd1-68d8-b3e9-7d7a76b7c990.PDF?O=PDF&amp;T=&amp;Y=&amp;D=&amp;FID=d251227c-5dd1-68d8-b3e9-7d7a76b7c990&amp;iid=11139662) from August 2020 and [merger presentation](http://www.colliercreekholdings.com/Cache/IRCache/ce274f29-3753-c72c-0ba1-84dd74ae2a46.PDF?O=PDF&amp;T=&amp;Y=&amp;D=&amp;FID=ce274f29-3753-c72c-0ba1-84dd74ae2a46&amp;iid=11139662) where most of the figures used are from. \n\n**Summary (CCH)**  \nLast Close: $13.69 (nice)  \nCCH Market Cap: $770 million  \nShares Outstanding (CCH): 44 million  \n(Remaining Shares are with the founders)  \n**Institutional Holdings**: [34.2 million shares](https://www.nasdaq.com/market-activity/stocks/cch/institutional-holdings) (77.77%\\*...whoa)  \nThis is the highest inst. holding % I've seen for any SPAC, which is a big +  \n[Options?](https://media1.tenor.com/images/bf456c7fbfcbdab9a8625ec920980352/tenor.gif)  \nMerger Date: By end of Q3  \nAnnualized Dividend: $0.20\n\nUtz Implied Market Cap (CCH is 50% of Utz): $1.55 billion\n\n**Meme Power** (High)  \nUtz is 100-years old, and the #4 snack food company in the country, with Pepsi, Campbell's, Kellogg's and General Mill's rounding out the top 5. Warren Buffett tried to buy a portion in 2015 with no luck.\n\nMost people, and most importantly boomers, don't even know this shit's going live. What do you think will happen when they see that sexy ass ticker scroll by on the bottom of their screen as they eat their chips/pretzels/cheesy poofs? They'll wanna get a piece of the action of course! People love tickers that match up with company names. Don't believe me? AAPL, AMD, TSLA, JNJ, QCOM, JD, MCD...are you seeing a pattern yet? Okay not saying that this stock will become one of those, but they are some of the most well known stocks because they have easy tickers. Remember what happened to FREE? \n\n**FY20**  \nEBITDA target: $124 million  \nEBITDA achieved in Q1/2: $63.3 million (51% to target)  \nYoY Growth Target: 15%  \nQ1 YoY Growth: 39%Q2 \" \": 15%  \nAssuming only a 10% growth in the next quarter, and a flat Q4, FY20 EBITDA is \\~$137 million  \n*Bonus:* 52-week rolling sales hit $1 billion for the first time on 4/20 (nice)\n\n**Competitor Analysis and Projections**  \nThe industry median for Price to EBITDA multiple is 14.8x, which would give us an implied market cap of $2.03 billion at the end of 2020. The SP would be **$17.93.**\n\nBuT eBiTdA mUlTiPlEs ArE uSeLeSs! Fine then let's talk P/S motherfucker. The remaining top 5 industry peers and their ratios are:  \nPepsi: 2.86  \nCampbell's: 1.90  \nKellogg's: 1.78  \nGeneral Mills: 2.23\n\nUsing a conservative ratio of 1.9 gives us a valuation of $1.9 billion (duh) back in April, and a 10% growth quarter since then brings us to $2.1 billion. This gives us an implied stock price of **$18.55.** If it ever trades at 2.86, we're talking $25 + all those dividends.\n\n**What are they doing to improve?**  \nSince rona took over, 12-week tracking data showed Utz had a 24% YoY sales growth. Yup, in this economy. Campbell's ($1.25 bn annual sales) was next at 20%, and Kellogg's ($1.1 bn annual sales) lagged at 9%. Utz is ready to pass them both to claim the #2 spot behind PepsiCo.\n\nIn 2016, Utz had a 67/33 split in company-owned distribution vs privately-owned Direct-to-Store (DTS) delivery. By end of 2019, it was 23/77 going the other way. By 2021, they'll be entirely DTS, saving tons of $$$ by not operating regional distribution centers and having to pay for storage, labor, transport etc.\n\nTo put it simply, your taters (and cheesy poofs) are delivered with higher margin, supreme freshness, and with max tendies for you, [loyal call holder](https://media1.giphy.com/media/e5nATuISYAZ4Q/giphy.gif?cid=ecf05e47cubrtesskuyp9xyukhlk6g8dc7llz09cdrvg4el1&amp;rid=giphy.gif).\n\n**Chart Action/Voodoo Lines**  \n50-day SMA: $13.77  \nRSI: 50 (neutral)  \nTrendline: Holding bottom trend from July 27th (1 hr chart)\n\n**TL;DR:** Utz has been CCH-CCH-CCH-CCHugging along, and is ready to go public with a dividend off the hop. Buy shares for a safe play or throw the darts below like a true CHAD for tendies.\n\n**Positions**  \nMerger Play: 10/16 $15 Calls @ $0.60, or $17.50 calls at $0.25 (lotto)  \nBig Brain Merger Play: 10/16 $12.50/15 Call Spread @ $1 or $12.50/17.50 for $1.50  \nIntermediate-Term Play: 1/15/21 $12.50/17.50 Call Spread @ $1.55 or $15/20 @ 0.95  \nLong-Term Play: Just buy shares or warrants",
        "subreddit": "SPACs",
        "title": "UTZ (CCH), and the case for $18",
        "url": "https://www.reddit.com/r/SPACs/comments/ic285e/utz_cch_and_the_case_for_18/",
        "created": 1597790437.0
    },
    {
        "author": "farting_tomato",
        "created_utc": 1597612865,
        "id": "ib0pdh",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": " [https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter](https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter)\n\nTL;DR\n\nADAGE CAPITAL PARTNERS\n\n* Top new buys: RPRX, ABBV, W, HZNP, FIVE, ST, CCK, TRV, USB, JCI\n* Top exits: BMY, GILD, ETN, PNC, MAS, EXC, AON, CCMP, NI, CX\n* Boosted stakes in: BURL, PYPL, FTV, ITT, LOW, GOOGL, TMUS, EYE, AZO, BMRN\n* Cut stakes in: LMT, JNJ, PFE, HON, VZ, VRTX, TGT, VMC, PXD, LLY\n\nAPPALOOSA\n\n* Top new buys: T, V, MA, PYPL, DIS, SYY, EMR, MO, SQ, TEN\n* Top exits: INTEQ, XLU, BKLN\n* Boosted stakes in: TMUS, BABA, MU, HCA, MSFT, BSX, TWTR, WFC, CRM, GT\n* Cut stakes in: PCG, UNH, TSLA, HUM, VST, AMLP, AVGO, NFLX, QCOM, ADBE\n\nBALYASNY ASSET MANAGEMENT\n\n* Top new buys: SCHW, ABT, TGT, HD, ADBE, SHOP, ITW, COST, C\n* Top exits: JCI, AMTD, INTC, CHTR, KR, TMUS, TTWO, NVDA, ICE, ROST\n* Boosted stakes in: PYPL, FISV, BABA, JPM, FLT, NSC, LITE, DKS, QCOM, LHX\n* Cut stakes in: BSX, LOW, DG, FIS, ABBV, BAX, INTU, JD, BK, ETFC\n\nBAUPOST GROUP\n\n* Top new buys: HCA, VRNT, VTR, SSNC\n* Top exits: LNG, ET, XPO, SPR, CARS\n* Boosted stakes in: LBTYK, TBIO, QRVO, ATRA, HDS\n* Cut stakes in: FB, GOOG, PCG, UNVR, ABC, HPQ, CLNY, VIST, AKBA\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: GOLD\n* Top exits: DAL, LUV, UAL, AAL, QSR, GS, OXY\n* Boosted stakes in: STOR, KR, SU\n* Cut stakes in: WFC, JPM, SIRI, PNC, MTB, BK, MA, V, CHTR, USB\n\nBRIDGEWATER ASSOCIATES\n\n* Top new buys: UPS, ZLAB, CSX, ECL, TT, RNG, PAYC, ROP, GWW, FICO\n* Top exits: TLT, HYG, EMB, RY, TD, TIP, CNI, BNS, TRP, BCE\n* Boosted stakes in: SPY, GLD, IVV, FXI, BABA, MCHI, IAU, JD, PDD, VEA\n* Cut stakes in: EWZ, LQD, INDA, EWY, EEM, IEMG, VWO, EWW, BAM, EWT\n\nCOATUE MANAGEMENT\n\n* Top new buys: BA, DOCU, INO, DXCM, WYNN, HWM, LYV, ALGN, TDG, DHT\n* Top exits: RNG, SNAP, BYND, LKNCY, GLUU, ISRG, CGC, STNE, MCD, VGK\n* Boosted stakes in: DIS, PYPL, ZM, SQ, CRWD, PTON, LRCX, SHOP, MU, PODD\n* Cut stakes in: MSFT, LBRDK, BABA, TWTR, JD, NKE, GPN, CREE, GH, NFLX\n\nCORSAIR CAPITAL MANAGEMENT\n\n* Top new buys: IWO, IWM, WMB, NATR, MFIN\n* Top exits: LAUR, RHP, ECPG, ATKR, NMRK, TROX, KRA, FSK, HHC, SATS\n* Boosted stakes in: VRT, WSC, GDDY, CC, BH, BBCP, METC, BRK/B\n* Cut stakes in: HGV, HMHC, FMC, NWSA, REPH, GOOG, CHDN, C, CUBI, PLYA\n\nCORVEX MANAGEMENT\n\n* Top new buys: TMUS, EXC, EVRG, CMCSA, JPM, IAA, TIF, LYV, PCG\n* Top exits: ZEN, CRM, FANG, UNP, VMC, MPC, UNH, ANTM, SPY\n* Boosted stakes in: MGM, GLD, BABA, CNP, NFLX, HUM, CNC, MSGS\n* Cut stakes in: ADBE, ATUS, ATVI, AMZN\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: JPM, AVB, EXPE, TGT, DEI, AAP, ESS, CVNA, SMAR, PNC\n* Top exits: LIN, GWRE, TME, NKE, UNH, BAC, PDD, DHI, INMD\n* Boosted stakes in: BABA, USB, JD, LVS, MSFT, HPP, KRC, CCC, LYV, HLT\n* Cut stakes in: NFLX, FB, AMZN, DIS, RACE, ORLY, PPD, AZO, SBUX, GOOGL\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: TMUS, JPM, XBI, SBUX, BKNG, SMAR, CCL, WFC, LYV, CB\n* Top exits: ABT, QCOM, NOW, ADBE, INDA, COUP, TWOU, EDU, SNE, TWLO\n* Boosted stakes in: MSFT, JD, FCX, FSLY, BABA, CRWD, RETA, PLAN, FLEX\n* Cut stakes in: NFLX, FB, AMZN, WDAY, ATVI, GOOGL, GE, IQV, FIS, DISH\n\nELLIOTT MANAGEMENT\n\n* Top new buys: WELL, FSCT\n* Top exits: LQD, RRTS, ESI, HYG, XOP, NEWR, CSOD, NTNX, CNHI, EGHT\n* Boosted stakes in: DELL, TWTR, RYAAY\n\nENGAGED CAPITAL\n\n* Top new buys: JACK, MGLN, SMPL, IWM\n* Top exits: APOG\n* Boosted stakes in: STKL, NCR\n* Cut stakes in: HAIN\n\nFIR TREE\n\n* Top new buys: SQ, LYV, PS, SNAP, VG, EIX, SABR, EXPE, J, PCPL\n* Top exits: FLT, FPAC, BKNG, SHLL, CCH, GOOG, APXT, OAC, DMS, EXPC\n* Boosted stakes in: CNC, CTXS\n* Cut stakes in: DIS, MSFT, TMUS, LAUR, ANTM, DELL, EXC, CMCSA, SLM, TRNE\n\nGREENLIGHT CAPITAL\n\n* Top new buys: GDX, AAWW, TECK, REZI, JACK, GLD, APG, TPX, SATS, WHR\n* Top exits: ATUS, ADNT, CNC, MO, PAYX, AXP, GS, DHR, BRK/B, DIS\n* Boosted stakes in: AER, CHNG, NBSE, GPOR\n* Cut stakes in: CNX, XELA, CC\n\nICAHN\n\n* Top exits: HPQ, HTZ, FCX\n* Boosted stakes in: IEP, LNG, TEN\n* Cut stakes in: CLDR\n\nIMPALA ASSET MANAGEMENT\n\n* Top new buys: LAD, DRI, NSC, HES, CMI, VAC, TOL, ADNT, DOOO, MU\n* Top exits: MSFT, PCAR, CSX, KBH, VMC, MA, AMZN, FDX, EXP\n* Boosted stakes in: HOG, RIO, AAWW, FUN, WYNN, UFI\n* Cut stakes in: TGT, QCOM, KSU, SBLK, TTWO, SIX, KNX, TCKRF, NVR, TECK\n\nJANA PARTNERS\n\n* Top exits: NEWR, JACK\n* Boosted stakes in: PRSP, SPY\n* Cut stakes in: AXTA, HDS, HI, BLMN, ELY, CAG\n\nLAKEWOOD CAPITAL MANAGEMENT\n\n* Top new buys: HDS, CRL, LBTYK, LBTYA, UE, CDK, NKLA, ABG, CROX, SHAK\n* Top exits: WUBA, AMZN, ICE, FNF, TWO, YY, RNR, TPR, WW, REAL\n* Boosted stakes in: FAF, BABA, ANTM, AXS, BIDU, BHC, HCA, SKX, C, ACGL\n* Cut stakes in: GOOGL, CI, FB, MA, DELL, GS, AGNC, APO, CMCSA, BC\n\nLANSDOWNE\n\n* Top new buys: C, VMC, LUV, ED, FCX, RYAAY, AES, COG, TMUS, BKNG\n* Top exits: DHT, NKLA, AGI, TT, IQ, BABA\n* Boosted stakes in: MU\n* Cut stakes in: UAL, DAL, FSLR, GE, ETN, ADI, REGI, LRCX, TSM, SMMT\n\nLONG POND\n\n* Top new buys: PEAK, LVS, DEI, EQR, SHO, WELL, SEAS, UDR, INVH, MAR\n* Top exits: H, DHI, VNO, PEB, PGRE, MGM, VAC, RRR, JLL, CUZ\n* Boosted stakes in: CPT, AVB, MAA, AIV, HLT, ESS, FR, KRC, JBGS\n* Cut stakes in: WH, HGV, RHP, HPP, SBRA\n\nMAGNETAR FINANCIAL\n\n* Top new buys: ADCT, NVS, PKI\n* Top exits: HPQ, TSG, DLR, DKNG, ET, EPD, KMI, LHCG, CRL\n* Boosted stakes in: GRUB, WLTW, LH, BDX, LCA, CPAA, SYNH, ABBV, CRSA, DGX\n* Cut stakes in: PFE, ADSW, TIF, UBER, NVST, BAX, WMB, PPD, MEET, FREE\n\nMAVERICK CAPITAL\n\n* Top new buys: AXP, LIVN, VFC, MKC, GE, BGS, THS, GIS, CRI, FL\n* Top exits: QSR, COMM, ALKS, H, BX, GME, WING, ARMK, ORCL, LB\n* Boosted stakes in: FB, AMZN, DLTR, MSFT, LRCX, APD, ATRA, NFLX, NKTR, UBER\n* Cut stakes in: FLT, BABA, DD, CCK, STNE, PRSP, TMUS, CNC, ADBE, KKR\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: DOCU, TWLO, SE, GOOGL, AEO, LOW, NUAN, HLT, TPX, PINS\n* Top exits: TTWO, CPRT, EDU, DG, ADYEN, EFX, ADI, LKNCY, IQV, QSR\n* Boosted stakes in: FISV, AZO, BKNG, JD, PYPL, LB, AAP, MA, FICO, DPZ\n* Cut stakes in: FIS, FB, CSGP, LH, NFLX, DRI, VRSN, AMZN, EL, PLAN\n\nOAKTREE CAPITAL MANAGEMENT\n\n* Top new buys: PCG, GTH, API, SRNE\n* Top exits: CEO, SRLP, WMB, BRFS, ASRT, ORCC, PVAC, MDRIQ\n* Boosted stakes in: TMHC, AU, TSM, CX, ITUB, MELI, BIDU, AFYA, IBN, AZUL\n* Cut stakes in: BABA, BCEI, CZR, CCS, SMCI\n\nOMEGA ADVISORS\n\n* Top new buys: DNRCQ\n* Top exits: GOOGL, SSSS, TWO, GPMT\n* Boosted stakes in: COOP, JPM, FOE, GTN, MGY, SNR, SRGA, AMCX\n* Cut stakes in: VICI, GCI, FCRD, NBR, ASPU, OCN, EFC, MVC, PE, ABR\n\nNEVER MISS THE NEWS THAT MATTERS MOST\n\nZEROHEDGE DIRECTLY TO YOUR INBOX\n\n*Receive a daily recap featuring a curated list of must-read stories.*\n\nPERSHING SQUARE\n\n* Top exits: BRK/B, BX, PK\n* Boosted stakes in: QSR, LOW\n* Cut stakes in: HHC\n\nSOROBAN CAPITAL\n\n* Top new buys: RTX, CMCSA, HLT, MAR, YUM\n* Top exits: LHX, QSR, NSC\n* Boosted stakes in: BABA, SNE\n* Cut stakes in: NOC, UNP, CSX, ATUS, AMZN, MSFT\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: IGSB, SLQT, HAIN, PCG, DKNG, DRI, SPSB, BAC, MS, C\n* Top exits: XLU, WMGI, UNH, LNT, SHW, ALL, CBOE, LEN, DIS, CVE\n* Boosted stakes in: LQD, TMUS, NLOK, VICI, TDG, ARMK, BK, GS, ETFC, FOCS\n* Cut stakes in: PTON, TIF, TCO, ORCC, VST, KKR, CLVS, AVTR, ATVI, DHI\n\nSTARBOARD\n\n* Top new buys: IWM, IWR\n* Top exits: REZI\n* Boosted stakes in: MD, ACIW\n* Cut stakes in: EBAY, IWN, CERN, NLOK, CVLT, BOX, MMSI, GDOT\n\nTEMASEK HOLDINGS\n\n* Top new buys: BLK, PDD, SBUX\n* Top exits: BMRN, UNVR, RDS/B, PAGS, STNE, TOUR, FSLY, WORK\n* Boosted stakes in: BGNE, HDB, IBN, CBPO, VMW\n* Cut stakes in: BABA, FIS, VIRT, NIO, DDOG, VNET, INFO\n\nTIGER GLOBAL\n\n* Top new buys: ZI, API, DADA\n* Top exits: IQ, LVGO, BILL, STG, JCPNQ\n* Boosted stakes in: JD, AMZN, MSFT, CRWD, SPOT, PDD, DDOG, CRM, WDAY, ZM\n* Cut stakes in: ATH, SVMK, RDFN, MA, STNE, PYPL\n\nTUDOR INVESTMENT\n\n* Top new buys: ADSW, PCG, TMUS, TME, LHX, ATHM, BXMT, NFLX, ESS, EQR\n* Top exits: TIP, DEI, ABBV, FHN, KRC, GLPI, COP, PEG, LAD, MS\n* Boosted stakes in: AMTD, ETFC, GLIBA, SOXX, X, O, AAPL, UBER, CRWD, TCO\n* Cut stakes in: SPY, JAZZ, CERN, TEAM, HPQ, MCD, EA, LRCX, CUZ, PSB\n\nVIKING GLOBAL INVESTORS\n\n* Top new buys: TMO, HLT, APG, NUAN, MCO, PH, ADI, SHW, DRI, ZNTL\n* Top exits: ANTM, GOOGL, FB, NSC, ORLY, A, NOW, PGR, BMRN, AJG\n* Boosted stakes in: AXP, CMCSA, FIS, LVS, TMUS, PLAN, JPM, AON, CB, SE\n* Cut stakes in: NFLX, BSX, JD, LOW, UBER, CME, MELI, MU, CRM, CHNG\n\nWHALE ROCK CAPITAL MANAGEMENT\n\n* Top new buys: SQ, NXPI, MELI, CREE, VRM, ZI\n* Top exits: DIS, BABA, INTC, MU, MIME, ZS, ATVI, TSM, KLIC, PLAN\n* Boosted stakes in: FSLY, SHOP, DOCU, TSLA, COUP, AMZN, W, FB, OKTA, BILL\n* Cut stakes in: NOW, MSFT, NET, PTON, SMAR, FTNT, CRWD, AVLR, ZM, DDOG",
        "subreddit": "StockMarket",
        "title": "This Is What Hedge Funds Bought And Sold In The Second Quarter",
        "url": "https://www.reddit.com/r/StockMarket/comments/ib0pdh/this_is_what_hedge_funds_bought_and_sold_in_the/",
        "created": 1597641665.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1596820991,
        "id": "i5hybj",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "Hey guys, I'm back from my last DD: [https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc\\_why\\_you\\_should\\_not\\_hold\\_intel\\_stock\\_long\\_term/?utm\\_source=share&amp;utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc_why_you_should_not_hold_intel_stock_long_term/?utm_source=share&amp;utm_medium=web2x)  \n\n\nI'll try and make this one a bit shorter.   \n\n\nVadim Yuryev here from the YouTube channel Max Tech.  \nI've been covering a lot of Apple products and Macs for the last 4 years ever since I started working for Appleinsider. \n\nAs you all know, Apple has recently announced that they're switching to their own custom Apple Silicon Mac chips, which will of course be built exclusively by TSMC on their brand new 5nm process (World's first)\n\nWhat most people don't know is that they've been working toward this transition for many years. For example, in 2017, they dropped 32 bit app support for iOS 11. In 2018, their macOS Mojave forced developers to use their Metal framework (That's why Nvidia cards don't work anymore in eGPUs) In 2019, macOS Catalina dropped support for 32 bit apps.\n\nThese 3 steps are incredibly important to the Apple Silicon Macs coming this Fall because one of the most important features is the ability to run completely unmodified iPhone and iPad apps on day 1, which of course, are 64 bit apps that run using the Metal framework on the current Apple Silicon chips. manufactured by TSMC. \n\nBecause of this, the transition from Intel to Apple Silicon chips is gonna be much more smooth compared to the previous transition from PowerPC to Intel chips. \n\nA major benefit for the future is that app developers can build apps that have most of the code shared across all Apple devices, which minor adjustments to get the UI to scale properly from the Mac, to the iPad, to the iPhone and of course the Apple TV.\n\nAnd a huge benefit will be the ability to fix bugs and optimize code for all platforms at once instead of having to do it all separately since the main code is shared.\n\nAnd unlike the last transition, Rosetta 2 can now translate x86 app code into ARM-supported code during the install time instead of using real-time emulation. And for plugins and drivers, Rosetta 2 emulates them as well.\n\nDevelopers who have been using Apple's Developer Transition Kit with the A12Z chip from the iPad Pro have already mentioned that Rosetta 2 works incredibly well, much better than expected:  \n[https://twitter.com/yiningkarlli/status/1278897047324602369?s=20](https://twitter.com/yiningkarlli/status/1278897047324602369?s=20)\n\n[https://twitter.com/never\\_released/status/1288658469827104769?s=20](https://twitter.com/never_released/status/1288658469827104769?s=20)\n\nAnd this is with the A12Z chip, which mind you, hasn't changed in terms of processing performance from the A12X chip from 2018. This is also a chip that comes in an iPad Pro that is thinner than any iPhone ever, and has absolutely zero active cooling. \n\nThat chip from 2018 currently outperforms Intel's brand new 10th-gen 10nm chip that came in the 2020 MacBook Pro in terms of both processing and Metal graphics performance.\n\nApple Silicon Macs will of course, have active fan cooling, and Apple has already stated that their Apple Silicon chips for their Macs will be a brand new family of chips, and each Mac will have a chip built specifically for it's enclosure and it's cooling capabilities.\n\nAnd Apple has mentioned that their Silicon has been built for years with easy scalability in mind, so they can add much more cores into the new Mac chips, especially since they'll have active fan cooling. \n\nBecause of the pandemic, Apple's original plans to release a new iPad Pro this Fall with the brand new A14X chip built on TSMC's new 5nm process and a new Mini-LED display were delayed, so that's why the released the 2020 iPad Pro in March, where they basically reused the A12X chip and rebranded it.\n\nSo right now, most investors have no idea how good the A14X is gonna be.\n\nThe A13 chip from last year's iPhones already performs incredibly well in terms of single-core performance, almost neck and neck with Intel's i9-9900K.\n\nThe new A14 chip will be a major improvement, due to being the first chip built on TSMC's 5nm chip.\n\nThere will also be an A14X chip will have a massive improvement over the current A12Z chip, and let me remind you that it will be in an iPad Pro that's thin and passively cooled.\n\nThis same 5nm technology is gonna be scaled up to fit active cooled Apple Silicon Mac computers, first coming into MacBooks like the MacBook Air and the 13\" MacBook Pro, and then into the redesigned 24\" iMac. \n\nOne of the first rumored chips will be a 12-core 5nm chip built by TSMC with 8 high performance cores and 4 efficiency cores. This will likely go into the MacBook Pro. \n\nI'm almost certain that it will outperform the previous Intel-based MacBook Pros in every way. And on top of that, the new Apple Silicon chips will come with Apple's Neural engine and machine learnings accelerations. Along with that, they'll get the same HEVC hardware accelerators as well, which is now becoming the standard for video recording. \n\nBasically, the point of all of this is that TSMC's new 5nm chips that will come in the Apple Silicon Macs are gonna be much faster than anyone is expecting, and those first Macs are rumored to be coming this October or November. \n\nThese chips will shake the entire industry due to the vast performance per watt improvements and the way Apple is gonna use them in terms of their Apple devices sharing the same code. \n\nAnd if Apple succeeds in this transition, there's a very good chance that the rest of the industry will start slowly switching to ARM-based chips, which TSMC is the leader in. (Intel is way behind in ARM chip technology)\n\nBecause of this, TSMC will be confirmed as the leader in chip-making technology, and investors will jump onboard.\n\nTheir main advantage is that they're the first to 5nm, and Samsung is currently having trouble with their 5nm process. Their Note 20 Ultra isn't launching with 5nm chips like people expected.  \n\"A new [report](https://www.zhitongcaijing.com/content/detail/324146.html) out of China (via [*GizmoChina*](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)), however, suggests Samsung may have lost most, if not all, of that business to Taiwanese rival TSMC\"\n\n[https://www.androidcentral.com/qualcomm-reportedly-choose-tsmc-over-samsung-its-upcoming-snapdragon-875](https://www.androidcentral.com/qualcomm-reportedly-choose-tsmc-over-samsung-its-upcoming-snapdragon-875)\n\nSo Samsung is having trouble. Intel is having trouble, ordering wafers from TSMC. AMD is ordering wafers from TSMC. Qualcomm is ordering wafers from TSMC.\n\nTSMC is now becoming the Sony of the chip-making world. (Sony owns the camera sensor market by such a vast margin that a TON of cameras come with Sony sensors)\n\nWhat if TSMC becomes the next Sony and more companies rely on them for chips instead of investing into their own chip technology? \n\nSummary: Buy Long calls. Especially while the whole market is having a down day today. Buy the dip!\n\nPositions: TSM $100c 1/15/21",
        "subreddit": "wallstreetbets",
        "title": "$TSM - Why you should Buy LONG Calls! (Future leader in Silicon Chips)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5hybj/tsm_why_you_should_buy_long_calls_future_leader/",
        "created": 1596849791.0
    },
    {
        "author": "ld_southfl",
        "created_utc": 1596389099,
        "id": "i2fue2",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Microchip is a semiconductor company out of Arizona with a Mkt. Cap of about $26 Billion. They make chips for a bunch of products like Cyber Security, Wireless Products, and Telecommunications. The thing is that they earnings on 08/04 Tuesday after hours. It is very obvious that are going to beat earnings. Why? Because look at the rest of the industry: Qualcomm, Intel, AMD, Qorvo, and IBM have all destroyed earnings. And since Intel just told everyone that they're too retarded to even make potato chips all the smaller time semiconductor competitors are making bank, example: AMD and QCOM. \n\n&amp;#x200B;\n\nMicrochip isn't just your run of the mill small back water company. They actually make acquisitions of other chip companies and use their intellectual property to increase the quality and market share of their own chips. Microchip was found in 1989 and has since made 16 acquistions!!! \n\nYou may, for some reason, say that only big boy chip companies are gonna beat earnings. Well if you don't believe me think about the industries that depend on Microchip for their needs: online educational servicing companies, cloud servicing companies, cyber security companies, telecommunications companies, and just software/tech companies in general. What the hell do we already know about these industries from earnings season? We know they absolutely massacred earnings estimates as everything during COVID has gone tech. Yes, the age of actual industry is dead. Now there are only tech companies that get pumped because of sky high demand (looking at you Apple) and Amazon that sells random shit and still has a tech company valuation.\n\n&amp;#x200B;\n\nOh and you know what's awesome because we have all this knowledge? MCHP is expected to post $1.43 EPS on tuesday, but last year on this quarter they posted $1.41 EPS. What a fucking joke, we should expect at least 40-50% growth in that number from COVID induced semiconductor demand. Not to mention, I think MCHP is gaining market share and could be a big player in a few years in the semiconductor industry. \n\nYou might be hesitant because of my last post on $TER, a chip supplier that many people played incorrectly. I say to you, fuck you. I made money on that play because I sold directly at market open after they destroyed earnings like my data said they would. So if you feel even the slightest FOMO look at these charts from last week: QCOM, QRVO, and AMD; and then tell me what you think MCHP (the same industry) will do!!!\n\n&amp;#x200B;\n\nTLDR; MCHP $107c 08/07",
        "subreddit": "wallstreetbets",
        "title": "$MCHP is the next $QCOM, 300% gain potential after earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2fue2/mchp_is_the_next_qcom_300_gain_potential_after/",
        "created": 1596417899.0
    },
    {
        "author": "ntrsfrml",
        "created_utc": 1597996867,
        "id": "idso14",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "What are some of your best, long term, Non-Tech stocks to balance out a heavy tech portfolio.\n\nMajority of my portfolio is AAPL, MSFT, TEC.TO, TSMC and QCOM",
        "subreddit": "CanadianInvestor",
        "title": "Best Canadian / US Non-Tech stocks",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/idso14/best_canadian_us_nontech_stocks/",
        "created": 1598025667.0
    },
    {
        "author": "indonesian_activist",
        "created_utc": 1596415307,
        "id": "i2nbht",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "**Previous Posts**\n\n[https://www.reddit.com/r/wallstreetbets/comments/hx46k9/geopolitik\\_trumps\\_earnings\\_zombie\\_markets\\_part\\_vii/](https://www.reddit.com/r/wallstreetbets/comments/hx46k9/geopolitik_trumps_earnings_zombie_markets_part_vii/)\n\n**Last week Positions**\n\n&gt;SPY SELL 325C 7/31  \n&gt;  \n&gt;SPY BUY 330C 7/31\n\nWell, I think most of us managed to got out before 1 PM when it was already down to 0.02, Insane move by AAPL, never seen anything like it in decades.\n\n[https://ibb.co/GTdSXgR](https://ibb.co/GTdSXgR)\n\nSharing the image to highlight I didn't just threw darts on a map when I chose last week strike. You could've exited anytime on Friday for a profit except the last 15 mins of trading.  AAPL stock split enthusiasm and tiktok buyout rumors by MSFT(now canned) drove it past 325 eclipsing the stimulus paycheck pause\n\nLooking into next week, again for the SPY we need to think in terms of Geopolitik Say AMZN struck a deal in South Asia and MENA regions, they're set to dominate the ecommerce market there, oh just one problem. all the goods from vietnam / US can't get there because the South China Sea is being blockaded. Or GOOG invents an improvement to instant results, ie Mind Results, results pop up on your android even before you type anything, and it works on 50 different languages. Whoops won't matter if they are banned in Asia due to US loosing allies over there. Tiktok case is the reverse example of this.\n\nWho makes the most money ultimately comes down to who have MORE GUNS(and wins wars),  we will see how this play out over the next few months along with the rona pandemic. It's been this way for thousands of years ever since Roman times. This view is also echoed by the world's biggest Hedge Funds.\n\n***\"Ray Dalio's, chairman of Bridgewater capital(160B AUM) 2nd article on Geopolitics\"***\n\n[https://www.linkedin.com/pulse/big-cycle-united-states-dollar-part-2-ray-dalio/](https://www.linkedin.com/pulse/big-cycle-united-states-dollar-part-2-ray-dalio/)\n\n&gt;Governance between countries is very different from governance within countries.  That is because within countries there are laws and standards of behavior that govern, whereas between countries raw power matters most, and laws, rules, and even mutually agreed treaties and organizations for arbitration such as the League of Nations, the United Nations, and the World Trade Organization don't matter much.  Operating internationally is like operating in a jungle in which there is survival of the fittest and most anything goes.  That is what makes having a strong military so important.  \n&gt;  \n&gt;  \n&gt;  \n&gt;Where the US Is in Its Big Cycle The stats seem to suggest that the US is roughly 75% through that cycle, +/- 10%.  Is it reversible?\n\n***\"USA Net International investment position \"***\n\n[https://media-exp1.licdn.com/dms/image/C5612AQERAW2vfgiGAA/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=96260dzAt3-N2pSRGOyCAdkO0I1R6WVpsXNmI04ql5A](https://media-exp1.licdn.com/dms/image/C5612AQERAW2vfgiGAA/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=96260dzAt3-N2pSRGOyCAdkO0I1R6WVpsXNmI04ql5A)\n\n***\"EST Share of Global GDP PPP Adj\"***\n\n[https://media-exp1.licdn.com/dms/image/C5612AQHx-MIh208rUA/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=kP-tyBY78SkyYmmtbCklQ4YT1PDsOmwGaYWV541bDdQ](https://media-exp1.licdn.com/dms/image/C5612AQHx-MIh208rUA/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=kP-tyBY78SkyYmmtbCklQ4YT1PDsOmwGaYWV541bDdQ)\n\nRecall how after WW2 when everyone else was in shambles, US was gaining massively by exporting and lending, if America doesn't get it act together in facing rona, we will likely see reverse WW2 effect.\n\n**Exposure of top SPY companies revenue to China**\n\n**AAPL**\n\n[https://www.cnbc.com/2020/07/31/apple-grew-in-china-with-record-ipad-and-services-revenue.html](https://www.cnbc.com/2020/07/31/apple-grew-in-china-with-record-ipad-and-services-revenue.html)\n\n**9.33/59.7 Bn = 15.6%**\n\nIt looks like it's growing in China, but it does so by offering steep discount on BABA and JD online events.\n\n[https://www.cnbc.com/2020/06/02/apple-cuts-iphone-prices-in-china-to-keep-post-lockdown-momentum-going.html#:\\~:text=The%20iPhone%2011%20Pro%20starts,yuan%2C%20down%20from%203%2C299%20yuan](https://www.cnbc.com/2020/06/02/apple-cuts-iphone-prices-in-china-to-keep-post-lockdown-momentum-going.html#:~:text=The%20iPhone%2011%20Pro%20starts,yuan%2C%20down%20from%203%2C299%20yuan).\n\nThe pct regional revenue from China have actually decreased since 2019\n\n**YoY AAPL China's Revenue Change**\n\n[https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-5.png?ssl=1](https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-5.png?ssl=1)\n\n**AAPL Regional Revenue 4Q Avg**\n\n[https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-3.png?ssl=1](https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-3.png?ssl=1)\n\nOther S&amp;P500 companies with significant China revenue exposure includes :\n\n|Ticker|Rev Pct from China|Revenue From China|\n|:-|:-|:-|\n|INTC|23.6%|15Bn|\n|QCOM|65.4%|14.5Bn|\n|BA|12.8%|12Bn|\n|MU|51.1%|10Bn|\n|AVGO|53.7%|9.5Bn|\n|CSCO|15.9%|7.6Bn|\n|TXN|44.1%|6.6Bn|\n\nNote the above shows that China is dependent on US planes and  high tech electronics components like microprocessors and specialized boards, something that they are trying to rectify fast.\n\n***\"Huawei overtaking Samsung worldwide\"***\n\n[https://cdn.arstechnica.net/wp-content/uploads/2020/07/Screen-Shot-2020-07-31-at-10.58.08-AM.png](https://cdn.arstechnica.net/wp-content/uploads/2020/07/Screen-Shot-2020-07-31-at-10.58.08-AM.png)\n\n[https://www.cnbc.com/2020/07/30/huawei-overtakes-samsung-to-be-no-1-smartphone-maker-thanks-to-china.html](https://www.cnbc.com/2020/07/30/huawei-overtakes-samsung-to-be-no-1-smartphone-maker-thanks-to-china.html)\n\n***\"Homegrown CPUs\"***\n\n[https://technode.com/2020/02/20/silicon-chinas-progress-on-homegrown-cpus/](https://technode.com/2020/02/20/silicon-chinas-progress-on-homegrown-cpus/)\n\n***\"COMAC Passenger jets\"***\n\n[https://www.bizjournals.com/seattle/news/2020/07/17/comac-boeing-airbus-arj21-regional-jets-china-buys.html](https://www.bizjournals.com/seattle/news/2020/07/17/comac-boeing-airbus-arj21-regional-jets-china-buys.html)\n\n***\"ARM vs ARM China JV Dispute\"*** \n\nARM designs the CPUs used by smartphones both iPhones and Android.\n\n[https://www.zdnet.com/article/arms-fired-china-jv-head-refuses-to-leave-company-reps-banned-from-company-premises/](https://www.zdnet.com/article/arms-fired-china-jv-head-refuses-to-leave-company-reps-banned-from-company-premises/)\n\nYes, ARM China basically just revolted and declared independence from ARM UK lol, I guess de facto, now they have their own CPU.\n\n***SPY P/E historical***\n\nMedian PE : 14.83 Current PE 7/31 : 28.12\n\nThe only period where it has been higher was Nov 2008-Nov 2009 when a lot of companies were reporting losses and reduced earnings.\n\n&amp;#x200B;\n\nBut Printer Go Brrr you say ? It's not like the 70s or 80s anymore, there are alternatives to foreign reserves now like EUR and RMB, especially with China reducing dollar use on cross border trades with currency swap agreements.\n\n**Interactive Map: The Spread of Central Bank Currency Swaps (China)**\n\n[https://www.cfr.org/article/central-bank-currency-swaps-tracker#chapter-title-0-5](https://www.cfr.org/article/central-bank-currency-swaps-tracker#chapter-title-0-5)\n\n**USD share of world's central bank foreign reserve**\n\n[https://media-exp1.licdn.com/dms/image/C5612AQHzbe3-HcXWNw/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=cBpEOd\\_M36fruplE4UZR3Os8VUZkVoViR26jq7a7WuE](https://media-exp1.licdn.com/dms/image/C5612AQHzbe3-HcXWNw/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=cBpEOd_M36fruplE4UZR3Os8VUZkVoViR26jq7a7WuE)\n\nYeah, as the world reserve currency JPOW still needs to maintain a sense of stabiity, as in not drop &gt;5% in a single month.  Otherwise all those overseas dollars will come flooding back and bam we'll have hyperinflation. So no he won't push the printer much more, for the next few weeks at least.\n\n&gt;“The path of the economy will depend significantly on the course of the virus,”  \n&gt;  \n&gt;“It’s just such an important sentence, we decided it needed to be in our post-meeting statement,”\n\nWhat he said in the FOMC last wednesday was actually very bearish, he admitted the need to keep interest rate at zero and maintain current pace of bond buying just to keep markets from crashing.\n\n**July recap for futures**\n\nSP500 ES  O: 3085  C:3269 , :+5.9% \n\nUSD DX  O: 97.38 C:93.42, : -4.06%\n\n**Last week Recap**\n\nSP500 ES  \t\tO:3210 H:3273 L:3192 C:3269 , \t\t:+1.8% \n\nUSD DX \t\t \tO:94.35 H:94.38 L:92.51 C:93.42, \t:-0.98%\n\nAfter July, It's unlikely that FED will allow USD to fall &gt;3% in August\n\n**FED Market operation schedule for next week**\n\n|Date|Time|Securities|Size|\n|:-|:-|:-|:-|\n|8/4/2020|10:10 - 10:30 a.m.|TIPS 7.5 to 30\t2/5/2028 - 8/4/2050|$1.225 billion|\n|8/5/2020|10:10 -10:30 a.m.|Treasury Coupons 4.5 to 7\t2/6/2025 - 8/5/2027|$6.025 billion|\n|8/6/2020|10:10 - 10:30 a.m.|Treasury Coupons 20 to 30\t8/7/2040 - 8/6/2050|$1.750 billion|\n\n**Last week market operations**\n\n|Date|Time|Securities|Size|\n|:-|:-|:-|:-|\n|7/28/2020|10:10 -10:30 a.m.|Treasury Coupons 0\\* to 2.25 7/29/2020 - 10/28/2022|$12.825 billion|\n|7/30/2020|10:10 -10:30 a.m.|Treasury Coupons 20 to 30\t7/31/2040 - 7/30/2050|$1.750 billion|\n|7/31/2020|10:10 -10:30 a.m.|Treasury Coupons 2.25 to 4.5\t11/1/2022 - 1/31/2025|$8.825 billion|\n\n&amp;#x200B;\n\n**21 Bn Last week vs 9 Bn this coming week,**\n\nBased on that I'm assuming USD inflates &lt;1% next week And we've seen on some days with no company news and earnings that\n\n**The SPY vs DXY is inversely correlated**\n\nHere is an extreme example from June 14th when FED announced individual corporate bond buying\n\n[https://ibb.co/V23QMzQ](https://ibb.co/V23QMzQ)\n\nSP500 earnings for next week, no mega market caps set to announce\n\n[https://www.finscreener.com/earnings/earnings-calendar/sp500?tframe=NW](https://www.finscreener.com/earnings/earnings-calendar/sp500?tframe=NW)\n\n**Jobless Claim**\n\n[https://tradingeconomics.com/united-states/continuing-jobless-claims#:\\~:text=Looking%20forward%2C%20we%20estimate%20Continuing,according%20to%20our%20econometric%20models.](https://tradingeconomics.com/united-states/continuing-jobless-claims#:~:text=Looking%20forward%2C%20we%20estimate%20Continuing,according%20to%20our%20econometric%20models.)\n\nWe see a total of 17 million continuing jobless claims, with the CARES act expired on 7/31, no more 600 dollars a week to spend on necessities/iphones or for YOLO in RH. That just reduced about 10.2 Bn USD consumer purchases from circulating in the economy. These 17 mil people may be displaced structurally as in those jobs are not coming back even if the pandemic ends. Previous record was about 7 mil in 2009\n\n**GDP Growth rate**\n\n[https://tradingeconomics.com/united-states/gdp-growth-annual](https://tradingeconomics.com/united-states/gdp-growth-annual) Annualized was -32.9% but the actual growth rate for Q2 was -9.5%, doesn't sound as bad,  in line with Euro economies but still bad. \n\nDoing stupid simple math to illustrate a concept : \n\n(SPY before Rona) x GDP Change x USD value change \n\n**339 x 0.905 x (1 + (99.82-93.42)) = 326.42** \n\n***It doesn't actually work like this, models are complex, just an example to illustrate a concept of relative value*** Markets are forward looking so if you're planning to do something like the above you should forecast Q3 GDP growth.\n\n&amp;#x200B;\n\n**Sovereign Credit Rating**\n\n[https://www.bloomberg.com/news/articles/2020-07-31/united-states-outlook-revised-to-negative-from-stable-by-fitch](https://www.bloomberg.com/news/articles/2020-07-31/united-states-outlook-revised-to-negative-from-stable-by-fitch)\n\nAs a nation that can just basically print money, getting a negative outlook is a big deal, if the US were to lose its  AAA credit rating expect more expensive debt issuance and fiscal problems down the road.\n\n## In Summary\n\n**China Clash + Rona Pandemic + Fed maintain current pace + No new stimulus deal until 8/7**\\*\\*\n\nWith those factors  SPY will finish below 327 next week. For entry confirmation assuming no news of new stimulus deal reached  I'll wait until it  dips below 325 on Monday after lunch then If it does  get in\n\n**Vertical calls credit spreads :**\n\n# SPY SELL 327C 8/7\n\n# SPY BUY 332C 8/7 (Optional)\n\n***Note: When writing calls this close to the money, you should have enough capital to handle early assignments, if you don't then move the strike a few points back to your comfort level***\n\nWe might need to exit before 8/7 depending on the state of stimulus negotiations\n\n***Alternatively If you think there will be a surprise stimulus deal of more than  2 Trillion next week, then***\n\n**SPY SELL 331C 8/7**\n\n**SPY BUY 336C 8/7**\n\n&amp;#x200B;\n\n**You may ask  what is the opposite scenario that will propel the SPY to 400 this year ?**\n\nA military engagement in the South China Seas that is won swiftly and decisively  by the US.\n\n(As likely as Nancy Pelosi becoming Trump's 4th wife)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*Obilgatory This is not an investment advice, bla bla bla..... , written by the autisticly retarded gambler*\n\n**APPENDIX**\n\n**Main Stimulus proposals**\n\n&amp;#x200B;\n\n||**CARES (from March)**|**Heroes (Democratic)**|**HEALS (Republican)**|\n|:-|:-|:-|:-|\n|Total cost of stimulus package|$2.2 trillion|$3 trillion|$1 trillion|\n|Enhanced unemployment benefit|$600 per week in addition to state benefits.|Same as CARES.|Initially $200 per week. Then up to $500 per week to match 70% of lost wages when added to state benefits.|\n|How long enhanced unemployment lasts|Expires July 31.|January 2021 for most workers, through March 2021 for gig workers, independent contractors, part-time workers and self-employed.|$200 per week bonus through September. Then 70% matching of lost wages. Extends expiration of federal benefits until Dec. 31.|\n|Paycheck Protection Program|Allocated $659 billion total in forgivable loans for small businesses, who must use 75% on payroll to be eligible for forgiveness. $130 billion remains, but expires Aug. 8.|Expands eligibility, eliminates 75% payroll requirement and extends application period to Dec. 31.|Injects another $190 billion into the PPP fund, expands eligibility and allows businesses to request a second loan. Eliminates 75% payroll requirement and expands approved uses of funds for loan forgiveness.|\n|Eviction protections and moratorium|Bans late fees until July 25 and evictions until Aug. 24 on properties backed by federal mortgage programs (Fannie Mae, etc.) or that receive federal funds (HUD, etc.)|Expands to cover nearly all rental properties in the US, extends eviction moratorium an additional 12 months, allocates $200 billion for housing programs and another $100 billion for rental assistance.|Does not address.|\n\n&amp;#x200B;\n\n**How much can you get currently (HEALS Act)?**\n\n|Desc|Scenario 1|Scenario 2|Scenario 3|Scenario 4|\n|:-|:-|:-|:-|:-|\n|Filed 2019 taxes?|YES|YES|NO|NO|\n|Filing Status|Single|Head of Household|Married|Married|\n|2018/2019 Tax AGI|80k|140k|130k|130k|\n|Dependents under 17|0|1|2|2|\n|Dependents over 17|0|0|0|2|\n|Amount|950|1325|3400|4400|",
        "subreddit": "wallstreetbets",
        "title": "⛼🌕🐺👻🧛🧟🧟‍♀ Everybody wants to rule the world, Zombie Markets Part VIII 🦇🐻",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2nbht/everybody_wants_to_rule_the_world_zombie_markets/",
        "created": 1596444107.0
    },
    {
        "author": "kaushizzz",
        "created_utc": 1597118453,
        "id": "i7kq23",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Hi all! I am a 29M and still in school pursuing a PhD in the USA. I have no student loans/cc debt etc.  I am living off a stipend, but I manage to put aside $600 each month to invest. I just started investing a couple of months ago and since I am not confident about what I am doing, I opened two brokerage accounts, one with Robinhood and the other with Chase. The Chase account is an “aggressive” (meaning approx. 90% stocks) portfolio account, in which the bank handles my entire portfolio and I simply put money in it every month. The RH account is, of course, handled by me. My idea is to continue this for a year or two and ultimately consolidate all my money into one account and close the other one, depending on which performs better. \n\nIn my RH account I have/planning to have the following stocks:\n\n**Technology:** GOOG, AAPL, MSFT, FB, AMZN, BABA, INTC, TSM, QCOM, NVDA\n\n**Finance:**  BAC, JPM, PYPL, BRK.B, V, AXP, C\n\n**Communications:** T, VZ\n\n**Consumer Discretionary:** PG, MCD, WMT, DIS, KO\n\n**Industrial:** BA, LMT, DAL, AER\n\n**Healthcare:** JNJ, UNH\n\nI do not plan to invest in ETFs as of now since I am young and able to take risks. Out of the $600 I am investing each month, $300 goes to my Chase investment account and $300 goes to my RH account. I am planning to DCA by investing an equal amount in each of the stock I own in RH, so I would like to own no more than 30 stocks, preferably 25.\n\nI have two questions:\n\n1) Is my strategy of having an RH account and another investing account with Chase a good one? Or should I just stick to one or the other from the get-go? Will having two investment accounts be an issue when I file my taxes?\n\n2) Does my portfolio look good? Am I well / over-diversified? Am I missing some obvious sectors? I think I might end up with way too many similar companies e.g. INTC, TSM, QCOM, and NVDA which is not really diversification. Maybe I should just pick one out of all such companies?\n\nAny other advice/comments about my portfolio are welcome. TIA!",
        "subreddit": "investing",
        "title": "Chase You Invest Portfolios account vs. Robinhood + Portfolio advice",
        "url": "https://www.reddit.com/r/investing/comments/i7kq23/chase_you_invest_portfolios_account_vs_robinhood/",
        "created": 1597147253.0
    },
    {
        "author": "pistonthru",
        "created_utc": 1596377653,
        "id": "i2cpec",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "The past couple month ive been really into the stock market. Ive been trading stocks only because i cannot seem to understand options (I wish i did), with some good success. Examples would be:  \n\n\nAMD = +37%   \nATVI = +28%   \nQCOM = +12%   \nRBC GLOBAL DIVIDEND GROWTH FUND = +12%  \nZDJ = +16%  \n\n\nIve had some a few losses but trying to keep a low loss so for that im okay. What im really wondering is when to get out a stock. I know im suppose to have a \"plan\" for when to get out but i mean these stocks have clear potential to go higher. Is there a rule of thumb of when to get out of a stock with profits ? or something like get out if you loose your porfits drop by 5 % ex +20% -&gt; +15% then go out. ?",
        "subreddit": "investing",
        "title": "When to get out of a stock ?",
        "url": "https://www.reddit.com/r/investing/comments/i2cpec/when_to_get_out_of_a_stock/",
        "created": 1596406453.0
    },
    {
        "author": "cambeiu",
        "created_utc": 1597381151,
        "id": "i9ft66",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "[ARTICLE](https://www.androidcentral.com/samsung-reportedly-partnering-arm-and-amd-beat-qualcomm)\n\nThis should be a red flag not only to Qualcomm but also to Intel, as it could eventually enable more laptops and even desktops to move to ARM.",
        "subreddit": "stocks",
        "title": "Samsung is reportedly teaming up with ARM and AMD to beat Qualcomm",
        "url": "https://www.reddit.com/r/stocks/comments/i9ft66/samsung_is_reportedly_teaming_up_with_arm_and_amd/",
        "created": 1597409951.0
    },
    {
        "author": "Take_Notice_Walk",
        "created_utc": 1597984698,
        "id": "idq7fo",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Back in 90s tech bubble, were \"analyst\" giving stocks like Cisco and Qualcomm high price targets before they plummented? Or were some cautious ?",
        "subreddit": "stocks",
        "title": "During the 90s Tech Bubble, were any \"analyst\" saying it was a tech bubble or were they all giving high price targets like they do now?",
        "url": "https://www.reddit.com/r/stocks/comments/idq7fo/during_the_90s_tech_bubble_were_any_analyst/",
        "created": 1598013498.0
    },
    {
        "author": "Shyamallamadingdong",
        "created_utc": 1596801583,
        "id": "i5chwc",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "US companies with highest revenue exposure to China [https://finance.yahoo.com/news/10-us-companies-highest-revenue-225350456.html](https://finance.yahoo.com/news/10-us-companies-highest-revenue-225350456.html) \n\nWhich of the high exposure companies are resistant to action by China? \n\nIs the market selloff of the highly exposed companies an opportunity to buy these stocks at undervalued prices?  \n\nFor example, Huawei accounts for something like  10% of Micron's sales. But even without Huawei business,  Micron might have significant headwinds into  2021 as  NAND gross margins have started recovering. More details: \n\n[https://finance.yahoo.com/news/micron-more-enough-tailwinds-offset-201000152.html](https://finance.yahoo.com/news/micron-more-enough-tailwinds-offset-201000152.html) \n\n [https://www.fool.com/investing/2020/08/06/why-micron-technology-stock-dropped-5-today.aspx](https://www.fool.com/investing/2020/08/06/why-micron-technology-stock-dropped-5-today.aspx) \n\nOpinions?",
        "subreddit": "investing",
        "title": "The growing anti-US sentiment in China could potentially hurt US companies with high revenue exposure to China (e.g. WYNN, QCOM, MU, QRVO) much more than companies who produce there (e.g. AAPL, NKE) and companies who make most of their money outside China (e.g. SBUX, GM, CAT, BA)",
        "url": "https://www.reddit.com/r/investing/comments/i5chwc/the_growing_antius_sentiment_in_china_could/",
        "created": 1596830383.0
    },
    {
        "author": "MidnightL0tus",
        "created_utc": 1598126504,
        "id": "iepct5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I'm thinking about going all in on QQQ but I want to maximize as much profit as a possible on returns. Should I go all in on QQQ or invest in a stock like NVDA or QCOM instead? If you know of a better preforming tech stock please let me know!",
        "subreddit": "StockMarket",
        "title": "QQQ VS Individual Stock (Maximum returns)",
        "url": "https://www.reddit.com/r/StockMarket/comments/iepct5/qqq_vs_individual_stock_maximum_returns/",
        "created": 1598155304.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1598188265,
        "id": "if2x8e",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Swaggy is back with his Sunday morning read of Unusual Options Activity. I get a lot of DMs asking about the activity, so if you want to read a bit about option flow, I made [this Reddit post](https://www.reddit.com/r/SwaggyStocks/comments/i2cwm1/unusual_options_activity_option_flow_what_it_is/) describing how it works.\n\nIn addition, if you would like to check out the option flow tool and scan for yourself, here is the [option flow tool](https://www.swaggystocks.com/dashboard/stocklabs/option-flow).\n\nAs for unusual trades, it’s been pretty quiet the last two weeks. Most flow is coming into big tech stocks and pumping them higher. I caught a few other smaller plays that I’ll get into the details of here.\n\n**MSFT – Microsoft Corporation**\n\nMicrosoft has been a repeat name for some bullish flow in the last months. Looks like players have been opening bull call spreads with relatively medium-term expirations (end of the year) expecting the stock to continue it’s slow rise up. The range of strike prices has been $215-$240. MSFT has been one of the companies looking to acquire TikTok in the latest rumors. Other names that have seen some similar flow last week were AMZN, FB, ADBE, and of course, AAPL.\n\nhttps://preview.redd.it/tmrkvz3e4ri51.png?width=2150&amp;format=png&amp;auto=webp&amp;s=b5128bc760d4ad4905cf479242fa4be52c7dfcd5\n\n**NVDA – NVIDIA Corporation**\n\nNVDA reported earnings last week and although they blew estimates out of the water, the stock remained flat post-earnings. NVDA demonstrated some high growth in their server market and overall they have been one of the best performing tech stonks. Flow has been mixed, but leaning on the bullish side. Overall activity has picked up greatly since last week as traders could be expecting another move up.\n\nhttps://preview.redd.it/1klzg6ze4ri51.png?width=2430&amp;format=png&amp;auto=webp&amp;s=2d91676e3f077ecd17e9a2f2d604de2ac8b64563\n\n**QCOM – QUALCOMM Incorporated**\n\nQCOM is another semi-conductor company that has seen a good run over the last several months. Players placed bets that the company would continue it’s steady rise up as demand for chips in a more data-driven world are becoming the new norm. A lot of calls were traded with strikes in the $105-$120 range. These mostly have expirations from November to January 2021, so they are mid-term in the timeframes and expectations.\n\nhttps://preview.redd.it/rv6wpktf4ri51.png?width=1610&amp;format=png&amp;auto=webp&amp;s=3f5f1ed70da42174709714410765d64535b69f56\n\n**ORCL – Oracle Corporation**\n\nORCL has seen an uptick in activity on the bullish side. Rumors are they are making a bid for the TikTok acquisition as well. ORCL’s stock price has been somewhat stagnant over the last several months and they didn’t rally as hard as the rest of big tech from the March lows. The option flow might indicate a bullish move in the future for this stock.\n\nhttps://preview.redd.it/j6njzexg4ri51.png?width=2420&amp;format=png&amp;auto=webp&amp;s=2fcb092d4b6735bb223c38bedc6fff892e0e33f7\n\n**LYFT – Lyft Inc**\n\nLYFT and UBER have shut down service in California due to a new ruling that would require them to treat independent contractors as employees with benefits moving forward. Their rebuttal was to simply shut-down service and put the pressure back on the government to make their next move. Soon it will show that these ride-sharing companies have become a staple in our societal culture as they have made our lives so much easier. A whole slew of some pretty large calls were opened last week that was caught as bullish flow. I’m not sure what the catalyst would be here, maybe it’s because the stock is near the lows and shutting down service actually induces less losses on the company. Who knows.\n\nhttps://preview.redd.it/0pxz92li4ri51.png?width=2020&amp;format=png&amp;auto=webp&amp;s=f5eed0add829b6b63c17a73322ccab635ca8d309\n\n**DLTR – Dollar Tree Inc**\n\nDollar Tree caught some unusual call volume last week. Looks like players are betting on a 10% gain in the stock price with the October strike. These bets weren’t unusually large in size, but for a company like DLTR they were pretty significant. The plays were sweeps at the $108 strike in Sept 25/Oct 02 expirations. The stock has had a decent run over the last several months and the players are expecting another leg up soon. We’ll see about this one.\n\nhttps://preview.redd.it/k3dkhbkj4ri51.png?width=1902&amp;format=png&amp;auto=webp&amp;s=b1de6a827de4fd6572df1600de3f839783271624\n\n**CRM – Salesforce**\n\nCRM/Salesforce has been a hot stock recently. There was some bullish flow earlier this month and again into last week. My scanner picked up two long position, although in my opinion it looks like a spread was opened (still bullish). The spread was actually opened when the stock was trading at $197, and it is currently $10 higher at $207. The player bought to open 11,000 calls at the $200 strike and sold 11,000 calls at the $220 strike, paying $9 million for the position. They are already profitable on their position, but if CRM closes above $220 by February, they will have a net profit of $22 million.\n\nhttps://preview.redd.it/qkw6lpok4ri51.png?width=1612&amp;format=png&amp;auto=webp&amp;s=4cf3112c70a994a5724707e18b3376cb6490b43d\n\n**CZR – Caesars Entertainment Inc**\n\nCZR caught some bullish activity last week when players opened January and March 2021 calls. The stock has already had an unbelievable recovery from the March lows, but is still nowhere near the highs. Looks like as the country opens back up again (if it stays that way), they expect the company to continue it’s good performance. Some of the bullish flow was put-selling, which suggests the stock will have already reached it’s long-term bottom.\n\nhttps://preview.redd.it/uzkpssol4ri51.png?width=1620&amp;format=png&amp;auto=webp&amp;s=e7978edf9012a3334d7978075da93bac94215fd1",
        "subreddit": "options",
        "title": "This week's Unusual Options Flow into big tech, DLTR, LYFT, CZR, and CRM",
        "url": "https://www.reddit.com/r/options/comments/if2x8e/this_weeks_unusual_options_flow_into_big_tech/",
        "created": 1598217065.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513481,
        "id": "i3cbpg",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "investing",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/investing/comments/i3cbpg/rate_my_stock_portfolio/",
        "created": 1596542281.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513522,
        "id": "i3cc1k",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "StockMarket",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/i3cc1k/rate_my_stock_portfolio/",
        "created": 1596542322.0
    },
    {
        "author": "BK_Verbs",
        "created_utc": 1597256928,
        "id": "i8j6m3",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Anyone jump in on QCOM today?\n\nI picked up 8/14 115c this morning and just sold them off +250%. Wish I would have taken a bigger position. But hey, it was free money and I’ll take it.",
        "subreddit": "wallstreetbets",
        "title": "QCOM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8j6m3/qcom/",
        "created": 1597285728.0
    },
    {
        "author": "Dashover",
        "created_utc": 1597194839,
        "id": "i84d6i",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "\n \nFor Trading August 12th\n \nTSLA 5:1 SPLIT\n \nGOLD / SILVER COLLAPSE\n \nDJIA CLOSES 450 OFF HIGH\n \n \nToday’s market got off to a slightly higher start on DJIA and S&amp;P-500 but general weakness in the NASDAQ, again.  By the end of the day the DJIA -104.53 (.38%) was well off its +363 high and the NASDAQ was the big loser -185.54 (1.69%).  The S&amp;P 500 was -26.78 (.80) after being withing a few dollars of a new high, the Russell -9.57 (.6%), and the only winner the DJ Transports +24.59 (.23%).  Market internals were 1:1 on the NYSE but 1.5:1 down on the NASDAQ.  Volume was slightly higher than average for an August day.  The major feature of the day was the massive selloff in the precious metals.  Gold was down $125/oz. at the low and finished $1946.30 -93.40 (6%) while the Silver was lower by $3.21 to $26.049 after hitting an intraday low of $24.48.  The change at the close was 12%.  I would assume that we would see some follow-thru tonight and tomorrow early, but I bought the NEM September $65 / 70 call spread for $1.45.  This is basically the same trade I made last month on the August expo $60/65 spread @ $1.30 that we sold @ $3.20.  We also had the TBT 9/18 15 calls @ $ .40 that we sold today half @ $ .68, and the second half @ $ .74 just before they fell back to $ .55.  Not bad, with YTD now back to +34%.\n \n\nTonight’s closing comment video  https://youtu.be/EvsCZy_K1sw\n\n\nSECTORS: We didn’t have much corporate news today but QCOM won an appeals court ruling on an anti-trust case and the stock ignored the selloff and finished the day $108.83 +2.47 (2.3%).  That made it a standout as the rest of technology was hit hard again today.  It was the 3rd day down for the NASDAQ since its new closing high at $11,108.07 last Thursday.\nThe biggest news of the late day was the announcement that TESLA (TSLA) declared a 5:1 stock split.  While this is really just straight arithmetic, it does create some demand for the shares now, since when the stock split becomes effective at the end of August you would have 5 times the shares at 1/5 of the price.  But it does promote the purchase of “round lots” as opposed to “odd lots.”  Does it really increase demand?  Not really, but most stocks (like AAPL) do seem to rise on the news.  TSLA certainly did, closing $1374 -44, and then on the news rallied to its current $1467.20, over $90 higher.\nFOOD SUPPLY CHAIN was LOWER with TSN +.82, BGS -.46, FLO +.20, CPB -.63, CAG -.49, MDLZ -.49, KHC -.16, CALM +.19, JJSF -.35, SAFM +2.10, HRL -.31, SJM -.84, PPC +.27, KR -.58, and PBJ #33.32 -.37 (1.13%).\n \nBIOPHARMA was LOWER with BIIB -10.32, ABBV +.19, REGN -9.38, ISRG -8.00, GILD +.35, MYL +.39, TEVA -.07, VRTX -6.87, BHC +.16, INCY -1.32, ICPT -.25, LABU -6.96, and IBB $132.28-2.59 (1.92%).\nCANNABIS: was LOWER with TLRY -.95, CGC -.54, CRON -.06, GWPH -3.52, ACB -.14, NBEV -.02, CURLF -.38, KERN -.29, and MJ $12.95 +.01 (.08%).\n\nDEFENSE:  was HIGHER with LMT +3.03, GD +2.94, TXT -.18, NOC +6.27, BWXT +.22, TDY +1.75, RTX +.16, and ITA $172.14 +.91 (.53%).\n\n \nRETAIL: was HIGHER with M -.16, JWN +.07, KSS +.55, DDS +.66, WMT -1.33, TGT -1.22, TJX +1.08, RL +1.77, UAA +.27, LULU -8.95, TPR +.12, CPRI +.31, and XRT $50.60 -.39 (.76%).\n \nFAANG and Big Cap: were LOWER with GOOGL -12.81, AMZN -63.15, AAPL -10.52, FB -5.50, NFLX -14.89, NVDA -10.20, TSLA +50.43, BABA +.87, BIDU +.08, CMG -11.00, CAT +1.23, MSFT -3.,85, BA +.98, DIS +1.86, and XLK $112.00 -1.42 (1.25%).\nPLEASE BE AWARE THAT THESE PRICES ARE LATE MARKET QUOTES AND DO NOT REPRESENT THE 4:00 CLOSES.\n \n \nFINANCIALS were HIGHER with GS +2.42, JPM +3.58, BAC +.47, MS +1.22, C +1.17, PNC +3.32, AIG +.52, TRV +.80, AXP +1.70, V +1.46, and XLF $25.31 +.29 (1.16%).\n \nOIL, $41.61 -.33. Oil was higher in last night’s trading before we rallied in the morning on news of production cutbacks from Iraq. The stocks were HIGHER with XLE $38.20 -.13 (.34%).\n \n \nGOLD $1,946.30 -93.40, was a continuation rally and a new recovery high of $2,089.20, but we collapsed and fell as far as $1,919 -124 before coming back slightly.  Tonight, we are currently trading lower again at $1,915.70 – 30.00.  While I like the gold down here, I will have to wait and see how it acts overnight.\n \nBITCOIN: closed $11,435 -580. After breaking out over $10,000 we have had a “running correction” pushing prices toward $12,000, reaching a recovery high of $12220 yesterday. We had added 350 shares of GBTC @ $10.02 to our position of 400 @ $8.06, bringing our average price to $8.97, but sold 250 shares today @ $13.93. GBTC closed $12.54 -1.15 today.\n \n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "TESLA 5:1",
        "url": "https://www.reddit.com/r/options/comments/i84d6i/tesla_51/",
        "created": 1597223639.0
    },
    {
        "author": "radarbot",
        "created_utc": 1596671265,
        "id": "i4gq85",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "QCOM and Huawei just agreed to a $1.8B settlement on a patent infringement case thats been lingering:\nhttps://finance.yahoo.com/news/seismic-semi-shifts-qcom-nvda-211809341.html\n\nBeyond the settlement, it looks like QCOM is now open to supply chips to Huawei for their phones which opens up huge revenue opportunities.\n\nAlso, (I know seeking alpha is a speculative website...) there is good evidence that QCOM is a leader in 5G chips for mobile:\n\nhttps://seeking alpha.com/article/4364578-doubling-down-on-qualcomm\n\nQCOM is trading at $110 today after reporting great earnings last week. Their PE ratio looks high at 36 currently ($113 share price / 3.55 [2019 Annual EPS]) = 31.83. TDA has them at a PE of 41 but I don't know how they're doing their math.\n\nThe settlement will add $0.75 to annual EPS as paid out over multiple years. In addition to added markets, this may finally be a chance for QCOM to take off.\n\nIf the projections are true, the forward PE ratio of QCOM moves from around 31 to 19, as the price increase hasn't been factored in yet to accommodate the EPS projections.\n\nDoes anyone else feel bullish on QCOM in this competitive silicon manufacturing world?",
        "subreddit": "stocks",
        "title": "QCOM comes to deal with Huawei over patent infringement",
        "url": "https://www.reddit.com/r/stocks/comments/i4gq85/qcom_comes_to_deal_with_huawei_over_patent/",
        "created": 1596700065.0
    },
    {
        "author": "LSQuant",
        "created_utc": 1598448334,
        "id": "igyric",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "4 is better than 1 logic held up well in 2000 with QCOM. TSLA AAPL should get interesting.",
        "url": "https://i.redd.it/0jp4dkt1mcj51.jpg",
        "created": 1598477134.0
    },
    {
        "author": "marilius12",
        "created_utc": 1598416733,
        "id": "igsfbv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Case in point, CRM. Between 7:50 and 7:55pm today the stock plunged over 28% only to rebound all the way back up in the next 5 min. What the heck is this? I noticed this tends to happen when the earnings are announced.\n\nI've see this with APPL (around 3% down minutes before they announced the stock split), QCOM (4% down before it ran up over 10% when they announced a settlement with Huawei), also with TSLA and other stocks. It doesn't happen every time, sometimes the stock just goes up after hours on good news and there's no sell-off, but sometimes this happens.",
        "subreddit": "stocks",
        "title": "Why do some stocks drop sharply after hours only to rebound within minutes?",
        "url": "https://www.reddit.com/r/stocks/comments/igsfbv/why_do_some_stocks_drop_sharply_after_hours_only/",
        "created": 1598445533.0
    },
    {
        "author": "kutuzovgambit",
        "created_utc": 1596760482,
        "id": "i53v5c",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "TSMC just keeps gaining customers. They seem to be the only company doing die shrinks reliably anymore. I wish I had bought way more than $1K worth when they were sitting at $55 per share. Honestly though with Apple, Qualcomm and even Intel relying on them they could run up way more than they already have. Semiconductors are not going anywhere.\n\n [https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)",
        "subreddit": "stocks",
        "title": "TSMC reportedly gains Qualcomm orders as Samsung 5nm production falters",
        "url": "https://www.reddit.com/r/stocks/comments/i53v5c/tsmc_reportedly_gains_qualcomm_orders_as_samsung/",
        "created": 1596789282.0
    },
    {
        "author": "kutuzovgambit",
        "created_utc": 1596759914,
        "id": "i53pvn",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "TSMC said to gain Qualcomm orders as Samsung 5nm falters",
        "url": "https://www.reddit.com/r/stocks/comments/i53pvn/tsmc_said_to_gain_qualcomm_orders_as_samsung_5nm/",
        "created": 1596788714.0
    },
    {
        "author": "Ljeri",
        "created_utc": 1597493972,
        "id": "ia6cz4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So I’m a very new very small time investor. I have  recently decided to invest in 5G. \n\nNOK \nERIC \nQCOM \n\nI’m most interested in what others think. \n\nThese stocks seam fairly priced for something that I imagine will be used worldwide in most homes.",
        "subreddit": "stocks",
        "title": "5G",
        "url": "https://www.reddit.com/r/stocks/comments/ia6cz4/5g/",
        "created": 1597522772.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1596694538,
        "id": "i4mgq1",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "Alright guys so I'm one of the hosts on a YouTube channel named \"Max Tech\".  \nI previously did YouTube work for the channel \"Appleinsider\" since 2016, making videos on Apple products which include Mac computers with Intel chips. \n\nI also grew up playing video games and building custom PCs right when AMD started to release six-core and 8-core processors that were cheaper than Intel CPUs and targeted towards gamers.  \n\nEven though the Intel chips were better for gaming, I still bought AMD because they were cheaper. Intel maintained the lead for many years since games really only used 4 cores, and Intel chips gave more consistent frame rates for gaming.\n\nAt one point, it was clear to me and to everyone else that Intel was intentionally holding off from innovating and improving their performance because they already owned a bulk of the market share. They realized that they could make more profit by making small improvements every year, while AMD was busting their ass trying to figure out how they can compete. (it was ultimately the gaming and custom PC market) \n\nMeanwhile.. Apple was using Intel chips quite successfully in their Mac computers the like MacBooks and iMacs. And Apple was also using their XEON chips for their higher-end machines. And of course, Intel was killing it in the server market.\n\nNow in 2013, Intel announced that they were working on their new 10nm chip process and that it should be ready to launch in 2015, and they said their 7nm chips should launch in 2017. \n\nBack to Intel, over the new few years, Intel delayed 10nm to 2016... and then to 2017.. and then to late 2019... We are now in 2020 and Intel is still shipping 14+++++ nm chips for high-end machines like the 2020 5K Apple iMac that was just released yesterday. Only laptops are getting the actual 10nm chips right now. \n\nIn 2017, AMD shocked the world by announcing their new Ryzen chips, and then also their Threadripper chips, and ever since then, they've been quickly catching up to Intel in terms of both performance and price. \n\nBecause of this, Intel instantly started lowering the price of their chips, and in 2018, they finally made 6-core chips for the MacBook Pro. 8-core chips in 2019, and now 10-core chips in 2020. This is an obvious and desperate move to try and compete with AMD. \n\nBecause Intel's 10nm chips were not ready in 2015 or 2016, Apple's redesigned 2016 MacBook Pro which was thinner than ever before, had overheating issues. The overheating was severe in 2018 with the 6-core chips that Intel made in fear of AMD. \n\nThere were even leaked emails from Intel executives worried about AMD's price to performance beating out Intel. \n\nAnd right now, it is well known that AMD is making BETTER price-to-performance x86 chips. \n\nThe MOST important part of this discussion is that the tech community as a whole, including or YouTube and Reddit, are now convinced that AMD is the way to go. I've seen countless comments on my videos that are dissing on Intel chips and wishing that Apple would switch to using Intel. \n\nIf we make a build guide video using an Intel processor, we get shamed and called dumb for not using an AMD chip. Our Mac Pro videos got a ton of negative feedback because Apple is stupid for using Intel chips. Our 2020 MacBook Pro videos were getting comments dissing on Intel's 10th-gen chips. The entire community is starting to hate Intel and preferring AMD.  \n\nAMD stock has increased over 11x since they announced the first Ryzen chips in August of 2016.  \nIntel stock has only increased 38% since that same date. \n\nAnd looking towards the future.. Intel has recently delayed their 7nm chips until late 2022 or 2023. This caused their stock price to tank at they last earnings call. \n\nThere's even now a class-action lawsuit against Intel because of this delay. \n\nThis also caused their chief of chip engineering to resign, and they reorganized their entire chip team. \n\nThey've even discussed outsourcing their future 6nm, 5nm and 3nm chip production to their rival foundry TSMC because they've lost confidence in their own foundry. \n\nSo it's clear that Intel is getting killed by AMD with each passing year, and the tech community knows it. (Which is VERY important)   \n\n\nThis brings us into the Apple and TSMC portion of this DD.   \n\n\nBack in 2013, Apple announced their A7 chip for their iPhone 5s, the first 64 bit smartphone chip, and ever since then, there was a massive performance war between Apple and Qualcomm, fighting to create the fastest smartphone chips, in which Apple ultimately won. \n\n(The A13 in the iPhone 11 Pro is still much faster than the Snapdragon 865+ which was just recently released this year) \n\nStuck in the middle of this battle was TSMC, which has been the EXCLUSIVE manufacturer of Apple Silicon chips for their iPhones and iPads since the A10 chip in 2016. \n\nAnd in 2018, Apple released their 11\" iPad Pro with the A12X chip manufactured by TSMC's 7nm process. This iPad from 2 years ago is so powerful that it still outperforms the new 2020 13\" MacBook Pro with Intel's 10th gen chip in both processor AND graphics performance. \n\nNow, Apple is about to announce their iPhone 12 in about a month that's gonna pack the A14 chip which is being built on TSMC's brand new 5nm process. \n\nAnd of course, the next iPad Pro will get a much improved A14X 5nm chip, and it's the same story for the Apple Silicon Mac chips that will start being released later this year in October/November. \n\nI'm of course, talking about Apple finally ditching Intel and moving forward with their own chips. This makes sense for Apple for various different reasons.\n\n1: They can run iPhone &amp; iPad apps on their Macs.\n\n2: They control both the software and hardware for incredibly amounts of performance optimization.\n\n3: They can make sure every new Mac update gets a new chip with performance improvements instead of relying on Intel to release improved chips. \n\n4: This is of course, much cheaper for Apple since they don't have to pay Intel the high price of their chips. \n\n5: They don't have to deal with overheating issues since most Intel chips are still on 14nm technology, therefore running very hot and using a lot of power.   \n\n\nAnd there's a good chance that the very first Apple Silicon Mac chips are gonna outperform the current Intel chips, stay much cooler and give you much better battery life. \n\nJust to give you some perspective in terms of how Intel's 10nm compares to TSMC's 5nm..\n\nIntel 10nm transistor density: around 100 million transistors per square millimeter.\n\nTSMC 5nm transistor density: around 171 million transistors per square millimeter. \n\n  \nTSMC has already confirmed that they're working on risk production of their new 3nm process in 2021,  with those chips going into 2022 iPhones, iPads and Macs. \n\nSo here's what the future looks like:\n\n  \nIntel 7nm in late 2022/2023 : 240 million transistors per square millimeter\n\nTSMC 3nm shipping in 2022 Apple products: 290 million transistors per square millimeter\n\nAnd apparently, TSMC is already working on plans for their 2nm process for 2024.   \n\n\nAnd due to Intel's past, there's a very good chance that Intel could delay 7nm even further, especially since they had to restructure their entire chip team, while TSMC has been on point.   \n\n\nSo the future isn't looking very bright for Intel's chip technology compared to TSMC. No wonder why they wanted to outsource their chips from them.   \n\n\nAnd one last bit on Apple's switch to their own chips built by TSMC. \n\nApple has already given developers their transition kit which is a Mac Mini with an A12Z chip from their iPad Pro. \n\nOne developer tweeted this: \"At this point, I think that the first gen Apple Silicon machines will be faster at running x86 code than an actual x86...\"  \n\n\nWhat he means is that Apple's new Rosetta 2 emulation software is so good that he thinks it'll outperform Intel chips even though it's not running natively for ARM. \n\nSo basically, Apple made the right choice by ditching Intel.   \n\n\nAnd if Apple proves everyone wrong by coming out with incredibly great Macs thanks to their switch to their own Apple Silicon ARM-based chips, then there's a VERY good chance that the rest of the market will follow them and start developing ARM-based chips for laptops.\n\nThis will force Windows to start heavily investing in their ARM-based Windows software. \n\nAnd if you didn't already know.. Intel is FAR behind in the ARM-based chip world.   \n\n\nNow, the most common argument I hear is this: Apple is only a tiny part of Intel's business, and while that may be true.. the MOST important thing is the public's view of Intel.  \n\n\nThe tech community is already starting to despise Intel as a brand name because of their overpriced processors and the fact that AMD is beginning to CRUSH them. \n\nJust wait until Apple Silicon Macs start getting released and people realize that ARM-chips have a ton of potential, and they'll start hating Intel even more. \n\nThis will cause Intel's brand recognition and reputation to get absolutely destroyed in favor of AMD and Apple Silicon. This alone will lead to less market share. And what will happen if Nvidia or Apple buy out ARM? \n\nAnd by the way, there are now more and more ARM-based servers popping up, so there's a good chance that Intel will start to lose market share on the server side if ARM-based servers prove themselves. (They use less power so this makes sense for server farms)\n\n&amp;#x200B;\n\nBasically, what I'm trying to say is that Intel just got ditched by Apple.. and they're getting killed by AMD and TSMC. ARM is coming VERY quickly and Intel is NOT ready. They have been plagued with delay after delay, and all of this drama will ruin the confidence of their staff, leading to lowered productivity. It's not looking good for Intel for the long-term.  \n\n\nAs of right now, Intel stock is very cheap, and you might make a few bucks if you trade short term.. but I wouldn't hold Intel stock long term.   \n\n\nIf you want more in-depth info with visuals and extra details, you can check out two videos I made on the Max Tech Youtube channel: \n\n\"How Intel Lost the CPU Race..\"\n\n\"Apple Silicon ARM Chips vs Intel x86 Processors for Mac?\"\n\nHopefully you enjoyed this DD.",
        "subreddit": "wallstreetbets",
        "title": "INTC - Why you Should NOT hold Intel stock long term!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc_why_you_should_not_hold_intel_stock_long_term/",
        "created": 1596723338.0
    },
    {
        "author": "Kokodokoe",
        "created_utc": 1596342287,
        "id": "i266ax",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "TLDR: Long AMD. AMD will hit $100 by Feb 2021.\n\nSamsung is ditching expensive Qualcom Snapdragon 875 chipset and they will be mounting Exynos 1000 chipset with AMD's RADEON GPU for the new Galaxy s21.\n\nQualcom announced their new Snapdragon 875 chipset to be at least 25% more expensive than previous generation. That is $250 phone manufactures have to pay. Smartphones are becoming more and more expensive, and most of the flagship phones cost around $1k. That price tag is too high for average Joe and this price will go higher as Qualcom increasing their chipset price.\n\nGoogle, Xiaomi, LG are all using Qualcom chipset and they will soon follow what Samsung is doing.\n\nAlso with screens getting bigger, more GPU power is needed. That's where AMD comes in with their affordable GPU. Whether Galaxy s21 success or not, CPU Chipset + GPU will be the new trend in smartphone market, and bet my ass AMD will lead market as the front runner.\n\nsources:\n\n[https://www.notebookcheck.net/Samsung-Exynos-1000-with-AMD-Radeon-GPU-rumored-to-feature-only-in-the-Galaxy-S21-Ultra-Exynos-brand-change-being-contemplated-too.483452.0.html](https://www.notebookcheck.net/Samsung-Exynos-1000-with-AMD-Radeon-GPU-rumored-to-feature-only-in-the-Galaxy-S21-Ultra-Exynos-brand-change-being-contemplated-too.483452.0.html)\n\n[https://www.digit.in/news/mobile-phones/qualcomm-snapdragon-875-price-leaked-55100.html](https://www.digit.in/news/mobile-phones/qualcomm-snapdragon-875-price-leaked-55100.html)",
        "subreddit": "wallstreetbets",
        "title": "Long AMD. New Exynos 1000 chipset will take AMD stock to THE MOON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i266ax/long_amd_new_exynos_1000_chipset_will_take_amd/",
        "created": 1596371087.0
    },
    {
        "author": "vadimyuryev",
        "created_utc": 1596820991,
        "id": "i5hybj",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "Hey guys, I'm back from my last DD: [https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc\\_why\\_you\\_should\\_not\\_hold\\_intel\\_stock\\_long\\_term/?utm\\_source=share&amp;utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/i4mgq1/intc_why_you_should_not_hold_intel_stock_long_term/?utm_source=share&amp;utm_medium=web2x)  \n\n\nI'll try and make this one a bit shorter.   \n\n\nVadim Yuryev here from the YouTube channel Max Tech.  \nI've been covering a lot of Apple products and Macs for the last 4 years ever since I started working for Appleinsider. \n\nAs you all know, Apple has recently announced that they're switching to their own custom Apple Silicon Mac chips, which will of course be built exclusively by TSMC on their brand new 5nm process (World's first)\n\nWhat most people don't know is that they've been working toward this transition for many years. For example, in 2017, they dropped 32 bit app support for iOS 11. In 2018, their macOS Mojave forced developers to use their Metal framework (That's why Nvidia cards don't work anymore in eGPUs) In 2019, macOS Catalina dropped support for 32 bit apps.\n\nThese 3 steps are incredibly important to the Apple Silicon Macs coming this Fall because one of the most important features is the ability to run completely unmodified iPhone and iPad apps on day 1, which of course, are 64 bit apps that run using the Metal framework on the current Apple Silicon chips. manufactured by TSMC. \n\nBecause of this, the transition from Intel to Apple Silicon chips is gonna be much more smooth compared to the previous transition from PowerPC to Intel chips. \n\nA major benefit for the future is that app developers can build apps that have most of the code shared across all Apple devices, which minor adjustments to get the UI to scale properly from the Mac, to the iPad, to the iPhone and of course the Apple TV.\n\nAnd a huge benefit will be the ability to fix bugs and optimize code for all platforms at once instead of having to do it all separately since the main code is shared.\n\nAnd unlike the last transition, Rosetta 2 can now translate x86 app code into ARM-supported code during the install time instead of using real-time emulation. And for plugins and drivers, Rosetta 2 emulates them as well.\n\nDevelopers who have been using Apple's Developer Transition Kit with the A12Z chip from the iPad Pro have already mentioned that Rosetta 2 works incredibly well, much better than expected:  \n[https://twitter.com/yiningkarlli/status/1278897047324602369?s=20](https://twitter.com/yiningkarlli/status/1278897047324602369?s=20)\n\n[https://twitter.com/never\\_released/status/1288658469827104769?s=20](https://twitter.com/never_released/status/1288658469827104769?s=20)\n\nAnd this is with the A12Z chip, which mind you, hasn't changed in terms of processing performance from the A12X chip from 2018. This is also a chip that comes in an iPad Pro that is thinner than any iPhone ever, and has absolutely zero active cooling. \n\nThat chip from 2018 currently outperforms Intel's brand new 10th-gen 10nm chip that came in the 2020 MacBook Pro in terms of both processing and Metal graphics performance.\n\nApple Silicon Macs will of course, have active fan cooling, and Apple has already stated that their Apple Silicon chips for their Macs will be a brand new family of chips, and each Mac will have a chip built specifically for it's enclosure and it's cooling capabilities.\n\nAnd Apple has mentioned that their Silicon has been built for years with easy scalability in mind, so they can add much more cores into the new Mac chips, especially since they'll have active fan cooling. \n\nBecause of the pandemic, Apple's original plans to release a new iPad Pro this Fall with the brand new A14X chip built on TSMC's new 5nm process and a new Mini-LED display were delayed, so that's why the released the 2020 iPad Pro in March, where they basically reused the A12X chip and rebranded it.\n\nSo right now, most investors have no idea how good the A14X is gonna be.\n\nThe A13 chip from last year's iPhones already performs incredibly well in terms of single-core performance, almost neck and neck with Intel's i9-9900K.\n\nThe new A14 chip will be a major improvement, due to being the first chip built on TSMC's 5nm chip.\n\nThere will also be an A14X chip will have a massive improvement over the current A12Z chip, and let me remind you that it will be in an iPad Pro that's thin and passively cooled.\n\nThis same 5nm technology is gonna be scaled up to fit active cooled Apple Silicon Mac computers, first coming into MacBooks like the MacBook Air and the 13\" MacBook Pro, and then into the redesigned 24\" iMac. \n\nOne of the first rumored chips will be a 12-core 5nm chip built by TSMC with 8 high performance cores and 4 efficiency cores. This will likely go into the MacBook Pro. \n\nI'm almost certain that it will outperform the previous Intel-based MacBook Pros in every way. And on top of that, the new Apple Silicon chips will come with Apple's Neural engine and machine learnings accelerations. Along with that, they'll get the same HEVC hardware accelerators as well, which is now becoming the standard for video recording. \n\nBasically, the point of all of this is that TSMC's new 5nm chips that will come in the Apple Silicon Macs are gonna be much faster than anyone is expecting, and those first Macs are rumored to be coming this October or November. \n\nThese chips will shake the entire industry due to the vast performance per watt improvements and the way Apple is gonna use them in terms of their Apple devices sharing the same code. \n\nAnd if Apple succeeds in this transition, there's a very good chance that the rest of the industry will start slowly switching to ARM-based chips, which TSMC is the leader in. (Intel is way behind in ARM chip technology)\n\nBecause of this, TSMC will be confirmed as the leader in chip-making technology, and investors will jump onboard.\n\nTheir main advantage is that they're the first to 5nm, and Samsung is currently having trouble with their 5nm process. Their Note 20 Ultra isn't launching with 5nm chips like people expected.  \n\"A new [report](https://www.zhitongcaijing.com/content/detail/324146.html) out of China (via [*GizmoChina*](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)), however, suggests Samsung may have lost most, if not all, of that business to Taiwanese rival TSMC\"\n\n[https://www.androidcentral.com/qualcomm-reportedly-choose-tsmc-over-samsung-its-upcoming-snapdragon-875](https://www.androidcentral.com/qualcomm-reportedly-choose-tsmc-over-samsung-its-upcoming-snapdragon-875)\n\nSo Samsung is having trouble. Intel is having trouble, ordering wafers from TSMC. AMD is ordering wafers from TSMC. Qualcomm is ordering wafers from TSMC.\n\nTSMC is now becoming the Sony of the chip-making world. (Sony owns the camera sensor market by such a vast margin that a TON of cameras come with Sony sensors)\n\nWhat if TSMC becomes the next Sony and more companies rely on them for chips instead of investing into their own chip technology? \n\nSummary: Buy Long calls. Especially while the whole market is having a down day today. Buy the dip!\n\nPositions: TSM $100c 1/15/21",
        "subreddit": "wallstreetbets",
        "title": "$TSM - Why you should Buy LONG Calls! (Future leader in Silicon Chips)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i5hybj/tsm_why_you_should_buy_long_calls_future_leader/",
        "created": 1596849791.0
    },
    {
        "author": "ld_southfl",
        "created_utc": 1596389099,
        "id": "i2fue2",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Microchip is a semiconductor company out of Arizona with a Mkt. Cap of about $26 Billion. They make chips for a bunch of products like Cyber Security, Wireless Products, and Telecommunications. The thing is that they earnings on 08/04 Tuesday after hours. It is very obvious that are going to beat earnings. Why? Because look at the rest of the industry: Qualcomm, Intel, AMD, Qorvo, and IBM have all destroyed earnings. And since Intel just told everyone that they're too retarded to even make potato chips all the smaller time semiconductor competitors are making bank, example: AMD and QCOM. \n\n&amp;#x200B;\n\nMicrochip isn't just your run of the mill small back water company. They actually make acquisitions of other chip companies and use their intellectual property to increase the quality and market share of their own chips. Microchip was found in 1989 and has since made 16 acquistions!!! \n\nYou may, for some reason, say that only big boy chip companies are gonna beat earnings. Well if you don't believe me think about the industries that depend on Microchip for their needs: online educational servicing companies, cloud servicing companies, cyber security companies, telecommunications companies, and just software/tech companies in general. What the hell do we already know about these industries from earnings season? We know they absolutely massacred earnings estimates as everything during COVID has gone tech. Yes, the age of actual industry is dead. Now there are only tech companies that get pumped because of sky high demand (looking at you Apple) and Amazon that sells random shit and still has a tech company valuation.\n\n&amp;#x200B;\n\nOh and you know what's awesome because we have all this knowledge? MCHP is expected to post $1.43 EPS on tuesday, but last year on this quarter they posted $1.41 EPS. What a fucking joke, we should expect at least 40-50% growth in that number from COVID induced semiconductor demand. Not to mention, I think MCHP is gaining market share and could be a big player in a few years in the semiconductor industry. \n\nYou might be hesitant because of my last post on $TER, a chip supplier that many people played incorrectly. I say to you, fuck you. I made money on that play because I sold directly at market open after they destroyed earnings like my data said they would. So if you feel even the slightest FOMO look at these charts from last week: QCOM, QRVO, and AMD; and then tell me what you think MCHP (the same industry) will do!!!\n\n&amp;#x200B;\n\nTLDR; MCHP $107c 08/07",
        "subreddit": "wallstreetbets",
        "title": "$MCHP is the next $QCOM, 300% gain potential after earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2fue2/mchp_is_the_next_qcom_300_gain_potential_after/",
        "created": 1596417899.0
    },
    {
        "author": "indonesian_activist",
        "created_utc": 1596415307,
        "id": "i2nbht",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "**Previous Posts**\n\n[https://www.reddit.com/r/wallstreetbets/comments/hx46k9/geopolitik\\_trumps\\_earnings\\_zombie\\_markets\\_part\\_vii/](https://www.reddit.com/r/wallstreetbets/comments/hx46k9/geopolitik_trumps_earnings_zombie_markets_part_vii/)\n\n**Last week Positions**\n\n&gt;SPY SELL 325C 7/31  \n&gt;  \n&gt;SPY BUY 330C 7/31\n\nWell, I think most of us managed to got out before 1 PM when it was already down to 0.02, Insane move by AAPL, never seen anything like it in decades.\n\n[https://ibb.co/GTdSXgR](https://ibb.co/GTdSXgR)\n\nSharing the image to highlight I didn't just threw darts on a map when I chose last week strike. You could've exited anytime on Friday for a profit except the last 15 mins of trading.  AAPL stock split enthusiasm and tiktok buyout rumors by MSFT(now canned) drove it past 325 eclipsing the stimulus paycheck pause\n\nLooking into next week, again for the SPY we need to think in terms of Geopolitik Say AMZN struck a deal in South Asia and MENA regions, they're set to dominate the ecommerce market there, oh just one problem. all the goods from vietnam / US can't get there because the South China Sea is being blockaded. Or GOOG invents an improvement to instant results, ie Mind Results, results pop up on your android even before you type anything, and it works on 50 different languages. Whoops won't matter if they are banned in Asia due to US loosing allies over there. Tiktok case is the reverse example of this.\n\nWho makes the most money ultimately comes down to who have MORE GUNS(and wins wars),  we will see how this play out over the next few months along with the rona pandemic. It's been this way for thousands of years ever since Roman times. This view is also echoed by the world's biggest Hedge Funds.\n\n***\"Ray Dalio's, chairman of Bridgewater capital(160B AUM) 2nd article on Geopolitics\"***\n\n[https://www.linkedin.com/pulse/big-cycle-united-states-dollar-part-2-ray-dalio/](https://www.linkedin.com/pulse/big-cycle-united-states-dollar-part-2-ray-dalio/)\n\n&gt;Governance between countries is very different from governance within countries.  That is because within countries there are laws and standards of behavior that govern, whereas between countries raw power matters most, and laws, rules, and even mutually agreed treaties and organizations for arbitration such as the League of Nations, the United Nations, and the World Trade Organization don't matter much.  Operating internationally is like operating in a jungle in which there is survival of the fittest and most anything goes.  That is what makes having a strong military so important.  \n&gt;  \n&gt;  \n&gt;  \n&gt;Where the US Is in Its Big Cycle The stats seem to suggest that the US is roughly 75% through that cycle, +/- 10%.  Is it reversible?\n\n***\"USA Net International investment position \"***\n\n[https://media-exp1.licdn.com/dms/image/C5612AQERAW2vfgiGAA/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=96260dzAt3-N2pSRGOyCAdkO0I1R6WVpsXNmI04ql5A](https://media-exp1.licdn.com/dms/image/C5612AQERAW2vfgiGAA/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=96260dzAt3-N2pSRGOyCAdkO0I1R6WVpsXNmI04ql5A)\n\n***\"EST Share of Global GDP PPP Adj\"***\n\n[https://media-exp1.licdn.com/dms/image/C5612AQHx-MIh208rUA/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=kP-tyBY78SkyYmmtbCklQ4YT1PDsOmwGaYWV541bDdQ](https://media-exp1.licdn.com/dms/image/C5612AQHx-MIh208rUA/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=kP-tyBY78SkyYmmtbCklQ4YT1PDsOmwGaYWV541bDdQ)\n\nRecall how after WW2 when everyone else was in shambles, US was gaining massively by exporting and lending, if America doesn't get it act together in facing rona, we will likely see reverse WW2 effect.\n\n**Exposure of top SPY companies revenue to China**\n\n**AAPL**\n\n[https://www.cnbc.com/2020/07/31/apple-grew-in-china-with-record-ipad-and-services-revenue.html](https://www.cnbc.com/2020/07/31/apple-grew-in-china-with-record-ipad-and-services-revenue.html)\n\n**9.33/59.7 Bn = 15.6%**\n\nIt looks like it's growing in China, but it does so by offering steep discount on BABA and JD online events.\n\n[https://www.cnbc.com/2020/06/02/apple-cuts-iphone-prices-in-china-to-keep-post-lockdown-momentum-going.html#:\\~:text=The%20iPhone%2011%20Pro%20starts,yuan%2C%20down%20from%203%2C299%20yuan](https://www.cnbc.com/2020/06/02/apple-cuts-iphone-prices-in-china-to-keep-post-lockdown-momentum-going.html#:~:text=The%20iPhone%2011%20Pro%20starts,yuan%2C%20down%20from%203%2C299%20yuan).\n\nThe pct regional revenue from China have actually decreased since 2019\n\n**YoY AAPL China's Revenue Change**\n\n[https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-5.png?ssl=1](https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-5.png?ssl=1)\n\n**AAPL Regional Revenue 4Q Avg**\n\n[https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-3.png?ssl=1](https://i1.wp.com/sixcolors.com/wp-content/uploads/2020/07/financials-2020-7-4-3.png?ssl=1)\n\nOther S&amp;P500 companies with significant China revenue exposure includes :\n\n|Ticker|Rev Pct from China|Revenue From China|\n|:-|:-|:-|\n|INTC|23.6%|15Bn|\n|QCOM|65.4%|14.5Bn|\n|BA|12.8%|12Bn|\n|MU|51.1%|10Bn|\n|AVGO|53.7%|9.5Bn|\n|CSCO|15.9%|7.6Bn|\n|TXN|44.1%|6.6Bn|\n\nNote the above shows that China is dependent on US planes and  high tech electronics components like microprocessors and specialized boards, something that they are trying to rectify fast.\n\n***\"Huawei overtaking Samsung worldwide\"***\n\n[https://cdn.arstechnica.net/wp-content/uploads/2020/07/Screen-Shot-2020-07-31-at-10.58.08-AM.png](https://cdn.arstechnica.net/wp-content/uploads/2020/07/Screen-Shot-2020-07-31-at-10.58.08-AM.png)\n\n[https://www.cnbc.com/2020/07/30/huawei-overtakes-samsung-to-be-no-1-smartphone-maker-thanks-to-china.html](https://www.cnbc.com/2020/07/30/huawei-overtakes-samsung-to-be-no-1-smartphone-maker-thanks-to-china.html)\n\n***\"Homegrown CPUs\"***\n\n[https://technode.com/2020/02/20/silicon-chinas-progress-on-homegrown-cpus/](https://technode.com/2020/02/20/silicon-chinas-progress-on-homegrown-cpus/)\n\n***\"COMAC Passenger jets\"***\n\n[https://www.bizjournals.com/seattle/news/2020/07/17/comac-boeing-airbus-arj21-regional-jets-china-buys.html](https://www.bizjournals.com/seattle/news/2020/07/17/comac-boeing-airbus-arj21-regional-jets-china-buys.html)\n\n***\"ARM vs ARM China JV Dispute\"*** \n\nARM designs the CPUs used by smartphones both iPhones and Android.\n\n[https://www.zdnet.com/article/arms-fired-china-jv-head-refuses-to-leave-company-reps-banned-from-company-premises/](https://www.zdnet.com/article/arms-fired-china-jv-head-refuses-to-leave-company-reps-banned-from-company-premises/)\n\nYes, ARM China basically just revolted and declared independence from ARM UK lol, I guess de facto, now they have their own CPU.\n\n***SPY P/E historical***\n\nMedian PE : 14.83 Current PE 7/31 : 28.12\n\nThe only period where it has been higher was Nov 2008-Nov 2009 when a lot of companies were reporting losses and reduced earnings.\n\n&amp;#x200B;\n\nBut Printer Go Brrr you say ? It's not like the 70s or 80s anymore, there are alternatives to foreign reserves now like EUR and RMB, especially with China reducing dollar use on cross border trades with currency swap agreements.\n\n**Interactive Map: The Spread of Central Bank Currency Swaps (China)**\n\n[https://www.cfr.org/article/central-bank-currency-swaps-tracker#chapter-title-0-5](https://www.cfr.org/article/central-bank-currency-swaps-tracker#chapter-title-0-5)\n\n**USD share of world's central bank foreign reserve**\n\n[https://media-exp1.licdn.com/dms/image/C5612AQHzbe3-HcXWNw/article-inline\\_image-shrink\\_1000\\_1488/0?e=1602115200&amp;v=beta&amp;t=cBpEOd\\_M36fruplE4UZR3Os8VUZkVoViR26jq7a7WuE](https://media-exp1.licdn.com/dms/image/C5612AQHzbe3-HcXWNw/article-inline_image-shrink_1000_1488/0?e=1602115200&amp;v=beta&amp;t=cBpEOd_M36fruplE4UZR3Os8VUZkVoViR26jq7a7WuE)\n\nYeah, as the world reserve currency JPOW still needs to maintain a sense of stabiity, as in not drop &gt;5% in a single month.  Otherwise all those overseas dollars will come flooding back and bam we'll have hyperinflation. So no he won't push the printer much more, for the next few weeks at least.\n\n&gt;“The path of the economy will depend significantly on the course of the virus,”  \n&gt;  \n&gt;“It’s just such an important sentence, we decided it needed to be in our post-meeting statement,”\n\nWhat he said in the FOMC last wednesday was actually very bearish, he admitted the need to keep interest rate at zero and maintain current pace of bond buying just to keep markets from crashing.\n\n**July recap for futures**\n\nSP500 ES  O: 3085  C:3269 , :+5.9% \n\nUSD DX  O: 97.38 C:93.42, : -4.06%\n\n**Last week Recap**\n\nSP500 ES  \t\tO:3210 H:3273 L:3192 C:3269 , \t\t:+1.8% \n\nUSD DX \t\t \tO:94.35 H:94.38 L:92.51 C:93.42, \t:-0.98%\n\nAfter July, It's unlikely that FED will allow USD to fall &gt;3% in August\n\n**FED Market operation schedule for next week**\n\n|Date|Time|Securities|Size|\n|:-|:-|:-|:-|\n|8/4/2020|10:10 - 10:30 a.m.|TIPS 7.5 to 30\t2/5/2028 - 8/4/2050|$1.225 billion|\n|8/5/2020|10:10 -10:30 a.m.|Treasury Coupons 4.5 to 7\t2/6/2025 - 8/5/2027|$6.025 billion|\n|8/6/2020|10:10 - 10:30 a.m.|Treasury Coupons 20 to 30\t8/7/2040 - 8/6/2050|$1.750 billion|\n\n**Last week market operations**\n\n|Date|Time|Securities|Size|\n|:-|:-|:-|:-|\n|7/28/2020|10:10 -10:30 a.m.|Treasury Coupons 0\\* to 2.25 7/29/2020 - 10/28/2022|$12.825 billion|\n|7/30/2020|10:10 -10:30 a.m.|Treasury Coupons 20 to 30\t7/31/2040 - 7/30/2050|$1.750 billion|\n|7/31/2020|10:10 -10:30 a.m.|Treasury Coupons 2.25 to 4.5\t11/1/2022 - 1/31/2025|$8.825 billion|\n\n&amp;#x200B;\n\n**21 Bn Last week vs 9 Bn this coming week,**\n\nBased on that I'm assuming USD inflates &lt;1% next week And we've seen on some days with no company news and earnings that\n\n**The SPY vs DXY is inversely correlated**\n\nHere is an extreme example from June 14th when FED announced individual corporate bond buying\n\n[https://ibb.co/V23QMzQ](https://ibb.co/V23QMzQ)\n\nSP500 earnings for next week, no mega market caps set to announce\n\n[https://www.finscreener.com/earnings/earnings-calendar/sp500?tframe=NW](https://www.finscreener.com/earnings/earnings-calendar/sp500?tframe=NW)\n\n**Jobless Claim**\n\n[https://tradingeconomics.com/united-states/continuing-jobless-claims#:\\~:text=Looking%20forward%2C%20we%20estimate%20Continuing,according%20to%20our%20econometric%20models.](https://tradingeconomics.com/united-states/continuing-jobless-claims#:~:text=Looking%20forward%2C%20we%20estimate%20Continuing,according%20to%20our%20econometric%20models.)\n\nWe see a total of 17 million continuing jobless claims, with the CARES act expired on 7/31, no more 600 dollars a week to spend on necessities/iphones or for YOLO in RH. That just reduced about 10.2 Bn USD consumer purchases from circulating in the economy. These 17 mil people may be displaced structurally as in those jobs are not coming back even if the pandemic ends. Previous record was about 7 mil in 2009\n\n**GDP Growth rate**\n\n[https://tradingeconomics.com/united-states/gdp-growth-annual](https://tradingeconomics.com/united-states/gdp-growth-annual) Annualized was -32.9% but the actual growth rate for Q2 was -9.5%, doesn't sound as bad,  in line with Euro economies but still bad. \n\nDoing stupid simple math to illustrate a concept : \n\n(SPY before Rona) x GDP Change x USD value change \n\n**339 x 0.905 x (1 + (99.82-93.42)) = 326.42** \n\n***It doesn't actually work like this, models are complex, just an example to illustrate a concept of relative value*** Markets are forward looking so if you're planning to do something like the above you should forecast Q3 GDP growth.\n\n&amp;#x200B;\n\n**Sovereign Credit Rating**\n\n[https://www.bloomberg.com/news/articles/2020-07-31/united-states-outlook-revised-to-negative-from-stable-by-fitch](https://www.bloomberg.com/news/articles/2020-07-31/united-states-outlook-revised-to-negative-from-stable-by-fitch)\n\nAs a nation that can just basically print money, getting a negative outlook is a big deal, if the US were to lose its  AAA credit rating expect more expensive debt issuance and fiscal problems down the road.\n\n## In Summary\n\n**China Clash + Rona Pandemic + Fed maintain current pace + No new stimulus deal until 8/7**\\*\\*\n\nWith those factors  SPY will finish below 327 next week. For entry confirmation assuming no news of new stimulus deal reached  I'll wait until it  dips below 325 on Monday after lunch then If it does  get in\n\n**Vertical calls credit spreads :**\n\n# SPY SELL 327C 8/7\n\n# SPY BUY 332C 8/7 (Optional)\n\n***Note: When writing calls this close to the money, you should have enough capital to handle early assignments, if you don't then move the strike a few points back to your comfort level***\n\nWe might need to exit before 8/7 depending on the state of stimulus negotiations\n\n***Alternatively If you think there will be a surprise stimulus deal of more than  2 Trillion next week, then***\n\n**SPY SELL 331C 8/7**\n\n**SPY BUY 336C 8/7**\n\n&amp;#x200B;\n\n**You may ask  what is the opposite scenario that will propel the SPY to 400 this year ?**\n\nA military engagement in the South China Seas that is won swiftly and decisively  by the US.\n\n(As likely as Nancy Pelosi becoming Trump's 4th wife)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*Obilgatory This is not an investment advice, bla bla bla..... , written by the autisticly retarded gambler*\n\n**APPENDIX**\n\n**Main Stimulus proposals**\n\n&amp;#x200B;\n\n||**CARES (from March)**|**Heroes (Democratic)**|**HEALS (Republican)**|\n|:-|:-|:-|:-|\n|Total cost of stimulus package|$2.2 trillion|$3 trillion|$1 trillion|\n|Enhanced unemployment benefit|$600 per week in addition to state benefits.|Same as CARES.|Initially $200 per week. Then up to $500 per week to match 70% of lost wages when added to state benefits.|\n|How long enhanced unemployment lasts|Expires July 31.|January 2021 for most workers, through March 2021 for gig workers, independent contractors, part-time workers and self-employed.|$200 per week bonus through September. Then 70% matching of lost wages. Extends expiration of federal benefits until Dec. 31.|\n|Paycheck Protection Program|Allocated $659 billion total in forgivable loans for small businesses, who must use 75% on payroll to be eligible for forgiveness. $130 billion remains, but expires Aug. 8.|Expands eligibility, eliminates 75% payroll requirement and extends application period to Dec. 31.|Injects another $190 billion into the PPP fund, expands eligibility and allows businesses to request a second loan. Eliminates 75% payroll requirement and expands approved uses of funds for loan forgiveness.|\n|Eviction protections and moratorium|Bans late fees until July 25 and evictions until Aug. 24 on properties backed by federal mortgage programs (Fannie Mae, etc.) or that receive federal funds (HUD, etc.)|Expands to cover nearly all rental properties in the US, extends eviction moratorium an additional 12 months, allocates $200 billion for housing programs and another $100 billion for rental assistance.|Does not address.|\n\n&amp;#x200B;\n\n**How much can you get currently (HEALS Act)?**\n\n|Desc|Scenario 1|Scenario 2|Scenario 3|Scenario 4|\n|:-|:-|:-|:-|:-|\n|Filed 2019 taxes?|YES|YES|NO|NO|\n|Filing Status|Single|Head of Household|Married|Married|\n|2018/2019 Tax AGI|80k|140k|130k|130k|\n|Dependents under 17|0|1|2|2|\n|Dependents over 17|0|0|0|2|\n|Amount|950|1325|3400|4400|",
        "subreddit": "wallstreetbets",
        "title": "⛼🌕🐺👻🧛🧟🧟‍♀ Everybody wants to rule the world, Zombie Markets Part VIII 🦇🐻",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2nbht/everybody_wants_to_rule_the_world_zombie_markets/",
        "created": 1596444107.0
    },
    {
        "author": "kaushizzz",
        "created_utc": 1597118453,
        "id": "i7kq23",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Hi all! I am a 29M and still in school pursuing a PhD in the USA. I have no student loans/cc debt etc.  I am living off a stipend, but I manage to put aside $600 each month to invest. I just started investing a couple of months ago and since I am not confident about what I am doing, I opened two brokerage accounts, one with Robinhood and the other with Chase. The Chase account is an “aggressive” (meaning approx. 90% stocks) portfolio account, in which the bank handles my entire portfolio and I simply put money in it every month. The RH account is, of course, handled by me. My idea is to continue this for a year or two and ultimately consolidate all my money into one account and close the other one, depending on which performs better. \n\nIn my RH account I have/planning to have the following stocks:\n\n**Technology:** GOOG, AAPL, MSFT, FB, AMZN, BABA, INTC, TSM, QCOM, NVDA\n\n**Finance:**  BAC, JPM, PYPL, BRK.B, V, AXP, C\n\n**Communications:** T, VZ\n\n**Consumer Discretionary:** PG, MCD, WMT, DIS, KO\n\n**Industrial:** BA, LMT, DAL, AER\n\n**Healthcare:** JNJ, UNH\n\nI do not plan to invest in ETFs as of now since I am young and able to take risks. Out of the $600 I am investing each month, $300 goes to my Chase investment account and $300 goes to my RH account. I am planning to DCA by investing an equal amount in each of the stock I own in RH, so I would like to own no more than 30 stocks, preferably 25.\n\nI have two questions:\n\n1) Is my strategy of having an RH account and another investing account with Chase a good one? Or should I just stick to one or the other from the get-go? Will having two investment accounts be an issue when I file my taxes?\n\n2) Does my portfolio look good? Am I well / over-diversified? Am I missing some obvious sectors? I think I might end up with way too many similar companies e.g. INTC, TSM, QCOM, and NVDA which is not really diversification. Maybe I should just pick one out of all such companies?\n\nAny other advice/comments about my portfolio are welcome. TIA!",
        "subreddit": "investing",
        "title": "Chase You Invest Portfolios account vs. Robinhood + Portfolio advice",
        "url": "https://www.reddit.com/r/investing/comments/i7kq23/chase_you_invest_portfolios_account_vs_robinhood/",
        "created": 1597147253.0
    },
    {
        "author": "pistonthru",
        "created_utc": 1596377653,
        "id": "i2cpec",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "The past couple month ive been really into the stock market. Ive been trading stocks only because i cannot seem to understand options (I wish i did), with some good success. Examples would be:  \n\n\nAMD = +37%   \nATVI = +28%   \nQCOM = +12%   \nRBC GLOBAL DIVIDEND GROWTH FUND = +12%  \nZDJ = +16%  \n\n\nIve had some a few losses but trying to keep a low loss so for that im okay. What im really wondering is when to get out a stock. I know im suppose to have a \"plan\" for when to get out but i mean these stocks have clear potential to go higher. Is there a rule of thumb of when to get out of a stock with profits ? or something like get out if you loose your porfits drop by 5 % ex +20% -&gt; +15% then go out. ?",
        "subreddit": "investing",
        "title": "When to get out of a stock ?",
        "url": "https://www.reddit.com/r/investing/comments/i2cpec/when_to_get_out_of_a_stock/",
        "created": 1596406453.0
    },
    {
        "author": "cambeiu",
        "created_utc": 1597381151,
        "id": "i9ft66",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "[ARTICLE](https://www.androidcentral.com/samsung-reportedly-partnering-arm-and-amd-beat-qualcomm)\n\nThis should be a red flag not only to Qualcomm but also to Intel, as it could eventually enable more laptops and even desktops to move to ARM.",
        "subreddit": "stocks",
        "title": "Samsung is reportedly teaming up with ARM and AMD to beat Qualcomm",
        "url": "https://www.reddit.com/r/stocks/comments/i9ft66/samsung_is_reportedly_teaming_up_with_arm_and_amd/",
        "created": 1597409951.0
    },
    {
        "author": "Shyamallamadingdong",
        "created_utc": 1596801583,
        "id": "i5chwc",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "US companies with highest revenue exposure to China [https://finance.yahoo.com/news/10-us-companies-highest-revenue-225350456.html](https://finance.yahoo.com/news/10-us-companies-highest-revenue-225350456.html) \n\nWhich of the high exposure companies are resistant to action by China? \n\nIs the market selloff of the highly exposed companies an opportunity to buy these stocks at undervalued prices?  \n\nFor example, Huawei accounts for something like  10% of Micron's sales. But even without Huawei business,  Micron might have significant headwinds into  2021 as  NAND gross margins have started recovering. More details: \n\n[https://finance.yahoo.com/news/micron-more-enough-tailwinds-offset-201000152.html](https://finance.yahoo.com/news/micron-more-enough-tailwinds-offset-201000152.html) \n\n [https://www.fool.com/investing/2020/08/06/why-micron-technology-stock-dropped-5-today.aspx](https://www.fool.com/investing/2020/08/06/why-micron-technology-stock-dropped-5-today.aspx) \n\nOpinions?",
        "subreddit": "investing",
        "title": "The growing anti-US sentiment in China could potentially hurt US companies with high revenue exposure to China (e.g. WYNN, QCOM, MU, QRVO) much more than companies who produce there (e.g. AAPL, NKE) and companies who make most of their money outside China (e.g. SBUX, GM, CAT, BA)",
        "url": "https://www.reddit.com/r/investing/comments/i5chwc/the_growing_antius_sentiment_in_china_could/",
        "created": 1596830383.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513481,
        "id": "i3cbpg",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "investing",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/investing/comments/i3cbpg/rate_my_stock_portfolio/",
        "created": 1596542281.0
    },
    {
        "author": "Trade_Theory",
        "created_utc": 1596513522,
        "id": "i3cc1k",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "The title says it all. Rate my portfolio. I've posted percent allocations of my stock portfolio. I do not plan to post dollar values in order to keep an unbiased opinion. My immediate plan is to sell out of PFF in its entirety and reallocate that position. If you could change one position, what would that be? I have no plans to withdraw funds or retire anytime in the near future. My primary investment objective is growth and secondary is income.\n\n&amp;#x200B;\n\n|PFF|12.2%|\n|:-|:-|\n|MSFT|10.1%|\n|SRET|9.1%|\n|V|5.7%|\n|NEE|4.6%|\n|AAPL|4.3%|\n|XLU|4.0%|\n|SOXX|3.0%|\n|WM|2.2%|\n|XLF|2.1%|\n|BRK.B|2.0%|\n|JJN|1.9%|\n|JPM|1.6%|\n|WFC|1.6%|\n|IWM|1.5%|\n|UAL|1.5%|\n|QCOM|1.5%|\n|NVDA|1.5%|\n|SPYG|1.4%|\n|MLHR|1.4%|\n|SLV|1.4%|\n|INTC|1.3%|\n|LRCX|1.3%|\n|GLD|1.2%|\n|XHB|1.2%|\n|DIS|1.2%|\n|AVGO|1.1%|\n|MA|1.0%|\n|C|1.0%|\n|QQQ|.9%|\n|PG|.9%|\n|AMD|.8%|\n|RTX|.8%|\n|XLE|.7%|\n|XOM|.7%|\n|MDT|.7%|\n|XLP|.6%|\n|BAC|.6%|\n|AEP|.6%|\n|JETS|.6%|\n|MGM|.5%|\n|RDFN|.5%|\n|BA|.5%|\n|XOP|.5%|\n|LOW|.5%|\n|JNJ|.5%|\n|STWD|.5%|\n|XLI|.5%|\n|KO|.5%|\n|TXN|.4%|\n|DAL|.4%|\n|MJ|.4%|\n|AAL|.4%|\n|SPG|.4%|\n|XLB|.4%|\n|XLV|.4%|\n|FISV|.3%|\n|T|.3%|\n|VNQ|.3%|\n|AMTD|.1%|",
        "subreddit": "StockMarket",
        "title": "Rate my stock portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/i3cc1k/rate_my_stock_portfolio/",
        "created": 1596542322.0
    },
    {
        "author": "BK_Verbs",
        "created_utc": 1597256928,
        "id": "i8j6m3",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Anyone jump in on QCOM today?\n\nI picked up 8/14 115c this morning and just sold them off +250%. Wish I would have taken a bigger position. But hey, it was free money and I’ll take it.",
        "subreddit": "wallstreetbets",
        "title": "QCOM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i8j6m3/qcom/",
        "created": 1597285728.0
    },
    {
        "author": "Dashover",
        "created_utc": 1597194839,
        "id": "i84d6i",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "\n \nFor Trading August 12th\n \nTSLA 5:1 SPLIT\n \nGOLD / SILVER COLLAPSE\n \nDJIA CLOSES 450 OFF HIGH\n \n \nToday’s market got off to a slightly higher start on DJIA and S&amp;P-500 but general weakness in the NASDAQ, again.  By the end of the day the DJIA -104.53 (.38%) was well off its +363 high and the NASDAQ was the big loser -185.54 (1.69%).  The S&amp;P 500 was -26.78 (.80) after being withing a few dollars of a new high, the Russell -9.57 (.6%), and the only winner the DJ Transports +24.59 (.23%).  Market internals were 1:1 on the NYSE but 1.5:1 down on the NASDAQ.  Volume was slightly higher than average for an August day.  The major feature of the day was the massive selloff in the precious metals.  Gold was down $125/oz. at the low and finished $1946.30 -93.40 (6%) while the Silver was lower by $3.21 to $26.049 after hitting an intraday low of $24.48.  The change at the close was 12%.  I would assume that we would see some follow-thru tonight and tomorrow early, but I bought the NEM September $65 / 70 call spread for $1.45.  This is basically the same trade I made last month on the August expo $60/65 spread @ $1.30 that we sold @ $3.20.  We also had the TBT 9/18 15 calls @ $ .40 that we sold today half @ $ .68, and the second half @ $ .74 just before they fell back to $ .55.  Not bad, with YTD now back to +34%.\n \n\nTonight’s closing comment video  https://youtu.be/EvsCZy_K1sw\n\n\nSECTORS: We didn’t have much corporate news today but QCOM won an appeals court ruling on an anti-trust case and the stock ignored the selloff and finished the day $108.83 +2.47 (2.3%).  That made it a standout as the rest of technology was hit hard again today.  It was the 3rd day down for the NASDAQ since its new closing high at $11,108.07 last Thursday.\nThe biggest news of the late day was the announcement that TESLA (TSLA) declared a 5:1 stock split.  While this is really just straight arithmetic, it does create some demand for the shares now, since when the stock split becomes effective at the end of August you would have 5 times the shares at 1/5 of the price.  But it does promote the purchase of “round lots” as opposed to “odd lots.”  Does it really increase demand?  Not really, but most stocks (like AAPL) do seem to rise on the news.  TSLA certainly did, closing $1374 -44, and then on the news rallied to its current $1467.20, over $90 higher.\nFOOD SUPPLY CHAIN was LOWER with TSN +.82, BGS -.46, FLO +.20, CPB -.63, CAG -.49, MDLZ -.49, KHC -.16, CALM +.19, JJSF -.35, SAFM +2.10, HRL -.31, SJM -.84, PPC +.27, KR -.58, and PBJ #33.32 -.37 (1.13%).\n \nBIOPHARMA was LOWER with BIIB -10.32, ABBV +.19, REGN -9.38, ISRG -8.00, GILD +.35, MYL +.39, TEVA -.07, VRTX -6.87, BHC +.16, INCY -1.32, ICPT -.25, LABU -6.96, and IBB $132.28-2.59 (1.92%).\nCANNABIS: was LOWER with TLRY -.95, CGC -.54, CRON -.06, GWPH -3.52, ACB -.14, NBEV -.02, CURLF -.38, KERN -.29, and MJ $12.95 +.01 (.08%).\n\nDEFENSE:  was HIGHER with LMT +3.03, GD +2.94, TXT -.18, NOC +6.27, BWXT +.22, TDY +1.75, RTX +.16, and ITA $172.14 +.91 (.53%).\n\n \nRETAIL: was HIGHER with M -.16, JWN +.07, KSS +.55, DDS +.66, WMT -1.33, TGT -1.22, TJX +1.08, RL +1.77, UAA +.27, LULU -8.95, TPR +.12, CPRI +.31, and XRT $50.60 -.39 (.76%).\n \nFAANG and Big Cap: were LOWER with GOOGL -12.81, AMZN -63.15, AAPL -10.52, FB -5.50, NFLX -14.89, NVDA -10.20, TSLA +50.43, BABA +.87, BIDU +.08, CMG -11.00, CAT +1.23, MSFT -3.,85, BA +.98, DIS +1.86, and XLK $112.00 -1.42 (1.25%).\nPLEASE BE AWARE THAT THESE PRICES ARE LATE MARKET QUOTES AND DO NOT REPRESENT THE 4:00 CLOSES.\n \n \nFINANCIALS were HIGHER with GS +2.42, JPM +3.58, BAC +.47, MS +1.22, C +1.17, PNC +3.32, AIG +.52, TRV +.80, AXP +1.70, V +1.46, and XLF $25.31 +.29 (1.16%).\n \nOIL, $41.61 -.33. Oil was higher in last night’s trading before we rallied in the morning on news of production cutbacks from Iraq. The stocks were HIGHER with XLE $38.20 -.13 (.34%).\n \n \nGOLD $1,946.30 -93.40, was a continuation rally and a new recovery high of $2,089.20, but we collapsed and fell as far as $1,919 -124 before coming back slightly.  Tonight, we are currently trading lower again at $1,915.70 – 30.00.  While I like the gold down here, I will have to wait and see how it acts overnight.\n \nBITCOIN: closed $11,435 -580. After breaking out over $10,000 we have had a “running correction” pushing prices toward $12,000, reaching a recovery high of $12220 yesterday. We had added 350 shares of GBTC @ $10.02 to our position of 400 @ $8.06, bringing our average price to $8.97, but sold 250 shares today @ $13.93. GBTC closed $12.54 -1.15 today.\n \n \nTomorrow is another day.\n \nCAM",
        "subreddit": "options",
        "title": "TESLA 5:1",
        "url": "https://www.reddit.com/r/options/comments/i84d6i/tesla_51/",
        "created": 1597223639.0
    },
    {
        "author": "radarbot",
        "created_utc": 1596671265,
        "id": "i4gq85",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "QCOM and Huawei just agreed to a $1.8B settlement on a patent infringement case thats been lingering:\nhttps://finance.yahoo.com/news/seismic-semi-shifts-qcom-nvda-211809341.html\n\nBeyond the settlement, it looks like QCOM is now open to supply chips to Huawei for their phones which opens up huge revenue opportunities.\n\nAlso, (I know seeking alpha is a speculative website...) there is good evidence that QCOM is a leader in 5G chips for mobile:\n\nhttps://seeking alpha.com/article/4364578-doubling-down-on-qualcomm\n\nQCOM is trading at $110 today after reporting great earnings last week. Their PE ratio looks high at 36 currently ($113 share price / 3.55 [2019 Annual EPS]) = 31.83. TDA has them at a PE of 41 but I don't know how they're doing their math.\n\nThe settlement will add $0.75 to annual EPS as paid out over multiple years. In addition to added markets, this may finally be a chance for QCOM to take off.\n\nIf the projections are true, the forward PE ratio of QCOM moves from around 31 to 19, as the price increase hasn't been factored in yet to accommodate the EPS projections.\n\nDoes anyone else feel bullish on QCOM in this competitive silicon manufacturing world?",
        "subreddit": "stocks",
        "title": "QCOM comes to deal with Huawei over patent infringement",
        "url": "https://www.reddit.com/r/stocks/comments/i4gq85/qcom_comes_to_deal_with_huawei_over_patent/",
        "created": 1596700065.0
    },
    {
        "author": "kutuzovgambit",
        "created_utc": 1596760482,
        "id": "i53v5c",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "TSMC just keeps gaining customers. They seem to be the only company doing die shrinks reliably anymore. I wish I had bought way more than $1K worth when they were sitting at $55 per share. Honestly though with Apple, Qualcomm and even Intel relying on them they could run up way more than they already have. Semiconductors are not going anywhere.\n\n [https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)",
        "subreddit": "stocks",
        "title": "TSMC reportedly gains Qualcomm orders as Samsung 5nm production falters",
        "url": "https://www.reddit.com/r/stocks/comments/i53v5c/tsmc_reportedly_gains_qualcomm_orders_as_samsung/",
        "created": 1596789282.0
    },
    {
        "author": "kutuzovgambit",
        "created_utc": 1596759914,
        "id": "i53pvn",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "TSMC said to gain Qualcomm orders as Samsung 5nm falters",
        "url": "https://www.reddit.com/r/stocks/comments/i53pvn/tsmc_said_to_gain_qualcomm_orders_as_samsung_5nm/",
        "created": 1596788714.0
    },
    {
        "author": "ld_southfl",
        "created_utc": 1596389099,
        "id": "i2fue2",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Microchip is a semiconductor company out of Arizona with a Mkt. Cap of about $26 Billion. They make chips for a bunch of products like Cyber Security, Wireless Products, and Telecommunications. The thing is that they earnings on 08/04 Tuesday after hours. It is very obvious that are going to beat earnings. Why? Because look at the rest of the industry: Qualcomm, Intel, AMD, Qorvo, and IBM have all destroyed earnings. And since Intel just told everyone that they're too retarded to even make potato chips all the smaller time semiconductor competitors are making bank, example: AMD and QCOM. \n\n&amp;#x200B;\n\nMicrochip isn't just your run of the mill small back water company. They actually make acquisitions of other chip companies and use their intellectual property to increase the quality and market share of their own chips. Microchip was found in 1989 and has since made 16 acquistions!!! \n\nYou may, for some reason, say that only big boy chip companies are gonna beat earnings. Well if you don't believe me think about the industries that depend on Microchip for their needs: online educational servicing companies, cloud servicing companies, cyber security companies, telecommunications companies, and just software/tech companies in general. What the hell do we already know about these industries from earnings season? We know they absolutely massacred earnings estimates as everything during COVID has gone tech. Yes, the age of actual industry is dead. Now there are only tech companies that get pumped because of sky high demand (looking at you Apple) and Amazon that sells random shit and still has a tech company valuation.\n\n&amp;#x200B;\n\nOh and you know what's awesome because we have all this knowledge? MCHP is expected to post $1.43 EPS on tuesday, but last year on this quarter they posted $1.41 EPS. What a fucking joke, we should expect at least 40-50% growth in that number from COVID induced semiconductor demand. Not to mention, I think MCHP is gaining market share and could be a big player in a few years in the semiconductor industry. \n\nYou might be hesitant because of my last post on $TER, a chip supplier that many people played incorrectly. I say to you, fuck you. I made money on that play because I sold directly at market open after they destroyed earnings like my data said they would. So if you feel even the slightest FOMO look at these charts from last week: QCOM, QRVO, and AMD; and then tell me what you think MCHP (the same industry) will do!!!\n\n&amp;#x200B;\n\nTLDR; MCHP $107c 08/07",
        "subreddit": "wallstreetbets",
        "title": "$MCHP is the next $QCOM, 300% gain potential after earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i2fue2/mchp_is_the_next_qcom_300_gain_potential_after/",
        "created": 1596417899.0
    },
    {
        "author": "mrpyrotec89",
        "created_utc": 1596666352,
        "id": "i4fbsh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "MAXR, QRVO, INSG, NPTN\n\nWhat I've been doing is buying these and then selling them right before the the earnings release. However i kept MAXR because news of that company killing it quarter leaked. Anyways i hope that MAXR will hit 25 tomorrow.\n\nMAXR call $22.5 09/18",
        "subreddit": "wallstreetbets",
        "title": "anybody get in on this 5G wave?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i4fbsh/anybody_get_in_on_this_5g_wave/",
        "created": 1596695152.0
    },
    {
        "author": "CoalFlavored",
        "created_utc": 1596301115,
        "id": "i1vgzk",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I tried posting in the quarterly thread but didn’t get any attention. \n\nLooking for a little discussion/direction. I have a business minor, a good understanding of personal finance, am quite experienced in funding my own retirement accounts and understanding their tax implications. However, I’ve just never bothered to take the time to get into really buckling down for the stock market. I’m in my 20s and mostly started picking my stock game up during March - I’ve bought stuff in the past, particularly penny stocks while taking finance classes in college. Here’s what I have representing approx $4k in value, why I bought it, and what I might plan to do with it - percentages are rounded:\n\n\n**PCG (10.2%)**\n\nI first bought this back in 2017 during what I thought was the big dip. Then there was a second wildfire caused by them and it slide further and further until I averaged my cost down near its low around $6. I currently have that many shares on a sell order for when it hits $10 but sometimes I feel like just dumping it altogether and moving the money on to something more useful to invest in.\n\n\n**AAL (4.3%)**\n\nI got this near one of its lows close to $13. This was more or less of a gamble since I saw that there was some room for medium term gains as long as they don’t bk. I work in the industry and have a strong sense of its direction so I’ll keep this for now until I sense things going a different direction (I don’t work for AAL in any capacity)\n\n**BOXL (3.2%)**\n\nThis is just a Covid gamble. I feel dumb for getting sucked into it but it’s only a little bit of money lost if it never goes anywhere.\n\n**NET (14.7%)**\n\nJust a company I’ve know for a long time. There’s a lot of emotion behind this one, but its objective metrics are strong anyway so I plan on continuing to find my position on this one if things continue going well.\n\n**KO (29.7%)**\n\nI first bought into Coke in 2018 as a long-term value sink and its ability to retain value while growing at a rate better than a HYSA has been just fine with me. I plan to continue adding to this.\n\n\n**TXN (32.9%)**\n\nA company with a strong history and strong fundamentals. One of my recent additions as a long-term value sink. I plan to continue adding to this.\n\n**VNQ (4.2%)**\n\nVery recently bought into this. I want to be exposed to the real estate market as well med-long term without buying an actual building so I figured a respected real estate etf made sense. I’m wondering if going for a muni bond based etf would make more sense though. This is my “non-stock” holdings that should take priority as I get older. \n\n\nRecent Specs:\n\nI've only specced on a couple of things so far, but so far so good. I've made roughly 20% in YTD gain yield off of some small working buying and selling SPCE and WFC.",
        "subreddit": "stocks",
        "title": "Educated, but Inexperienced",
        "url": "https://www.reddit.com/r/stocks/comments/i1vgzk/educated_but_inexperienced/",
        "created": 1596329915.0
    }
]