[
    {
        "author": "SnooHedgehogs6477",
        "created_utc": 1601338060,
        "id": "j1o7aq",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "These companies are Semiconductor Equipment &amp; Material or tech for you retards. They make a solid revenue and these companies keep on growing due to the demand. They are solid growth stocks that pay dividends. Especially AMAT with 50 percent revenue growth in 4 years.\n\n&amp;#x200B;\n\n Now you may think that did are overvalued but no they have 17PE ratio. Yes they might be impacted by China but it does not change the demand for their materials in USA.\n\n&amp;#x200B;\n\nEarnings for LRCX are coming up and these stocks are starting to reverse after a 20-30 percent haircut. Low IV included\n\nBuy calls now\n\n58.50 10/23  c\n\n330 10/13 c",
        "subreddit": "wallstreetbets",
        "title": "LCRX and AMAT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j1o7aq/lcrx_and_amat/",
        "created": 1601366860.0
    },
    {
        "author": "mikesmcd",
        "created_utc": 1600268042,
        "id": "itx2gg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Article on Fair Value of Lam Research (LRCX) - Great Consideration to Get Those Gains",
        "url": "https://finance.yahoo.com/news/calculating-fair-value-lam-research-142340144.html",
        "created": 1600296842.0
    },
    {
        "author": "radarbot",
        "created_utc": 1600344722,
        "id": "iui7gy",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": "The 50day MA as of writing this is 75.24. AMD is currently sitting at 74.72 pre-market. AMD hit ATH of 94.28 on September 1 before pairing back gains with the entire market.\n\nIf you believe in AMD's 3 year plan, getting in at this price may be a good opportunity. The price of AMD hasn't been this lost since July 30 when it broke through the resistance at 60 and then surged to 95 based on big earnings and INTC's poor results.\n\nThe entire market seems volatile because of the recent JPow messaging on 0% interest rates through 2023. Its understandable to be skittish.\n\nBut as a long term hold, I feel confident that AMD will see the 90's again within 1 year, which makes a nice 1 year hold to benefit from capital gains.\n\nThe main risk is the news that broke recently that Sony has cut back production estimates on PS5 due to yield issues with AMD CPUs through manufacturing. We know that AMD uses TSMC to manufacture the chips, but its unclear currently whether this news has widespread impact or what the root cause of the issue was. Any additional insight from anyone would be great!",
        "subreddit": "stocks",
        "title": "AMD about to test 50 day MA",
        "url": "https://www.reddit.com/r/stocks/comments/iui7gy/amd_about_to_test_50_day_ma/",
        "created": 1600373522.0
    },
    {
        "author": "SamHamou",
        "created_utc": 1599910299,
        "id": "irayy6",
        "num_comments": 111,
        "num_crossposts": 0,
        "selftext": " \n\nThe former largest holder of the American bank Wells Fargo &amp; Co, Berkshire Hathaway Inc of mega-investor Warren Buffett, continues to withdraw money from bank shares.\n\nBerkshire Hathaway has sold more than 100 million shares, the equivalent of $ 2.5 billion or more than $ 10 billion since June, according to a report published on Friday. As a result, Warren Buffett's company now owns only 3.3% of Wells Fargo's shares.\n\nThe North American bank reported a big loss in the second quarter of this year, with a negative US $ 2.4 billion. Credit losses and provisions were the causes, but the bank is also involved in scandals.\n\nFrom 2002 to 2016, employees used fraud to meet impossible sales targets. They opened millions of accounts in customer names without their knowledge, hired involuntary account holders for credit cards and bill payment programs, created fake personal identification numbers, forged signatures and even secretly transferred customers' money.\n\n## [Short the banks?](https://read.cash/@SamHamou/buffett-sells-100000-bank-shares-and-increases-stake-in-gold-and-coca-cola-a95715de#short-the-banks)\n\nBut it seems that it’s not just financial problems or customer treatment that Warren is withdrawing from his favorite bank.\n\nThe investor reduced its stake in Goldman Sachs, JPMorgan, PNC, M&amp;T Bank, Mastercard and Visa. While he bought a slice of Canadian mining company Barrick Gold, despite historic criticism of the precious metal.\n\nHowever, Warren has increased his positions in Apple, Coca-Cola and Bank of America. It is speculated that Warren is predicting that the effects of Covid19 will last longer than Wall Street imagined.\n\n&gt;“Accumulating money and finding gold mining attractive – suggests that he sees the crisis last longer and perhaps worsen before it gets better. No one knows whether this will be the case, but Buffett has his finger on the pulse of the economy through all the various sectors in which Berkshire operates: from freight railways to aircraft parts, insurance policies to car dealerships, building bricks from households and Fruit of the Loom underwear, Dairy Queen industrial chemicals for fast food, jewelery for private jets and more. ”  \nsays Tara Lachapelle, Bloomberg columnist\n\nBuying more gold-related assets makes a lot of sense in times of crisis, but what is the reason for increasing participation in Coca-Cola? \n\n&amp;#x200B;\n\n[https://read.cash/@SamHamou/buffett-sells-100000-bank-shares-and-increases-stake-in-gold-and-coca-cola-a95715de](https://read.cash/@SamHamou/buffett-sells-100000-bank-shares-and-increases-stake-in-gold-and-coca-cola-a95715de)",
        "subreddit": "stocks",
        "title": "Buffett sells 100,000 bank shares and increases stake in gold and Coca-Cola",
        "url": "https://www.reddit.com/r/stocks/comments/irayy6/buffett_sells_100000_bank_shares_and_increases/",
        "created": 1599939099.0
    },
    {
        "author": "slappyboom",
        "created_utc": 1599855038,
        "id": "iqy9kk",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Hello, \n\nDeath cross when 50 MA and 200 MA cross each other. Happened on /NQ overnight, last time this happened was before March COVID19 crash.\n\n[https://www.investopedia.com/terms/d/deathcross.asp#:\\~:text=The%20death%20cross%20is%20a,and%20200%2Dday%20moving%20averages](https://www.investopedia.com/terms/d/deathcross.asp#:~:text=The%20death%20cross%20is%20a,and%20200%2Dday%20moving%20averages).  \n\n\nSPY 9/21 300P",
        "subreddit": "wallstreetbets",
        "title": "Death Cross 9/11/2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqy9kk/death_cross_9112020/",
        "created": 1599883838.0
    },
    {
        "author": "imm_uol1819",
        "created_utc": 1600004300,
        "id": "iryfrv",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "After enjoying a massive bullrun since the announcement of the merger with Vivint Solar (VSLR), Sunrun does not seem to have run out of fuel. \n\nEven despite the recent NASDAQ pullback, Sunrun is already back above its daily 20 MA.\nOn the other hand, other solar energy companies such as ENPH and FSLR are almost down to their daily 50 MA.\n\nWhat surprises me the most, is that unlike let's say ENPH, the latest Sunrun's financials look pretty grim: https://ibb.co/3vVN4x0\n\nWhat's driving its price up so much?",
        "subreddit": "investing",
        "title": "The Sunrun (RUN) dilemma: why is it recovering much quicker than its competitors?",
        "url": "https://www.reddit.com/r/investing/comments/iryfrv/the_sunrun_run_dilemma_why_is_it_recovering_much/",
        "created": 1600033100.0
    },
    {
        "author": "Gatorm8",
        "created_utc": 1599266475,
        "id": "imrub8",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "After an *exciting* couple of trading days we have a much better understanding now about what happened to SPY this week. \n\n&amp;#x200B;\n\n[SPY 2020 rally support May-September](https://preview.redd.it/v7bacipb58l51.png?width=1828&amp;format=png&amp;auto=webp&amp;s=ade48f5842d1b2d5d7c99c8717d6b6ab33bd6891)\n\nAfter falling for a full day and part of this morning SPY bounced on the strong 200H MA as well as the trend line in place since May 15th. The first time SPY touched the line it rallied 7% within 2 trading days and the second time in June 5% within 2 trading days.\n\n&amp;#x200B;\n\nAs we all know... past performance does indeed promise future results, so we should see SPY back in the territory of 355 by Wednesday close. Bears thought they got some action but it turned out to be a wet dream.\n\nTL;DR SPY new highs by next Friday\n\nBulls win the day!! You can stop reading now.\n\n.\n\n.\n\n.\n\n.\n\n&amp;#x200B;\n\nOk guys listen up\n\n&amp;#x200B;\n\n[SPY Mythic Broadening Top](https://preview.redd.it/s5voeq1a68l51.png?width=1828&amp;format=png&amp;auto=webp&amp;s=ba263a0e79d09328e1f3e7bd81a1623e2dece018)\n\n&amp;#x200B;\n\nSPY is on its 7th wave of a *very rare* broadening top pattern which obviously means 200 by summer 2021. Let the bulls have their fun there is no way we go much higher. \n\nIgnore the Bullish divergence on the RSI since 2018 that doesn't matter anyway.\n\nTL;DR of the TL;DR SPY 200p 6/18/20 literally cant go tits up",
        "subreddit": "wallstreetbets",
        "title": "Bears only got a wet dream, June crash part-2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imrub8/bears_only_got_a_wet_dream_june_crash_part2/",
        "created": 1599295275.0
    },
    {
        "author": "scatterblooded",
        "created_utc": 1600134318,
        "id": "isz4iv",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "For those holding MasterCard or Visa in their portfolio, or both, what are your thoughts on these companies? Which do you prefer if you had to choose and why?\n\nI have also given some thought to PYPL and SQ, decided on buying SQ a few months ago, so not looking into alternatives. I see MA/V as slow but stable growth stocks, but would prefer to choose the one poised for the most growth. \n\nStill doing my own research, just looking for opinions from others. Lots of great info in here.",
        "subreddit": "stocks",
        "title": "MA vs V - thoughts and comparison",
        "url": "https://www.reddit.com/r/stocks/comments/isz4iv/ma_vs_v_thoughts_and_comparison/",
        "created": 1600163118.0
    },
    {
        "author": "pmor",
        "created_utc": 1599752623,
        "id": "iq5te6",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "If it crosses over at the 2 hour interval then expect a similar correction as the one you saw last week.\n\n\nThe last time it happened was on Sep 1 in the last 15 days\n\n\nNot fear mongering, just data.",
        "subreddit": "wallstreetbets",
        "title": "Just had the VIX 40 MA EMA death crossover on the 15 min",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iq5te6/just_had_the_vix_40_ma_ema_death_crossover_on_the/",
        "created": 1599781423.0
    },
    {
        "author": "rocket6733",
        "created_utc": 1599249816,
        "id": "imn71w",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "After watching Tesla, Apple, Rocket have their meteoric rise I decided to buy into them to help pay for my mail order bride. I’m nervous after the drop for the past couple of days. Keep owning or take my losses with astroglide?",
        "subreddit": "wallstreetbets",
        "title": "Bought TSLA, AAPL, MA, RKT to pay for my Kazakhstani bride",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/imn71w/bought_tsla_aapl_ma_rkt_to_pay_for_my_kazakhstani/",
        "created": 1599278616.0
    },
    {
        "author": "tzatziki_sauce202",
        "created_utc": 1599788178,
        "id": "iqh2tc",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Looks like it’s heading towards its 200 day MA - anyone thinking a rebound from there? 15 analyst have it as a buy, 0 for sell or hold.\n\nPT: $80-90 range \n\nOnline education is gaining more subscribers due to Covid - what are your thoughts?",
        "subreddit": "wallstreetbets",
        "title": "Chegg potential for upside?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iqh2tc/chegg_potential_for_upside/",
        "created": 1599816978.0
    },
    {
        "author": "alho91",
        "created_utc": 1600197782,
        "id": "itfnhe",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Why is nobody talking about the inevitable 200 day ma getting crossed by the 50 day ma?!??\n\nIs it time to sell?!?\n\nSpy 260p for January 15th\n\nEeeeeeeeeek",
        "subreddit": "wallstreetbets",
        "title": "Death Cross",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/itfnhe/death_cross/",
        "created": 1600226582.0
    },
    {
        "author": "Mado_Kureo",
        "created_utc": 1598971361,
        "id": "ikliax",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I am relatively new to hand picking stocks. Last year I made my first foray into the market and bought stock in a semiconductor company and in a cannabis company. My goal was to identify two long term industries that I thought would continue to grow after reading about the sectors and comparing the top stocks in each. One won and one lost.\n\nThis year, I broadened my stock portfolio to a number of conservative long term companies like KO, APPL, HD, MA etc. My main metric when picking a stock has been the target price. If there is more upside than downside and media surrounding the stock is positive I generally buy. If a stock gets close to its target price and the price isn't raised or the industry looks like it is going down, I sell.\n\nEven though a lot of these stocks are good set it and forget stocks, what else can I incorporate into my process that is relatively easy to review - P/E? ROE? \n\nJust looking to expand my skillset a bit before I start picking less conventional choices.",
        "subreddit": "stocks",
        "title": "Improve my stock pick process",
        "url": "https://www.reddit.com/r/stocks/comments/ikliax/improve_my_stock_pick_process/",
        "created": 1599000161.0
    },
    {
        "author": "Didi_Sky007",
        "created_utc": 1599674881,
        "id": "ipl8nk",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "What’s your take for long term hold?",
        "subreddit": "wallstreetbets",
        "title": "PayPal v VISA v MasterCard",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ipl8nk/paypal_v_visa_v_mastercard/",
        "created": 1599703681.0
    },
    {
        "author": "Napalm32",
        "created_utc": 1599166359,
        "id": "im1z0x",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So there was a correction today. I doubt that it's over, however I saw that DFS rallies today and I'm very confused as to why. V and MA tanked and banks overall tanked. So what's going on here? \n\nI own DFS and was quite puzzled by this divergence from the broader market and even its own sector.",
        "subreddit": "stocks",
        "title": "DFS is the only stock in my portfolio or on my watchlist that didn't tank today. Why?",
        "url": "https://www.reddit.com/r/stocks/comments/im1z0x/dfs_is_the_only_stock_in_my_portfolio_or_on_my/",
        "created": 1599195159.0
    },
    {
        "author": "itsgoggles",
        "created_utc": 1600172438,
        "id": "it7na8",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " ***$SUNW:***\n\nSunworks, Inc. (NASDAQ:SUNW) rose 13.8% to $0.87 in pre-market trading after gaining around 11% on Monday. SUNW is a premier provider of high performance solar power systems. “We are committed to quality business practices that exceed industry standards and uphold our ideals of ethics and safety.” Sunworks continues to grow its presence, expanding nationally with regional and local offices.\n\nSunworks has been on an upward trend since Monday, due in part by Elon’s upcoming “Battery Day” for Tesla. SUNW has been a long time installer of Tesla’s Power Wall which adds a battery to your solar network, allowing for solar power storage for times when the sun is not out and providing direct contact. We could see this one continue to run this week, will be looking for a decent dip considering this has already ran 20%.\n\n&amp;#x200B;\n\n[Upward trend confirmation on Monday](https://preview.redd.it/ph7zim1rzan51.png?width=1618&amp;format=png&amp;auto=webp&amp;s=6b50427c9d2c585712840af00fe7a4328ef9b249)\n\n ***$AAPL:***\n\nAfter dealing with the market correction beginning September 2nd, Apple has been in a free fall despite the news of new products coming today for the iPad and Apple Watch, and next month for the iPhone. Yesterday was our first taste of closing higher than open, and just like Tesla last week this may be your opportunity to get in on this high value company.  \nApple Inc. is expected to show off its latest smartwatch and iPad Tuesday amid an uptick of interest in such devices by weary, homebound users looking for help tracking exercise and logging hours of remote work and learning. The  Cupertino, Calif., tech company will hold its first virtual-only product reveal at  1 p.m. New York time from its headquarters, where past events have attracted enthusiastic crowds of journalists, employees and guests on hand to help hype the latest offerings. Chalk up  Apple's  keynote event to another annual rite changed by the coronavirus pandemic. Instead of Chief Executive  Tim Cook  unveiling the company's latest flagship iPhone as he has done every September since 2012,  Apple  is expected to focus on the new Watch Series 6 and iPad Air. The newest smartphone is expected to be revealed next month after Covid-19 related delays pushed back production. \n\n&amp;#x200B;\n\n[Reversal inc.](https://preview.redd.it/2370w2luzan51.png?width=1621&amp;format=png&amp;auto=webp&amp;s=67bbf8c8895454a20c971f2688e0633682e838bd)\n\n ***$GEVO:***\n\nChart play here. Looks to be a possible bull flag, the stock price bounced right off the 200 day moving average as support, and closed higher than open yesterday for the first time since late August. Large gap to fill up to $1.35 and then again above $2. On September 9th, GEVO showed that they have $81 million in cash on their balance sheet, removing the fear of an offering at least for the time being.\n\nIn September alone this stock dropped nearly 30%. I believe that we are due for both PR from Gevo Inc., as well as a price correction to pre-September levels.\n\n&amp;#x200B;\n\n[Bouncing right off the 200day MA](https://preview.redd.it/goi0g71xzan51.png?width=1620&amp;format=png&amp;auto=webp&amp;s=1de1c24ad14f4c97774ef13d0efba1ee1dc22a1c)\n\n ***$AIKI:***\n\nOn September 11th, AIkido Pharma Inc.  (Nasdaq: AIKI) (\"AIkido\" or the \"Company\") announced it will be featured as a presenting company at the H.C. Wainwright 22nd Annual  Global Investment Conference. The conference is being held on September 14-16, 2020  virtually. Darrell Dotson, Vice President and General Counsel, of  AIkido Pharma Inc. will provide an overview of the Company's business during the live presentation.\n\nToday is the 15th, so we are smack-dab in the middle of the conference. $AIKI was traded on our server a few weeks past, and burned a couple of us. This stock has been in an active free-fall since August 11th, and just yesterday is showing beginning signs of a trend reversal. Currently trading at .57 cents with an August high of $1.41, we have a gap to fill here.\n\n&amp;#x200B;\n\n[Consolidating.](https://preview.redd.it/hoqnkisj0bn51.png?width=1623&amp;format=png&amp;auto=webp&amp;s=6699fbe5de784c8cecab3ed1a0e43773bd02efa9)\n\n**Never forget to do your own DD; remember: For all you know, all the stocks that I mention here will dip 90% tomorrow; Do your own DD, I'm not some magic fairy. Trading will never come this easy to you. If all the stocks on here went up, I'd be chilling on my own Island.** Check out our other calls at discord.gg/TemplarTrading",
        "subreddit": "pennystocks",
        "title": "September 15th | Templar Trading Watchlist",
        "url": "https://www.reddit.com/r/pennystocks/comments/it7na8/september_15th_templar_trading_watchlist/",
        "created": 1600201238.0
    },
    {
        "author": "monsooooooon",
        "created_utc": 1600227819,
        "id": "ito52o",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "If a smooth brain like me can result in MAD GAINZ / CHAD GAINZ --- 9/02 thru 9/15 that look like meatloaf:\n\nWhen you put your mind to it, you can accomplish anyth-\n\n[https://imgur.com/a/aY3wqqW](https://imgur.com/a/aY3wqqW) \n\nCalls on Back to the Future memes",
        "subreddit": "wallstreetbets",
        "title": "\"Ma! The MEATLOAF!\" indicator -- VIX? MMs hate him! Wanna masterbait him.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ito52o/ma_the_meatloaf_indicator_vix_mms_hate_him_wanna/",
        "created": 1600256619.0
    },
    {
        "author": "XDitto9",
        "created_utc": 1600442022,
        "id": "iv7xj1",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I heard that the market is likely to fall today, given it is the quadruple witching day. So I bought some VXX, predicting that VIX would rise in the falling market. The VIX is already at quite a low point, trending below the 10 day MA, so all the more reason to rise, or so I thought. Except at the time of this writing, SPY is down -0.5%, and VIX is also down -0.4%. How come? Could it have something to do with the magic of the quadruple witching day?",
        "subreddit": "stocks",
        "title": "Why is VIX falling today? (18/9)",
        "url": "https://www.reddit.com/r/stocks/comments/iv7xj1/why_is_vix_falling_today_189/",
        "created": 1600470822.0
    },
    {
        "author": "Indy_oberon",
        "created_utc": 1599159766,
        "id": "ilzsyd",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Congratulations to all of those who started trading GOOG, AMZN, APPL, ZM, TSLA yesterday. You really did it.  \n\n[Nasdaq Largest Point Changes](https://preview.redd.it/xenv4767bzk51.png?width=893&amp;format=png&amp;auto=webp&amp;s=258bc50fc99239c11a5583e5dd2d5f32279d1e86)",
        "subreddit": "wallstreetbets",
        "title": "Look Ma, We Are Famous",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ilzsyd/look_ma_we_are_famous/",
        "created": 1599188566.0
    },
    {
        "author": "u87hi",
        "created_utc": 1599075047,
        "id": "ildpaf",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "https://www.scmp.com/news/hong-kong/transport/article/3099803/uber-steps-lobbying-effort-hong-kong-after-court-deals\n\nRide-hailing firm Uber has stepped up lobbying of the Hong Kong government after losing a critical court case on the legality of its business model, with some drivers vowing to keep carrying passengers despite the threat of an intensified crackdown.\nIn a letter to stakeholders, legislators and other policymakers on Tuesday, Uber’s local head of public policy and government affairs called on them to use their influence to persuade the government to change its stance on the company.\n“As we face this critical and uncertain period, I hope that we can continue to count on your support so that Uber and our partners can carry on serving the millions of Hongkongers who rely on our apps,” Richard Wilder said.\n“There are different ways that individuals can support Uber at this point, either by raising the issue with relevant stakeholders as you see fit or by submitting to the chief executive’s policy address consultation directly.”\n\n13\nUber arrived in Hong Kong in 2014 but has always operated outside the regulatory regime. Photo: Winson WongUber arrived in Hong Kong in 2014 but has always operated outside the regulatory regime. Photo: Winson Wong\nUber arrived in Hong Kong in 2014 but has always operated outside the regulatory regime. Photo: Winson Wong\nRide-hailing firm Uber has stepped up lobbying of the Hong Kong government after losing a critical court case on the legality of its business model, with some drivers vowing to keep carrying passengers despite the threat of an intensified crackdown.\nIn a letter to stakeholders, legislators and other policymakers on Tuesday, Uber’s local head of public policy and government affairs called on them to use their influence to persuade the government to change its stance on the company.\n“As we face this critical and uncertain period, I hope that we can continue to count on your support so that Uber and our partners can carry on serving the millions of Hongkongers who rely on our apps,” Richard Wilder said.\n“There are different ways that individuals can support Uber at this point, either by raising the issue with relevant stakeholders as you see fit or by submitting to the chief executive’s policy address consultation directly.”\nTaxi drivers hold up banners pointing to Uber’s illegal status in Hong Kong at a demonstration outside the West Kowloon Government Offices in Yau Ma Tei in February. Photo: Winson Wong\nTaxi drivers hold up banners pointing to Uber’s illegal status in Hong Kong at a demonstration outside the West Kowloon Government Offices in Yau Ma Tei in February. Photo: Winson Wong\nThe plea came after the Court of Final Appeal on Tuesday threw out the last-ditch bids of 24 Uber drivers who were found guilty of carrying passengers for hire or reward without a hire-car permit, and were fined between HK$3,000 (US$380) and HK$4,500 in 2018.\nThe defeat was a devastating blow to Uber, which has provided millions of trips to residents since arriving in 2014, as well as delivering food orders.\n“We are extremely disappointed with the court’s decision, and we will continue to support the 24 partners and their families during this challenging time,” Wilder said.\n\nThe senior executive admitted the top court’s ruling, coupled with a lack of regulatory progress on ride-sharing in Hong Kong, had “profound consequences” for Uber and the 14,000 active drivers who hoped to find flexible earning opportunities during the coronavirus pandemic.\n\n“We know that the single most common reason for becoming a driver-partner is to make up for lost income during the current economic crisis, with the second most important reason being the need to meet ongoing obligations to support their families,” Wilder said.\nFor the second quarter this year, the US-based firm posted a net loss of US$1.8 billion with global revenue dropping 29 per cent year on year to US$2.2 billion. Since the second quarter of 2019, it has exited a number of overseas markets including South Korea, India and Egypt.",
        "subreddit": "investing",
        "title": "[SCMP] Uber steps up lobbying effort in Hong Kong after court deals devastating blow",
        "url": "https://www.reddit.com/r/investing/comments/ildpaf/scmp_uber_steps_up_lobbying_effort_in_hong_kong/",
        "created": 1599103847.0
    },
    {
        "author": "MrDriver371",
        "created_utc": 1599179667,
        "id": "im5tnf",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Se qualcuno fosse interessato ad avere un piccolo rendimento mensile (40€/80€/170€), consiglio un programma di nome Nexyiu che funziona nella seguente maniera:\nPotrete aderire al programma di Nexyiu pagando una \"piccola\" somma iniziale (rispettivamente 500€/1000€/2000€ pagabili anche a rate) da quel momento in poi riceverete ogni mese per 36 mesi del denaro (40/80/170) spendibile in buoni (di ogni tipo amazon, spesa, benzina, vacanze, vestiti...) o con una carta di credito che metteranno a disposizione tra poco, in totale dopo 36 mesi riceverete in tutto 3 volte l'importo che avete dato per iniziare, fantastico no? Probabilmente vi starete chiedendo dove prendono tutti questi soldi, la loro principale fonte di guadagno è la vendita del big data, ebbene si, tutto ció che viene comprato con i soldi forniti da Nexyiu viene registrato trasformato in dati e grafici e venduto alle grandi compagnie che pagano bene (questi scambi di big data sulle preferenze delle persone avvengono giá...), in ogni caso nexyiu offre anche altri vantaggi come Nexyiu Car o Nexyiu Holiday ma che sinceramente non ho ancora utilizzato e non saprei sinceramente come presentarvelo (io ho aderito a nexyiu un anno fa e per ora ho recuperato l'importo che ho pagato per l'adesione), in ogni caso per iscrivervi avrete bisogno di un codice invito: Questo è il mio -028656- il programma conta giá circa 50000 membri, per qualsiasi domanda potete contattarmi su telegram @DukeLuke89\nbuona fortuna!\nuser.nexyiu.com",
        "subreddit": "investing",
        "title": "Oppurtunitá di guadagno in italia🇮🇹",
        "url": "https://www.reddit.com/r/investing/comments/im5tnf/oppurtunitá_di_guadagno_in_italia/",
        "created": 1599208467.0
    },
    {
        "author": "voondaba123",
        "created_utc": 1599709956,
        "id": "ipvyp1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "You really think Jack Ma, the creator of Alifuckingbaba is gonna let the markets be red tomorrow? He’s gonna be dancing around shooting glitter out of his pecker at everyone in China. They’re going to package it up and send it to America. The ‘birthday glitter’ will magically induce everyone who comes in contact with it to buy a shit tonne of whatever gets them hard. \n\nApparently, there is a fat guy in a red suit on route right now with the ‘birthday glitter’ packages. So be ready.\n\nIf that’s not DD I dunno what is.\n\nWhatever I’m still short though.\n\nUVXY 9/11 26c",
        "subreddit": "wallstreetbets",
        "title": "It’s Jack Ma’s cake day tomorrow - Sept. 10th",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ipvyp1/its_jack_mas_cake_day_tomorrow_sept_10th/",
        "created": 1599738756.0
    },
    {
        "author": "BeernerdoMazzeroli",
        "created_utc": 1600703350,
        "id": "ix2zq2",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Position: FEZ Jan15'21 42 PUT\n\nIt's time to get bearish boys. I will never bet against America because it's the greatest fucking country on earth, but our Euro brethren are fair game. \n\nThe Eurostoxx index have largely traded equally or somewhat better than the SNP thus far. I have taken a short position against the Eurostoxx due to the following reasons:\n\nHard Brexit: Two weeks ago prime minister Johnson introduced a bill that is in direct contradiction to previous agreements. His defense was basically that Europe can go eat shit, no reason needed. Germany is Europe's enforcer, however the COVID pandemic has lead to a dry run of a hard brexit and German exports largely survived. This time around they will be much less likely to fight against a hard Brexit seeing as how it's been in place for the majority of the year in any case.\n\nBanking scandals: Obvious reason. The EU economy is heavily reliant on it's banking sector. This sector is terrible and will continue lower.\n\nCOVID peeking it's ugly head again: The seven day MA of new covid cases are at all time highs in EU countries. I could give a shit about COVID, but our EU brethren are likely to implement another round of lockdowns, much more so than the USA.  American case counts are down but Europe has steadily been ticking higher.\n\nNo tech: No Amazon, no Adobe, no PayPal to save their market.\n\nCurrency: In a time of severely limited economic growth countries cannot afford to let their currencies rally, we've seen this before. I causes severe deflation and weakened financial asset prices.\n\nLack of fiscal stimulus: As usual the EU will be late to the party with further fiscal stimulus.\n\nThe timing seems perfect to open this position and option volatility on FEZ is still low. Cheers.",
        "subreddit": "wallstreetbets",
        "title": "Monday Night Bear Orgy: Time to short Europe",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ix2zq2/monday_night_bear_orgy_time_to_short_europe/",
        "created": 1600732150.0
    },
    {
        "author": "vicked_vinayak",
        "created_utc": 1599932510,
        "id": "irh1br",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "stonks",
        "title": "Look ma , I’m smort",
        "url": "https://i.redd.it/27lrpak97rm51.jpg",
        "created": 1599961310.0
    },
    {
        "author": "bs0306",
        "created_utc": 1599708831,
        "id": "ipvokb",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I've read that one of the top indicators a trader should use is the MA, SMA, or EMA, but I've heard from a few daytraders on multiple different podcasts that the MA in any form is completely useless. If so, why do so many \"investors\" always speak so much about the MA like it is a sign of the times?",
        "subreddit": "stocks",
        "title": "Is the moving average a useless indicator?",
        "url": "https://www.reddit.com/r/stocks/comments/ipvokb/is_the_moving_average_a_useless_indicator/",
        "created": 1599737631.0
    },
    {
        "author": "stoplossinvestor_98",
        "created_utc": 1599378959,
        "id": "ini6wh",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[https://stoplossinvestor.com/mastercard-massive-growth-potential-in-the-payments-space/](https://stoplossinvestor.com/mastercard-massive-growth-potential-in-the-payments-space/) Mastercard manages and licenses payment card brands including MasterCard, Maestro and Cirrus. The company generates revenues from the fees it charges its customers for transaction processing and other payment-related services. It also earns revenues by charging customers for assessments based on the gross dollar volume (GDV) of activity on the cards that carry MasterCard brands. The company operates a unique and proprietary global payments network that links issuers and acquirers around the globe to facilitate the switching of transactions, permitting account holders to use a Mastercard product at millions of acceptance locations worldwide. Its core network facilitates an efficient and secure means for receiving payments, a convenient payment method for consumers to access their funds and a channel for businesses to receive insight that is derived from its network. Mastercard authorizes, clears, and settles transactions through its core network for issuer customers in more than 150 currencies and more than 210 countries and territories.\n\n# Reasons To Buy Mastercard\n\n***Mastercard’s strategic acquisitions, alliances and technology upgrades, along with product-diversification and geographic-expansion initiatives predict long-term growth.***\n\n# Reasons To Sell Mastercard\n\n***Higher expenses, high rebates and incentives might drag the company’s margins.***\n\n## Comment below and share your thoughts. If you want to read more stock analyses, please visit my website @[stoplossinvestor](https://stoplossinvestor.com/).",
        "subreddit": "investing",
        "title": "Mastercard: Massive Growth Potential In The Payments Space.",
        "url": "https://www.reddit.com/r/investing/comments/ini6wh/mastercard_massive_growth_potential_in_the/",
        "created": 1599407759.0
    },
    {
        "author": "stoplossinvestor_98",
        "created_utc": 1599378700,
        "id": "ini5ap",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Mastercard: Massive Growth Potential In The Payments Space.",
        "url": "https://www.reddit.com/r/investing/comments/ini5ap/mastercard_massive_growth_potential_in_the/",
        "created": 1599407500.0
    },
    {
        "author": "joeythekidisamon",
        "created_utc": 1599651441,
        "id": "ipe7gg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "ES: There was a massive downtrend. Then on the Daily ES has clearly bounced off of 50 MA with strength:\n\n[https://tvc-invdn-com.akamaized.net/data/tvc\\_894339203e363890ae0e23942efc5b95.png](https://tvc-invdn-com.akamaized.net/data/tvc_894339203e363890ae0e23942efc5b95.png)\n\n&amp;#x200B;\n\nES: On the Hourly it is failing to break the retracement from the downtrend at 3371.\n\n[https://tvc-invdn-com.akamaized.net/data/tvc\\_4b354fd4e02f9a70d0fbe09a363ed599.png](https://tvc-invdn-com.akamaized.net/data/tvc_4b354fd4e02f9a70d0fbe09a363ed599.png)\n\n&amp;#x200B;\n\nES: On the 15 there is support from 50 MA but there is no signal that it is breaking through to 3371. As long as the 15 doesn't fall below 3348 and form a red candle then it's bullish. KEY. Because it's bearish ATM.\n\n[https://tvc-invdn-com.akamaized.net/data/tvc\\_90d5af008c96ad6b25bf6c18c6eb30dc.png](https://tvc-invdn-com.akamaized.net/data/tvc_90d5af008c96ad6b25bf6c18c6eb30dc.png)\n\nSentiment: The long-term shows we are in a downtrend, and the support for the downtrend to stop at is 3348. It looks like it's going for a test there now (4:37 AM PST), and in 2 hours we will see if it holds or not.",
        "subreddit": "stocks",
        "title": "TA - ES",
        "url": "https://www.reddit.com/r/stocks/comments/ipe7gg/ta_es/",
        "created": 1599680241.0
    },
    {
        "author": "Trancify",
        "created_utc": 1599187427,
        "id": "im7ty9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$KCAC – the next EV play (battery). Backed by Volkswagen, Bill Gates, Jeff Bezos, Jack Ma &amp; Tesla co-founder JB Straubel",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/im7ty9/kcac_the_next_ev_play_battery_backed_by/",
        "created": 1599216227.0
    },
    {
        "author": "HowToTradeBlog",
        "created_utc": 1599268996,
        "id": "imsg3l",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "How to Deposit Olymp Trade With Visa And Mastercard 09/2020",
        "url": "https://rss.app/articles/862477a672d6712ea008d2e6c04f74cee910b84745fb4e6b4a0799f846138f9c40f68a1892653eb0cf71b3df850907fb4854f74ec285caed52b707b03e727ca34beb26cf038f",
        "created": 1599297796.0
    },
    {
        "author": "Anon64851",
        "created_utc": 1599572869,
        "id": "iotuv3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I am into the buying/reselling market and I've stumbled upon a well-priced item. I don't have enough to complete the order I need around $40 to do so. My card got canceled last week for a fraudulent/unauthorized charge. I will pretty much lose this chance to buy the item if I wait for my card to come.",
        "subreddit": "investing",
        "title": "[REQ] ($40) - (#Boston, MA, USA), (Repay $45 on 9/15/20), (CashApp)",
        "url": "https://www.reddit.com/r/investing/comments/iotuv3/req_40_boston_ma_usa_repay_45_on_91520_cashapp/",
        "created": 1599601669.0
    },
    {
        "author": "Particular-Wedding",
        "created_utc": 1600714310,
        "id": "ix6nbf",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There is a nice convergence on the weekly and daily SPY charts at the 50 and 200 MA.\n\n&amp;#x200B;\n\n[50 MA support for the weekly](https://preview.redd.it/bmlxu839ojo51.png?width=700&amp;format=png&amp;auto=webp&amp;s=3ea5c9c64569517a1be21337bc1b1814e244e0d4)\n\n&amp;#x200B;\n\n[Daily support at the 200 MA. ](https://preview.redd.it/bq84o83fojo51.png?width=700&amp;format=png&amp;auto=webp&amp;s=43f7fd70b96b828e5537a643bf74e018f33cf75e)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Tic tac toe daily says SPY continues going below its current levels.](https://preview.redd.it/rx4yd4niojo51.png?width=700&amp;format=png&amp;auto=webp&amp;s=7bfae743d96c18b8bbcf0d3f42acb072a38bf74b)\n\n&amp;#x200B;\n\n[Tic tac toe weekly says the same thing.  In fact the sell signal was triggered last week but I was waiting for more confirmation on the daily which arrived on Friday afternoon.  ](https://preview.redd.it/iys01zonojo51.png?width=700&amp;format=png&amp;auto=webp&amp;s=a40951e8161df810d49c69cf3778f25f312ed73b)\n\nToday's selling pressure confirms the trend is down.  \n\n&amp;#x200B;\n\nTLDR: No position yet but looking to buy eod SPY 11/20 308-307p spread. I'm also playing around with the different strike widths. like maybe 312-307, the key being the short strike has to be 306 or 307 b/c that is the max gain point.",
        "subreddit": "wallstreetbets",
        "title": "SPY 306-307 Support",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ix6nbf/spy_306307_support/",
        "created": 1600743110.0
    },
    {
        "author": "stupdizbu",
        "created_utc": 1600471235,
        "id": "ivgzuh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "because you need a massive amount of balls to buy calls on a product that did a 700% increase this year thinking it won't correct back down and hard\n\nall big tech has broken through the 50 day moving average\n\nSPX just did so today too\n\nnext up, breaching the 100 day MA .. MSFT is well on their way",
        "subreddit": "wallstreetbets",
        "title": "esla calls sounds like tesla coils .. which is often confused with testicles",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ivgzuh/esla_calls_sounds_like_tesla_coils_which_is_often/",
        "created": 1600500035.0
    },
    {
        "author": "stoplossinvestor_98",
        "created_utc": 1599534420,
        "id": "iolzgb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Mastercard manages and licenses payment card brands including MasterCard, Maestro and Cirrus. The company generates revenues from the fees it charges its customers for transaction processing and other payment-related services. It also earns revenues by charging customers for assessments based on the gross dollar volume (GDV) of activity on the cards that carry MasterCard brands. The company operates a unique and proprietary global payments network that links issuers and acquirers around the globe to facilitate the switching of transactions, permitting account holders to use a Mastercard product at millions of acceptance locations worldwide. Its core network facilitates an efficient and secure means for receiving payments, a convenient payment method for consumers to access their funds and a channel for businesses to receive insight that is derived from its network. Mastercard authorizes, clears, and settles transactions through its core network for issuer customers in more than 150 currencies and more than 210 countries and territories.\n\nReasons To Buy Mastercard\n\nMastercard’s strategic acquisitions, alliances and technology upgrades, along with product-diversification and geographic-expansion initiatives predict long-term growth.\n\nReasons To Sell Mastercard\n\nHigher expenses, high rebates and incentives might drag the company’s margins.\n\nComment below and share your thoughts. If you want to read more stock analyses, please visit my website @stoplossinvestor(https://stoplossinvestor.com/).",
        "subreddit": "investing_discussion",
        "title": "Mastercard: Massive Growth Potential In The Payments Space.",
        "url": "https://www.reddit.com/r/investing_discussion/comments/iolzgb/mastercard_massive_growth_potential_in_the/",
        "created": 1599563220.0
    },
    {
        "author": "djlooseleaf",
        "created_utc": 1600117049,
        "id": "isty76",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Look ma, I made an EV company!",
        "url": "https://v.redd.it/zfm3hy9yf6n51",
        "created": 1600145849.0
    },
    {
        "author": "itsgoggles",
        "created_utc": 1600345490,
        "id": "iuie9w",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " ***$YCBD:*** \n\nOn September 9th, BZ Newswire announced that YCBD would maintain their “buy” rating and raise the price target from $3 to $4. We played the run back in the second half of July and secured decent profits before earnings. Earnings unfortunately were unimpressive, and resulted in the stock price tumbling down to $1.98 off of highs of $4.20. They had reported earnings of -$.18 cents per share, the first quarter to report negative this year.\n\nThanks to u/Kdbar for his observation and recommending that I take a look, we are now just starting to see indication of the trend reversing. Yesterday, $YCBD ran from $2.05 to a high of $2.41 before settling down at 2.26 at market close. This price action came with no direct news from YCBD, but the CBD industry as a whole moved with the announcement of Martha Stewart CBD &amp; Direct CBD Online, who carries hundreds of the world’s top CBD products on one platform. Could see the beginning of a new swing here, will be looking for an entry this morning.\n\n&amp;#x200B;\n\n[Trend Reversal](https://preview.redd.it/fu09anixapn51.png?width=1623&amp;format=png&amp;auto=webp&amp;s=94b0808419ce16789e9bb9971495a7bb841f81b5)\n\n ***$DPW:***\n\nNEWPORT BEACH, Calif., Sept. 17, 2020  (GLOBE NEWSWIRE) --  DPW Holdings, Inc.  (NYSE American: DPW) a diversified holding company (“DPW,” or the “Company”), announced that its power electronics business,  Coolisys Technologies Corp.  (“Coolisys”), is introducing its new industry leading High Density (“HD”) AC/DC power supply/switcher product line targeting the medical, industrial and telecom sectors. This new product series is designed for very high operating efficiency and power density with universal input and built-in active power factor correction (“PFC”). \n\nThe new HD Series is a power switcher product line that can produce a single output of 12VDC, 24VDC, or 48VDC and offers high power in high-density packaging even under natural convection cooling conditions. The new product line features a compact, low profile footprint, and best-in-class performance, optimized for broad industrial, telecommunication and medical applications. Additionally, the ability to operate within a wide temperature range make this new HD Series ideal for commercial off-the-shelf (“COTS”) implementations for the defense industry.\n\nInterestingly enough, although this news this morning it looks as if people knew about it beforehand. Yesterday it had positive price action closing around +6% on the day. Could be indicating an overall trend reversal, I will be watching this one.\n\n&amp;#x200B;\n\n[50 + 200 MA Crossing](https://preview.redd.it/wj7s8g20bpn51.png?width=1617&amp;format=png&amp;auto=webp&amp;s=efa5b6f5483ad0bfcaa4fad9a5d1982be9bffae2)\n\n ***$GRIL:***\n\nBurleson, Texas, Sept. 16, 2020 (GLOBE NEWSWIRE) -- Muscle Maker, Inc. (Nasdaq:GRIL) the parent company of Muscle Maker Grill, Healthy Joe's &amp; MMG Burger Bar, a fast-casual concept known for serving \"healthier for you\" meals, today announced that it has signed a lease and a letter of intent to open two new ghost kitchens in the boroughs of Manhattan and Brooklyn in New York City. Upon opening, the company will be operating nine ghost kitchen facilities, covering three major cities within the U.S.  \n\nEach ghost kitchen location will serve all three of the company's food concepts including Muscle Maker Grill, Healthy Joe's and Meal Plans AF. These locations will provide food to customers via 3rd party food delivery applications i.e. DoorDash, GrubHub, Seamless, UberEats, Postmates, ChowNow and Caviar. The Manhattan location is unique in a sense that, while it will operate as a ghost kitchen, its location offers forward facing capabilities for guests. The location is situated in a walk-up food court setting, and once restrictions are lifted in NYC at the end of this month, will give customers not only the opportunity to pick up food for themselves but a place to sit down and eat it as well. We believe this combination will bode well in the Tribeca neighborhood of Manhattan where high end residences are mixed with commercial buildings. The Tribeca neighborhood of Manhattan is one of the wealthiest neighborhoods in the country with a median age group of 35 and with the ability to serve roughly 3.5 million people within a one-mile radius.\n\nGRIL had a public offering close on September 11th priced at $1.70 per share. This caused the price to fall down to $1.50 before consolidating. After hours yesterday we saw the first signs of upward momentum, and considering the stock is still priced under the offering amount at $1.55, will definitely be looking for a swing entry this morning.\n\n&amp;#x200B;\n\n[Still below offering price.](https://preview.redd.it/tpmgox44bpn51.png?width=1627&amp;format=png&amp;auto=webp&amp;s=a43d717234c0a195762646362ece7b5b96dd42ae)\n\n**Never forget to do your own DD; remember: For all you know, all the stocks that I mention here will dip 90% tomorrow; Do your own DD, I'm not some magic fairy. Trading will never come this easy to you. If all the stocks on here went up, I'd be chilling on my own Island.** **Join our community at discord.gg/TemplarTrading**",
        "subreddit": "pennystocks",
        "title": "September 17th | Templar Trading Daily Watchlist",
        "url": "https://www.reddit.com/r/pennystocks/comments/iuie9w/september_17th_templar_trading_daily_watchlist/",
        "created": 1600374290.0
    },
    {
        "author": "djlooseleaf",
        "created_utc": 1600118775,
        "id": "isujnw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Look ma, I made an EV company! NKLA 1000c 9/18",
        "url": "https://v.redd.it/xsbjdf83l6n51",
        "created": 1600147575.0
    },
    {
        "author": "djlooseleaf",
        "created_utc": 1600119966,
        "id": "isuxho",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Look Ma, I made an EV company! NKLA 1000c 9/18",
        "url": "https://v.redd.it/e5cwag2ko6n51",
        "created": 1600148766.0
    },
    {
        "author": "hydershykh",
        "created_utc": 1600653588,
        "id": "iwrbtu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I was looking at some options flow from airlines mid last week and realized that it was quite an imbalance between the CALL premiums and PUT premiums. The chart setups were all looking great so I thought about giving them a few more days before taking a look again. I analyzed the flow today and it looks like airlines are gaining some momentum by options traders. Let's do some DD, shall we?\n\nFor the analysis, we only consider five airline symbols and option contract trades with premiums above $25k. \n\nIn order to start our analysis, let us first take a look at the aggregated options flow from the week of **September 8th to September 11th**. Below are the aggregated stats:\n\n[Aggregated Options flow from the week of September 8th to September 11th, 2020](https://preview.redd.it/ccd8ael7reo51.png?width=739&amp;format=png&amp;auto=webp&amp;s=b48975fc9806276bf0a972ceaaf015cd0d972ca9)\n\nA couple of observations from here. Most airlines had a pretty even flow **except $DAL** which moved quite a bit this week because of the large flow in the September 8th week. But the other airlines had a fairly low options flow.\n\nNow, let, us take a look at this week's option flow which is significantly different.\n\n[Aggregated Options flow from the week of September 14th to September 18th, 2020](https://preview.redd.it/fv57rwz1reo51.png?width=736&amp;format=png&amp;auto=webp&amp;s=9861fa877c2d52a7026bb0fb01adeda53ba8ad5b)\n\nPretty clear differences here. Although we had one more trading day last week, the premiums and volume is way higher than the week prior to that. There are some stark differences in the call and put flow.\n\n* **$AAL** had some differences in volume but almost the same premiums for both CALLs and PUTs. That has been a consistent pattern. If I want to go long on airlines, I'll stay away from AAL just based on the flow.\n* **$DAL** as usual had a difference of 13 million between CALL and PUT premiums. That is massive. The volume was also 3x.\n* **$JETS** had a way higher volume for CALLs than PUTs. The premiums are also like 4x for CALLs vs PUTs. This is excellent for someone who wants to go long on airlines and JETS right now.\n* Both **$UAL** and **$LUV** were also massive on the CALL volume and markedly low on PUT volume. The same goes for premiums. Things are heating up!\n\nIf you look at the price action of some of the airlines, you can also see bulls taking over for the last few days. Let's do that as well. I will draw a few loose trend lines to show that the airlines have been on a slow bullish run for the past few days and based on the flow, that is expected to continue.\n\n[UAL has a trend line and is right on the 20 MA right now. ](https://preview.redd.it/jxi0bbn5qeo51.png?width=1570&amp;format=png&amp;auto=webp&amp;s=71d644fefda561ef4be2e114fb2633b327d7ce24)\n\n[JETS also has a slightly loose but clear trend line](https://preview.redd.it/s4rzx78bqeo51.png?width=1564&amp;format=png&amp;auto=webp&amp;s=0e23556daab17115283677ba02d9a4f266e15d42)\n\n[DAL needs to come down just a bit before it becomes a good bullish setup.](https://preview.redd.it/r6dytcahqeo51.png?width=1559&amp;format=png&amp;auto=webp&amp;s=eda952747457fae46646d30f8c45034952f8e01c)\n\nThat's it from me folks. Hope you like the analysis and will keep an eye on the airlines. Would love to hear everyone's thoughts and hope you folks have a fantastic week ahead.\n\nCheers",
        "subreddit": "smallstreetbets",
        "title": "Airlines are Gaining Momentum - DD &amp; Options Flow from Last Week",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/iwrbtu/airlines_are_gaining_momentum_dd_options_flow/",
        "created": 1600682388.0
    }
]