[
    {
        "author": "notbrokemexican",
        "created_utc": 1593292984,
        "id": "hh1t4k",
        "num_comments": 118,
        "num_crossposts": 0,
        "selftext": "[https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Kansas\\_City\\_Southern\\_Railway\\_system\\_map.svg/2880px-Kansas\\_City\\_Southern\\_Railway\\_system\\_map.svg.png](https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Kansas_City_Southern_Railway_system_map.svg/2880px-Kansas_City_Southern_Railway_system_map.svg.png)\n\n# \n\n# \n\n# # WSB Learns Chapter 2: An Introduction to the Mexican-American Economy\n\n&amp;#x200B;\n\n# # Calls\n\n\\- KSU 7/24 145c\n\n# # My motivation\n\nI am a Mexican-American software engineer in the US &amp; avocado farmer in Mexico. I'm here to bring **TAQUITOS** during these trying times. I have come with fresh research off the tortilla press for my amigos at Wall Street Bets\n\nI'm sitting here getting used to my **NEW  Gigabyte 17 with NVIDIA RTX** that I bought with the **TORO PLAY** from my last DD on CDN infrastructure &amp; serverless computing. It was quite successful, as Fastly rallied beyond the success of market favorites like Zoom.\n\nI need to get used to the keyboard and writing on non-Macs again so I figured to write about my next play. ***Kansas City Southern is a very uniquely positioned business that plays an important role in all of our lives. It is the rail the connects the US and Mexico and it will grow with the release of USMCA on July 1st and Trump's infrastructure bill.***\n\n*My style of investing is principled by exercising common sense and investing in deep market relationships - I am not generally interested in investing in only a product, but how the product fits and its impact on an economic model*\n\n# # USMCA FACTS\n\n&amp;#x200B;\n\n[Mexico is critically underbanked and underserved by technology and trade potential. Bullish for CDNs, telecom, &amp; fintech](https://preview.redd.it/446zfa81ji751.png?width=1845&amp;format=png&amp;auto=webp&amp;s=e0f9608f5f21eff915b87babb4edc25e4c0703df)\n\n&amp;#x200B;\n\n# \n\n[Agriculture and seasonal patterns in Mexico &amp; the US is robust and symbiotic](https://preview.redd.it/yrx7ds7aji751.png?width=1815&amp;format=png&amp;auto=webp&amp;s=9b16cfe5457a535e17db9728fda6eded8c24bc86)\n\n&amp;#x200B;\n\n[Bullish for shipping and supply chain operations \\(Shopify, Walmart, Costco, rail\\)](https://preview.redd.it/u4onq6olji751.png?width=1876&amp;format=png&amp;auto=webp&amp;s=b96291e678cc69b289b1d2394f4288fd73c29e92)\n\n&amp;#x200B;\n\n[Bullish note on energy markets, where efficiencies will need to increase to accommodate new asset allocations](https://preview.redd.it/ic44vfarji751.png?width=1080&amp;format=png&amp;auto=webp&amp;s=6e91a78c655c89037765de777b1dcfea961bf949)\n\n&amp;#x200B;\n\n# # Important Relationships\n\n* Financial services expanding trading opportunities\n* US-Texas economics\n* Mexican-Nuevo Leon economics\n* Texas growing mastery in energy and supply-chain markets\n* Mexican need for increased energy effeciency &amp; market regulation\n* The South Texas Basin &amp; North Mexican potential for natural gas\n* The Gulf of Mexico Liquid Natural Gas pipeline\n* Laredo border, Houston, Monterrey position in world trade.\n* The undoing of economic bottlenecks in natural gas and digital trade\n\n# # What to Consider\n\n\\- My calls are **always** an exercise of common sense. Mexico and the US have a tightly coupled trading relationship. The USMCA stands to invigorate that relationship and emphasize successes in energy production, manufacturing price parity, and tech-invoked trade access. The exercising of law will result in institutional confidence, resulting in reasonable profits from July-September.\n\n&amp;#x200B;\n\n[Mexico is Buy American as a nation. It has a tightly coupled relationship with American output.](https://preview.redd.it/jcz0alawji751.png?width=1600&amp;format=png&amp;auto=webp&amp;s=7a85687aafa11d3bf4e600e380f08fdea89eea52)\n\n&amp;#x200B;\n\n\\- NAFTA ends June 30th and the USMCA goes into effect July 1st. The US is the last nation ready to prepare the changes.\n\n\\- Trump will soon be under pressure for some form of economic stimulus. This may be in the form of an infrastructure bill by the time September or the election rolls around.\n\n\\- The USMCA modernizes up cross border digital trade and seeks to modernize some structural changes that have transformed in the energy industries invoking industrial surplus. This will increase the rate of exchange\n\n\\- These changes from Facebook (WhatsApp), Walmart, Amazon, Costco, Shopify, Cloudflare, Paypal, and other important supply chain players like **SMALL BUSINESS OWNERS** to supercharge trade between the two nations.\n\n\\- These changes also encourage energy production between US &amp; Mexico, where Mexico has fallen behind and Texas has exceeded.\n\n\\- **NO** this DD is not about the obvious auto-manufacturing benefit. It is an important factor but there is plenty of evidence that only focuses on that element of the USMCA.\n\n\\- Kansas City Southern is one of the ten Class-I Railroads of the US. It is the **ONLY** Class-I Railroad that connects the US &amp; Mexico and runs along the Gulf of Mexico.  This results in streamlined cross-border energy and product trades. This also means that **KSU** **stands to agnostically benefit from economic improvements in energy output and nation building from both the US &amp; Mexico.**\n\n\\- Mexico is an important bulwark nation for the US to bolster as a partner against Chinese economic threat. Its relationship with US is far different than international partners like Germany, India, and Japan. There is a far greater efficiency potential between the two nations across many industries related to logistics, mining, energy, manufacturing, telecom, and agriculture.\n\n\\- Mexico's higher education and English learners have rapidly increased as Mexico radically approaches middle incomes and its narcotics problem. By most accounts, the US is least behind in terms of social policy regarding The Drug War. The US stands to adapt and benefit most rapidly from the economic bottleneck the Drug War has produced.\n\n\\- Migration is complex between the two nations. It is arguably a symbiotic relationship regarding wages, education, crime, and currency parity with respects to US &amp; Mexico.\n\n&amp;#x200B;\n\n[1994, the signing of NAFTA was a consequential inflection point in economic history.](https://preview.redd.it/73u5e39bki751.png?width=3045&amp;format=png&amp;auto=webp&amp;s=2a8296fa4d5fb1797d141f936c4809c683b022e4)\n\n&amp;#x200B;\n\n[Mexico serves as important trading vector and access point to increase global price efficiencies in auto markets, energy, materials, agriculture, and labor.](https://preview.redd.it/c4ej9hcrki751.png?width=638&amp;format=png&amp;auto=webp&amp;s=0062950618749d315101fb97d09237db961e2d40)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # The Product\n\nKansas City Southern is a relatively small railroad compared to other systems like Union Pacific. You can argue that this is beneficial as is allows the railroad to execute and iterate more rapidly to changes and optimize for efficiencies that larger railroads cannot.\n\nKSU does this with **Precision Railroad Scheduling** along with other Class-I railroads but to great effect. In simple terms, this means that railroads prioritize the scheduling of arrival and departures over the weight and output of each train run. This has resulted in\n\n* Greater speed\n* Greater flexibility to economic changes (Amazon, energy, etc)\n* Greater competition to trucking\n* Increased fuel efficiency\n* Greater economic output\n* Reduced costs for rail trade\n\n*This is an excellent primary for economic growth.*\n\n&amp;#x200B;\n\n[List of traded goods managed by KSU](https://preview.redd.it/jwed8v3hoi751.png?width=1169&amp;format=png&amp;auto=webp&amp;s=0a1cb82b7dcfa7ab59a727bc50991c9d303e3ef7)\n\n&amp;#x200B;\n\n[Diversified to benefit &amp; reflect Mexican-American progress](https://preview.redd.it/6qvks6g0oi751.png?width=2386&amp;format=png&amp;auto=webp&amp;s=422e6aa0728e13e9fab0a76893522317a015a9cb)\n\n# \n\n[Institutional restructuring](https://preview.redd.it/bd6h7tpzoi751.png?width=543&amp;format=png&amp;auto=webp&amp;s=3958e442f2cce7001739fbc333689ba5c7a56379)\n\n# \n\n&amp;#x200B;\n\n[Market ineffeciencies will rebalance with USMCA changes.](https://preview.redd.it/kjlml0x5pi751.png?width=540&amp;format=png&amp;auto=webp&amp;s=2a4a562b56d075fd1b6c6229f823aa8e5718c3f3)\n\n# \n\n# # The Macroeconomic view of Texas &amp; Nuevo Leon's economic zones\n\nThe reality is that there are logistical positions in Texas and Monterrey trade vectors that is strategically advantageous. Monterrey is a trading city located near the southern border that operates as an important global industrial zone for products and services delivered from Samsung, MSCI Financial, Toyota, Siemens, and the like because the region's geography permits it.\n\nThe story is quite simple. Mexico needs more energy output. Texas has it. Mexican can grow it. The USMCA is designed to directly benefit the economies of Mexico &amp; Texas.\n\nMonterrey, of course, is not the only important vector in Mexico that KSU falls under. Guadalajara, Jalisco houses Tesla operations and runs global avocado trade alongside the State of Michaocan. There are plenty of other examples.\n\n&amp;#x200B;\n\n[Two cooperative, regional populists at the helm.](https://preview.redd.it/vh7j05cjpi751.png?width=2110&amp;format=png&amp;auto=webp&amp;s=481c9586327f6814f5d86ce923dcc5e5fc139612)\n\n&amp;#x200B;\n\n[Mexico is primed for American economic bolstering and standardization.](https://preview.redd.it/tvx4tpzspi751.png?width=2099&amp;format=png&amp;auto=webp&amp;s=04572fca1361c4e73db8a38ad1f70672973daa7c)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[KSU overlaps directly with state growth points](https://preview.redd.it/jqk2m167qi751.png?width=1207&amp;format=png&amp;auto=webp&amp;s=9c336ca6fc6ac69001cb648128055a3f85eb95a9)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Mexico's untapped energy potential behaves almost like an extension of Texas and south basin opportunities.](https://preview.redd.it/xy5q9ifrqi751.png?width=1553&amp;format=png&amp;auto=webp&amp;s=0417e4b0890d69eade5084407aff8aab6ca4d34d)\n\n&amp;#x200B;\n\n[KSU ultimately double-dips from the changes.](https://preview.redd.it/97regzxvqi751.png?width=1478&amp;format=png&amp;auto=webp&amp;s=49a0575d213a99365721ad3c6513745330d174ec)\n\n&amp;#x200B;\n\n[Texas GDP 1.8T. Mexican GDP 1.2T.](https://preview.redd.it/qrb4z2ibri751.png?width=1111&amp;format=png&amp;auto=webp&amp;s=b36d0cdec94557e9860a8d1b5666ca6864f5c19e)\n\n&amp;#x200B;\n\n[KSU advantages optomizes cross-border trading directly with Mexico's strategic advancement of Monterrey](https://preview.redd.it/lk8lx7mcsi751.png?width=2387&amp;format=png&amp;auto=webp&amp;s=73eb40a1f0f2b84dbd6305b7cd7629bd4a4630f6)\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n* REDACTEDcoin &amp; AMD's computing relationship (Bought REDACTEDcoin at 2k, AMD at $11)\n* E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n* Privacy \\[CloudFlare, Big Tech, US, China, and global development\\]\n* Automation, manufacturing, and battery improvements \\[Panasonic, FANUC, Texas, Mexico and Japan\\]\n* Mexican-American trade \\[Kansas City Union, USMCA, and the Mexican economy\\]\n* Virtual Reality, gaming, AI with user-experience support, and fintech \\[Zoomers &amp; you\\]",
        "subreddit": "wallstreetbets",
        "title": "ALL ABOARD THE TRUMP TRAIN! KANSAS CITY SOUTHERN RAIL &amp; USMCA DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hh1t4k/all_aboard_the_trump_train_kansas_city_southern/",
        "created": 1593321784.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1592009346,
        "id": "h7x4l6",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "[https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee](https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee)\n\n[Cloudflare - Big Security](https://preview.redd.it/qvl409c9pk451.png?width=2018&amp;format=png&amp;auto=webp&amp;s=bc1334602948f2f82894dffee54fb2615ca0a220)\n\n# NET $40c 8/21\n\n# NET 35c 7/17\n\n# # WSBLearns Chapter 1 : An Introduction to the Cloud Computing Economy\n\n\\### Goals\n\n# - Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n&amp;#x200B;\n\n# # My Motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry. Theyre going to be printing a lot of money at a steady pace for a very long time and I thought you guys should know since you're all so desperate and pathetic right now for something good.\n\n&amp;#x200B;\n\n# # In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n&amp;#x200B;\n\n* Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n* Offering a way to not lock your organization into a big tech vendor\n* Promoting security and challenging Big Tech's direction with web development\n* Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n* Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1) and distributing VPNs.\n* Growing a rapid, robust, cost-effective, and secure network across the world\n* *Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing.* \\-&gt; **YOU ARE HERE**\n\n&amp;#x200B;\n\n\\- Creating a better internet.\n\n&amp;#x200B;\n\n[This is the fucking Co-Founder of NPM who pioneered streaming technology en masse for developers.](https://preview.redd.it/zon44fsapk451.png?width=1204&amp;format=png&amp;auto=webp&amp;s=a1838127869af81ba9ff2fcaa50f4b8e2028af51)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # The Thesis\n\nThe economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.\n\n&amp;#x200B;\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[The network has enormous inherent value. Just look at Akamai's stock history for example. This data has been \\\\\"crunched\\\\\". 2-5 years accelerated in 1.](https://preview.redd.it/8fhkpr6cpk451.png?width=696&amp;format=png&amp;auto=webp&amp;s=3e2d6301242fd7526116a116cd27bb0d101d6bc4)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. This market is **\\*\\*BIG\\*\\*** and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.\n\n&amp;#x200B;\n\n[Z-Scaler makes bank off manufacturing and supply chain operations](https://preview.redd.it/xzj23zndpk451.png?width=1880&amp;format=png&amp;auto=webp&amp;s=7e5e7aad5ede4a438f5eeffad6c4bfb1f8ae363b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Cloudflare prioritizes hospitals and offers a lot of good shit for very little.](https://preview.redd.it/jcusezeepk451.png?width=1912&amp;format=png&amp;auto=webp&amp;s=c5a66a435eb01690854f53eb3b63c5ca3a332100)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Amazon and FB obvious target web retailers more](https://preview.redd.it/bws0ruafpk451.png?width=1926&amp;format=png&amp;auto=webp&amp;s=22bf2d5ac9eb01d871f16cdee3f25bb3a1c28946)\n\n&amp;#x200B;\n\n[Fastly targets fast media and video processing. PAN Network? That's Fastly delivering it without it sucking like Reddit Videos.  That's what happens when you build one product really well.](https://preview.redd.it/h8ur2w3gpk451.png?width=1308&amp;format=png&amp;auto=webp&amp;s=b15f3c6270019ba2fc3e33c0be6731a86c6dbb72)\n\n&amp;#x200B;\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\n&amp;#x200B;\n\nNET is one of the best positioned companies to pioneer this market at scale.\n\n&amp;#x200B;\n\n# # Market drivers &amp; a brief history of modern computing\n\n&amp;#x200B;\n\n[This technology spearheaded us toward 5G.](https://preview.redd.it/qaokr6bhpk451.png?width=795&amp;format=png&amp;auto=webp&amp;s=973e2994fd2781b53299527e4966a5ef92dce117)\n\nThe history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and  tunnels of water that the market had created.\n\n&amp;#x200B;\n\nAs many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like [Twitch.tv](https://Twitch.tv) which would \"stream\" video.\n\n&amp;#x200B;\n\nWhat had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)\n\n&amp;#x200B;\n\nThe paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nToday, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[A solo developer can have a student upload a meme for an assignment, have that image analyzed for text, and automatically answer the question if it was right.](https://preview.redd.it/a645yz1jpk451.png?width=1626&amp;format=png&amp;auto=webp&amp;s=c0ce37c55836f08c86b95a5dec4150f247b7d175)\n\n&amp;#x200B;\n\n# # What is serverless computing?\n\n&amp;#x200B;\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.\n\n&amp;#x200B;\n\n[Out of the box business solutions.](https://preview.redd.it/7qq6h6ujpk451.png?width=1330&amp;format=png&amp;auto=webp&amp;s=b0bf6314cf4c937427ff4011c3891eebc11477b4)\n\n&amp;#x200B;\n\n# # Other competitive advantages of network and cloud computing\n\nThe reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Deep investments in infrastructure means DEEP growth](https://preview.redd.it/svayplokpk451.png?width=1866&amp;format=png&amp;auto=webp&amp;s=1bcc17951f303841dcaaa13f54063f927efd7dac)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its ***\\*\\*privacy-first approach\\*\\**** and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.\n\n&amp;#x200B;\n\nThis is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Extremely high quality engineering = less costs = more market capture](https://preview.redd.it/pu4xoq3mpk451.png?width=1624&amp;format=png&amp;auto=webp&amp;s=6b4217b2bad4ffa80c00439499b00c79c420b77b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Good relationships with enterprise = money city. JD, Shopify, Facebook, Baidu, Microsoft, Google, the list is endless.](https://preview.redd.it/3jzf2xunpk451.png?width=1660&amp;format=png&amp;auto=webp&amp;s=860f163fe96972a221cfd356174e747535144d25)\n\n&amp;#x200B;\n\n# # Where Does CloudFlare currently stand in the market?\n\n&amp;#x200B;\n\n[These needs have only dramatically increased since covid.](https://preview.redd.it/djrvsq5zpk451.png?width=600&amp;format=png&amp;auto=webp&amp;s=634caaa6d9abe482ed7d7c5c6bb57768c91b552e)\n\n[How they view themselves in the market.](https://preview.redd.it/oicb754ypk451.png?width=1670&amp;format=png&amp;auto=webp&amp;s=ef1d3a8eeecf161a6387bf10cfbc1a4e389de52e)\n\n&amp;#x200B;\n\n[The local ecosystem.](https://preview.redd.it/tzcutumwpk451.png?width=1152&amp;format=png&amp;auto=webp&amp;s=158913217acdde59fd175ead4203cbe45481e842)\n\n&amp;#x200B;\n\n[Cloudflare is cyber security](https://preview.redd.it/nus93moopk451.png?width=1080&amp;format=png&amp;auto=webp&amp;s=02bea0bdefa6cbd00fb31410d4783415a3b8443e)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Cloudflare allows Big Tech to tackle challenging issues they face as they scale with sensitive data.](https://preview.redd.it/ewkm8hhqpk451.png?width=1284&amp;format=png&amp;auto=webp&amp;s=7f2d75d76f3292a36f3e11778ab859b8031f9a47)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Their network is larger than Amazon and theyre trusted around the world much more than other networks.](https://preview.redd.it/d56i8543qk451.png?width=2192&amp;format=png&amp;auto=webp&amp;s=5696ee749fe79f6dd660c7e3b9c8d2ed39b8a8ee)\n\n&amp;#x200B;\n\n# cant post more than 20 images because Fastly and Reddit sucks\n\n&amp;#x200B;\n\nvs Amazon below\n\n&amp;#x200B;\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png](https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # Deep market relationships\n\nCloudFlare has had large scale investments, partnerships, and business ventures with organizations like:\n\n&amp;#x200B;\n\n# JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png](https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png))\n\n&amp;#x200B;\n\n# Supporting recent legends like Shopify\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png](https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png))\n\nhttps://preview.redd.it/nch0x7k1qk451.png?width=1254&amp;format=png&amp;auto=webp&amp;s=9303863a87f0cb84c408b414b89bd50e38b56a63\n\n&amp;#x200B;\n\n# Growing with global industry leaders\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png](https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png))\n\n&amp;#x200B;\n\n# A competitive proxy that approaches Big Tech's biggest legal problems\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png](https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # So what does this mean for CloudFlare?\n\n# ## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\n# ### Target: Enterprise, profits, generosity, and long-term market capture.\n\n&amp;#x200B;\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.\n\n&amp;#x200B;\n\n# Piece 1: Easy to use, distributed, private, secure networking\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png](https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 2: Easy to use, distributed, secure, cost-effective streaming\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png](https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png](https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 4: Easy to use, distributed, secure, cost-effective software development\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png](https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png](https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\n&amp;#x200B;\n\nI have made a fair amount of money with\n\n&amp;#x200B;\n\n# - REDACTEDcoin &amp; AMD's computing relationship (Bought REDACTEDcoin at 2k, AMD at $11)\n\n&amp;#x200B;\n\n# - E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\ncurrently investing heavily in:\n\n&amp;#x200B;\n\n# - Privacy [CloudFlare, Big Tech, US, China, and global development]\n\n&amp;#x200B;\n\n# - Automation, manufacturing, and battery improvements [Panasonic, FANUC, Texas, Mexico and Japan]\n\n&amp;#x200B;\n\n# - Mexican-American trade [Kansas City Union, USMCA, and the Mexican economy]\n\n&amp;#x200B;\n\n# - Virtual Reality, gaming, AI with user-experience support, and fintech [Zoomers &amp; you]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare $NET DD - Cloud Infrastructure &amp; Security",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7x4l6/cloudflare_net_dd_cloud_infrastructure_security/",
        "created": 1592038146.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591163589,
        "id": "gvo3ph",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "# edit: Looks like images arent previewing tonight.\n\n# tl;dr: $40c 8/21 &amp;&amp; 35c 7/17\n\n&amp;#x200B;\n\n# # Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n# # The thesis\n\nThe economic value and convergence between e-commerce, networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall development cycle.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. NET is one of the best positioned companies to pioneer this market.\n\n[The networking market](https://mordorintelligence.com/images_db/RD_Images/1556091324027_Picture2.png)\n\n# # My motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\n[CloudFlare Distributed Video Support](https://pbs.twimg.com/media/EZN7_YMVAAAE8Qg.jpg)\n\n&amp;#x200B;\n\n# # In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1/) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world\n\n\\- **\\*\\*Providing a development platform that promotes the use extremely powerful and 'cutting edge' computing. -&gt; YOU ARE HERE**\n\n&amp;#x200B;\n\n[Cofounder of NPM - a module system where software developers shipped code. Acquired by Microsoft in the past year.](https://preview.redd.it/2upgkb0gvl251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=4fc9c9c151e75d4b03671760e927bc5a75e8bc85)\n\n&amp;#x200B;\n\n# # So what is this technology anyway? A content delivery network.\n\nCDNs are distributed datacenters. This technology has been rapidly improving in the past 5 years and has drastically reduced the cost of business for small businesses and enterprises alike.\n\nThinking trucking logistics. You need to load up and send heavy duty materials, safely, quickly, and across multiple checkpoints along a highway.\n\nAn easy way to think about CDNs is to imagine it as the E in 4G LTE (Long Term Evolution). Through the power of CDNs, you're able to render images, videos, streams, content, data, transactions, privacy, and much more through the network.\n\n&amp;#x200B;\n\n[Securing digital assets on a reliable infrastructure for the most intensive computing cases.](https://preview.redd.it/dnpn9c3t4m251.png?width=2210&amp;format=png&amp;auto=webp&amp;s=2be51c709a803d5dbac47c4bb471d9ca77bc047c)\n\n&amp;#x200B;\n\n\\# Why does this market matter? Competitive advantages\n\nThe reason Snapchat did not gain any traction did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in networking infrastructure allowed them to create a product that was fast , cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n# # What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its privacy-first approach. CloudFlare is essentially a distributed private network (VPN) with a massive infrastructure effort to send data around the world safely and cheaply. Privacy and speed sells.\n\n[Facebook: \"The future is private\"](https://preview.redd.it/gn6ibx4p4m251.png?width=1306&amp;format=png&amp;auto=webp&amp;s=8a88aa1e694ab0e62af8856bdeae914f62cd7182)\n\n&amp;#x200B;\n\n[Cloudflare grows with security](https://preview.redd.it/me09oa3pem251.png?width=2332&amp;format=png&amp;auto=webp&amp;s=658486274c4b3c61fa689c5166b14f8c5775a953)\n\n&amp;#x200B;\n\n# # What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software.\n\n\\&amp;#x200B;\n\n[Google's ML kit offers developer solutions for common machining problems](https://preview.redd.it/bv4j6nx47m251.png?width=2494&amp;format=png&amp;auto=webp&amp;s=7989e5953258cc5bcc3293971a5780595e949c71)\n\n\\&amp;#x200B;\n\n[Cloudflare lets you create your own and distribute them.](https://preview.redd.it/6n4sn4gc7m251.png?width=1530&amp;format=png&amp;auto=webp&amp;s=cd8b30aa9608e4e4e3d959820716b33b29548898)\n\n&amp;#x200B;\n\n\\# Where Does CloudFlare currently stand in the market?\n\n[In 2020, security and delivery increases.](https://preview.redd.it/spptqgf6yl251.png?width=600&amp;format=png&amp;auto=webp&amp;s=8020aaaacfa37fe2f493f2c7a7b7c6dd4e2f7174)\n\n&amp;#x200B;\n\n[CRWD now at 19.7B, Z-Scaler at 13.3B](https://preview.redd.it/afq494qjzl251.png?width=1154&amp;format=png&amp;auto=webp&amp;s=3a89e1ee92fc1a9c373a9a1109497960231f076d)\n\n[An iron lock on VPN and distributed security](https://preview.redd.it/powropc40m251.png?width=1224&amp;format=png&amp;auto=webp&amp;s=27205ea3a6e282963f801fbf5d4583facbf84c91)\n\n&amp;#x200B;\n\n[Competes against vendor lock in. Cloudflare vs Amazon Cloudfront CDN](https://preview.redd.it/1x6gfsjd0m251.png?width=2444&amp;format=png&amp;auto=webp&amp;s=2d4d6b797bfda3d9f3829f16af6d8bdae392485d)\n\n&amp;#x200B;\n\n[Increases competition in the serverless/cloud computing space](https://preview.redd.it/wrofhb001m251.png?width=1612&amp;format=png&amp;auto=webp&amp;s=b400f0f5bc056d03d7aac046f609f3bcba4ce431)\n\n&amp;#x200B;\n\n[Drastically more edge locaitons than Amazon and Google.](https://preview.redd.it/un437p0u1m251.png?width=800&amp;format=png&amp;auto=webp&amp;s=58d7d269c33eff2868f8316768242960d9fe86c8)\n\n[As a DNS provider](https://preview.redd.it/4yo9rbd64m251.png?width=2472&amp;format=png&amp;auto=webp&amp;s=cc96b24eb9507f30cc6920f4b0d94e2b2a7ecc87)\n\n&amp;#x200B;\n\n# # So what does this mean for CloudFlare?\n\n# ## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development\n\n[Closing the gap on Fastly's primary product (media management)](https://preview.redd.it/1u6lp2as7m251.png?width=1798&amp;format=png&amp;auto=webp&amp;s=815098ee5393a88f35af86017f61c38fa7a2c531)\n\n&amp;#x200B;\n\n[Piece 1: Distributed, private, secure networking](https://preview.redd.it/zoi83xlahm251.png?width=2178&amp;format=png&amp;auto=webp&amp;s=8373be8ffc9e1f1bd54c81b5cde0fc40db98386c)\n\n&amp;#x200B;\n\n[Piece 2: Distributed, private, secure streaming](https://preview.redd.it/v0h5qneggm251.png?width=2262&amp;format=png&amp;auto=webp&amp;s=20990db7b1063a8f6f72b8d63aa8ce1087c3c9de)\n\n&amp;#x200B;\n\n[Piece 3: Distributed, secure, private IT](https://preview.redd.it/j6pnlun3hm251.png?width=2416&amp;format=png&amp;auto=webp&amp;s=08e1eb6556bd86af62096b12ec59e07b00dd2e0a)\n\n&amp;#x200B;\n\n[Piece 4: Distributed, private, secure software development](https://preview.redd.it/h7osbezxgm251.png?width=2330&amp;format=png&amp;auto=webp&amp;s=e1534e944349784a59cad390074ae2f94b9d8220)\n\n&amp;#x200B;\n\n[Piece 5: The missing piece. Distributed, private, secure video.](https://preview.redd.it/kklpe6mrgm251.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c42fbada434f23fbe03b151004fd57b69f236bd9)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# # My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the and simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses (my first options were 20x FB)\n\nI'm currently investing heavily in\n\n\\- Privacy **\\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]**\n\n\\- Automation, manufacturing, and battery improvements **\\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]**\n\n\\- Mexican-American trade **\\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]**\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech **\\[\\*\\*Zoomers &amp; you\\*\\*\\]**",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare and CloudflareTV - A visual guide to understanding CDNs, security networking, and cloud computing for non-technical investors.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvo3ph/cloudflare_and_cloudflaretv_a_visual_guide_to/",
        "created": 1591192389.0
    },
    {
        "author": "dinopuppy6",
        "created_utc": 1593484403,
        "id": "hieif3",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "I received a buyout of 70K to leave my current job.  It was done through a company pension so I rolled it over to an IRA.  What’s a good cadence to invest.   Should I immediately buy 70K in ETFs? I thought since the economy is not doing well, it would make more sense to buy a little bit every week.",
        "subreddit": "investing",
        "title": "Investment cadence",
        "url": "https://www.reddit.com/r/investing/comments/hieif3/investment_cadence/",
        "created": 1593513203.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591497640,
        "id": "gy4f7p",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "[https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md](https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md)\n\n\\- 40c NET 8/21\n\nGithub link so you guys can see inline pictures with captions since mods in investing forums wont let us epic DD threads anymore\n\n&amp;#x200B;\n\nIGNORE BELOW, USE THE LINK ABOVE \n\nIGNORE BELOW, USE THE LINK ABOVE\n\n==============\n\n&amp;#x200B;\n\n[https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png)\n\n&amp;#x200B;\n\nText for keywords:\n\n `\\`\\`\\``\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png`](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png)`)`\n\n`### Mods allow us to post images to DD threads wtf`\n\n`NET $40c 8/21`\n\n`NET 35c 7/17`\n\n`# WSBLearns Chapter 1 : An Introduction to the Cloud Computing Economy`\n\n`### Goals`\n\n`- Answer \"What am I investing in when I risk money with CloudFlare?\"`\n\n`# My Motivation`\n\n`CloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.`\n\n`# In Short`\n\n`CloudFlare so far has been shredding forward across multiple technical markets competing against by:`\n\n`- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers`\n\n`- Offering a way to not lock your organization into a big tech vendor`\n\n`- Promoting security and challenging Big Tech's direction with web development`\n\n`- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft`\n\n`- Pioneering the ease-of-use privacy movement with` [`1.1.1.1`](https://1.1.1.1/) `and distributing VPNs.`\n\n`- Growing a rapid, robust, cost-effective, and secure network across the world`\n\n`- _Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing._ **-&gt; YOU ARE HERE**`\n\n`- Creating a better internet.`\n\n`_**Cofounder of NPM - a primary pioneer in the cloud market**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png`](https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png)`)`\n\n`# The Thesis`\n\n`The economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.`\n\n`Physical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png`](https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png)`)`\n\n`Infrastructure that support these interactive ecosystems will be growing at incredible rates. This market is **BIG** and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.`\n\n`_**ZScaler servicing manufacturing, IT, and industrial operations**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png`](https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png)`)`\n\n`_**CloudFlare prioritizing hospital security over web retailers**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png`](https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png)`)`\n\n`_**Amazon &amp;&amp; Facebook angling for web retailers over hospitals**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png`](https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png)`)`\n\n`_**Fastly executes on video and media delivery**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png`](https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png)`)`\n\n`The need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.`\n\n`NET is one of the best positioned companies to pioneer this market at scale.`\n\n`# Market drivers &amp; a brief history of modern computing`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png`](https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png)`)`\n\n`The history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and tunnels of water that the market had created.`\n\n`As many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like` [`Twitch.tv`](https://twitch.tv/) `which would \"stream\" video.`\n\n`What had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)`\n\n`The paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png`](https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png)`)`\n\n`Today, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png`](https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png)`)`\n\n`# What is serverless computing?`\n\n`Serverless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png`](https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png)`)`\n\n`# Other competitive advantages of network and cloud computing`\n\n`The reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png`](https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png)`)`\n\n`# What's special about CloudFlare as a network?`\n\n`What CloudFlare specifically offers against its competitors is its **privacy-first approach** and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.`\n\n`This is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.`\n\n`Privacy and speed sells. A Cloudflare sells it at the best price.`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png`](https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png)`)`\n\n`_**Facebook: \"The future is private\"**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png`](https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png)`)`\n\n`_**Cloudflare grows with the internet's need for security.**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png`](https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png)`)`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png`](https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png)`)`\n\n`# Where Does CloudFlare currently stand in the market?`\n\n`_**How they see themselves**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png`](https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png)`)`\n\n`_**Against the ecosystem**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png`](https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png)`)`\n\n`_**In 2020, all needs have increased.**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png`](https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png)`)`\n\n`_**Drastically more edge locations than Big Tech globally in contested regions like Africa, China, and other economic frontiers.**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png`](https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png)`)`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png`](https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png)`)`\n\n`# Deep market relationships`\n\n`CloudFlare has had large scale investments, partnerships, and business ventures with organizations like:`\n\n`_**JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png`](https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png)`)`\n\n`_**Supporting recent legends like Shopify**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png`](https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png)`)`\n\n`_**Growing with global industry leaders**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png`](https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png)`)`\n\n`_**A competitive proxy that approaches Big Tech's biggest legal problems**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png`](https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png)`)`\n\n`# So what does this mean for CloudFlare?`\n\n`## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming`\n\n`### Target: Enterprise, profits, generosity, and long-term market capture.`\n\n`A big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.`\n\n`_**Piece 1: Easy to use, distributed, private, secure networking**_`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png`](https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png)`)`\n\n`**_Piece 2: Easy to use, distributed, secure, cost-effective streaming_**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png`](https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png)`)`\n\n`**_Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT_**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png`](https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png)`)`\n\n`**_Piece 4: Easy to use, distributed, secure, cost-effective software development_**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png`](https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png)`)`\n\n`**_Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video._**`\n\n`![image](`[`https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png`](https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png)`)`\n\n`# My record`\n\n`I'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.`\n\n`I have made a fair amount of money with`\n\n`- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)`\n\n`- E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)`\n\n`currently investing heavily in:`\n\n`- Privacy [**CloudFlare, Big Tech, US, China, and global development**]`\n\n`- Automation, manufacturing, and battery improvements [**Panasonic, FANUC, Texas, Mexico and Japan**]`\n\n`- Mexican-American trade [**Kansas City Union, USMCA, and the Mexican economy**]`\n\n`- Virtual Reality, gaming, AI with user-experience support, and fintech [**Zoomers &amp; you**]`\n\n`\\`\\`\\``",
        "subreddit": "stocks",
        "title": "Cloudflare &amp; CloudflareTV - A visual guide to CDNs, Networking, and the Cloud for non-technical investors.",
        "url": "https://www.reddit.com/r/stocks/comments/gy4f7p/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591526440.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591862171,
        "id": "h0utep",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Use this link for visuals\n\n[https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md](https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md)\n\n# **USE THE FUCKING LINK**\n\nimage\n\nMods allow us to post images to DD threads wtf\n\nNET $40c 8/21 NET 35c 7/17\n\nWSBLearns Chapter 1 : An Introduction to the Cloud Computing EconomyGoals\n\n* Answer \"What am I investing in when I risk money with CloudFlare?\"\n\nMy Motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\nIn Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n* Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n* Offering a way to not lock your organization into a big tech vendor\n* Promoting security and challenging Big Tech's direction with web development\n* Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n* Pioneering the ease-of-use privacy movement with 1.1.1.1 and distributing VPNs.\n* Growing a rapid, robust, cost-effective, and secure network across the world\n* *Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing.* **-&gt; YOU ARE HERE**\n* Creating a better internet.\n\n***Cofounder of NPM - a primary pioneer in the cloud market*** image\n\nThe Thesis\n\nThe economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nimage\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. This market is **BIG** and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.\n\n***ZScaler servicing manufacturing, IT, and industrial operations*** image\n\n***CloudFlare prioritizing hospital security over web retailers*** image\n\n***Amazon &amp;&amp; Facebook angling for web retailers over hospitals*** image\n\n***Fastly executes on video and media delivery*** image\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nNET is one of the best positioned companies to pioneer this market at scale.\n\nMarket drivers &amp; a brief history of modern computing\n\nimage\n\nThe history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and tunnels of water that the market had created.\n\nAs many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like Twitch.tv which would \"stream\" video.\n\nWhat had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)\n\nThe paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?\n\nimage\n\nToday, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.\n\nimage\n\nWhat is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.\n\nimage\n\nOther competitive advantages of network and cloud computing\n\nThe reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\nimage\n\nWhat's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its **privacy-first approach** and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.\n\nThis is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.\n\nPrivacy and speed sells. A Cloudflare sells it at the best price. image\n\n***Facebook: \"The future is private\"*** image\n\n***Cloudflare grows with the internet's need for security.*** image image\n\nWhere Does CloudFlare currently stand in the market?\n\n***How they see themselves*** image\n\n***Against the ecosystem*** image\n\n***In 2020, all needs have increased.*** image\n\n***Drastically more edge locations than Big Tech globally in contested regions like Africa, China, and other economic frontiers.*** image image\n\nDeep market relationships\n\nCloudFlare has had large scale investments, partnerships, and business ventures with organizations like:\n\n***JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure*** image\n\n***Supporting recent legends like Shopify*** image\n\n***Growing with global industry leaders*** image\n\n***A competitive proxy that approaches Big Tech's biggest legal problems*** image\n\nSo what does this mean for CloudFlare?The missing puzzle piece: CloudFlare TV and Cloudflare StreamingTarget: Enterprise, profits, generosity, and long-term market capture.\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.\n\n***Piece 1: Easy to use, distributed, private, secure networking*** image\n\n***Piece 2: Easy to use, distributed, secure, cost-effective streaming*** image\n\n***Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT*** image\n\n***Piece 4: Easy to use, distributed, secure, cost-effective software development*** image\n\n***Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video.*** image\n\nMy record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n* \\[REDACTED\\]COIN &amp; AMD's computing relationship (Bought \\[REDACTED\\]COIN at 2k, AMD at $11)\n* E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n\ncurrently investing heavily in:\n\n* Privacy \\[**CloudFlare, Big Tech, US, China, and global development**\\]\n* Automation, manufacturing, and battery improvements \\[**Panasonic, FANUC, Texas, Mexico and Japan**\\]\n* Mexican-American trade \\[**Kansas City Union, USMCA, and the Mexican economy**\\]\n* Virtual Reality, gaming, AI with user-experience support, and fintech \\[**Zoomers &amp; you**\\]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare $NET DD - CDNs, cybersecurity, and Big Tech data centers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0utep/cloudflare_net_dd_cdns_cybersecurity_and_big_tech/",
        "created": 1591890971.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591497234,
        "id": "gy4bwg",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "[https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md](https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md)\n\n\\- 40c NET 8/21\n\nGithub link so you guys can see inline pictures with captions since mods in investing forums wont let us epic DD threads anymore\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIGNORE THIS, USE THE LINK ABOVE IGNORE THIS, USE THE LINK ABOVE\n\nText for keywords:\n\n&amp;#x200B;\n\n[https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png) \\`\\`\\`\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png))\n\n\\### Mods allow us to post images to DD threads wtf\n\nNET $40c 8/21\n\nNET 35c 7/17\n\n\\# WSBLearns Chapter 1 : An Introduction to the Cloud Computing Economy\n\n\\### Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n\\# My Motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry.\n\n\\# In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers\n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1/) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world\n\n\\- \\_Providing a development platform that promotes the use extremely powerful and 'cutting edge' web computing.\\_ \\*\\*-&gt; YOU ARE HERE\\*\\*\n\n\\- Creating a better internet.\n\n\\_\\*\\*Cofounder of NPM - a primary pioneer in the cloud market\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png](https://user-images.githubusercontent.com/37036296/83951310-7164c400-a7e5-11ea-8675-e265e7c15336.png))\n\n\\# The Thesis\n\nThe economic value and convergence between e-commerce, global networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall economic development cycle. This timeframe has been accelerated greatly due to global market lockdowns and further risk of lockdown.\n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world. Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png](https://user-images.githubusercontent.com/37036296/83950869-9c99e400-a7e2-11ea-8373-3e6f2b42b4bc.png))\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. This market is \\*\\*BIG\\*\\* and no one or two players will be large enough to capture the market. It ranges from manufacturers, energy departments, web products, hospitals, governments, and so on. Security is serviced differently based on the industry. This much is obvious - a hospital will clearly protect patient records more closely than a manufacturer controlling the runtime of their high-speed machining assembly line.\n\n\\_\\*\\*ZScaler servicing manufacturing, IT, and industrial operations\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png](https://user-images.githubusercontent.com/37036296/83950190-a5d48200-a7dd-11ea-8208-567a6345c005.png))\n\n\\_\\*\\*CloudFlare prioritizing hospital security over web retailers\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png](https://user-images.githubusercontent.com/37036296/83950400-6e66d500-a7df-11ea-8814-212983bade56.png))\n\n\\_\\*\\*Amazon &amp;&amp; Facebook angling for web retailers over hospitals\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png](https://user-images.githubusercontent.com/37036296/83950431-a66e1800-a7df-11ea-933e-1ac98bda30e8.png))\n\n\\_\\*\\*Fastly executes on video and media delivery\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png](https://user-images.githubusercontent.com/37036296/83950653-45474400-a7e1-11ea-9e73-bdf121115612.png))\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nNET is one of the best positioned companies to pioneer this market at scale.\n\n\\# Market drivers &amp; a brief history of modern computing\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png](https://user-images.githubusercontent.com/37036296/83951016-9bb58200-a7e3-11ea-8398-151ec1df2bae.png))\n\nThe history of CDNs took a much larger turn when YouTube and Netflix became big players in data production and needed to cooperate with Internet Service Providers to manage the new dam and tunnels of water that the market had created.\n\nAs many of you know, video data is large and streaming high quality videos at high speed to millions of users in real time was no laughing matter. Around this time you also began to see new products in ESports like [Twitch.tv](https://twitch.tv/) which would \"stream\" video.\n\nWhat had happened was that tech companies discovered a more cost effective way of delivering video and it was through controlling the actual pipeline. You would receive atomized content as needed rather than waiting for blocks of video to be received on your end (this was problematic in early Youtube days with broadband and DSL)\n\nThe paradigm began to shift. Cloud computing and asynchronous models began to gain steam in the developer profession. We began a defining chapter of web optimizations that still continue today with serverless computing, real-time data, and growing user-experiences. At this time you began to notice that you no longer had to refresh your web page to receive new data. Remember when Facebook started to notify you rather than you checking your notifications? Do you remember when you had to check your email?\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png](https://user-images.githubusercontent.com/37036296/83951531-e1c01500-a7e6-11ea-87c0-f7bcdf9e6ffd.png))\n\nToday, developers are able to create or distribute product and services using networking and data center functions. This is largely what is recognized as cloud and serverless computing. This is has many consequences but primarily allows for unbelievably fast responses and avenues for user experiences.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png](https://user-images.githubusercontent.com/37036296/83951289-5003d800-a7e5-11ea-9aaf-c5b44063a66e.png))\n\n\\# What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software. It is one of the bread and butter of SaaS, IaaS, and other cloud style businesses where many business problems come out of the box for you.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png](https://user-images.githubusercontent.com/37036296/83955922-1941b800-a80d-11ea-8675-28c216be50eb.png))\n\n\\# Other competitive advantages of network and cloud computing\n\nThe reason Snapchat did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in Akamai and its personal networking infrastructure allowed them to create a product that was fast, cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png](https://user-images.githubusercontent.com/37036296/83951349-b7218c80-a7e5-11ea-9901-abd22b1f776e.png))\n\n\\# What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its \\*\\*privacy-first approach\\*\\* and its quality of engineering. CloudFlare is essentially a distributed private content delivery network (pCDN) with a massive infrastructure effort to send data around the world safely and cheaply.\n\nThis is fundamentally consequential as we are seeing massive nations tackle issues with how data can be utilized or privatized.\n\nPrivacy and speed sells. A Cloudflare sells it at the best price.\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png](https://user-images.githubusercontent.com/37036296/83955846-4772c800-a80c-11ea-8f93-fc4fa6125455.png))\n\n\\_\\*\\*Facebook: \"The future is private\"\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png](https://user-images.githubusercontent.com/37036296/83955789-c0255480-a80b-11ea-87b6-d701ca44fb31.png))\n\n\\_\\*\\*Cloudflare grows with the internet's need for security.\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png](https://user-images.githubusercontent.com/37036296/83955755-6cb30680-a80b-11ea-8c18-8cd2ad32fb49.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png](https://user-images.githubusercontent.com/37036296/83955821-067ab380-a80c-11ea-9c07-562e63977c79.png))\n\n\\# Where Does CloudFlare currently stand in the market?\n\n\\_\\*\\*How they see themselves\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png](https://user-images.githubusercontent.com/37036296/83956451-31b4d100-a813-11ea-93d0-2c273a982ce5.png))\n\n\\_\\*\\*Against the ecosystem\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png](https://user-images.githubusercontent.com/37036296/83956485-92440e00-a813-11ea-9ffc-2967560d639e.png))\n\n\\_\\*\\*In 2020, all needs have increased.\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png](https://user-images.githubusercontent.com/37036296/83956379-42187c00-a812-11ea-8c67-b2ba25016a61.png))\n\n\\_\\*\\*Drastically more edge locations than Big Tech globally in contested regions like Africa, China, and other economic frontiers.\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png](https://user-images.githubusercontent.com/37036296/83956530-f9fa5900-a813-11ea-94af-d6da6774f8e5.png))\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png](https://user-images.githubusercontent.com/37036296/83956536-11394680-a814-11ea-888f-e38467dc658d.png))\n\n\\# Deep market relationships\n\nCloudFlare has had large scale investments, partnerships, and business ventures with organizations like:\n\n\\_\\*\\*JD Cloud and Chinese infrastructure, which will inevitably boom with revenue from video scaling, contentious privacy, e-commerce and infrastructure\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png](https://user-images.githubusercontent.com/37036296/83956688-8fe2b380-a815-11ea-934f-c6017bfa7395.png))\n\n\\_\\*\\*Supporting recent legends like Shopify\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png](https://user-images.githubusercontent.com/37036296/83956715-d1735e80-a815-11ea-8a0d-ad35a575866a.png))\n\n\\_\\*\\*Growing with global industry leaders\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png](https://user-images.githubusercontent.com/37036296/83956727-e94ae280-a815-11ea-9982-a1eabc5ec754.png))\n\n\\_\\*\\*A competitive proxy that approaches Big Tech's biggest legal problems\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png](https://user-images.githubusercontent.com/37036296/83956750-20b98f00-a816-11ea-97c2-89db7d3e94f1.png))\n\n\\# So what does this mean for CloudFlare?\n\n\\## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\n\\### Target: Enterprise, profits, generosity, and long-term market capture.\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development.\n\n\\_\\*\\*Piece 1: Easy to use, distributed, private, secure networking\\*\\*\\_\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png](https://user-images.githubusercontent.com/37036296/83956655-44300a00-a815-11ea-8d7b-36ceeae3eb2d.png))\n\n\\*\\*\\_Piece 2: Easy to use, distributed, secure, cost-effective streaming\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png](https://user-images.githubusercontent.com/37036296/83956794-b3f2c480-a816-11ea-8b7b-5d2d3de080d9.png))\n\n\\*\\*\\_Piece 3: Easy to use, distributed, secure, cost-effective enterprise IT\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png](https://user-images.githubusercontent.com/37036296/83956818-d4228380-a816-11ea-81bf-5fa785b64bbd.png))\n\n\\*\\*\\_Piece 4: Easy to use, distributed, secure, cost-effective software development\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png](https://user-images.githubusercontent.com/37036296/83956844-f1575200-a816-11ea-81b5-afbbcc12356e.png))\n\n\\*\\*\\_Piece 5: The missing piece. Easy to use, distributed, private, secure enterprise video.\\_\\*\\*\n\n!\\[image\\]([https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png](https://user-images.githubusercontent.com/37036296/83956883-42674600-a817-11ea-995a-4db7f7b8b9db.png))\n\n\\# My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the arena and by simply just participating in the market as much as I can myself.\n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses (my first options reached 20x on FB)\n\ncurrently investing heavily in:\n\n\\- Privacy \\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]\n\n\\- Automation, manufacturing, and battery improvements \\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]\n\n\\- Mexican-American trade \\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech \\[\\*\\*Zoomers &amp; you\\*\\*\\]\n\n\\`\\`\\`",
        "subreddit": "investing",
        "title": "Cloudflare &amp; CloudflareTV - A visual guide to CDNs, Networking, and the Cloud for non-technical investors.",
        "url": "https://www.reddit.com/r/investing/comments/gy4bwg/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591526034.0
    },
    {
        "author": "pharmacykiller33",
        "created_utc": 1591677055,
        "id": "gzfxoz",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I’ll admit, I’m not a stock wizard and am still developing my cadence. Initially, I wanted to look for stocks with big amounts of cash to weather any storm and for big moves in the future - that’s how I came across Nintendo. \n\nThey have over 150 billion in cash, but only pay 1% dividend. For some reason, that seems like an exorbitant amount of money for such an established company. \n\nAnything I’m overtly missing and what should I translate this to mean for their value?",
        "subreddit": "stocks",
        "title": "Why does Nintendo have so much cash?",
        "url": "https://www.reddit.com/r/stocks/comments/gzfxoz/why_does_nintendo_have_so_much_cash/",
        "created": 1591705855.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591158980,
        "id": "gvn3n3",
        "num_comments": 9,
        "num_crossposts": 1,
        "selftext": "tl;dr: $40c 8/21 &amp;&amp; 35c 7/17\n\n&amp;#x200B;\n\n\\# Goals\n\n\\- Answer \"What am I investing in when I risk money with CloudFlare?\"\n\n\\- Answer \"What's the difference between Fastly and Cloudflare?\"\n\n&amp;#x200B;\n\n\\# The thesis\n\nThe economic value and convergence between e-commerce, networking speeds, and video advancements is not anywhere close to realized. There has been an acceleration toward this reality but it's still early in the overall development cycle. \n\nPhysical and monetary assets being virtualized has recently been accelerated in importance and this will have positive effects, across time, on businesses that focus on securing those assets in its time spent delivering on multiple ultra-high-speed networks across the world.  Computing is getting cheaper and easier to distribute in rather extreme ways and the execution of these ideas is happening right now.\n\nThe need for secure video, transactions, VR, and user experiences will be dramatically shot up and this is evident across many exciting technologies like Apple VR, Google Gaming, Square Banking, Facebook Shops with VR shopping, Microsoft software automations, and government developments.\n\nInfrastructure that support these interactive ecosystems will be growing at incredible rates. NET is one of the best positioned companies to pioneer this market.\n\n[This graph has been crunched where 2019 skips straight to 2021-2023 levels.](https://preview.redd.it/2u6ede9bul251.png?width=1392&amp;format=png&amp;auto=webp&amp;s=95bf6696f2deaec72d5b3cce869d0aef5d2e59f9)\n\n&amp;#x200B;\n\n\\# My motivation\n\nCloudFlare is releasing and bolstering support for streaming, video, and communications as a security-first cloud provider in the following week. This, on top of its rapidly growing developer platform, is consequential for many reasons as a market-mover in the industry. \n\n&amp;#x200B;\n\n\\# In Short\n\nCloudFlare so far has been shredding forward across multiple technical markets competing against by:\n\n\\- Competing marketshare against CISCO, Palo Alto Networks, and other hardware customers \n\n\\- Offering a way to not lock your organization into a big tech vendor\n\n\\- Promoting security and challenging Big Tech's direction with web development\n\n\\- Forming positive relationships with Shopify, Facebook, JD, Twitter, Baidu, TOR, and Microsoft\n\n\\- Pioneering the ease-of-use privacy movement with [1.1.1.1](https://1.1.1.1) and distributing VPNs.\n\n\\- Growing a rapid, robust, cost-effective, and secure network across the world \n\n\\- \\*\\*Providing a development platform that promotes the use extremely powerful and 'cutting edge'  computing. -&gt; YOU ARE HERE\n\n&amp;#x200B;\n\n[Co-founder of NPM, a system developers used to send software modules. Pioneers in web computing. Acquired by Microsoft](https://preview.redd.it/2upgkb0gvl251.png?width=1184&amp;format=png&amp;auto=webp&amp;s=4fc9c9c151e75d4b03671760e927bc5a75e8bc85)\n\n&amp;#x200B;\n\n\\# So what is this technology anyway? A content delivery network.\n\nCDNs are distributed datacenters. This technology has been rapidly improving in the past 5 years and has drastically reduced the cost of business for small businesses and enterprises alike.\n\nThinking trucking logistics. You need to load up and send heavy duty materials, safely, quickly, and across multiple checkpoints along a highway.\n\nAn easy way to think about CDNs is to imagine it as the E in 4G LTE (Long Term Evolution). Through the power of CDNs, you're able to render images, videos, streams, content, data, transactions, privacy, and much more through the network.\n\n&amp;#x200B;\n\n[As a pioneer in the e-commerce space](https://preview.redd.it/dnpn9c3t4m251.png?width=2210&amp;format=png&amp;auto=webp&amp;s=2be51c709a803d5dbac47c4bb471d9ca77bc047c)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Why does this market matter? Competitive advantages\n\nThe reason Snapchat did not gain any traction did not gain any traction outside of the US was because Facebook provided a fundamentally faster service across WhatsApp and Instagram. Facebook's investment in networking infrastructure allowed them to create a product that was fast , cheap and would work in various rural or economic conditions. Snapchat never stood a chance in the global social media landscape as a result.\n\n&amp;#x200B;\n\n\\# What's special about CloudFlare as a network?\n\nWhat CloudFlare specifically offers against its competitors is its privacy-first approach. CloudFlare is essentially a distributed private network (VPN) with a massive infrastructure effort to send data around the world safely and cheaply.  Privacy and speed sells.  \n\n\n&amp;#x200B;\n\n[Facebook: \\\\\"The future is private\\\\\"](https://preview.redd.it/gn6ibx4p4m251.png?width=1306&amp;format=png&amp;auto=webp&amp;s=8a88aa1e694ab0e62af8856bdeae914f62cd7182)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/me09oa3pem251.png?width=2332&amp;format=png&amp;auto=webp&amp;s=658486274c4b3c61fa689c5166b14f8c5775a953\n\n\\# What is serverless computing?\n\nServerless computing allows a 25 year old developer like me run 5 different businesses on my dinky little Macintosh while I let Google and Cloudflare run my servers under an extremely cheap pricing model. That is a revolutionary change for software.\n\n&amp;#x200B;\n\n[Google's ML kit offers developer solutions for common machining problems](https://preview.redd.it/bv4j6nx47m251.png?width=2494&amp;format=png&amp;auto=webp&amp;s=7989e5953258cc5bcc3293971a5780595e949c71)\n\n&amp;#x200B;\n\n[Cloudflare lets you create your own and distribute them.](https://preview.redd.it/6n4sn4gc7m251.png?width=1530&amp;format=png&amp;auto=webp&amp;s=cd8b30aa9608e4e4e3d959820716b33b29548898)\n\n&amp;#x200B;\n\n\\# Where Does CloudFlare currently stand in the market?\n\n[In 2020, security and delivery increases.](https://preview.redd.it/spptqgf6yl251.png?width=600&amp;format=png&amp;auto=webp&amp;s=8020aaaacfa37fe2f493f2c7a7b7c6dd4e2f7174)\n\n&amp;#x200B;\n\n[CRWD now at 19.7B, Z-Scaler at 13.3B](https://preview.redd.it/afq494qjzl251.png?width=1154&amp;format=png&amp;auto=webp&amp;s=3a89e1ee92fc1a9c373a9a1109497960231f076d)\n\n  \n\n\n[An iron lock on VPN and distributed security](https://preview.redd.it/powropc40m251.png?width=1224&amp;format=png&amp;auto=webp&amp;s=27205ea3a6e282963f801fbf5d4583facbf84c91)\n\n&amp;#x200B;\n\n[Competes against vendor lock in. Cloudflare vs Amazon Cloudfront CDN](https://preview.redd.it/1x6gfsjd0m251.png?width=2444&amp;format=png&amp;auto=webp&amp;s=2d4d6b797bfda3d9f3829f16af6d8bdae392485d)\n\n&amp;#x200B;\n\n[Increases competition in the serverless\\/cloud computing space](https://preview.redd.it/wrofhb001m251.png?width=1612&amp;format=png&amp;auto=webp&amp;s=b400f0f5bc056d03d7aac046f609f3bcba4ce431)\n\n&amp;#x200B;\n\n[Drastically more edge locaitons than Amazon and Google.](https://preview.redd.it/un437p0u1m251.png?width=800&amp;format=png&amp;auto=webp&amp;s=58d7d269c33eff2868f8316768242960d9fe86c8)\n\n[As a DNS provider](https://preview.redd.it/4yo9rbd64m251.png?width=2472&amp;format=png&amp;auto=webp&amp;s=cc96b24eb9507f30cc6920f4b0d94e2b2a7ecc87)\n\n&amp;#x200B;\n\n\\# So what does this mean for CloudFlare?   \n\n\n\\## The missing puzzle piece: CloudFlare TV and Cloudflare Streaming\n\nA big piece that's missing from Cloudflare's economic puzzle is the release and support of distributed video and video development\n\n[Closing the gap on Fastly's  primary product \\(media management\\)](https://preview.redd.it/1u6lp2as7m251.png?width=1798&amp;format=png&amp;auto=webp&amp;s=815098ee5393a88f35af86017f61c38fa7a2c531)\n\n&amp;#x200B;\n\n[Piece 1: Distributed, private, secure networking](https://preview.redd.it/zoi83xlahm251.png?width=2178&amp;format=png&amp;auto=webp&amp;s=8373be8ffc9e1f1bd54c81b5cde0fc40db98386c)\n\n&amp;#x200B;\n\n[Piece 2: Distributed, private, secure streaming](https://preview.redd.it/v0h5qneggm251.png?width=2262&amp;format=png&amp;auto=webp&amp;s=20990db7b1063a8f6f72b8d63aa8ce1087c3c9de)\n\n&amp;#x200B;\n\n[Piece 3: Distributed, secure, private IT](https://preview.redd.it/j6pnlun3hm251.png?width=2416&amp;format=png&amp;auto=webp&amp;s=08e1eb6556bd86af62096b12ec59e07b00dd2e0a)\n\n&amp;#x200B;\n\n[Piece 4: Distributed, private, secure software development](https://preview.redd.it/h7osbezxgm251.png?width=2330&amp;format=png&amp;auto=webp&amp;s=e1534e944349784a59cad390074ae2f94b9d8220)\n\n&amp;#x200B;\n\n[Piece 5: The missing piece. Distributed, private, secure video.](https://preview.redd.it/kklpe6mrgm251.png?width=1196&amp;format=png&amp;auto=webp&amp;s=c42fbada434f23fbe03b151004fd57b69f236bd9)\n\nPiece 2\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# My record\n\nI'm fairly conservative in my choice to purchase option or stock. I'm a software engineer that's passionate about education and have really enjoyed exercising my knowledge-base during this investment time. Usually i get really excited about a stock or two at best per year based on certain global developments. These stocks are selected based on powerful and consequential market relationships or competitions occurring in the and simply just participating in the market as much as I can myself. \n\nI have made a fair amount of money with\n\n\\- Bitcoin &amp; AMD's computing relationship (Bought bitcoin at 2k, AMD at $11)\n\n\\- E-Commerce and Facebook's growing relationship with small businesses  (my first options were 20x FB)\n\nI'm currently investing heavily in\n\n\\- Privacy \\[\\*\\*CloudFlare, Big Tech, US, China, and global development\\*\\*\\]\n\n\\- Automation, manufacturing, and battery improvements \\[\\*\\*Panasonic, FANUC, Texas, Mexico and Japan\\*\\*\\]\n\n\\- Mexican-American trade \\[\\*\\*Kansas City Union, USMCA, and the Mexican economy\\*\\*\\]\n\n\\- Virtual Reality, gaming, AI with user-experience support, and fintech \\[\\*\\*Zoomers &amp; you\\*\\*\\]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare's upcoming release of CloudflareTV - A Visual Guide to understanding CDNs, cybersecurity, and cloud computing as a non-technical investor.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvn3n3/cloudflares_upcoming_release_of_cloudflaretv_a/",
        "created": 1591187780.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591163103,
        "id": "gvo01h",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare and CloudflareTV - A visual guide to investing in CDNs and network security for non-technical investors",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gvo01h/cloudflare_and_cloudflaretv_a_visual_guide_to/",
        "created": 1591191903.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591498569,
        "id": "gy4mv8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "[https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md](https://github.com/Sheilf/Investment-Research/blob/master/Cloudflare.md)\n\n\\- 40c NET 8/21\n\nGithub link so you guys can see inline pictures with captions since mods in investing forums wont let us epic DD threads anymore\n\n[https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png](https://user-images.githubusercontent.com/37036296/83950335-dbc63600-a7de-11ea-8307-c31c08faf49d.png)",
        "subreddit": "StockMarket",
        "title": "Cloudflare &amp; CloudflareTV - A visual guide to CDNs, Networking, and the Cloud for non-technical investors.",
        "url": "https://www.reddit.com/r/StockMarket/comments/gy4mv8/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591527369.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591496489,
        "id": "gy45ne",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare &amp; CloudflareTV - A visual guide to CDNs, Networking, and the Cloud for non-technical investors.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gy45ne/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591525289.0
    },
    {
        "author": "udit76",
        "created_utc": 1591304822,
        "id": "gwq95m",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Hello, Newbie here and wanted to get feedback on the following that I'm adding to my account.\n\nI used a screener using Stan Weinstein's methods (pop above 30 moving average, volume at breakout, relative strength, resistance levels etc.) and the following showed up -  \nA, WCLD, APPF, ATOM, BVXV, CELH, FIZZ, PRTS, SE, VERI, TSCO, FTNT, DG, CDNS, POOL, FICO\n\nWhat would you buy or not buy and why? Would you wait for a pullback to 30MA before buying?\n\nThanks for the education!",
        "subreddit": "stocks",
        "title": "Feedback on stocks - Stan Weinstein's methods",
        "url": "https://www.reddit.com/r/stocks/comments/gwq95m/feedback_on_stocks_stan_weinsteins_methods/",
        "created": 1591333622.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1591489109,
        "id": "gy27lw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare &amp; CloudFlareTV's release - A visual guide to understand CDNs, networking, and cybersecurity as a non-technical investor.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gy27lw/cloudflare_cloudflaretvs_release_a_visual_guide/",
        "created": 1591517909.0
    },
    {
        "author": "C0C0NUTJ0E",
        "created_utc": 1593179291,
        "id": "hg7wh7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "fellow eh-tistic scumbags. \n\nin my pursuit for FD's I found a company called facedrive ( FD ) its been on the up recently so yah.\n\nsomething something environmentally friendly toronto service similar to uber/ lyft\n\nno options avaliable yet so just bag holding shares.",
        "subreddit": "wallstreetbets",
        "title": "shit DD post for my fellow CDNS on here.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hg7wh7/shit_dd_post_for_my_fellow_cdns_on_here/",
        "created": 1593208091.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1592006999,
        "id": "h7wh0y",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "CLOUDFLARE DD - Protect &amp; Grow your wealth with CDNs, cybersecurity, and cloud infrastructure",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h7wh0y/cloudflare_dd_protect_grow_your_wealth_with_cdns/",
        "created": 1592035799.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1591629572,
        "id": "gz19lq",
        "num_comments": 1,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "Cloudflare &amp; CloudflareTV - a visual guide to CDNs, Cybersecurity, and networking for non-technical investors",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gz19lq/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591658372.0
    },
    {
        "author": "RobotsBuildingEdu",
        "created_utc": 1591494531,
        "id": "gy3npr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare &amp; CloudflareTV - A visual guide to CDNs, Networking, and the Cloud for non-technical investors.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gy3npr/cloudflare_cloudflaretv_a_visual_guide_to_cdns/",
        "created": 1591523331.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1591862053,
        "id": "h0usl7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cloudflare $NET DD - CDNs, cybersecurity, and Big Tech data centers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/h0usl7/cloudflare_net_dd_cdns_cybersecurity_and_big_tech/",
        "created": 1591890853.0
    },
    {
        "author": "mat_raymond",
        "created_utc": 1591062650,
        "id": "guy3g9",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I know this is small stock on the TSX venture exchange which can be susceptible to pump in dump scams (which is against the rules), but my total position is only 640 shares purchased at $0.78. But mods delete if not allowed\n\nDisclaimer 2: Usual “this is not financial advice” disclaimer. I also have a long position in this security.\n\n*All numbers are in Canadian Dollars*\n\nDrone Delivery Canada (DDC) provides a drone delivery platform targeted towards various corporations including retailers, service organizations and government agencies. They have a patented hardware/software platform. DDC has been developing its drone delivery technology since 2014.\n\nThey are currently trading on the TSX.V Exchange under the symbol FLT, on the U.S. OTC Q B market with Nasdaq International Designation under the symbol TAKOF.\n\n&amp;#x200B;\n\nBasic Stats:\n\nPrice (as of creating post): 0.84\n\nMarket Cap: 148.79M\n\nEPS: -0.09\n\nNet Income: -15.6M\n\nShares Outstanding: 177.34M\n\n&amp;#x200B;\n\nObviously, this company is not making money, in 2019 they had a cash burn rate of $16M but they have extremely low debt and cash worth $14M, giving them a cash runway of approx. 10 months from September 2019. Analysts predict DDC will reach cashflow breakeven in 2 years.\n\n0.3% is held by private companies, 7.1% by individual insiders, 15.4% by institutions and 77.2% the general public.\n\nSource: [https://simplywall.st/news/is-drone-delivery-canada-cveflt-in-a-good-position-to-deliver-on-growth-plans/](https://simplywall.st/news/is-drone-delivery-canada-cveflt-in-a-good-position-to-deliver-on-growth-plans/)\n\n&amp;#x200B;\n\nLeadership:\n\nThe CEO Michael Zahra has been the President of Staples Business Advantage (B2B supplies), the president of Yahoo, and has been on the board of directors for Oak Ridges Moraine Land Trust and on the board of governors for North York General Hospital. So, while this is a start-up they have a veteran leader. They have a strong lineup of C-Suite executives with experienced CFO and CTO.  On top of this their board of advisors include the VP of Cargo at Air Canada, and a medical director for Sunnybrook Centre for Prehospital Medicine which is an important strategic piece. The downside of their leadership is they have very high salaries for a company not making any profit. But when looking at insider transactions they have been buying more shares than they have sold.\n\n&amp;#x200B;\n\nAs a venture company that is not profitable it is a risky investment but there are many upsides to investing in this new technology.\n\nI’m currently looking at 5 factors that have swayed me to open a bullish position\n\n1. Its current partnership with DSV\n2. Its partnership with Edmonton Airport\n3. Its 2 U.S. Patents\n4. Potential for medical response\n5. Move to TSX\n\n&amp;#x200B;\n\nPartnership with DSV:\n\nDDC entered in an agreement with DSV through its sales agent Air Canada that provides its drone delivery platform back in October 2019. The program became operational in March which was big for DDC as it is their first source of revenue. In which customers pay DDC a monthly fee for each drone route deployed. DSV provides and manages supply chain solutions for thousands of corporations. Which is a perfect partner for DDC. The initial agreement is for 15 months, with additional 1-year terms following the success of the first agreement. There is also a potential for over 20 routes to be implemented throughout 2020.\n\nSource: [http://www.newswire.ca/en/releases/archive/March2020/04/c8118.html](http://www.newswire.ca/en/releases/archive/March2020/04/c8118.html)\n\n&amp;#x200B;\n\nPartnership with Edmonton Airport:\n\nThis partnership creates the world’s first airport drone delivery hub at Edmonton Airport using DDC’s platform. DDC and Edmonton airport will implement promote and market DDC’s delivery services. The agreement is for 5 years initially with the possibility of an extension unless the agreement is terminated\n\nSource: [https://edmontonjournal.com/business/commercial-real-estate/edmonton-airport-becomes-canadas-first-drone-delivery-site](https://edmontonjournal.com/business/commercial-real-estate/edmonton-airport-becomes-canadas-first-drone-delivery-site)\n\n&amp;#x200B;\n\nPatents:\n\nDDC currently holds two US patents, one for its “FLYTE management” and one that covers aspects of its drone delivery technology and processes relating to controlled access zones for UAV landing and takeoff\n\nSource 1: [https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-first-114500552.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-first-114500552.html)\n\nSource 2: [https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-second-200500715.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-awarded-second-200500715.html)\n\n&amp;#x200B;\n\nMedical Response:\n\nIn 2019 researchers tested the speed of drones vs the speed of ambulances to respond to a 911 call. The drone carried an AED to the location which was approx. 8km away. The drone was allowed to fly at speeds of 80km/hr and arrived at the scene an average of three to four minutes before the ambulance. Those few minutes could make a life or death difference in a cardiac arrest patient’s outcome. This is why having the medical director for Sunnybrook Centre for Prehospital Medicine on the board of advisors could be a key to implementing their services to the medical field in the future. DDC has also reached out to the healthcare industry and governments for use case applications for drone delivery relating to COVID-19.\n\nSource 1: [https://www.ctvnews.ca/health/drone-defibrillator-delivery-researchers-say-it-may-be-faster-than-ambulances-1.4462022](https://www.ctvnews.ca/health/drone-defibrillator-delivery-researchers-say-it-may-be-faster-than-ambulances-1.4462022)\n\nSource 2: [https://ca.finance.yahoo.com/news/drone-delivery-canada-reaches-healthcare-190200559.html](https://ca.finance.yahoo.com/news/drone-delivery-canada-reaches-healthcare-190200559.html)\n\n&amp;#x200B;\n\nPotential to move to TSX:\n\nMoving up from the venture exchange to the TSX can pose many benefits. A big one that we care about is increase in share price. “An observation of 34 companies that graduated between October 14, 2005 and August 10, 2006, found that almost sixty per cent of the companies had an average share price over the thirty trading days post-graduation that was higher than the thirty trading days preceding graduation. On average, the share price of all 34 issuers went up over three per cent in that time frame, with four companies showing an increase of over 25 per cent”.\n\nSource: [https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx](https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx)\n\n&amp;#x200B;\n\nThis is my first DD on reddit so I would love any feedback and would love to discuss your thoughts on this company. (Also still trying to learn formatting on reddit)\n\n&amp;#x200B;\n\n**tldr; Investing in DDC is an extremely risky bet but as they are innovating the delivery industry, we can see potential for very high growth in the future. Some of the points leading me to believe in DDC’s potential is their partnership with DSV, their partnership with Edmonton Airport, and their experienced leadership.**",
        "subreddit": "stocks",
        "title": "Drone Delivery Canada – FLT.V (DD)",
        "url": "https://www.reddit.com/r/stocks/comments/guy3g9/drone_delivery_canada_fltv_dd/",
        "created": 1591091450.0
    }
]