[
    {
        "author": "jamnormal",
        "created_utc": 1588692144,
        "id": "gdzpl5",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "**BBSI Description:**\n\nBarrett Business Services, Inc. provides HR consulting, staffing, and payroll functions for small and medium sized businesses in 29 states across the US. There are two ways they generate revenue: Professional Employer Services (PEO) and Staffing and Recruiting. Most of their revenue (87%) comes from PEO where they provide a suite of corporate functions for small businesses. They establish a co-employment relationship with each client company and assume responsibility for payroll functions, payroll taxes, and workers’ compensation claims. They have over 7,200 PEO clients in 2019 across 29 states utilizing 64 different branch locations.\n\n [US map with Barrett Branch locations](https://www.reddit.com/user/jamnormal/comments/gdzoc3/barrett_branches_2019/?ref=share&amp;ref_source=link)\n\n&amp;nbsp;\n\n**Business Model:**\n\nBBSI helps small businesses grow by allowing them to outsource a task with high administrative burden. For many small businesses, payroll and administrative tasks are a fixed costs through HR employee salaries. PEO clients are billed for a percentage of client payroll, with the gross amount invoiced including direct payroll costs, employer payroll-related taxes, workers’ compensation coverage, and a service fee. By charging a percent of wages at the client firm, they help their clients by turning their former fixed cost administrative services into variable costs based on wages. PEO revenue is reported net of direct payroll costs, such as salaries, wages, and health insurance because BBSI is not the primary obligor for these payments, their clients are. “Indirect” payroll costs, such as payroll taxes and benefits and Workers’ Compensation expenses make up the bulk of operating costs.\n\n\nThe key to understanding BBSI’s financial statements comes down to establishing the co-employment relationship with their clients. BBSI’s primary operating expenses are Direct Payroll costs (10% of 2019 revenue), Payroll taxes and Benefits (46%), and Workers’ Compensation (22%). These three costs are passed entirely onto clients. Direct Payroll costs are related to their staffing business, while the latter two expenses are related to PEO clients. In addition to billing these above expenses, BBSI includes a service fee that is based on the total wages of employees. Their operating income can be simplified down to the service fee less their own corporate SG&amp;A expenses. \n\n&amp;nbsp;\n\n**Competition:**\n\nImplementing HR and admin solutions has become a big business for big businesses, but the small business market has had less focus from large players. Paychex &amp; Salesforce both provide tech suites aimed at larger companies and white collar firms. Barrett’s average client size is roughly 30 employees, and the focus is on blue and gray collar firms.\nFocusing on small business PEO, the main competition is TriNet Group Inc (TNET) and Insperity Inc(NSP). Focusing on geographical growth is the major differentiating strategy factor that Barrett uses to succeed in the PEO market. Focusing on conversions from internal HR departments, a substitute good for PEO, they achieve more aggressive pricing while still having net client ads quarter over quarter. Since 2016, their client base has grown at roughly 13.7% per year. The strength of growing geographically using branches allows them to fully flex their network of new clients from referral partners and clients.\n\n&amp;nbsp;\n\n**Why is it a good buy now?**\n\n\n•\t**Barrett is trading at a significant discount to their historical trading valuations, as well as at discounts relative to their PEO peers.** After Q4’19, they reduced 2020 guidance on the eve of the full COVID pandemic, leading to a cool reception from the street. Alone, this would not be enough to feel it as a discount considering the significant impact COVID will have on their business. However, they also trade at a significant discount to their PEO peers while simultaneously leading their PEO peer group in FCF yield.\n\n\nFirm | EV/FCF | P/E| FCF Yield | Net Debt/EBITDA\n---|---|----|----|----\nBarrett Business Services Inc (BBSI) | 3.73 | 7.18 | 19.3% | N/A\nTriNet Group Inc (TNET)* | 7.44 | 14.08 | 14.5% | 0.77\nInsperity Inc (NSP)* | 11.65 | 13.34 | 8.5% | N/A\n\n^*Comparisons ^are ^made ^for ^same ^periods. ^While ^TNET ^and ^NSP ^have ^reported ^Q1’20 ^earnings, ^it ^makes ^more ^sense ^to ^compare ^the ^same ^period ^for ^all ^three ^firms\n\n\n•\t**Barrett has a strong balance sheet consisting of a negative net debt position, giving them significant leeway in weathering the COVID pandemic storm.** Less than 10% of their TEV being made up of interest-bearing debt, they are sitting pretty when it comes to weathering this storm. At some points during the business cycle it feels silly to start financial analysis at the balance sheet, but during a recession is not one of those times. With so few financial obligations, they are expected to trim corporate SG&amp;A and investment in their new technology platform to keep more cash within the firm. Barrett stands a high chance of making it out the other side with a low chance of bankruptcy.\n\n•\t**Focusing on growth from a geographical perspective, Barrett’s management has carved out a small business niche that has seen success in their ability to open new branches.** Focusing on small businesses (average client firm size is ~30 employees) gives them an edge over some of the larger payroll companies in the market. Clients typically find BBSI through a strong referral network of both existing clients and external referral partners. Most of BBSI’s new clients are converting from internal HR/admin staff, which allows BBSI to provide a powerful value proposition. They turn small businesses’ fixed cost employee salaries into a variable cost based on total employee wages.\n\n•\t**Quality branch economics shows a model with strong operating leverage and marginal ROIC.** New branches take roughly a 500k investment and take about 5 years to become a mature branch. To be expected, more mature branches have more billing generation and more profit margin contribution. Barrett grows new branches geographically, allowing it to maintain high concentrations in local markets, ramp up the speeds of growth, and reduce fixed costs associated with new regions. Their strategies in opening new branches culminate in an ROIC in 2019 of 30.6%. The IRR on new branches that take 7 years to reach maturity is still more than 150%. \n\n\nBranch Stratification:\n\nNumber of Branches | Size | Run Rate| Average Profit Margin\n---|---|----|----\n18 | Mature | &gt;$100 Mil | ~60%\n20 | Emerging | $30-$100 | ~40%\n26 | Developing | &lt;$30 | ~10%\n64 | Total |  | \n\n&amp;nbsp;\n\n**Conclusion:**\n\n\nBased on the underlying business model and execution of the management, BBSI seems undervalued. Based solely on their strong balance sheet and large multiple discrepancy between both themselves historically and their fellow PEO peers, they seem like a buy and hold until well after the COVID-19 Crisis has ended. Their business will have the ability to ramp up naturally as their clients begin to hire again and small businesses are looking for a way to outsource admin they may have laid off. In conjunction with their strong branch economics, BBSI is currently undervalued for investors who can take a 3+ year time horizon allowing for the business to recover and their multiple to converge with peers.\nA model has not been completed as Q1’20 results have not been released, which will likely contain big indications into how BBSI will perform for the coming quarter and year. A model will be completed, and an update posted once Q1’20 data has been released. \nQ1’20 is expected to be released 5/5 after market close. In the absence of a model, I have already thoroughly investigated their past few 10-k’s and read through most of their earnings calls over the past few years. I have spent a considerable amount of time insuring I understand how their business and financials tie to one another. To feel comfortable going long this business, I felt the need to dig in and understand it from their branch economics to how their workers’ compensation claims policy works with Chubb.\n\n I am more than happy to discuss the company and delve deeper into the financials of the company if anyone has any questions/comments. \n\n&amp;nbsp;\n\n**Disclaimer:**\n\nThis is not investment or financial advice and the above thesis is predicated on my opinion &amp; interpretation of the facts mentioned. I am currently long BBSI in my personal portfolio.\n\n&amp;nbsp;\n\n**Sources:**\n\nSEC Edgar 10-k’s and 10-Q’s\n\nTIKR.com’s Earnings Call Transcripts\n\nPrice and share data from TIKR and Excel add-in feed\n\n“Competition Demystified” by Bruce Greenald &amp; Judd Kahn for ROIC formula/concepts\n\n&amp;nbsp;\n\nEdit: added disclaimer",
        "subreddit": "SecurityAnalysis",
        "title": "The Bull case for Barrett (BBSI)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/gdzpl5/the_bull_case_for_barrett_bbsi/",
        "created": 1588720944.0
    }
]