[
    {
        "author": "CultOfTheBlueWhale",
        "created_utc": 1605904871,
        "id": "jxx1y8",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "Hey guys, I'm the person who was begging people to get into AYRO 1 week ago when it was $3.75, like Noah begging the animals to get into the ark.\n\nIt's a $1 stock that is a household name to most of you, yet you don't know it. Use linux? Have a Vizio TV? Use Android? Yeah, BORQS is involved.\n\nIf you read through their 20-F filing, you'll find a ton of things that will make this pop, including the 5G devices they are making. They have a metric ton of partnerships and shifted most of their sales to India where they performed 10x better than selling in china. Recently they did a $150mil sale. If you are looking for their recent financials, look through the 20-F.\n\nAlso 10% of institutional shares are held by INTEL, with another small amount by Renaissance Capital.\n\nCompany Milestones:\n\n* 2007-2008 Establish R&amp;D centers in Beijing, China and Bengaluru, India\n* 2007 Partnered with [Google](https://en.wikipedia.org/wiki/Google) Open Handset Alliance (OHA)\n* 2008 [China Mobile](https://en.wikipedia.org/wiki/China_Mobile), [Softbank](https://en.wikipedia.org/wiki/Softbank), [Vodafone](https://en.wikipedia.org/wiki/Vodafone) and Borqs set the formation of Joint Innovation Laboratory (JIL)\n* 2011 Established strategic partnership with [Intel](https://en.wikipedia.org/wiki/Intel)\n* 2011 Cooperated with [WAC](https://en.wikipedia.org/wiki/Wholesale_Applications_Community) to realize full compatibility with the Web Runtime 1.0 in the Google Android platform\n* 2013 Joined [Linux](https://en.wikipedia.org/wiki/Linux) Foundation\n* 2013 Established strategic partnership with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)\n* 2014 Established joint venture with [Positivo](https://en.wikipedia.org/wiki/Positivo) in Brazil\n* 2010-2014 Established Android mobile services with [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) and [SingTel](https://en.wikipedia.org/wiki/SingTel) Group\n* 2014 In cooperation with [Sonim](https://en.wikipedia.org/wiki/Sonim), Borqs delivered [AT&amp;T](https://en.wikipedia.org/wiki/AT%26T) Push-To-Talk Android phone\n* 2015 Provided Android enhancement and product realization for [Sprint](https://en.wikipedia.org/wiki/Sprint_Nextel)’s tablet\n* 2015 In cooperation with ElaCarte, Borqs developed ruggedized restaurant ordering tablets\n* 2011-2015 Developed 50+ Android devices, 10M+ commercial shipments in 15+ countries\n* 2015-2016 Supported [Vizio](https://en.wikipedia.org/wiki/Vizio) for Smart TV remote control\n* 2015-2016 Provided the In-vehicle Infotainment (IVI) s/w and solutions for [Geely](https://en.wikipedia.org/wiki/Geely)\n* 2016 Supported [Reliance](https://en.wikipedia.org/wiki/Reliance_Communications) for the world's first 4.75G phone\n* 2016 Launched [Anda](https://en.wikipedia.org/w/index.php?title=Anda_(company)&amp;action=edit&amp;redlink=1)’s [\\[2\\]](http://www.anda.pe/) Symbol-based Communication Wearable for Children at [COMPUTEX](https://en.wikipedia.org/wiki/COMPUTEX) 2016\n* 2016 Partnered with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm) in developing the world’s first 4G Android wearable device\n* 2017 Marked debut as a public company on The [NASDAQ](https://en.wikipedia.org/wiki/NASDAQ) Stock Market under the trading symbol, BRQS.\n* 2017 Exhibited the world’s first [NB-IoT](https://en.wikipedia.org/wiki/NB-IoT) tracker based on [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)’s wear platform during [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) Global Partners Conference\n* 2018 Signed letter of intent to acquire electric vehicle control company Shanghai KADI Machinery Technology Co., Ltd\n* 2018 Signed agreement to acquire a major Chinese EMS – Shenzhen Crave Communication",
        "subreddit": "RobinHoodPennyStocks",
        "title": "BRQS - Currently $1 @ 25MM market cap - from the guy who suggested AYRO a week ago.",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/jxx1y8/brqs_currently_1_25mm_market_cap_from_the_guy_who/",
        "created": 1605933671.0
    },
    {
        "author": "aMereMortalxxx",
        "created_utc": 1604875919,
        "id": "jqlhvn",
        "num_comments": 112,
        "num_crossposts": 0,
        "selftext": "My post [last Sunday](https://www.reddit.com/r/wallstreetbets/comments/jmbuff/i_draw_with_crayons_so_you_dont_have_to_this/) where I talk about my positions. [On Wednesday I did a follow up](https://www.reddit.com/r/wallstreetbets/comments/jo3up7/4k_in_realized_gains_from_sunday_positions_next/) and discussed why I held some, closed others, and also why I opened up cash-secured-puts on QCOM right before earnings for a $450 pay-day.\n\nKeep in mind I only sell puts and buy shares. I made $4k on putting roughly $80k of collateral down for buying shares if I end up getting assigned. My true profit was about 5% last week with relatively low-risk positions where if they went against me I would bag-hold until profitable. When you are willing to bag-hold for months you literally cannot lose on any position (not financial advice). If you're ready to take your trading to the next level and do some technical ANAL(ysis) with me, then follow along. For those of you that hate money close this thread immediately.\n\nLastly, before I start. This is my game-plan for tomorrow's open. A lot depends on the price action in the morning. If market is down big or flat in the morning it will help me sell puts or buy shares, if we open hulk green then I just may need to wait. I haven't entered any of these positions yet. Normally I don't do this many positions, but it's earnings so its time to YOLO on some theta decay.\n\n&amp;#x200B;\n\nBefore we start, when you look at my charts:\n\n**PINK = CHANNEL LINES** where the stock bounces between that range. When a stock exits a channel it either:\n\n1. Comes right back down into the channel or\n\n2. Begins to form a new channel.\n\nYou will never know which option happened until after-the-fact.\n\n**BLUE = SUPPORT OR RESISTANCE LINES**\n\n&amp;#x200B;\n\nAll positions listed should be expected to expire this Friday the 13th of November. You can always go out further to collect more premium. It all depends on your strategy and what you are comfortable with.\n\n**DDOG - Earnings on Tuesday**\n\nhttps://preview.redd.it/9quq9wx0i3y51.png?width=1964&amp;format=png&amp;auto=webp&amp;s=91186ec0288bd562ee7a4fc31f96f4de3591efc7\n\nDDOG provides cloud-based services. They shit the bed last earnings and the stock tanked 20% the next day. Am I worried about that happening again? Of course. Do I think it will? No. They are currently trading 10% higher than they were from market-close of their last earnings call. For any of you that have been following the stock, they landed a huge deal with Microsoft and we are about to find out just how much value that contract will bring. For that reason I think it will put a hard floor on where the stock might drop to.\n\n**Positions:** \n\n$95p strike for $4.25 premium expiring this week will net you a return of about 4.5%. \n\nBreak-even only reached if stock drops to $90.75.\n\n&amp;#x200B;\n\n**RKT - Earnings on Tuesday**\n\nhttps://preview.redd.it/1r6vebe2i3y51.png?width=1968&amp;format=png&amp;auto=webp&amp;s=9a41d32126ce49e2e91ec8b05af193af5bfd916a\n\nRKT is somewhat of a recent IPO so the stock price is all over the place. What I do see on the chart is some strong support at the $18 and $20 level. The trend is currently down, but it looks like the stock might be reversing and breaking into a new channel through earnings this week. Good earnings will rocket this stock back to $25+, poor earnings we can re-test the $20 level. I like the upside on this one relative to what the downside might be. I'll be selling puts here.\n\n**Positions:** \n\n$20p strike for $0.75 premium will have a return of 3.75%\n\nBreak-even is reached if the stock drops below $19.25\n\n&amp;#x200B;\n\n**RVLV - Earnings on Wednesday**\n\nhttps://preview.redd.it/dx4hk495i3y51.png?width=1954&amp;format=png&amp;auto=webp&amp;s=e262fb8fd220ac069fb0b822e6b2030c88392ec9\n\nRevolve crushed earnings on their last report and the stock went up 25%. You can see the stock has been trading in channel (pink lines) and is sitting comfortably somewhere near the high portion of the channel. Each time the stock price exited the channel to the upside it was rejected and pulled right back down. Generally it takes a break-through of the supply zones (resistance) or a big event to exit a channel and form a new trend. If we see some downside from earnings we might get a bounce off the $18 level. I'll be selling some puts there.\n\n**Positions:** \n\n$18p for $0.85 premium will have return of $4.7%\n\nBreak-even reached if the stock drops below $17.15\n\n&amp;#x200B;\n\n**PTON - Earnings last week**\n\nhttps://preview.redd.it/tqfvpvl6i3y51.png?width=1956&amp;format=png&amp;auto=webp&amp;s=0f4a5802a15a0769523eee117083da0b6805d19f\n\nPeloton reported earnings last week. Management summarized to us that demand was still very high and they had trouble keeping up with it. Pretty fucking solid. This stock is literally a meme, but I do think it will be bought up on any dips. IV is also pretty high so I'll be selling weekly puts at the $115 or $120 level when I get a chance.\n\n**Positions:** \n\n$120p at $2.25 premium for a return of 1.9%, break-even at $117.75\n\n$115p at $1.00 premium for a return of 0.85%, break-even at $114\n\n&amp;#x200B;\n\n**V - Not earnings play**\n\nhttps://preview.redd.it/ppd3x268i3y51.png?width=1836&amp;format=png&amp;auto=webp&amp;s=58093caef63d46861d8751d5ea4826d9c69135f0\n\nVisa is one of the more predictable stocks. The dip to $180 two weeks ago was an early Christmas gift. I didn't draw any channel zones with my magical crayons here because this thing just bounces back and forth between resistance and support zones. V is currently trading at the pinnacle of the resistance line. If it gets rejected expect another dip back to $195 or even $190. If it breaks through we might see a continuation in momentum all the way up to $215. Why? We might see some follow through on last week's move. All the other times it was rejected by $200 from July through August it was on small moves and lower volume.\n\n**Positions:**\n\nIV is low on Visa, personally I would just outright buy the shares here. You can sell the weekly $210 covered call for some extra pocket money. I doubt this will break-through by end of next week and if it does you've already won on your shares.\n\n&amp;#x200B;\n\n**Pro Tip:** Cash-secured-puts are a much \"safer\" way to make money. There is a misconception about selling higher volume of credit spreads instead of 1 or 2 cash-secured-puts because when you lose on a credit spread you are realizing and accepting the loss. \n\n&amp;#x200B;\n\nListen here folks, we will NEVER accept defeat. We might lose the battle and get assigned some shares of these ultra high-quality stocks, but we will ALWAYS win the war and come out profitable. See how I am aiming here for 1-3% on each of these plays. We are winners baby so lets make that bread.",
        "subreddit": "options",
        "title": "I draw with crayons so you don't have to. Made $4k last week selling puts on stonks and buying shares in CRM. Here are my plays this week: DDOG, RKT, PTON, RVLV, V",
        "url": "https://www.reddit.com/r/options/comments/jqlhvn/i_draw_with_crayons_so_you_dont_have_to_made_4k/",
        "created": 1604904719.0
    },
    {
        "author": "djsmfnskcifk",
        "created_utc": 1605928282,
        "id": "jy3idr",
        "num_comments": 111,
        "num_crossposts": 0,
        "selftext": "Warren Buffet said to follow your gut...\n\nI rediversivied my 8k portfolio. I had about 25%YTD from nvda, Qualcomm, apple, etc. to\n\n100% TSLA \nAnd my next paychecks are going towards bitcoin \n\nI'm 28 and single.  LETS GET RICH!",
        "subreddit": "StockMarket",
        "title": "ALL IN TSLA &amp; BTC",
        "url": "https://www.reddit.com/r/StockMarket/comments/jy3idr/all_in_tsla_btc/",
        "created": 1605957082.0
    },
    {
        "author": "TangerIl",
        "created_utc": 1606046506,
        "id": "jyul3y",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "Warning: Post contains voodoo and magic line faggotry. Not Safe For Retards\n\nSo I was bored. Wife is out with her boyfriend, Cyberpunk was supposed to be out, NNN means I can't pull out my JPOW anime body pillow, etc. So with nothing to do and TSLA memes still fresh in the one crease on my silky smooth brain, I decided to read up on the dark arts (Investopedia) and this is what I unveiled.\n\nAAPL is the next TSLA.\n\nTSLA blasted off Monday after hours into new atmospheric highs. Could the voodoo have predicted this? Well let's take a [look](https://imgur.com/a/kHx0SI4). Tesla was consolidating within a pennant. Low [ADX](https://www.investopedia.com/articles/trading/07/adx-trend-indicator.asp) (lack of clear trend) and low implied volatility also suggested Tesla was laying dormant and ready to erupt. Volume was declining since the September highs verifying bullish consolidation. During the days before takeoff, volume was dead quiet, as quiet as it was in July, where it also consolidated within a astrology triangle before a bullish breakout. Then Elon launched astronauts to the ISS on Sunday, stockholders to the moon on Monday, and call holders to Mars on Tuesday. The green dildo volume spikes this week confirmed the breakout. The rise in ADX and IV confirmed this as well. Finally, [Andrew's Pitchfork](https://www.investopedia.com/articles/forex/05/andrewspitchfork.asp) (pink lines) is valid due to multiple reactions on the median and bottom line, which some autist named Andrew claims price will have an 80% chance of reaching the median of the pitchfork. In short, more magic lines screaming TSLA is going bigly up. \n\n\"Oh look now you bring up this hocus pocus bullshit after its muuned. Your retard ass could only stitch this mumbo jimbo wizardry together after the breakout.\" \n\n\"If this is legit, then why the fuck didn't you say anything earlier - you busy sucking dicks at the gloryhole?\" (they meet COVID safety standards btw)\n\n\"This is bullshit, if you knew this where are your gains? You don't earn enough flipping burgers to where you can't afford a tier 3 Pokimane sub and TSLA fds?\n\n\"This is a waste of time, you're such a gay cucktard that you make the bull on Wall Street, who's had its balls fondled everyday for decades look straight.\"\n\nOnly one of these is true. And is why I present to you all 🍎.\n\nApple is the girl you start dating, where after a few dates you find out she has a twin. Damn two hot girls that look exactly alike? You're a lucky man you think in your head. Then she takes you to her home for Thanksgiving and there you meet her sister, a celebrity. Her name's Tesla and she is S3XY. However, she doesn't look like the sister you're dating. She is the hottest girl you've seen and with curves all in the right places; it is no wonder why her assets bring her a massive cult following. This is when you realized you dated the wrong sister. But it's not like Apple isn't hot. Tesla is way out of your league anyways. With her beauty (stock) reaching new all time highs and her fame (IV) skyrocketing, perhaps you shouldn't chase. After all [Apple](https://imgur.com/a/bt0mJC6) is still hot right? They are twins and share [similar](https://imgur.com/a/ZaghU7R) features. \n\nApple is consolidating in a pennant. AAPL has declining volume since the September highs confirming bullish consolidation. ADX is low as well as IV. Low IV is when options (calls and puts) are typically cheap, so preferably you want to be on the buy side of option premium. Volume last week was noticeably silent marking some of the lowest traded volume this year. Simply put, AAPL looks just like TSLA two weeks ago, ready to go bigly up or bigly down.\n\nLet me tell you why Tim Apple is most likely polishing his rocket and not his drill. First, declining volume displays bullish consolidation. Second, AAPL has a valid Andrew's Pitchfork with reactions on the median and lower bound, so it has a higher likelihood of reaching the median. Third, the QQQ will print a new all time high. If SPY and IWM have printed a new all time high, whats the likelihood the monster that is Tech (up 36% YTD) would not go past its September high? Already large holdings in the Nasdaq are past the September high. For example, QCOM and particularly GOOGL. If Google can do it, why can't the rest of FANG?\n\n\"I'm scared. There's an autist here spewing shit about demonic triangles and pitchforks. All of a sudden dude starts a creepy cringe tandem about twin girls. This dipshit probably summoned a succubus with his voodoo bullshit, and gave up his soul for this shitpost\"\n\nShrooms are fucking amazing.\n\nBack to the topic. Don't forget Tim Apple and Papa Musk are basically [butt buddies](https://oracleoftime.com/wp-content/uploads/2018/07/Elon-Musk-vs-Tim-Cook-2.jpg). When Apple said they were gonna split their stock this summer, who decided to throw his own tendie party weeks later? Now that Tesla is leaving the atmosphere to Mars, do you think Tim Apple will want to miss out?\n\n\"What will be the catalyst?\" Fuck would I know what Tim Apple is cooking. But this voodoo astrology can smell the tendies he's about to serve.\n\n\"But but the rising cases, the winter lock down, the fundament-\" Shut the fuck up. When was the last time fundamentals mattered? You gay bears like it up the ass so much, you fur fags can't shut up. Fuck the news, we'll only crash if JPOW runs out of ink and we have another liquidity crisis.\n\nI can't guarantee AAPL will be as explosive as TSLA. It's already a 2 trillion dollar company. I can't guarantee AAPL will even go up. This post is simply an argument why it is probable it will muun. But with 3 months of consolidation and eerily silent volume, Apple is gearing up for a big move that will move the markets with it.\n\nIf you actually got this far (wtf?), thank you for letting me waste your time. \n \nPositions: Well I'm fucking balls deep in GME, so this is all I could cough up. AAPL 11/27 125C. Will probably go for December/January expirations once I can get another paycheck from Wendy's.\n\nTL;DR: Yall autists clambering about those commie ass EVs being the next Tesla are missing the iRocket Tim Apple is building to join Elon on Mars. Buy calls. Or just do what you want. At the end of the day it's just magic lines right? It's fugazi. It's a whazy. It's a woozie. It's fairy dust.",
        "subreddit": "wallstreetbets",
        "title": "Yall sleeping on Tim Apple - the next Tesla",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jyul3y/yall_sleeping_on_tim_apple_the_next_tesla/",
        "created": 1606075306.0
    },
    {
        "author": "joelivi053",
        "created_utc": 1606472685,
        "id": "k1yr5g",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "TSNP trading at .04 a share, is on the rise as the Company prepares to complete the reverse merger with HUMBL; a major mobile payments player with a first-class management team with team members coming from companies like Western Union, Moneygram, Visa, American Express, Epson, Microsoft, Facebook and Qualcomm and was recently named a Forbes “Rising Startups to Watch” Reverse Merger stocks (RM) are easily among the most exciting and explosive stocks in small caps rivaling only biotechs in their ability to make historic gains.\n\nTesoro Enterprises, Inc. (OTCMKTS: TSNP) is a clean shell operating out of Oklahoma City, Oklahoma. The Company recently announced it has entered into an agreement with HUMBL, LLC to merge the two entities. In an all-stock transaction, the members of HUMBL will receive preferred shares of Tesoro in exchange for their HUMBL holdings. The mission of HUMBL® and HUMBL Hubs™ is to deliver high quality, low cost digital payments and financial services. The HUMBL network was designed to disrupt entrenched regional banks, wire services and roadside finance providers in emerging markets such as Latin America, Caribbean, Asia and Africa to help reduce costs and improve settlement speeds for customers. The HUMBL® Mobile App delivers borderless transactions, by integrating multiple currencies, payment methods, banks, blockchain and financial services providers into one-click for the customer. HUMBL® provides greater access and portability than US only mobile wallet providers, such as Venmo® and Zelle®.\n\nHUMBL is comprised of team members from companies like Western Union, Moneygram, Visa, American Express, Epson, Microsoft, Facebook and Qualcomm and was recently named a Forbes “Rising Startups to Watch” in June 2020 for recognizing the “major gap between the US and emerging markets regarding mobile payments.” HUMBL has designed a mobile wallet (HUMBL®) and merchant software (HUMBL Hubs™), that help primarily cash economies migrate to digital money services across key vertical markets, such as: government, banking, wireless carriers and merchant services. HUMBL’s global money platform will deliver up to 50% estimated savings on transactions such as: sending, receiving, lending, borrowing, investing money and paying bills.",
        "subreddit": "StockMarket",
        "title": "TSNP merging with HUMBL needs to be on HIGH ALERT",
        "url": "https://www.reddit.com/r/StockMarket/comments/k1yr5g/tsnp_merging_with_humbl_needs_to_be_on_high_alert/",
        "created": 1606501485.0
    },
    {
        "author": "CultOfTheBlueWhale",
        "created_utc": 1605904912,
        "id": "jxx2dl",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Hey guys, I'm the person who was begging people to get into AYRO 1 week ago when it was $3.75, like Noah begging the animals to get into the ark.\n\nIt's a $1 stock that is a household name to most of you, yet you don't know it. Use linux? Have a Vizio TV? Use Android? Yeah, BORQS is involved.\n\nIf you read through their 20-F filing, you'll find a ton of things that will make this pop, including the 5G devices they are making. They have a metric ton of partnerships and shifted most of their sales to India where they performed 10x better than selling in china. Recently they did a $150mil sale. If you are looking for their recent financials, look through the 20-F.\n\nAlso 10% of institutional shares are held by INTEL, with another small amount by Renaissance Capital.\n\nCompany Milestones:\n\n* 2007-2008 Establish R&amp;D centers in Beijing, China and Bengaluru, India\n* 2007 Partnered with [Google](https://en.wikipedia.org/wiki/Google) Open Handset Alliance (OHA)\n* 2008 [China Mobile](https://en.wikipedia.org/wiki/China_Mobile), [Softbank](https://en.wikipedia.org/wiki/Softbank), [Vodafone](https://en.wikipedia.org/wiki/Vodafone) and Borqs set the formation of Joint Innovation Laboratory (JIL)\n* 2011 Established strategic partnership with [Intel](https://en.wikipedia.org/wiki/Intel)\n* 2011 Cooperated with [WAC](https://en.wikipedia.org/wiki/Wholesale_Applications_Community) to realize full compatibility with the Web Runtime 1.0 in the Google Android platform\n* 2013 Joined [Linux](https://en.wikipedia.org/wiki/Linux) Foundation\n* 2013 Established strategic partnership with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)\n* 2014 Established joint venture with [Positivo](https://en.wikipedia.org/wiki/Positivo) in Brazil\n* 2010-2014 Established Android mobile services with [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) and [SingTel](https://en.wikipedia.org/wiki/SingTel) Group\n* 2014 In cooperation with [Sonim](https://en.wikipedia.org/wiki/Sonim), Borqs delivered [AT&amp;T](https://en.wikipedia.org/wiki/AT%26T) Push-To-Talk Android phone\n* 2015 Provided Android enhancement and product realization for [Sprint](https://en.wikipedia.org/wiki/Sprint_Nextel)’s tablet\n* 2015 In cooperation with ElaCarte, Borqs developed ruggedized restaurant ordering tablets\n* 2011-2015 Developed 50+ Android devices, 10M+ commercial shipments in 15+ countries\n* 2015-2016 Supported [Vizio](https://en.wikipedia.org/wiki/Vizio) for Smart TV remote control\n* 2015-2016 Provided the In-vehicle Infotainment (IVI) s/w and solutions for [Geely](https://en.wikipedia.org/wiki/Geely)\n* 2016 Supported [Reliance](https://en.wikipedia.org/wiki/Reliance_Communications) for the world's first 4.75G phone\n* 2016 Launched [Anda](https://en.wikipedia.org/w/index.php?title=Anda_(company)&amp;action=edit&amp;redlink=1)’s [\\[2\\]](http://www.anda.pe/) Symbol-based Communication Wearable for Children at [COMPUTEX](https://en.wikipedia.org/wiki/COMPUTEX) 2016\n* 2016 Partnered with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm) in developing the world’s first 4G Android wearable device\n* 2017 Marked debut as a public company on The [NASDAQ](https://en.wikipedia.org/wiki/NASDAQ) Stock Market under the trading symbol, BRQS.\n* 2017 Exhibited the world’s first [NB-IoT](https://en.wikipedia.org/wiki/NB-IoT) tracker based on [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)’s wear platform during [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) Global Partners Conference\n* 2018 Signed letter of intent to acquire electric vehicle control company Shanghai KADI Machinery Technology Co., Ltd\n* 2018 Signed agreement to acquire a major Chinese EMS – Shenzhen Crave Communication",
        "subreddit": "pennystocks",
        "title": "BRQS - Currently $1 @ 25MM market cap - from the guy who suggested AYRO a week ago.",
        "url": "https://www.reddit.com/r/pennystocks/comments/jxx2dl/brqs_currently_1_25mm_market_cap_from_the_guy_who/",
        "created": 1605933712.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1604326504,
        "id": "jmo4jq",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": " So Friday we saw the stock market down again as the dow fell almost 0,6% percent while the s&amp;p fell over 1% and the nasdaq was crushed being down almost 2and a half percent as This last week we saw the dow fell 6,5% the s&amp;p 5,6% and the nasdaq 5,5% as all 3 ended the month of october down more than 2,3%\n\nOne good thing for the US economy is that the retail stores sales has recovered and consumers are still spending excess cash especially with the holidays and black Friday up next. I believe that as much as Tuesday is important for the economy, the events that will come later in the week as the FED holds two important meatings and the latest jobs report comes in at the end of the week far outweight that\n\nAs you can see the New York Federal bank economic index is still rising, that sugests a V-Shaped recovery is continuing in the US. This index takes into consideration lots of important data from the economy.\n\nThe unemployment in the US has been decling but that rate has sharply slowed down in the last months as it’s still more than double the 3,5% at the start of the year as the latest number from September was almost 8% rate of unemployment.\n\nAs you can see the most affected people are still the middle and low wage under 60k/year. As the high wage jobs unemployment rate is barely down 0,5% since January.\n\nSo the fear in the stock market saw a huge pop in the last week as the VIX (the volatility index) rose from 27,55 more than 10 points to close at over 38 this last week. This next week is probably the last with such high volatility as the upcoming big events will pass and more certainty will be in front of us . The volatility was so high as we retested the June highs and have seen a pullback 3 times after hiting those levels.\n\nDespite strong earnings last week from all big tech companies (Alphabet,Amazon,Apple, facebook and Microsoft) the companies stocks dropped amid the broader stock market sell-off with the exception of Google which posted terrific numbers to crush analysts expectation.\n\nApple is down almost 19% since the highs of September and has lost 450 billion dollars in market cap since then.\n\nThis dropped in the company has been caused by a broader stock market sell off as well as missed iphone revenues. I do believe that iphone revenues will see a huge spike in the next coming quarters as apple customers as myself will finally upgrade from older iphone to this next generation iphone which is the first to have 5G technology as well as other great improvements in capability as well as camera.\n\nA couple analysts have recently changed they’re target to between 132-140 which is over 20$ from where it sit’s today. That is quite good upside for the company.\n\nAs you can see they are barely down 2,7% year over year in product revenue despite not having the new iphone launch included in this financials, and overall the company still saw a 1% increase in revenue due to the huge spike in services revenue that I believe will continue especially with the Apple One bundle just being launched at the end of last week. The Total Gross margin also increase slightly but I expect this to be just a small drawback in the short-term.\n\nAlso I believe that Amazon was dragged down because of the next quarter predictions of huge costs while they only forecasted a operating income of 1 to 4 point 5 billion dollars which is below what was anticipated despite amazon web services continuing to be the largest player in cloud spending. With a 32% share of total market and a revenue of 11,6 billion dollars which Is up 29% year over year, while Azure from Microsoft comes in second and google cloud in third. There is still a lot of room to grow for all of this companies as there is still over 37% of the market provided by other companies. Also this is a great company to own for the long term as digitazation and online commerce will continue to grow, some are estimating that by 2030 amazon could have annual revenues of 1 trillion dollars $ while using conservative projections of compound annual growth for e-commerce of 10%, for the cloud services of 15% and for ad revenue of 20%, amazon could hit that mark by then. But I believe this is possible even faster than that.\n\nFacebook is the one company that I will have to analyze more in this group. They will be hit with privacy issues do to the regulatory risk and Apple’s announced privacy changes. But I still do believe this to be a great company as they also own Instagram, and I really like how that part of the company is innovating and growing.\n\nWhile google seems to be back on track as the company was the laggard in the group. They have become less reliant on the search ad revenue as growth in Youtube ads and Google cloud will push the company to renewed growth in the future.\n\nAlibaba will see two big events this week as they will kick off the singles day event next week, extending the event with 3 more days rather than the usual 24-hour event, in which they will also double the products on offer. Also another big event will be the IPO of ant Group in which Alibaba will still have a big stake. I believe they are a great company the forward revenue growth estimates of 31% are higher than other tech companies like amazon, google and Microsoft while the P/E for the company is the most attractive of the group also.\n\nFord just announced that late next year they will introduce a lower priced competitor for Tesla AutoPilot and GM’s super cruise, this is great news for the company as they seem to be improving the company continuasly.\n\nSome important earnings coming this week are :\n\nPaypal on Monday, which I believe is the greatest fin-tech company, on\n\nWednesday Qualcomm will announce that will be a great insight to see what Apple’s iphone 12 is doing as Qualcomm is the biggest supplier for apple and on Thursday Alibaba (with ant group ipo) coming also on the same day this stock could see a surge in value.",
        "subreddit": "stocks",
        "title": "Stock market news, updates &amp; predictions , Should you Buy or Sell Now? [2-11-2020]",
        "url": "https://www.reddit.com/r/stocks/comments/jmo4jq/stock_market_news_updates_predictions_should_you/",
        "created": 1604355304.0
    },
    {
        "author": "JayceTingler",
        "created_utc": 1605746362,
        "id": "jwsd1u",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "That’s all, I just put my life savings all in a QCOM call so it’s be nice if you guys make it go up thanks bue",
        "subreddit": "wallstreetbets",
        "title": "Send QCOM to the Moon!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jwsd1u/send_qcom_to_the_moon/",
        "created": 1605775162.0
    },
    {
        "author": "GrizzlyDiaby",
        "created_utc": 1604751672,
        "id": "jppy6n",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Hey guys!\n\nI’m new to stock trading and I keep making mistakes. Like I bought Cloudflare because I understand the company and I feel like their business model is strong, so it’s a good option for the long run. My problem is timing. I bought it after the ER when it was around $69. It closed the day at around $64. My question is, how to find the right timing? Or does it even matter if you’re planning to hold a stock for over a year? I’m interested in buying Qualcomm next, so I thought I’ll gather some opinion from people who’ve been doing it for a while before I make another mistake.",
        "subreddit": "stocks",
        "title": "Best time to buy: Am I doing it wrong?",
        "url": "https://www.reddit.com/r/stocks/comments/jppy6n/best_time_to_buy_am_i_doing_it_wrong/",
        "created": 1604780472.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1604696760,
        "id": "jpdg8t",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, November 6, 2020**\n\nStocks took a breather today, trading slightly lower after a continuous four-day rally. Market participants closely await the results of the US presidential election. The Nasdaq (QQQ) finished 0.07% up, the S&amp;P 500 (SPY) finished 0.02% down, and the Dow Jones (DIA) performed the worst, 0.26% down on the day.\n\nToday, the Labor Department released a better-than-expected October jobs report. The report shows that there were 638,000 non-farm jobs added to the economy versus the 580,000 expectation. The unemployment rate was 6.9%, compared to the 7.6% expectation (unemployment rate in September was 7.9%). The job report is surprisingly good, given the recent surge in coronavirus cases across the United States. \n\nThe US Presidential Election remains the key focal point for market participants and Wall Street. Because of the surge of mail-in ballots, three days after Election Day several key swing states, including Nevada, Georgia and Pennsylvania,  have yet to announce results. According to the Associated Press, Joe Biden has 264 electoral votes to President Trump’s 214. Candidates need 270 electoral votes to win the election. As of this morning, Joe Biden took a very slim lead in Georgia and Pennsylvania and has increased his lead in Nevada. Below are the states that have been called, according to the Associated Press:\n\n* States called for Trump: Ky., W. Va., S.C., Ala., Miss., Tenn., Okla., Ark., Ind., N.D., S.D., Wyo., La., Neb. (4 of 5 electoral votes), Kan., Mo., Idaho, Utah, Ohio, Iowa, Mont., Fla., Texas\n* States called for Biden: Vt., Va., Conn., Del., Ill., Md., Mass., N.J., R.I., N.Y., N.M., D.C., Colo., N.H., Calif., Ore., Wash., Hawaii, Minn., Ariz., Maine (3 of 4 electoral votes), Wis., Mich.\n\nA win for Biden is looking increasingly likely, given he only needs to win one more of the battleground states in order to take the White House. During a press conference yesterday afternoon he said that he had “no doubt” that once the counting was complete he and Kamala Harris “will be declared winners.” Trump, on his part, has doubled down on his calls “stop the count”, baselessly alleging widespread fraud during the election. His campaign has already sued multiple battleground states to challenge to ballot-counting process. A vote in Miching denied Trump’s efforts. \n\nDespite some of the uncertainty still surrounding the election, stocks rallied strongly again in the immediate aftermath of Election Day. According to a number of analysts, traders like a divided government, where no single party would control each of the White House, Senate, and House of Representatives. Under that scenario, major policy changes are unlikely to get advanced.\n\n**Highlights**\n\n* The US Office of Special Counsel has opened an investigation into allegations the Trump campaign violated federal law by using the White House on Election Day as a command center, according to Reuters.\n* Livent (LTHM) shares set new 52-weeks high after the positive earnings report and news of an expanded partnership with (TSLA) for lithium\n* NIO just unveiled its 100-kilowatt-hour battery and also announced battery upgrade plans at an event in Beijing, per a report by Benzinga.\n* Invesco's (QQQ) ETF of the 100 biggest Nasdaq stocks pulled in nearly $2.7B from investors on Thursday, one of its biggest single-day hauls of the year, according to data from FactSet\n* Shares of luxury e-commerce retailer Farfetch (FTCH) soared more than 11% today after it announced a partnership with Alibaba (BABA), 4.31% and Richemont (CFRUY) that includes an expansion in the Chinese market and a $600 million investment.\n* Tesla (TSLA) has added Tequila as a merchandise offering on its online store. The electric vehicle maker is taking orders for company-branded Tequila in select states in the United States.\n* Chewy (CHWY), the online pet-supply retailer, and brick-and-mortar stores such as PetSmart and PetCo will benefit from the closure of PetValu stores, Wedbush said in a note to clients on Friday.     \n* Alibaba (BABA) with target increase by Royal Bank of Canada from $300 to $335 at OUTPERFROM . Stock curren tly at $300 after a monster day today.\n* Avalara (AVLR) had several target raises. Stock currently around $162. \n   * Piper Sandler from $138 to $185 OVERWEIGHT\n   * Needham from $150 to $190 BUY\n   * JMP Securities from $165 to $185 OUTPEFORM\n* Cardinal Health (CAH) with two target increases. Stock currently around $53.\n   * Deutsche Bank (DB) at $65 BUY\n   * Robert W. Baird at $70 OURPERFORM\n* Dynava (DVAX) target raisewd from $12 to $14. Notable because the stock is currently $4.13 and has money from Bill &amp; Melinda Gates Foundation for Covid research\n* Global Blood Therapeutics (GBT) with massive target increase from $75 to $120 OVERWEIGHT. Stock currently around $60.\n* After reporting positive earnings, (GM) with several target increases. Stock currently around $37.\n   * Credit Suisse to $47 OUTPERFORM \n   * Royal Bank of Canada to $49 OUTPERFORM \n   * Benchmark to $47 BUY\n* Hubspot (HUBS) with two, very bullish target increases. Stock currently around $336.\n   * Piper Sandler from $300 to $435 OVERWEIGHT\n   * Needham from $325 to $400 BUY.\n* Industrial Innovative Properties (IIPR), a weed REIT, with target increase from $140 to $185 OUTPERFORM. We love this stock at Psycho!.\n* Monster Beverage (MNST) target raise by Deutsche Bank (DB) from $92 to $97 BUY. Stock is currently around $83.\n* Cloudfare (NET) with two target increases. Stock currently around $58.\n   * Wells Fargo (WFC) $50 to $70 OVERWEIGHT\n   * Needham from $69 to $75 BUY BUY\n* Qualcomm (QCOM) target increase by Argus from $150 to $175 at BUY. Stock rallied after beating earnings recently. Currently around $143.\n* After destroying earnings, (ROKU) with too many target increases to list. Average price target around $280 with BUY rating. Stock currently around $225.\n* Sunrun (RUN) with two target increases. We really like this clean energy stock. Stock price around $58\n* Square (SQ) with two target increases after beating earnings. Stock currently around $175.\n   * Wells Fargo (WFC) to $200 OVERWEIGHT\n   * Needham to $230 BUY\n* Take-Two Interactive (TTWO) target raised by Barclays from $196 to $210 at OVERWEIGHT. Stock currently around $168. We really like this one.\n* Zillow Group (Z) target raised by Needham from $125 to $145 at BUY. Stock currently around $104.\n\n\"Living well is the best revenge\" -George Herbert",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, November 6, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/jpdg8t/here_is_a_market_recap_for_today_friday_november/",
        "created": 1604725560.0
    },
    {
        "author": "aaplfarm",
        "created_utc": 1605851027,
        "id": "jxjjbc",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Don't think I've seen too many discussions on here about Apple's new M1 based Macs - maybe i missed them when the M1 was first released.\n\n&amp;#x200B;\n\nTech reviewers are unanimously orgasming and drooling over this new ARM based Apple-designed chip because it fucking destroys Intel/AMD chips in both performance, efficiency and cost.\n\nSeriously, as a life long PC Gamer + MacBook Pro user, the stats on these new chips are amazing and I'm genuinely concerned about Intel's future in the consumer segment. How will beefier desktop versions of these chips perform with superior cooling. \n\n&amp;#x200B;\n\nThe M1 chips are first generation, 'low-end' chipsets which are the first offerings from Apple for it's Mac. I think we will be blown away once again once they release their 'pro' chips for higher end machines (MBP high end, Mac Pro, iMac, etc).\n\n&amp;#x200B;\n\nCould licensing this chip technology and design out to PC manufacturers in the future be a viable new vertical for Apple (would this make sense for them to do? It's a solid XX-XXX digit $Billion TAM) Most other PCs can't fully utilize ARM chips because Windows is a POS. Apple is in the unique position to control every aspect of product design so it make sense that they've been able to come out with a laptop generation which is the largest leap in price/performance in recent history.\n\n&amp;#x200B;\n\nJust some anecdotal tweets I read\n\nhttps://preview.redd.it/56g6n19tzb061.png?width=602&amp;format=png&amp;auto=webp&amp;s=1cf4e0f6d0e794ce9e1c800a31ad5987e87b1d26\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gvnhc9gv0c061.png?width=596&amp;format=png&amp;auto=webp&amp;s=f7bd74f8ec1da9a72a0813c9ddcef121213ec67f\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ln7u0mpa1c061.png?width=619&amp;format=png&amp;auto=webp&amp;s=465d7fa8926293c426ad533a00dce0a0caf21baa\n\n&amp;#x200B;\n\nSeriously wtf, this chip out performs the top spec Intel chip from last year in REAL WORLD APPLICATIONS to an insane degree. When a sub $1400 M1 MacBook Air can run laps around a $6000 2019 16inch Intel MacBook Pro, you know Intel is truly fucked.\n\nNow in terms of $AAPL, obviously this hasn't affected the stock at all because Macs are now such a small % of their business. I think that the Mac/iPad segment is going to start to see growth once again when the true potential of the new chipset is realized and discovered by the market. Potentially they can start selling these chips to OEMs in a few years time? \n\n&amp;#x200B;\n\nAlso where are all the Windows peasants who spam comments about how Apple hardware is overpriced and doesn't perform as well as similarly priced Windows machines.\n\n&amp;#x200B;\n\nLinks:\n\n[https://www.theverge.com/2020/11/19/21574057/apple-m1-chips-laptop-performance-intel-qualcomm-competition](https://www.theverge.com/2020/11/19/21574057/apple-m1-chips-laptop-performance-intel-qualcomm-competition)\n\n[https://www.theverge.com/21570497/apple-macbook-pro-2020-m1-review](https://www.theverge.com/21570497/apple-macbook-pro-2020-m1-review)\n\n[https://www.anandtech.com/tag/apple-m1](https://www.anandtech.com/tag/apple-m1)\n\n[https://9to5mac.com/2020/11/11/macbook-air-with-m1-chip-beats-16-inch-macbook-pro-performance-in-benchmark-test/](https://9to5mac.com/2020/11/11/macbook-air-with-m1-chip-beats-16-inch-macbook-pro-performance-in-benchmark-test/)\n\n[https://twitter.com/twostraws/status/1328704598962565122](https://twitter.com/twostraws/status/1328704598962565122)\n\n&amp;#x200B;\n\nPositions: long AF AAPL for life, INTEL AMD NVIDIA WATCHOUT",
        "subreddit": "wallstreetbets",
        "title": "Apple M1 chip long term prospects to growth",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jxjjbc/apple_m1_chip_long_term_prospects_to_growth/",
        "created": 1605879827.0
    },
    {
        "author": "CultOfTheBlueWhale",
        "created_utc": 1605802419,
        "id": "jx5jmg",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "My position - in at $1 for $2500 shares\n\n&amp;#x200B;\n\n[https://en.wikipedia.org/wiki/Borqs](https://en.wikipedia.org/wiki/Borqs)\n\nIt's a $1 stock that is a household name to most of you, yet you dont know it. Use linux? Have a Vizio TV? Use Android? Yeah, BORQS is involved.\n\nBONUS POINTS: 10% of shares are held by INTEL [https://fintel.io/so/us/brqs#:\\~:text=Largest%20shareholders%20include%20Intel%20Corp,Borqs%20Technologies%2C%20Inc](https://fintel.io/so/us/brqs#:~:text=Largest%20shareholders%20include%20Intel%20Corp,Borqs%20Technologies%2C%20Inc).\n\nCompany Milestones:\n\n* 2007-2008 Establish R&amp;D centers in Beijing, China and Bengaluru, India\n* 2007 Partnered with [Google](https://en.wikipedia.org/wiki/Google) Open Handset Alliance (OHA)\n* 2008 [China Mobile](https://en.wikipedia.org/wiki/China_Mobile), [Softbank](https://en.wikipedia.org/wiki/Softbank), [Vodafone](https://en.wikipedia.org/wiki/Vodafone) and Borqs set the formation of Joint Innovation Laboratory (JIL)\n* 2011 Established strategic partnership with [Intel](https://en.wikipedia.org/wiki/Intel)\n* 2011 Cooperated with [WAC](https://en.wikipedia.org/wiki/Wholesale_Applications_Community) to realize full compatibility with the Web Runtime 1.0 in the Google Android platform\n* 2013 Joined [Linux](https://en.wikipedia.org/wiki/Linux) Foundation\n* 2013 Established strategic partnership with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)\n* 2014 Established joint venture with [Positivo](https://en.wikipedia.org/wiki/Positivo) in Brazil\n* 2010-2014 Established Android mobile services with [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) and [SingTel](https://en.wikipedia.org/wiki/SingTel) Group\n* 2014 In cooperation with [Sonim](https://en.wikipedia.org/wiki/Sonim), Borqs delivered [AT&amp;T](https://en.wikipedia.org/wiki/AT%26T) Push-To-Talk Android phone\n* 2015 Provided Android enhancement and product realization for [Sprint](https://en.wikipedia.org/wiki/Sprint_Nextel)’s tablet\n* 2015 In cooperation with ElaCarte, Borqs developed ruggedized restaurant ordering tablets\n* 2011-2015 Developed 50+ Android devices, 10M+ commercial shipments in 15+ countries\n* 2015-2016 Supported [Vizio](https://en.wikipedia.org/wiki/Vizio) for Smart TV remote control\n* 2015-2016 Provided the In-vehicle Infotainment (IVI) s/w and solutions for [Geely](https://en.wikipedia.org/wiki/Geely)\n* 2016 Supported [Reliance](https://en.wikipedia.org/wiki/Reliance_Communications) for the world's first 4.75G phone\n* 2016 Launched [Anda](https://en.wikipedia.org/w/index.php?title=Anda_(company)&amp;action=edit&amp;redlink=1)’s [\\[2\\]](http://www.anda.pe/) Symbol-based Communication Wearable for Children at [COMPUTEX](https://en.wikipedia.org/wiki/COMPUTEX) 2016\n* 2016 Partnered with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm) in developing the world’s first 4G Android wearable device\n* 2017 Marked debut as a public company on The [NASDAQ](https://en.wikipedia.org/wiki/NASDAQ) Stock Market under the trading symbol, BRQS.\n* 2017 Exhibited the world’s first [NB-IoT](https://en.wikipedia.org/wiki/NB-IoT) tracker based on [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)’s wear platform during [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) Global Partners Conference\n* 2018 Signed letter of intent to acquire electric vehicle control company Shanghai KADI Machinery Technology Co., Ltd\n* 2018 Signed agreement to acquire a major Chinese EMS – Shenzhen Crave Communication",
        "subreddit": "pennystocks",
        "title": "For those who missed my AYRO suggestion earlier this week - check out BRQS",
        "url": "https://www.reddit.com/r/pennystocks/comments/jx5jmg/for_those_who_missed_my_ayro_suggestion_earlier/",
        "created": 1605831219.0
    },
    {
        "author": "Rmogo21",
        "created_utc": 1604763748,
        "id": "jpsx9h",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "**TLDR:**\n\nIn one sentence a TML is an institutional quality stock in a leading industry group with superior fundamentals and technicals. These are monster stocks which over the course of weeks and months increase +100% to +5,000% . These stocks are disruptors which change how we work, live, or play.\n\nTMLs are popular with traders/investors whose methodology is based on the CANSLIM system developed by William O'Neil. He called them Model Book Stocks. Huge winners worth studying to identify common characteristics that they all share  O'Neil studied over 1000 model book stocks going back to the 1880s. Many are shown and discussed in these must read books\n\n* How To Make Money in Stocks, William O'Neil\n*  Monster Stocks: How They Set Up, Run Up, Top and Make You Money , John Boik\n* The Lifecycle Trade: How to Win at Trading IPOs and Super Growth Stocks, Eric Krull, Kathy Donnelly, and Kurt Dail \n\n**A few Historical Examples** from William O'Neil's How To Find &amp; Own America's Greatest Opportunities\n\nApple 2003  [https://imgur.com/2Egn9z5](https://imgur.com/2Egn9z5)\n\nNetflix 2009 [https://imgur.com/BHCtJpo](https://imgur.com/BHCtJpo)\n\nHome Depot 1982 [https://imgur.com/tBU3JgU](https://imgur.com/tBU3JgU)\n\nQualcomm 1997 [https://imgur.com/oYPItOW](https://imgur.com/oYPItOW)\n\nYahoo 1996 [https://imgur.com/ToOxnQJ](https://imgur.com/ToOxnQJ)\n\n**So what are the Fundamental characteristics of a TML? You want to see superior:**\n\n* Quarterly Sales Growth &gt; 25% YoY\n* Quarterly Earnings Growth &gt; 25% YoY\n* Pre+After Tax Margins &gt;20% Recent Quarters\n* ROE &gt;17%\n* Annual Earnings Ests for the next year &gt; 25%\n\nAnd above all else you want the stock to have a great story- A new and innovative product or service  that changes how we work live or play. Not every TML will have all of these criteria, but in general their record should be outstanding with regards to most of them. The higher these values the better. Earnings and Sales growth over 100% YoY is ideal. Annual Estimates for next year over 100% would be exceptional.\n\nTMLs are also often in the Top 20 Industry groups at the times of their runs. The TML is the leader of an overall top group which is riding the tailwinds of changing environments. Recent examples $SE $SHOP $AMZN Retail-Internet and $TSLA $NIO Electric Vehicles (Auto Manufacturers)\n\nAdditionally base liquidity is required for these stocks to be institutional quality. Dollar Volume &gt; $30 Million is essential and most should have DV much higher than that. Accumulation by big hedge funds and mutual funds like Fidelity Contrafund are what move the markets. They won't touch a promising stock unless it has liquidity.\n\n**Now for Technical (Price Action) Characteristics of TMLs.**\n\nThey should be:\n\n* Above a Rising 30 Week Moving Average\n* Breaking out of a Stage 1 or Stage 2 Base\n* Trending above Key Moving Averages (10, 21ema, 50sma)\n* Volume and Price contractions within bases\n* Up/Down Vol&gt; 1.2\n* Huge gaps up on volume after Earning Beat\n* And most importantly they must be showing Relative Strength, meaning they are outperforming the vast majority of stocks in the market. This. is. vital.\n\nDuring corrections and overall market weakness they should be near all time highs, above their longer term moving averages.  They should be standing out like a sore thumb and yelling \"Buy me\".  And during Market Uptrends they should be trending above the shorter term moving averages, forming sideways price shelfs during small pullbacks and then breaking out again. Most stay above their 50 SMAs and even 21 emas for extended periods of time.\n\n**So how to scan for them:**\n\nUse MarketSmith, the IBD Stock Screener, Finviz, or another screener and screen for the fundamental criteria mentioned above combined with the stock over the 200+50 SMA.  It's helpful to have multiple screens splitting up the criteria for instance one scan for the earnings and one for sales.\n\nHere is an example Finviz TML Scan: [https://imgur.com/a/CzwHdM8](https://imgur.com/a/CzwHdM8)\n\n**Recent examples to study**\n\n$LVGO 2020  \n$TSLA 2019-2020  \n$DOCU 2019-2020  \n$PTON 2020  \n$SHOP 2016-2020  \n$AMD 2018  \n$ZM 2020",
        "subreddit": "stocks",
        "title": "What is a True Market Leader (TML) + And how to find them? (Ex. SHOP 2016-2020, ZM 2020, AAPL 2005-2012",
        "url": "https://www.reddit.com/r/stocks/comments/jpsx9h/what_is_a_true_market_leader_tml_and_how_to_find/",
        "created": 1604792548.0
    },
    {
        "author": "xvietss",
        "created_utc": 1606493272,
        "id": "k23w9g",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Alright my fellow tards and degenerates.\n\nSo as the new year comes we’re moving into the 5g era and all of you know that the phone companies will make bank and 5g will basically become standard. However money won’t only be made by investing in these companies, money will also be made behind the scenes.\n\nFirst of all how are we supposed to use 5G if there are no 5G towers?? That’s where NOK and ERIC come in, these are some of the top 5G manufacturers. NOK is not a dead company, while in 2000 they were selling phones made out of adamantium or some shit, now they’re acquiring hella patents for 5G Now becoming the 2nd largest 5G manufacturer. \n\nThink of the wars, who came out on top? USA? No, the gun manufacturers came up on top, they made some fucking money selling weapons and with the era of 5G coming up do you want to be battling whether the iPhone 13 is better than the Galaxy S or do you wanna make some fucking money.\n\nWith huaweii out of the picture by being banned basically everywhere it’s gonna be up to QCOM, NOK, and ERIC to fill most of the 5G demands. All of these companies have contracts lined up for 5G such as NOK and TU.\n\nWhy this is such  a good play right now??? NOK and ERIC  have 2022/2023 dated calls for less than an ask price of .9, this play is a no fucking brainer. Especially for NOK which has an upward potential of 50% gain. The opportunity cost is so fucking low I could shit a banana worth more.\n\nSpend 80$ on a LONG dated contract and what do you have to lose vs gain. Potential for gain is a lot greater than what you have to lose.\n\nHell idc if you inverse me but there is money to be mad on these stocks either fucking way. NOK is up 5% in the past 5 days get in while calls are piss cheap.\n\nIdk about you guys but I’m here to make some fucking money, so for this new tech war on 5G where do you want to be? Do you want to be a soldier in line waiting to receive your new phone or do you want to be the mastermind that owns the WHOLE fucking fleet.\n\nTLDR: \n\nNOK 01/21/22 4c\nNOK 01/22/22 5c\nNOK 01/20/23 5c\nERIC 01/21/22 15c",
        "subreddit": "wallstreetbets",
        "title": "DD , LOW cost HIGH return 5G ERA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k23w9g/dd_low_cost_high_return_5g_era/",
        "created": 1606522072.0
    },
    {
        "author": "CultOfTheBlueWhale",
        "created_utc": 1605799463,
        "id": "jx4mlm",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "[https://en.wikipedia.org/wiki/Borqs](https://en.wikipedia.org/wiki/Borqs)\n\n&amp;#x200B;\n\nIt's a $1 stock that is a household name to most of you, yet you dont know it. Use linux? Have a Vizio TV? Use Android? Yeah,  BORQS is involved.\n\n&amp;#x200B;\n\nCompany Milestones: \n\n&amp;#x200B;\n\n* 2007-2008 Establish R&amp;D centers in Beijing, China and Bengaluru, India\n* 2007 Partnered with [Google](https://en.wikipedia.org/wiki/Google) Open Handset Alliance (OHA)\n* 2008 [China Mobile](https://en.wikipedia.org/wiki/China_Mobile), [Softbank](https://en.wikipedia.org/wiki/Softbank), [Vodafone](https://en.wikipedia.org/wiki/Vodafone) and Borqs set the formation of Joint Innovation Laboratory (JIL)\n* 2011 Established strategic partnership with [Intel](https://en.wikipedia.org/wiki/Intel)\n* 2011 Cooperated with [WAC](https://en.wikipedia.org/wiki/Wholesale_Applications_Community) to realize full compatibility with the Web Runtime 1.0 in the Google Android platform\n* 2013 Joined [Linux](https://en.wikipedia.org/wiki/Linux) Foundation\n* 2013 Established strategic partnership with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)\n* 2014 Established joint venture with [Positivo](https://en.wikipedia.org/wiki/Positivo) in Brazil\n* 2010-2014 Established Android mobile services with [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) and [SingTel](https://en.wikipedia.org/wiki/SingTel) Group\n* 2014 In cooperation with [Sonim](https://en.wikipedia.org/wiki/Sonim), Borqs delivered [AT&amp;T](https://en.wikipedia.org/wiki/AT%26T) Push-To-Talk Android phone\n* 2015 Provided Android enhancement and product realization for [Sprint](https://en.wikipedia.org/wiki/Sprint_Nextel)’s tablet\n* 2015 In cooperation with ElaCarte, Borqs developed ruggedized restaurant ordering tablets\n* 2011-2015 Developed 50+ Android devices, 10M+ commercial shipments in 15+ countries\n* 2015-2016 Supported [Vizio](https://en.wikipedia.org/wiki/Vizio) for Smart TV remote control\n* 2015-2016 Provided the In-vehicle Infotainment (IVI) s/w and solutions for [Geely](https://en.wikipedia.org/wiki/Geely)\n* 2016 Supported [Reliance](https://en.wikipedia.org/wiki/Reliance_Communications) for the world's first 4.75G phone\n* 2016 Launched [Anda](https://en.wikipedia.org/w/index.php?title=Anda_(company)&amp;action=edit&amp;redlink=1)’s [\\[2\\]](http://www.anda.pe/) Symbol-based Communication Wearable for Children at [COMPUTEX](https://en.wikipedia.org/wiki/COMPUTEX) 2016\n* 2016 Partnered with [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm) in developing the world’s first 4G Android wearable device\n* 2017 Marked debut as a public company on The [NASDAQ](https://en.wikipedia.org/wiki/NASDAQ) Stock Market under the trading symbol, BRQS.\n* 2017 Exhibited the world’s first [NB-IoT](https://en.wikipedia.org/wiki/NB-IoT) tracker based on [Qualcomm](https://en.wikipedia.org/wiki/Qualcomm)’s wear platform during [China Mobile](https://en.wikipedia.org/wiki/China_Mobile) Global Partners Conference\n* 2018 Signed letter of intent to acquire electric vehicle control company Shanghai KADI Machinery Technology Co., Ltd\n* 2018 Signed agreement to acquire a major Chinese EMS – Shenzhen Crave Communication",
        "subreddit": "wallstreetbets",
        "title": "For those of you who missed my last play (AYRO) - I present to you BORQS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jx4mlm/for_those_of_you_who_missed_my_last_play_ayro_i/",
        "created": 1605828263.0
    },
    {
        "author": "yunoclickme",
        "created_utc": 1606490335,
        "id": "k22z5d",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Remember BlackBerry, the phone with the cool keyboard that went out of fashion? Well they haven't made phones in years.\n\nBB is a **cybersecurity &amp; software company** with the wrong name!\n\nThink embedded systems, data privacy, safety, endpoint security management, encryption, IoT, AI, zero trust architecture and so on. And think EV and AV (autonomous vehicles), too, where they have had a significant presence and continue to grow.\n\nLet me paint the picture for you with some recent headlines:\n\n* [BlackBerry Achieves NSA Approval for BlackBerry UEM](https://finance.yahoo.com/news/blackberry-achieves-nsa-approval-blackberry-130000862.html) (11/18/20)\n* [Plus Chooses BlackBerry to Power Its Class 8 Truck Automated Driving System First Self-Driving Truck Developer to Leverage Safety-Certified BlackBerry QNX Operating System](https://finance.yahoo.com/news/plus-chooses-blackberry-power-class-130000001.html) (11/17/20)\n* [BlackBerry AtHoc Integrates with Microsoft Teams for Critical Event Management](https://finance.yahoo.com/news/blackberry-athoc-integrates-microsoft-teams-123000549.html) (10/7/20)\n* [BlackBerry AtHoc and ServiceNow Partner to Deliver Secure and Reliable Incident Response Management](https://finance.yahoo.com/news/blackberry-athoc-servicenow-partner-deliver-120000305.html) (10/8/20)\n* [BlackBerry Unveils Industry's First Unified Endpoint Security (UES) Solution for AI-powered Cybersecurity](https://finance.yahoo.com/news/blackberry-unveils-industrys-first-unified-120000258.html) (10/6/20)\n* [The United States Air Force Chooses BlackBerry Spark for Secure Productivity](https://finance.yahoo.com/news/united-states-air-force-chooses-120000017.html) (9/22/20)\n\nDoes this sounds like a phone manufacturer? Heck no!\n\nAnd talk about being in the sweet spot. BlackBerry's flagship software, QNX, is embedded in more than 175 million cars, making it a foundational software platform for connected and autonomous vehicles. Just look at some of these names that BB can count as customers in the automotive space:\n\n* Audi\n* BMW\n* Mercedes-Benz\n* Toyota\n* ARCFOX\n* Xpeng\n* Desay\n* Canoo (yes, the EV maker merging into HCAC)\n* Plus Self-Driving Trucks\n* Arrival (yes, the EV company merging into CIIC)\n* Jaguar Land Rover\n* Damon Motorcycles\n* Elektrobit\n* Karma Automotive\n* Tata\n\nAnd on and on...\n\nQNX is amazing, but there's more (and zero phones!)\n\n**List of better known products**\n\n*QNX*\nA real-time embedded operating system, QNX drives multiple software systems in modern auto vehicles, and forms the basis of solutions like BlackBerry Radar, an IoT-based asset tracking system for the transportation industry. \n\n*Spark Suites*\nSpark offers visibility and protection across all endpoints, including personal laptops and smartphones used for work. It leverages AI, machine learning and automation to provide improved cyber threat prevention. \n\n*AtHoc*\nAn emergency communication system, AtHoc provides two-way messaging and notifications across a range of devices and platforms.\n\n*Unified Endpoint Manager (UEM)*\nAn enterprise mobility management platform that provides provisional and access control over smartphones, tablets, laptops, and desktops with support for all major platforms including iOS, Android (including Android for Work and Samsung KNOX), BlackBerry 10, Windows 10, and Mac OS.\n\n*SecuSUITE*\nAn anti-eavesdropping solution that provides voice, data, and SMS encryption.\n\nWant to see more? Check out all products here: [https://www.blackberry.com/us/en/products/all-products](https://www.blackberry.com/us/en/products/all-products)\n\n**Patents, patents and more patents!**\n\nBB has 38K+ patents! They have been actively protecting them when they've been infringed upon.\n\nFor example, in 2017, BB was awarded a staggering $940,000,000 in overpayments of royalty payments against Qualcomm.\n\nAnd for FB haters (count me in!) BB sued Facebook (along with WhatsApp and Instagram) in 2018, alleging that many critical features of the Facebook messaging service infringe on Blackberry patents. In the past two weeks Facebook LOST their challenge to the mobile messaging patent lawsuit in a final decision, paving the way toward a settlement for 'rent due' for use. Time to pay up, Zuck!!\n\n**Recent refinancing &amp; the Importance of $6**\n\nIn late summer this year Blackberry entered into a convertible financing with a pre-existing large shareholder for $365MM. The Debentures are convertible at $6 and would effectively bring this shareholder's exposure on a fully converted basis to just under 20% ownership.\n\nThe shareholder would then be fully aligned with minority shareholders, thus causing support at the $6 level going forward.\n\n**Stock &amp; Valuation**\n\n* Stock closed at $5.91 on Wednesday (a six month high)\n* The stock is trading 14% below its 52 week high of $6.89\n* It's trading above its 50 and 200 DMA\n\nMarket cap: $3.21B\nRevenue: $1.01B\nPrice/Sales: 3.3x\n\nFloat: 502MM\nShares short: 30MM (11/13/20)\n\nThe best known publicly traded competitor in the connected &amp; autonomous vehicle software space is Cerence.\n\nCRNC (Cerence)\n* Market cap: $3.24B\n* Revenue: $329MM\n* Price/Sales: 9.58x\n\nThe best known publicly traded competitors in cybersecurity are:\n\nCRWD (Crowdstrike)\n* Market cap: $31.98B\n* Revenue: $654MM\n* Price/Sales: 40.43x\n\nFTNT (Fortinet)\n* Market cap: $19.17B\n* Revenue: $2.46B\n* Price/Sales: 8.18x\n\nPANW (Palo Alto Networks)\n* Market cap: $28.19B\n* Revenue: $3.58B\n* Price/Sales: 7.98x\n\nFEYE (FireEye)\n* Market cap: $3.24B\n* Revenue: $928MM\n* Price/Sales: 3.37x\n\nTaking out the richly valued CRWD and weakly valued FEYE leaves a combination of CRNC, FTNT and PANW to measure where BB stacks up. The average P/S of those three is 8.58x, whereas BB's P/S is 3.3x. This means that BB's P/S should float up to their level just to be in line with peers.\n\nThat would bring the stock price to just over $15, all else equal.\n\nWe are at the critical $6 level today.\n\n** Positions ** \n\n200 $10 1/22 calls!",
        "subreddit": "wallstreetbets",
        "title": "BB - A Cybersecurity Company (Not Phones!)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k22z5d/bb_a_cybersecurity_company_not_phones/",
        "created": 1606519135.0
    },
    {
        "author": "leobanksjr",
        "created_utc": 1604282958,
        "id": "jmf0vq",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Given the increasing lock-downs &amp; presidential elections ***most stocks this week will \"play by ear\"  day trades rather than forward projections.*** Nonetheless companies that had good earnings and forward guidance are bound to recover quickly to levels they were at before the election mania kicked into high gear.  \n\nAny of the companies of prior mention in my past DDs are good candidates \n\n* Stocks that are still breaking out\n   * [NIO](https://www.tradingview.com/x/P36CafFo/)\n* Stocks that are consolidating \n   * [NFLX](https://www.tradingview.com/x/gDbu0lWd/), [TWLO](https://www.tradingview.com/x/TJ1WpOND/), [ETSY](https://www.tradingview.com/x/MtEOY6tQ/), [TWTR](https://www.tradingview.com/x/z5YMkSFZ/)\n* Stocks beginning reversal as of Sunday preview\n   * [NTAP](https://www.tradingview.com/x/tye6aaZM/)\n   * [QCOM](https://www.tradingview.com/x/yw6W3Jrc/)\n\nNot mention plenty of stocks that are on decline, but I like to focus on [SNAP](https://www.tradingview.com/x/oGX3nCJk/) &amp; [PINS](https://www.tradingview.com/x/F4An7U2t/)\n\n**Tools in use**: Bollinger Bands, MACD, RSI, Stochastic ([Please look at my main post to learn how I utilize them](https://www.reddit.com/r/wallstreetbets/comments/jkjw5o/background_methodology_to_my_swing_trades/)) \n\n**Time Frame**\\- 30 mins, any further is pointless for *day trading*\n\nHow to go about these frequent changes this week would as always depend on both risk tolerance &amp; account size.\n\n* 25k plus individuals or CFD user will like always have life easy\n* Non PDT Margin accounts could take advantage of the increased IV obtain some vertical credit spreads and let next week IV decline make you ton of back while the stocks recover.\n* Cash accounts, **specifically sub 5k**  should wait til later in the week when hopefully a determination has been made and IV falloff before getting an end of NOV or DEC contract. Otherwise incremental trades so you do not use up all your settled funds for the day.\n\n*Will begin to the use the* ***TradingView Ideas*** *format for future DDs, they will still be posted here though so no worries, unless MODs come with hammer, then worry!*\n\n[Otherwise if you want try your luck day trading you can find me in the discord for live updates.](https://discord.gg/NjcUSQ5dR6)",
        "subreddit": "wallstreetbets",
        "title": "No solid foundations this week, stay flexible",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmf0vq/no_solid_foundations_this_week_stay_flexible/",
        "created": 1604311758.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1606431408,
        "id": "k1pbij",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "**In this post I am going to share my experience as I start a new portfolio from 0$ and keep adding funds to it every month as I try to grow it as fast as possible**\n\nHey everyone Happy Thanksgiving and Welcome! So, I have deposited and invested in the stock market all the money I managed to save up in the last month as I deposited 3500$ in my eToro portfolio on the 12th of November and I am already up more than 7% in just two weeks. \n\nAs my portfolio has constantly outperform the big 3 indexes the Nasdaq100, the SP500 and the Dow Jones 30 almost every day since starting my portfolio. Here is a comparison of my portfolio vs the indexes since starting as I am up over 7%. [Portfolio v Index](https://ibb.co/pRnQLQf)\n\nSo i wondered? Is it really bad to own more stocks? Is less &gt; more? What is your opinion on this subject? I believe that it is way better to be invested in more companies and to add and grow your position in time as you also see how the companies evolve and you can also do some price averaging.\n\nSo here is my current portfolio composition as I split all my money equally to start, I will go into very few little details about everyone so I don’t make this a 2 hour read time.\n\nI will start now by going alphabetically and not in the most important order as the first company that I own is BYD which is a rival company for both Tesla and NIO in the EV market as they focus on cars, new energy solutions and electronics. They are also developing a lot of commercial EV like buses, coaches and taxis which will be a great addressable market for them as they are not rivaled in those segments at the moment. The company has gone up a lot in value this year as you can see in this graph and have a Forward P/E of more than 100 but I believe this company will greatly expand its sales and be one of the leaders in the segment especially in China which is the biggest EV market. [https://ibb.co/gVVwpfR](https://ibb.co/gVVwpfR) / [https://ibb.co/z7YBGr9](https://ibb.co/z7YBGr9)\n\nThe second holding is Apple, is there anybody that doesn’t know this company? They are the biggest company in the world and they continue to expand with new products and services every day, I don’t see this company going down in the short term or the long term as they have pretty expensive at a 35 P/E but earnings are still rising especially with more subscription based income coming in with the release of the Apple One Bundle. [https://ibb.co/Tm3hWMZ](https://ibb.co/Tm3hWMZ) / [https://ibb.co/Q9YjJTx](https://ibb.co/Q9YjJTx) / [https://ibb.co/BrzkHCY](https://ibb.co/BrzkHCY)\n\nAbbVie is a health company that produces a lot of great drugs and has more than 26 million patients in over 200 countries that are treated every year. They are one of the best companies in the sector and are still down about 25% from the all time highs while only trading at a forward P/E of 8 which is very low. [https://ibb.co/9nn4z0q](https://ibb.co/9nn4z0q) / [https://ibb.co/mXh3JL5](https://ibb.co/mXh3JL5) / [https://ibb.co/cwhJgB5](https://ibb.co/cwhJgB5)\n\nAMD is a well established companies that creates high performance GPU’s for both personal computer and for data centers, the company has turned around and have started a great path to success since the newest CEO took the job in 2014 as the stock was trading at 2$ and while the company is trading at a very high forward P/E they have a lot of room to grow in this new economy as the EPS is expected to increase by more than 40% quarter over quarter [https://ibb.co/dpwYPcy](https://ibb.co/dpwYPcy) / [https://ibb.co/7vwWHtC](https://ibb.co/7vwWHtC) / [https://ibb.co/yF0RmQv](https://ibb.co/yF0RmQv)\n\nAmazon is the internet retail juggernaut and cloud servicing company that has also started to expand in more and more domains like pharmacy just last week, though the company is also trading at a very high PE they have a lot of room to grow internationally and also are expanding in a lot more domains at a very fast rate. [https://ibb.co/4TnGhkt](https://ibb.co/4TnGhkt) / [https://ibb.co/c6W2Ypx](https://ibb.co/c6W2Ypx)\n\nAphria is a Canadian company that mainly grows cannabis for medical use but has recently acquired a beverage company and is look to expand its product line, especially with the legalizing of marijuana more and more obvious in the US. They are one of the companies that stands to benefit the most from this as they are also expected to be the first to reach profitability by next year compared to Aurrora Canabis and Cannopy Growth. [https://ibb.co/KrfL267](https://ibb.co/KrfL267) / [https://ibb.co/kJ8yxDR](https://ibb.co/kJ8yxDR)\n\nBroadcom is one of the biggest American semiconductor solutions provider, they are a very good play for the sector as they only trade at a forwarde P/E of 17 which is very good compared to comptetitors. [https://ibb.co/8KFmX88](https://ibb.co/8KFmX88) / [https://ibb.co/q18SzPb](https://ibb.co/q18SzPb)\n\nEveryone also knows Boeing as they are one of the biggest commercial manufacturers of jetliners, defence, space and security systems. The have suffered a lot in the last 2 years after the 737 accidents and the recent stay-at-home economy, but the ban on the plain has been lifted in the US and will be followed by the European Union soon, they have a big backlog of planes to work through while this situation will improve and air travel returns slowly in the next years. [https://ibb.co/JxZYZ6D](https://ibb.co/JxZYZ6D) / [https://ibb.co/NVbhDLQ](https://ibb.co/NVbhDLQ)\n\nAlibaba is a online e-commerce giant that has expanded into cloud computing services also and stands to benefit a lot from the stay-at-home economy while also having just a forward PE of 32 which is very low compared to Amazon as they are the Chinese version of them. The company also owns Ant Group which is one of the largest fin tech companies in the world and will likely gain a lot after they finally manage to go public. [https://ibb.co/0JPN6DN](https://ibb.co/0JPN6DN) / [https://ibb.co/6NgjGNV](https://ibb.co/6NgjGNV) / \n\nBerkshire is the child company of Warren Buffet as they are a holding company that engages in diversified business like technology, banks, insurance and much more. The company is currently trading at a very low P/E an barely above the price/book value as even the founders of the company believe this as they have continued to buy back shares of the company in the last year at the fastest rate in company history. [https://ibb.co/bP6VjpM](https://ibb.co/bP6VjpM) / [https://ibb.co/hf5hX39](https://ibb.co/hf5hX39)\n\nCaterpillar is one of best companies in manufacturing, construction and mining equipment. They are trading at almost 3 time sales with a high P/E but this is likely to regain momentum with the China trade war relaxing with the new Biden administration as well as the reopening of the economy [https://ibb.co/pnC17PM](https://ibb.co/pnC17PM) / [https://ibb.co/2vsQSjt](https://ibb.co/2vsQSjt)\n\nChipotle Mexican is one of the best companies right now in the fast food business as they continue to innovate and have just opened they’re first digital only store. The company is trading at a very high P/E but has substantial growth potential so I believe it will be a great buy for the future. [https://ibb.co/GCqd3Y9](https://ibb.co/GCqd3Y9) / [https://ibb.co/JnBm3bx](https://ibb.co/JnBm3bx)\n\nCostco is one of the world biggest retailers that has a great business model as they are making most of they’re money through membership fees unlike other retailers that mostly rely on prices, the are trading at just 1 times sales which is very good and they have a lot of room to grow especially with improve China relationships. [https://ibb.co/X4M76Vd](https://ibb.co/X4M76Vd) / [https://ibb.co/ypg3Gyc](https://ibb.co/ypg3Gyc)\n\nCrowdstrike is a cyber security company that has seen a huge spike due to the transition to more and more digital presence for all the companies. They are a company that I believe is here to stay and just started to become profitable in the last quarter. [https://ibb.co/zNbfhL9](https://ibb.co/zNbfhL9) / [https://ibb.co/mBw2TKj](https://ibb.co/mBw2TKj)\n\nCarvana is one of the best players for the second hand car market as they operate a unique e-commerce platform for people to buy, sell or finance cars. They are one of my favorite companies as they are also just starting to make money as they continue to expand they’re presence. [https://ibb.co/QPZ1wnt](https://ibb.co/QPZ1wnt) /  [https://ibb.co/0rS6LrQ](https://ibb.co/0rS6LrQ)\n\nCVS is a health and pharmacy companies that owns the most pharma stores in the US, the company has been hit recently by the news that Amazon is getting into pharmacy delivery but I believe they will be a great play for the vaccine distribution play as the company is only trading at a forward P/E of 8 and is trading below value of sales while also offering a dividend of 2% [https://ibb.co/KNH6v5G](https://ibb.co/KNH6v5G) / [https://ibb.co/8Ps3QRB](https://ibb.co/8Ps3QRB)\n\nDelta is one of the major airlines in the US and as I wanted to be exposed to some recovery plays I choose this company as I believe air travel will come back in the next years. The financials are not great for the company but they did manage to cut the cash burn rate in the last quarter. [https://ibb.co/gyrSYYb](https://ibb.co/gyrSYYb) / [https://ibb.co/KsNbFHg](https://ibb.co/KsNbFHg)\n\nDeere is another great industrial and manufacturing play for the recovery stocks. The company is trading at a pretty high P/E ratio for them as the stock has runed very high in the last months but they do offer a dividend of 1% which is much better than any bank savings account and also have the potential for growth and also are a pretty reliable way to diversify portfolios. [https://ibb.co/NSsCGN1](https://ibb.co/NSsCGN1) / [https://ibb.co/thrY6W2](https://ibb.co/thrY6W2)\n\nDisney is a very diversified family friend entertainment and media company as they have a lot of great business that will benefit a lot from the re-opening while this contributed a lot to the huge expansion of the streaming business with Disney+ and Hulu so the financials are not great but I believe this will hugely improve in the next couple of years. [https://ibb.co/BG0jctn](https://ibb.co/BG0jctn) / [https://ibb.co/7GR9h3c](https://ibb.co/7GR9h3c)\n\nDraftkings is an American daily fantasy sport operator that has expanded into the huge market of online gambling as more and more us states are legalizing gambling so they have a lot of room to grow in front of them especially with a great online presence with financials not being very important at the moment as they continue to grow they’re presence [https://ibb.co/k8dtJmM](https://ibb.co/k8dtJmM) / [https://ibb.co/HgGQvG2](https://ibb.co/HgGQvG2) \n\nDominos Pizza is one of the biggest pizza companies in the world and are also one of the best in implementing they’re presence in the delivery services as they are way better at this than others companies like Papa John’s. [https://ibb.co/NZXkQjg](https://ibb.co/NZXkQjg) / [https://ibb.co/FVGXXBY](https://ibb.co/FVGXXBY)\n\nEtsy is a e-commerce platform for creative goods and services and has seen a huge rise in popularity and will probably remain a big gainer from this past year, though they are trading at over 70times earnings this will likely improve very much in the next years as they are expected to expand and improve earnings substantaly. [https://ibb.co/5MN9zb7](https://ibb.co/5MN9zb7) / [https://ibb.co/PYz0NWK](https://ibb.co/PYz0NWK)\n\nFord is one of the biggest car makers in the world, I really like this company as it having a big push to move to the EV world with the Mustang Mach E, the EV Transit and the hugely anticipated EV F-150, the company is expected to have huge improvements in the next year as they have decent financials and are one of the best companies to own for a dividend investing strategy. [https://ibb.co/MhwMB47](https://ibb.co/MhwMB47) / [https://ibb.co/745w8vq](https://ibb.co/745w8vq)\n\nFacebook is the largest social media network in the world that also owns Instagram, they have been struggling in the last months due to the political environment but I believe they will continue to be a giant in the tech sector as they are finding new ways to improve revenue streams especially in the highly active Instagram platform as they are trading at pretty much the same P/E like the other big tech companies but are expected to see a growth in advertising money as companies move to a more digital presence. [https://ibb.co/SVjFGvc](https://ibb.co/SVjFGvc) / [https://ibb.co/T1Ds8V8](https://ibb.co/T1Ds8V8)\n\nFiverr is one of the biggest marketplaces for freelance services as this kind of gigs have hugely exploded this year, the company is trading at an insane PE but we have to see what the next quarters brings to us as it may end up being a very profitable company in the future. [https://ibb.co/st03fyj](https://ibb.co/st03fyj) / [https://ibb.co/zQk3Mgp](https://ibb.co/zQk3Mgp)\n\nGeneral Elecitrc is a conglomerate that operates in many business like aviation, healthcare, renewables, digital industry finance and more, they have suffered a lot in the past decade but the CEO has managed to turn things around latetly and might put the company back on track as it is way below all time highs and even recent highs of 30$ just 4 years ago, they might get a boost from the return of the aviation business in the next years. [https://ibb.co/2nTc9mh](https://ibb.co/2nTc9mh) / [https://ibb.co/sybXXPQ](https://ibb.co/sybXXPQ)\n\nGeneral Motors is the other big Detroit giant that I own in my portfolio as I really like where the company is going with its big push in the EV market in the next couple of years, they are trading at a 19 PE and are in a very good position to keep growing. [https://ibb.co/37hqV2C](https://ibb.co/37hqV2C) / [https://ibb.co/BNp0hht](https://ibb.co/BNp0hht)\n\nBarrick Gold is one of the biggest gold and copper mining companies in the world and I use it for some hedging as I like owning this company more than I like owning gold, as this company also provides us with dividends of more than 1% while gold doesn’t [https://ibb.co/P9cVDxs](https://ibb.co/P9cVDxs) / [https://ibb.co/6tpfDtH](https://ibb.co/6tpfDtH)\n\nI don’t believe google needs any introductions as I believe they are still one of the best companies in the tech sector despite lagging the other faang companies this year but they have regained momentum in the last quarter and I believe they can be a catch up trade and a long-term investment [https://ibb.co/JRm07vw](https://ibb.co/JRm07vw) / [https://ibb.co/mT7nWC8](https://ibb.co/mT7nWC8)\n\nGoldman Sachs is a global investment bank that seems to be back on track after the company has struggled in the last couple of years and are also a great diversification play as they are trading below book value. [https://ibb.co/FqmNyFF](https://ibb.co/FqmNyFF) / [https://ibb.co/1zkLmfx](https://ibb.co/1zkLmfx)\n\nHome depot is a big retailer that has gained a lot of traction in the last year and stands to benefit in the future from the great move to online sales. The company is trading at a 25 PE but seems to be on a huge growth bath while also having a more than 2% dividend yield. [https://ibb.co/KXpDM77](https://ibb.co/KXpDM77) / [https://ibb.co/cDBxJgK](https://ibb.co/cDBxJgK)\n\nHoneywell is one of the most diversified technology and manufacturing companies in the world that stands to benefit a lot from the reopening as a lot of companies need to upgrade they’re technology systems. The company has a good dividend yield and a great profit margin. [https://ibb.co/kMxjNRz](https://ibb.co/kMxjNRz) / [https://ibb.co/TL67SRD](https://ibb.co/TL67SRD)\n\nIntuitive surgical is a global technology company for minimally invasive surgery. As this kinds of surgeries have been postponed they stand to benefit from the world getting back to normal. They have huge profit margins that can see they earnings soar in the next years. [https://ibb.co/Lz7j8td](https://ibb.co/Lz7j8td) / [https://ibb.co/kXdmzhQ](https://ibb.co/kXdmzhQ)\n\nJohnson &amp; Johnson is a great company that develops medical devices, meds and consumer goods and stat to benefit a lot if they manage to create e good vaccine. They are currently trading at a PE of 22 but have huge upside and also are a great dividend paying company. [https://ibb.co/FWXqpH2](https://ibb.co/FWXqpH2) / [https://ibb.co/c8qQXNF](https://ibb.co/c8qQXNF)\n\nJP Morgan is a global financial giant with over 3 trillion$ in assests, the company trades at about a 33% price to book overvaluation but stands to benefit a lot in the future from the huge money pumping in the economy by the FED and the return of higher interest rates. [https://ibb.co/hBvLxV5](https://ibb.co/hBvLxV5) / [https://ibb.co/Jtkn90L](https://ibb.co/Jtkn90L)\n\nCoca-Cola is another company that needs no introduction and is still a great company to own with a great dividend yield that stands to benefit from a reopening economy. [https://ibb.co/G9CmsgL](https://ibb.co/G9CmsgL) / [https://ibb.co/C2FLSGy](https://ibb.co/C2FLSGy)\n\nLemonade is a disruptive insurance company that is still expanding its markets. They have a great business strategy and can become a very big player in the industry. The company has more than double since the IPO earlier this year so I believe this can be a great long term investment. [https://ibb.co/zhjYRct](https://ibb.co/zhjYRct) / [https://ibb.co/PZ23M72](https://ibb.co/PZ23M72)\n\nLowe’s is another great retailers similar to Home Depot that has done a great job in transitioning to online sales. I really like the company as it trades at just 20 times earnings and has a great growth rate and dividend yield. [https://ibb.co/zfpyLZC](https://ibb.co/zfpyLZC) / [https://ibb.co/MfS6QNg](https://ibb.co/MfS6QNg)\n\nMcDonalds is the biggest fast food company in the world, the company has done a terrific job this year with drive thru orders and stand to benefit even more after the reopening while also having a great dividend of more than 2% and possibility of growing delivery sales even more in the future. [https://ibb.co/CBTWtJP](https://ibb.co/CBTWtJP) / [https://ibb.co/v1cBqQn](https://ibb.co/v1cBqQn)\n\nMercadolibre is a e-commerce company that is the Amazon or Alibaba of South America as they operate in a lot of sectors like cars, aircrafts, real estate and more. I believe this is a great company to own if you believe in the future of e-commerce. [https://ibb.co/McFrBhZ](https://ibb.co/McFrBhZ) / [https://ibb.co/Cw3wSSk](https://ibb.co/Cw3wSSk)\n\nIsn’t it already obvious that my portfolio must have included Microsoft also? As they are a big beneficiary of cloud services and tech evolutions. This is a staple for every portfolio with great growth and a better dividend yield than any bank can offer at the moment. [https://ibb.co/cvMm8Md](https://ibb.co/cvMm8Md) / [https://ibb.co/FnYD1Y3](https://ibb.co/FnYD1Y3)\n\nAs I want to be diversified and exposed to recovery play I also picked the cruise line that I think will do best in the long run. So though Norwegian have diluted they’re shares a lot during this year, I belive not all cruise lines will survive and they will eat up market share when everything goes back to normal. So I don’t really care about the financials that much at the moment as this is a very long term pick. [https://ibb.co/tHDcrMY](https://ibb.co/tHDcrMY) / [https://ibb.co/PTqK0dj](https://ibb.co/PTqK0dj)\n\nNext Era Energy is the largest electric utility by market cap and has the world largest generator of renewable energy from wind and sun and stand to benefit a lot from a Biden administration that is why they are trading at such high multiples at the moment. The company also has an impressive yield of almost 2% [https://ibb.co/xjYVMx4](https://ibb.co/xjYVMx4) / [https://ibb.co/q9hjp48](https://ibb.co/q9hjp48)\n\nI also bought NetFlix as I believe them, Disney and Roku will be some of the largest players in the streaming business as traditional TV and cinema are a dying business at the moment.The company is trading at a premium but this is due to them dumping money in high quality content to grow they’re subscriber base while they also have steadily increase subscriptions cost in the last years. I believe they will do better next quarter and will see a re-test of all time highs. [https://ibb.co/VN2TF6f](https://ibb.co/VN2TF6f) / [https://ibb.co/B6j9zTn](https://ibb.co/B6j9zTn)\n\nI also own NIO more as a spec play to be well diversified in the EV world, I believe this is a long term investment as the stock price has gone up like bananas recently, the company will have to have perfect growth in the next couple of years to justify an increase in value as they are still losing money. [https://ibb.co/MZ2NL4v](https://ibb.co/MZ2NL4v) / [https://ibb.co/mt8f3ZR](https://ibb.co/mt8f3ZR)\n\nNike is my favorite apparel play as I believe it is the most desired my a lot of people and keeps expanding. I really like how the company is managed and I believe in them for the long-run. [https://ibb.co/jw1zjgj](https://ibb.co/jw1zjgj) / [https://ibb.co/RYR4QSP](https://ibb.co/RYR4QSP)\n\nNvidia is my favorite play in the semiconductor sector as they will continue to benefit from more and more personal pc sales as well as huge data center demand especially for they’re super performing products. They trade at a huge premium right now but I believe they can become the next trillion dollar company in the tech sector. [https://ibb.co/kgJS0w1](https://ibb.co/kgJS0w1) / [https://ibb.co/k8D1MSL](https://ibb.co/k8D1MSL)\n\nI also like owning Pepsico alongside Coca Cola as they are the two biggest players in the sector and I believe that they will both benefit a lot in the next years from the economy recovery. With pepsico offering a 2,7% dividend and a great growth path I really like owning this stock [https://ibb.co/2SY4xPY](https://ibb.co/2SY4xPY) / [https://ibb.co/Sdt2hGC](https://ibb.co/Sdt2hGC)\n\nPinterest is an up and coming social media platform that has a great ad friendly setup and could see growth in the next years. They are trading at insane PE ratios but that should catch up to the company in the future and I believe you must own it to be well diversified. [https://ibb.co/gwGFbyb](https://ibb.co/gwGFbyb) / [https://ibb.co/5TYz4KS](https://ibb.co/5TYz4KS)\n\nPalantir is a highly controversial name right now but its products and services are really good as they are earning more and more stamps of approval with government contracts while also expanding to commercial use. Financial info is not that good as the company barely reported they’re first earnings after the IPO. [https://ibb.co/fdQ42gc](https://ibb.co/fdQ42gc) / [https://ibb.co/wyTJSG2](https://ibb.co/wyTJSG2)\n\nPayPal is another great company that will do very well in the future as payments transition to a more digital approach and the company is transitioning to allow cryptocurrencies as well which will attract even more users. They have had a greet increase in revenue and eps in the last quarters and I expect that to continue to grow. [https://ibb.co/9tXxhJZ](https://ibb.co/9tXxhJZ) / [https://ibb.co/M5vCynn](https://ibb.co/M5vCynn)\n\nQualcomm is my favorite 5G play alongside apple as this will be a long cycle of upgrades for the communications services that will benefit them a lot.They are trading at an PE of over 30 but have great revenue and EPS growth while also offering an almost 2% dividend yield. [https://ibb.co/NFsnKqW](https://ibb.co/NFsnKqW) / [https://ibb.co/x5sJLW6](https://ibb.co/x5sJLW6)\n\nRoku is a great play for the hardware and subscription based services for digital media players and has huge tailwinds that will benefit them while the old TV cycle is dying. They have had a huge year over year revenue growth and subscribers growth that has passed the 40 million mark for the first time recently. [https://ibb.co/Fqd7sYP](https://ibb.co/Fqd7sYP) / [https://ibb.co/ccKqzkC](https://ibb.co/ccKqzkC)\n\nWhile SunRun is another great play for the new Biden administration as well as the transitioning to more renewable energy as they may see a huge boost in revenue growth and earnings with more money being pumped into the renewable sector. [https://ibb.co/0jr3TRg](https://ibb.co/0jr3TRg) / [https://ibb.co/NmdSdwP](https://ibb.co/NmdSdwP)\n\nEveryone also knows Starbucks, as I expect them to be a huge gainer on a improved US-China relationship so despite suffering a lot from this economy the stock is still up more than 16% in the last year while revenues have declined, expect this to bounce back by 2021-2022. [https://ibb.co/s5nTzQX](https://ibb.co/s5nTzQX) / [https://ibb.co/fDyhvX3](https://ibb.co/fDyhvX3)\n\nShopify is a multinational e-commerce cloud based platform for merchants like small and medium sized business so that can easily have an online store that they can manage payments for, orders inventory and much more. The company is trading at P/E’s that are crazy but the revenue and EPS growth is also amazing and has the potential for a lot more growth as the world is going more and more digital. [https://ibb.co/6nt4GhC](https://ibb.co/6nt4GhC) / [https://ibb.co/QbFhybt](https://ibb.co/QbFhybt)\n\nStore capital is a real estate investment trust that focuses on single tenant commercial real estate so they can negotiate much better rents and collections than other REIT. They are still more than 8$ under the highs and are a great diversification and yield giving stock to own. [https://ibb.co/XzBY41g](https://ibb.co/XzBY41g) / [https://ibb.co/TrGRZpR](https://ibb.co/TrGRZpR)\n\nAT&amp;T is one of the largest providers in the us and seems to be getting back on track after they have struggled in the past decade, they trade at only 8 times forward P/E and have one of the best dividend yields at more than 7% so I believe this is a must have staple in your portfolio that brings stability and cash flow. [https://ibb.co/cYcfYMm](https://ibb.co/cYcfYMm) / [https://ibb.co/8D3NzZr](https://ibb.co/8D3NzZr)\n\nWhile Target has been doing some amazing things as they operate as a general merchandise retailers and are doing some amazing things with online sales, they currently have seen a spike in the last months and are trading at a p/e of over 22 but I see them as a long term winner that offers both growth and value with a dividend yield of 1,5%. [https://ibb.co/Fzd8TMw](https://ibb.co/Fzd8TMw) / [https://ibb.co/NLnw4Lv](https://ibb.co/NLnw4Lv)\n\nWhile the other communication provider that I like is T-Mobile US which has seen a huge spike in user growth and are poised to do a lot of great things with the 5G cycle, they trade at a very high multiple for this sector but the growth expectations are huge for this company. [https://ibb.co/PCDFD38](https://ibb.co/PCDFD38) / [https://ibb.co/BTSzTMp](https://ibb.co/BTSzTMp)\n\nMoving on, one of the biggest gainers this year, TESLA is also one of my favorite companies to own as they continue to expand the products they offer and improve margins on vehicle, they are also expanding into more and more services, while manufacturing is growing exponentialy. They trade at insane P/E’s but they have just managed to be included in the SP500 so this may bring some stability to the stock as the company continues to grow in the next decade.[https://ibb.co/6rNJf6q](https://ibb.co/6rNJf6q) / [https://ibb.co/CWN6wD4](https://ibb.co/CWN6wD4)\n\nVisa is the biggest global payments technology company and is expected to continue to grow as more people start using cashless payment options, they are a great growth and value company for the future as cash payments is a dying proposition worldwide. [https://ibb.co/CVXgZD9](https://ibb.co/CVXgZD9) / [https://ibb.co/BPKxFfZ](https://ibb.co/BPKxFfZ)\n\nWal-Mart, the biggest employer in the US continues to do amazing stuff as they continue to expand they’re online presence and compete with Amazon as they trade at a 23 P/E and also offer a dividend yield. they are a great play alongside with Amazon which trades at much higher valuations. [https://ibb.co/Sr9s83J](https://ibb.co/Sr9s83J) / [https://ibb.co/0CvZKkD](https://ibb.co/0CvZKkD)\n\nWynn is another great recovery stock that I like as recently we found out that foot traffic in Macau has ramped up, this bolds well for the company as they will be one of the biggest gainers on the reopening. So if you are a long term investor you should get into this stock I believe. [https://ibb.co/6rk2qNQ](https://ibb.co/6rk2qNQ) / [https://ibb.co/mC35VPr](https://ibb.co/mC35VPr)\n\nZoom is the one company that I will be selling in the next couple of days. I know they are one of the best video conferencing apps out there, but I believe they will have a lot of problem due to a number of free apps that also offer great quality while the company is trading at insane p/e numbers. I know this trend is here to stay, but I thing there are far better play in the stock market out there rather than Zoom at this price point.  [https://ibb.co/T1tStb8](https://ibb.co/T1tStb8) / [https://ibb.co/rmxh0x3](https://ibb.co/rmxh0x3)\n\nI know I didn’t get into in-depth stuff, technical analysis, fundamentals and more but I will continue go more in depth with this stocks as time goes on. \n\nSo here how I want to make my portfolio look like when I have enough money to open all the positions. [TARGETED PORTFOLIo](https://ibb.co/CHWsb27)\n\nAs you can see a quarter of my portfolio will be invested in high quality companies that are pretty safe in my opinion. While over 45% of the portfolio will go to companies that I really like, that have a pretty low risk in my opinion and can offer great returns in the future. While I will also use about 22% of my portfolio into more risky companies that can bring very good profits for the portfolio but in my opinion are not as safe as the others. \n\nAnd finally I will invest about 7% of my portfolio into more speculative stocks or hedge stocks like Barrick Gold and Goldman Sachs. I don’t want to keep money on the sidelines at the moment as I expect the stock market will keep rising for a couple of years at a rapid pace due to the recovery of the economy.\n\nThank you everyone for reading! Hope you enjoyed the content!\n\nBe sure to leave a comment down below with your opinion on the matter of more or less stocks and other thoughts on the stock market!\n\nHave a great Thanksgiving and see you next time!",
        "subreddit": "stocks",
        "title": "Is over diversification bad? Are less stocks more profitable? Starting a new portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/k1pbij/is_over_diversification_bad_are_less_stocks_more/",
        "created": 1606460208.0
    },
    {
        "author": "picuron",
        "created_utc": 1604884790,
        "id": "jqnzvk",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%",
        "subreddit": "stocks",
        "title": "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:",
        "url": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/",
        "created": 1604913590.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1606431365,
        "id": "k1pb44",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**In this post I am going to share my experience as I start a new portfolio from 0$ and keep adding funds to it every month as I try to grow it as fast as possible**\n\nHey everyone Happy Thanksgiving and Welcome! So, I have deposited and invested in the stock market all the money I managed to save up in the last month as I deposited 3500$ in my eToro portfolio on the 12th of November and I am already up more than 7% in just two weeks. \n\nAs my portfolio has constantly outperform the big 3 indexes the Nasdaq100, the SP500 and the Dow Jones 30 almost every day since starting my portfolio. Here is a comparison of my portfolio vs the indexes since starting as I am up over 7%. [Portfolio v Index](https://ibb.co/pRnQLQf)\n\nSo i wondered? Is it really bad to own more stocks? Is less &gt; more? What is your opinion on this subject? I believe that it is way better to be invested in more companies and to add and grow your position in time as you also see how the companies evolve and you can also do some price averaging.\n\nSo here is my current portfolio composition as I split all my money equally to start, I will go into very few little details about everyone so I don’t make this a 2 hour read time.\n\nI will start now by going alphabetically and not in the most important order as the first company that I own is BYD which is a rival company for both Tesla and NIO in the EV market as they focus on cars, new energy solutions and electronics. They are also developing a lot of commercial EV like buses, coaches and taxis which will be a great addressable market for them as they are not rivaled in those segments at the moment. The company has gone up a lot in value this year as you can see in this graph and have a Forward P/E of more than 100 but I believe this company will greatly expand its sales and be one of the leaders in the segment especially in China which is the biggest EV market. [https://ibb.co/gVVwpfR](https://ibb.co/gVVwpfR) / [https://ibb.co/z7YBGr9](https://ibb.co/z7YBGr9)\n\nThe second holding is Apple, is there anybody that doesn’t know this company? They are the biggest company in the world and they continue to expand with new products and services every day, I don’t see this company going down in the short term or the long term as they have pretty expensive at a 35 P/E but earnings are still rising especially with more subscription based income coming in with the release of the Apple One Bundle. [https://ibb.co/Tm3hWMZ](https://ibb.co/Tm3hWMZ) / [https://ibb.co/Q9YjJTx](https://ibb.co/Q9YjJTx) / [https://ibb.co/BrzkHCY](https://ibb.co/BrzkHCY)\n\nAbbVie is a health company that produces a lot of great drugs and has more than 26 million patients in over 200 countries that are treated every year. They are one of the best companies in the sector and are still down about 25% from the all time highs while only trading at a forward P/E of 8 which is very low. [https://ibb.co/9nn4z0q](https://ibb.co/9nn4z0q) / [https://ibb.co/mXh3JL5](https://ibb.co/mXh3JL5) / [https://ibb.co/cwhJgB5](https://ibb.co/cwhJgB5)\n\nAMD is a well established companies that creates high performance GPU’s for both personal computer and for data centers, the company has turned around and have started a great path to success since the newest CEO took the job in 2014 as the stock was trading at 2$ and while the company is trading at a very high forward P/E they have a lot of room to grow in this new economy as the EPS is expected to increase by more than 40% quarter over quarter [https://ibb.co/dpwYPcy](https://ibb.co/dpwYPcy) / [https://ibb.co/7vwWHtC](https://ibb.co/7vwWHtC) / [https://ibb.co/yF0RmQv](https://ibb.co/yF0RmQv)\n\nAmazon is the internet retail juggernaut and cloud servicing company that has also started to expand in more and more domains like pharmacy just last week, though the company is also trading at a very high PE they have a lot of room to grow internationally and also are expanding in a lot more domains at a very fast rate. [https://ibb.co/4TnGhkt](https://ibb.co/4TnGhkt) / [https://ibb.co/c6W2Ypx](https://ibb.co/c6W2Ypx)\n\nAphria is a Canadian company that mainly grows cannabis for medical use but has recently acquired a beverage company and is look to expand its product line, especially with the legalizing of marijuana more and more obvious in the US. They are one of the companies that stands to benefit the most from this as they are also expected to be the first to reach profitability by next year compared to Aurrora Canabis and Cannopy Growth. [https://ibb.co/KrfL267](https://ibb.co/KrfL267) / [https://ibb.co/kJ8yxDR](https://ibb.co/kJ8yxDR)\n\nBroadcom is one of the biggest American semiconductor solutions provider, they are a very good play for the sector as they only trade at a forwarde P/E of 17 which is very good compared to comptetitors. [https://ibb.co/8KFmX88](https://ibb.co/8KFmX88) / [https://ibb.co/q18SzPb](https://ibb.co/q18SzPb)\n\nEveryone also knows Boeing as they are one of the biggest commercial manufacturers of jetliners, defence, space and security systems. The have suffered a lot in the last 2 years after the 737 accidents and the recent stay-at-home economy, but the ban on the plain has been lifted in the US and will be followed by the European Union soon, they have a big backlog of planes to work through while this situation will improve and air travel returns slowly in the next years. [https://ibb.co/JxZYZ6D](https://ibb.co/JxZYZ6D) / [https://ibb.co/NVbhDLQ](https://ibb.co/NVbhDLQ)\n\nAlibaba is a online e-commerce giant that has expanded into cloud computing services also and stands to benefit a lot from the stay-at-home economy while also having just a forward PE of 32 which is very low compared to Amazon as they are the Chinese version of them. The company also owns Ant Group which is one of the largest fin tech companies in the world and will likely gain a lot after they finally manage to go public. [https://ibb.co/0JPN6DN](https://ibb.co/0JPN6DN) / [https://ibb.co/6NgjGNV](https://ibb.co/6NgjGNV) / \n\nBerkshire is the child company of Warren Buffet as they are a holding company that engages in diversified business like technology, banks, insurance and much more. The company is currently trading at a very low P/E an barely above the price/book value as even the founders of the company believe this as they have continued to buy back shares of the company in the last year at the fastest rate in company history. [https://ibb.co/bP6VjpM](https://ibb.co/bP6VjpM) / [https://ibb.co/hf5hX39](https://ibb.co/hf5hX39)\n\nCaterpillar is one of best companies in manufacturing, construction and mining equipment. They are trading at almost 3 time sales with a high P/E but this is likely to regain momentum with the China trade war relaxing with the new Biden administration as well as the reopening of the economy [https://ibb.co/pnC17PM](https://ibb.co/pnC17PM) / [https://ibb.co/2vsQSjt](https://ibb.co/2vsQSjt)\n\nChipotle Mexican is one of the best companies right now in the fast food business as they continue to innovate and have just opened they’re first digital only store. The company is trading at a very high P/E but has substantial growth potential so I believe it will be a great buy for the future. [https://ibb.co/GCqd3Y9](https://ibb.co/GCqd3Y9) / [https://ibb.co/JnBm3bx](https://ibb.co/JnBm3bx)\n\nCostco is one of the world biggest retailers that has a great business model as they are making most of they’re money through membership fees unlike other retailers that mostly rely on prices, the are trading at just 1 times sales which is very good and they have a lot of room to grow especially with improve China relationships. [https://ibb.co/X4M76Vd](https://ibb.co/X4M76Vd) / [https://ibb.co/ypg3Gyc](https://ibb.co/ypg3Gyc)\n\nCrowdstrike is a cyber security company that has seen a huge spike due to the transition to more and more digital presence for all the companies. They are a company that I believe is here to stay and just started to become profitable in the last quarter. [https://ibb.co/zNbfhL9](https://ibb.co/zNbfhL9) / [https://ibb.co/mBw2TKj](https://ibb.co/mBw2TKj)\n\nCarvana is one of the best players for the second hand car market as they operate a unique e-commerce platform for people to buy, sell or finance cars. They are one of my favorite companies as they are also just starting to make money as they continue to expand they’re presence. [https://ibb.co/QPZ1wnt](https://ibb.co/QPZ1wnt) /  [https://ibb.co/0rS6LrQ](https://ibb.co/0rS6LrQ)\n\nCVS is a health and pharmacy companies that owns the most pharma stores in the US, the company has been hit recently by the news that Amazon is getting into pharmacy delivery but I believe they will be a great play for the vaccine distribution play as the company is only trading at a forward P/E of 8 and is trading below value of sales while also offering a dividend of 2% [https://ibb.co/KNH6v5G](https://ibb.co/KNH6v5G) / [https://ibb.co/8Ps3QRB](https://ibb.co/8Ps3QRB)\n\nDelta is one of the major airlines in the US and as I wanted to be exposed to some recovery plays I choose this company as I believe air travel will come back in the next years. The financials are not great for the company but they did manage to cut the cash burn rate in the last quarter. [https://ibb.co/gyrSYYb](https://ibb.co/gyrSYYb) / [https://ibb.co/KsNbFHg](https://ibb.co/KsNbFHg)\n\nDeere is another great industrial and manufacturing play for the recovery stocks. The company is trading at a pretty high P/E ratio for them as the stock has runed very high in the last months but they do offer a dividend of 1% which is much better than any bank savings account and also have the potential for growth and also are a pretty reliable way to diversify portfolios. [https://ibb.co/NSsCGN1](https://ibb.co/NSsCGN1) / [https://ibb.co/thrY6W2](https://ibb.co/thrY6W2)\n\nDisney is a very diversified family friend entertainment and media company as they have a lot of great business that will benefit a lot from the re-opening while this contributed a lot to the huge expansion of the streaming business with Disney+ and Hulu so the financials are not great but I believe this will hugely improve in the next couple of years. [https://ibb.co/BG0jctn](https://ibb.co/BG0jctn) / [https://ibb.co/7GR9h3c](https://ibb.co/7GR9h3c)\n\nDraftkings is an American daily fantasy sport operator that has expanded into the huge market of online gambling as more and more us states are legalizing gambling so they have a lot of room to grow in front of them especially with a great online presence with financials not being very important at the moment as they continue to grow they’re presence [https://ibb.co/k8dtJmM](https://ibb.co/k8dtJmM) / [https://ibb.co/HgGQvG2](https://ibb.co/HgGQvG2) \n\nDominos Pizza is one of the biggest pizza companies in the world and are also one of the best in implementing they’re presence in the delivery services as they are way better at this than others companies like Papa John’s. [https://ibb.co/NZXkQjg](https://ibb.co/NZXkQjg) / [https://ibb.co/FVGXXBY](https://ibb.co/FVGXXBY)\n\nEtsy is a e-commerce platform for creative goods and services and has seen a huge rise in popularity and will probably remain a big gainer from this past year, though they are trading at over 70times earnings this will likely improve very much in the next years as they are expected to expand and improve earnings substantaly. [https://ibb.co/5MN9zb7](https://ibb.co/5MN9zb7) / [https://ibb.co/PYz0NWK](https://ibb.co/PYz0NWK)\n\nFord is one of the biggest car makers in the world, I really like this company as it having a big push to move to the EV world with the Mustang Mach E, the EV Transit and the hugely anticipated EV F-150, the company is expected to have huge improvements in the next year as they have decent financials and are one of the best companies to own for a dividend investing strategy. [https://ibb.co/MhwMB47](https://ibb.co/MhwMB47) / [https://ibb.co/745w8vq](https://ibb.co/745w8vq)\n\nFacebook is the largest social media network in the world that also owns Instagram, they have been struggling in the last months due to the political environment but I believe they will continue to be a giant in the tech sector as they are finding new ways to improve revenue streams especially in the highly active Instagram platform as they are trading at pretty much the same P/E like the other big tech companies but are expected to see a growth in advertising money as companies move to a more digital presence. [https://ibb.co/SVjFGvc](https://ibb.co/SVjFGvc) / [https://ibb.co/T1Ds8V8](https://ibb.co/T1Ds8V8)\n\nFiverr is one of the biggest marketplaces for freelance services as this kind of gigs have hugely exploded this year, the company is trading at an insane PE but we have to see what the next quarters brings to us as it may end up being a very profitable company in the future. [https://ibb.co/st03fyj](https://ibb.co/st03fyj) / [https://ibb.co/zQk3Mgp](https://ibb.co/zQk3Mgp)\n\nGeneral Elecitrc is a conglomerate that operates in many business like aviation, healthcare, renewables, digital industry finance and more, they have suffered a lot in the past decade but the CEO has managed to turn things around latetly and might put the company back on track as it is way below all time highs and even recent highs of 30$ just 4 years ago, they might get a boost from the return of the aviation business in the next years. [https://ibb.co/2nTc9mh](https://ibb.co/2nTc9mh) / [https://ibb.co/sybXXPQ](https://ibb.co/sybXXPQ)\n\nGeneral Motors is the other big Detroit giant that I own in my portfolio as I really like where the company is going with its big push in the EV market in the next couple of years, they are trading at a 19 PE and are in a very good position to keep growing. [https://ibb.co/37hqV2C](https://ibb.co/37hqV2C) / [https://ibb.co/BNp0hht](https://ibb.co/BNp0hht)\n\nBarrick Gold is one of the biggest gold and copper mining companies in the world and I use it for some hedging as I like owning this company more than I like owning gold, as this company also provides us with dividends of more than 1% while gold doesn’t [https://ibb.co/P9cVDxs](https://ibb.co/P9cVDxs) / [https://ibb.co/6tpfDtH](https://ibb.co/6tpfDtH)\n\nI don’t believe google needs any introductions as I believe they are still one of the best companies in the tech sector despite lagging the other faang companies this year but they have regained momentum in the last quarter and I believe they can be a catch up trade and a long-term investment [https://ibb.co/JRm07vw](https://ibb.co/JRm07vw) / [https://ibb.co/mT7nWC8](https://ibb.co/mT7nWC8)\n\nGoldman Sachs is a global investment bank that seems to be back on track after the company has struggled in the last couple of years and are also a great diversification play as they are trading below book value. [https://ibb.co/FqmNyFF](https://ibb.co/FqmNyFF) / [https://ibb.co/1zkLmfx](https://ibb.co/1zkLmfx)\n\nHome depot is a big retailer that has gained a lot of traction in the last year and stands to benefit in the future from the great move to online sales. The company is trading at a 25 PE but seems to be on a huge growth bath while also having a more than 2% dividend yield. [https://ibb.co/KXpDM77](https://ibb.co/KXpDM77) / [https://ibb.co/cDBxJgK](https://ibb.co/cDBxJgK)\n\nHoneywell is one of the most diversified technology and manufacturing companies in the world that stands to benefit a lot from the reopening as a lot of companies need to upgrade they’re technology systems. The company has a good dividend yield and a great profit margin. [https://ibb.co/kMxjNRz](https://ibb.co/kMxjNRz) / [https://ibb.co/TL67SRD](https://ibb.co/TL67SRD)\n\nIntuitive surgical is a global technology company for minimally invasive surgery. As this kinds of surgeries have been postponed they stand to benefit from the world getting back to normal. They have huge profit margins that can see they earnings soar in the next years. [https://ibb.co/Lz7j8td](https://ibb.co/Lz7j8td) / [https://ibb.co/kXdmzhQ](https://ibb.co/kXdmzhQ)\n\nJohnson &amp; Johnson is a great company that develops medical devices, meds and consumer goods and stat to benefit a lot if they manage to create e good vaccine. They are currently trading at a PE of 22 but have huge upside and also are a great dividend paying company. [https://ibb.co/FWXqpH2](https://ibb.co/FWXqpH2) / [https://ibb.co/c8qQXNF](https://ibb.co/c8qQXNF)\n\nJP Morgan is a global financial giant with over 3 trillion$ in assests, the company trades at about a 33% price to book overvaluation but stands to benefit a lot in the future from the huge money pumping in the economy by the FED and the return of higher interest rates. [https://ibb.co/hBvLxV5](https://ibb.co/hBvLxV5) / [https://ibb.co/Jtkn90L](https://ibb.co/Jtkn90L)\n\nCoca-Cola is another company that needs no introduction and is still a great company to own with a great dividend yield that stands to benefit from a reopening economy. [https://ibb.co/G9CmsgL](https://ibb.co/G9CmsgL) / [https://ibb.co/C2FLSGy](https://ibb.co/C2FLSGy)\n\nLemonade is a disruptive insurance company that is still expanding its markets. They have a great business strategy and can become a very big player in the industry. The company has more than double since the IPO earlier this year so I believe this can be a great long term investment. [https://ibb.co/zhjYRct](https://ibb.co/zhjYRct) / [https://ibb.co/PZ23M72](https://ibb.co/PZ23M72)\n\nLowe’s is another great retailers similar to Home Depot that has done a great job in transitioning to online sales. I really like the company as it trades at just 20 times earnings and has a great growth rate and dividend yield. [https://ibb.co/zfpyLZC](https://ibb.co/zfpyLZC) / [https://ibb.co/MfS6QNg](https://ibb.co/MfS6QNg)\n\nMcDonalds is the biggest fast food company in the world, the company has done a terrific job this year with drive thru orders and stand to benefit even more after the reopening while also having a great dividend of more than 2% and possibility of growing delivery sales even more in the future. [https://ibb.co/CBTWtJP](https://ibb.co/CBTWtJP) / [https://ibb.co/v1cBqQn](https://ibb.co/v1cBqQn)\n\nMercadolibre is a e-commerce company that is the Amazon or Alibaba of South America as they operate in a lot of sectors like cars, aircrafts, real estate and more. I believe this is a great company to own if you believe in the future of e-commerce. [https://ibb.co/McFrBhZ](https://ibb.co/McFrBhZ) / [https://ibb.co/Cw3wSSk](https://ibb.co/Cw3wSSk)\n\nIsn’t it already obvious that my portfolio must have included Microsoft also? As they are a big beneficiary of cloud services and tech evolutions. This is a staple for every portfolio with great growth and a better dividend yield than any bank can offer at the moment. [https://ibb.co/cvMm8Md](https://ibb.co/cvMm8Md) / [https://ibb.co/FnYD1Y3](https://ibb.co/FnYD1Y3)\n\nAs I want to be diversified and exposed to recovery play I also picked the cruise line that I think will do best in the long run. So though Norwegian have diluted they’re shares a lot during this year, I belive not all cruise lines will survive and they will eat up market share when everything goes back to normal. So I don’t really care about the financials that much at the moment as this is a very long term pick. [https://ibb.co/tHDcrMY](https://ibb.co/tHDcrMY) / [https://ibb.co/PTqK0dj](https://ibb.co/PTqK0dj)\n\nNext Era Energy is the largest electric utility by market cap and has the world largest generator of renewable energy from wind and sun and stand to benefit a lot from a Biden administration that is why they are trading at such high multiples at the moment. The company also has an impressive yield of almost 2% [https://ibb.co/xjYVMx4](https://ibb.co/xjYVMx4) / [https://ibb.co/q9hjp48](https://ibb.co/q9hjp48)\n\nI also bought NetFlix as I believe them, Disney and Roku will be some of the largest players in the streaming business as traditional TV and cinema are a dying business at the moment.The company is trading at a premium but this is due to them dumping money in high quality content to grow they’re subscriber base while they also have steadily increase subscriptions cost in the last years. I believe they will do better next quarter and will see a re-test of all time highs. [https://ibb.co/VN2TF6f](https://ibb.co/VN2TF6f) / [https://ibb.co/B6j9zTn](https://ibb.co/B6j9zTn)\n\nI also own NIO more as a spec play to be well diversified in the EV world, I believe this is a long term investment as the stock price has gone up like bananas recently, the company will have to have perfect growth in the next couple of years to justify an increase in value as they are still losing money. [https://ibb.co/MZ2NL4v](https://ibb.co/MZ2NL4v) / [https://ibb.co/mt8f3ZR](https://ibb.co/mt8f3ZR)\n\nNike is my favorite apparel play as I believe it is the most desired my a lot of people and keeps expanding. I really like how the company is managed and I believe in them for the long-run. [https://ibb.co/jw1zjgj](https://ibb.co/jw1zjgj) / [https://ibb.co/RYR4QSP](https://ibb.co/RYR4QSP)\n\nNvidia is my favorite play in the semiconductor sector as they will continue to benefit from more and more personal pc sales as well as huge data center demand especially for they’re super performing products. They trade at a huge premium right now but I believe they can become the next trillion dollar company in the tech sector. [https://ibb.co/kgJS0w1](https://ibb.co/kgJS0w1) / [https://ibb.co/k8D1MSL](https://ibb.co/k8D1MSL)\n\nI also like owning Pepsico alongside Coca Cola as they are the two biggest players in the sector and I believe that they will both benefit a lot in the next years from the economy recovery. With pepsico offering a 2,7% dividend and a great growth path I really like owning this stock [https://ibb.co/2SY4xPY](https://ibb.co/2SY4xPY) / [https://ibb.co/Sdt2hGC](https://ibb.co/Sdt2hGC)\n\nPinterest is an up and coming social media platform that has a great ad friendly setup and could see growth in the next years. They are trading at insane PE ratios but that should catch up to the company in the future and I believe you must own it to be well diversified. [https://ibb.co/gwGFbyb](https://ibb.co/gwGFbyb) / [https://ibb.co/5TYz4KS](https://ibb.co/5TYz4KS)\n\nPalantir is a highly controversial name right now but its products and services are really good as they are earning more and more stamps of approval with government contracts while also expanding to commercial use. Financial info is not that good as the company barely reported they’re first earnings after the IPO. [https://ibb.co/fdQ42gc](https://ibb.co/fdQ42gc) / [https://ibb.co/wyTJSG2](https://ibb.co/wyTJSG2)\n\nPayPal is another great company that will do very well in the future as payments transition to a more digital approach and the company is transitioning to allow cryptocurrencies as well which will attract even more users. They have had a greet increase in revenue and eps in the last quarters and I expect that to continue to grow. [https://ibb.co/9tXxhJZ](https://ibb.co/9tXxhJZ) / [https://ibb.co/M5vCynn](https://ibb.co/M5vCynn)\n\nQualcomm is my favorite 5G play alongside apple as this will be a long cycle of upgrades for the communications services that will benefit them a lot.They are trading at an PE of over 30 but have great revenue and EPS growth while also offering an almost 2% dividend yield. [https://ibb.co/NFsnKqW](https://ibb.co/NFsnKqW) / [https://ibb.co/x5sJLW6](https://ibb.co/x5sJLW6)\n\nRoku is a great play for the hardware and subscription based services for digital media players and has huge tailwinds that will benefit them while the old TV cycle is dying. They have had a huge year over year revenue growth and subscribers growth that has passed the 40 million mark for the first time recently. [https://ibb.co/Fqd7sYP](https://ibb.co/Fqd7sYP) / [https://ibb.co/ccKqzkC](https://ibb.co/ccKqzkC)\n\nWhile SunRun is another great play for the new Biden administration as well as the transitioning to more renewable energy as they may see a huge boost in revenue growth and earnings with more money being pumped into the renewable sector. [https://ibb.co/0jr3TRg](https://ibb.co/0jr3TRg) / [https://ibb.co/NmdSdwP](https://ibb.co/NmdSdwP)\n\nEveryone also knows Starbucks, as I expect them to be a huge gainer on a improved US-China relationship so despite suffering a lot from this economy the stock is still up more than 16% in the last year while revenues have declined, expect this to bounce back by 2021-2022. [https://ibb.co/s5nTzQX](https://ibb.co/s5nTzQX) / [https://ibb.co/fDyhvX3](https://ibb.co/fDyhvX3)\n\nShopify is a multinational e-commerce cloud based platform for merchants like small and medium sized business so that can easily have an online store that they can manage payments for, orders inventory and much more. The company is trading at P/E’s that are crazy but the revenue and EPS growth is also amazing and has the potential for a lot more growth as the world is going more and more digital. [https://ibb.co/6nt4GhC](https://ibb.co/6nt4GhC) / [https://ibb.co/QbFhybt](https://ibb.co/QbFhybt)\n\nStore capital is a real estate investment trust that focuses on single tenant commercial real estate so they can negotiate much better rents and collections than other REIT. They are still more than 8$ under the highs and are a great diversification and yield giving stock to own. [https://ibb.co/XzBY41g](https://ibb.co/XzBY41g) / [https://ibb.co/TrGRZpR](https://ibb.co/TrGRZpR)\n\nAT&amp;T is one of the largest providers in the us and seems to be getting back on track after they have struggled in the past decade, they trade at only 8 times forward P/E and have one of the best dividend yields at more than 7% so I believe this is a must have staple in your portfolio that brings stability and cash flow. [https://ibb.co/cYcfYMm](https://ibb.co/cYcfYMm) / [https://ibb.co/8D3NzZr](https://ibb.co/8D3NzZr)\n\nWhile Target has been doing some amazing things as they operate as a general merchandise retailers and are doing some amazing things with online sales, they currently have seen a spike in the last months and are trading at a p/e of over 22 but I see them as a long term winner that offers both growth and value with a dividend yield of 1,5%. [https://ibb.co/Fzd8TMw](https://ibb.co/Fzd8TMw) / [https://ibb.co/NLnw4Lv](https://ibb.co/NLnw4Lv)\n\nWhile the other communication provider that I like is T-Mobile US which has seen a huge spike in user growth and are poised to do a lot of great things with the 5G cycle, they trade at a very high multiple for this sector but the growth expectations are huge for this company. [https://ibb.co/PCDFD38](https://ibb.co/PCDFD38) / [https://ibb.co/BTSzTMp](https://ibb.co/BTSzTMp)\n\nMoving on, one of the biggest gainers this year, TESLA is also one of my favorite companies to own as they continue to expand the products they offer and improve margins on vehicle, they are also expanding into more and more services, while manufacturing is growing exponentialy. They trade at insane P/E’s but they have just managed to be included in the SP500 so this may bring some stability to the stock as the company continues to grow in the next decade.[https://ibb.co/6rNJf6q](https://ibb.co/6rNJf6q) / [https://ibb.co/CWN6wD4](https://ibb.co/CWN6wD4)\n\nVisa is the biggest global payments technology company and is expected to continue to grow as more people start using cashless payment options, they are a great growth and value company for the future as cash payments is a dying proposition worldwide. [https://ibb.co/CVXgZD9](https://ibb.co/CVXgZD9) / [https://ibb.co/BPKxFfZ](https://ibb.co/BPKxFfZ)\n\nWal-Mart, the biggest employer in the US continues to do amazing stuff as they continue to expand they’re online presence and compete with Amazon as they trade at a 23 P/E and also offer a dividend yield. they are a great play alongside with Amazon which trades at much higher valuations. [https://ibb.co/Sr9s83J](https://ibb.co/Sr9s83J) / [https://ibb.co/0CvZKkD](https://ibb.co/0CvZKkD)\n\nWynn is another great recovery stock that I like as recently we found out that foot traffic in Macau has ramped up, this bolds well for the company as they will be one of the biggest gainers on the reopening. So if you are a long term investor you should get into this stock I believe. [https://ibb.co/6rk2qNQ](https://ibb.co/6rk2qNQ) / [https://ibb.co/mC35VPr](https://ibb.co/mC35VPr)\n\nZoom is the one company that I will be selling in the next couple of days. I know they are one of the best video conferencing apps out there, but I believe they will have a lot of problem due to a number of free apps that also offer great quality while the company is trading at insane p/e numbers. I know this trend is here to stay, but I thing there are far better play in the stock market out there rather than Zoom at this price point.  [https://ibb.co/T1tStb8](https://ibb.co/T1tStb8) / [https://ibb.co/rmxh0x3](https://ibb.co/rmxh0x3)\n\nI know I didn’t get into in-depth stuff, technical analysis, fundamentals and more but I will continue go more in depth with this stocks as time goes on. \n\nSo here how I want to make my portfolio look like when I have enough money to open all the positions. [TARGETED PORTFOLIo](https://ibb.co/CHWsb27)\n\nAs you can see a quarter of my portfolio will be invested in high quality companies that are pretty safe in my opinion. While over 45% of the portfolio will go to companies that I really like, that have a pretty low risk in my opinion and can offer great returns in the future. While I will also use about 22% of my portfolio into more risky companies that can bring very good profits for the portfolio but in my opinion are not as safe as the others. \n\nAnd finally I will invest about 7% of my portfolio into more speculative stocks or hedge stocks like Barrick Gold and Goldman Sachs. I don’t want to keep money on the sidelines at the moment as I expect the stock market will keep rising for a couple of years at a rapid pace due to the recovery of the economy.\n\nThank you everyone for reading! Hope you enjoyed the content!\n\nBe sure to leave a comment down below with your opinion on the matter of more or less stocks and other thoughts on the stock market!\n\nHave a great Thanksgiving and see you next time!",
        "subreddit": "StockMarket",
        "title": "Is over diversification bad? Are less stocks more profitable? Starting a new portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/k1pb44/is_over_diversification_bad_are_less_stocks_more/",
        "created": 1606460165.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1605528426,
        "id": "jv5ovw",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**In this post we’ll talk about what happened last week in the stock market and what to expect this week as earnings season is coming to an end**\n\n[THUMB](https://ibb.co/j64rkG0)\n\nHey everyone and Welcome, so let’s start with a recap of Friday’s movements in the stock market and what happened last week as we saw the Dow finishing Friday up 1,37% [CHART](https://ibb.co/HHPdbR9), the S&amp;P500 up almost the same while closing at a record level for the index [CHART](https://ibb.co/HTG25s0) and the Nasdaq composite being up just over 1% [CHART](https://ibb.co/274Gq6g).\n\nAlmost 80% of companies were advancing on Friday as the stock market finished the week strong with an almost 90% ratio of new highs vs lows but the volume was way below average on Friday as most investors finished restructuring they’re portfolios in the early part of the week after the Vaccine news [CHART](https://ibb.co/sbn5dWp).\n\nAlso this week we saw the largest ever global equity inflow as you can see in this Bank of American chart as there were over 40 billion dollars being pushed in equities. [CHART](https://ibb.co/18g7xrJ)\n\nAll sectors finished in the green on Friday with real estate, energy and industrial leading the way with all 3 sectors having more than 50% of companies up over 2%, even tech kept up the pace after leading us through this recovery with over 37% of companies being up more than 2% on the day.\n\nWe also saw small-cap and value plays outperform again as people are betting that the economy will have a broader breadth of recovery after the vaccine will be available. [CHART](https://ibb.co/jTMx5ry)\n\nThe VIX also finished the week very strong as it continued to decline to it’s lowest level, ending the week at the 23 level. [CHART](https://ibb.co/j4057B8)\n\nAs you can see in both the SP500 heat map [CHART](https://ibb.co/dW01vyR) and the world heat map  [CHART](https://ibb.co/G2Fvk7c) almost all companies were in the green on Friday with a few exceptions like Nvidia, NetFlix and Alibaba, as they were punished a little after the huge run they in the last 9 months while Alibaba continues to struggle with the Chinese government.\n\nThe COVID-19 numbers are dangerously going up as you can see, with daily cases going parabolic, indeed with a bigger number of tests being taken but there is still a huge rise in positivity rate, and as you can see this is the 3rd hump of the pandemic in terms of numbers of hospitalized people. The one positive thing for the moment is that deaths haven’t gone up as much due to the better treatment but this number does usually trail the others so we will have to see what happens in the next weeks. [CHART](https://ibb.co/wdSTt4v)\n\nHere you can see better that weekly test are up almost 10% while weekly cases have gone up 4times that much almost at a 40% growth rate while the hospitalized and deaths have not increased as much as the cases yet. [CHART](https://ibb.co/QpzPbs8)\n\nThis weeks interesting earnings [EARNINGS](https://ibb.co/K5bMM4B) in my opinion will come from Walmart and Home Depot before the open on Tuesday as I expect both of them to dazzle in the earnings reports, while Walmart is expected to have an EPS of 1$ and 19 cents I expect them to be around 1,5$ at least like last quarter while Home depot is expected to have an EPS of just over 3$ I expect that to be at least 30cents to half a $ better then expected also as the companies look to continue the amazing earnings season that is mostly ending this week as we saw an overwhelming number of companies beating the estimates by quite a gap.\n\nThis will be followed after the close with the Concept company NIO which has been going up amazingly in the last weeks as it has touched even 54$ but has since seen a pullback of almost 10$, so be careful when trading this, it may be a bumpy ride as the company is still losing money and seeking to increase manufacturing and sales, as I don’t see them having to much of a success in Europe even if the manage to launch they’re cars there, this because people will have a stigma for the company as being Chinese, and not offering great quality. Despite the recent Chinese movements some good news came in on Sunday as China has formed the largest free trade block that includes fifteen Asia-Pacific Economies with big names like Japan, South Korea, Australia and others being included [NEWS](https://ibb.co/XbcqV80). This group will account for 30% of the global economy and population. This will probably bold well for NIO as it has tanked after Citron released a statement that they are taking profits in NIO [NEWS](https://ibb.co/SQBbW6s).\n\nMoving on Wednesday we will also get some other retailers reports with Target and Lowe’s releasing reports also before the open. I believe this two will be impacted by what Walmart and Home Depot announce, if they have great results expect them the stocks to see a double move on Tuesday and Wednesday. Also, one of the biggest gainer of the stay at home moves, nVidia, will report after the close as I expect them do have great earnings again as they will continue to benefit a lot from the stay-at-home economy as October videogame sales were up 14% expect this also be translated into Nvidia’s earnings as this was the month before the new consoles from Microsoft and Sony were released. [NVIDIA NEWS](https://ibb.co/kK3WWj4)\n\nSo I really like all 3 of Home Depot, Walmart and Nvidia and if you want to make a gamble you can also make a small investment in Nio, as there are no other big catalysts at the moment earnings may impact the stocks and we can see a re-test of highs for all of them.\n\nOne other company that I will keep my eye on is Disney as they beat the expectations for earnings, revenue and subscriber for the streaming business, I will watch what updates the investors meeting in December will provide us, as I really like the company and the stock very much, if they want to keep this going and become a rival for NetFlix they do have to invest much more money in content, as they will have to keep providing new content that generates growth for Disney+. [NEWS](https://ibb.co/QNCc3D3)\n\nSome other news from the last days are that Qualcomm has received an exemption to sell chips to Huawei, which is not was expected that they would be allowed to sell 5G chips, but still is good news for the company as it provides another buyer for its products. [NEWS](https://ibb.co/ZVp8gTw)\n\nWhile DraftKings soared on Friday after they announced better than expected results and guidance for the future. [NEWS](https://ibb.co/qy9vmyB)\n\nThis came alongside the filing of documents for the hugely anticipated of DoorDash the leader in food delivery with a 50% market share. [NEWS](https://ibb.co/sWZDTpB)\n\nThank you everyone for watching! If you haven’t already be sure to smash the like button and subscribe to my channel, also leave a comment down below Have a great day and see you next time!\n\nThank you everyone for reading! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "subreddit": "stocks",
        "title": "Stocks to buy this week| HOME DEPOT | WALMART | NIO | NVIDIA |Stock market news [11-16-2020]",
        "url": "https://www.reddit.com/r/stocks/comments/jv5ovw/stocks_to_buy_this_week_home_depot_walmart_nio/",
        "created": 1605557226.0
    },
    {
        "author": "joelivi053",
        "created_utc": 1606472726,
        "id": "k1yrf7",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "TSNP trading at .04 is on the rise as the Company prepares to complete the reverse merger with HUMBL; a major mobile payments player with a first-class management team with team members coming from companies like Western Union, Moneygram, Visa, American Express, Epson, Microsoft, Facebook and Qualcomm and was recently named a Forbes “Rising Startups to Watch” Reverse Merger stocks (RM) are easily among the most exciting and explosive stocks in small caps rivaling only biotechs in their ability to make historic gains.\n\nTesoro Enterprises, Inc. (OTCMKTS: TSNP) is a clean shell operating out of Oklahoma City, Oklahoma. The Company recently announced it has entered into an agreement with HUMBL, LLC to merge the two entities. In an all-stock transaction, the members of HUMBL will receive preferred shares of Tesoro in exchange for their HUMBL holdings. The mission of HUMBL® and HUMBL Hubs™ is to deliver high quality, low cost digital payments and financial services. The HUMBL network was designed to disrupt entrenched regional banks, wire services and roadside finance providers in emerging markets such as Latin America, Caribbean, Asia and Africa to help reduce costs and improve settlement speeds for customers. The HUMBL® Mobile App delivers borderless transactions, by integrating multiple currencies, payment methods, banks, blockchain and financial services providers into one-click for the customer. HUMBL® provides greater access and portability than US only mobile wallet providers, such as Venmo® and Zelle®.\n\nHUMBL is comprised of team members from companies like Western Union, Moneygram, Visa, American Express, Epson, Microsoft, Facebook and Qualcomm and was recently named a Forbes “Rising Startups to Watch” in June 2020 for recognizing the “major gap between the US and emerging markets regarding mobile payments.” HUMBL has designed a mobile wallet (HUMBL®) and merchant software (HUMBL Hubs™), that help primarily cash economies migrate to digital money services across key vertical markets, such as: government, banking, wireless carriers and merchant services. HUMBL’s global money platform will deliver up to 50% estimated savings on transactions such as: sending, receiving, lending, borrowing, investing money and paying bills.",
        "subreddit": "pennystocks",
        "title": "TSNP NEEDS TO BE ON HIGH ALERT!!!!!!!!",
        "url": "https://www.reddit.com/r/pennystocks/comments/k1yrf7/tsnp_needs_to_be_on_high_alert/",
        "created": 1606501526.0
    },
    {
        "author": "aMereMortalxxx",
        "created_utc": 1604520308,
        "id": "jo3up7",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Sup my stockbros. Sunday eve I [posted my plays](https://www.reddit.com/r/wallstreetbets/comments/jmbuff/i_draw_with_crayons_so_you_dont_have_to_this/) for the week and opened those positions Monday morning. Sitting on about $4k profits which I've closed out some and may or may not let the others ride out for a few additional percentage points. Think I might take out your wife for some nice lobster and then to pound-town to finish off a good week. My next play is absolutely free money and literally wont go tits up.\n\n**Weekend Plays**\n\nCRM - Salesforce: 100 shares @ $237 cost basis. Currently $251 per share and 6% profit or $1,400.\n\nDOCU: Sold 2x cash secured puts for $1,700 and closed them out this morning at $272 for $1,400 gain.\n\nJD: Sold 2x CSP for $640. Up $400 and will let the rest ride.\n\nPYPL: Sold 3x CSP for earnings and closed yesterday at $600 profit when the stock was flat in the morning.\n\nThese plays had minimal risk since the stocks would need to drop another 5-10% for me to be assigned. I knew mango man had my back and wouldn't let me down. Positions -Yes I'm using all the margin and buying power my account has to offer, but if I could use more I would since this put-selling is pretty fucking hard to fail at. \n\nhttps://preview.redd.it/g4tss1y23ax51.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=4f0c4b547ee537007b8bed7e738750ef5fe19f1d\n\n&amp;#x200B;\n\n**Next earnings YOLO - QCOM**\n\nIt doesn't matter if you know what QCOM does or doesn't do. The only thing you need to know is that it's a solid company that has absolutely m00ned over the last 6 months. I entered a earnings YOLO selling yet more puts expiring this fucking friday. You might think selling puts is some pussy shit, but if you hate money then definitely don't do this.\n\nPOSITIONS: 2x cash-secured puts sold at $124 strike price collecting $440 US-DOLLARS. Expiring this Friday just in time for lobster and doing some ANALysis with your wife on the weekend.\n\nhttps://preview.redd.it/7jlo5ys14ax51.jpg?width=992&amp;format=pjpg&amp;auto=webp&amp;s=264d869879fde2a8643ee49dd64b8c5ce5c715b9",
        "subreddit": "wallstreetbets",
        "title": "$4k in realized gains from Sunday positions. Next earnings YOLO - QCOM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jo3up7/4k_in_realized_gains_from_sunday_positions_next/",
        "created": 1604549108.0
    },
    {
        "author": "Rmogo21",
        "created_utc": 1604793787,
        "id": "jq1g92",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " \n\n**TLDR:**\n\nIn one sentence a TML is an institutional quality stock in a leading industry group with superior fundamentals and technicals. These are monster stocks which over the course of weeks and months increase +100% to +5,000% . These stocks are disruptors which change how we work, live, or play.\n\nTMLs are popular with traders/investors whose methodology is based on the CANSLIM system developed by William O'Neil. He called them Model Book Stocks. Huge winners worth studying to identify common characteristics that they all share O'Neil studied over 1000 model book stocks going back to the 1880s. Many are shown and discussed in these must read books\n\n* How To Make Money in Stocks, William O'Neil\n* Monster Stocks: How They Set Up, Run Up, Top and Make You Money , John Boik\n* The Lifecycle Trade: How to Win at Trading IPOs and Super Growth Stocks, Eric Krull, Kathy Donnelly, and Kurt Dail\n\n**A few Historical Examples** from William O'Neil's How To Find &amp; Own America's Greatest Opportunities\n\nApple 2003 [https://imgur.com/2Egn9z5](https://imgur.com/2Egn9z5)\n\nNetflix 2009 [https://imgur.com/BHCtJpo](https://imgur.com/BHCtJpo)\n\nHome Depot 1982 [https://imgur.com/tBU3JgU](https://imgur.com/tBU3JgU)\n\nQualcomm 1997 [https://imgur.com/oYPItOW](https://imgur.com/oYPItOW)\n\nYahoo 1996 [https://imgur.com/ToOxnQJ](https://imgur.com/ToOxnQJ)\n\n**So what are the Fundamental characteristics of a TML? You want to see superior:**\n\n* Quarterly Sales Growth &gt; 25% YoY\n* Quarterly Earnings Growth &gt; 25% YoY\n* Pre+After Tax Margins &gt;20% Recent Quarters\n* ROE &gt;17%\n* Annual Earnings Ests for the next year &gt; 25%\n\nAnd above all else you want the stock to have a great story- A new and innovative product or service that changes how we work live or play. Not every TML will have all of these criteria, but in general their record should be outstanding with regards to most of them. The higher these values the better. Earnings and Sales growth over 100% YoY is ideal. Annual Estimates for next year over 100% would be exceptional.\n\nTMLs are also often in the Top 20 Industry groups at the times of their runs. The TML is the leader of an overall top group which is riding the tailwinds of changing environments. Recent examples $SE $SHOP $AMZN Retail-Internet and $TSLA $NIO Electric Vehicles (Auto Manufacturers)\n\nAdditionally base liquidity is required for these stocks to be institutional quality. Dollar Volume &gt; $30 Million is essential and most should have DV much higher than that. Accumulation by big hedge funds and mutual funds like Fidelity Contrafund are what move the markets. They won't touch a promising stock unless it has liquidity.\n\n**Now for Technical (Price Action) Characteristics of TMLs.**\n\nThey should be:\n\n* Above a Rising 30 Week Moving Average\n* Breaking out of a Stage 1 or Stage 2 Base\n* Trending above Key Moving Averages (10, 21ema, 50sma)\n* Volume and Price contractions within bases\n* Up/Down Vol&gt; 1.2\n* Huge gaps up on volume after Earning Beat\n* And most importantly they must be showing Relative Strength, meaning they are outperforming the vast majority of stocks in the market. This. is. vital.\n\nDuring corrections and overall market weakness they should be near all time highs, above their longer term moving averages. They should be standing out like a sore thumb and yelling \"Buy me\". And during Market Uptrends they should be trending above the shorter term moving averages, forming sideways price shelfs during small pullbacks and then breaking out again. Most stay above their 50 SMAs and even 21 emas for extended periods of time.\n\n**So how to scan for them:**\n\nUse MarketSmith, the IBD Stock Screener, Finviz, or another screener and screen for the fundamental criteria mentioned above combined with the stock over the 200+50 SMA. It's helpful to have multiple screens splitting up the criteria for instance one scan for the earnings and one for sales.\n\nHere is an example Finviz TML Scan: [https://imgur.com/a/CzwHdM8](https://imgur.com/a/CzwHdM8)\n\n**Recent examples to study**\n\n$LVGO 2020  \n$TSLA 2019-2020  \n$DOCU 2019-2020  \n$PTON 2020  \n$SHOP 2016-2020  \n$AMD 2018  \n$ZM 2020",
        "subreddit": "investing",
        "title": "What is a True Market Leader (TML) + And how to find them? (Ex. SHOP 2016-2020, ZM 2020, AAPL 2005-2012",
        "url": "https://www.reddit.com/r/investing/comments/jq1g92/what_is_a_true_market_leader_tml_and_how_to_find/",
        "created": 1604822587.0
    },
    {
        "author": "GrizzlyDiaby",
        "created_utc": 1606019704,
        "id": "jypmjv",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "What stocks are you most excited about heading into 2021?\n\nFor me, I feel like 5G is going to play an interesting role in stocks like QCOM. I’m also excited about growing e-commerce like JD, SE and ETSY. \n\nThere’s also EV stocks, which I’m still not sure about. There’s a lot of hype but I’m going to tread  cautiously.",
        "subreddit": "stocks",
        "title": "Heading into 2021: Biggest players",
        "url": "https://www.reddit.com/r/stocks/comments/jypmjv/heading_into_2021_biggest_players/",
        "created": 1606048504.0
    },
    {
        "author": "WSBConsensus",
        "created_utc": 1605105344,
        "id": "js96vk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "#DOW JONES\n\n**Boeing Company (BA)** has been awarded a USD 9.8bln Air Force Contract for F-15 support for Saudi Arabia. It also filed to sell 16.7mln shares for the Boeing Company Employee Retirement Plan.\n\n**JPMorgan Chase &amp; Co. (JPM)** is no longer the world’s most systemically-important bank, according to the Financial Stability boards rankings for additional capital requirements, where it now has to hold extra capital equivalent to 2.0% from 2.5%.\n\n**Raytheon Technologies (RTX)** is to acquire privately-held Blue Canyon Technologies, a leading provider of small satellites and spacecraft systems components.\n\n#NASDAQ 100\n\n\n**Advanced Micro Devices Inc (AMD) and International Business Machines (IBM)** announce a joint development agreement to advance confidential computing for the Cloud and to accelerate artificial intelligence.\n\n**Amazon.com Inc. (AMZN)** has requested that India's market regulator investigates its business partner Future Retail for insider trading.\n\n**Automatic Data Processing (ADP)** raised its quarterly dividend to USD 0.93/shr (prev. USD 0.91).\n\n**JD.Com** announced transaction volume on its platform was CNY 200bln midnight Beijing time.\n\n**Moderna (MRNA)** cancer treatment mRNA-4157 in combination with Keytruda is well tolerated at all dose levels and produced responses as measured by tumour shrinkage. Co also affirmed that the first interim analysis of its COVID-19 vaccine trial is still expected in November (previously guided for Nov 24th/25th); Emergency Use Authorisation filing seen in early-December.\n\n**Tesla (TSLA)** will produce its Model Y at its Shanghai Gigafactory 3 in 2021. Note, *BMW (BMW GY)* has unveiled its electric SUV to challenge TSLA and is planning a US launch in 2022.S&amp;P 500\n\n**Air Products &amp; Chemicals Inc (APD)** Q3 20 (USD): EPS 2.19 (exp. 2.21), Revenue 2.3bln (exp. 2.27bln). FY EPS (ex-items) view 8.38 (exp. 8.39)\n\n**AT&amp;T Inc. (T)** WarnerMedia unit is expected to lay up to 1,750 workers, according to reports, which equates to roughly 7% of its workforce.\n\n**Dish Network (DISH) and Qualcomm Inc. (QCOM)** announced their collaboration to test open and virtualised RAN 5G solutions containing the new Qualcomm 5G RAN Platforms to help fast track the rollout of the nation’s first cloud-native, open RAN-compliant 5G network.\n\n**General Electric (GE)** has ended its Corporate Audit Staff program, as part of CEO Culp’s efforts to simplify its operations.\n\n**Invesco Ltd. (IVZ)** reported preliminary month-end AUM -1.0% m/m at USD 1.207trln (negatively impacted by unfavourable market returns); total net outflows were USD 2.3bln. IVZ said it achieved net long-term inflows of USD 2.5bln in the month.\n\n**Pfizer Inc. (PFE)** announces positive results from its fifth Phase 3 trial of abrocitinib, evaluating the safety and efficacy across different dosing regimes for patients with atopic dermatitis. *The co. and BioNTech (BNTX)* confirmed it is to supply the EU with up to 300mln doses of its COVID vaccine, although separate reports note it could become a problem to distribute to the population due to the ultra-cold temperatures it needs to be stored at. Note, the CEO sold 132,500 shares for USD 5.56mln, roughly 62%.\n\n#OTHER\n\n\n**Alcon AG (ALC)** Q3 20 (USD): EPS 0.39 (exp. 0.22), Revenue 1.82bln (exp. 1.67bln). Not providing guidance.\n\n**Alibaba (BABA)** announced orders on its e-commerce platforms during Singles’ Day exceeded USD 56bln by Wednesday morning.\n\n**Amdocs Ltd (DOX)** Q4 20 (USD): EPS 1.23 (exp. 1.19), Revenue 1.05bln (exp. 1.03bln). Q1 21 EPS view 1.09-1.15 (exp. 1.14), revenue 1.055-1.095bln (exp. 1.06bln). FY21 EPS growth view roughly 5-9% Y/Y, revenue growth view 3.5-7.5%.\n\n**CommScope (COMM) and Nokia (NOK)** collaborate on a new interleaved passive-active antenna supporting 5G rollouts.\n\n**Datadog Inc (DDOG)** Stronger than expected quarter and guidance but misses frothy buy-side expectations. Q3 20 (USD): Adj. EPS 0.05 (exp. 0.01), Revenue 155mln (exp. 144mln). *Extends Google Cloud (GOOG)* strategic partnership into new areas. Q4 EPS view 0.01-0.02 (exp. 0.01), revenue view USD 162-164mln (exp. 155mln) FY adjusted EPS view USD 0.17-0.18 (exp. 0.12), FY revenue view USD 588-590mln (exp. 572mln).\n\n**Lyft Inc (LYFT)** Beats quarter estimates and affirms path to profitability. Q3 20 (USD): Adj. -0.89 (exp. -0.91), Revenue 0.5bln (exp. .49bln). Remains focused on achieving adj. EBITDA profitability by Q4 next year. Q3 active rides -44% to 12,513, revenue per active rider -7% to USD 39.94. Q4 revenue view +11-15 Q/Q (exp. 0.655bln).\n\n**Palo Alto Networks (PANW)** announced its intent to acquire Expanse for roughly USD 670mln in cash and stock.\n\n**Qiagen (QGEN)** is commencing its share repurchase programme which was announced in May 2019.\n\n**Rocket Companies Inc (RKT)** Q3 20 (USD): EPS 0.54 (exp. 1.09), Revenue 4.63bln (exp. 4.56bln). Q4 closed loan volume USD 88-93bln, +73-80% Y/Y.T. \n\n**Rowe Price Group (TROW)** preliminary AUM USD 1.3trln on October 31st.\n\n**Tencent Music Entertainment Group (TME)** Q3 20 (USD): EPS 0.12 (exp. 0.11), Revenue 1.12bln (exp. 1.13bln). Online music paying users +46% Y/Y to 51.7mln.",
        "subreddit": "wallstreetbets",
        "title": "A lil morning coffee",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/js96vk/a_lil_morning_coffee/",
        "created": 1605134144.0
    },
    {
        "author": "MikefromAllstate",
        "created_utc": 1606537326,
        "id": "k2h1ns",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Silicon Stocks get you Silicon Thots #qcom #amd #nvda",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k2h1ns/silicon_stocks_get_you_silicon_thots_qcom_amd_nvda/",
        "created": 1606566126.0
    },
    {
        "author": "controlsgeeek",
        "created_utc": 1605806475,
        "id": "jx6v3b",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hi All!\nI follow these stocks regularly: \nAAPL, AMZN, MSFT, NVDA, AAPL, GOOGL, QCOM, AMD, U\n\nETFs\nSPY, QQQ, ARKQ, ARKK, ICLN\n\nI started investing around 3-months ago and my main goal is long time investment. (~5% up rightnow with 3.3k invested)\n\nI was advised by many people in family to setup recurring investment and not pay much attention to it on daily basis (haven’t done that yet). I end up seeing the market 4 to 5 times a day.\n\nI had a plan of investing 50bucks every week. Should I setup recurring investment to maybe 2 stocks and split 25/25 or should I just watch market and invest it whenever it is a red day?\n\nI’m 25 and work in tech sector. So I like to follow these companies and would want to invest in them most probably.\n\nThanks",
        "subreddit": "stocks",
        "title": "Recurring Investment or wait for red day",
        "url": "https://www.reddit.com/r/stocks/comments/jx6v3b/recurring_investment_or_wait_for_red_day/",
        "created": 1605835275.0
    },
    {
        "author": "NPRjunkieDC",
        "created_utc": 1605553710,
        "id": "jvcuo6",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "These are the main players. Not part of this list but involved is QCOM\n\nRakuten Mobile has launched urban area 4G commercial services in Japan using only Open RAN technology and is now building its 5G network to O-RAN specifications\n\nDISH is prepping a major Open RAN network build in the US.\n\nTelefónica has already invested in Open RAN networks in Latin America and is planning significant investments in Europe too in the coming years, with pilots in Germany, Spain and the UK (as well as Brazil) in the coming months with the “intention… to ramp up towards thousands of nodes in these markets,” wrote the operator’s CTO Enrique Blanco in this recent blog, adding that “the ambition is for open RAN to reach up to 50% of the 4G and 5G RAN growth between 2022 and 2025.”\n\nDeutsche Telekom is collaborating with VMware and Intel on the development of an open virtual RAN platform.\n\nVodafone is on course for a rural Open RAN deployment in 2021 and an urban deployment in 2022 and has an Open RAN-based 4G site up and running in the UK with Mavenir as a key technology partner.\n\nOrange is putting Open RAN to work with Parallel Wireless in Africa ahead of other markets.\n\nTurkcell is working with Mavenir on its Open RAN deployment. \n\n\nhttps://www.telecomtv.com/content/open-ran/why-open-ran-is-just-too-hot-to-ignore-39620/",
        "subreddit": "stocks",
        "title": "Is anyone investing in companies making Open RAN 5G happen ?",
        "url": "https://www.reddit.com/r/stocks/comments/jvcuo6/is_anyone_investing_in_companies_making_open_ran/",
        "created": 1605582510.0
    },
    {
        "author": "Virtual_Tank",
        "created_utc": 1605479077,
        "id": "juuwft",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "i believe that it is inevitable that VR and mobile will take over more and more of our lives, therefore the companies that manufacture these devices (like the oculus Quest's snapdragon processor by Qualcomm) will increase dramatically in value over the next decades. \n\nis anyone aware of ETFs or some smaller cap companies like qualcomm that fit this emerging space? or do you believe larger companies like NVIDIA, AMD, and facebook will dominate this space? thanks",
        "subreddit": "investing",
        "title": "companies like qualcomm or VR/mobile ETF?",
        "url": "https://www.reddit.com/r/investing/comments/juuwft/companies_like_qualcomm_or_vrmobile_etf/",
        "created": 1605507877.0
    },
    {
        "author": "FinishRegular1623",
        "created_utc": 1605339915,
        "id": "jtybfj",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I've been reading quite a bit about how apple is meant to be developing their own 5g chips for iPhone as of 2022 I believe?\n\nHow much of a risk is this for qualcomm stocks? They're undoubtly the current 5g leader for this sector but will it be derailed once apple no longer requires them?",
        "subreddit": "stocks",
        "title": "Qualcomm risky because of apple?",
        "url": "https://www.reddit.com/r/stocks/comments/jtybfj/qualcomm_risky_because_of_apple/",
        "created": 1605368715.0
    },
    {
        "author": "JRshoe1997",
        "created_utc": 1606322502,
        "id": "k0vjwt",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\nWas curious on what are peoples opinions on this stock. It seems kinda of underrated atm and everyone I talk to loves the stock and says its great. QCOM smashed its earnings and the stock has been growing for quite awhile. Was curious on peoples thoughts on it and if you don’t like it than why don’t you like it. Thank you for your thoughts.",
        "subreddit": "stocks",
        "title": "QCOM?",
        "url": "https://www.reddit.com/r/stocks/comments/k0vjwt/qcom/",
        "created": 1606351302.0
    },
    {
        "author": "The0Walrus",
        "created_utc": 1606360854,
        "id": "k17bvh",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I wanted to diversify a bit more and get into stocks that are involved in 5G technology and also semiconductors. I was reading they invested a lot into 5G. How is this company compared to many other 5G techs? How is Marvell or Skyworks when it comes to semiconductors? Thanks!",
        "subreddit": "stocks",
        "title": "What's is the general consensus on Qualcomm?",
        "url": "https://www.reddit.com/r/stocks/comments/k17bvh/whats_is_the_general_consensus_on_qualcomm/",
        "created": 1606389654.0
    },
    {
        "author": "TangerIl",
        "created_utc": 1606046335,
        "id": "jyujt5",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Warning: Post contains voodoo and magic line faggotry. Not Safe For Retards\n\nSo I was bored. Wife is out with her boyfriend, Cyberpunk was supposed to be out, NNN means I can't pull out my JPOW anime body pillow, etc. So with nothing to do and TSLA memes still fresh in the one crease on my silky smooth brain, I decided to read up on the dark arts (Investopedia) and this is what I unveiled.\n\nAAPL is the next TSLA.\n\nTSLA blasted off Monday after hours into new atmospheric highs. Could the voodoo have predicted this? Well let's take a [look](https://imgur.com/a/kHx0SI4). Tesla was consolidating within a pennant. Low [ADX](https://www.investopedia.com/articles/trading/07/adx-trend-indicator.asp) (lack of clear trend) and low implied volatility also suggested Tesla was laying dormant and ready to erupt. Volume was declining since the September highs verifying bullish consolidation. During the days before takeoff, volume was dead quiet, as quiet as it was in July, where it also consolidated within a astrology triangle before a bullish breakout. Then Elon launched astronauts to the ISS on Sunday, stockholders to the moon on Monday, and call holders to Mars on Tuesday. The green dildo volume spikes this week confirmed the breakout. The rise in ADX and IV confirmed this as well. Finally, [Andrew's Pitchfork](https://www.investopedia.com/articles/forex/05/andrewspitchfork.asp) (pink lines) is valid due to multiple reactions on the median and bottom line, which some autist named Andrew claims price will have an 80% chance of reaching the median of the pitchfork. In short, more magic lines screaming TSLA is going bigly up. \n\n\"Oh look now you bring up this hocus pocus bullshit after its muuned. Your retard ass could only stitch this mumbo jimbo wizardry together after the breakout.\" \n\n\"If this is legit, then why the fuck didn't you say anything earlier - you busy sucking dicks at the gloryhole?\" (they meet COVID safety standards btw)\n\n\"This is bullshit, if you knew this where are your gains? You don't earn enough flipping burgers to where you can't afford a tier 3 Pokimane sub and TSLA fds?\n\n\"This is a waste of time, you're such a gay cucktard that you make the bull on Wall Street, who's had its balls fondled everyday for decades look straight.\"\n\nOnly one of these is true. And is why I present to you all 🍎.\n\nApple is the girl you start dating, where after a few dates you find out she has a twin. Damn two hot girls that look exactly alike? You're a lucky man you think in your head. Then she takes you to her home for Thanksgiving and there you meet her sister, a celebrity. Her name's Tesla and she is S3XY. However, she doesn't look like the sister you're dating. She is the hottest girl you've seen and with curves all in the right places; it is no wonder why her assets bring her a massive cult following. This is when you realized you dated the wrong sister. But it's not like Apple isn't hot. Tesla is way out of your league anyways. With her beauty (stock) reaching new all time highs and her fame (IV) skyrocketing, perhaps you shouldn't chase. After all [Apple](https://imgur.com/a/bt0mJC6) is still hot right? They are twins and share similar features. \n\nApple is consolidating in a pennant. AAPL has declining volume since the September highs confirming bullish consolidation. ADX is low as well as IV. Low IV is when options (calls and puts) are typically cheap, so preferably you want to be on the buy side of option premium. Volume last week was noticeably silent marking some of the lowest traded volume this year. Simply put, AAPL looks just like TSLA two weeks ago, ready to go bigly up or bigly down.\n\nLet me tell you why Tim Apple is most likely polishing his rocket and not his drill. First, declining volume displays bullish consolidation. Second, AAPL has a valid Andrew's Pitchfork with reactions on the median and lower bound, so it has a higher likelihood of reaching the median. Third, the QQQ will print a new all time high. If SPY and IWM have printed a new all time high, whats the likelihood the monster that is Tech (up 36% YTD) would not go past its September high? Already large holdings in the Nasdaq are past the September high. For example, QCOM and particularly GOOGL. If Google can do it, why can't the rest of FANG?\n\n\"I'm scared. There's an autist here spewing shit about demonic triangles and pitchforks. All of a sudden dude starts a creepy cringe tandem about twin girls. This dipshit probably summoned a succubus with his voodoo bullshit, and gave up his soul for this DD\"\n\nShrooms are fucking amazing.\n\nBack to the topic. Don't forget Tim Apple and Papa Musk are basically [butt buddies](https://oracleoftime.com/wp-content/uploads/2018/07/Elon-Musk-vs-Tim-Cook-2.jpg). When Apple said they were gonna split their stock this summer, who decided to throw his own tendie party weeks later? Now that Tesla is leaving the atmosphere to Mars, do you think Tim Apple will want to miss out?\n\n\"What will be the catalyst?\" Fuck would I know what Tim Apple is cooking. But this voodoo astrology can smell the tendies he's about to serve.\n\n\"But but the rising cases, the winter lock down, the fundament-\" Shut the fuck up. When was the last time fundamentals mattered? You gay bears like it up the ass so much, you fur fags can't shut up. Fuck the news, we'll only crash if JPOW runs out of ink and we have another liquidity crisis.\n\nI can't guarantee AAPL will be as explosive as TSLA. It's already a 2 trillion dollar company. I can't guarantee AAPL will even go up. This post is simply an argument why it is probable it will muun. But with 3 months of consolidation and eerily silent volume, Apple is gearing up for a big move that will move the markets with it.\n\nIf you actually got this far (wtf?), thank you for letting me waste your time. \n \nPositions: Well I'm fucking balls deep in GME, so this is all I could cough up. AAPL 11/27 125C. Will probably go for December/January expirations once I can get another paycheck from Wendy's.\n\nTL;DR: Yall autists clambering about those commie ass EVs being the next Tesla are missing the iRocket Tim Apple is building to join Elon on Mars. Buy calls. Or just do what you want. At the end of the day it's just magic lines right? It's fugazi. It's a whazy. It's a woozie. It's fairy dust.",
        "subreddit": "wallstreetbets",
        "title": "Yall sleeping on Tim Apple - the next Tesla",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jyujt5/yall_sleeping_on_tim_apple_the_next_tesla/",
        "created": 1606075135.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1604525766,
        "id": "jo5jo0",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/11/04/qualcomm-qcom-earnings-q4-2020.html\n\nEarnings: $1.45 per share (adjusted) vs. $1.17 estimated\n\nRevenue: $6.5 billion (adjusted) vs $5.93 billion estimated\n\nQualcomm provided guidance for its fiscal first-quarter ending in December. It said that it expected revenue between $7.8 billion and $8.6 billion, and adjusted EPS between $1.95 and $2.15.",
        "subreddit": "stocks",
        "title": "Qualcomm soars after sales and earnings beat expectations",
        "url": "https://www.reddit.com/r/stocks/comments/jo5jo0/qualcomm_soars_after_sales_and_earnings_beat/",
        "created": 1604554566.0
    },
    {
        "author": "p_giggles",
        "created_utc": 1605883301,
        "id": "jxq70u",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Sorry if questions like this aren't allowed but something I noticed a few times this year is that some companies are announcing note exchanges where if an investor chooses to exchange it, they receive a virtually identical note, but the new one is registered under Securities Act of 1933, whereas the previous notes were exempt. If you need an example, Qualcomm announced an exchange this morning and I believe Qorvo announced one 3-6 months ago. \n\nWhy would a company do this? Does having the note registered w/ the SEC allow more funds to invest in it (e.g. Corporate bond funds with stricter requirements)? \n\nHappy Friday!",
        "subreddit": "SecurityAnalysis",
        "title": "Companies exchanging notes for identical notes registered under 1933 act?",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/jxq70u/companies_exchanging_notes_for_identical_notes/",
        "created": 1605912101.0
    },
    {
        "author": "ntrsfrml",
        "created_utc": 1605386824,
        "id": "ju906f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Qualcomm Inc on Friday received a license from the U.S. government to sell 4G mobile phone chips to China’s Huawei Technologies Co Ltd, an exemption to U.S. trade restrictions imposed amid rising tensions with China.\n\n“We received a license for a number of products, which includes some 4G products,” a Qualcomm spokeswoman told Reuters.\n\nThe spokeswoman declined to comment on the specific 4G products Qualcomm can sell to Huawei but said they were related to mobile devices. Qualcomm has other license applications pending with the U.S. government, she said.\n\n[Reuters ](https://www.reuters.com/article/us-qualcomm-huawei-tech-idUKKBN27U0KO)",
        "subreddit": "stocks",
        "title": "Qualcomm receives U.S. permission to sell 4G chips to Huawei in exception to ban",
        "url": "https://www.reddit.com/r/stocks/comments/ju906f/qualcomm_receives_us_permission_to_sell_4g_chips/",
        "created": 1605415624.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1604922618,
        "id": "jqw8n4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Hey everyone and Welcome I am going to talk about what is going to happen in the economy next what are the positives we can expect and what are the negatives and how this affects the stock market**\n\nSo the stock market and economy seems to love the fact that Biden has won the election and that the Government will likely be split with the Democrats holding the House and the Republicans holding the Senate. The fight for the senate is not over as there will be 2 important elections in early-January to decide this. Even if both the seats are won by the democrats, that would result in a tie which would then be decided by the Vice Kamala Harris but people are not talking about the filibuster problem.\n\nThe filibuster is a political procedure where members debate a proposed legislation act to delay it as long as possible and this is sometimes called as „talking a bill to death”  \n\nFor debates to end there is still a 60% majority vote required for the talks to end,so i believe there is no immiment danger for any tax raises or something landscape shatering to happen. \n\nThe only thing that Democrats can do in Senate without this problem is appoint executive branch nominations, federal judicial appoiments and as of 2017 they can also decide on Supreme Court nominations.\n\nSo any imminent tax raises or any other more radical decisions that would affect the stock market are very unlikely.  [NEWS](https://ibb.co/JQTTXPk)\n\nInvestors that didn’t but the money yet into the stock market last week seem to be jumping on the train, as the volume had been relativley low in the past weeks as there was bigger uncertanty around this may lead to some testing of the all time higs in the SP &amp; Nasdaq and we may even make some highs soon.[PRE-MARKET FUTURES](https://ibb.co/NLPDHdX) \n\nBiden is expected to reach out to both Republicans and Democrats to discuss a new stimulus bill, in case there isn’t one until he becomes president in January, there surely will be some kind of relief to start 2021 [https://ibb.co/ThSJ9Ww](https://ibb.co/ThSJ9Ww)\n\nThe stocks have opened higher in pre-market as this may less volatility and more confidence in the economy as well as the stock market. [NEWS](https://ibb.co/vB7jQH4)  [NEWS](https://ibb.co/ThSJ9Ww)\n\n[NASDAQ FUTURES](https://ibb.co/L8c1sg2) | [SP FUTURES](https://ibb.co/D8qnrg5) | [DOW FUTURES](https://ibb.co/zR2qgZD)\n\nOne thing that can take the stock market even higher is that the dollar is expected to weakean even more with additional money being pumped in by the FED and an eventual stimulus bill. [NEWS](https://ibb.co/1Rq02s2) [NEWS](https://ibb.co/jVrBNhy)\n\nSo the biggest Positive Catalysts comming are Split Government, a future Economic Stimulus, vaccine and treatmend advancments use and aprovment while the only negative catalyst remaining is the pandemic which is temporary while there may be some volatility that has been delayed from the election to the Senate races. [NEWS](https://ibb.co/2vMq96s)\n\nA couple of things about my portofolio is that Today i went and placed a couple of orders after depositing money in my trading account and i will increase my positions in Qualcomm and Pinterest as i really like the companies as well as opening a couple of new positions like Thermo Fisher, Nike and DraftKings and i also went i placed some orders that i regret not buying earlier but i didn’t have the funds necessary available like SunRun, First Solar and Aphria as they seem to have exploded pre-market already.\n\nThank you everyone for reading! Be sure to leave a comment down below!\n\n Have a great day and see you next time!",
        "subreddit": "StockMarket",
        "title": "Quick update| stock market news |Stocks buy today [11-9-2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/jqw8n4/quick_update_stock_market_news_stocks_buy_today/",
        "created": 1604951418.0
    },
    {
        "author": "juandixon",
        "created_utc": 1606158341,
        "id": "jzo26j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "thoughts on QCOM calls? 5g 2021?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jzo26j/thoughts_on_qcom_calls_5g_2021/",
        "created": 1606187141.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1604922597,
        "id": "jqw8hq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey everyone and Welcome I am going to talk about what is going to happen in the economy next what are the positives we can expect and what are the negatives and how this affects the stock market\n\nSo the stock market and economy seems to love the fact that Biden has won the election and that the Government will likely be split with the Democrats holding the House and the Republicans holding the Senate. The fight for the senate is not over as there will be 2 important elections in early-January to decide this. Even if both the seats are won by the democrats, that would result in a tie which would then be decided by the Vice Kamala Harris but people are not talking about the filibuster problem.\n\nThe filibuster is a political procedure where members debate a proposed legislation act to delay it as long as possible and this is sometimes called as „talking a bill to death”  \n\nFor debates to end there is still a 60% majority vote required for the talks to end,so i believe there is no immiment danger for any tax raises or something landscape shatering to happen. \n\nThe only thing that Democrats can do in Senate without this problem is appoint executive branch nominations, federal judicial appoiments and as of 2017 they can also decide on Supreme Court nominations.\n\nSo any imminent tax raises or any other more radical decisions that would affect the stock market are very unlikely.  [NEWS](https://ibb.co/JQTTXPk)\n\nInvestors that didn’t but the money yet into the stock market last week seem to be jumping on the train, as the volume had been relativley low in the past weeks as there was bigger uncertanty around this may lead to some testing of the all time higs in the SP &amp; Nasdaq and we may even make some highs soon.[PRE-MARKET FUTURES](https://ibb.co/NLPDHdX) \n\nBiden is expected to reach out to both Republicans and Democrats to discuss a new stimulus bill, in case there isn’t one until he becomes president in January, there surely will be some kind of relief to start 2021 [https://ibb.co/ThSJ9Ww](https://ibb.co/ThSJ9Ww)\n\nThe stocks have opened higher in pre-market as this may less volatility and more confidence in the economy as well as the stock market. [NEWS](https://ibb.co/vB7jQH4)  [NEWS](https://ibb.co/ThSJ9Ww)\n\n[NASDAQ FUTURES](https://ibb.co/L8c1sg2) | [SP FUTURES](https://ibb.co/D8qnrg5) | [DOW FUTURES](https://ibb.co/zR2qgZD)\n\nOne thing that can take the stock market even higher is that the dollar is expected to weakean even more with additional money being pumped in by the FED and an eventual stimulus bill. [NEWS](https://ibb.co/1Rq02s2) [NEWS](https://ibb.co/jVrBNhy)\n\nSo the biggest Positive Catalysts comming are Split Government, a future Economic Stimulus, vaccine and treatmend advancments use and aprovment while the only negative catalyst remaining is the pandemic which is temporary while there may be some volatility that has been delayed from the election to the Senate races. [NEWS](https://ibb.co/2vMq96s)\n\nA couple of things about my portofolio is that Today i went and placed a couple of orders after depositing money in my trading account and i will increase my positions in Qualcomm and Pinterest as i really like the companies as well as opening a couple of new positions like Thermo Fisher, Nike and DraftKings and i also went i placed some orders that i regret not buying earlier but i didn’t have the funds necessary available like SunRun, First Solar and Aphria as they seem to have exploded pre-market already.\n\nThank you everyone for reading! Be sure to leave a comment down below!\n\n Have a great day and see you next time!",
        "subreddit": "stocks",
        "title": "Quick update| stock market news |Stocks buy today [11-9-2020]",
        "url": "https://www.reddit.com/r/stocks/comments/jqw8hq/quick_update_stock_market_news_stocks_buy_today/",
        "created": 1604951397.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1606431297,
        "id": "k1pahh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**In this post I am going to share my experience as I start a new portfolio from 0$ and keep adding funds to it every month as I try to grow it as fast as possible**\n\nHey everyone Happy Thanksgiving and Welcome! So, I have deposited and invested in the stock market all the money I managed to save up in the last month as I deposited 3500$ in my eToro portfolio on the 12th of November and I am already up more than 7% in just two weeks. \n\nAs my portfolio has constantly outperform the big 3 indexes the Nasdaq100, the SP500 and the Dow Jones 30 almost every day since starting my portfolio. Here is a comparison of my portfolio vs the indexes since starting as I am up over 7%. [Portfolio v Index](https://ibb.co/pRnQLQf)\n\nSo i wondered? Is it really bad to own more stocks? Is less &gt; more? What is your opinion on this subject? I believe that it is way better to be invested in more companies and to add and grow your position in time as you also see how the companies evolve and you can also do some price averaging.\n\nSo here is my current portfolio composition as I split all my money equally to start, I will go into very few little details about everyone so I don’t make this a 2 hour read time.\n\nI will start now by going alphabetically and not in the most important order as the first company that I own is BYD which is a rival company for both Tesla and NIO in the EV market as they focus on cars, new energy solutions and electronics. They are also developing a lot of commercial EV like buses, coaches and taxis which will be a great addressable market for them as they are not rivaled in those segments at the moment. The company has gone up a lot in value this year as you can see in this graph and have a Forward P/E of more than 100 but I believe this company will greatly expand its sales and be one of the leaders in the segment especially in China which is the biggest EV market. [https://ibb.co/gVVwpfR](https://ibb.co/gVVwpfR) / [https://ibb.co/z7YBGr9](https://ibb.co/z7YBGr9)\n\nThe second holding is Apple, is there anybody that doesn’t know this company? They are the biggest company in the world and they continue to expand with new products and services every day, I don’t see this company going down in the short term or the long term as they have pretty expensive at a 35 P/E but earnings are still rising especially with more subscription based income coming in with the release of the Apple One Bundle. [https://ibb.co/Tm3hWMZ](https://ibb.co/Tm3hWMZ) / [https://ibb.co/Q9YjJTx](https://ibb.co/Q9YjJTx) / [https://ibb.co/BrzkHCY](https://ibb.co/BrzkHCY)\n\nAbbVie is a health company that produces a lot of great drugs and has more than 26 million patients in over 200 countries that are treated every year. They are one of the best companies in the sector and are still down about 25% from the all time highs while only trading at a forward P/E of 8 which is very low. [https://ibb.co/9nn4z0q](https://ibb.co/9nn4z0q) / [https://ibb.co/mXh3JL5](https://ibb.co/mXh3JL5) / [https://ibb.co/cwhJgB5](https://ibb.co/cwhJgB5)\n\nAMD is a well established companies that creates high performance GPU’s for both personal computer and for data centers, the company has turned around and have started a great path to success since the newest CEO took the job in 2014 as the stock was trading at 2$ and while the company is trading at a very high forward P/E they have a lot of room to grow in this new economy as the EPS is expected to increase by more than 40% quarter over quarter [https://ibb.co/dpwYPcy](https://ibb.co/dpwYPcy) / [https://ibb.co/7vwWHtC](https://ibb.co/7vwWHtC) / [https://ibb.co/yF0RmQv](https://ibb.co/yF0RmQv)\n\nAmazon is the internet retail juggernaut and cloud servicing company that has also started to expand in more and more domains like pharmacy just last week, though the company is also trading at a very high PE they have a lot of room to grow internationally and also are expanding in a lot more domains at a very fast rate. [https://ibb.co/4TnGhkt](https://ibb.co/4TnGhkt) / [https://ibb.co/c6W2Ypx](https://ibb.co/c6W2Ypx)\n\nAphria is a Canadian company that mainly grows cannabis for medical use but has recently acquired a beverage company and is look to expand its product line, especially with the legalizing of marijuana more and more obvious in the US. They are one of the companies that stands to benefit the most from this as they are also expected to be the first to reach profitability by next year compared to Aurrora Canabis and Cannopy Growth. [https://ibb.co/KrfL267](https://ibb.co/KrfL267) / [https://ibb.co/kJ8yxDR](https://ibb.co/kJ8yxDR)\n\nBroadcom is one of the biggest American semiconductor solutions provider, they are a very good play for the sector as they only trade at a forwarde P/E of 17 which is very good compared to comptetitors. [https://ibb.co/8KFmX88](https://ibb.co/8KFmX88) / [https://ibb.co/q18SzPb](https://ibb.co/q18SzPb)\n\nEveryone also knows Boeing as they are one of the biggest commercial manufacturers of jetliners, defence, space and security systems. The have suffered a lot in the last 2 years after the 737 accidents and the recent stay-at-home economy, but the ban on the plain has been lifted in the US and will be followed by the European Union soon, they have a big backlog of planes to work through while this situation will improve and air travel returns slowly in the next years. [https://ibb.co/JxZYZ6D](https://ibb.co/JxZYZ6D) / [https://ibb.co/NVbhDLQ](https://ibb.co/NVbhDLQ)\n\nAlibaba is a online e-commerce giant that has expanded into cloud computing services also and stands to benefit a lot from the stay-at-home economy while also having just a forward PE of 32 which is very low compared to Amazon as they are the Chinese version of them. The company also owns Ant Group which is one of the largest fin tech companies in the world and will likely gain a lot after they finally manage to go public. [https://ibb.co/0JPN6DN](https://ibb.co/0JPN6DN) / [https://ibb.co/6NgjGNV](https://ibb.co/6NgjGNV) / \n\nBerkshire is the child company of Warren Buffet as they are a holding company that engages in diversified business like technology, banks, insurance and much more. The company is currently trading at a very low P/E an barely above the price/book value as even the founders of the company believe this as they have continued to buy back shares of the company in the last year at the fastest rate in company history. [https://ibb.co/bP6VjpM](https://ibb.co/bP6VjpM) / [https://ibb.co/hf5hX39](https://ibb.co/hf5hX39)\n\nCaterpillar is one of best companies in manufacturing, construction and mining equipment. They are trading at almost 3 time sales with a high P/E but this is likely to regain momentum with the China trade war relaxing with the new Biden administration as well as the reopening of the economy [https://ibb.co/pnC17PM](https://ibb.co/pnC17PM) / [https://ibb.co/2vsQSjt](https://ibb.co/2vsQSjt)\n\nChipotle Mexican is one of the best companies right now in the fast food business as they continue to innovate and have just opened they’re first digital only store. The company is trading at a very high P/E but has substantial growth potential so I believe it will be a great buy for the future. [https://ibb.co/GCqd3Y9](https://ibb.co/GCqd3Y9) / [https://ibb.co/JnBm3bx](https://ibb.co/JnBm3bx)\n\nCostco is one of the world biggest retailers that has a great business model as they are making most of they’re money through membership fees unlike other retailers that mostly rely on prices, the are trading at just 1 times sales which is very good and they have a lot of room to grow especially with improve China relationships. [https://ibb.co/X4M76Vd](https://ibb.co/X4M76Vd) / [https://ibb.co/ypg3Gyc](https://ibb.co/ypg3Gyc)\n\nCrowdstrike is a cyber security company that has seen a huge spike due to the transition to more and more digital presence for all the companies. They are a company that I believe is here to stay and just started to become profitable in the last quarter. [https://ibb.co/zNbfhL9](https://ibb.co/zNbfhL9) / [https://ibb.co/mBw2TKj](https://ibb.co/mBw2TKj)\n\nCarvana is one of the best players for the second hand car market as they operate a unique e-commerce platform for people to buy, sell or finance cars. They are one of my favorite companies as they are also just starting to make money as they continue to expand they’re presence. [https://ibb.co/QPZ1wnt](https://ibb.co/QPZ1wnt) /  [https://ibb.co/0rS6LrQ](https://ibb.co/0rS6LrQ)\n\nCVS is a health and pharmacy companies that owns the most pharma stores in the US, the company has been hit recently by the news that Amazon is getting into pharmacy delivery but I believe they will be a great play for the vaccine distribution play as the company is only trading at a forward P/E of 8 and is trading below value of sales while also offering a dividend of 2% [https://ibb.co/KNH6v5G](https://ibb.co/KNH6v5G) / [https://ibb.co/8Ps3QRB](https://ibb.co/8Ps3QRB)\n\nDelta is one of the major airlines in the US and as I wanted to be exposed to some recovery plays I choose this company as I believe air travel will come back in the next years. The financials are not great for the company but they did manage to cut the cash burn rate in the last quarter. [https://ibb.co/gyrSYYb](https://ibb.co/gyrSYYb) / [https://ibb.co/KsNbFHg](https://ibb.co/KsNbFHg)\n\nDeere is another great industrial and manufacturing play for the recovery stocks. The company is trading at a pretty high P/E ratio for them as the stock has runed very high in the last months but they do offer a dividend of 1% which is much better than any bank savings account and also have the potential for growth and also are a pretty reliable way to diversify portfolios. [https://ibb.co/NSsCGN1](https://ibb.co/NSsCGN1) / [https://ibb.co/thrY6W2](https://ibb.co/thrY6W2)\n\nDisney is a very diversified family friend entertainment and media company as they have a lot of great business that will benefit a lot from the re-opening while this contributed a lot to the huge expansion of the streaming business with Disney+ and Hulu so the financials are not great but I believe this will hugely improve in the next couple of years. [https://ibb.co/BG0jctn](https://ibb.co/BG0jctn) / [https://ibb.co/7GR9h3c](https://ibb.co/7GR9h3c)\n\nDraftkings is an American daily fantasy sport operator that has expanded into the huge market of online gambling as more and more us states are legalizing gambling so they have a lot of room to grow in front of them especially with a great online presence with financials not being very important at the moment as they continue to grow they’re presence [https://ibb.co/k8dtJmM](https://ibb.co/k8dtJmM) / [https://ibb.co/HgGQvG2](https://ibb.co/HgGQvG2) \n\nDominos Pizza is one of the biggest pizza companies in the world and are also one of the best in implementing they’re presence in the delivery services as they are way better at this than others companies like Papa John’s. [https://ibb.co/NZXkQjg](https://ibb.co/NZXkQjg) / [https://ibb.co/FVGXXBY](https://ibb.co/FVGXXBY)\n\nEtsy is a e-commerce platform for creative goods and services and has seen a huge rise in popularity and will probably remain a big gainer from this past year, though they are trading at over 70times earnings this will likely improve very much in the next years as they are expected to expand and improve earnings substantaly. [https://ibb.co/5MN9zb7](https://ibb.co/5MN9zb7) / [https://ibb.co/PYz0NWK](https://ibb.co/PYz0NWK)\n\nFord is one of the biggest car makers in the world, I really like this company as it having a big push to move to the EV world with the Mustang Mach E, the EV Transit and the hugely anticipated EV F-150, the company is expected to have huge improvements in the next year as they have decent financials and are one of the best companies to own for a dividend investing strategy. [https://ibb.co/MhwMB47](https://ibb.co/MhwMB47) / [https://ibb.co/745w8vq](https://ibb.co/745w8vq)\n\nFacebook is the largest social media network in the world that also owns Instagram, they have been struggling in the last months due to the political environment but I believe they will continue to be a giant in the tech sector as they are finding new ways to improve revenue streams especially in the highly active Instagram platform as they are trading at pretty much the same P/E like the other big tech companies but are expected to see a growth in advertising money as companies move to a more digital presence. [https://ibb.co/SVjFGvc](https://ibb.co/SVjFGvc) / [https://ibb.co/T1Ds8V8](https://ibb.co/T1Ds8V8)\n\nFiverr is one of the biggest marketplaces for freelance services as this kind of gigs have hugely exploded this year, the company is trading at an insane PE but we have to see what the next quarters brings to us as it may end up being a very profitable company in the future. [https://ibb.co/st03fyj](https://ibb.co/st03fyj) / [https://ibb.co/zQk3Mgp](https://ibb.co/zQk3Mgp)\n\nGeneral Elecitrc is a conglomerate that operates in many business like aviation, healthcare, renewables, digital industry finance and more, they have suffered a lot in the past decade but the CEO has managed to turn things around latetly and might put the company back on track as it is way below all time highs and even recent highs of 30$ just 4 years ago, they might get a boost from the return of the aviation business in the next years. [https://ibb.co/2nTc9mh](https://ibb.co/2nTc9mh) / [https://ibb.co/sybXXPQ](https://ibb.co/sybXXPQ)\n\nGeneral Motors is the other big Detroit giant that I own in my portfolio as I really like where the company is going with its big push in the EV market in the next couple of years, they are trading at a 19 PE and are in a very good position to keep growing. [https://ibb.co/37hqV2C](https://ibb.co/37hqV2C) / [https://ibb.co/BNp0hht](https://ibb.co/BNp0hht)\n\nBarrick Gold is one of the biggest gold and copper mining companies in the world and I use it for some hedging as I like owning this company more than I like owning gold, as this company also provides us with dividends of more than 1% while gold doesn’t [https://ibb.co/P9cVDxs](https://ibb.co/P9cVDxs) / [https://ibb.co/6tpfDtH](https://ibb.co/6tpfDtH)\n\nI don’t believe google needs any introductions as I believe they are still one of the best companies in the tech sector despite lagging the other faang companies this year but they have regained momentum in the last quarter and I believe they can be a catch up trade and a long-term investment [https://ibb.co/JRm07vw](https://ibb.co/JRm07vw) / [https://ibb.co/mT7nWC8](https://ibb.co/mT7nWC8)\n\nGoldman Sachs is a global investment bank that seems to be back on track after the company has struggled in the last couple of years and are also a great diversification play as they are trading below book value. [https://ibb.co/FqmNyFF](https://ibb.co/FqmNyFF) / [https://ibb.co/1zkLmfx](https://ibb.co/1zkLmfx)\n\nHome depot is a big retailer that has gained a lot of traction in the last year and stands to benefit in the future from the great move to online sales. The company is trading at a 25 PE but seems to be on a huge growth bath while also having a more than 2% dividend yield. [https://ibb.co/KXpDM77](https://ibb.co/KXpDM77) / [https://ibb.co/cDBxJgK](https://ibb.co/cDBxJgK)\n\nHoneywell is one of the most diversified technology and manufacturing companies in the world that stands to benefit a lot from the reopening as a lot of companies need to upgrade they’re technology systems. The company has a good dividend yield and a great profit margin. [https://ibb.co/kMxjNRz](https://ibb.co/kMxjNRz) / [https://ibb.co/TL67SRD](https://ibb.co/TL67SRD)\n\nIntuitive surgical is a global technology company for minimally invasive surgery. As this kinds of surgeries have been postponed they stand to benefit from the world getting back to normal. They have huge profit margins that can see they earnings soar in the next years. [https://ibb.co/Lz7j8td](https://ibb.co/Lz7j8td) / [https://ibb.co/kXdmzhQ](https://ibb.co/kXdmzhQ)\n\nJohnson &amp; Johnson is a great company that develops medical devices, meds and consumer goods and stat to benefit a lot if they manage to create e good vaccine. They are currently trading at a PE of 22 but have huge upside and also are a great dividend paying company. [https://ibb.co/FWXqpH2](https://ibb.co/FWXqpH2) / [https://ibb.co/c8qQXNF](https://ibb.co/c8qQXNF)\n\nJP Morgan is a global financial giant with over 3 trillion$ in assests, the company trades at about a 33% price to book overvaluation but stands to benefit a lot in the future from the huge money pumping in the economy by the FED and the return of higher interest rates. [https://ibb.co/hBvLxV5](https://ibb.co/hBvLxV5) / [https://ibb.co/Jtkn90L](https://ibb.co/Jtkn90L)\n\nCoca-Cola is another company that needs no introduction and is still a great company to own with a great dividend yield that stands to benefit from a reopening economy. [https://ibb.co/G9CmsgL](https://ibb.co/G9CmsgL) / [https://ibb.co/C2FLSGy](https://ibb.co/C2FLSGy)\n\nLemonade is a disruptive insurance company that is still expanding its markets. They have a great business strategy and can become a very big player in the industry. The company has more than double since the IPO earlier this year so I believe this can be a great long term investment. [https://ibb.co/zhjYRct](https://ibb.co/zhjYRct) / [https://ibb.co/PZ23M72](https://ibb.co/PZ23M72)\n\nLowe’s is another great retailers similar to Home Depot that has done a great job in transitioning to online sales. I really like the company as it trades at just 20 times earnings and has a great growth rate and dividend yield. [https://ibb.co/zfpyLZC](https://ibb.co/zfpyLZC) / [https://ibb.co/MfS6QNg](https://ibb.co/MfS6QNg)\n\nMcDonalds is the biggest fast food company in the world, the company has done a terrific job this year with drive thru orders and stand to benefit even more after the reopening while also having a great dividend of more than 2% and possibility of growing delivery sales even more in the future. [https://ibb.co/CBTWtJP](https://ibb.co/CBTWtJP) / [https://ibb.co/v1cBqQn](https://ibb.co/v1cBqQn)\n\nMercadolibre is a e-commerce company that is the Amazon or Alibaba of South America as they operate in a lot of sectors like cars, aircrafts, real estate and more. I believe this is a great company to own if you believe in the future of e-commerce. [https://ibb.co/McFrBhZ](https://ibb.co/McFrBhZ) / [https://ibb.co/Cw3wSSk](https://ibb.co/Cw3wSSk)\n\nIsn’t it already obvious that my portfolio must have included Microsoft also? As they are a big beneficiary of cloud services and tech evolutions. This is a staple for every portfolio with great growth and a better dividend yield than any bank can offer at the moment. [https://ibb.co/cvMm8Md](https://ibb.co/cvMm8Md) / [https://ibb.co/FnYD1Y3](https://ibb.co/FnYD1Y3)\n\nAs I want to be diversified and exposed to recovery play I also picked the cruise line that I think will do best in the long run. So though Norwegian have diluted they’re shares a lot during this year, I belive not all cruise lines will survive and they will eat up market share when everything goes back to normal. So I don’t really care about the financials that much at the moment as this is a very long term pick. [https://ibb.co/tHDcrMY](https://ibb.co/tHDcrMY) / [https://ibb.co/PTqK0dj](https://ibb.co/PTqK0dj)\n\nNext Era Energy is the largest electric utility by market cap and has the world largest generator of renewable energy from wind and sun and stand to benefit a lot from a Biden administration that is why they are trading at such high multiples at the moment. The company also has an impressive yield of almost 2% [https://ibb.co/xjYVMx4](https://ibb.co/xjYVMx4) / [https://ibb.co/q9hjp48](https://ibb.co/q9hjp48)\n\nI also bought NetFlix as I believe them, Disney and Roku will be some of the largest players in the streaming business as traditional TV and cinema are a dying business at the moment.The company is trading at a premium but this is due to them dumping money in high quality content to grow they’re subscriber base while they also have steadily increase subscriptions cost in the last years. I believe they will do better next quarter and will see a re-test of all time highs. [https://ibb.co/VN2TF6f](https://ibb.co/VN2TF6f) / [https://ibb.co/B6j9zTn](https://ibb.co/B6j9zTn)\n\nI also own NIO more as a spec play to be well diversified in the EV world, I believe this is a long term investment as the stock price has gone up like bananas recently, the company will have to have perfect growth in the next couple of years to justify an increase in value as they are still losing money. [https://ibb.co/MZ2NL4v](https://ibb.co/MZ2NL4v) / [https://ibb.co/mt8f3ZR](https://ibb.co/mt8f3ZR)\n\nNike is my favorite apparel play as I believe it is the most desired my a lot of people and keeps expanding. I really like how the company is managed and I believe in them for the long-run. [https://ibb.co/jw1zjgj](https://ibb.co/jw1zjgj) / [https://ibb.co/RYR4QSP](https://ibb.co/RYR4QSP)\n\nNvidia is my favorite play in the semiconductor sector as they will continue to benefit from more and more personal pc sales as well as huge data center demand especially for they’re super performing products. They trade at a huge premium right now but I believe they can become the next trillion dollar company in the tech sector. [https://ibb.co/kgJS0w1](https://ibb.co/kgJS0w1) / [https://ibb.co/k8D1MSL](https://ibb.co/k8D1MSL)\n\nI also like owning Pepsico alongside Coca Cola as they are the two biggest players in the sector and I believe that they will both benefit a lot in the next years from the economy recovery. With pepsico offering a 2,7% dividend and a great growth path I really like owning this stock [https://ibb.co/2SY4xPY](https://ibb.co/2SY4xPY) / [https://ibb.co/Sdt2hGC](https://ibb.co/Sdt2hGC)\n\nPinterest is an up and coming social media platform that has a great ad friendly setup and could see growth in the next years. They are trading at insane PE ratios but that should catch up to the company in the future and I believe you must own it to be well diversified. [https://ibb.co/gwGFbyb](https://ibb.co/gwGFbyb) / [https://ibb.co/5TYz4KS](https://ibb.co/5TYz4KS)\n\nPalantir is a highly controversial name right now but its products and services are really good as they are earning more and more stamps of approval with government contracts while also expanding to commercial use. Financial info is not that good as the company barely reported they’re first earnings after the IPO. [https://ibb.co/fdQ42gc](https://ibb.co/fdQ42gc) / [https://ibb.co/wyTJSG2](https://ibb.co/wyTJSG2)\n\nPayPal is another great company that will do very well in the future as payments transition to a more digital approach and the company is transitioning to allow cryptocurrencies as well which will attract even more users. They have had a greet increase in revenue and eps in the last quarters and I expect that to continue to grow. [https://ibb.co/9tXxhJZ](https://ibb.co/9tXxhJZ) / [https://ibb.co/M5vCynn](https://ibb.co/M5vCynn)\n\nQualcomm is my favorite 5G play alongside apple as this will be a long cycle of upgrades for the communications services that will benefit them a lot.They are trading at an PE of over 30 but have great revenue and EPS growth while also offering an almost 2% dividend yield. [https://ibb.co/NFsnKqW](https://ibb.co/NFsnKqW) / [https://ibb.co/x5sJLW6](https://ibb.co/x5sJLW6)\n\nRoku is a great play for the hardware and subscription based services for digital media players and has huge tailwinds that will benefit them while the old TV cycle is dying. They have had a huge year over year revenue growth and subscribers growth that has passed the 40 million mark for the first time recently. [https://ibb.co/Fqd7sYP](https://ibb.co/Fqd7sYP) / [https://ibb.co/ccKqzkC](https://ibb.co/ccKqzkC)\n\nWhile SunRun is another great play for the new Biden administration as well as the transitioning to more renewable energy as they may see a huge boost in revenue growth and earnings with more money being pumped into the renewable sector. [https://ibb.co/0jr3TRg](https://ibb.co/0jr3TRg) / [https://ibb.co/NmdSdwP](https://ibb.co/NmdSdwP)\n\nEveryone also knows Starbucks, as I expect them to be a huge gainer on a improved US-China relationship so despite suffering a lot from this economy the stock is still up more than 16% in the last year while revenues have declined, expect this to bounce back by 2021-2022. [https://ibb.co/s5nTzQX](https://ibb.co/s5nTzQX) / [https://ibb.co/fDyhvX3](https://ibb.co/fDyhvX3)\n\nShopify is a multinational e-commerce cloud based platform for merchants like small and medium sized business so that can easily have an online store that they can manage payments for, orders inventory and much more. The company is trading at P/E’s that are crazy but the revenue and EPS growth is also amazing and has the potential for a lot more growth as the world is going more and more digital. [https://ibb.co/6nt4GhC](https://ibb.co/6nt4GhC) / [https://ibb.co/QbFhybt](https://ibb.co/QbFhybt)\n\nStore capital is a real estate investment trust that focuses on single tenant commercial real estate so they can negotiate much better rents and collections than other REIT. They are still more than 8$ under the highs and are a great diversification and yield giving stock to own. [https://ibb.co/XzBY41g](https://ibb.co/XzBY41g) / [https://ibb.co/TrGRZpR](https://ibb.co/TrGRZpR)\n\nAT&amp;T is one of the largest providers in the us and seems to be getting back on track after they have struggled in the past decade, they trade at only 8 times forward P/E and have one of the best dividend yields at more than 7% so I believe this is a must have staple in your portfolio that brings stability and cash flow. [https://ibb.co/cYcfYMm](https://ibb.co/cYcfYMm) / [https://ibb.co/8D3NzZr](https://ibb.co/8D3NzZr)\n\nWhile Target has been doing some amazing things as they operate as a general merchandise retailers and are doing some amazing things with online sales, they currently have seen a spike in the last months and are trading at a p/e of over 22 but I see them as a long term winner that offers both growth and value with a dividend yield of 1,5%. [https://ibb.co/Fzd8TMw](https://ibb.co/Fzd8TMw) / [https://ibb.co/NLnw4Lv](https://ibb.co/NLnw4Lv)\n\nWhile the other communication provider that I like is T-Mobile US which has seen a huge spike in user growth and are poised to do a lot of great things with the 5G cycle, they trade at a very high multiple for this sector but the growth expectations are huge for this company. [https://ibb.co/PCDFD38](https://ibb.co/PCDFD38) / [https://ibb.co/BTSzTMp](https://ibb.co/BTSzTMp)\n\nMoving on, one of the biggest gainers this year, TESLA is also one of my favorite companies to own as they continue to expand the products they offer and improve margins on vehicle, they are also expanding into more and more services, while manufacturing is growing exponentialy. They trade at insane P/E’s but they have just managed to be included in the SP500 so this may bring some stability to the stock as the company continues to grow in the next decade.[https://ibb.co/6rNJf6q](https://ibb.co/6rNJf6q) / [https://ibb.co/CWN6wD4](https://ibb.co/CWN6wD4)\n\nVisa is the biggest global payments technology company and is expected to continue to grow as more people start using cashless payment options, they are a great growth and value company for the future as cash payments is a dying proposition worldwide. [https://ibb.co/CVXgZD9](https://ibb.co/CVXgZD9) / [https://ibb.co/BPKxFfZ](https://ibb.co/BPKxFfZ)\n\nWal-Mart, the biggest employer in the US continues to do amazing stuff as they continue to expand they’re online presence and compete with Amazon as they trade at a 23 P/E and also offer a dividend yield. they are a great play alongside with Amazon which trades at much higher valuations. [https://ibb.co/Sr9s83J](https://ibb.co/Sr9s83J) / [https://ibb.co/0CvZKkD](https://ibb.co/0CvZKkD)\n\nWynn is another great recovery stock that I like as recently we found out that foot traffic in Macau has ramped up, this bolds well for the company as they will be one of the biggest gainers on the reopening. So if you are a long term investor you should get into this stock I believe. [https://ibb.co/6rk2qNQ](https://ibb.co/6rk2qNQ) / [https://ibb.co/mC35VPr](https://ibb.co/mC35VPr)\n\nZoom is the one company that I will be selling in the next couple of days. I know they are one of the best video conferencing apps out there, but I believe they will have a lot of problem due to a number of free apps that also offer great quality while the company is trading at insane p/e numbers. I know this trend is here to stay, but I thing there are far better play in the stock market out there rather than Zoom at this price point.  [https://ibb.co/T1tStb8](https://ibb.co/T1tStb8) / [https://ibb.co/rmxh0x3](https://ibb.co/rmxh0x3)\n\nI know I didn’t get into in-depth stuff, technical analysis, fundamentals and more but I will continue go more in depth with this stocks as time goes on. \n\nSo here how I want to make my portfolio look like when I have enough money to open all the positions. [TARGETED PORTFOLIo](https://ibb.co/CHWsb27)\n\nAs you can see a quarter of my portfolio will be invested in high quality companies that are pretty safe in my opinion. While over 45% of the portfolio will go to companies that I really like, that have a pretty low risk in my opinion and can offer great returns in the future. While I will also use about 22% of my portfolio into more risky companies that can bring very good profits for the portfolio but in my opinion are not as safe as the others. \n\nAnd finally I will invest about 7% of my portfolio into more speculative stocks or hedge stocks like Barrick Gold and Goldman Sachs. I don’t want to keep money on the sidelines at the moment as I expect the stock market will keep rising for a couple of years at a rapid pace due to the recovery of the economy.\n\nThank you everyone for reading! Hope you enjoyed the content!\n\nBe sure to leave a comment down below with your opinion on the matter of more or less stocks and other thoughts on the stock market!\n\nHave a great Thanksgiving and see you next time!",
        "subreddit": "StockMarket",
        "title": "Is to much diversification bad? Are less stocks more profitable? Starting a new portfolio",
        "url": "https://www.reddit.com/r/StockMarket/comments/k1pahh/is_to_much_diversification_bad_are_less_stocks/",
        "created": 1606460097.0
    },
    {
        "author": "UnderdogFinance",
        "created_utc": 1604427900,
        "id": "jnfqct",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Telecom Stocks Earnings Roster for Nov 4: QCOM, QRVO &amp; ACIA",
        "url": "https://finance.yahoo.com/news/telecom-stocks-earnings-roster-nov-150803804.html",
        "created": 1604456700.0
    },
    {
        "author": "NPRjunkieDC",
        "created_utc": 1605122396,
        "id": "jsenp7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With the Huawei debacle the only other alternative for 5G would be with Nokia + Ericsson. This solution has problems so an alternative technology is combining Open RAN with network virtualization. \n\nhttps://www.reuters.com/article/us-dish-network-qualcomm-idUSKBN27R1MO",
        "subreddit": "stocks",
        "title": "The new 5G technology OPEN RAN (Radio access network)",
        "url": "https://www.reddit.com/r/stocks/comments/jsenp7/the_new_5g_technology_open_ran_radio_access/",
        "created": 1605151196.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1605528410,
        "id": "jv5ork",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**In this post we’ll talk about what happened last week in the stock market and what to expect this week as earnings season is coming to an end**\n\n[THUMB](https://ibb.co/j64rkG0)\n\nHey everyone and Welcome, so let’s start with a recap of Friday’s movements in the stock market and what happened last week as we saw the Dow finishing Friday up 1,37% [CHART](https://ibb.co/HHPdbR9), the S&amp;P500 up almost the same while closing at a record level for the index [CHART](https://ibb.co/HTG25s0) and the Nasdaq composite being up just over 1% [CHART](https://ibb.co/274Gq6g).\n\nAlmost 80% of companies were advancing on Friday as the stock market finished the week strong with an almost 90% ratio of new highs vs lows but the volume was way below average on Friday as most investors finished restructuring they’re portfolios in the early part of the week after the Vaccine news [CHART](https://ibb.co/sbn5dWp).\n\nAlso this week we saw the largest ever global equity inflow as you can see in this Bank of American chart as there were over 40 billion dollars being pushed in equities. [CHART](https://ibb.co/18g7xrJ)\n\nAll sectors finished in the green on Friday with real estate, energy and industrial leading the way with all 3 sectors having more than 50% of companies up over 2%, even tech kept up the pace after leading us through this recovery with over 37% of companies being up more than 2% on the day.\n\nWe also saw small-cap and value plays outperform again as people are betting that the economy will have a broader breadth of recovery after the vaccine will be available. [CHART](https://ibb.co/jTMx5ry)\n\nThe VIX also finished the week very strong as it continued to decline to it’s lowest level, ending the week at the 23 level. [CHART](https://ibb.co/j4057B8)\n\nAs you can see in both the SP500 heat map [CHART](https://ibb.co/dW01vyR) and the world heat map  [CHART](https://ibb.co/G2Fvk7c) almost all companies were in the green on Friday with a few exceptions like Nvidia, NetFlix and Alibaba, as they were punished a little after the huge run they in the last 9 months while Alibaba continues to struggle with the Chinese government.\n\nThe COVID-19 numbers are dangerously going up as you can see, with daily cases going parabolic, indeed with a bigger number of tests being taken but there is still a huge rise in positivity rate, and as you can see this is the 3rd hump of the pandemic in terms of numbers of hospitalized people. The one positive thing for the moment is that deaths haven’t gone up as much due to the better treatment but this number does usually trail the others so we will have to see what happens in the next weeks. [CHART](https://ibb.co/wdSTt4v)\n\nHere you can see better that weekly test are up almost 10% while weekly cases have gone up 4times that much almost at a 40% growth rate while the hospitalized and deaths have not increased as much as the cases yet. [CHART](https://ibb.co/QpzPbs8)\n\nThis weeks interesting earnings [EARNINGS](https://ibb.co/K5bMM4B) in my opinion will come from Walmart and Home Depot before the open on Tuesday as I expect both of them to dazzle in the earnings reports, while Walmart is expected to have an EPS of 1$ and 19 cents I expect them to be around 1,5$ at least like last quarter while Home depot is expected to have an EPS of just over 3$ I expect that to be at least 30cents to half a $ better then expected also as the companies look to continue the amazing earnings season that is mostly ending this week as we saw an overwhelming number of companies beating the estimates by quite a gap.\n\nThis will be followed after the close with the Concept company NIO which has been going up amazingly in the last weeks as it has touched even 54$ but has since seen a pullback of almost 10$, so be careful when trading this, it may be a bumpy ride as the company is still losing money and seeking to increase manufacturing and sales, as I don’t see them having to much of a success in Europe even if the manage to launch they’re cars there, this because people will have a stigma for the company as being Chinese, and not offering great quality. Despite the recent Chinese movements some good news came in on Sunday as China has formed the largest free trade block that includes fifteen Asia-Pacific Economies with big names like Japan, South Korea, Australia and others being included [NEWS](https://ibb.co/XbcqV80). This group will account for 30% of the global economy and population. This will probably bold well for NIO as it has tanked after Citron released a statement that they are taking profits in NIO [NEWS](https://ibb.co/SQBbW6s).\n\nMoving on Wednesday we will also get some other retailers reports with Target and Lowe’s releasing reports also before the open. I believe this two will be impacted by what Walmart and Home Depot announce, if they have great results expect them the stocks to see a double move on Tuesday and Wednesday. Also, one of the biggest gainer of the stay at home moves, nVidia, will report after the close as I expect them do have great earnings again as they will continue to benefit a lot from the stay-at-home economy as October videogame sales were up 14% expect this also be translated into Nvidia’s earnings as this was the month before the new consoles from Microsoft and Sony were released. [NVIDIA NEWS](https://ibb.co/kK3WWj4)\n\nSo I really like all 3 of Home Depot, Walmart and Nvidia and if you want to make a gamble you can also make a small investment in Nio, as there are no other big catalysts at the moment earnings may impact the stocks and we can see a re-test of highs for all of them.\n\nOne other company that I will keep my eye on is Disney as they beat the expectations for earnings, revenue and subscriber for the streaming business, I will watch what updates the investors meeting in December will provide us, as I really like the company and the stock very much, if they want to keep this going and become a rival for NetFlix they do have to invest much more money in content, as they will have to keep providing new content that generates growth for Disney+. [NEWS](https://ibb.co/QNCc3D3)\n\nSome other news from the last days are that Qualcomm has received an exemption to sell chips to Huawei, which is not was expected that they would be allowed to sell 5G chips, but still is good news for the company as it provides another buyer for its products. [NEWS](https://ibb.co/ZVp8gTw)\n\nWhile DraftKings soared on Friday after they announced better than expected results and guidance for the future. [NEWS](https://ibb.co/qy9vmyB)\n\nThis came alongside the filing of documents for the hugely anticipated of DoorDash the leader in food delivery with a 50% market share. [NEWS](https://ibb.co/sWZDTpB)\n\nThank you everyone for watching! If you haven’t already be sure to smash the like button and subscribe to my channel, also leave a comment down below Have a great day and see you next time!\n\nThank you everyone for reading! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "subreddit": "StockMarket",
        "title": "Stocks to buy this week| HOME DEPOT | WALMART | NIO | NVIDIA |Stock market news [11-16-2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/jv5ork/stocks_to_buy_this_week_home_depot_walmart_nio/",
        "created": 1605557210.0
    },
    {
        "author": "picuron",
        "created_utc": 1604884790,
        "id": "jqnzvk",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%",
        "subreddit": "stocks",
        "title": "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:",
        "url": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/",
        "created": 1604913590.0
    },
    {
        "author": "RuediTabooty7",
        "created_utc": 1604714451,
        "id": "jpidbn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Been lurking here for a little while now while I’ve been learning about investing and now options. I still have no idea other than the basics about options but I understand how buying a lottery ticket works. \n\nFinally opened an account earlier this week with a (very) small chunk of change. Most of it went to dividend stocks for long term growth but as they say you gotta risk it for the biscuit. \n\nBought 30 shares of NMCI as a long play but what I’m really excited about is Seagate (STX). I definitely don’t have the capital to invest in shares but I’ve been watching it and I think it’s gonna continue the steady rise it’s on. \n\nWith how fast tech advances and Seagate’s new Lyve Drive I think they’re poised for some great growth. Anyways what do you guys think about STX? I haven’t seen many people talking about it on the sub. \n\nSTX 15 Jan 21 67.5 C\n\nOh and Go Retards! Or whatever y’all say",
        "subreddit": "wallstreetbets",
        "title": "Is this Wendy’s?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jpidbn/is_this_wendys/",
        "created": 1604743251.0
    },
    {
        "author": "wingwing8",
        "created_utc": 1605058817,
        "id": "jrymnp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Just looking for peoples thoughts on Seagate Technology $STX. \nThey are a data storage and solutions company, and I only see data storage needs exploding in the coming years. \nThey also offer a pretty good dividend. Just looking for other’s opinions on this, thanks!",
        "subreddit": "stocks",
        "title": "Thoughts on $STX",
        "url": "https://www.reddit.com/r/stocks/comments/jrymnp/thoughts_on_stx/",
        "created": 1605087617.0
    }
]