[
    {
        "author": "theycallmeryan",
        "created_utc": 1582035315,
        "id": "f5seog",
        "num_comments": 890,
        "num_crossposts": 0,
        "selftext": "I see many comparisons of the coronavirus outbreak to SARS everywhere. From the media to analysts to WSB posters, everyone loves to compare this coronavirus outbreak to SARS and say that the economy recovered quickly last time, so it will do the same this time. A lot has been discussed about the supply chain disruptions in [other reddit threads](https://www.reddit.com/r/investing/comments/f07zut/some_specific_details_about_impending_supply/), so I do not think it is necessary to talk about that. The differences between the diseases themselves as well as a potential pandemic breaking out has been discussed at length too, so I don’t find it necessary to go into that either. What I will do is show how the Chinese economy is much weaker and much different now than when SARS hit in 2003 and focus not too much on the supply side, but mostly on the demand side and the banking industry based on the research I have been doing. I believe that even if factories reopen tomorrow at 100% efficiency (they have been struggling to reopen amidst [labor shortages](https://www.cnbc.com/2020/02/14/china-coronavirus-its-still-far-from-business-as-usual.html)), coronavirus is completely eradicated, and everyone starts consuming at the same levels that they would have otherwise, the Chinese economy (and the world economy with it) is still in significant trouble.\n\nChina today is much different than China during the SARS outbreak in 2003, [here are some graphs that show just how different](https://www.cnbc.com/2020/02/05/coronavirus-how-china-economy-has-changed-since-sars.html). Notice how China was a much smaller share of the world economy back then (just above 4% according to this graph) compared to 16% now. Services and consumption make up a much larger part of the Chinese economy now, going from a little over 40% back then to around 52% now. According to [this](https://asia.nikkei.com/Spotlight/Caixin/Coronavirus-costs-China-service-sector-144bn-in-1-week) source, that service industry was hit with a $144b loss in a week from coronavirus. SARS was estimated to do [$33 billion in damage to the world economy](https://www.reuters.com/article/us-china-health/u-s-and-others-tighten-curbs-on-travel-to-china-virus-toll-hits-213-idUSKBN1ZT374), coronavirus did an estimated 330% more damage (not adjusted for inflation) just to the Chinese service industry (and I think that is an underestimate) in one week. China also accounts for over 12% of global exports now as opposed to a little over 6% back in 2003. China also accounts for [one-third of global GDP growth](https://www.imf.org/en/News/Articles/2018/07/25/na072618-chinas-economic-outlook-in-six-charts).\n\nChinese tourism has boomed since 2003 too. Tourism to Hong Kong has dropped off sharply thanks to the protests as well as coronavirus, [going from 200,000 visitors per day in February 2019 to less than 3,000 now](https://pbs.twimg.com/media/EQ358ruWsAA8AZb?format=jpg&amp;name=medium). Most flights to/from America (and other countries) are cancelled through the end of [March or April](https://www.nytimes.com/reuters/2020/02/14/world/14reuters-china-health-airlines-factbox.html). SARS hit a manufacturing based economy growing at a 12% rate and that was only 4% of the world economy. This is a service based economy growing at 6% (if you believe the real numbers) that is 16% of the world economy. You can't make up the tourism or services revenue like you can with manufacturing. 750m people [according to the NYT](https://www.nytimes.com/2020/02/15/business/china-coronavirus-lockdown.amp.html#click=https://t.co/ZuO31QVi6g) are currently under some form of lockdown. Even if these quarantines lift soon (that’s a major question), the massive tourism industry both to and from China has taken a huge hit for the near future that cannot be recovered.\n\nIn December 2019, a Moody’s analyst called Chinese corporate debt the [biggest threat to the global economy](https://www.cnbc.com/2019/12/17/chinas-corporate-debt-is-biggest-threat-to-global-economy-moodys.html). [4.9% of China’s private issuers defaulted on loans in 2019](https://www.reuters.com/article/china-markets-default/chinas-private-firms-face-record-default-risk-to-stay-high-in-2020-fitch-idUKL4N28K1YM). This number is up from 0.6% in 2014. Banks have been [encouraged](https://www.reuters.com/article/us-china-gdp-breakingviews/breakingviews-chinas-shadow-bankers-sneak-back-to-market-idUSKBN1ZG0D5) to give loans to tiny, risky businesses while also trying to get bad debt off their books. Due to problems with their banking system, China nationalized its first bank in [20 years](https://www.bloomberg.com/news/articles/2019-05-27/china-s-first-bank-seizure-in-20-years-spooks-lenders-investors) last year. Then they proceeded to take over [two more](https://www.theepochtimes.com/beijing-nationalizes-third-bank-in-3-months_3036953.html). This over-leveraged banking system had been showing its cracks before coronavirus made China grind to a halt for a month. Questions have been raised as to whether or not the industry can be leaned on for an economic recovery as hard as the Chinese government is leaning on it now.\n\nThis was an economy [in trouble](https://www.nytimes.com/2020/01/16/business/economy/china-economy-gdp.html) before the coronavirus hit. The [shadow banking system](https://www.bloomberg.com/news/articles/2019-10-08/trouble-is-brewing-in-the-darkest-corner-of-china-shadow-banking) appears to have gotten out of control. [Shadow banking accounted for 39% and 45% of total lending in Q1 and Q2 2019](https://www.ft.com/content/4c66b622-dea5-11e9-9743-db5a370481bc). According to Bloomberg, wealth managers have been offering “high yield products” to investors and have been using their own capital to make these returns whole due to that high default rate mentioned in the last paragraph. The Bloomberg article states that, “because the products are opaque and regulation is minimal, nobody knows exactly how much money is at risk.” This article is from October 2019, before coronavirus became a concern.\n\nThis is not an economy poised to bounce back like it did with SARS in 2003, despite what the market thinks. It might take a while for the market to realize it, but all it takes is a look at the data to see why that assertion is false. The market is focused on the fact that the virus won't kill us all and not on the fact that the lost revenue from Chinese consumption cannot be made up, despite the CCP propaganda that is being put out from Chinese government officials and Chinese economists. [An article from Barron’s](https://www.barrons.com/articles/coronavirus-brings-chinas-debt-problem-back-into-light-51581679800?mod=hp_LEAD_1) has this to say:\n\n&gt;One area, in particular, is back at the forefront—local debt. Policy makers have directed regional lenders to tolerate a higher threshold for bad loans, hoping to keep thousands of small- and medium-size enterprises (SMEs) from collapsing amid the economic standstill. A survey conducted recently by Peking and Tsinghua universities—China’s top two schools—found that two-thirds of such firms said they could stay afloat no more than one to two months with their current savings. An additional 18% said they could last at most three months.\n\n&gt;Put another way, 85% of China’s SMEs would crumble within three months without financial injections of some sort.\n\n[Here](https://www.mckinsey.com/~/media/mckinsey/featured%20insights/china/china%20and%20the%20world%20inside%20the%20dynamics%20of%20a%20changing%20relationship/mgi-china-and-the-world-full-report-vf.ashx) is a report from McKinsey from July 2019 that has a lot of good data in it regarding China’s exposure to the world economy. I’m just going to post some direct quotes and charts from the report and let you decide what they mean:\n\n&gt;In 11 of the 16 quarters since 2015, consumption contributed more than 60 percent of [China’s] total GDP growth.\n\n&gt;In the United States, among the firms listed in the MSCI USA index, revenue exposure to China amounted to 15 percent of the IT sector, 7 percent of materials, and 6 percent of industrials. In 2017, US companies were estimated to have generated around $450 billion to $500 billion revenue in China through a mix of exports and revenue from Chinese subsidiaries.\n\n[Here](https://i.imgur.com/tebHQRv.png) is a chart from the report showing how exposed the world is to China. Luckily for us, as shown in the above report, US exposure to China is not as massive as you might think. The exposure comes mostly from the rest of Asia, Australia, and Africa instead of developed markets. However, the amount of exposure from developed countries is not negligible. The technology sector, which has driven the majority of our stock market growth, has a [disproportionate exposure](https://i.imgur.com/UeBdEB0.jpg) to revenue coming from China, especially semiconductors like Intel, Micron, Nvidia, and AMD. That chart uses data from 2017 so I would almost guarantee it is less now, but still concerning.\n\nWhile 4 of the 5 mega caps that make up [almost 20% of the S&amp;P 500’s value](https://seekingalpha.com/article/4323952-s-and-p-500-five-great-tech-titans-of-america) and have generated [1/5 of S&amp;P 500 returns since 2009](https://www.bloomberg.com/news/articles/2020-02-15/all-the-ways-stock-market-bulls-have-gone-off-the-rails-again) don’t have much, if any, China exposure on a surface level. However, Apple derived [16.7% of their revenue](https://www.cnbc.com/2020/01/27/apple-impact-of-coronavirus-on-china-business.html) from China, Taiwan, and Hong Kong in 2019. Not to mention that Foxconn factories are still mostly closed down over there and not producing anything. Additionally, [20% of Amazon’s COGS for private label brands is attributable to China](https://markets.businessinsider.com/news/stocks/how-much-amazon-wayfair-will-have-to-boost-prices-tariffs-2019-9-1028499095). Due to how prevalent indexing is, I believe that a tech selloff lead by semiconductors and Apple (just like the old trade war selloffs) would drag down all megacap tech stocks and present a good entry point for an eventual recovery.\n\nAll of this comes on top of Boeing’s struggles with the 737 Max, which are expected to cut US GDP growth by [20%](https://www.axios.com/boeing-production-freeze-gdp-impact-737-max-d2b3b7c9-9a3b-4a2a-a3a0-a49fb54156d0.html) in 2020. In 2017 and 2018, China accounted for [22%](https://www.barrons.com/articles/boeing-plane-deliveries-china-737-max-crash-comac-airbus-trade-deal-51579101765) of Boeing plane deliveries. In 2019, that number dropped to 12%. These struggles with China’s economy and the self inflicted 737 Max struggles will put even more downward pressure on US GDP growth for this year. The phase one trade deal was expected to help Boeing out, but there are now [questions](https://foreignpolicy.com/2020/02/14/china-united-states-trade-deal-commitments-coronavirus-trump-energy-huawei/) as to whether or not China will hold up to their end of it. \n\nIn addition to these Chinese economic struggles, other Asian countries are showing economic woes as well. Singapore just cut their 2020 GDP forecast from 0.5%-2.5% to -0.5%-1.5%. Japan released their Q4 2019 GDP numbers, showing its largest GDP decline since 2014, an annualized rate of [-6.3%](https://www.cmcmarkets.com/en/news-and-analysis/singapore-cuts-2020-growth-forecast-japan-gdp-slumps), coming in way lower than analyst expectations of -2.6%. This was before the coronavirus started sweeping Asia, the Q1 GDP numbers could be worse. While China is responsible for 12.6% of our trade, Japan accounts for 5.4%. A Japanese recession will hurt us too.\n\nTo summarize and give some of my personal opinions to go along with this data, I believe the Chinese economy is in a lot more trouble than most people realize. The shadow banking system is massive and their banks are incredibly over leveraged. There are questions as to whether or not banks can perform the economic stimulus that China is demanding from them to keep small and medium sized firms open. I believe that the data shows China is in very dangerous economic territory that could lead to a recession or at least a major drop in growth for at least Q1 and Q2 2020 that cannot be made up in the second half of the year. It appears to me that these China economic troubles will take a lot of Asia and other developing economies down with them. It remains to be seen if it will take the American economy down too, but I believe that semiconductors and Apple should be trading lower than their current valuations to reflect potential lost growth and revenue streams. I also see Boeing’s struggles continuing to weigh on our GDP growth. I believe the market is fundamentally mispricing risk in the technology sector right now and it will overcorrect downwards in the near future.\n\nTL;DR: China’s economy is potentially going down led by an over-leveraged banking system and it may cause our tech stocks, which derive supply and demand from China, to lead a market correction. Comparing this coronavirus situation to SARS is extremely disingenuous due to the state of the Chinese economy in 2003 compared to the state of the Chinese economy now. The downward pressures from China on world GDP growth as well as Boeing’s pressures on our own GDP growth create a significant risk in all world equity markets that is not being priced in. I’m not saying we’re definitely heading towards a US recession or even a global recession, but the risk should not be ignored by world markets, no matter how much liquidity central banks pump in.",
        "subreddit": "wallstreetbets",
        "title": "SARS vs coronavirus: why it's different this time and the effects on the world economy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f5seog/sars_vs_coronavirus_why_its_different_this_time/",
        "created": 1582064115.0
    },
    {
        "author": "FreakingOutTheNGHBRD",
        "created_utc": 1580781280,
        "id": "eyialr",
        "num_comments": 401,
        "num_crossposts": 0,
        "selftext": "What's up chief? I been off this joint for a minute but at work today I overheard some millennials talking about TSLA being upper than their dads dingus. The last time I heard kids talking like that, it was when butt coin was at 19k and all of them thinking they were gonna be the next jimmy buffet.\nNow, big dingus daddy here has the 8th top post on this sub. I've been around these parts for a minute. I was here when AMD was at 13 and everyone was eating Lisa Su's big fuzz. I don't play tag.. I've been it. I'm coming out of retirement to make these chumps into my personal playmates. I've got 50 G's to yolo tomorrow on straight up TSLA calls. Here's what I'm thinking..\n\nEither\n\nJune 19th $1000 Strike (all in)\n\nMay 15 $950 Strike (all in)\n\nMar 20 $900 Strike (all in)\n\nFeb 7 $840Strike (all in)\n\nI've been selling covered calls on MU for the past year, collecting a few G's every month because I retired from the YOLO game. But I'm coming out of retirement like floyd may weather. I might be a boomer, but I'm getting out of my rocker to YOLO with my dawgs one last time. Let's get it baby. Tell me what to buy and whatever the consensus is, Ill buy 50G's worth tomorrow at open.",
        "subreddit": "wallstreetbets",
        "title": "$50,000 YOLO INCOMING tomorrow (that's right boys, i'm coming out of retirement)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eyialr/50000_yolo_incoming_tomorrow_thats_right_boys_im/",
        "created": 1580810080.0
    },
    {
        "author": "meesherpal",
        "created_utc": 1581747288,
        "id": "f45jou",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "She wants 500$ a month in rent and I have MU $60 April calls and negative 220$ in my checking account. I showed my mom where MU’s price is right now and she knew where it was before. She's at her wits end with me and I told her to just give it 2 more months, but she isnt having it. She took away my XBOX too and I'm in South Dakota where there is nothing else to do but play Halo 3. Shes telling me to go work in an oil field but I dont want to be killed when we are so close to financial success. Any South Dakotans I can stay with for the summer? I'll give you 5% of my profit. Or anyone else know what to do",
        "subreddit": "wallstreetbets",
        "title": "MY MOM IS KICKING ME OUT OF THE HOUSE SHOULD I JUST GIVE HER MY CALLS?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f45jou/my_mom_is_kicking_me_out_of_the_house_should_i/",
        "created": 1581776088.0
    },
    {
        "author": "cssegfault",
        "created_utc": 1580945173,
        "id": "ezio88",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Was it the RH infinite glitch? RH banned? RH box spread? MU? Inside trading with the SEC investigating us? WSJ doing an article on our rainbow penis?",
        "subreddit": "wallstreetbets",
        "title": "Best historic autistic moment in wsb so far?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ezio88/best_historic_autistic_moment_in_wsb_so_far/",
        "created": 1580973973.0
    },
    {
        "author": "canada9626",
        "created_utc": 1580952943,
        "id": "ezkiyf",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I’m pretty new to trading bought $3800 CAD worth of shares  between early 2018 and October 2018 in Canadian cannabis companies (Aurora, alefia,TGOD, Micron waste, and hexo) all of them are down right now lol. I don’t plan to sell for a couple years until the cannabis business is running properly. I have about 10k CAD to invest but not too sure what stocks to buy. Any advice would be appreciated !",
        "subreddit": "wallstreetbets",
        "title": "Fairly new trader looking for advice",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ezkiyf/fairly_new_trader_looking_for_advice/",
        "created": 1580981743.0
    },
    {
        "author": "cyphr0n",
        "created_utc": 1582306862,
        "id": "f7emhl",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Micron Technology (MU) DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f7emhl/micron_technology_mu_dd/",
        "created": 1582335662.0
    },
    {
        "author": "pacosteles",
        "created_utc": 1582659529,
        "id": "f9fsfe",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Micron Gets Double Downgrade as Coronavirus Weighs on Memory-Chip Orders",
        "url": "https://www.thestreet.com/investing/micron-shares-double-downgraded-at-bofa",
        "created": 1582688329.0
    },
    {
        "author": "sickter6",
        "created_utc": 1582926492,
        "id": "fb29jt",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Bought one call for the following today around 1pm, all ‘ITM.’\n\n$aapl\n$mu\n$f\n$big\n$amd\n$snap\n$ally\n\nHoping to have champagne and not natural light ice at the party but we will have to wait and see!",
        "subreddit": "wallstreetbets",
        "title": "4/20 calls party. Bring Tendies for munchies.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fb29jt/420_calls_party_bring_tendies_for_munchies/",
        "created": 1582955292.0
    },
    {
        "author": "DrTendies",
        "created_utc": 1582517361,
        "id": "f8lkq1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "21st century. Netflix, tinder and the gold standard grub hub (or uber eats if you are feeling extra spicy). But seriously, disregarding the arguably exorbitant prices charged for their services, more and more americans are favoring to pay a bit extra for the convenience of eating take out through mobile ordering apps.\n\nTo this extent one may question wether this trend will hold, as with the economy healthy and at (perhaps) the tail end of one of the longest bull markets in history, any sort of correction may see consumers significantly reducing their indolent behavior when it comes to eating in. \n\nTo this extent I would argue that current main stream sit down/upscale restaurants are in somewhat of a pickle. Many have recently begun to close underperforming locations, which with the economy booming is puzzling (bloomin brands and many other places that use cloth napkins yet serve shit food). Add to the fact that these chains suffer significantly during an economic downturn and you've gotten to the meat of my argument. These resturants are at risk of contracting their market exsposure significantly and perhaps permenantly.\n\nWith the convience of ordering shit food with the touch of a button less and less americans will, over the long term, be heading out to eat. Furthermore, I would argue this reduction in eating out would mean more Americans choose to eat upscale when they do head out rather than heading to their local applebees only to find pubes in their dollarita. \n\nNow, obviously these sit down chains are aware of this and have therefore already begun to adapt to these changes. Many for example have been advertising ordering to go sevices and the likes. But theirin lies the biggest problem. Their somewhat nicer than McDonalds yet no where near as nice as independent/upscale resturant firms just dont hold up well with the uber eats/grub hub model. No one in their right mind will want to pay extra for a delivered applebees hamburger when they could get a 5 guys burger for a cheaper price. Furthermore, a delivered applebees burger will have a much greater reduction in quality compared to a dine in applebees burger than a shit delivered baconator from wendeys would when compared to the still shit dine in version.\n\nTherefore, I believe their will be a long term reduction in the franchise model of sit down restaurants. Americans will dine out less and order in more, and when americans choose to dine out they will prefer locations with a greater degree of quality than one typically associated with cracker barrel, shooneys, applebees, etc. \n\nWith that being said, buy calls in $MU. \n\nTL/DR\n\nApplebees is a shithole and cracker barrel is racist. (Srs read the wiki)",
        "subreddit": "wallstreetbets",
        "title": "Food for Thots",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f8lkq1/food_for_thots/",
        "created": 1582546161.0
    },
    {
        "author": "Evoit13",
        "created_utc": 1581834456,
        "id": "f4mske",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I have made many tendies this last week thanks to $MU. I am currently up over 70% mostly due to buying caps late in the trading day and then selling of when it jumped EVERY SINGLE MORNING around an hour or two after open. Friday afternoon couldn’t have been more perfect maybe Tuesday if it doesn’t jump too fast. This is there lowest dip since being upgraded, and remember stonks only go up. But calls and enjoy your tendies, you’re welcome.",
        "subreddit": "wallstreetbets",
        "title": "Why MU Calls are a good idea",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f4mske/why_mu_calls_are_a_good_idea/",
        "created": 1581863256.0
    },
    {
        "author": "Adi_PL",
        "created_utc": 1581345299,
        "id": "f1r4p7",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Have a few hundreds to invest, looking for a holding in the semiconductor/hardware space - which would you chose from the above? I’m open for long-term investment, so lookin for a company with much space to growth and probability to increase significantly its value\nI’m thinking mostly about Micron / Qualcomm",
        "subreddit": "stocks",
        "title": "Intel, Nvidia, Qualcomm, Micron or AMD?",
        "url": "https://www.reddit.com/r/stocks/comments/f1r4p7/intel_nvidia_qualcomm_micron_or_amd/",
        "created": 1581374099.0
    },
    {
        "author": "tnellman",
        "created_utc": 1581023380,
        "id": "ezz5cn",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI run an investment club and they want to invest in MU or AMD.  If u look at the P/E  of MU it would be a good buy but AMD has already made us 350%.  Which would u buy?\n\nI advised the club that Amazon and Tesla PE’s weren’t great but look how they’ve turned out.... thanks",
        "subreddit": "investing",
        "title": "AMD or MU",
        "url": "https://www.reddit.com/r/investing/comments/ezz5cn/amd_or_mu/",
        "created": 1581052180.0
    },
    {
        "author": "RfLock7",
        "created_utc": 1581080942,
        "id": "f0a92v",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Why? Fuck you. Chasing the tendies dragon and I got a hard on for that tech. \n\nMic &lt; Mac\nRon &lt; Ronald\nRonald runs the Mac and the Mac has over a billion \ntendies served. \n\nCase closed. Let’s get rich.",
        "subreddit": "wallstreetbets",
        "title": "MU TO THE MOON!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f0a92v/mu_to_the_moon/",
        "created": 1581109742.0
    },
    {
        "author": "Beagleoverlord33",
        "created_utc": 1581969195,
        "id": "f5ehf6",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hi I was looking for peoples opinion on their favorite semi stocks. I was looking at starting a small position in QCOM and SWKS and maybe average down if the stocks come down a bit. I already have a position in Micron. Does anyone have thoughts on the these? in the next 1-5 years growth seems like it would be solid. Any other popular ones not looking to much at AMD or NVDA due to valuation at this point.",
        "subreddit": "stocks",
        "title": "Favorite semi stock and why",
        "url": "https://www.reddit.com/r/stocks/comments/f5ehf6/favorite_semi_stock_and_why/",
        "created": 1581997995.0
    },
    {
        "author": "TheOptionsTrader",
        "created_utc": 1582682062,
        "id": "f9lj9l",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Well if this market settles down I’ll be getting some $MU calls for swing",
        "subreddit": "options",
        "title": "$MU calls 👀",
        "url": "https://www.reddit.com/r/options/comments/f9lj9l/mu_calls/",
        "created": 1582710862.0
    },
    {
        "author": "speedrush64",
        "created_utc": 1582071448,
        "id": "f61rs8",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I'm a gamer who made money on an AMD $53 Feb 21 EXP.\n\nI want to take my profit and dump it into 3 contracts for an April 17th Call of $70 on Micron (MU). \n\nWanted to hear some thoughts and opinions on this.",
        "subreddit": "options",
        "title": "By the Power of Mu",
        "url": "https://www.reddit.com/r/options/comments/f61rs8/by_the_power_of_mu/",
        "created": 1582100248.0
    },
    {
        "author": "spittingllama87",
        "created_utc": 1581645148,
        "id": "f3kwy7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Ok so I get the basic premise of a wash sale ..... but mu question is more for day trading. \n\nSo pretend I buy and sell stock X on the following dates \n\nBUY 100 shares 1/3  \nSELL 100 shares 1/4 - Profit \nBUY 100 shares 1/4 \nSELL 100 shares 1/4 - Profit \nBUY 100 shares 1/5 - major dip \nSELL 100 shares 1/20 - loss \n\nIf I wait more than 30  days to repurchase  stock X would this be a wash sale? I'm asking because for the past 6 months I was swing/ day trading options and stocks (Tesla stock, mostly) but I just took a major loss  of ~6k yesterday, and obviously I want that to at least negate some of my profits from other trades in 2020. \n\nThanks in advance. If anything needs to be clarified I ca  edit the post- just let me know",
        "subreddit": "stocks",
        "title": "Wash sale question",
        "url": "https://www.reddit.com/r/stocks/comments/f3kwy7/wash_sale_question/",
        "created": 1581673948.0
    },
    {
        "author": "FreakingOutTheNGHBRD",
        "created_utc": 1581380218,
        "id": "f1zrhr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "WEEKLY GAINS (Thank you $TSLA, $SPCE, $MSFT, $MU)",
        "url": "https://i.redd.it/iaxf0hlnt6g41.png",
        "created": 1581409018.0
    },
    {
        "author": "nomeras",
        "created_utc": 1581624857,
        "id": "f3g2rs",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good afternoon,\n\n&amp;#x200B;\n\nI have a question regarding estimating the parameters  µ  and  σ , from return data. I have 50 year MONTHLY returns of a stock/portfolio and I am tasked with estimating the said parameters. So far I have followed the assumption that returns are normally distributed with a mean and variance that are proportional to the length of the time-interval. In this case I would find the mean and variance from the data and multiply them by  ∆t =1/12. Am I correct here?\n\nThe problem that arises is that I am asked to produce ANNUAL estimates for these parameters. In my head it would be incorrect to multiply  x̅ \\*∆t  by 12 (12 months in a year) because that would erase the whole purpose of BSM time-interval assumption. How do I convert monthly estimates to annual estimates?",
        "subreddit": "investing",
        "title": "Estimating parameters (mu and sigma) using Black Scholes Merton",
        "url": "https://www.reddit.com/r/investing/comments/f3g2rs/estimating_parameters_mu_and_sigma_using_black/",
        "created": 1581653657.0
    },
    {
        "author": "xpdx",
        "created_utc": 1581610438,
        "id": "f3c997",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Memory spot prices are rising and MU was just upgraded by two different analysts. We are moving to an \"undersupplied market\" which means higher margins. Memory market is cyclical and we are on the upswing. \n\nGot myself a call.",
        "subreddit": "wallstreetbets",
        "title": "MU on the move",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f3c997/mu_on_the_move/",
        "created": 1581639238.0
    },
    {
        "author": "pacosteles",
        "created_utc": 1581520697,
        "id": "f2sp5l",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "RIP Marty.",
        "subreddit": "wallstreetbets",
        "title": "$MU $90C back on the menu boys.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2sp5l/mu_90c_back_on_the_menu_boys/",
        "created": 1581549497.0
    },
    {
        "author": "iseethangs",
        "created_utc": 1581000002,
        "id": "ezt8y9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "MU TSLA SNAP",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ezt8y9/mu_tsla_snap/",
        "created": 1581028802.0
    },
    {
        "author": "J_da_CPA",
        "created_utc": 1581511104,
        "id": "f2qlby",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Tim Arcuri upgrades $MU",
        "url": "https://www.google.com/amp/s/www.thestreet.com/.amp/investing/micron-shares-jump-after-ubs-boosts-rating-price-target",
        "created": 1581539904.0
    },
    {
        "author": "Senator_Bagholder",
        "created_utc": 1581476476,
        "id": "f2kbo5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Any OGs still holdin MU 90s?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2kbo5/any_ogs_still_holdin_mu_90s/",
        "created": 1581505276.0
    },
    {
        "author": "FreakingOutTheNGHBRD",
        "created_utc": 1580780789,
        "id": "eyi6fu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What's up chief? I been off this shyt for a minute but at work today I overheard some millennial twinks talking about TSLA being upper than their dads dong. The last time I heard r*tard ass f*ggets talking like that, it was when bitcoin was at 19k and all of them thinking they were gonna be the next jimmy buffet.\nNow, big d*ck daddy here has the 8th top post on this sub. I've been around these parts for a minute. I was here when AMD was at 13 and everyone was eating Lisa Su's big muff. I don't play tag.. I've been it. I'm coming out of retirement to make these little twinks into my personal playmates. I've got 50 G's to yolo tomorrow on straight up TSLA calls. Here's what I'm thinking..\nEither\n\nJune 19th $1000 Strike (all in)\n\nMay 15 $950 Strike (all in)\n\nMar 20 $900 Strike (all in)\n\nFeb 7 $840Strike (all in)\n\nI've been selling covered calls on MU to twink fay*g*ts for the past year, collecting a few G's every month because I retired from the YOLO game. But I'm coming out of retirement like floyd may weather. I might be a boomer fa*g)et but I'm getting out of my rocker to YOLO with my dawgs one last time. Let's get it baby. Tell me what to buy and whatever the consensus is, Ill buy 50G's worth tomorrow at open.",
        "subreddit": "wallstreetbets",
        "title": "$50,000 YOLO INCOMING tomorrow (that's right boys, im coming out of retirement)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eyi6fu/50000_yolo_incoming_tomorrow_thats_right_boys_im/",
        "created": 1580809589.0
    },
    {
        "author": "Evoit13",
        "created_utc": 1581652351,
        "id": "f3mfta",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Gains of mostly MU",
        "url": "https://i.redd.it/yakix6xyatg41.jpg",
        "created": 1581681151.0
    },
    {
        "author": "nokturno123",
        "created_utc": 1581520361,
        "id": "f2sm9d",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Guys, I found the new MSFT it’s called MICRON. It’s up 6% !",
        "subreddit": "wallstreetbets",
        "title": "I found a new MSFT!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f2sm9d/i_found_a_new_msft/",
        "created": 1581549161.0
    },
    {
        "author": "InterestingNews1",
        "created_utc": 1581623854,
        "id": "f3ftcq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "A PE ratio between 3 - 7 is not unusual so its current valuation (at 10x next years earnings) doesnt look very cheap.\n\nThis is not a recommendation to buy or sell.  Stocks are not suitable for everyone.  Some of the stocks mentioned are risky small cap and/or highly speculative.  Please do your own research.",
        "subreddit": "stocks",
        "title": "Analysts are getting very bullish about the outlook for Micron $MU. EPS estimates are going up and up. But as EPS go up, Micron's PE ratio tends to fall as investors wait for the inevitable ramp up in production. Why would it be different this time?",
        "url": "https://www.reddit.com/r/stocks/comments/f3ftcq/analysts_are_getting_very_bullish_about_the/",
        "created": 1581652654.0
    },
    {
        "author": "Keegers25",
        "created_utc": 1582136370,
        "id": "f6etyx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Where my $MU bag holders at?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f6etyx/where_my_mu_bag_holders_at/",
        "created": 1582165170.0
    },
    {
        "author": "FreakingOutTheNGHBRD",
        "created_utc": 1580777678,
        "id": "eyhgz5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What's up fag sticks? I been off this shit for a minute but at work today I overheard some millennial twinks talking about TSLA being upper than their dads dick. The last time I heard retard ass faggots talking like that, it was when bitcoin was at 19k and all of them thinking they were gonna be the next jimmy buffet.\n\nNow, big dick daddy here has the 8th top post on this sub. I've been around these parts for a minute. I was here when AMD was at 13 and everyone was eating Lisa Su's big muff. I don't play tag.. I've been it. I'm coming out of retirement to make these little twinks into my personal playmates. I've got 50 G's to yolo tomorrow on straight up TSLA calls. Here's what I'm thinking..\n\nEither\n\nJune 19th $1000 Strike (all in)\n\nMay 15 $950 Strike (all in)\n\nMar 20 $840 Strike (all in)\n\nFeb 21 $840 Strike (all in)\n\nFeb 14 $840 Strike (all in)\n\nFeb 7 $855 Strike (all in)\n\nFeb 7 $900 Strike (all in)\n\nI've been selling covered calls on MU to twink faggots for the past year, collecting a few G's every month because I retired from the YOLO game. But I'm coming out of retirement like floyd may weather. I might be a boomer faggot but I'm getting out of my rocker to YOLO with my dawgs one last time. Let's get it baby. Tell me what to buy and whatever the consensus is, Ill buy 50G's worth tomorrow at open.",
        "subreddit": "wallstreetbets",
        "title": "$50,000 TSLA YOLO Incoming tomorrow (that's right bitches, I'm coming out of retirement)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eyhgz5/50000_tsla_yolo_incoming_tomorrow_thats_right/",
        "created": 1580806478.0
    },
    {
        "author": "notmichaelou",
        "created_utc": 1580780755,
        "id": "eyi65m",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Wake up, open robinhood on my phone. Market opens. Buy TSLA 2000c. Buy AMD 500c. Buy MU 90c.\n\nGet a phone call, it's CNBC. \"You're a genius sir, we'd like to interview you\" they say.\n\nGet a knock on my door. I open it and it's Masa Son. \"Well done sir\", he says shaking my hand and giving me a check for $10 billion. \"Lets see you do what that Adam could never do.\"\n\nAir force one pulls up outside my apartment window. The door opens and it's mango man. He extends his hand, covered in duck fat. \"That's a good job, a great job, tremendous, one of our very best. Those gaylords in gyna wish they had you, Hillary is fake and gay\". I shake his hand, contracting coronavirus as he flies away.\n\nMy girlfriend is in the room next door getting gangbanged by 20 MMA fighters but I don't care.\n\nI bought calls today.",
        "subreddit": "wallstreetbets",
        "title": "Bought Calls Today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/eyi65m/bought_calls_today/",
        "created": 1580809555.0
    },
    {
        "author": "Been-Died",
        "created_utc": 1581576126,
        "id": "f35wdp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Anyone on here have preferences towards MU or TSM. I’m looking to invest in both soon but I wanna buy one or the other right now, just cant make up my mind.  My research leads me to TSM while the media pumps MU more.",
        "subreddit": "stocks",
        "title": "Any Semiconductor Opinions?",
        "url": "https://www.reddit.com/r/stocks/comments/f35wdp/any_semiconductor_opinions/",
        "created": 1581604926.0
    },
    {
        "author": "IpMedia",
        "created_utc": 1581594025,
        "id": "f38q3z",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "TO. THE. FUCKING. \n\n#MOOOOOON!!!\n\n92 (due to inflation) by EOY lets gooooooooo!!!!!!!!",
        "subreddit": "wallstreetbets",
        "title": "$MU",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/f38q3z/mu/",
        "created": 1581622825.0
    }
]