[
    {
        "author": "gmr1310",
        "created_utc": 1585727518,
        "id": "fsvbj1",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "what stocks you would buy right now if you had 5k in cash ???",
        "subreddit": "stocks",
        "title": "what stocks you would buy right now if you had 5k in cash",
        "url": "https://www.reddit.com/r/stocks/comments/fsvbj1/what_stocks_you_would_buy_right_now_if_you_had_5k/",
        "created": 1585756318.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1585743614,
        "id": "fsypwh",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Welcome to the trading month of April and Q2. Here are your pre-market stock movers &amp; news this AM-\n\n*****\n\n#[Today's Top Headlines for Wednesday, April 1st, 2020](https://www.cnbc.com/2020/04/01/what-to-watch-today-dow-set-for-sharp-drop-after-worst-first-quarter-ever.html)\n\n*****\n\n&gt; * Dow futures pointed to a drop of more than 700 points at Wednesday’s open on the first day of April and the second quarter on Wall Street. White House officials are projecting 100,000 to 240,000 U.S. deaths from COVID-19, with fatalities peaking over the next two weeks. The Dow Jones Industrial Average on Tuesday closed out its worst first-quarter ever with a 410-point decline. The Dow’s plunge in March was the worst of any month since October 2008 during the financial crisis. (CNBC)\n\n*****\n\n&gt; * Cramer reveals second-quarter playbook, says the quarter is ‘going to be so ugly’ (CNBC)\n\n*****\n\n&gt; * ADP issues its March report on private sector employment at 8:15 a.m. ET. On Thursday, the government’s look at weekly jobless claims is expected to show a second week of over 3 million people filing for unemployment insurance for the first time. On Friday, the government releases its monthly employment report for March. (CNBC)\n\n*****\n\n&gt; * Start-ups cut nearly 4,000 jobs in March as coronavirus impact ripples through tech (CNBC)\n\n*****\n\n&gt; * The Institute for Supply Management is out with its March manufacturing index at 10 a.m. ET. Economists expect a contraction. February construction spending, also released at 10 a.m. ET, is expected to show an increase of 0.7% following January’s 1.8% advance. The nation’s major automakers, with the exception of Ford (F), deliver first quarter sales figures today. Ford’s numbers come out tomorrow. (CNBC)\n\n*****\n\n&gt; * More borrowers are refinancing their mortgages to save money on monthly payments, while potential homebuyers are backing away fast. Driven entirely by refinancing, total mortgage application volume increased 15.3% last week. Mortgage applications to purchase a home fell 11% last week. Refis surged 26%. (CNBC)\n\n*****\n\n&gt; * Macy’s (M) is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n*****\n\n&gt; * President Donald Trump, in a grim news conference Tuesday evening, sought to prepare Americans for a coming surge in coronavirus deaths, calling COVID-19 a plague and saying the America faces a “very, very painful two weeks.” The president said that according to modeling, a U.S. death toll of 100,000 is a “very low number.” (CNBC)\n\n*****\n\n&gt; * Confirmed cases across the nation rose to nearly 190,000 — nearly double the next worst country — with 4,081 deaths, according to Johns Hopkins University data. New York state’s over 76,000 known cases are the most in the U.S. by far. The Empire State’s death toll of 1,714 accounts for over 40% of all fatalities in the country.\nNew York City Mayor Bill de Blasio orders investigation of Amazon’s firing of strike organizer (CNBC)\n\n*****\n\n&gt; * Global coronavirus cases surged to over 870,000 with 43,287 deaths and about 176,000 recoveries. The U.S. has the most cases of any country and the third-most deaths. Italy’s over 105,000 infections were second highest, but the death toll of 12,428 was the worst. Fatalities in Spain were the world’s second worst at 9,053. Its 102,000 infections ranked third highest. (CNBC)\n\n*****\n\n&gt; * US, Italy and Spain have the most coronavirus cases. These charts show their infection curves (CNBC)\n\n*****\n\n&gt; * China starts to report asymptomatic coronavirus cases (Reuters)\n\n*****\n\n&gt; * In its first report looking at underlying health conditions that could make COVID-19 worse, the Centers for Disease Control and Prevention said people with diabetes, chronic lung disease, heart disease or those who smoke may be at increased risk of developing severe complications if they were to get infected. (CNBC)\n\n*****\n\n&gt; * Becton Dickinson and BioMedomics launch test to detect past and current coronavirus exposure (Reuters)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/dQScHIU.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/8dbexJZ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/TCAK1Yl.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/5rLsTWv.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/X2ee1ao.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($RH $BB $VFF $CHWY $KMX $WBA $PAYS $TTNP $STZ $CALM $GNLN $CSU $CAG $MKC $RMBL $GPL $HEXO $PVH $DARE $CTEK $CYD $NVCN $LW $AYI $ICLK $ALPN $APOG $UNF $EAST $SMTS $CSSE $SCHN $LNDC $NG $RECN $EDAP $APTX $ASND $VRNT $MOTS $VERO)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/InmHVgs.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($BB $PAYS $PUMP $LW $UNF $VRNT $LNDC $JFIN $GWGH $MITO)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/KViHVYP.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/y1h1uND.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/fwVmy1S.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/cdQhL2M.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/pwGKS2L.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/PjQqeP8.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/tpWAwqZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/mHujpzL.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/kWXIIu7.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/yQtjk3q.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SGBX\n* CEMI\n* SPXS\n* SDOW\n* KO\n* INSG\n* OI\n* TZA\n* TLRA\n* SPXU\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/04/01/stocks-making-the-biggest-moves-in-the-premarket-verizon-xerox-home-depot-macys-more.html)**)\n\n*****\n\n&gt; **Verizon (VZ)** – Goldman Sachs added Verizon to its “Conviction Buy” list, saying it offers investors the most attractive combination of total return and risk, thanks to the stability of its wireless business.\n\n&gt; #**STOCK SYMBOL:** VZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n&gt; **Xerox (XRX)** – Xerox dropped its $35 billion hostile bid for HP Inc. (HPQ), saying it was prioritizing its response to the outbreak over all other considerations. Xerox had planned to put up its own slate of directors for election to HP’s board but has now dropped that effort as well.\n\n&gt; #**STOCK SYMBOL:** XRX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XRX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XRX)**)\n\n*****\n\n&gt; **Home Depot (HD)** – The home improvement retailer will institute new safety measures in response to the outbreak, including earlier store closures and limiting the number of customers allowed into stores at one time. The company has also increased paid time off for hourly workers.\n\n&gt; #**STOCK SYMBOL:** HD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HD)**)\n\n*****\n\n&gt; **British American Tobacco (BTI)** – The cigarette maker’s US biotech unit – Kentucky BioProcessing – is developing a COVID-19 vaccine derived from tobacco leaves that is currently undergoing pre-clinical testing. The unit said it could produce between 1 million and 3 million doses per week starting in June.\n\n&gt; #**STOCK SYMBOL:** BTI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BTI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BTI)**)\n\n*****\n\n&gt; **Royal Bank of Scotland (RBS), HSBC (HSBC), Barclays (BCS)** – These and other big U.K. banks canceled their dividends to shore up their balance sheets amid an expected increase in bad loans due to the virus outbreak.\n\n&gt; #**STOCK SYMBOL:** RBS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RBS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RBS)**)\n\n*****\n\n&gt; **Becton Dickinson (BDX)** – The medical products maker and privately held diagnostics company BioMedomics will launch a test that can determine both current and past exposure to the coronavirus within minutes. Becton Dickinson said the tests will be distributed this month.\n\n&gt; #**STOCK SYMBOL:** BDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BDX)**)\n\n*****\n\n&gt; **Macy’s (M)** – The retailer’s stock is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n&gt; #**STOCK SYMBOL:** M\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n&gt; **Caterpillar (CAT)** – Caterpillar will withhold annual salary increases for executives, managers, and salaried employees, in an effort to hold down expenses amid the coronavirus outbreak. The heavy equipment maker will also not pay out bonuses to employees next year.\n\n&gt; #**STOCK SYMBOL:** CAT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAT)**)\n\n*****\n\n&gt; **Quest Diagnostics (DGX)** – Quest has pulled its previous financial guidance for 2020, as it tries to determine the impact of the coronavirus on its results. The medical lab operator said that even with a surge of COVID-19 testing, overall testing volume dropped more than 40% during the last two weeks of March.\n\n&gt; #**STOCK SYMBOL:** DGX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DGX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DGX)**)\n\n*****\n\n&gt; **Sysco Corp. (SYY)** – Sysco is cutting out fresh food sales for its customers and focusing on frozen products, according to a report in the New York Post. The food distributor is also said to be cutting out Saturday deliveries, product returns, and guaranteed delivery times.\n\n&gt; #**STOCK SYMBOL:** SYY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SYY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SYY)**)\n\n*****\n\n&gt; **Papa John’s Pizza (PZZA)** – The restaurant chain’s stock was upgraded to “buy” from “neutral” at MKM Partners, which said the pizza segment of the restaurant industry appears better positioned to deal with the current environment, given their delivery and digital infrastructure.\n\n&gt; #**STOCK SYMBOL:** PZZA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PZZA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PZZA)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, April 1st, 2020! :)**",
        "subreddit": "wallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Wednesday, April 1st, 2020]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fsypwh/todays_premarket_movers_news_wednesday_april_1st/",
        "created": 1585772414.0
    },
    {
        "author": "VRgamer84",
        "created_utc": 1585742906,
        "id": "fsyjq8",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "One month ago the US death % was just 1.2% of those infected, now it's 2.1%, hey atleast something is trending up, right?!?",
        "subreddit": "stocks",
        "title": "That death % just keeps on rising, over/under it eclipses 15% by this time next year?",
        "url": "https://www.reddit.com/r/stocks/comments/fsyjq8/that_death_just_keeps_on_rising_overunder_it/",
        "created": 1585771706.0
    },
    {
        "author": "madbrain76",
        "created_utc": 1585730489,
        "id": "fsvxx3",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Let's say I'm trading in a cash account (Roth IRA), not margin.\n\nI want to open a long put debit spread.\n\nAs an example :\n\nBuy May 15 2450 Put at $123.20\n\nSell May 15 2150 Put at $56.60\n\nNet debit is $66.20\n\nWhen I preview the trade, E-Trade tells me that I don't have enough buying power for this, even though my buying power right now is $94,000. \n\nFrom what I understand with this spread, the worst case is that the SPX is above both strikes at expiration. Thus, the most I can lose is the net debit of $66.20 . Given that one contract is 100 options, a buying power of $6620 should be sufficient, and I am well above that.\n\nSince SPX options are European and settled in cash, there is no possibility that the the put option may be assigned early. And as long I hold on to the long put, my short put is always covered.\n\nSo why can't the broker accept this order ?  It seems to be insisting that my short put be covered only by cash, which would indeed cost $2150 x 100 or $215,000, which I indeed don't currently have in cash buying power. Ie. E-trade is ignoring the fact that there is a long put in the order.\n\nI can think of one reason why they do this :  \nIf I subsequently sell the long put, but hold on to the short put, then I would require the cash to be held. Why couldn't E-trade just prevent me from selling the long put alone in this case, if it's actually needed to cover the short put ? Ie. the brokerage should only allow closing the short position, or both positions, but not closing just the long position.\n\nIs there any other brokerage that will deal with this in a more flexible way in a cash account ? I'm not willing to use a taxable account due to being in a high tax bracket, and tax complications. And I don't have the appetite for using margin. The only way I want to use leverage is with options that are always covered.",
        "subreddit": "options",
        "title": "Buying power for SPX spreads in cash account",
        "url": "https://www.reddit.com/r/options/comments/fsvxx3/buying_power_for_spx_spreads_in_cash_account/",
        "created": 1585759289.0
    },
    {
        "author": "green9206",
        "created_utc": 1585734164,
        "id": "fswpj6",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I watched a show in my country about how to identify whether a base or bottom formation is taking place. I am writing a summary of it here so maybe it might be a little helpful to you. If not you can just ignore this. \n\nOk First we need to take into account the lowest closing of the index, in this case am taking S&amp;P 500. The lowest closing was 2237.40 on Mar 23. And to identify whether a base formation is happening or not, the first condition is that the index must close atleast 5% above the lowest closing level for the next 9 trading sessions. So 5% above in this case would be 2349.27 and the index has continued to close above 2349.27 everyday since so base formation is happening for sure. This is for Base Formation. Even if the conditions here are not met, for example if index closes below 5% above the lowest closing, the cycle begins again once it again closes minimum 5% above and continues to do so for 9 consecutive sessions after that. Now we move to Bottom Formation. \n\nNow we have to try to understand whether the low of 2237.40 was the bottom . Now nobody can predict the bottom and we're not trying to do that, we are trying to understand the probability that 2237.40 was the bottom or not and to do that, the condition here is that out of the 9 trading sessions following the lowest closing, one of the closing needs to be atleast 10% above the lowest closing, so 10% above 2237.40 so that would be 2461.14. So the first time we got a closing above that level was on March 25 of 2475.56. But the important thing is every consecutive closing after that should be above 2461.14 and so far S&amp;P 500 has given a closing above it. Another condition is out of the total 9 trading sessions following March 23, atleast 6 of the sessions must close in the positive. So far in the 6 trading sessions that have happened since, 4 has been a positive close and 2 have been negative so its quite important that in the next 3 trading sessions, atleast 2 are positive(this indicates market sentiment). And not only that but the next 3 trading sessions also must have a closing above 2461.14. If either of these conditions are not met then the probability that 2237.40 was THE low diminishes but if the conditions are met the PROBABILITY that 2237.40 was the low increases considerably. That's for Bottom Formation . So next 3 trading sessions are very important. If S&amp;P 500 closes below 2461.14 this week then the probability that March 23 was the bottom goes down so some of you who have FOMO will have another chance to get in at better valuations but if all conditions are met i.e. 2 positive closing and all closings above 2461.14 then 2237.40 was probably the bottom and some of you missed out on it and thats ok because future will always give you more opportunities so don't feel too bad.\n\nAnd finally this is something i watched on tv by a \"market expert\" who said he did a lot of research on 2001 and 2008 pattern before coming up with this theory so obviously please take with a handful of salt.",
        "subreddit": "investing",
        "title": "Identifying base and bottom formation(Theory)",
        "url": "https://www.reddit.com/r/investing/comments/fswpj6/identifying_base_and_bottom_formationtheory/",
        "created": 1585762964.0
    },
    {
        "author": "objectnyc",
        "created_utc": 1585745436,
        "id": "fsz6bx",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nI am looking to change charting software. I am using tradingview and like it a lot. But what I want to do is to find a charting software (preferably on web) (or mac), which allows me to see 10+ charts for \"different\" stocks at a time. Yes yes, I know I can just manually create 10 charts in tradingview and then organize them in different tabs. That is what I do now, but I want to see all on one screen...\n\nAnyone have any recommendations on that?",
        "subreddit": "stocks",
        "title": "Multiple Stock Charts On Screen",
        "url": "https://www.reddit.com/r/stocks/comments/fsz6bx/multiple_stock_charts_on_screen/",
        "created": 1585774236.0
    },
    {
        "author": "KingBiotech",
        "created_utc": 1585727599,
        "id": "fsvc4w",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**$VISL has the potential to be a massive play:**\n\nThe February offering was at **.22/share**, with warrants at .**2420/share**!   \n\n**UK coronavirus response criticized as people are filmed by drones and stopped while shopping**  \n\n\n[https://edition.cnn.com/2020/03/31/uk/uk-police-coronavirus-tactics-gbr-intl-scli/index.html](https://edition.cnn.com/2020/03/31/uk/uk-police-coronavirus-tactics-gbr-intl-scli/index.html)  \n\n\n\\---&gt; **Vislink Technologies Renews Three-Year Service Contracts with 12 UK Police Forces to Support Airborne Data Link (ADL) Infrastructure**  \n\n\n[https://finance.yahoo.com/news/vislink-technologies-renews-three-contracts-160234137.html](https://finance.yahoo.com/news/vislink-technologies-renews-three-contracts-160234137.html)\n\n  \n⏺Company had [$15M](https://stocktwits.com/symbol/15M) backlog in September last year (now substantially higher)    \n⏺Signed multiple contracts with government agencies/military    \n\n\n➡️07 Feb 2020: \"Vislink Technologies Receives $1.3 Million Contract from European Partner for Border Protection\"    \n\n\n➡️02 March 2020: \"Vislink Technologies Receives $400,000 Contract to Supply Airborne Surveillance Video Downlink Solution to MENA Government Agency\"   \n\n\n ➡️05 Dec 2019: \"Vislink Technologies Receives $1.5 Million in New Orders in Live Production, Military-Government and Satcom Markets\"    \n\n\nNow, with the NASDAQ 180-day extension they will run it soon to exercise some warrants imo. Look at the massive volume lately.   \n\n\nOver 100M shares traded in the last 7 sessions. Volume precedes price!     \n\n\nGreat swing play imo. Good luck 💵",
        "subreddit": "pennystocks",
        "title": "VISL (Vislink Technologies) - Massive Potential",
        "url": "https://www.reddit.com/r/pennystocks/comments/fsvc4w/visl_vislink_technologies_massive_potential/",
        "created": 1585756399.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1585743492,
        "id": "fsyotp",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to the trading month of April and Q2. Here are your pre-market stock movers &amp; news this AM-\n\n*****\n\n#(**[CLICK HERE TO VIEW THE FULL SOURCE!](https://www.stockaholics.net/threads/todays-pre-market-movers-news-wednesday-april-1st-2020.9760/)**)\n\n#[Today's Top Headlines for Wednesday, April 1st, 2020](https://www.cnbc.com/2020/04/01/what-to-watch-today-dow-set-for-sharp-drop-after-worst-first-quarter-ever.html)\n\n*****\n\n&gt; * Dow futures pointed to a drop of more than 700 points at Wednesday’s open on the first day of April and the second quarter on Wall Street. White House officials are projecting 100,000 to 240,000 U.S. deaths from COVID-19, with fatalities peaking over the next two weeks. The Dow Jones Industrial Average on Tuesday closed out its worst first-quarter ever with a 410-point decline. The Dow’s plunge in March was the worst of any month since October 2008 during the financial crisis. (CNBC)\n\n*****\n\n&gt; * Cramer reveals second-quarter playbook, says the quarter is ‘going to be so ugly’ (CNBC)\n\n*****\n\n&gt; * ADP issues its March report on private sector employment at 8:15 a.m. ET. On Thursday, the government’s look at weekly jobless claims is expected to show a second week of over 3 million people filing for unemployment insurance for the first time. On Friday, the government releases its monthly employment report for March. (CNBC)\n\n*****\n\n&gt; * Start-ups cut nearly 4,000 jobs in March as coronavirus impact ripples through tech (CNBC)\n\n*****\n\n&gt; * The Institute for Supply Management is out with its March manufacturing index at 10 a.m. ET. Economists expect a contraction. February construction spending, also released at 10 a.m. ET, is expected to show an increase of 0.7% following January’s 1.8% advance. The nation’s major automakers, with the exception of Ford (F), deliver first quarter sales figures today. Ford’s numbers come out tomorrow. (CNBC)\n\n*****\n\n&gt; * More borrowers are refinancing their mortgages to save money on monthly payments, while potential homebuyers are backing away fast. Driven entirely by refinancing, total mortgage application volume increased 15.3% last week. Mortgage applications to purchase a home fell 11% last week. Refis surged 26%. (CNBC)\n\n*****\n\n&gt; * Macy’s (M) is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n*****\n\n&gt; * President Donald Trump, in a grim news conference Tuesday evening, sought to prepare Americans for a coming surge in coronavirus deaths, calling COVID-19 a plague and saying the America faces a “very, very painful two weeks.” The president said that according to modeling, a U.S. death toll of 100,000 is a “very low number.” (CNBC)\n\n*****\n\n&gt; * Confirmed cases across the nation rose to nearly 190,000 — nearly double the next worst country — with 4,081 deaths, according to Johns Hopkins University data. New York state’s over 76,000 known cases are the most in the U.S. by far. The Empire State’s death toll of 1,714 accounts for over 40% of all fatalities in the country.\nNew York City Mayor Bill de Blasio orders investigation of Amazon’s firing of strike organizer (CNBC)\n\n*****\n\n&gt; * Global coronavirus cases surged to over 870,000 with 43,287 deaths and about 176,000 recoveries. The U.S. has the most cases of any country and the third-most deaths. Italy’s over 105,000 infections were second highest, but the death toll of 12,428 was the worst. Fatalities in Spain were the world’s second worst at 9,053. Its 102,000 infections ranked third highest. (CNBC)\n\n*****\n\n&gt; * US, Italy and Spain have the most coronavirus cases. These charts show their infection curves (CNBC)\n\n*****\n\n&gt; * China starts to report asymptomatic coronavirus cases (Reuters)\n\n*****\n\n&gt; * In its first report looking at underlying health conditions that could make COVID-19 worse, the Centers for Disease Control and Prevention said people with diabetes, chronic lung disease, heart disease or those who smoke may be at increased risk of developing severe complications if they were to get infected. (CNBC)\n\n*****\n\n&gt; * Becton Dickinson and BioMedomics launch test to detect past and current coronavirus exposure (Reuters)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/dQScHIU.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/8dbexJZ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/TCAK1Yl.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/5rLsTWv.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/X2ee1ao.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($RH $BB $VFF $CHWY $KMX $WBA $PAYS $TTNP $STZ $CALM $GNLN $CSU $CAG $MKC $RMBL $GPL $HEXO $PVH $DARE $CTEK $CYD $NVCN $LW $AYI $ICLK $ALPN $APOG $UNF $EAST $SMTS $CSSE $SCHN $LNDC $NG $RECN $EDAP $APTX $ASND $VRNT $MOTS $VERO)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/InmHVgs.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($BB $PAYS $PUMP $LW $UNF $VRNT $LNDC $JFIN $GWGH $MITO)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/KViHVYP.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/y1h1uND.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/fwVmy1S.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/cdQhL2M.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/pwGKS2L.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/PjQqeP8.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/tpWAwqZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/mHujpzL.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/kWXIIu7.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/yQtjk3q.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SGBX\n* CEMI\n* SPXS\n* SDOW\n* KO\n* INSG\n* OI\n* TZA\n* TLRA\n* SPXU\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/04/01/stocks-making-the-biggest-moves-in-the-premarket-verizon-xerox-home-depot-macys-more.html)**)\n\n*****\n\n&gt; **Verizon (VZ)** – Goldman Sachs added Verizon to its “Conviction Buy” list, saying it offers investors the most attractive combination of total return and risk, thanks to the stability of its wireless business.\n\n&gt; #**STOCK SYMBOL:** VZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n&gt; **Xerox (XRX)** – Xerox dropped its $35 billion hostile bid for HP Inc. (HPQ), saying it was prioritizing its response to the outbreak over all other considerations. Xerox had planned to put up its own slate of directors for election to HP’s board but has now dropped that effort as well.\n\n&gt; #**STOCK SYMBOL:** XRX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XRX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XRX)**)\n\n*****\n\n&gt; **Home Depot (HD)** – The home improvement retailer will institute new safety measures in response to the outbreak, including earlier store closures and limiting the number of customers allowed into stores at one time. The company has also increased paid time off for hourly workers.\n\n&gt; #**STOCK SYMBOL:** HD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HD)**)\n\n*****\n\n&gt; **British American Tobacco (BTI)** – The cigarette maker’s US biotech unit – Kentucky BioProcessing – is developing a COVID-19 vaccine derived from tobacco leaves that is currently undergoing pre-clinical testing. The unit said it could produce between 1 million and 3 million doses per week starting in June.\n\n&gt; #**STOCK SYMBOL:** BTI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BTI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BTI)**)\n\n*****\n\n&gt; **Royal Bank of Scotland (RBS), HSBC (HSBC), Barclays (BCS)** – These and other big U.K. banks canceled their dividends to shore up their balance sheets amid an expected increase in bad loans due to the virus outbreak.\n\n&gt; #**STOCK SYMBOL:** RBS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RBS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RBS)**)\n\n*****\n\n&gt; **Becton Dickinson (BDX)** – The medical products maker and privately held diagnostics company BioMedomics will launch a test that can determine both current and past exposure to the coronavirus within minutes. Becton Dickinson said the tests will be distributed this month.\n\n&gt; #**STOCK SYMBOL:** BDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BDX)**)\n\n*****\n\n&gt; **Macy’s (M)** – The retailer’s stock is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n&gt; #**STOCK SYMBOL:** M\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n&gt; **Caterpillar (CAT)** – Caterpillar will withhold annual salary increases for executives, managers, and salaried employees, in an effort to hold down expenses amid the coronavirus outbreak. The heavy equipment maker will also not pay out bonuses to employees next year.\n\n&gt; #**STOCK SYMBOL:** CAT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAT)**)\n\n*****\n\n&gt; **Quest Diagnostics (DGX)** – Quest has pulled its previous financial guidance for 2020, as it tries to determine the impact of the coronavirus on its results. The medical lab operator said that even with a surge of COVID-19 testing, overall testing volume dropped more than 40% during the last two weeks of March.\n\n&gt; #**STOCK SYMBOL:** DGX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DGX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DGX)**)\n\n*****\n\n&gt; **Sysco Corp. (SYY)** – Sysco is cutting out fresh food sales for its customers and focusing on frozen products, according to a report in the New York Post. The food distributor is also said to be cutting out Saturday deliveries, product returns, and guaranteed delivery times.\n\n&gt; #**STOCK SYMBOL:** SYY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SYY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SYY)**)\n\n*****\n\n&gt; **Papa John’s Pizza (PZZA)** – The restaurant chain’s stock was upgraded to “buy” from “neutral” at MKM Partners, which said the pizza segment of the restaurant industry appears better positioned to deal with the current environment, given their delivery and digital infrastructure.\n\n&gt; #**STOCK SYMBOL:** PZZA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PZZA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PZZA)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk. /u/bigbear0083 is an admin at the financial forums [Stockaholics.net](http://www.stockaholics.net/) where this content was originally posted.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, April 1st, 2020! :)**",
        "subreddit": "StockMarket",
        "title": "Today's Pre-Market Movers &amp; News [Wednesday, April 1st, 2020]",
        "url": "https://www.reddit.com/r/StockMarket/comments/fsyotp/todays_premarket_movers_news_wednesday_april_1st/",
        "created": 1585772292.0
    },
    {
        "author": "IntelligentPackage7",
        "created_utc": 1585727445,
        "id": "fsvaz6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[r/IndiaInvestments](https://np.reddit.com/r/IndiaInvestments/) held an [AMA](https://np.reddit.com/r/IndiaInvestments/comments/fps5ap/ama_on_mfs_investing_behaviour_gaurav_kuvera/) with Kuvera's CEO [u/Gaurav\\_Kuvera](https://np.reddit.com/u/Gaurav_Kuvera/) regarding mutual funds, investment behaviour etc.\n\nSo the popular question that was being asked again and again to [u/Gaurav\\_Kuvera](https://np.reddit.com/u/Gaurav_Kuvera/) was \"***How does Kuvera makes money, if it provides free service for investing through their platform?***\" to which he was replying again and again that he has already answered it in the thread while in fact he had not even remotely answered this particular question.\n\nEven I asked him the same question and now I have been permanently banned by [u/vineetr](https://np.reddit.com/u/vineetr/).\n\nIf CEO of the company choose to not reveal how his company makes money, then there's definitely something fishy.\n\n&gt;As they say, if its free then you are not the customer - you are the product.\n\nClearly the AMA was a mindless marketing stunt by the CEO promoted by the mods of [r/IndiaInvestments](https://np.reddit.com/r/IndiaInvestments/), which has now backfired.\n\n[Mod bashing the user and trying to save the CEO from answering the question](https://np.reddit.com/r/IndiaInvestments/comments/fps5ap/ama_on_mfs_investing_behaviour_gaurav_kuvera/flmqp9l?utm_source=share&amp;utm_medium=web2x).\n\n# Kuvera may be the next [Karvy](https://economictimes.indiatimes.com/wealth/invest/aftermath-of-karvy-stock-broking-fraud-are-your-mutual-fund-investments-safe/articleshow/72304088.cms). Beware of Kuvera.",
        "subreddit": "investing",
        "title": "Mutual fund management startup CEO's AMA PR stunt gone wrong. Now investors know more about their actual \"revenue model\".",
        "url": "https://www.reddit.com/r/investing/comments/fsvaz6/mutual_fund_management_startup_ceos_ama_pr_stunt/",
        "created": 1585756245.0
    },
    {
        "author": "Street_wall",
        "created_utc": 1585725627,
        "id": "fsux1i",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "You guys/girls think that wmt and jnj are still a good buy now? Would not see why they would drop during this pandemic",
        "subreddit": "investing",
        "title": "Defensive stonks for COVID-19",
        "url": "https://www.reddit.com/r/investing/comments/fsux1i/defensive_stonks_for_covid19/",
        "created": 1585754427.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1585743686,
        "id": "fsyqjp",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to the trading month of April and Q2. Here are your pre-market stock movers &amp; news this AM-\n\n*****\n\n#[Today's Top Headlines for Wednesday, April 1st, 2020](https://www.cnbc.com/2020/04/01/what-to-watch-today-dow-set-for-sharp-drop-after-worst-first-quarter-ever.html)\n\n*****\n\n&gt; * Dow futures pointed to a drop of more than 700 points at Wednesday’s open on the first day of April and the second quarter on Wall Street. White House officials are projecting 100,000 to 240,000 U.S. deaths from COVID-19, with fatalities peaking over the next two weeks. The Dow Jones Industrial Average on Tuesday closed out its worst first-quarter ever with a 410-point decline. The Dow’s plunge in March was the worst of any month since October 2008 during the financial crisis. (CNBC)\n\n*****\n\n&gt; * Cramer reveals second-quarter playbook, says the quarter is ‘going to be so ugly’ (CNBC)\n\n*****\n\n&gt; * ADP issues its March report on private sector employment at 8:15 a.m. ET. On Thursday, the government’s look at weekly jobless claims is expected to show a second week of over 3 million people filing for unemployment insurance for the first time. On Friday, the government releases its monthly employment report for March. (CNBC)\n\n*****\n\n&gt; * Start-ups cut nearly 4,000 jobs in March as coronavirus impact ripples through tech (CNBC)\n\n*****\n\n&gt; * The Institute for Supply Management is out with its March manufacturing index at 10 a.m. ET. Economists expect a contraction. February construction spending, also released at 10 a.m. ET, is expected to show an increase of 0.7% following January’s 1.8% advance. The nation’s major automakers, with the exception of Ford (F), deliver first quarter sales figures today. Ford’s numbers come out tomorrow. (CNBC)\n\n*****\n\n&gt; * More borrowers are refinancing their mortgages to save money on monthly payments, while potential homebuyers are backing away fast. Driven entirely by refinancing, total mortgage application volume increased 15.3% last week. Mortgage applications to purchase a home fell 11% last week. Refis surged 26%. (CNBC)\n\n*****\n\n&gt; * Macy’s (M) is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n*****\n\n&gt; * President Donald Trump, in a grim news conference Tuesday evening, sought to prepare Americans for a coming surge in coronavirus deaths, calling COVID-19 a plague and saying the America faces a “very, very painful two weeks.” The president said that according to modeling, a U.S. death toll of 100,000 is a “very low number.” (CNBC)\n\n*****\n\n&gt; * Confirmed cases across the nation rose to nearly 190,000 — nearly double the next worst country — with 4,081 deaths, according to Johns Hopkins University data. New York state’s over 76,000 known cases are the most in the U.S. by far. The Empire State’s death toll of 1,714 accounts for over 40% of all fatalities in the country.\nNew York City Mayor Bill de Blasio orders investigation of Amazon’s firing of strike organizer (CNBC)\n\n*****\n\n&gt; * Global coronavirus cases surged to over 870,000 with 43,287 deaths and about 176,000 recoveries. The U.S. has the most cases of any country and the third-most deaths. Italy’s over 105,000 infections were second highest, but the death toll of 12,428 was the worst. Fatalities in Spain were the world’s second worst at 9,053. Its 102,000 infections ranked third highest. (CNBC)\n\n*****\n\n&gt; * US, Italy and Spain have the most coronavirus cases. These charts show their infection curves (CNBC)\n\n*****\n\n&gt; * China starts to report asymptomatic coronavirus cases (Reuters)\n\n*****\n\n&gt; * In its first report looking at underlying health conditions that could make COVID-19 worse, the Centers for Disease Control and Prevention said people with diabetes, chronic lung disease, heart disease or those who smoke may be at increased risk of developing severe complications if they were to get infected. (CNBC)\n\n*****\n\n&gt; * Becton Dickinson and BioMedomics launch test to detect past and current coronavirus exposure (Reuters)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/dQScHIU.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/8dbexJZ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/TCAK1Yl.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/5rLsTWv.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/X2ee1ao.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($RH $BB $VFF $CHWY $KMX $WBA $PAYS $TTNP $STZ $CALM $GNLN $CSU $CAG $MKC $RMBL $GPL $HEXO $PVH $DARE $CTEK $CYD $NVCN $LW $AYI $ICLK $ALPN $APOG $UNF $EAST $SMTS $CSSE $SCHN $LNDC $NG $RECN $EDAP $APTX $ASND $VRNT $MOTS $VERO)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/InmHVgs.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($BB $PAYS $PUMP $LW $UNF $VRNT $LNDC $JFIN $GWGH $MITO)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/KViHVYP.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/y1h1uND.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/fwVmy1S.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/cdQhL2M.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/pwGKS2L.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/PjQqeP8.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/tpWAwqZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/mHujpzL.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/kWXIIu7.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/yQtjk3q.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SGBX\n* CEMI\n* SPXS\n* SDOW\n* KO\n* INSG\n* OI\n* TZA\n* TLRA\n* SPXU\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/04/01/stocks-making-the-biggest-moves-in-the-premarket-verizon-xerox-home-depot-macys-more.html)**)\n\n*****\n\n&gt; **Verizon (VZ)** – Goldman Sachs added Verizon to its “Conviction Buy” list, saying it offers investors the most attractive combination of total return and risk, thanks to the stability of its wireless business.\n\n&gt; #**STOCK SYMBOL:** VZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n&gt; **Xerox (XRX)** – Xerox dropped its $35 billion hostile bid for HP Inc. (HPQ), saying it was prioritizing its response to the outbreak over all other considerations. Xerox had planned to put up its own slate of directors for election to HP’s board but has now dropped that effort as well.\n\n&gt; #**STOCK SYMBOL:** XRX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XRX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XRX)**)\n\n*****\n\n&gt; **Home Depot (HD)** – The home improvement retailer will institute new safety measures in response to the outbreak, including earlier store closures and limiting the number of customers allowed into stores at one time. The company has also increased paid time off for hourly workers.\n\n&gt; #**STOCK SYMBOL:** HD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HD)**)\n\n*****\n\n&gt; **British American Tobacco (BTI)** – The cigarette maker’s US biotech unit – Kentucky BioProcessing – is developing a COVID-19 vaccine derived from tobacco leaves that is currently undergoing pre-clinical testing. The unit said it could produce between 1 million and 3 million doses per week starting in June.\n\n&gt; #**STOCK SYMBOL:** BTI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BTI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BTI)**)\n\n*****\n\n&gt; **Royal Bank of Scotland (RBS), HSBC (HSBC), Barclays (BCS)** – These and other big U.K. banks canceled their dividends to shore up their balance sheets amid an expected increase in bad loans due to the virus outbreak.\n\n&gt; #**STOCK SYMBOL:** RBS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RBS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RBS)**)\n\n*****\n\n&gt; **Becton Dickinson (BDX)** – The medical products maker and privately held diagnostics company BioMedomics will launch a test that can determine both current and past exposure to the coronavirus within minutes. Becton Dickinson said the tests will be distributed this month.\n\n&gt; #**STOCK SYMBOL:** BDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BDX)**)\n\n*****\n\n&gt; **Macy’s (M)** – The retailer’s stock is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n&gt; #**STOCK SYMBOL:** M\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n&gt; **Caterpillar (CAT)** – Caterpillar will withhold annual salary increases for executives, managers, and salaried employees, in an effort to hold down expenses amid the coronavirus outbreak. The heavy equipment maker will also not pay out bonuses to employees next year.\n\n&gt; #**STOCK SYMBOL:** CAT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAT)**)\n\n*****\n\n&gt; **Quest Diagnostics (DGX)** – Quest has pulled its previous financial guidance for 2020, as it tries to determine the impact of the coronavirus on its results. The medical lab operator said that even with a surge of COVID-19 testing, overall testing volume dropped more than 40% during the last two weeks of March.\n\n&gt; #**STOCK SYMBOL:** DGX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DGX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DGX)**)\n\n*****\n\n&gt; **Sysco Corp. (SYY)** – Sysco is cutting out fresh food sales for its customers and focusing on frozen products, according to a report in the New York Post. The food distributor is also said to be cutting out Saturday deliveries, product returns, and guaranteed delivery times.\n\n&gt; #**STOCK SYMBOL:** SYY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SYY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SYY)**)\n\n*****\n\n&gt; **Papa John’s Pizza (PZZA)** – The restaurant chain’s stock was upgraded to “buy” from “neutral” at MKM Partners, which said the pizza segment of the restaurant industry appears better positioned to deal with the current environment, given their delivery and digital infrastructure.\n\n&gt; #**STOCK SYMBOL:** PZZA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PZZA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PZZA)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, April 1st, 2020! :)**",
        "subreddit": "smallstreetbets",
        "title": "Today's Pre-Market Movers &amp; News [Wednesday, April 1st, 2020]",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/fsyqjp/todays_premarket_movers_news_wednesday_april_1st/",
        "created": 1585772486.0
    },
    {
        "author": "KasssssEgg",
        "created_utc": 1585740580,
        "id": "fsy16h",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "We're looking for experienced affiliate marketers to get involved with us and make some serious 🤑  \n\n\n**A few things to keep in mind:**  \n1. Cookies are up for 60+ Days 🔥  \n2. Average order value is $130 ✅  \n3. Payout is weekly 🎯  \n4. We have a unique highly converting product in a globally emerging market.   \n\n\nThis product is in alternative medicine, similar to CBD/MJ markets.  \n\n\nFacebook/Social Ads are not viable, although PPC works REALLY well we've found, as the demand for this product is huge.   \n\n\nWe ONLY function in Canada due to the nature of the product.   \n\n\nWe already dominate page 1 for many keywords and are now looking to bring in affiliates who can rack in some enticing income.  \n\n\nIf you're interested just get in touch here or fill this form in and we'll approve within 24 hours.   \n\n\nPm me directly if it suits :)\n\nLet's make some money ladies &amp; gents!!",
        "subreddit": "weedstocks",
        "title": "REQUEST Looking for All-Star affiliates",
        "url": "https://www.reddit.com/r/weedstocks/comments/fsy16h/request_looking_for_allstar_affiliates/",
        "created": 1585769380.0
    },
    {
        "author": "acian__",
        "created_utc": 1585740604,
        "id": "fsy1d3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Obviously, travel services has been hit hard by what going on right now, some more so than others. However, I did buy some shares in IAG at 201.5 GBX, and in the news I have been hearing a lot about potential bankruptcy, grounding of flights, etc.\n\nMy biggest concern would obviously be bankruptcy.\n\nIn the case of bankruptcy, Im curious to know what exactly would happen to my share holding.",
        "subreddit": "stocks",
        "title": "Opinions on LSE:IAG right now (British Airways)",
        "url": "https://www.reddit.com/r/stocks/comments/fsy1d3/opinions_on_lseiag_right_now_british_airways/",
        "created": 1585769404.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1585743552,
        "id": "fsypd9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to the trading month of April and Q2. Here are your pre-market stock movers &amp; news this AM-\n\n*****\n\n#[Today's Top Headlines for Wednesday, April 1st, 2020](https://www.cnbc.com/2020/04/01/what-to-watch-today-dow-set-for-sharp-drop-after-worst-first-quarter-ever.html)\n\n*****\n\n&gt; * Dow futures pointed to a drop of more than 700 points at Wednesday’s open on the first day of April and the second quarter on Wall Street. White House officials are projecting 100,000 to 240,000 U.S. deaths from COVID-19, with fatalities peaking over the next two weeks. The Dow Jones Industrial Average on Tuesday closed out its worst first-quarter ever with a 410-point decline. The Dow’s plunge in March was the worst of any month since October 2008 during the financial crisis. (CNBC)\n\n*****\n\n&gt; * Cramer reveals second-quarter playbook, says the quarter is ‘going to be so ugly’ (CNBC)\n\n*****\n\n&gt; * ADP issues its March report on private sector employment at 8:15 a.m. ET. On Thursday, the government’s look at weekly jobless claims is expected to show a second week of over 3 million people filing for unemployment insurance for the first time. On Friday, the government releases its monthly employment report for March. (CNBC)\n\n*****\n\n&gt; * Start-ups cut nearly 4,000 jobs in March as coronavirus impact ripples through tech (CNBC)\n\n*****\n\n&gt; * The Institute for Supply Management is out with its March manufacturing index at 10 a.m. ET. Economists expect a contraction. February construction spending, also released at 10 a.m. ET, is expected to show an increase of 0.7% following January’s 1.8% advance. The nation’s major automakers, with the exception of Ford (F), deliver first quarter sales figures today. Ford’s numbers come out tomorrow. (CNBC)\n\n*****\n\n&gt; * More borrowers are refinancing their mortgages to save money on monthly payments, while potential homebuyers are backing away fast. Driven entirely by refinancing, total mortgage application volume increased 15.3% last week. Mortgage applications to purchase a home fell 11% last week. Refis surged 26%. (CNBC)\n\n*****\n\n&gt; * Macy’s (M) is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n*****\n\n&gt; * President Donald Trump, in a grim news conference Tuesday evening, sought to prepare Americans for a coming surge in coronavirus deaths, calling COVID-19 a plague and saying the America faces a “very, very painful two weeks.” The president said that according to modeling, a U.S. death toll of 100,000 is a “very low number.” (CNBC)\n\n*****\n\n&gt; * Confirmed cases across the nation rose to nearly 190,000 — nearly double the next worst country — with 4,081 deaths, according to Johns Hopkins University data. New York state’s over 76,000 known cases are the most in the U.S. by far. The Empire State’s death toll of 1,714 accounts for over 40% of all fatalities in the country.\nNew York City Mayor Bill de Blasio orders investigation of Amazon’s firing of strike organizer (CNBC)\n\n*****\n\n&gt; * Global coronavirus cases surged to over 870,000 with 43,287 deaths and about 176,000 recoveries. The U.S. has the most cases of any country and the third-most deaths. Italy’s over 105,000 infections were second highest, but the death toll of 12,428 was the worst. Fatalities in Spain were the world’s second worst at 9,053. Its 102,000 infections ranked third highest. (CNBC)\n\n*****\n\n&gt; * US, Italy and Spain have the most coronavirus cases. These charts show their infection curves (CNBC)\n\n*****\n\n&gt; * China starts to report asymptomatic coronavirus cases (Reuters)\n\n*****\n\n&gt; * In its first report looking at underlying health conditions that could make COVID-19 worse, the Centers for Disease Control and Prevention said people with diabetes, chronic lung disease, heart disease or those who smoke may be at increased risk of developing severe complications if they were to get infected. (CNBC)\n\n*****\n\n&gt; * Becton Dickinson and BioMedomics launch test to detect past and current coronavirus exposure (Reuters)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/dQScHIU.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/8dbexJZ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/TCAK1Yl.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/5rLsTWv.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/X2ee1ao.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n*($RH $BB $VFF $CHWY $KMX $WBA $PAYS $TTNP $STZ $CALM $GNLN $CSU $CAG $MKC $RMBL $GPL $HEXO $PVH $DARE $CTEK $CYD $NVCN $LW $AYI $ICLK $ALPN $APOG $UNF $EAST $SMTS $CSSE $SCHN $LNDC $NG $RECN $EDAP $APTX $ASND $VRNT $MOTS $VERO)*\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/InmHVgs.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n*($BB $PAYS $PUMP $LW $UNF $VRNT $LNDC $JFIN $GWGH $MITO)*\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/KViHVYP.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/y1h1uND.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/fwVmy1S.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/cdQhL2M.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/pwGKS2L.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/PjQqeP8.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #4!](https://i.imgur.com/tpWAwqZ.png)**)\n\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/mHujpzL.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/kWXIIu7.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/yQtjk3q.png)**)\n\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS:\n\n* SGBX\n* CEMI\n* SPXS\n* SDOW\n* KO\n* INSG\n* OI\n* TZA\n* TLRA\n* SPXU\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2020/04/01/stocks-making-the-biggest-moves-in-the-premarket-verizon-xerox-home-depot-macys-more.html)**)\n\n*****\n\n&gt; **Verizon (VZ)** – Goldman Sachs added Verizon to its “Conviction Buy” list, saying it offers investors the most attractive combination of total return and risk, thanks to the stability of its wireless business.\n\n&gt; #**STOCK SYMBOL:** VZ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n&gt; **Xerox (XRX)** – Xerox dropped its $35 billion hostile bid for HP Inc. (HPQ), saying it was prioritizing its response to the outbreak over all other considerations. Xerox had planned to put up its own slate of directors for election to HP’s board but has now dropped that effort as well.\n\n&gt; #**STOCK SYMBOL:** XRX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=XRX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/XRX)**)\n\n*****\n\n&gt; **Home Depot (HD)** – The home improvement retailer will institute new safety measures in response to the outbreak, including earlier store closures and limiting the number of customers allowed into stores at one time. The company has also increased paid time off for hourly workers.\n\n&gt; #**STOCK SYMBOL:** HD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HD)**)\n\n*****\n\n&gt; **British American Tobacco (BTI)** – The cigarette maker’s US biotech unit – Kentucky BioProcessing – is developing a COVID-19 vaccine derived from tobacco leaves that is currently undergoing pre-clinical testing. The unit said it could produce between 1 million and 3 million doses per week starting in June.\n\n&gt; #**STOCK SYMBOL:** BTI\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BTI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BTI)**)\n\n*****\n\n&gt; **Royal Bank of Scotland (RBS), HSBC (HSBC), Barclays (BCS)** – These and other big U.K. banks canceled their dividends to shore up their balance sheets amid an expected increase in bad loans due to the virus outbreak.\n\n&gt; #**STOCK SYMBOL:** RBS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RBS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RBS)**)\n\n*****\n\n&gt; **Becton Dickinson (BDX)** – The medical products maker and privately held diagnostics company BioMedomics will launch a test that can determine both current and past exposure to the coronavirus within minutes. Becton Dickinson said the tests will be distributed this month.\n\n&gt; #**STOCK SYMBOL:** BDX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BDX)**)\n\n*****\n\n&gt; **Macy’s (M)** – The retailer’s stock is being removed from the S&amp;P 500 index and will be placed in the S&amp;P SmallCap 600 as of April 6. Macy’s has a market cap of about $1.5 billion, the smallest in the S&amp;P 500. Carrier Global, which will become a publicly traded company as of Friday following its spin-off from United Technologies (UTX), will replace Macy’s in the S&amp;P 500.\n\n&gt; #**STOCK SYMBOL:** M\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n&gt; **Caterpillar (CAT)** – Caterpillar will withhold annual salary increases for executives, managers, and salaried employees, in an effort to hold down expenses amid the coronavirus outbreak. The heavy equipment maker will also not pay out bonuses to employees next year.\n\n&gt; #**STOCK SYMBOL:** CAT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAT)**)\n\n*****\n\n&gt; **Quest Diagnostics (DGX)** – Quest has pulled its previous financial guidance for 2020, as it tries to determine the impact of the coronavirus on its results. The medical lab operator said that even with a surge of COVID-19 testing, overall testing volume dropped more than 40% during the last two weeks of March.\n\n&gt; #**STOCK SYMBOL:** DGX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DGX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DGX)**)\n\n*****\n\n&gt; **Sysco Corp. (SYY)** – Sysco is cutting out fresh food sales for its customers and focusing on frozen products, according to a report in the New York Post. The food distributor is also said to be cutting out Saturday deliveries, product returns, and guaranteed delivery times.\n\n&gt; #**STOCK SYMBOL:** SYY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SYY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SYY)**)\n\n*****\n\n&gt; **Papa John’s Pizza (PZZA)** – The restaurant chain’s stock was upgraded to “buy” from “neutral” at MKM Partners, which said the pizza segment of the restaurant industry appears better positioned to deal with the current environment, given their delivery and digital infrastructure.\n\n&gt; #**STOCK SYMBOL:** PZZA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PZZA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PZZA)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, April 1st, 2020! :)**",
        "subreddit": "stocks",
        "title": "Today's Pre-Market Movers &amp; News [Wednesday, April 1st, 2020]",
        "url": "https://www.reddit.com/r/stocks/comments/fsypd9/todays_premarket_movers_news_wednesday_april_1st/",
        "created": 1585772352.0
    },
    {
        "author": "InattentiveCup",
        "created_utc": 1585738144,
        "id": "fsxive",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Thank you mods for finally listening to your community and for gracing us with this work of art. I'd argue that this is better than anything WSB has had before. I think most of us can agree that mods pretty gay but a little less so now.",
        "subreddit": "wallstreetbets",
        "title": "The new banner.....its beautiful",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fsxive/the_new_bannerits_beautiful/",
        "created": 1585766944.0
    }
]