[
    {
        "author": "DumplingGoddessTe",
        "created_utc": 1601393102,
        "id": "j21cmo",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "Corsair Gaming IPO price of $17 \n\nCurrent price is $18.9 \n\nMost relevant competitor is Logitech ($LOGI) with a current price of 76.46M and a market cap of 12.663B. \n\nKey Points \n\nCorsair has a market cap of 1.727B\nTrading at 58.6% below it’s fair value Mark estimate to be $44.84\n\nBecame profitable by this year with a $1B revenue while Logitech has $2.98B in revenue (which is 4x the current price of $CRSR) \n\nShort term assets cover short term liabilities \n\nWhile debt is covered by operating cash flow (22.2%) \n\n1/4th the price of Logitech. \n\nIs a stable for PC Gaming and PC parts especially in regards to the power supply unit. \n\nCompetes with all its private competitors at every price point (Razer, NZXT, MSI, Logitech, Thermaltake, etc)\n\nMore people building computers and buying peripherals during lockdowns\n\nLogitech’s peripherals always skyrocket for over 3 months  after a Xbox/PlayStation console is released\n\nAlways innovating and also has a focus to upcoming next gen cloud gaming (including peripheral)\n\nNumber 1 seller of memory, cases, power supplies, and streaming gear. \n\nNvidia/AMD dropping new cards everyone will be building a PC with Nvidia Cards, AMD CPU, Corsair/HyperX Ram, Coolers, PSU, Fans, Cases, Keyboards, Headset, Mice. Holiday + Covid earning growth will have this stock above $30 by January 2021. \n\n$LONG Corsair",
        "subreddit": "wallstreetbets",
        "title": "DD The Run of $CRSR (Corsair Gaming)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j21cmo/dd_the_run_of_crsr_corsair_gaming/",
        "created": 1601421902.0
    },
    {
        "author": "dengaz",
        "created_utc": 1599074340,
        "id": "ildgjz",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Just like the title says, I noticed that all my stocks (apple, nvidia, Qualcomm, Tesla, Netflix and Microsoft) had a dip at the same time in the day? What is that",
        "subreddit": "stocks",
        "title": "Dip across all my stocks at same time?",
        "url": "https://www.reddit.com/r/stocks/comments/ildgjz/dip_across_all_my_stocks_at_same_time/",
        "created": 1599103140.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1598992340,
        "id": "iks8sb",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, September 2, 2020**\n\nStocks open September with the bang, as tech continued rallying and benchmarks ended in all-time highs. This is an encouraging start to what is usually a rough month for traders. Both the S&amp;P 500 Index and the Nasdaq set new records on Tuesday, underpinned by the continuing rally in technology shares like Apple ($AAPL), Amazon ($AMZN)  and Microsoft ($MSFT) — which both soared after their stocks split on Monday help boost market sentiment.\n\nThe S&amp;P finished that day 0.97% up, the NASDAQ finished 1.8% up and the DOW finished 0.85% up. Great day for the markets overall!\n\nGoldman Sachs ($GS) said, “while equities have never been as expensive since the Tech bubble, based on a 24-month \\[price/earnings basis\\], the equity risk premium is close to an all-time high, suggesting that equities have rarely been as attractive relative to bonds.” Moreover, July’s economic data in labor and manufacturing broadly overperformed Wall Street’s estimates suggesting the market could get even ‘boomier’, according to JP Morgan ($JPM).\n\nTraders are encouraged by the Fed’s new policy, which promises economic support for as long as necessary, and declining numbers of Coronavirus cases in Southern states like Georgia and Florida, which recently became epicenters for the virus.\n\n**Highlights**\n\n* The ISM Manufacturing Index hitting its highest levels since August 2018.\n* Piper Sandler lifted price target for $ZEN Zendesk Inc from $87 to $123\n* Wedbush increased the price target for $CMG Chipotle Mexican Grill from $1,320 to $1,600\n* $WFC Wells Fargo raised their price target for $QCOM Qualcomm, Inc. from $90 to $120\n* $GS Goldman Sachs raised Price Target of $ZM Zoom Communications from $187 to $402. Shares are up an incredible 40% since earnings report yesterday after the bell on a BLOWOUT quarter.\n* Precious metals once again underperformed. Miners ($GDX) were down 1.42%, Gold ($IAU) was down 0.24% and Silver ($SLV) was down 0.42%\n\n**Notable Earnings for tomorrow, tomorrow, Sept 2:** China Petroleum ($SNP), Copart ($CPRT), Crowdstrike Holdings ($CRWD), GSX Techedu ($GSX), Huazhu Group ($HTHT), Korea Electric Power ($KEP), Mongodb Inc ($MDB), Rocket Companies Inc ($RKT)",
        "subreddit": "StockMarket",
        "title": "Hey! Here is a Market Recap for today, Sept 1",
        "url": "https://www.reddit.com/r/StockMarket/comments/iks8sb/hey_here_is_a_market_recap_for_today_sept_1/",
        "created": 1599021140.0
    }
]