[
    {
        "author": "KnightAnthony",
        "created_utc": 1602257103,
        "id": "j80z41",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "This is an overlooked topic -- **health insurance.** In the USA, at the Federal level, the individual mandate is no longer the law, but many individual states still require you to carry minimum coverage or face a penalty. PLEASE DO THE MATH and figure out for yourself (and your family) if having coverage is a wise or bad investment. Many healthy people are throwing away tens of thousands of dollars a year for coverage they don't need nor use. \n\nOpen enrollment is coming in November. Of course, the COVID-19 pandemic is going to be front and center by the medical and insurance industries to get you to commit to a plan. Be it Bronze, Silver or Gold, be sure to know what the PTC will be with respect to your projected income. From my observation, many people are literally throwing money away just for the sake of \"mental comfort\" or peace of mind. Is the cost worth it?",
        "subreddit": "investing",
        "title": "Remember....health insurance is also an investment you need to consider having or not!",
        "url": "https://www.reddit.com/r/investing/comments/j80z41/rememberhealth_insurance_is_also_an_investment/",
        "created": 1602285903.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1603254125,
        "id": "jf62ke",
        "num_comments": 158,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2020/10/21/jpmorgan-takes-on-square-and-paypal-with-smartphone-card-reader-faster-deposits-for-merchants.html\n\nJPMorgan’s new QuickAccept service lets businesses take card payments within minutes, either through a mobile app or a contactless card reader, and users will see sales hit their Chase accounts on the same day.\n\nThat fast funding is offered free, unlike competitors including Square, which typically take a day or more and charge a 1.5% fee to make instant transfers.\n\nThe bank designed its QuickAccept card reader, a hardware device that processes card payments via tap, dip or swipe, internally with the help of a team gained from its 2017 WePay acquisition.\n\nJPMorgan will soon migrate “a large portion” of its more than three million small business customers to the new service, said Jen Roberts, CEO of the Chase business banking unit.",
        "subreddit": "stocks",
        "title": "JPMorgan Chase takes on Square and PayPal with smartphone card reader, faster deposits for merchants",
        "url": "https://www.reddit.com/r/stocks/comments/jf62ke/jpmorgan_chase_takes_on_square_and_paypal_with/",
        "created": 1603282925.0
    },
    {
        "author": "Hooded_avocado",
        "created_utc": 1603308523,
        "id": "jfjsqv",
        "num_comments": 105,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Should I buy some crypto now like Ethereum and bitcoin? My thinking is once PayPal allows crypto trading on a large scale it will create a surge in the demand for cryptocurrency and thus the price will go up.",
        "url": "https://i.redd.it/e5hrv8yv1iu51.jpg",
        "created": 1603337323.0
    },
    {
        "author": "Fragglepusss",
        "created_utc": 1602776040,
        "id": "jbpt6f",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "  \n\nPositions: BABA, TCHEY, BIDU, NIO, TSM, AVGO \n\nThesis: These companies still have a big growth potential and will have success in pretty much every situation I can think of. If the US continues to rip and has a real V-shaped recovery, Asia will rip with it. If the US crashes due to a financial crisis or reemergence of a public health crisis, Asia has pretty much completely reopened, has almost no community spread, and will be a safe haven while the US tries to recover. I don't know if the US is in a  bubble or not, but I think the multi-trillion market cap of the US tech giants limits upside regardless of how well they perform. I'm also convinced the US is about get fucked by a convergence of a second wave and a bad influenza season. Even if they don't the risk of a US economic crisis over the next year is objectively high.  \n\nBABA and TCHEY: Chinese megacaps that are still valued at under $1T and will definitely eventually get there. I wish I could buy options in Tencent. They are basically Facebook, PayPal, Activision Blizzard, and Softbank combined. Alibaba still has potential to expand into the rest of Asia including India if India-China relations improve. Both companies have virtual monopolies in their main areas of business in China and are not subject to anti-trust legislation going forward like their US counterparts. \n\nNIO and BIDU: Have tiny market caps compared to their US counterparts. Google’s market cap is almost 30x higher than Baidu’s and they trade at about the same P/E ratio. I’ve already made a killing on Nio, which is valued at 30B compared to Tesla’s nearly 500B. Chinese EV appetite is also way bigger than that of the US and the recent upgrade of Nio predicts the Chinese EV market to quadruple by 2025. I expect Nio to eventually break into US and European markets. They’ve also successfully implemented battery swapping and won’t need to invest in vertical integration the same way Tesla is in trying to overcome battery charge life obstacles. Both Baidu and Nio are investing heavily in fully autonomous vehicles. \n\nTSM and AVGO: Semiconductors will continue to see growth in the coming years and it’s the only sector that I have confidence in right now. Another bonus if you choose to buy stock, both of these companies have generous dividends and can represent a decent hedge over the growth companies I listed. If the trade war heats up, they are located in Taiwan and Singapore respectively and will be beneficiaries of changes to US/EU supply chain. TSM is producing high quality chips cheaply and will be a big player in data center, autonomous driving, and AI. Broadcom just inked a deal with Apple for wireless components and will be a big 5G beneficiary. \n\nHow I’m playing it: Long-dated calls that are way out of the money in each of these positions. I’m counting on them to all at least double in the next two years. All of my calls are either Jan 2022 or Jan 2023. I also have sold out of all US stocks in my IRA and bought long positions in only in these names. The only one I’m not holding calls in is TCHEY because I use Robinhood and am not aware of any way to buy options in it.",
        "subreddit": "wallstreetbets",
        "title": "I'm getting the fuck out of US companies. Asia will benefit regardless of what happens in this hemisphere.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jbpt6f/im_getting_the_fuck_out_of_us_companies_asia_will/",
        "created": 1602804840.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1603282340,
        "id": "jfbma0",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/paypal-allow-cryptocurrency-buying-selling-115232905.html\n\nLONDON (Reuters) - PayPal Holdings Inc joined the cryptocurrency market on Wednesday, allowing customers to buy, sell and hold bitcoin and other virtual coins using the U.S. digital payments company's online wallets.\n\nPayPal customers will also be able to use cryptocurrencies to shop at the 26 million merchants on its network starting in early 2021, the company said in a statement.\n\nU.S. account holders will be able to buy, sell and hold cryptocurrencies in their PayPal wallets over the coming weeks, the company said. It plans to expand to Venmo and some countries in the first half of 2021.\n\nStock is up 2.5% premarket, this is a good news for paypal stock and customers.The current e-commerce trend is very favorable for paypal, cryptocurrency plus venmo can unlock more value and growth for paypal.",
        "subreddit": "StockMarket",
        "title": "PayPal to allow cryptocurrency buying, selling and shopping on its network",
        "url": "https://www.reddit.com/r/StockMarket/comments/jfbma0/paypal_to_allow_cryptocurrency_buying_selling_and/",
        "created": 1603311140.0
    },
    {
        "author": "AllDatDalton",
        "created_utc": 1603301291,
        "id": "jfhdta",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "Note: saw I have a lot of messages yesterday on my old username, MiltDavis. This is where I've been posting now cuz mods, so message me here.\nI'm not an expert or anything, but I see a lot of people in the Daily Thread comments slanging VXX around, and a lot of weird information out there. Just trying to be helpful, so here ya go:\n———————————————\n\n**The most basic thing to know is that VIX (so VXX and UVXY by extension) is a measurement of market volatility, not SPY performance.**  Let's say you buy a bunch of AAPL options of one month expiry at an implied volatility (IV) of 50 and FB at an IV of 20, but you have them ending up the same percentage higher at the strike price of your one month expiry--let's say 5% higher.  The logic is that, due to historical and current factors, AAPL is expected to bounce around in much higher and lower swings to reach that 5%--a wilder journey, but the same destination.  The volatility of that journey is what VIX represents, on an extrapolated level, for SPY as a whole.  Think of it like this--VIX is the measurement of IV for the market as a whole, rather than for an individual equity. Because of this...\n\n**VIX does not have to always directly inverse SPY, but instead just often does—80% of the time.** VIX can rise with SPY--or fall with SPY--it's just not as common as inversing SPY.  It can also do it's own thing entirely.  Certain sectors can be performing one way, and SPY another, and these performances factor into the underlying measurements to prevent a break with SPY due to weighting and a shitload of other factors.  SPY can climb rapidly, and volatility can rise with it, because the sharp movement creates just as much variation chaos in the underlyings as a precipitous drop would.\n\n**VIX is represented as an annualized standard deviation number within SPY.**  If VIX is 25, for example, it is estimating movement of 25% in price action in SPY over the course of the next year.  It was above 50 during the March crash, which, when you think about it in those terms, is nuts.\n\n  **VIX is a monthly price estimation based on SPY options premiums.**  SPY trades on it's underlyings and is also tradeable in and of itself, whereas VIX is vessel for trading a bundle of spreads, for lack of a better term.  This is a mathematical--even theoretical--estimate on future market movement based on how much premium people are willing to pay for S&amp;P options, or in other words, it is an estimate of market volatility based on how much money people are willing to pay for insurance on their stocks.  Equity prices are ONLY as important here inasmuch as they effect the pricing of the equity options. The more people are willing to pay for options, the higher VIX goes.\n\n**VIX is NOT the in-the-moment measurement of the underlying SPY put/call option spread—it is forward looking to the monthy expiration**.  In the case of VIX this is a minimum of 23 days and up to 37 days out, with weighting favored toward the one month expiration.  The math is crazy and intricate, on some Rainman shit, but the important thing to know is that VIX isn't a prisoner of the moment, but instead a look at the coming one month landscape taking in all factors over that course in time.\n\n*Real life example*: Many people have been expecting VIX to be much higher as we head into an election, but if we think of it in forward-looking, weighted terms, this moment may have passed--at least as far as the election is concerned.  VIX is taking into consideration, at the moment,  the perceived calmer times beginning toward the end of November after the election.  If you go back and look at VIX values about one month prior to the election date, you can see that VIX was at it's peak on October 5th and 6th, reaching appproximately $30.  This would correlate with the expected movement weighted one month from that day, or in other words, peak fear a day or two after the election.\n\n**Volatility is volatile, and therefore not a buy and hold: **VIX associates VXX and UVXY are known for making people rich on days like June 11th, or in September, when they suddenly climb 10, 15, 20% in a single day or a two day stretch.  Yes, this a large part of it's appeal.  But the real reason people get rich is that VIX IV can climb high--fast--because it's price movements are not considered lasting and great fluctuation becomes priced in.  IV shoots up on these things like crazy, which means that the value of your VIX options shoots up like crazy.  BUT, value also falls like crazy too, and it has intense theta burn (cost appreciation of the asset over time). So, while you are sitting around waiting to make your million dollar play with a VXX monthly you are losing a lot of money in the process.  The VIX knows this, and it smells your weakness, and the day after you've dumped it because you've bled 50% it will rocket to new heights.  Because of this...\n\n**VIX, VXX, and UVXY are meant as loss strategies and hedges, but not as outright plays.**  Unless you are some Burry level TA specialist, or maybe my guy /u/winnning007, and you can pinpoint when certain events are going to happen or the market response within a day or two, you're best to keep a smaller amount as a hedge rather than go all in.  The road to bagholding is short and full of terrors with volatility plays. B**UY SPY PUTS INSTEAD IF YOU ARE BEARISH**\n\n**VIX VXX and UVXY——————-**\n\nSo all that is cool, but VIX is a futures instrument and not a daily tradeable ETF/ETN; *enter VXX and UVXY.*  To keep it simple, I'm going to lump the two together and just say that UVXY is a more levered version of VXX.  So UVXY can climb higher than VXX when it rises, and fall lower than VXX when it falls.  For the purposes of this explanation, I'm going to focus on VXX, but bottom line--if you don't really know what you're doing/aren't confident in your volatility move, stick with VXX rather than UVXY.  The money is still good, don't be a hero.\n\n**VXX tracks the performance of VIX, but offers different expirations **(weekly ETF settlement dates like Friday/Saturday rather than the Wednesday of monthly futures), and tracks it at about a 50% level.  In other words, if the VIX monthly futures have an 8% jump, expect about 4% for VXX monthlies.  VXX is also an ETN, not an ETF--this is important because it means that it must have a direct tracking of the VIX unlike a fund which isn't beholden to a certain rate of correlation.  In other words, VXX MUST track that ~50% of the VIX for efficacy.\n\nWhat's important here: VIX is the futures estimate bundle, and VXX is not VIX, but it is a very reliable tracker of VIX price movements with few notable exceptions.  UVXY is kind of like a levered version of VXX, meant to track with higher returns. These two can and do at times move out of sync with VIX due to something called contango.\n\n*If you want to go in depth on the intricacies of their relationship and contango and shit, I won’t do that here, but this is a good resource:* https://www.schaeffersresearch.com/content/news/2015/02/04/the-messy-relationship-between-vix-and-vxx\n\n**Manipulation**\n\nWhenever VXX doesn't move with SPY, I bitterly joke that it's illegal and manipulated.  This wayward movement is actually more due to the natural variance I pointed out earlier, but there is some truth to it.  CBOE--the VIX providers--have been sued a few times over the past few years due to alleged manipulation of VIX.  Of note, the \"Father of VIX\" as one article called it's creator, was one of the whistleblowers alleging fraud.  The case was recently thrown out again, but the accusations speak for themselves.\n\n&gt;\tThe plaintiffs, traders in VIX-based products, filed a lawsuit alleging that certain features of the settlement process made it especially susceptible to manipulation but that Cboe chose not to enforce its rules against manipulation so it could continue to profit from the VIX products. Specifically, the complaint alleged violations of the Exchange Act antifraud provisions and the CEA and brought claims against both Cboe and anonymous \"Doe\" defendants that allegedly manipulated the settlement values for VIX options and futures by manipulating the two-zero-bid rule and employing a process analogous to \"banging the close.\"\n\nSo, ya know, innocent until proven guilty, but there is a lot of info out there to suggest that a lot of people invested in--and involved in the creation of--VIX through CBOE think it's manipulated.  That can't be ignored.\n\n**Other tidbits to note:**\nA lot of little things matter with VIX; Quad witching dates, portfolio rebalancing dates, Congressional hearings with the FED, release of beige books, stress tests, and FOMC are all catalysts for VXX/UVXY activity if you're searching for short dated FD plays.  Just look at the financial calendar on the FED website or Marketwatch, etc., before you make any moves against volatility. You're one JPOW speech to congress away from the big GUH.\n\n**Positions**: This was meant to be informative more than predictive. \n\nThat said, I don't have a phenomenal read on this market--I'm not a TA guy generally, and a lot of the fundamentals are out the window as we approach the election.  BUT, I expect anticipation of lame-duck political activity should there be a Blue Wave, PLUS uncertainty around COVID second wave restriction regression, PLUS the unveiling of a variety of coming tax changes in a Biden win, will likely bring higher pricing in option premiums and thus higher VIX.\n\n**UVXY 11/6 20c VXX 10/30 24c VXX 11/6 26c**\n**Earnings I like: NTGR, NOW, PYPL, MSFT, CVNA**\n**General shit I like: LMND, JD, DDOG**\n\n**TLDR: VIX does not always move with SPY, it may be manipulated, it is not meant to be held long term, and is future looking not day-to-day.  Trade it thinking of a bigger picture rather than expecting it to react to every daily market event. Never go all in on a monthly, you’ll theta bleed.**\n\nYou can message me and comment and stuff and I’ll get to it. \n\nI AM NOT AN EXPERT.  A lot of the technical terminology you can probably argue with. This is just my own research and experiences.  Do your own research.",
        "subreddit": "wallstreetbets",
        "title": "Volatility for Dummies: VXX UVXY VXX and SPY Correlation Explained (poorly)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jfhdta/volatility_for_dummies_vxx_uvxy_vxx_and_spy/",
        "created": 1603330091.0
    },
    {
        "author": "applespeaks",
        "created_utc": 1601587190,
        "id": "j3hkla",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "If there's one stock that took an unnecessary beating this last month in my opinion it's PYPL. It was at an ATH for $210 and then took a beating to fall to $172. It is back to $196 and I think it is still a great price point to enter for a few reasons\n\n&amp;#x200B;\n\n* BBBY earnings came in better than expected but 80% of the growth was online. Guess who has a great presence in online transactions?\n* PYPL has a tie up with Shopify as a preferred partner. And we all know Shopify sales have been going through the roof. Online sales are not going to end anytime soon. It will be at least next fall before 50-60% of the US has a vaccine assuming approval in December\n* PYPL also has a partnership with FB shops (and more importantly Instagram shops) which are likely to have seen huge sales increase this last quarter post launch\n* PYPL has seen tremendous growth in Venmo which continues to be the platform of choice for P2P transactions\n* Earnings is on 10/13 so there is likely to be a run up to then as well\n\nPositions - 210 11/20 calls and $230 04/21 calls",
        "subreddit": "wallstreetbets",
        "title": "PYPL tendies anyone?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j3hkla/pypl_tendies_anyone/",
        "created": 1601615990.0
    },
    {
        "author": "dellywally",
        "created_utc": 1603471644,
        "id": "jgqtd0",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "I like Square as a company and see a lot of people are bullish about it. However, a few things stop me from investing. Be interested to hear thoughts but at the moment I am a Square bear. \n\n**Management**\n\nJack Dorsey is a visionary. I don’t think this is controversial. However, his track record at Twitter is worrying for shareholders. Be it daily active user growth, ambition with acquisitions but ultimately failure to monetise a fantastic platform where you have big corporations, celebrities and even the President reaching out to 200m daily active users for free. With Square, the closed loop business model of businesses and consumers is again a fantastic concept that could break the power of Visa/Mastercard. Execution remains to be seen, of course. \n\n**Competition**\n\nSquare operate in a highly competitive field for consumers and businesses. Let’s take consumers based on Square’s fast-growing Cash App. It offers things a normal bank does like deposits, ATM access, money transfer. If it becomes a fully-fledged bank offering loans, credit; it is competing against the likes of big incumbents (e.g. JP Morgan, Bank of America). Granted they’re dinosaur firms but they already have a huge customer base that are older and, therefore, have more money and deposits. This means it is much easier for them to monetise their customers resulting in high ARPU. Why would these lucrative customers, en-masse, want to uproot their finances to Square when their existing providers will be providing the same service by copying Square, as JP Morgan have done this week? [Link](https://www.pymnts.com/smbs/2020/jpmorgan-takes-on-square-and-paypal-at-the-point-of-sale/) \n\nFor businesses, Square’s provides software offering (invoicing, PoS, online store) but face strong competition from the likes of Shopify who are taking a fully integrated service approach to SMEs which allows them to take their business online but also manage all their backend processes, including payments. This is a highly convenient service for entrepreneurs. Shopify already has 6% share of the online retail market. Square also provides hardware products which make it easy for SMEs, in particular, to take payments. However, there is evidence that retail is facing a more permanent shift in the US vs. the rest of the world with 60% less footfall today than a year ago [Link](https://www.spring-board.info/benchmarks/benchmark/daily-footfall). 58% of Square’s GPV is from food/drink, retail and professional services. Square may have good market share but it is a shrinking industry.\n\nAnd as a final piece, competitors in both spaces are generally in very healthy financial shape: Paypal, Shopify, Global Payments, Western Union and big banks are well-capitalised. \n\n**Valuation**\n\nPerhaps you can get over the above with the fact that Square has strong network effects and are able to win customers cheaply. However, in my opinion, Square is priced for perfection. Simply looking at a price/sales metric, it is trading 13x LTM. This is high but maybe relatively reasonable for a fast-growing business. However, 25% of Square’s revenue is accounted by Bitcoin “revenue”. This brings little value to Square (2% gross profit) and even Square themselves discount this revenue in their KPIs because it is “out of their control and not reflective of Square’s performance”. \n\nNow onto profits. It is not fair to be too hard on Square’s profitability. After all, it is in high growth phase and its marketing costs were its highest opex line item at roughly 35% for YTD. However, a cursory look at it is Enterprise Value / EBITDA (forward look to Dec2020), it is 242x. If we give credit for Square’s business plan for a further two years, today’s Enterprise Value over broker consensus forecast EBITDA for 2022, it is still a heady 77x. This is when Square is supposed to have EBITDA of $1bn which is three times more than it is forecast for Dec 2020. Priced to perfection.\n\nIf you compare it to Paypal, it is trading at 39x and 27x EV / EBITDA for Dec 2020 and 2022.\n\n**Conclusion**\n\nSquare has formidable backers like Ark Invest. I am also not a great believer in “dumb retail” overvaluing a stock for a prolonged period of time. But for reasons above, I am cautious with Square and yet it keeps climbing so please tell me what I am missing…",
        "subreddit": "stocks",
        "title": "SQ",
        "url": "https://www.reddit.com/r/stocks/comments/jgqtd0/sq/",
        "created": 1603500444.0
    },
    {
        "author": "lykosen11",
        "created_utc": 1602782936,
        "id": "jbs3xy",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "What is your top convictions, where you feel as close to certain as you can about its future. Upside or downside. \n\nMine:\n\n\n1. Square ($SQ) is going to be a $1 trillion dollar company in my lifetime. I am honestly amazed how well this company is positioning themselves. They will move away from small business as they slowly replace the wallet and cash of the US. Similar things have already happened in Sweden, world leader in digital payments. Square is doing the same but in the US, while being the best trusted bitcoin handler and small business backend.\n\n2. Paypal ($PYPL) is slowly moving themselves into e commerce in a way they haven't before. They are light years ahead of anyone in ease of payment, and is rapidly spreading into a global power. If your country has a population, it takes PayPal for online purchases. On top of it, Venmo is the only threat to Squares cash app, so why not own both. \n\n3. Facebook ($FB) is going to be one of the solid heavy weights of the next 10 years, where some people vocally hate on them while they are raking in money hands over fists from the entire world. They have shown an almost disgusting ability of killing completion, and wouldn't be hurt much from a potential breakup (which I personally doubt will happen. Future post). Additionally, they just had a massive blow out success in VR, releasing the quest 2 incredibly successfully. VR will be mainstream and Facebook WILL be the king of it. \n\n:) \n\nAs you may notice from my picks, I am betting on the death of cash. And I really really do. No price targets as I plan holding these forever. My models to suggest overpriced fairly, but I belive their growth will accelerate as new services/monitazationa are released.\n\nWhat do you belive in?",
        "subreddit": "StockMarket",
        "title": "Let's talk stocks: Whats your top 3 convictions?",
        "url": "https://www.reddit.com/r/StockMarket/comments/jbs3xy/lets_talk_stocks_whats_your_top_3_convictions/",
        "created": 1602811736.0
    },
    {
        "author": "checkinggg",
        "created_utc": 1601741257,
        "id": "j4hme1",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "**Apple, Inc.**\n\n* Apple's iPhone 12 Series Prices Leaked, Cheapest iPhone Might Cost $649.\n\n**Tesla, Inc.**\n\n* 'Waiting for Years': Indians Welcome Elon Musk's 'Promise' to Bring Tesla to Desi Roads by 2021.\n\n**Amazon.com, Inc.**\n\n* Flipkart to host Big Billion Days sale from Oct 16-21; Amazon to announce next week\n\n**AstraZeneca Plc**\n\n* COVID-19 vaccine likely to be released within 3 months in UK: Report\n\n**PayPal Holdings, Inc.**\n\n* Martin Lewis issues warning to anyone with a PayPal account\n\n**Gilead Sciences, Inc.**\n\n* Could Remdesivir help aid President's coronavirus symptoms?\n\n**Regeneron Pharmaceuticals, Inc.**\n\n* President receiving experimental treatment for Covid-19\n\n**Novan, Inc.**\n\n* Novartis announces five-year data that reinforce the safety and efficacy profile of Aimovig® (erenumab-aooe) in adult patients with episodic migraine\n\n**Oracle**\n\n* Larry Ellison’s TikTok Bid Puts Oracle Chairman Back in the Spot",
        "subreddit": "wallstreetbets",
        "title": "Today's Top News",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j4hme1/todays_top_news/",
        "created": 1601770057.0
    },
    {
        "author": "hydershykh",
        "created_utc": 1603421820,
        "id": "jgeont",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Hey folks,\n\nI recently developed a [bot](https://twitter.com/TradyticsAIbot) that uses AI to analyze options flow and predicts directions for individual option contracts. It also tells you whether you should buy to open or sell to open a contract which is something that's not really available anywhere else. And it's 100% free since it's a [twitter account](https://twitter.com/TradyticsAIbot). Here are some alerts from today that I am keeping an eye on tomorrow and the next few days.\n\nBearish means the price of contract will go down while bullish means the price of contract will go up.\n\n# $PINS\n\nI believe both $PINS and [$SNAP](https://www.tradytics.com/bullseye-dashboard?alert=-Kw0NE-gbjJn-S7H2b-j6jZ7-1VL7D) are a bit overextended right now and need to dip. One of [SNAP](https://www.tradytics.com/bullseye-dashboard?alert=-Kw0NE-gbjJn-S7H2b-j6jZ7-1VL7D) alerts today had a gain of 85%. That is further confirmed by this alert. Bearish on CALL mean either Sell to Open the call or Buy to Open a put.\n\n[Track alert at: https:\\/\\/www.tradytics.com\\/bullseye-dashboard?alert=-U6wco-znVFx-RA167-DSU76-cvHSh](https://preview.redd.it/s138kigzbru51.png?width=587&amp;format=png&amp;auto=webp&amp;s=de09683f91d49b720fc53a2db1be3d5e6176a690)\n\n# $SQ\n\nSQ had dipped quite nicely the last few days and it is about to be on a resistance line ([https://i.imgur.com/ow1F4vh.png](https://i.imgur.com/ow1F4vh.png)). This contract seems to have a long expiry and this looks like a good one. Maybe too costly so you can get in on a cheaper one.\n\n[Track alert at: https:\\/\\/www.tradytics.com\\/bullseye-dashboard?alert=-t1xlI-wzasX-Vsip8-sHlJz-eD7fx](https://preview.redd.it/8cb6589ycru51.png?width=591&amp;format=png&amp;auto=webp&amp;s=f1fb92211b9759b788b94db2ced908b0391f07f5)\n\n# $PYPL\n\nPYPL was about to break a good resistance level but failed ([https://i.imgur.com/NG02hoH.png](https://i.imgur.com/NG02hoH.png)). There is another support right below the current price so if we can somehow stay there, this is a good contract. Again, you can go a bit cheaper.\n\n[Track alert at: https:\\/\\/www.tradytics.com\\/bullseye-dashboard?alert=-lmRJF-bA5ZF-h5tE1-1tG13-cWlKf](https://preview.redd.it/v4sf93gddru51.png?width=594&amp;format=png&amp;auto=webp&amp;s=acdca1c06d4f43f92eef21388c1008e41e28e775)\n\nThat's it - I just want to see if there's demand for these daily alerts in the community here. If you folks like this style of alerts, I'll post them on daily basis with my thoughts.\n\nComments?",
        "subreddit": "smallstreetbets",
        "title": "AI Based Options Contracts Daily Watch list - October 23rd, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jgeont/ai_based_options_contracts_daily_watch_list/",
        "created": 1603450620.0
    },
    {
        "author": "__justsayin__",
        "created_utc": 1601850209,
        "id": "j57vcm",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "With health care systems under intense scrutiny during the pandemic, Vancouver’s Well Health Technologies Corp. has seen massive growth as it invests in digital tools to make care more efficient for clinicians and patients alike.\n\nWell’s share price has risen nearly 350 per cent this year, to $6.98 on the Toronto Stock Exchange at the end of Friday, as the pandemic-dominated period has seen health care practitioners and clinics invest in telehealth and other digital health technologies. What began as a network of yoga studios has turned into a nimble medical-technology company with its sights set on improving how health clinics work.\n\nIn the past five weeks alone, Well has launched an app marketplace for clinic owners to find ways to manage aspects of their business such as online booking and workflow automation; announced a US$14-million controlling investment in the U.S. telehealth company Circle Medical, giving the company access to health care markets in 35 states; closed a $23-million private placement led by Hong Kong billionaire Li Ka-shing; and revealed a $70-million bought-deal financing underwritten by Eight Capital and Stifel GMP.\n\nIn an interview, Well’s founder and chief executive Hamed Shahbazi said the company wants to take a long-view approach seeking technology that improves health outcomes. “It was not too long ago that we didn’t even know we needed to sanitize our operating tools,\" he said. \"Technology is responsibly for our life expectancies increasing. ... We can’t take it for granted.”\n\nTechnology wasn’t really what Mr. Shahbazi had in mind when he first founded the company as a network of yoga studios licensing Deepak Chopra’s eponymous yoga-studio brand in Canada. In 2017, it listed on the TSX Venture Exchange under the name Wellness Lifestyles with a reverse takeover. That same year, PayPal Holdings Inc. bought Mr. Shahbazi’s payment-processing company, Tio Networks Corp., for US$304-million – although PayPal suspended Tio operations several months later after a data breach was found.\n\nMr. Shahbazi first had no intention of running Wellness Lifestyles day to day, but soon became curious about the state of primary care in Canada. Everything he studied about Canadian health care, he said, “seemed to point at all this fragmentation in the system.”\n\nTechnology adoption has been slower here than in other countries. The 2019 Commonwealth Fund International Health Policy Survey of Primary Care Physicians, for example, found that a low percentage of Canadian doctors were able to electronically share information with other clinical providers: Just 22 per cent could share patient clinical summaries, for example, versus 93 per cent in Norway.\n\nAlthough Canada’s health care system is public, Mr. Shahbazi realized its many privately owned medical clinics could benefit from technology sold at scale – saving their already busy physicians from having to deal with issues such as network security on their own. With Tio sold, Mr. Shahbazi became Wellness Lifestyles’ CEO in May, 2018. The company rebranded as Well Health Technologies two months later, refocusing on primary care.\n\nMr. Shahbazi is a consolidator at heart and looked up to Canadian software acquisition powerhouses such as Constellation Software Inc. and Enghouse Systems Ltd. as he built up Tio in the previous decade. He’s building Well the same way.\n\nThe company now has a network of 20 physical clinics in British Columbia; a new subsidiary to expand its “allied health” holdings, such as sleep, mental-health and physiotherapy clinics; and a network of digital services that the company says serves more than 2,000 clinics and more than 10,000 physicians, largely in B.C. and Ontario. The company now has 266 employees on top of its health care practitioners, who work as independent contractors.\n\nWell’s growing cache of software and partnerships is largely based off of the McMaster University-founded Open Source Clinical Application and Resource (OSCAR) system for electronic medical records. Mr. Shahbazi said he hopes that centralizing much of this software in Well’s new app marketplace, called apps.health, will encourage more medical clinics to invest in digitization.\n\nLaurentian Bank Securities analyst Nick Agostino said the company’s acquisition-heavy approach was wise. “Having both physical and virtual clinics makes a lot of sense to grab hold of patients and capture recurring revenue,\" he said.\n\nIn Canada, Well’s strategy most closely competes with blended virtual-physical health care investments by legacy companies such as Loblaw Cos. Ltd. and the growing health wing of Telus Corp., Mr. Agostino said.\n\nWell jumped from the Venture Exchange to the TSX this past January, and its strategy has since pushed its market capitalization to more than $1-billion – more than triple the value of Tio when it was sold to PayPal.\n\nAnalyst Doug Taylor of Canaccord Genuity raised his price target for Well to $8 from $6 last week as the company announced its app marketplace at a moment when investors are already interested in health care technology. “Well stands to benefit from streamlined cross-selling of its growing stable of proprietary health care technology assets and revenue sharing from third-party software,” he wrote in a research note.\n\nThe pandemic-driven shift to digital pushed Well’s revenue for the quarter ending June 30 to $10.6-million, up 43 per cent from the year prior. Digital services accounted for $2.3-million of that – a 1,212-per-cent increase from the year earlier, owing to pandemic adoption and Well’s acquisition spree.\n\nhttps://www.theglobeandmail.com/business/article-well-health-ceo-sees-canadas-health-clinic-market-as-ripe-for/",
        "subreddit": "CanadianInvestor",
        "title": "Well Health CEO sees Canada’s health clinic market as ripe for technological disruption",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/j57vcm/well_health_ceo_sees_canadas_health_clinic_market/",
        "created": 1601879009.0
    },
    {
        "author": "UnusualW_Mod",
        "created_utc": 1602441185,
        "id": "j9aoyu",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "I think there is a big way to make consistent money similar to trade deals and corona virus hype that people are not exploiting yet.\n\nEverytime stimulus news is brought up, payment providers rally. You can see this inPaypal, Visa, and Square right now.\n\nThis is partially lead to SQ reaching all time highs and Paypal and Visa to be close as well. Even though in contact payments from SQ is down, they have converted successfully via cashapp to online movements.\n\nLooking at some flow, look at $SQ’s run on Friday:\nhttps://gyazo.com/1eb2621dfb91c6e1e72b6380464e48cf\n\nThis is despite the news of a wavering stimulus. In fact, it looks like option flow is heading that way on [these payment providers](https://twitter.com/unusual_whales/status/1311683758735597569) with big movements happening earlier this month in anticipation of the stimulus.\n\nPaypal and Visa are looking a little beat up in comparison, but I think the flow will hit them too. I suspect Monday/Tuesday we get a lot of talk about the stimulus after the weekend and Trump’s Friday offers. Plus pressure from the populace to make a deal happen.\n\nFor example, Trump may go bigger than [a 2.2 trillion COVID stimulus](https://twitter.com/samstein/status/1315306191178825735).\n\nAs result, some positions I have: PYPL $202 call 10/30 and SQ $220 call 10/23, and I am bullish on all payment companies as a result. What do you guys think?",
        "subreddit": "options",
        "title": "Stimulus and Payment Processors - Catch the news",
        "url": "https://www.reddit.com/r/options/comments/j9aoyu/stimulus_and_payment_processors_catch_the_news/",
        "created": 1602469985.0
    },
    {
        "author": "CadillacKid46",
        "created_utc": 1603319339,
        "id": "jfn80y",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Bitcoin is mooning after Paypal added crypto to their platform. Other transaction services are sure to follow and another stimulus will only blow the price up more. I’m all in on miners\n\nPositions: MARA 12/18 4c and 5c, MARA 3/19 2.5c and 4c",
        "subreddit": "wallstreetbets",
        "title": "BTC blows past 13k",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jfn80y/btc_blows_past_13k/",
        "created": 1603348139.0
    },
    {
        "author": "zhexiangxd",
        "created_utc": 1602909409,
        "id": "jcoyfl",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "After doing some research I came up with 12 stocks that I would like to own for the long term. However I have limited capital and thus need advise on choosing 5 that has the highest growth potential. \n\nAAPL\nAMD\nNVDA\nAMZN\nBABA\nJD\nSE\nDIS\nFB\nPYPL\nSQ\nTSLA\n\nPersonally I like TSLA and FB the most. Thoughts?",
        "subreddit": "stocks",
        "title": "If you can only pick 5 out of 12 stocks to invest long term, which 5 would you pick?",
        "url": "https://www.reddit.com/r/stocks/comments/jcoyfl/if_you_can_only_pick_5_out_of_12_stocks_to_invest/",
        "created": 1602938209.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1602430981,
        "id": "j97m8q",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n&amp;#x200B;\n\n[AMD introduction to REDACTED](https://preview.redd.it/8elzjikqjhs51.png?width=3724&amp;format=png&amp;auto=webp&amp;s=c6197b87c2def8e59619d3a94e43762f842ee4eb)\n\n# AMD 120c 12/18\n\nBullish sentiment:\n\n\\- AMD\n\n\\- Bank of America\n\n\\- Microsoft\n\n\\- Paypal\n\n\\- Teradyne\n\n\\- Texas Instruments\n\n\\- General Electric (small nuclear reactors 2023)\n\nMy interest in AMD started around 2016 when I started to seriously learn about operating systems in my computer science courses. I sincerely found my study in operating systems to be absolutely profound when I was seeing the web and gaming world development ultra fast. I'm still totally blown away by it and I currently work for a fintech API. It's beautiful and has drawn my imagination for years.\n\n[Big tech dominance in the web](https://preview.redd.it/bwzq52qtjhs51.png?width=1439&amp;format=png&amp;auto=webp&amp;s=b722c3c49f6aed0f2e90472a779d7ab4a560b57c)\n\nI valued the \\[redacted\\] a lot at the time because I thought that the relationship between its cryptography and heat was significant and I wondered what would become of that.\n\nToday, I still value \\[redacted\\] and I don't believe that the energy required for \\[redacted\\] is trivial. I think the software that governs it is consequential. It opens up limitations of the financial sector with respects to machine-to-machine or network-to-network communications. I always believed that the \\[redacted\\] had a serious intent in the industrial sector by being able to record work generated and output by machines. As in, \\[redacted\\] is not a currency for people, but for machines.\n\n\\- What is the recorded work of a Walmart with a digital redesign that records QR codes on Paypal and the machining that protects it?\n\n\\- What is the recorded work of a truck that drives itself?\n\n\\- What is the recorded work of multiple automated machines working together in succession to complete a task?\n\n\\- What is the recorded work of a server that computes information that's increasingly more meaningful to you?\n\n**I decided to follow this stock seriously after learning about Lisa Su's history at Texas Instruments.** If you look at my research in my profile, you'll see that I'm profoundly interested in the development of Mexican-American modernization and synergy efforts. Texas Instruments was a core element to that due to their deep roots in embedded systems across multiple sectors (automotive and energy consumption).\n\n**I sincerely believe that AMD will acquire Xilinx for far less than 30B** and I believe that the strategy will be an entrance into the industrial automation sector in an aggressive shift while primarily focusing on energy efficiency, international compliance and regulatory needs, graphics processing, and machine-to-machine communications.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Teradyne on System-on-Chip and chip needs](https://preview.redd.it/a7bwys2wjhs51.png?width=1164&amp;format=png&amp;auto=webp&amp;s=9f682177468e3e962b1364c84939337ec5570126)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n03uposyjhs51.png?width=1965&amp;format=png&amp;auto=webp&amp;s=75a1e1528e1383f9a4352c777acdd77e55ab43c0\n\n[Texas instruments on industrial automation](https://preview.redd.it/3flaqr8ekhs51.png?width=1997&amp;format=png&amp;auto=webp&amp;s=30dce954817e515e6f7e5513c2dbaec8351e9848)\n\nCloudflare's relationship with requests made per unit of energy",
        "subreddit": "wallstreetbets",
        "title": "AMD: The Green New Deal and Redacted",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j97m8q/amd_the_green_new_deal_and_redacted/",
        "created": 1602459781.0
    },
    {
        "author": "Shaun8030",
        "created_utc": 1603326490,
        "id": "jfp87q",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Is square and their business model toast. Why would any small or mid size business not switch their account over to JPM in order to have faster access to funds and save on fees. There is no benefit from sticking with square as a business owner. Should I sell while still up 60 percent. Only a takeover can save them now ?\n\nhttps://www.google.com/amp/s/www.pymnts.com/v/s/www.pymnts.com/smbs/2020/jpmorgan-takes-on-square-and-paypal-at-the-point-of-sale/amp/%3famp_js_v=0.1&amp;usqp=mq331AQFKAGwASA%253D#ampf=",
        "subreddit": "investing",
        "title": "Square toast",
        "url": "https://www.reddit.com/r/investing/comments/jfp87q/square_toast/",
        "created": 1603355290.0
    },
    {
        "author": "lizard2014",
        "created_utc": 1602292562,
        "id": "j8bife",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "So a little background on me. I work for a university and make good money, and over the acedemic breaks over the summer I joined Etsy to sell some homemade good, and it did extraordinarily well. Now that I have a good positive cash flow, I want to invest and try to grow my money. I don't know much about the stock market, except that March was a good time to buy in lol. I don't know what calls are, I looked at r/wallstreetbets and found too much shit posting, joined in the GME hype and didn't sell out this morning so I ended up losing money on it, but not much at least. I also didn't know that the markets were closed on Saturday. Are they closed Sunday too? Do stocks continue to move during closed times or do they remain stagnant?\n\nTo the point. I'm looking at ETSY, Microsoft, PayPal, shopify, GE. They seem to be doing good, especially etsy which went up like $100 this year. But I don't know what good beginners stocks would be. I already bought into etsy with 1 share and earned a few bucks. But just because they are doing really good at this time, does it seem like a good idea to buy in? Especially during this pandemic with no stimulus anytime soon (I'm in the US), I'm afraid of the stocks falling again, but not too worried, sound like if they fall just buy in maybe?\n\nWhat are good strategies to find out what stocks are best? Do I follow certain companies closely to find out what moves they will make? How do I know if what they will do is going to be beneficial? What kind of things should I be looking out for? and finally, what strategies has worked for you?\n\nI'm excited and nervous, losing $300 wouldn't kill me but it would hurt a little.",
        "subreddit": "stocks",
        "title": "I'm new to the stock market, as in I just joined with $300 this week. I'm looking at some stocks and want to know others opinions/advice on what would be good for the future.",
        "url": "https://www.reddit.com/r/stocks/comments/j8bife/im_new_to_the_stock_market_as_in_i_just_joined/",
        "created": 1602321362.0
    },
    {
        "author": "marchsnow",
        "created_utc": 1603292419,
        "id": "jfegr5",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "JPM bank makes a ton of money every quarter (unlike the common negative EPS from tech). They are being investigated in the US for PM manipulation from owning 80% of the silver market. They purchase startups like WePay and are in every market in the world. They are boring and massive. Arguably one of the strongest banks in the US. They just need to decided to to something that would make them look cool to the growth people.\n\nWell, today they announced they are going to cut out Square and Paypal from the payment process: https://www.cnbc.com/2020/10/21/jpmorgan-takes-on-square-and-paypal-with-smartphone-card-reader-faster-deposits-for-merchants.html\n\nI wouldn't buy JPM yet, but start watching this bank if you're not. If they pull this off (and move into expanding it) we're taking about serious damage to companies in fintech with such a big foot in the door.",
        "subreddit": "wallstreetbets",
        "title": "JPM is moving into payment processing with a smartphone card reader",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jfegr5/jpm_is_moving_into_payment_processing_with_a/",
        "created": 1603321219.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1603310949,
        "id": "jfkl7c",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, October 21, 2020**\n\nStocks traded choppily today as market participants closely monitor development in Washington surrounding stimulus. Though Pelosi’s self-imposed deadline of 48-hours to reach an agreement came and went, discussions continue.\n\nThe Nasdaq (QQQ) finished the day 0.08% down, the S&amp;P 500 (SPY) finished 0.21% down, and the Dow Jones (DIA) underperformed the most, ending the day 0.35% down.\n\nHouse Speaker Nancy Pelosi told Bloomberg TV that she was willing to keep stimulus discussions open past her Tuesday deadline and said she is “optimistic” about the progress being made. White House Chief of Staff Market Meadows said on CNBC that negotiators were working hard to get a deal done by the weekend, and that White House increased its offer by another $80 billion to $1.88 trillion.\n\nDespite support from the President and top government officials, questions remain over whether the Republican-controlled Senate, who have publicly disparaged the bill, would vote to advance any deal. Senate Republicans have so far baulked at the high price-tag the proposals. According to an article released by the New York Times, Senate Majority Leader Mitch McConnell privately told Republican senators on Tuesday that he had warned the White House not to strike a pre-election deal with Speaker Nancy Pelosi on a new round of stimulus, moving to head off an agreement that President Trump has demanded but most in his party oppose. McConnell’s remarks, which were confirmed by four Republicans familiar with them, threw cold water on Mr. Trump’s increasingly urgent push to enact a new round of pandemic aid before Election Day and came just as Ms. Pelosi offered an upbeat assessment of her negotiations with Steven Mnuchin.\n\nIn other news, Senate Democrats successfully blocked the Republicans’ attempt to pass a targeted $500 billion coronavirus bill, with Pelosi, Mnuchin, and the White House engaged in a desperate attempt to come to a much-needed agreement before the November election. The bill, similar to one the Republicans tried to pass some weeks ago, fell in a 51-44 vote, falling short of the 60 supermajority required. Republicans in Congress argue Democrats have reached for an expensive wish list filled with many provisions unrelated to the crisis. McConnell said the Democrats are engaging in “all-or-nothing obstruction” as they hold out for a comprehensive deal worth about $2 trillion. In response, Democrats accuse the GOP of failing to recognize the magnitude of the economic and health crisis that is gripping the country. Senate Minority Leader Chuck Schumer (Democrat, New York) has called the Republican plan paltry, partisan, and emaciated. \n\nHouse Speaker Nancy Pelosi said she “has a prospect for an agreement” with Treasury Secretary Steven Mnuchin on a coronavirus stimulus package, but floated the possibility that it may not come together in time to pass both chambers before the Nov. 3 election. “There will be a bill. The question is: is it time to pay the November rent — my goal — or will it be shortly after. I want people to know that help is on its way. It will be bigger. It will be better. And it will be retroactive.” It seems the chances for any sort of short-term stimulus before November 3 are slipping away.\n\n**Highlights**\n\n* Snapchat (SNAP) rocketed up today after posting better than expected quarterly earnings report. The Stock was up 30.88% at the time of writing. Other social media stocks (FB, TWTR, an notably PINS) were up in sympathy\n   * EPS of $0.01 vs -$0.04 expected\n   * Revenue of  $678.7 million vs. $547.2 million expected\n* United Airlines (UAL) will on Wednesday test a digital health pass as part of a global pilot program designed to accelerate a safer opening of international borders and kick-start global travel. Under this system, travelers will have taken a COVID-19 test up to 72 hours before traveling, and logged the results from a certified laboratory on the CommonPass app on their phones.     \n* Purdue Pharmaceutical, the maker of opioid painkiller OxyContin, plead guilty to three federal criminal charges for its role in creating the nation's opioid crisis and will pay more than $8 billion and close down the company. The money will go to opioid treatment and abatement programs. DEA Assistant Administrator Tim McDermott said, “Purdue Pharma actively thwarted the US’ efforts to ensure compliance and prevent diversions. The devastating ripple effect of Purdue’s actions left lives lost and others addicted.” This is one of the most significant blows dealt by the US government against the opioid epidemic. \n* Nokia (NOK) and Greener Acres Canada disclosed on Wednesday an agreement to upgrade Canada's utility pole infrastructure to smart, eco-friendly poles across the country.\n* Renewable energy giant Iberdrola, through its U.S. subsidiary Avangrid, will acquire PNM Resources (PNM) which is New Mexico’s largest utility. This goes in line with a mandate adopted in 2019 to become Carbon Free by 2045. Under the proposed merger, shareholders of PNM will receive $4.3B in cash about a 10% premium on yesterdays closing price.\n* Bank of America analyst Justin Post upgraded Pinterest from Neutral to Buy and raised his price target from $45 to $58.\n* Australia’s competition watchdog will consider its own antitrust case against Google, the commission chairman said Wednesday after the U.S. The Justice Department sued the company for abusing its dominance in online search and advertising.\n* J.C. Penney (JCP) believes it will emerge from bankruptcy protection before Christmas under a new ownership agreement that would save tens of thousands of jobs.\n* Snapchat (SNAP) after a blowout earnings call yesterday, too many analyst price targets to list!\n* they are all over $40, except for Morgan Stanley at $36. Everyone is Bullish!\n* Square (SQ) had a price target raise by Barclays from $185 to $215 at OVERWEIGHT\n* Paypal (PYPL) had a price target raised by Barclays from $228 to $235 at OVERWEIGHT Company announced acceptance and operation of crypto on their platform! Keep an eye out.\n* Service Now (NOW) had a price target raised by Morgan Stanley from $467 to $512 at EQUAL WEIGHT.\n* Netflix (NFLX) dumping after underperforming earnings estimates. Stock down 6.58% at the time of writing\n   * EPS: estimate $2.13 vs actual $1.74\n   * Revenue: estimate $6.38 vs $6.44\n* Netflix (NFLX) earnings yesterday came below expectation. Nevertheless, had a price target raise, among others, by:\n   * BMO Capital $625 to $700 OUTPERFORM\n   * Royal Bank of Canada $610 to $630 OUTPERFORM\n   * Wells Fargo $470 to $510 EQUAL WEIGHT\n   * Piper Sandler $534 to $630 OVERWEIGHT\n* Estee Lauder Companies (EL) had a price target raised by Piper Sandler from $224 to $236 at OVERWEIGHT\n* Crown (CCK) had a price target raise by Barclays from $90 to $103 at OVERWEIGHT\n* Digital Turbine (APPS) had a price target raised by Roth Capital from $25 to $40 at BUY. This stock has been on an absolute TEAR!!\n* Advanced Auto Parts (AAP) was upgraded by Raymond James from MARKET PERFORM to OUTPERFORM at a $175 price target. (We like this call)\n* Pinterest (PINS) had notable performance in sympathy with Snapchats (SNAP) awesome earnings call. PINS today received positive analyst action:\n   * Bank of America (BAC) upgraded from NEUTRAL to BUY with a target of $58\n   * Goldman Sachs (GS) upgraded from NEUTRAL to BUY and raised target from $37 to $61\n* Dave and Busters (PLAY) was upgraded by Raymond James from OUTPERFORM to STRONG BUY and price target raised from $20 to $25. (we like this call and the chart also)\n* Paycom (PAYC) was upgraded by the Royal Bank of Canada from SECTOR PERFORM to OUTPERFORM and raised price target from $305 to $450. (very bullish call, stock way down today but on a tear overall!!)\n* Some notable earnings calls after the bell today: Tesla (TSLA), Chipotle Mexican Grill (CMG), Las Vegas Sands Corp. (LVS), Lam Research Corp. (LRCX), Whirlpool (WHR), Xilinx (XLNX), Align Technology (ALGN), Netgear (NTGR), Equifax (EFX), Crown Castle International (CCI)\n* Some notable earnings before market tomorrow: Intel (INTC), Boston Beer Company (SAM), Capital One Financial (COF), eHealth (EHTH), Seagate Technology (STX), Mattel (MAT)\n\n“Time you enjoyed wasting, was not wasted” -John Lennon",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wed, Oct 21, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/jfkl7c/here_is_a_market_recap_for_today_wed_oct_21_2020/",
        "created": 1603339749.0
    },
    {
        "author": "Philly19111",
        "created_utc": 1601696972,
        "id": "j491lx",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Just curious on a 2nd or 3rd opinion on a few stocks I've been eye balling. Would graciously appreciate someone with maybe some more knowledge opinion.\n\nWould love any insight you guys have on these tickers. Thanks again any constructive thoughts are GREATLY appreciated.  \n\n$NEE - Amazing Long term growth. Attempting to buyout other companies. Dividend has been rapidly increasing. Is the growth potentially done or near done?\n\n$AVGO - Amazing long term growth. Dividend has been RAPIDLY increasing. Can't imagine Broadcom getting smaller but just like NEE how much more growth is there still?\n\n$NVDA - INSANE long term growth. Big player in the market. Doubtful they are going anywhere in the future\n Trash dividend. And once again they have grown so much idk how much more they are likely to grow.\n\n$PYPL - Amazing long term growth. PayPal rumored to be moving into Ecommerence. Huge player for electronic transactions. I forsee them continuing to grow into the future.. No dividend \n\n$PENN - Amazing long term growth. Analysis put a $100 PT. I dont see gambling EVER going anywhere in the future. \n\n$COST - Decent long term growth. I feel like Costco is going to continue to grow as a super giant into the future. Dividend is slightly lacking. \n\n$U - New IPO. Unity is a huge player in the mobile app industry. If expect growth with them branching out. Not to mention I dont see mobile app using another company to this degree.\n\n$T - Mainly for the dividend. 10yr growth is a mere 2% on average. I feel like HBO MAX and the casual dividend increase will make up for this long term. \n\n$JPM - Decent long term growth. Bad PR recently but I dont see that holding it back. Dividend is pretty prime and the banking sector will grow once interest rates are settled. \n\n$CRSR - New IPO.HUGE player in the ESports community. Doesn't seem to be slowing down at all. Big on Twitch.tv with sponsorships and the streaming industry. Esport is a rapidly growing industry. Sadly no dividend as of now. \n\n$KIRK - There site is a overstock wayfair look alike. In the future I can see them rapidly growing just as those did. Even to some degree the growth potential would be massive.\n\n$JMIA - Essentially the amazon of Europe/Africa. Branching out into the African market. The growth on this seems like it could be exponential.\n\n$AGO - New IPO. Sells camping gear as well as GUNS and AMMO. Comparing it to camping world [$CWH] seems like there's alot of potential growth in the market.",
        "subreddit": "investing",
        "title": "Curious for someone with more knowledge/years in the games opinion",
        "url": "https://www.reddit.com/r/investing/comments/j491lx/curious_for_someone_with_more_knowledgeyears_in/",
        "created": 1601725772.0
    },
    {
        "author": "Jdom666",
        "created_utc": 1602978725,
        "id": "jd5wpv",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Apple punished me this week for being a retarded. I'm down to my last $700 and I am thinking about making calls on one of these but can't quite decide. Both companies look like they are going to crush earnings in early November.",
        "subreddit": "wallstreetbets",
        "title": "Yolo on SQ or PYPL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jd5wpv/yolo_on_sq_or_pypl/",
        "created": 1603007525.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1603310909,
        "id": "jfkkqt",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, October 21, 2020**\n\nStocks traded choppily today as market participants closely monitor development in Washington surrounding stimulus. Though Pelosi’s self-imposed deadline of 48-hours to reach an agreement came and went, discussions continue.\n\nThe Nasdaq (QQQ) finished the day 0.08% down, the S&amp;P 500 (SPY) finished 0.21% down, and the Dow Jones (DIA) underperformed the most, ending the day 0.35% down.\n\nHouse Speaker Nancy Pelosi told Bloomberg TV that she was willing to keep stimulus discussions open past her Tuesday deadline and said she is “optimistic” about the progress being made. White House Chief of Staff Market Meadows said on CNBC that negotiators were working hard to get a deal done by the weekend, and that White House increased its offer by another $80 billion to $1.88 trillion.\n\nDespite support from the President and top government officials, questions remain over whether the Republican-controlled Senate, who have publicly disparaged the bill, would vote to advance any deal. Senate Republicans have so far baulked at the high price-tag the proposals. According to an article released by the New York Times, Senate Majority Leader Mitch McConnell privately told Republican senators on Tuesday that he had warned the White House not to strike a pre-election deal with Speaker Nancy Pelosi on a new round of stimulus, moving to head off an agreement that President Trump has demanded but most in his party oppose. McConnell’s remarks, which were confirmed by four Republicans familiar with them, threw cold water on Mr. Trump’s increasingly urgent push to enact a new round of pandemic aid before Election Day and came just as Ms. Pelosi offered an upbeat assessment of her negotiations with Steven Mnuchin.\n\nIn other news, Senate Democrats successfully blocked the Republicans’ attempt to pass a targeted $500 billion coronavirus bill, with Pelosi, Mnuchin, and the White House engaged in a desperate attempt to come to a much-needed agreement before the November election. The bill, similar to one the Republicans tried to pass some weeks ago, fell in a 51-44 vote, falling short of the 60 supermajority required. Republicans in Congress argue Democrats have reached for an expensive wish list filled with many provisions unrelated to the crisis. McConnell said the Democrats are engaging in “all-or-nothing obstruction” as they hold out for a comprehensive deal worth about $2 trillion. In response, Democrats accuse the GOP of failing to recognize the magnitude of the economic and health crisis that is gripping the country. Senate Minority Leader Chuck Schumer (Democrat, New York) has called the Republican plan paltry, partisan, and emaciated. \n\nHouse Speaker Nancy Pelosi said she “has a prospect for an agreement” with Treasury Secretary Steven Mnuchin on a coronavirus stimulus package, but floated the possibility that it may not come together in time to pass both chambers before the Nov. 3 election. “There will be a bill. The question is: is it time to pay the November rent — my goal — or will it be shortly after. I want people to know that help is on its way. It will be bigger. It will be better. And it will be retroactive.” It seems the chances for any sort of short-term stimulus before November 3 are slipping away.\n\n**Highlights**\n\n* Snapchat (SNAP) rocketed up today after posting better than expected quarterly earnings report. The Stock was up 30.88% at the time of writing. Other social media stocks (FB, TWTR, an notably PINS) were up in sympathy\n   * EPS of $0.01 vs -$0.04 expected\n   * Revenue of  $678.7 million vs. $547.2 million expected\n* United Airlines (UAL) will on Wednesday test a digital health pass as part of a global pilot program designed to accelerate a safer opening of international borders and kick-start global travel. Under this system, travelers will have taken a COVID-19 test up to 72 hours before traveling, and logged the results from a certified laboratory on the CommonPass app on their phones.     \n* Purdue Pharmaceutical, the maker of opioid painkiller OxyContin, plead guilty to three federal criminal charges for its role in creating the nation's opioid crisis and will pay more than $8 billion and close down the company. The money will go to opioid treatment and abatement programs. DEA Assistant Administrator Tim McDermott said, “Purdue Pharma actively thwarted the US’ efforts to ensure compliance and prevent diversions. The devastating ripple effect of Purdue’s actions left lives lost and others addicted.” This is one of the most significant blows dealt by the US government against the opioid epidemic. \n* Nokia (NOK) and Greener Acres Canada disclosed on Wednesday an agreement to upgrade Canada's utility pole infrastructure to smart, eco-friendly poles across the country.\n* Renewable energy giant Iberdrola, through its U.S. subsidiary Avangrid, will acquire PNM Resources (PNM) which is New Mexico’s largest utility. This goes in line with a mandate adopted in 2019 to become Carbon Free by 2045. Under the proposed merger, shareholders of PNM will receive $4.3B in cash about a 10% premium on yesterdays closing price.\n* Bank of America analyst Justin Post upgraded Pinterest from Neutral to Buy and raised his price target from $45 to $58.\n* Australia’s competition watchdog will consider its own antitrust case against Google, the commission chairman said Wednesday after the U.S. The Justice Department sued the company for abusing its dominance in online search and advertising.\n* J.C. Penney (JCP) believes it will emerge from bankruptcy protection before Christmas under a new ownership agreement that would save tens of thousands of jobs.\n* Snapchat (SNAP) after a blowout earnings call yesterday, too many analyst price targets to list!\n* they are all over $40, except for Morgan Stanley at $36. Everyone is Bullish!\n* Square (SQ) had a price target raise by Barclays from $185 to $215 at OVERWEIGHT\n* Paypal (PYPL) had a price target raised by Barclays from $228 to $235 at OVERWEIGHT Company announced acceptance and operation of crypto on their platform! Keep an eye out.\n* Service Now (NOW) had a price target raised by Morgan Stanley from $467 to $512 at EQUAL WEIGHT.\n* Netflix (NFLX) dumping after underperforming earnings estimates. Stock down 6.58% at the time of writing\n   * EPS: estimate $2.13 vs actual $1.74\n   * Revenue: estimate $6.38 vs $6.44\n* Netflix (NFLX) earnings yesterday came below expectation. Nevertheless, had a price target raise, among others, by:\n   * BMO Capital $625 to $700 OUTPERFORM\n   * Royal Bank of Canada $610 to $630 OUTPERFORM\n   * Wells Fargo $470 to $510 EQUAL WEIGHT\n   * Piper Sandler $534 to $630 OVERWEIGHT\n* Estee Lauder Companies (EL) had a price target raised by Piper Sandler from $224 to $236 at OVERWEIGHT\n* Crown (CCK) had a price target raise by Barclays from $90 to $103 at OVERWEIGHT\n* Digital Turbine (APPS) had a price target raised by Roth Capital from $25 to $40 at BUY. This stock has been on an absolute TEAR!!\n* Advanced Auto Parts (AAP) was upgraded by Raymond James from MARKET PERFORM to OUTPERFORM at a $175 price target. (We like this call)\n* Pinterest (PINS) had notable performance in sympathy with Snapchats (SNAP) awesome earnings call. PINS today received positive analyst action:\n   * Bank of America (BAC) upgraded from NEUTRAL to BUY with a target of $58\n   * Goldman Sachs (GS) upgraded from NEUTRAL to BUY and raised target from $37 to $61\n* Dave and Busters (PLAY) was upgraded by Raymond James from OUTPERFORM to STRONG BUY and price target raised from $20 to $25. (we like this call and the chart also)\n* Paycom (PAYC) was upgraded by the Royal Bank of Canada from SECTOR PERFORM to OUTPERFORM and raised price target from $305 to $450. (very bullish call, stock way down today but on a tear overall!!)\n* Some notable earnings calls after the bell today: Tesla (TSLA), Chipotle Mexican Grill (CMG), Las Vegas Sands Corp. (LVS), Lam Research Corp. (LRCX), Whirlpool (WHR), Xilinx (XLNX), Align Technology (ALGN), Netgear (NTGR), Equifax (EFX), Crown Castle International (CCI)\n* Some notable earnings before market tomorrow: Intel (INTC), Boston Beer Company (SAM), Capital One Financial (COF), eHealth (EHTH), Seagate Technology (STX), Mattel (MAT)\n\n“Time you enjoyed wasting, was not wasted” -John Lennon",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wed, Oct 21, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/jfkkqt/here_is_a_market_recap_for_today_wed_oct_21_2020/",
        "created": 1603339709.0
    },
    {
        "author": "Less-Weight3191",
        "created_utc": 1602780134,
        "id": "jbr5rj",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "$CLIS- Paypal finally arrived. I’m bag holding 34k shares",
        "url": "https://i.redd.it/rfysz0rpeat51.jpg",
        "created": 1602808934.0
    },
    {
        "author": "Redmine23",
        "created_utc": 1602358804,
        "id": "j8qtpg",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "     Alright listen up you fuckers, if your expecting some great dd or something then you’ll be sadly disappointed go to r/investing for that. I’m here to expand your watchlists from 10 tickers to 11 maybe even 12(sounds crazy). I’m going to keep it short since you won’t read this wall of text anyways. \n      So PayPal has earnings report on nov 2 and last qt they crushed analysts expectations and they will do the same this qt. They are one of the leading companies in contactless payments which has now strived under covid.  Since April they have added over 7million new users and don’t forget its connection to the old dinosaur EBay which has been doing great since covid and also has ER end of month I believe. \n      All the 10/30 calls got iv crushed once the official ER date came out so it’s a decent time to grab some strictly for the run up. Buy longer dated ones if you plan to hold thru ER. I just mentioned 10/30 options because they are at a discount right now. Good luck and Godspeed you retards. \n\nPositions: 10/30 200c and 11/6 270c",
        "subreddit": "wallstreetbets",
        "title": "PayPal ER",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j8qtpg/paypal_er/",
        "created": 1602387604.0
    },
    {
        "author": "Mud_Wat",
        "created_utc": 1601907074,
        "id": "j5k30u",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "PayPal releases its earnings in a month ( OCT 28th) along side many other company’s, so I’m thinking buying a call for strike price 205 and expiring 1 week after earnings (NOV 6th). At 740 per contract and selling a day before earnings. Any thoughts?",
        "subreddit": "wallstreetbets",
        "title": "PayPal calls rn",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5k30u/paypal_calls_rn/",
        "created": 1601935874.0
    },
    {
        "author": "Always2xDown",
        "created_utc": 1601658848,
        "id": "j3ympx",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I do not have a current position in this and haven’t for quite a bit. Is there money to be made here, maybe, is there money to be lost, definitely.\n\nI would be very very wary before the next earnings comes out.\n\nThis $1.5 million buy back has been going on since early September. \n\nVerified from Transfer Agent on OTCMarkets\n\nOS start as of 9/1 - 1,668,839,113\n\nOS today 10/2 - 1,874,269,389\n\nThat is an increase of about 12% in OS or a bit over 205 MILLION! \n\n$1.5mil in shares at $0.004 would be 375 million shares... if they only managed to do 1/3 that should still be a reduction of 125mil\n\nIf you’re determined to light your money on fire you could PayPal or Venmo me some instead. \n\nSeriously though make sure to be aware of the next update in November for OS or in the Q3 ER. No I don’t know when the next ER will come out. \n\nSomeone should really ask the CEO how shares go up when they’re buying back. You could also ask that pumper on Twitter and iHub who keeps saying he is buying millions at a time. \n\nPlease also take the time to learn to read OTCMarkets, tons of free info there.\n\nScreenshots from OTC\nhttps://ibb.co/d6pFRXv\nhttps://ibb.co/HHGRM8L\n\nGood luck y’all",
        "subreddit": "pennystocks",
        "title": "Big Beer RuhRoh WHOOPSIE! - BBRW - But but but.... share repurchases... yet OS go... UP!",
        "url": "https://www.reddit.com/r/pennystocks/comments/j3ympx/big_beer_ruhroh_whoopsie_bbrw_but_but_but_share/",
        "created": 1601687648.0
    },
    {
        "author": "relegatedreddit",
        "created_utc": 1602560768,
        "id": "ja5xsh",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "For people in their 20-30s they are spending money on reliving things of their youth. Things like retro video games, Pokemon cards, etc seem to have a lot of value for those who want to relive their youth. So as someone in their 30s, looking 10-20 years down the road I can look at my kids and current trends to figure out what might be valuable in the future. \n\nI see a few challenges with this though, first who knows what will be popular just like who knows what stock will be worth 100x more 10-20 years from now. Second I think there is a lot more knowledge and availability than their used to be. Back in the 80s/90s there was no internet, eBay, PayPal, etc. As a result people just sold stuff at garage sales, threw away or didn't keep in good condition. I think the market in the future will have more inventory making for less profitable items.\n\nThat being said, what would you say are items that might be worth money in the future? Sealed PS4, Switch games, current generation Pokemon, trading cards?",
        "subreddit": "investing",
        "title": "What cheap things now will be worth a lot in 20 years (no stocks)",
        "url": "https://www.reddit.com/r/investing/comments/ja5xsh/what_cheap_things_now_will_be_worth_a_lot_in_20/",
        "created": 1602589568.0
    },
    {
        "author": "nafizzaki",
        "created_utc": 1601567395,
        "id": "j3b5i8",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I know this is r/wallstreetbets and not r/investing, but remember guys boomer stonks can actually make you money instead of spending it all in some call options.\n\nHere's a good list if you are interested(from my watchlist) that does have some growth(including dividends) and OK balance sheets to help you keep YOLOing your money.\n\n$ABBV \n\n$ASML \n\n$BAC \n\n$BLK \n\n$GD \n\n$[MC.PA](https://MC.PA) \n\n$NEE \n\n$NESN.ZU \n\n$NTDOY \n\n$O \n\n$[OR.PA](https://OR.PA) \n\n$PEP \n\n$PG \n\n$PYPL \n\n$[SIE.DE](https://SIE.DE) \n\n$SMSN.L \n\n$ULVR.L \n\n$VZ \n\n$WMT\n\nThese are some stonks that I like that may not be as hot or in the news as some other stocks but are expected to provide a good and predictable return. You may have many others to suggest and I would be glad to hear what stocks you guys come up with as I have ignored so many that I am tempted to include at least 20 more.",
        "subreddit": "wallstreetbets",
        "title": "Don't Look Down Upon Boomer Stonks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j3b5i8/dont_look_down_upon_boomer_stonks/",
        "created": 1601596195.0
    },
    {
        "author": "Jpaperz",
        "created_utc": 1602713910,
        "id": "jbaxyp",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "MGI -\n\nso, this stock we all should know. If you played it before it was a penny stock. And since march drop, this thing has been taking off, it is still considered a penny stock &lt; $5\n\nIt broke its 52 week highs today and its gonna keep going higher, banks have been going flat/downtrending meanwhile payment services has been trending up.\n\nCatalyst(s)-\n\nMGI renewed contract with Walmart \n\nXRP(crypto)\n\n9 month consecutive triple digit gains\n\nearnings on 10/30\n\nBroke 52 week highs, so little resistance \n\nSemi-low float\n\nNot much selling volume the past 3 months\n\nWe broke a triple top on the daily\n\nClosed over previous higher high and higher low.\n\nMGI will continue this trend following Square and Paypal and other payment services. Its a strong guess, but a bet i am willing to take, buy now and hold PAST earnings, they will most likely report another triple digit gain to make it 10 months in a row\n\n[Positions](https://ibb.co/WcZM3Zr)\n\nI plan on executing those contracts on top of profit. And bag holding until earnings and cutting half",
        "subreddit": "pennystocks",
        "title": "OK you Fucks, Here’s some nice Short, Solid DD - MGI - Positions Posted",
        "url": "https://www.reddit.com/r/pennystocks/comments/jbaxyp/ok_you_fucks_heres_some_nice_short_solid_dd_mgi/",
        "created": 1602742710.0
    },
    {
        "author": "Cowboyre",
        "created_utc": 1602893925,
        "id": "jclea9",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Every time I look at ETF’s they’re either up an irrelevant amount or down an irrelevant amount while I’m looking at stocks like PayPal, Alibaba, Unity, these stocks are going up 2-3% a day so what’s the point of investing into ETFS? Very shallow risk with very shallow gains?",
        "subreddit": "investing",
        "title": "Why should I invest in ETFs?",
        "url": "https://www.reddit.com/r/investing/comments/jclea9/why_should_i_invest_in_etfs/",
        "created": 1602922725.0
    },
    {
        "author": "CEO_of_NotFunny",
        "created_utc": 1601941220,
        "id": "j5ujkh",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": " ***PayPal (Nasdaq: PYPL) Q3 Earnings Play***\n\nPayPal earnings are coming up in october and the company has a lot of potential as they already crushed Q2 earnings.\n\n**General facts**\n\n* 73% YTD growth\n* $225B Market Cap\n* 2019 Revenue: $17.772B\n\nThe stock went down in [september](https://i.imgur.com/FHA4reY.png) and is now on for a earnings [run-up](https://i.imgur.com/uJ0M4QX.png). PayPal is currently sitting around $15 below its ATH. There is probably no need to explain what PayPal is or what it does.\n\nTotal Payment Volume (TPV)\n\n\"Total  Payment Volume or \"TPV\" is the value of payments, net of payment  reversals, successfully completed through our Payments Platform,  excluding transactions processed through our gateway products.\"\n\n\\--&gt; *Fees on money transactions*\n\nThat means that PayPal makes more money when more transactions are being made.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n1iw3tt13dr51.png?width=554&amp;format=png&amp;auto=webp&amp;s=0c5711eda5ad1f0422692e74985c16820a43f0fe\n\n**Free Cashflow (FCF)**\n\n$2.19B in Q2 with an increase 112% y/y\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2tr61wt23dr51.png?width=550&amp;format=png&amp;auto=webp&amp;s=1f3f312a637670c54ebbd70fb223f49b60e5d4fc\n\n\\--&gt;  Now you are probably asking yourself what all those fucking images and  words mean. It´s simple. PayPal has seen a lot of new users due to the  pandemic and everyone ordering their shit from Jeff Bezos. We are still  in a pandemic and the second wave is about to come. This means that more  and more people are going to use services like PayPal and as I stated  above; more users means more transactions which means more money for PayPal. So more tendies for us. [https://imgur.com/D9IMC8A](https://imgur.com/D9IMC8A)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/folqhri63dr51.png?width=596&amp;format=png&amp;auto=webp&amp;s=c762f9444098ded4754854951c09b6db37a3ad64\n\nSource:   \n\n[https://investorplace.com/2020/10/paypal-stock-will-rise-with-its-powerful-fcf-growth/](https://investorplace.com/2020/10/paypal-stock-will-rise-with-its-powerful-fcf-growth/)\n\nAs you can see when the TPV rises, the FCF rises as well. TPV will rise due to more and more people using PayPal due to the Pandemic. This will lead the FCF to rise as well and this makes stonks go up for us to make some tendies.\n\n**New Customers**\n\nPayPal has seen a rise in new accounts of 21.3 million in Q2.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6xkjfind3dr51.png?width=414&amp;format=png&amp;auto=webp&amp;s=c1c34c732b58eb2c3daa5581dffaa5d0a5ba565b\n\n**So how are we making tendies on the upcoming earnings?**\n\nPayPal is expecting \"strong momentum from Q2 to continue into Q3\".\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1slqhmre3dr51.png?width=478&amp;format=png&amp;auto=webp&amp;s=c9fa90bc61c64cebfb38f1b4d565bd4ab7172632\n\n*They will be crushing earnings* [*again*](https://i.imgur.com/iBhZqrE.png) *like they did in Q2 (actual Growth: 22% and 25%)*\n\nAnalysts have set a *price target around $220.*\n\n&amp;#x200B;\n\n*Processing img n0vw56pf3dr51...*\n\n**Recent News**\n\n\"PayPal and Mastercard will continue the global expansion of its PayPal Business Debit Mastercard.\" [Source](https://www.mobilepaymentstoday.com/news/paypal-business-debit-mastercard-expands-european-market-reach/)\n\nThey also announced to support black communities and businesses. [Source](https://investor.paypal-corp.com/news-releases/news-release-details/paypal-announces-recipients-5-million-community-partner-grants)\n\nConclusion\n\nIt may not be the most exciting stock to play this month but it is a relatively safe play.\n\nPositions: 220c somewhere in November\n\nGood luck everyone",
        "subreddit": "wallstreetbets",
        "title": "Why PayPal is a solid buy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5ujkh/why_paypal_is_a_solid_buy/",
        "created": 1601970020.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1602880516,
        "id": "jchqkk",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n* The S&amp;P 500 -0.06% today while the NASDaq decreased by (-0.62%). The Russell 2000 closed lower by (-0.25%). The Dow ended in positive territory at (+0.33%)\n* The best performing sector was Utilities(+1.07%) while Energy(-2.27%)was the worst performer.\n* The energy sector (-2.3%) and Dow Jones Transportation Average (-1.3%) were consistent laggards today amid disappointing reactions to mixed earnings reports from Schlumberger (SLB 14.97, -1.45, -8.8%), J.B. Hunt Transport (JBHT 128.04, -13.80, -9.7%), and Kansas City Southern (KSU 179.01, -5.00, -2.7%). \n* The weakness in the transportation space was mitigated in the industrials sector (+0.7%) by nice gains in Boeing (BA 167.35, +3.11, +1.9%) and Caterpillar (CAT 168.75, +3.71, +2.3%). Boeing's 737 MAX was deemed safe to fly by EU regulators, and CAT was upgraded to Overweight from Equal Weight at Wells Fargo.\n* Evidently, the session was mixed with conflicting trading narratives that made it hard to identify a clear theme. It was a stock picker's kind of day and certainly one for options traders amid monthly options expiration activity. \n* Looking ahead, investors will receive the NAHB Housing Market Index for October on Monday. \n## Index Summary\n &lt;b&gt;S&amp;P 500 :&lt;/b&gt; (-0.06%); &lt;b&gt;NasDaq : &lt;/b&gt;(-0.62%); \\\n&lt;b&gt;Russell 2000 :&lt;/b&gt;(-0.25%); &lt;b&gt;Dow :&lt;/b&gt;(+0.33%); \\\n&lt;b&gt;Vix :&lt;/b&gt;26.97 (+1.63%); [+9.64%]; {-1.97%} \n## Sectors Summary \n_Three highest sectors for today were -_ \n&lt;b&gt;Utilities: &lt;/b&gt;(+1.07%); &lt;b&gt;Health Care: &lt;/b&gt;(+0.99%); &lt;b&gt;Industrials: &lt;/b&gt;(+0.73%) \\\n_Three lowest sectors for today were -_\n &lt;b&gt;Energy: &lt;/b&gt;(-2.27%); &lt;b&gt;Consumer Discretionary: &lt;/b&gt;(-0.91%); &lt;b&gt;Real Estate: &lt;/b&gt;(-0.36%) \n## Commodities/Futures \n(1-day %), [5-day %], {10-day %} \\\n_**Currency -**_ \\\n&lt;b&gt;USD Index :&lt;/b&gt;93.864 (-0.17%); [+0.65%]; {-0.04%}\\\n &lt;b&gt;BC :&lt;/b&gt;11595 (-2.16%); [-2.45%]; {+6.73%} \\\n_**Precious Metals -**_\\\n&lt;b&gt;Gold :&lt;/b&gt;1908.9 (-0.32%); [-1.03%]; {+0.08%}  &lt;b&gt;Silver :&lt;/b&gt;24.224 (+0.11%); [-3.88%]; {+1.59%}\\\n _**Farming -**_ \\\n&lt;b&gt;Soybeans :&lt;/b&gt;1062.25 (-1.08%); [+1.64%]; {+0.65%}  \n&lt;b&gt;Corn :&lt;/b&gt;403.75 (-0.31%); [+3.47%]; {+4.55%} \\\n&lt;b&gt;Coffee :&lt;/b&gt;109.5 (-2.37%); [-2.06%]; {-0.7%} \\\n_**Industrials -**_ \\\n&lt;b&gt;Crude :&lt;/b&gt;40.96 (-0.46%); [+3.4%]; {+0.25%} \\\n&lt;b&gt;Nat Gas :&lt;/b&gt;2.775 (-2.52%); [-6.11%]; {+7.34%} \\\n&lt;b&gt;Copper :&lt;/b&gt;3.0855 (-0.96%); [-0.16%]; {+3.05%} \n## Dark Pool Summary - \nHighest Dark Pool buys by rank -\\\n            1. BA 2 buys totaling 2,180,000 shares. Average Price : 168.95, Cost : $368,270,000\\\n            2. MSFT 4 buys totaling 848,000 shares. Average Price : 221.1, Cost : $187,494,570\\\n            3.PYPL 2 buys totaling 835,800 shares. Average Price : 207.0, Cost : $173,010,600\\\n            4.GSX 1 buys totaling 1,200,000 shares. Average Price : 106.45, Cost : $127,740,000\\\n            5. MU 1 buys totaling 2,000,000 shares. Average Price : 52.48, Cost : $104,960,000\\\n## Options Fast Facts -\n_**CBOE Put/Call Ratio**_ - 0.46\\\n_**Highest Multiple Over Daily Average**_- \nFLEX with 23x the ADV of 1823. There were 38909 calls and 2387 puts. \\\n_**Ticker with Most Contracts**_ -PTON with 359731 contracts traded today with an AVD of 165534. There were 197672 calls and 162059 puts.\\\n_**Largest Put / Call Ratio -**_ VNQ with a 61 P/C ratio. There were 40130puts and 653 calls. \\\n_**Largest Call / Put Ratio -**_ DISCK with a422 C/P ratio. There were 20699 calls and 49 puts. \n*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "wallstreetbets",
        "title": "Market and Options Summary for Oct-16-2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jchqkk/market_and_options_summary_for_oct162020/",
        "created": 1602909316.0
    },
    {
        "author": "bbberms",
        "created_utc": 1603471182,
        "id": "jgqnux",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Background:\nI’m 18 years old and my initial investment is $1500 with $400 per month after. This amount may be changed due to me going to college in a year as well as other factors. My portfolio is geared towards more value stocks with some potential growth stocks. I plan to hold most of these 5-10 years+. I work with several CFA portfolio managers on individual school projects so naturally they look at my portfolio as well. The allocation to each company may change at various times as well.\n\nHere’s my allocations:\n\nSPY-9%\nSPYG-7%\nSPYD-4%\nXLU-3%\nXLK-7%\nLHX-10.5%\nPSX- 6%\nT-5.5%\nO-12%\nFRT-7%\nV-5%\nPYPL-7%\nBAC-5%\nAWK-6%\nALB-6%\n\n*i counted and my % should add to 100 but I may have miss calculated due to my rounding.",
        "subreddit": "investing",
        "title": "Beginner investor portfolio",
        "url": "https://www.reddit.com/r/investing/comments/jgqnux/beginner_investor_portfolio/",
        "created": 1603499982.0
    },
    {
        "author": "deep_data",
        "created_utc": 1602176380,
        "id": "j7gtwg",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "China might be the best hedge for U.S. stocks.\n\nKey Chinese indexes and stocks are outperforming their U.S. counterparts, and investor sentiment suggests that Asia might even emerge as an economic haven, as America and Europe are still struggling with the Covid-19 pandemic.\n\nThe Xtrackers Harvest CSI 300 China A-Shares exchange-traded fund (ticker: ASHR), a proxy for mainland China’s stocks, is up 18% this year, compared with 6% for the S&amp;P 500 index.\n\nShares of Alibaba Group Holding (BABA), one of China’s most important companies, are up 36% this year. Alibaba, given its broad scope, might just help investors insulate their portfolios at a time of unusual duress in U.S. history—acting in the role once occupied by fixed income when it was an effective offset to equity weakness.\n\nWhen President Donald Trump surprisingly ended stimulus negotiations with a Tuesday tweet, U.S. stocks sank. Many Chinese stocks, notably Alibaba, held up.\n\nHedging U.S. portfolios with Chinese stocks, particularly Alibaba, might seem outlandish, but Susquehanna Investment Group, a top options-trading firm that seeks out noncorrelated U.S. equity investments, has significant China exposure. The secretive trading company owns a huge piece of ByteDance, the parent company of TikTok, that could be worth more than $15 billion. The investment would probably dwarf anything the firm’s partners have ever realized in a long history of extraordinary success.\n\nAlibaba will never protect a portfolio the way traditional hedges, such as S&amp;P 500 options, do, but Alibaba’s options premiums and stock price aren’t as distorted ahead of the bizarre U.S. presidential election. Trading volumes on the Cboe Volatility Index, or VIX, are stunningly anemic during the oddest trading year since the 2008-09 financial crisis, suggesting that investors have little faith that VIX derivatives will work as expected.\n\nBut adding China exposure, especially Alibaba, to a portfolio offers hedging through diversification.\n\nAlibaba will hold its annual Singles Day event on Nov. 11. For 24 hours, Alibaba will host an online sale and celebration that makes Amazon.com’s (AMZN) Prime Day seem like a Rotary Club luncheon. The company will probably report quarterly earnings in early November.\n\nIn 2019, Singles Day sales totaled $38 billion, up from $31 billion in the previous year. This year’s event will indicate how much Asian consumers have recovered from the coronavirus. Powerful sales results will intrigue investors who are worried about the sclerotic U.S. and European economies and concerned about political mishandling of the Covid-19 pandemic.\n\nWith Alibaba’s stock at $296.50, investors can sell Alibaba’s November $295 put for $18.20 and buy Alibaba’s November $300 call for $17.60. The trade generates a credit of 60 cents. If Alibaba’s stock is at $310 at expiration, the call is worth $10. Should the stock price be below the put strike price at expiration, investors are obligated to buy the stock at the strike price, or to cover the put at a higher prices.\n\nDuring the past 52 weeks, Alibaba’s stock has ranged from $161.68 to $299. Shares are up 80% over the past year.\n\nAlibaba’s attraction extends beyond hedging and diversification. The stock monetizes the rise of Asia’s middle class, which is one of the world’s greatest economic trends. Alibaba’s scope is so broad that anyone who buys the stock essentially gets the Asian equivalent of a portfolio of companies similar to eBay (EBAY), PayPal Holdings (PYPL), Goldman Sachs Group (GS), FedEx (FDX), United Parcel Service (UPS), and the entertainment studios.\n\nReports indicate that China’s economy is already recovering from the coronavirus. Goldman has even advised clients that Asia is well positioned compared with other areas because it has contained the virus. The irony is unpleasantly rich.",
        "subreddit": "stocks",
        "title": "Worried About the U.S. Stock Market? Buy Alibaba Options.",
        "url": "https://www.reddit.com/r/stocks/comments/j7gtwg/worried_about_the_us_stock_market_buy_alibaba/",
        "created": 1602205180.0
    },
    {
        "author": "Jpaperz",
        "created_utc": 1602715196,
        "id": "jbbbqx",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "MGI -\n\nso, this stock we all should know. If you played it before it was a penny stock. And since march drop, this thing has been taking off, it is still considered a penny stock &lt; $5\n\nIt broke its 52 week highs today and its gonna keep going higher, banks have been going flat/downtrending meanwhile payment services has been trending up.\n\nCatalyst(s)-\n\nMGI renewed contract with Walmart \n\nXRP(crypto)\n\n9 month consecutive triple digit gains\n\nearnings on 10/30\n\nBroke 52 week highs, so little resistance \n\nSemi-low float\n\nNot much selling volume the past 3 months\n\nWe broke a triple top on the daily\n\nClosed over previous higher high and higher low.\n\nMGI will continue this trend following Square and Paypal and other payment services. Its a strong guess, but a bet i am willing to take, buy now and hold PAST earnings, they will most likely report another triple digit gain to make it 10 months in a row\n\n[Positions](https://ibb.co/WcZM3Zr)\n\nI plan on executing those contracts on top of profit. And bag holding until earnings and cutting half\n\nAlso posted to r/pennystocks",
        "subreddit": "smallstreetbets",
        "title": "Not so Epic DD Analysis - MGI - positions posted",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jbbbqx/not_so_epic_dd_analysis_mgi_positions_posted/",
        "created": 1602743996.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1602798477,
        "id": "jbx22k",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "\n## Daily Synopsis \n* The S&amp;P 500 -0.12% today while the NASDaq decreased by (-0.71%). The Russell 2000 rose by (+1.03%). The Dow ended in negative territory at (-0.03%)\n* The best performing sector was Energy(+1.21%) while Communication Services(-0.77%)was the worst performer.\n* Investors, however, steadily bought the dip throughout the day that lifted every sector off its low and notably pushed the S&amp;P 500 energy (+1.2%), financials (+0.8%), real estate (+0.5%), and industrials (+0.4%) sectors into positive territory. Note, these sectors are among five S&amp;P 500 sectors still down for the year.\n* The information technology (-0.4%), communication services (-0.7%), and health care (-0.7%) sectors were among the day's laggards.\n* Earnings-driven gains in Morgan Stanley (MS 51.33, +0.68, +1.3%) and Charles Schwab (SCHW 39.03, +1.91, +5.2%) provided the lift for the financials sector, which had struggled this week amid lackluster/disappointing reactions to previous earnings reports. United Airlines (UAL 34.25, -1.36, -3.8%) reported worse-than-expected results, which kept the airline stocks grounded today. \n* Looking ahead to Friday, investors will receive Retail Sales for September, Industrial Production and Capacity Utilization for September, the preliminary University of Michigan Index of Consumer Sentiment for October, Business Inventories for August, and Net Long-term TIC Flows for August.  \n## Index Summary\n &lt;b&gt;S&amp;P 500 :&lt;/b&gt; (-0.12%); &lt;b&gt;NasDaq : &lt;/b&gt;(-0.71%); \\\n&lt;b&gt;Russell 2000 :&lt;/b&gt;(+1.03%); &lt;b&gt;Dow :&lt;/b&gt;(-0.03%); \\\n&lt;b&gt;Vix :&lt;/b&gt;26.4 (+2.16%); [+2.31%]; {-2.39%} \n## Sectors Summary \n_Three highest sectors for today were -_ \n&lt;b&gt;Energy: &lt;/b&gt;(+1.21%); &lt;b&gt;Financials: &lt;/b&gt;(+0.77%); &lt;b&gt;Real Estate: &lt;/b&gt;(+0.47%) \\\n_Three lowest sectors for today were -_\n &lt;b&gt;Communication Services: &lt;/b&gt;(-0.77%); &lt;b&gt;Health Care: &lt;/b&gt;(-0.73%); &lt;b&gt;Information Technology: &lt;/b&gt;(-0.45%) \n## Commodities/Futures \n(1-day %), [5-day %], {10-day %} \\\n_**Currency -**_ \\\n&lt;b&gt;USD Index :&lt;/b&gt;93.366 (+0.51%); [+0.8%]; {+0.11%}\\\n &lt;b&gt;BC :&lt;/b&gt;11410 (+1.84%); [-0.09%]; {+9.31%} \\\n_**Precious Metals -**_\\\n&lt;b&gt;Gold :&lt;/b&gt;1907.3 (+0.29%); [-0.5%]; {+0.62%}  &lt;b&gt;Silver :&lt;/b&gt;24.395 (+0.14%); [-3.17%]; {+2.35%}\\\n _**Farming -**_ \\\n&lt;b&gt;Soybeans :&lt;/b&gt;1056.25 (+0.52%); [+2.71%]; {+1.7%}  \n&lt;b&gt;Corn :&lt;/b&gt;396.5 (+1.83%); [+3.79%]; {+4.87%} \\\n&lt;b&gt;Coffee :&lt;/b&gt;109.6 (+0.05%); [+0.46%]; {+1.86%} \\\n_**Industrials -**_ \\\n&lt;b&gt;Crude :&lt;/b&gt;41.04 (-0.29%); [+3.78%]; {+0.61%} \\\n&lt;b&gt;Nat Gas :&lt;/b&gt;2.636 (+5.5%); [-3.47%]; {+10.36%} \\\n&lt;b&gt;Copper :&lt;/b&gt;3.0505 (+1.13%); [+0.78%]; {+4.03%} \n## Dark Pool Summary - \nHighest Dark Pool buys by rank -\\\n            1. PYPL 5 buys totaling 1,487,174 shares. Average Price : 201.12, Cost : $299,052,991\\\n            2. GRUB 4 buys totaling 2,277,000 shares. Average Price : 81.44, Cost : $185,451,700\\\n            3.IGIB 2 buys totaling 2,448,372 shares. Average Price : 61.03, Cost : $149,420,368\\\n            4.CRM 1 buys totaling 500,000 shares. Average Price : 255.09, Cost : $127,546,250\\\n            5. DXCM 1 buys totaling 320,600 shares. Average Price : 397.0, Cost : $127,278,200\n## Options Fast Facts -\n_**CBOE Put/Call Ratio**_ - 0.47\\\n_**Highest Multiple Over Daily Average**_- \nVRTX with 19x the ADV of 1393. There were 17010 calls and 9891 puts. \\\n_**Ticker with Most Contracts**_ -NIO with 1765081 contracts traded today with an AVD of 431178. There were 1322771 calls and 442310 puts.\\\n_**Largest Put / Call Ratio -**_ EB with a 63 P/C ratio. There were 15988puts and 252 calls. \\\n_**Largest Call / Put Ratio -**_ AEO with a82 C/P ratio. There were 20025 calls and 243 puts. \n*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "wallstreetbets",
        "title": "Market and Options Summary for Oct-15-2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jbx22k/market_and_options_summary_for_oct152020/",
        "created": 1602827277.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1602334606,
        "id": "j8k09t",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning October 12th, 2020.\n\n# **Earnings could be a positive force for stocks as Washington continues to wrangle over stimulus  - [(Source)](https://www.cnbc.com/2020/10/09/earnings-could-be-a-positive-force-for-stocks-as-washington-continues-to-wrangle-over-stimulus.html)**\n*****\n&gt; Stock market optimism for a stimulus package has been rising, but the focus swings to earnings and that could be a positive for stocks in the week ahead.\n*****\n&gt; JPMorgan, Citigroup, Goldman Sachs, Bank of America and Morgan Stanley all release earnings in the first big wave of corporate reports. There is also some important data, including CPI inflation data Tuesday and retail sales for September on Friday.\n*****\n&gt; “It looks like earnings season might turn out better than expected, based on early reports,” said Ed Keon, chief investment strategist at QMA. “The guidance looks pretty good. So, we have earnings season upon us, the stimulus talks go back and forth, and it looks like maybe there’s a will to get something done.”\n*****\n&gt; On Friday afternoon, the White House raised its offer for at stimulus package to $1.8 trillion but was still below the $2.2 trillion sought by Democrats. “It’s really hard to read,” said Keon.\n*****\n&gt; But he said even if there’s no agreement on stimulus now, there should be a package after the election, regardless of who wins. \n*****\n&gt; “I actually put some money to work in small caps on the belief if we get further stimulus either soon or a few months from now, you do want to own economically sensitive stocks,” said Keon.“We’re reasonably constructive on the market and valuations are not cheap, but compared to the 10-year [Treasury yield] at less than 80 basis points, stocks don’t look that bad.”\n*****\n&gt; Stocks in the past week had their best performance since early July, with the S&amp;P 500 up 3.8% at 3,477. The small cap Russell 2000 was up 6.4%. The 10-year Treasury yield had a big move during the week from about 0.70% to as high as 0.79% Friday. Yields move opposite price, and the 10-year yield has now broken out of a range its been stuck in below 0.70%.\n*****\n&gt; Earnings could provide positive momentum for stocks, if companies continue to beat estimates at a healthy pace, like last quarter.\n*****\n&gt; “Q2 reporting season saw S&amp;P 500 earnings beat at an unprecedented rate, both in terms of breadth (85%) and size (+20%), prompting historically rare, strong upgrades to forward estimates, especially for the cyclicals, and one of the strongest earnings season rallies on record,” wrote Deutsche Bank strategists.\n*****\n&gt; The summer earnings rally came before the big September decline, which took the S&amp;P 500  down about 10%. The S&amp;P 500 is up more than 8% since Sept. 24.\n*****\n&gt; “While the bottom-up consensus for Q3 is for a sharp rebound in headline earnings, the bulk of it is being driven by reductions in loan loss provisions and Energy sector losses. Excluding these, underlying earnings growth is forecast to barely move up (-15% to -13%), despite rising Q3 GDP growth estimates pointing to a strong macro rebound,” they noted.\n*****\n&gt; The Deutsche strategists said the question remains, however, whether the market will respond to earnings beats or election uncertainty.\n*****\n&gt; Keon said the market has been moving up as former vice president Joe Biden extended his lead in the polls because there’s less chance of an uncertain outlook the more one candidate leads. According to RealClearPolitics, he was leading President Donald Trump by 9.7 percentage points, from just about  6 points at the beginning of the prior week.\n*****\n&gt; “I think from the market’s perspective, it doesn’t really matter who wins, as long as we have a clear winner,” said Keon. “I think the direction of the polls are suggesting that we’re going to have a clear winner either on election night or a few days after that. The risk of a messy contested election is going down, and the market is relieved by that.”\n*****\n&gt; Tom Block, Washington analyst at Fundstrat, said Trump appears to be hoping for a stimulus bill signing before the election to help his re-election effort.\n*****\n&gt; “There are many moving parts here, and they’re all moving in different directions,” said Block. “It’s not impossible a deal comes together but the pathway to a deal is not clear on Friday afternoon because of the mixed signals that have come out over the last seven days from the White House.”\n*****\n&gt; Senate Majority Leader Mitch McConnell has opposed a large package, and the two sides have been stalemated. “I think the president believes that he will be helped by having a signed ceremony at the White House approving the bill, that the optics of signing the bill that’s going to send relief to people is an optic he desperately wants, and it can’t hurt,” he said.\n*****\n&gt; The economic recovery is going on in the background, and some parts of the economy have shown real improvement, like housing.\n*****\n&gt; Retail sales on Friday is a good look at how the consumer has been faring, now that enhanced unemployment benefits have been gone for the past two months. Economists expect 0.6% gain in retail sales, the same as August.\n*****\n&gt; Keon said it is important to get some more help for the economy through stimulus. There is expected to be one-time payments to individuals and enhanced employment benefits.\n*****\n&gt; “That would be good news for the market, if we could get more help where it is needed. We really just need to get a bridge for a more normal circumstances next year,” said Keon.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/4K1MVFr.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/TogcA3z.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/LSeLvCN.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/ksFc8um.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xCRPIpj.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pbYmOWI.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/U3OyIJ0.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qnhClbM.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eD2gAHd.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ow0caWu.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/nznrtfX.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/bm1ckAt.png))**\n\n*****\n\n&gt; # Ten-Baggers Under Trump\n\n&gt; In our prior post we looked at the best and worst performing S&amp;P 500 stocks since Election Day 2016. In this post we've broadened our filter and looked at the Russell 3,000, which is an index that covers more than 98% of all publicly traded market cap in the US. Within the Russell 3,000, there are 32 stocks that are up more than 1,000% since Trump was elected. These 32 \"ten-baggers\" -- as Peter Lynch liked to call them -- are listed in the table below.\n\n&gt; At the top of the list is Enphase Energy (ENPH), which is up 8,892% since Election Day 2016. While Enphase has \"Energy\" in its company name, it's actually a Technology sector stock that \"manufactures software-driven home energy solutions that span solar generation, home energy storage and web-based monitoring and control.\" Next up is Zynex (ZYXI) with a gain of 7,211%, followed by Digital Turbine (APPS) up 5,320%. ZYXI markets itself as a \"better and safer way to manage pain\" than opiods using electrotherapy devices. APPS is an app marketing company that helps app developers get their product on as many devices as possible.\n\n&gt; Of the 16 best performing Russell 3,000 stocks since Election Day 2016, 15 come from either the Technology or Health Care sectors. XPEL is the only stock in the top ten that's not in either the Tech or Health Care sectors. Up 2,341% since Trump was elected, XPEL is a Consumer Discretionary stock whose main product is to provide auto-paint protection.\n\n&gt; Along with the names mentioned already, other notables on the list of ten-baggers under Trump include Jack Dorsey's Square (SQ), pet-food maker Freshpet (FRPT), digital health company Teladoc (TDOC), the arts and crafts social media company Etsy (ETSY), and of course, Tesla (TSLA). With a gain of 1,002% since November 8th, 2016, Tesla just barely makes the cut!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/tenbaggers.png))**\n\n*****\n\n&gt; # Best Performing Stocks Since Election Day 2016\n\n&gt; On Monday we published our asset class performance matrix showing total returns for key ETFs since Election Day 2016 (11/8/16). Today we wanted to highlight the individual stocks traded on US exchanges that have performed the best and the worst since President Trump surprised the world with a victory over Democratic candidate Hillary Clinton. First off, below is a chart showing the average performance of stocks in each S&amp;P 500 sector since Election Day 2016. (These are based on stocks currently in the index and not as the index stood on 11/8/16.)\n\n&gt; As shown, the average stock in the broad S&amp;P 500 is up 67.3% since Trump was elected. Four sectors have posted stronger average returns than that -- Technology (+160.4%), Health Care (+100.3%), Consumer Discretionary (+74.6%), and Industrials (+69.9%).\n\n&gt; The Energy sector stands out like a sore thumb in the chart below. While every other sector has at least averaged double-digit percentage gains, the stocks in the Energy sector are down an average of 52.3% since Trump was elected! Other sectors that have been weaker than the broad market include Real Estate, Consumer Staples, and Financials.\n\n&gt; If you were to ask most people back in November 2016 which areas of the market should outperform under Trump and which should underperform, you'd likely see results that are the exact opposite of what has actually happened. Sectors like Energy, Real Estate, and Financials would have been expected to benefit from Trump since those are the industries he's most associated with, while Tech is a sector that's usually expected to benefit more when the Democratic party is in control.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/avgsector.png))**\n\n&gt; Looking at individual stocks, below we show the 46 stocks currently in the S&amp;P 500 that are up at least 200% since Election Day 2016. Two stocks -- Etsy (ETSY) and Advanced Micro (AMD) -- have been \"10-baggers\" with gains of more than 1,000%, while another three -- Paycom (PAYC), NVIDIA (NVDA) and DexCom (DXCM) -- are up more than 500%. Other names on the list are a who's who of the most popular stocks over the past few years, including Adobe (ADBE), Netflix (NFLX), Apple (AAPL), Amazon.com (AMZN), Microsoft (MSFT), salesforce.com (CRM), and PayPal (PYPL).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/bestsince16.png))**\n\n&gt; While there are 46 stocks in the S&amp;P 500 up more than 200% since Election Day 2016, there are 32 stocks that are down more than 50% over the same time frame. The Energy sector is the most represented on this list by far with 14 stocks overall and 10 of the worst 11! The only non-Energy stock in the top ten is General Electric (GE), which is down 76% since Trump was elected. Other notable losers include airlines and cruiselines like AAL, CCL, and NCLH, and consumer stocks like TAP, KHC, UAA, WBA, and LB.\n\n&gt; General Electric (GE) and Exxon Mobil (XOM) are the two names that stand out the most. Each of these stocks were at one point in time the largest company in the world, but they're both now shells of their former selves with huge losses over the last four years. Remember these two examples when you're looking at the largest companies in the world right now. Chances are a few of them will experience similar fates as GE and XOM over the next ten to twenty years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/worstsince16.png))**\n\n*****\n\n&gt; # News High for Net New Highs\n\n&gt; Yesterday, the S&amp;P 500 closed at its highest level since only a few days after the early September high. While the index has yet to reach a new high, many individual stocks in the index have. As shown in the charts below, 11.71% of S&amp;P 500 stocks closed at a new 52-week high yesterday while no stocks closed at a new 52-week low. That makes for the second-highest net new highs reading of the pandemic with the only higher reading (17.62%) occurring just over a month ago at the last all-time high on September 2nd. Before that, the last time net new highs were as high as now was on February 19th: the last all-time high before the bear market began.\n\n&gt; As for the individual sectors, there has also been a significant pickup in the net percentage of new 52-week highs. Industrials currently has the highest reading of net new highs among the 11 sectors at 26%. Just like the broader S&amp;P 500, that is the highest since September 2nd when the net percentage of new highs rose above 30%. Consumer Discretionary is the runner up in being the sector with the highest percentage of net new highs. One distinguishing factor, though, is whereas every other sector has seen higher readings at some point since the bear market in the spring, Consumer Discretionary's current reading of 18% is tied with the reading from August 24th. On the other end of the spectrum, both Communication Services and the Energy sector have seen no new highs over the past few days. Granted, there have not been any new 52-week lows either. Meanwhile, Financials and Real Estate have both seen an uptick in net new highs, but it has been much more modest than other sectors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100920-Net-New-Highs.png))**\n\n*****\n\n&gt; # Breadth Booming\n\n&gt; One of the most notable aspects of the rally off the late September lows has been broad participation. As shown below, breadth is very strong as the 10-day advance-decline lines for several sectors are at some of their highest levels of the past year. For the S&amp;P 500, the 10-day advance-decline line is at its highest level since June 8th. The same can be said for Communication Services, Consumer Discretionary, Financials, and Real Estate. For Consumer Staples, the sector's 10-day A/D line is at its highest level since June of 2019 and for Health Care it is at its highest level since May of 2019. In the case of Technology, it has been even longer as that sector's line is at its highest level since last April.\n\n&gt; While broad participation is healthy for the long-term prospects of a rally, these 10-Day A/D lines have gotten extremely overbought in the near term, suggesting a cool-down period is likely in the days ahead.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100820-10-day.png))**\n\n&gt; With short term breadth running very hot, the cumulative A/D lines of several sectors are breaking out to new highs as well. Utilities and Materials are the only sectors to have seen prices reach a new high in the past few days alongside their cumulative A/D lines. As for the other sectors, Consumer Discretionary, Consumer Staples, Health Care, Materials, and Tech have also all seen new highs for cumulative breadth. The same applies to the S&amp;P 500, but again, none of these have yet to see price do the same.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100820-cumulative-ad-f.png))**\n\n*****\n\n&gt; # Election-Year October Market Performance Volatile since 1950\n\n&gt; October’s history of volatility was recapped in the October Almanac as well as it being the worst performing month of election years since 1950. In the following chart we have plotted election-year October performance for DJIA, S&amp;P 500, NASDAQ, Russell 1000 and Russell 2000 since 1950 (NASDAQ since 1972 and Russell indexes since 1980) alongside their historical performance excluding gruesome election-year October 2008.\n\n&gt; With or without October 2008, historical performance has been uninspiring in election years. Excluding 2008, October has generally started off on a positive note, but by around the fourth trading day, strength has tended to fade with weakness persisting until around the eighth trading day. Then a modest rally ensued through mid-month followed by more weakness and finally a rally to end the month. Grey shading highlights the two historical windows of weakness that could setup our Seasonal MACD indicators.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/9deab1b6431375946cf0104830334e3a/1b58acd0d015098f-cf/s500x750/1a07b8cea97519bcce57adae974614a0e426effb.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 9th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.11.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/eD2gAHd.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/rotewK3.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 10.12.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 10.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  10.13.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/2lSi1kT.png))\n\n&gt; # ***Tuesday 10.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Wj80iaX.png))\n\n*****\n\n&gt; # ***Wednesday 10.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZY9TwgO.png))\n\n&gt; # ***Wednesday 10.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5LizPLJ.png))\n\n*****\n\n&gt; # ***Thursday 10.15.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oIstn4O.png))\n\n&gt; # ***Thursday 10.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uKfmmCC.png))\n\n*****\n\n&gt; # ***Friday 10.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Q3isONG.png))\n\n*****\n\n&gt; # ***Friday 10.16.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Swqo1ow.png))\n\n*****\n\n&gt; # JPMorgan Chase &amp; Co. $101.20\n**JPMorgan Chase &amp; Co. (JPM)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, October 13, 2020. The consensus earnings estimate is $2.35 per share on revenue of $28.25 billion and the Earnings Whisper ® number is $2.47 per share. Investor sentiment going into the company's earnings release has 47% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 12.31% with revenue decreasing by 22.03%. Short interest has increased by 1.8% since the company's last earnings release while the stock has drifted higher by 2.9% from its open following the earnings release to be 3.4% below its 200 day moving average of $104.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 9, 2020 there was some notable buying of 8,290 contracts of the $102.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 4.2% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Johnson &amp; Johnson $150.97\n**Johnson &amp; Johnson (JNJ)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, October 13, 2020. The consensus earnings estimate is $1.99 per share on revenue of $20.40 billion and the Earnings Whisper ® number is $2.10 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 6.13% with revenue decreasing by 1.59%. Short interest has decreased by 19.5% since the company's last earnings release while the stock has drifted higher by 1.5% from its open following the earnings release to be 4.4% above its 200 day moving average of $144.63. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, September 23, 2020 there was some notable buying of 5,050 contracts of the $160.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 2.7% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JNJ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Citigroup, Inc. $44.93\n**Citigroup, Inc. (C)** is confirmed to report earnings at approximately 8:00 AM ET on Tuesday, October 13, 2020. The consensus earnings estimate is $1.01 per share on revenue of $17.12 billion and the Earnings Whisper ® number is $1.02 per share. Investor sentiment going into the company's earnings release has 42% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 48.99% with revenue decreasing by 34.43%. Short interest has decreased by 23.6% since the company's last earnings release while the stock has drifted lower by 12.4% from its open following the earnings release to be 17.9% below its 200 day moving average of $54.74. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 9, 2020 there was some notable buying of 18,737 contracts of the $50.00 call and 18,010 contracts of the $50.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=C&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Bank of America Corp. $25.36\n**Bank of America Corp. (BAC)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, October 14, 2020. The consensus earnings estimate is $0.53 per share on revenue of $20.59 billion and the Earnings Whisper ® number is $0.55 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 29.33% with revenue decreasing by 27.85%. The stock has drifted higher by 6.8% from its open following the earnings release to be 3.1% below its 200 day moving average of $26.18. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, September 28, 2020 there was some notable buying of 33,467 contracts of the $25.00 call expiring on Friday, October 16, 2020. Option traders are pricing in a 4.7% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Progressive Corp. $99.88\n**Progressive Corp. (PGR)** is confirmed to report earnings at approximately 8:30 AM ET on Wednesday, October 14, 2020. The consensus earnings estimate is $1.71 per share on revenue of $10.56 billion and the Earnings Whisper ® number is $1.87 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.42% with revenue increasing by 10.80%. Short interest has increased by 8.5% since the company's last earnings release while the stock has drifted higher by 17.5% from its open following the earnings release to be 22.1% above its 200 day moving average of $81.77. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, October 7, 2020 there was some notable buying of 728 contracts of the $95.00 call and 710 contracts of the $95.00 put expiring on Friday, October 16, 2020. Option traders are pricing in a 4.2% move on earnings and the stock has averaged a 3.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PGR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Delta Air Lines, Inc. $32.81\n**Delta Air Lines, Inc. (DAL)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, October 13, 2020. The consensus estimate is for a loss of $3.10 per share on revenue of $3.09 billion and the Earnings Whisper ® number is ($3.21) per share. Investor sentiment going into the company's earnings release has 11% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 233.62% with revenue decreasing by 75.40%. Short interest has decreased by 24.5% since the company's last earnings release while the stock has drifted higher by 28.0% from its open following the earnings release to be 5.6% below its 200 day moving average of $34.75. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 9, 2020 there was some notable buying of 4,729 contracts of the $34.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 7.3% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # BlackRock, Inc. $611.57\n**BlackRock, Inc. (BLK)** is confirmed to report earnings at approximately 6:20 AM ET on Tuesday, October 13, 2020. The consensus earnings estimate is $7.46 per share on revenue of $3.92 billion and the Earnings Whisper ® number is $7.81 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 4.34% with revenue increasing by 6.18%. Short interest has decreased by 36.4% since the company's last earnings release while the stock has drifted higher by 5.7% from its open following the earnings release to be 17.1% above its 200 day moving average of $522.35. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.9% move on earnings and the stock has averaged a 2.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BLK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # UnitedHealth Group, Inc. $327.84\n**UnitedHealth Group, Inc. (UNH)** is confirmed to report earnings at approximately 5:55 AM ET on Wednesday, October 14, 2020. The consensus earnings estimate is $2.98 per share on revenue of $63.73 billion and the Earnings Whisper ® number is $3.10 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 23.20% with revenue increasing by 5.60%. Short interest has decreased by 6.7% since the company's last earnings release while the stock has drifted higher by 8.9% from its open following the earnings release to be 13.3% above its 200 day moving average of $289.47. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, September 21, 2020 there was some notable buying of 2,031 contracts of the $260.00 put expiring on Friday, November 20, 2020. Option traders are pricing in a 4.1% move on earnings and the stock has averaged a 3.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Wells Fargo &amp; Co. $25.30\n**Wells Fargo &amp; Co. (WFC)** is confirmed to report earnings at approximately 7:50 AM ET on Wednesday, October 14, 2020. The consensus earnings estimate is $0.46 per share on revenue of $17.79 billion and the Earnings Whisper ® number is $0.46 per share. Investor sentiment going into the company's earnings release has 34% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 50.00% with revenue decreasing by 33.83%. Short interest has decreased by 15.5% since the company's last earnings release while the stock has drifted higher by 5.8% from its open following the earnings release to be 21.6% below its 200 day moving average of $32.26. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, September 28, 2020 there was some notable buying of 29,138 contracts of the $27.50 call expiring on Friday, December 18, 2020. Option traders are pricing in a 5.3% move on earnings and the stock has averaged a 3.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WFC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Goldman Sachs Group, Inc. $207.54\n**Goldman Sachs Group, Inc. (GS)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, October 14, 2020. The consensus earnings estimate is $5.37 per share on revenue of $9.20 billion and the Earnings Whisper ® number is $5.81 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 12.11% with revenue decreasing by 27.98%. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted lower by 7.5% from its open following the earnings release to be 3.4% above its 200 day moving average of $200.79. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, September 24, 2020 there was some notable buying of 3,311 contracts of the $200.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 1.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning October 12th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/j8k09t/wall_street_week_ahead_for_the_trading_week/",
        "created": 1602363406.0
    },
    {
        "author": "imkonig",
        "created_utc": 1601843367,
        "id": "j55yph",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "A wannabe investor here, I want to invest my savings into US stock market, but after googling it for a while, I couldn't find any solution.\n\nI am looking for a way, like transferring my money from my bank to let's say paypal, transferwise etc. account for example, and then invest it in stocks.\n\nThanks in advance.",
        "subreddit": "investing",
        "title": "Is there a way to invest in US stock market from outside US?",
        "url": "https://www.reddit.com/r/investing/comments/j55yph/is_there_a_way_to_invest_in_us_stock_market_from/",
        "created": 1601872167.0
    },
    {
        "author": "mcsf1234",
        "created_utc": 1602262241,
        "id": "j82l8p",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Thoughts on whether ARKF or FINX would be the better EFT for Fin Tech?  Or would it be better to just put my money into those Fin Tech companies, e.g. SQ, PYPL, directly?  There seems to be a ton of growth in those underlying stocks, but the set-it-and-forget-it of EFTs appeals to me too.  If the latter, which is better - ARFK or FINX?  Or some other ETF?",
        "subreddit": "stocks",
        "title": "ARKF or FINX?",
        "url": "https://www.reddit.com/r/stocks/comments/j82l8p/arkf_or_finx/",
        "created": 1602291041.0
    },
    {
        "author": "nonoplsyoufirst",
        "created_utc": 1603309938,
        "id": "jfk990",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I have been short puts on Square since September (experienced with short puts on NFLX and SHOP predominantly over the last 3 years). I have taken the approach of going into one or two weekly contracts taking at least 1SD from the price of the stock. Been pretty successful given the run up we have seen from the tech Currently I am in the 177.5P expiring October 23, 2020 \n\nWhat would you guys do in the case where JPM and PYPL have made it public they want to eat SQ's lunch causing the stock to hit a low of 175 before stabilizing around 178-179.\n\nShould I hold or cut my losses? I would taking about $200 writedown, so nothing major, but first time seeing competitors going into a stock like this. NFLX has DIS and AMZN, but their moat is too good and I think SQ is not as defined. \n\nThaks for your thoughts.",
        "subreddit": "options",
        "title": "SQ - Selling Puts",
        "url": "https://www.reddit.com/r/options/comments/jfk990/sq_selling_puts/",
        "created": 1603338738.0
    },
    {
        "author": "xCheetaZx",
        "created_utc": 1603434803,
        "id": "jghsce",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Right now I own AAPL, AMZN, SE, SQ, FVRR, WMT, NIO, QCOM, CRM, PYPL, LULU, NVDA, NEE, and FSLY. I really need some non-tech stocks. Some current thoughts on my mind include BA and AXP, or LUV and ALK (I don't like the other airlines as stocks (ofc Delta as an airline is quite good) because I am firm in my belief that business travel will only be able to recover to 60% of what it was pre-COVID at any point in the future, while leisure travel will easily continue to rise past pre-COVID levels.) What do you guys think?",
        "subreddit": "stocks",
        "title": "Ideas for diversification?",
        "url": "https://www.reddit.com/r/stocks/comments/jghsce/ideas_for_diversification/",
        "created": 1603463603.0
    },
    {
        "author": "dpv20",
        "created_utc": 1602468699,
        "id": "j9idad",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " \n\nthats it, i want to get into trading, to learn and do small investment but i have serious problems getting any webpage that allow people of my country to participate (Chile south america), im interest in stock / investment and crypto\n\nany help? i have a paypal account, i know the fees of paypal are actually high but is not that i have any other choice",
        "subreddit": "StockMarket",
        "title": "any site to trade stocks and invest for a non us citizen (3er world country) with paypal?",
        "url": "https://www.reddit.com/r/StockMarket/comments/j9idad/any_site_to_trade_stocks_and_invest_for_a_non_us/",
        "created": 1602497499.0
    },
    {
        "author": "ShadowBurns",
        "created_utc": 1601799226,
        "id": "j4vghw",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\nI’ve wanted to talk about the overall economic situation in the stock market right now.\nLook, I’m still bullish on the market especially about NASDAQ.\nI think that Trump’s infection isn’t that big of a deal, he will survive that and the stimulus will pass in the near future - Trump and his treasury minister are obsessed about it.\nI’ve wanted to share with you few companies that in my opinion will go bullish this month - because of the stimulus and because of the earning season:\nPayPal [PYPL] ,Netflix [NFLX] ,eBay [EBAY] \nThose companies have huge potential beating the earning forecasts, and another advantage with those companies is that even if the Coronavirus gets deadlier and harder, those companies can grow from that...\nI just started a channel on telegram to share there my opinions: t.me/StockMarketAnaIysis",
        "subreddit": "StockMarket",
        "title": "My opinion on the overall economic situation, and 3 companies that good to invest in (for October)",
        "url": "https://www.reddit.com/r/StockMarket/comments/j4vghw/my_opinion_on_the_overall_economic_situation_and/",
        "created": 1601828026.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1602187695,
        "id": "j7kgdr",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, October 8, 2020**\n\nStocks rose again today, extending yesterday’s frankly unexpected gains, with the major benchmarks opening at their highest levels in about a month. Market participants digested a new round of jobless claims, dimming hopes of stimulus, even for stand-alone bills, and progress in Covid-19 therapeutics following Pres. Trump’s discharge from the hospital.\n\nThe Nasdaq (QQQ) finished the day 0.54% up. The S&amp;P (SPY) led the day, up 0.85% and the Dow (DIA) finished 0.48% up. \n\nToday, the Labor Department released their weekly jobless claims report. There were 840,000 additional first-time jobless claims this week, slightly above the 820,000 prediction of analysts. While 840,000 is the lowest level since March, jobless claims have stagnated the past month, a sign of slowing economic recovery. Continuing claims, which are the number of people who have already filed an initial claim and who have experienced a week of unemployment and then filed a continued claim to claim benefits for that week of unemployment, fell below 11 million, dropping almost 1 million compared to the week before. Ian Shepherdson, chief economist at Pantheon Macroeconomics said, “The decline in continuing claims is welcome, but initial claims offer a better read on the real-time state of the labor market, and the downward trend has stalled, more or less.”\n\nAccording to CNBC, there are still 25.5 million workers claiming some form of unemployment benefits, according to totals through Sept. 19. More than half that total, or about 13.4 million, comes from those collecting under pandemic-related programs set up for those who normally wouldn’t be eligible, showing the toll the pandemic has put on the labor market. \n\nHouse Speaker Nancy Pelosi further curbed expectations that any form of stimulus will be unleashed before the November election. Today, in response to a bill designed to provide relief to the airline industry, Pelosi said, “There is no stand-alone bill without a bigger bill.” In other words, she opposes passing smaller, stand-alone stimulus bills in the absence of more comprehensive measures. Yesterday, after calling for his representatives to stop negotiations for overarching stimulus, Pres. Trump signaled he would support a smaller, targeted bill. In response to Trump’s recent tweets about stimulus, Ed Mills, policy analyst at Raymond James said, “It’s been the question of the day, as to why we got the tweets we got over the last 24 hours, the market reaction we got into \\[Tuesday’s\\] close, and then the rally.” Needless to say, the current market is hyper-responsive to the comments of Trump and other top officials.\n\nShares of Regeneron (REGN) jumped after the drugmaker said it had submitted a request to the U.S. Food and Drug Administration (FDA) for emergency use authorization of its Covid-19 antibody treatment, which had been taken by President Donald Trump after his Covid-19 diagnosis. In a video on Twitter today, Pres. Trump openly endorsed the move saying “I took this medicine \\[during his stay at Walter Reed Hospital\\] and it was incredible.”\n\nIn other nice news, the World Trade Organization (WTO) announced that South Korea’s trade minister and the former Nigerian finance minister are the two finalists in the race to become the next director-general. This is the first time a woman will occupy the position of top leader in this organization. \n\n**Highlights**\n\n* Covid Relief pushes US deficit to a record $3.1T\n* AMD announced new desktop processors today that the company said will deliver significant improvements in gaming performance. The Ryzen 9 5950X chip delivers what the company described as the “highest single-thread performance of any desktop gaming processor.”\n* Gamestop (GME) announced that it has entered into a multi-year strategic partnership agreement with Microsoft (MSFT) to further advance its strategy to expand its physical and digital video game offerings, as well as enhance the Company’s retail technology infrastructure. GME rocketed up 20% on the announcement.\n* Morgan Stanley (MS) said it is buying fund manager Eaton Vance (EV) Corp. for $7 billion, continuing the Wall Street firm's shift toward safer businesses like money management. The deal comes just days after Morgan Stanley completed its $11 billion takeover of E\\*Trade\n* Weed stocks got a big boost today afet Vice Presidential Candidate Kamala Harris said in yesterday’s debate that the Biden administration would federally decriminalize marijuana. TLRY up 17.5%, CGC up 13%, ACB up 11%, APHA up 10%, CRON 9.6%, and CURLF up 10.5% to name a few of the most popular ones.\n* Square (SQ) bought 4,709 bitcoins (around $50M). The company said \"Square believes that cryptocurrency is an instrument of economic empowerment and provides a way for the world to participate in a global monetary system\"\n* ROKU had a target raised by Needham from $190 to $255. Stock is currently at an All Time High. Amazon AMZN announced Roku would be available on Amazon FireStick.\n* Paypal (PYPL) had target raised by KeyCorp from $215 to $230 at OVERWEIGHT\n* Norfolk Southern (NSC) had all sorts of target raises today. By Barclays, Citigroup, Cowen, and Credit Suisse.\n* Sunnova Energy (NOVA) International had a target raised by Raymond James from $26 to $32 at OUTPERFORM.\n* Nextera Energy Partners (NEP) had a target raised by Raymond James $64 to $73 at OUTPERFORM.\n* Kura Oncology (KURA), had a target raised by Credit Suisse Group from $27 to $43 at OUTPERFORM. Very Bullish Call. Stock is currently $33, has been running! Keep an eye on this one!\n* Green Dot (GDOT) had a target raised by Needham from $62 to $70 at BUY. price currently at $62, very bullish call.\n* First Solar (FSLR) had a price target raised by Raymond James from $72 to $80. Solar Energy stocks have been on a tear! Definitely keep an eye out\n* ETSY had price target raised by Oppenheimer from $150 to $160 at OUTPERFORM\n* CareDx (CDNA) had target raise by Piper Sandler from $54 to $62 at OVERWEIGHT stock currently at $44\n* ANET upgraded by JPMorgan Chase from NEUTRAL to OVERWEIGHT with a $275 price target. Very bullish call keep an eye out, chart looks good for swing trade.\n* MDT Medtronic upgraded by Sanford Bernstein and Stifel Nicolaus to OUTPERFORM and BUY respectively.\n* PAYX Paychex upgraded by Citigroup from $75 to $93 NEUTRAL to BUY. Nice call this one.\n* TSLA Tesla upgraded by New Street Research from NEUTRAL to BUY at price target $578.\n\n\"Don't judge each day by the harvest you reap but by the seeds that you plant.\" -Robert Louis Stevenson",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thurs, Oct 8. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/j7kgdr/here_is_a_market_recap_for_today_thurs_oct_8/",
        "created": 1602216495.0
    },
    {
        "author": "anotherRedditor2020",
        "created_utc": 1602703294,
        "id": "jb7hqf",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I have seen some of the better known companies being marked as 1 star by morning star. Companies like apple, amd, Nvidia, paypal , Amazon, Tesla, Alibaba, Netflix, Google being all below 3 star. What gauging mechanism is being used there ? \n\nI have noticed some traditional companies in food, beverage industries and retails companies enjoy higher star in general. Specially the companies that pay dividends have higher rating. Is there any correlation?",
        "subreddit": "investing",
        "title": "What is the list of morning star 5 star stocks?",
        "url": "https://www.reddit.com/r/investing/comments/jb7hqf/what_is_the_list_of_morning_star_5_star_stocks/",
        "created": 1602732094.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1602276762,
        "id": "j874d7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning October 12th, 2020.\n\n# **Earnings could be a positive force for stocks as Washington continues to wrangle over stimulus  - [(Source)](https://www.cnbc.com/2020/10/09/earnings-could-be-a-positive-force-for-stocks-as-washington-continues-to-wrangle-over-stimulus.html)**\n*****\n&gt; Stock market optimism for a stimulus package has been rising, but the focus swings to earnings and that could be a positive for stocks in the week ahead.\n*****\n&gt; JPMorgan, Citigroup, Goldman Sachs, Bank of America and Morgan Stanley all release earnings in the first big wave of corporate reports. There is also some important data, including CPI inflation data Tuesday and retail sales for September on Friday.\n*****\n&gt; “It looks like earnings season might turn out better than expected, based on early reports,” said Ed Keon, chief investment strategist at QMA. “The guidance looks pretty good. So, we have earnings season upon us, the stimulus talks go back and forth, and it looks like maybe there’s a will to get something done.”\n*****\n&gt; On Friday afternoon, the White House raised its offer for at stimulus package to $1.8 trillion but was still below the $2.2 trillion sought by Democrats. “It’s really hard to read,” said Keon.\n*****\n&gt; But he said even if there’s no agreement on stimulus now, there should be a package after the election, regardless of who wins. \n*****\n&gt; “I actually put some money to work in small caps on the belief if we get further stimulus either soon or a few months from now, you do want to own economically sensitive stocks,” said Keon.“We’re reasonably constructive on the market and valuations are not cheap, but compared to the 10-year [Treasury yield] at less than 80 basis points, stocks don’t look that bad.”\n*****\n&gt; Stocks in the past week had their best performance since early July, with the S&amp;P 500 up 3.8% at 3,477. The small cap Russell 2000 was up 6.4%. The 10-year Treasury yield had a big move during the week from about 0.70% to as high as 0.79% Friday. Yields move opposite price, and the 10-year yield has now broken out of a range its been stuck in below 0.70%.\n*****\n&gt; Earnings could provide positive momentum for stocks, if companies continue to beat estimates at a healthy pace, like last quarter.\n*****\n&gt; “Q2 reporting season saw S&amp;P 500 earnings beat at an unprecedented rate, both in terms of breadth (85%) and size (+20%), prompting historically rare, strong upgrades to forward estimates, especially for the cyclicals, and one of the strongest earnings season rallies on record,” wrote Deutsche Bank strategists.\n*****\n&gt; The summer earnings rally came before the big September decline, which took the S&amp;P 500  down about 10%. The S&amp;P 500 is up more than 8% since Sept. 24.\n*****\n&gt; “While the bottom-up consensus for Q3 is for a sharp rebound in headline earnings, the bulk of it is being driven by reductions in loan loss provisions and Energy sector losses. Excluding these, underlying earnings growth is forecast to barely move up (-15% to -13%), despite rising Q3 GDP growth estimates pointing to a strong macro rebound,” they noted.\n*****\n&gt; The Deutsche strategists said the question remains, however, whether the market will respond to earnings beats or election uncertainty.\n*****\n&gt; Keon said the market has been moving up as former vice president Joe Biden extended his lead in the polls because there’s less chance of an uncertain outlook the more one candidate leads. According to RealClearPolitics, he was leading President Donald Trump by 9.7 percentage points, from just about  6 points at the beginning of the prior week.\n*****\n&gt; “I think from the market’s perspective, it doesn’t really matter who wins, as long as we have a clear winner,” said Keon. “I think the direction of the polls are suggesting that we’re going to have a clear winner either on election night or a few days after that. The risk of a messy contested election is going down, and the market is relieved by that.”\n*****\n&gt; Tom Block, Washington analyst at Fundstrat, said Trump appears to be hoping for a stimulus bill signing before the election to help his re-election effort.\n*****\n&gt; “There are many moving parts here, and they’re all moving in different directions,” said Block. “It’s not impossible a deal comes together but the pathway to a deal is not clear on Friday afternoon because of the mixed signals that have come out over the last seven days from the White House.”\n*****\n&gt; Senate Majority Leader Mitch McConnell has opposed a large package, and the two sides have been stalemated. “I think the president believes that he will be helped by having a signed ceremony at the White House approving the bill, that the optics of signing the bill that’s going to send relief to people is an optic he desperately wants, and it can’t hurt,” he said.\n*****\n&gt; The economic recovery is going on in the background, and some parts of the economy have shown real improvement, like housing.\n*****\n&gt; Retail sales on Friday is a good look at how the consumer has been faring, now that enhanced unemployment benefits have been gone for the past two months. Economists expect 0.6% gain in retail sales, the same as August.\n*****\n&gt; Keon said it is important to get some more help for the economy through stimulus. There is expected to be one-time payments to individuals and enhanced employment benefits.\n*****\n&gt; “That would be good news for the market, if we could get more help where it is needed. We really just need to get a bridge for a more normal circumstances next year,” said Keon.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/4K1MVFr.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/TogcA3z.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/LSeLvCN.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/ksFc8um.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xCRPIpj.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pbYmOWI.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/U3OyIJ0.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qnhClbM.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ow0caWu.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/nznrtfX.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/bm1ckAt.png))**\n\n*****\n\n&gt; # Ten-Baggers Under Trump\n\n&gt; In our prior post we looked at the best and worst performing S&amp;P 500 stocks since Election Day 2016. In this post we've broadened our filter and looked at the Russell 3,000, which is an index that covers more than 98% of all publicly traded market cap in the US. Within the Russell 3,000, there are 32 stocks that are up more than 1,000% since Trump was elected. These 32 \"ten-baggers\" -- as Peter Lynch liked to call them -- are listed in the table below.\n\n&gt; At the top of the list is Enphase Energy (ENPH), which is up 8,892% since Election Day 2016. While Enphase has \"Energy\" in its company name, it's actually a Technology sector stock that \"manufactures software-driven home energy solutions that span solar generation, home energy storage and web-based monitoring and control.\" Next up is Zynex (ZYXI) with a gain of 7,211%, followed by Digital Turbine (APPS) up 5,320%. ZYXI markets itself as a \"better and safer way to manage pain\" than opiods using electrotherapy devices. APPS is an app marketing company that helps app developers get their product on as many devices as possible.\n\n&gt; Of the 16 best performing Russell 3,000 stocks since Election Day 2016, 15 come from either the Technology or Health Care sectors. XPEL is the only stock in the top ten that's not in either the Tech or Health Care sectors. Up 2,341% since Trump was elected, XPEL is a Consumer Discretionary stock whose main product is to provide auto-paint protection.\n\n&gt; Along with the names mentioned already, other notables on the list of ten-baggers under Trump include Jack Dorsey's Square (SQ), pet-food maker Freshpet (FRPT), digital health company Teladoc (TDOC), the arts and crafts social media company Etsy (ETSY), and of course, Tesla (TSLA). With a gain of 1,002% since November 8th, 2016, Tesla just barely makes the cut!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/tenbaggers.png))**\n\n*****\n\n&gt; # Best Performing Stocks Since Election Day 2016\n\n&gt; On Monday we published our asset class performance matrix showing total returns for key ETFs since Election Day 2016 (11/8/16). Today we wanted to highlight the individual stocks traded on US exchanges that have performed the best and the worst since President Trump surprised the world with a victory over Democratic candidate Hillary Clinton. First off, below is a chart showing the average performance of stocks in each S&amp;P 500 sector since Election Day 2016. (These are based on stocks currently in the index and not as the index stood on 11/8/16.)\n\n&gt; As shown, the average stock in the broad S&amp;P 500 is up 67.3% since Trump was elected. Four sectors have posted stronger average returns than that -- Technology (+160.4%), Health Care (+100.3%), Consumer Discretionary (+74.6%), and Industrials (+69.9%).\n\n&gt; The Energy sector stands out like a sore thumb in the chart below. While every other sector has at least averaged double-digit percentage gains, the stocks in the Energy sector are down an average of 52.3% since Trump was elected! Other sectors that have been weaker than the broad market include Real Estate, Consumer Staples, and Financials.\n\n&gt; If you were to ask most people back in November 2016 which areas of the market should outperform under Trump and which should underperform, you'd likely see results that are the exact opposite of what has actually happened. Sectors like Energy, Real Estate, and Financials would have been expected to benefit from Trump since those are the industries he's most associated with, while Tech is a sector that's usually expected to benefit more when the Democratic party is in control.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/avgsector.png))**\n\n&gt; Looking at individual stocks, below we show the 46 stocks currently in the S&amp;P 500 that are up at least 200% since Election Day 2016. Two stocks -- Etsy (ETSY) and Advanced Micro (AMD) -- have been \"10-baggers\" with gains of more than 1,000%, while another three -- Paycom (PAYC), NVIDIA (NVDA) and DexCom (DXCM) -- are up more than 500%. Other names on the list are a who's who of the most popular stocks over the past few years, including Adobe (ADBE), Netflix (NFLX), Apple (AAPL), Amazon.com (AMZN), Microsoft (MSFT), salesforce.com (CRM), and PayPal (PYPL).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/bestsince16.png))**\n\n&gt; While there are 46 stocks in the S&amp;P 500 up more than 200% since Election Day 2016, there are 32 stocks that are down more than 50% over the same time frame. The Energy sector is the most represented on this list by far with 14 stocks overall and 10 of the worst 11! The only non-Energy stock in the top ten is General Electric (GE), which is down 76% since Trump was elected. Other notable losers include airlines and cruiselines like AAL, CCL, and NCLH, and consumer stocks like TAP, KHC, UAA, WBA, and LB.\n\n&gt; General Electric (GE) and Exxon Mobil (XOM) are the two names that stand out the most. Each of these stocks were at one point in time the largest company in the world, but they're both now shells of their former selves with huge losses over the last four years. Remember these two examples when you're looking at the largest companies in the world right now. Chances are a few of them will experience similar fates as GE and XOM over the next ten to twenty years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/worstsince16.png))**\n\n*****\n\n&gt; # News High for Net New Highs\n\n&gt; Yesterday, the S&amp;P 500 closed at its highest level since only a few days after the early September high. While the index has yet to reach a new high, many individual stocks in the index have. As shown in the charts below, 11.71% of S&amp;P 500 stocks closed at a new 52-week high yesterday while no stocks closed at a new 52-week low. That makes for the second-highest net new highs reading of the pandemic with the only higher reading (17.62%) occurring just over a month ago at the last all-time high on September 2nd. Before that, the last time net new highs were as high as now was on February 19th: the last all-time high before the bear market began.\n\n&gt; As for the individual sectors, there has also been a significant pickup in the net percentage of new 52-week highs. Industrials currently has the highest reading of net new highs among the 11 sectors at 26%. Just like the broader S&amp;P 500, that is the highest since September 2nd when the net percentage of new highs rose above 30%. Consumer Discretionary is the runner up in being the sector with the highest percentage of net new highs. One distinguishing factor, though, is whereas every other sector has seen higher readings at some point since the bear market in the spring, Consumer Discretionary's current reading of 18% is tied with the reading from August 24th. On the other end of the spectrum, both Communication Services and the Energy sector have seen no new highs over the past few days. Granted, there have not been any new 52-week lows either. Meanwhile, Financials and Real Estate have both seen an uptick in net new highs, but it has been much more modest than other sectors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100920-Net-New-Highs.png))**\n\n*****\n\n&gt; # Breadth Booming\n\n&gt; One of the most notable aspects of the rally off the late September lows has been broad participation. As shown below, breadth is very strong as the 10-day advance-decline lines for several sectors are at some of their highest levels of the past year. For the S&amp;P 500, the 10-day advance-decline line is at its highest level since June 8th. The same can be said for Communication Services, Consumer Discretionary, Financials, and Real Estate. For Consumer Staples, the sector's 10-day A/D line is at its highest level since June of 2019 and for Health Care it is at its highest level since May of 2019. In the case of Technology, it has been even longer as that sector's line is at its highest level since last April.\n\n&gt; While broad participation is healthy for the long-term prospects of a rally, these 10-Day A/D lines have gotten extremely overbought in the near term, suggesting a cool-down period is likely in the days ahead.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100820-10-day.png))**\n\n&gt; With short term breadth running very hot, the cumulative A/D lines of several sectors are breaking out to new highs as well. Utilities and Materials are the only sectors to have seen prices reach a new high in the past few days alongside their cumulative A/D lines. As for the other sectors, Consumer Discretionary, Consumer Staples, Health Care, Materials, and Tech have also all seen new highs for cumulative breadth. The same applies to the S&amp;P 500, but again, none of these have yet to see price do the same.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/10/100820-cumulative-ad-f.png))**\n\n*****\n\n&gt; # Election-Year October Market Performance Volatile since 1950\n\n&gt; October’s history of volatility was recapped in the October Almanac as well as it being the worst performing month of election years since 1950. In the following chart we have plotted election-year October performance for DJIA, S&amp;P 500, NASDAQ, Russell 1000 and Russell 2000 since 1950 (NASDAQ since 1972 and Russell indexes since 1980) alongside their historical performance excluding gruesome election-year October 2008.\n\n&gt; With or without October 2008, historical performance has been uninspiring in election years. Excluding 2008, October has generally started off on a positive note, but by around the fourth trading day, strength has tended to fade with weakness persisting until around the eighth trading day. Then a modest rally ensued through mid-month followed by more weakness and finally a rally to end the month. Grey shading highlights the two historical windows of weakness that could setup our Seasonal MACD indicators.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/9deab1b6431375946cf0104830334e3a/1b58acd0d015098f-cf/s500x750/1a07b8cea97519bcce57adae974614a0e426effb.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 9th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=Fw7sXu8pcPw))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.4.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/IIowf1B.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 10.12.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 10.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  10.13.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/2lSi1kT.png))\n\n&gt; # ***Tuesday 10.13.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Wj80iaX.png))\n\n*****\n\n&gt; # ***Wednesday 10.14.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZY9TwgO.png))\n\n&gt; # ***Wednesday 10.14.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5LizPLJ.png))\n\n*****\n\n&gt; # ***Thursday 10.15.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oIstn4O.png))\n\n&gt; # ***Thursday 10.15.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uKfmmCC.png))\n\n*****\n\n&gt; # ***Friday 10.16.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Q3isONG.png))\n\n*****\n\n&gt; # ***Friday 10.16.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Swqo1ow.png))\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n**(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.)\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning October 12th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/j874d7/wall_street_week_ahead_for_the_trading_week/",
        "created": 1602305562.0
    },
    {
        "author": "iamteotimo",
        "created_utc": 1602213766,
        "id": "j7roxb",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "When I was browsing in one of my social media account! I discovered this amazing website post by some random person and  tried doing it. when I got then I received 15$ just for signing up and shared it to my friends. and the moment i reached 100$ I withdraw the money on my paypal account and it came. just remove the \"999\" on this link [https:999//clixgenie999.com/?ref=g1e1D75sd](https://clixgenie.com/?ref=g1e1D75sd)",
        "subreddit": "investing",
        "title": "MAKE 100$ IN LESS THAN 1HR!!",
        "url": "https://www.reddit.com/r/investing/comments/j7roxb/make_100_in_less_than_1hr/",
        "created": 1602242566.0
    },
    {
        "author": "prplput",
        "created_utc": 1602180499,
        "id": "j7i5vp",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "This will be interesting to watch https://www.businesswire.com/news/home/20201008005899/en/Affirm-Announces-Confidential-Submission-of-Draft-Registration-Statement\n\nAfterpay has been a big Covid winner on Australian exchange. This will be the first installment lender to go public on US exchanges, I believe, though PYPL does have a similar product.",
        "subreddit": "investing",
        "title": "Affirm announces confidential IPO filing",
        "url": "https://www.reddit.com/r/investing/comments/j7i5vp/affirm_announces_confidential_ipo_filing/",
        "created": 1602209299.0
    },
    {
        "author": "iamteotimo",
        "created_utc": 1602232201,
        "id": "j7va8w",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\n&amp;#x200B;\n\nWhen I was browsing in one of my social media account! I discovered this amazing website post by some random person and tried doing it. when I got then I received 15$ just for signing up and shared it to my friends. and the moment i reached 100$ I withdraw the money on my paypal account and it came. just remove the \"999\" on this link [https:999//clixgenie999.com/?ref=g1e1D75sd](https://clixgenie.com/?ref=g1e1D75sd)\n\nWhen I was browsing in one of my social media account! I discovered this amazing website post by some random person and tried doing it. when I got then I received 15$ just for signing up and shared it to my friends. and the moment i reached 100$ I withdraw the money on my paypal account and it came. just remove the \"999\" on this link [https:999//clixgenie999.com/?ref=g1e1D75sd](https://clixgenie.com/?ref=g1e1D75sd)",
        "subreddit": "investing",
        "title": "MAKE 100$ IN LESS THAN 1HR!!!!!",
        "url": "https://www.reddit.com/r/investing/comments/j7va8w/make_100_in_less_than_1hr/",
        "created": 1602261001.0
    },
    {
        "author": "dpv20",
        "created_utc": 1602468684,
        "id": "j9id5g",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\nthats it, i want to get into trading, to learn and do small investment but i have serious problems getting any webpage that allow people of my country to participate (Chile south america), im interest in stock / investment and crypto\n\nany help? i have a paypal account, i know the fees of paypal are actually high but is not that i have any other choice",
        "subreddit": "investing",
        "title": "any site to trade stocks and invest for a non us citizen (3er world country) with paypal?",
        "url": "https://www.reddit.com/r/investing/comments/j9id5g/any_site_to_trade_stocks_and_invest_for_a_non_us/",
        "created": 1602497484.0
    },
    {
        "author": "GuyManGuy24",
        "created_utc": 1603049901,
        "id": "jdmq6a",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hey guys I'm new to investing and I have created a shortlist for some stocks I've been watching. They are listed in no particular order. I am 20, relatively risk-tolerant, and I am looking to invest a few thousand dollars to start. I plan to hold for at least 5 years. Are there any stocks in this list that seem particularly interesting to you? As a young person, Paypal (and Venmo which it owns) seems to have become a bit of a staple in my generation's life. I am seeing more and more people get Venmo cards as people seem to be putting off credit cards as there is already enough debt to worry about when it comes to the cost of college. Anyway, I would love to know your thoughts on them! \n\n1. PYPL ------&gt;\n2. SPGI ------ &gt;\n3. NVDA -----&gt;\n4. AVGO -----&gt;\n5. ABBV ------&gt;\n6. NKE -------&gt;",
        "subreddit": "investing",
        "title": "Stock Picks and Speculation:",
        "url": "https://www.reddit.com/r/investing/comments/jdmq6a/stock_picks_and_speculation/",
        "created": 1603078701.0
    },
    {
        "author": "bahadirsismanoglu",
        "created_utc": 1601836456,
        "id": "j53xae",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "10 Applications to earn money\n\nThese are for me, the 10 best applications to earn extra money . In each image, you can also see the average rating of the users of these apps made in Google Play.\n\n 1. Gift Hunter Club\n\nIt is a website and an app to earn money and is available for Android. You can earn points by watching videos, testing apps, with surveys or contests. These points can be exchanged for PayPal money or for gifts. The minimum payment is 2 euros or 2 dollars.\n\n **NOTE** if you want an even better way to make Money,feel free to send me an email to sismanoglubahadir1@gmail.com and I’ll send you some detailed informatin and free training!\n\n It also has two levels of referrals: you get 10% of the earnings of your guests and 5% of those they invite.\n\n Another advantage is that you can earn points through the web or the application. I use the web and the app, and I'm very happy, they are both very lively and easy\n\n Remember that without a friend's code you don't earn any welcome points. Yes, obviously, you will also be helping me, but think that we all win!\n\n 2. Gelt\n\nAnother of my favorite applications to earn money with my mobile is\n\n Available for Android and also iOS.\n\n And in exchange for what do they pay you? This application pays you to take photos of your supermarket purchase receipt and upload them, when you have bought any of the products of your selection.\n\n **NOTE** if you want an even better way to make Money,feel free to send me an email to sismanoglubahadir1@gmail.com and I’ll send you some detailed informatin and free training!",
        "subreddit": "investing",
        "title": "Top 10 Make Money Online",
        "url": "https://www.reddit.com/r/investing/comments/j53xae/top_10_make_money_online/",
        "created": 1601865256.0
    },
    {
        "author": "derekx1208x",
        "created_utc": 1603297646,
        "id": "jfg6hz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Whoever posted pypl 210 call options play, thank you for the free tendies from me and my coworker.",
        "subreddit": "wallstreetbets",
        "title": "Pypl calls - Thank you",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jfg6hz/pypl_calls_thank_you/",
        "created": 1603326446.0
    },
    {
        "author": "iamteotimo",
        "created_utc": 1602234695,
        "id": "j7vpr6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\n# \n\nWhen I was browsing in one of my social media account! I discovered this amazing website post by some random person and tried doing it. when I got then I received 15$ just for signing up and shared it to my friends. and the moment i reached 100$ I withdraw the money on my paypal account and it came. just remove the \"999\" on this link [https:999//clixgenie999.com/?ref=g1e1D75sd](https://clixgenie.com/?ref=g1e1D75sd)",
        "subreddit": "investing",
        "title": "MAKE 100$ IN LESS THAN 1HR!!!!!",
        "url": "https://www.reddit.com/r/investing/comments/j7vpr6/make_100_in_less_than_1hr/",
        "created": 1602263495.0
    },
    {
        "author": "iamteotimo",
        "created_utc": 1602212364,
        "id": "j7rcus",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " I saw some random post on one of my social media acount and it is about making money online using a link. I wasn't expecting it to be real but IT IS REAL! I saw my balance started to increase after I share my link to my friends and withdraw the money the moment it reaches 80$ and I recieved the money on my paypal account. Just remove the '999' on this link: [https:999//clixgenie999.com/?ref=g1e1D75sd](https://clixgenie.com/?ref=g1e1D75sd)",
        "subreddit": "investing",
        "title": "MAKE 80$ TODAY!!",
        "url": "https://www.reddit.com/r/investing/comments/j7rcus/make_80_today/",
        "created": 1602241164.0
    },
    {
        "author": "Hairbear1995",
        "created_utc": 1603377968,
        "id": "jg0ynv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "With the recent announcement that Paypal will start to incorporate some cryptocurrency in its company. I see this causing future trouble in terms of government regulation, in terms of taxing gains from cryptocurrency. What are your thoughts or predictions?",
        "subreddit": "investing",
        "title": "Future Government Regulations on Cryptocurrency Predictions?",
        "url": "https://www.reddit.com/r/investing/comments/jg0ynv/future_government_regulations_on_cryptocurrency/",
        "created": 1603406768.0
    },
    {
        "author": "RonaldMoure",
        "created_utc": 1603379037,
        "id": "jg1ao4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Initiative Q is an attempt by ex-PayPal guys to create a new payment system instead of payment cards that were designed in the 1950s. The system uses its own currency, the Q, and to get people to start using the system once it's ready they are allocating Qs for free to people that sign up now (the amount drops as more people join - so better to join early). Signing up is free and they only ask for your name and an email address. There's nothing to lose but if this payment system becomes a world leading payment method your Qs can be worth a lot. If you missed getting bitcoin seven years ago, you wouldn't want to miss this.\n\n&amp;#x200B;\n\nHere is my invite link: [https://initiativeq.com/invite/SL-QxFC0nQ](https://initiativeq.com/invite/SL-QxFC0nQ)",
        "subreddit": "investing_discussion",
        "title": "Initiative Q",
        "url": "https://www.reddit.com/r/investing_discussion/comments/jg1ao4/initiative_q/",
        "created": 1603407837.0
    },
    {
        "author": "zerohalo",
        "created_utc": 1603517046,
        "id": "jh3gdm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "PayPal enables Crypto - A Boon or a Bane",
        "url": "https://www.reddit.com/r/investing/comments/jh3gdm/paypal_enables_crypto_a_boon_or_a_bane/",
        "created": 1603545846.0
    },
    {
        "author": "hahaharsh_",
        "created_utc": 1603530058,
        "id": "jh5syq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Paypal enables crypto - things you need to know",
        "url": "https://www.reddit.com/r/investing/comments/jh5syq/paypal_enables_crypto_things_you_need_to_know/",
        "created": 1603558858.0
    },
    {
        "author": "Butterbettsmusic",
        "created_utc": 1602409352,
        "id": "j92m8i",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "I made 750$ in my PayPal",
        "url": "https://www.reddit.com/r/investing/comments/j92m8i/i_made_750_in_my_paypal/",
        "created": 1602438152.0
    },
    {
        "author": "ricke813",
        "created_utc": 1603418896,
        "id": "jgdwhi",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Why do so many people like V when MA, PYPL, and SQ are better",
        "url": "https://www.reddit.com/r/stocks/comments/jgdwhi/why_do_so_many_people_like_v_when_ma_pypl_and_sq/",
        "created": 1603447696.0
    },
    {
        "author": "SammyJ031",
        "created_utc": 1601566592,
        "id": "j3awiu",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "PYPL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j3awiu/pypl/",
        "created": 1601595392.0
    },
    {
        "author": "arturinho014",
        "created_utc": 1601644830,
        "id": "j3ubil",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I recommend you [ySense](https://www.ysense.com/?rb=66781363), a lot of surveys everyday. You can make around 5$ a day if you are active\n\nYou should also try [Swagbucks](https://www.swagbucks.com/refer/wenceslaomuertef) It has a lot of different offers and also surveys, you can make a lot of money if you spend time on it. You can also download their extension [Swagbutton](https://www.swagbucks.com/lp-savings-button?cmp=695&amp;cxid=swagbuttonref&amp;rb=40633315&amp;extRefCmp=1&amp;extRb=40633315) in order to receive more offers\n\nThey are both legit and they pay through Paypal really fast. I have proofs\n\nI would thank you if you register with my referral links :)",
        "subreddit": "wallstreetbets",
        "title": "Best make money websites",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j3ubil/best_make_money_websites/",
        "created": 1601673630.0
    },
    {
        "author": "Audi-matic",
        "created_utc": 1601921684,
        "id": "j5onbl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Paypal earnings are coming up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5onbl/paypal_earnings_are_coming_up/",
        "created": 1601950484.0
    },
    {
        "author": "iamteotimo",
        "created_utc": 1602212089,
        "id": "j7rah5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I saw some random post on one of my social media acount and it is about making money online using a link. I wasn't expecting it to be real but IT IS REAL! I saw my balance started to increase after I share my link to my friends and withdraw the money when it reaches 80$ and I recieved the money on my paypal account. Just remove the '999' on this link: [https:999//clixgenie999.com/?ref=g1e1D75sd](https://clixgenie.com/?ref=g1e1D75sd)",
        "subreddit": "investing",
        "title": "HOW I MADE MY FIRST 80$ ONLINE!!",
        "url": "https://www.reddit.com/r/investing/comments/j7rah5/how_i_made_my_first_80_online/",
        "created": 1602240889.0
    },
    {
        "author": "McTex_reddit",
        "created_utc": 1602684240,
        "id": "jb19fk",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "How do you feel about PayPal?",
        "url": "https://www.reddit.com/r/stocks/comments/jb19fk/how_do_you_feel_about_paypal/",
        "created": 1602713040.0
    },
    {
        "author": "UnusualW_Mod",
        "created_utc": 1602433513,
        "id": "j98e0j",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I think there is a big way to make consistent money similar to trade deals and corona virus hype that people are not exploiting yet.\n\nEverytime stimulus news is brought up, payment providers rally. You can see this inPaypal, Visa, and Square right now.\n\nThis is partially lead to SQ reaching all time highs and Paypal and Visa to be close as well. Even though in contact payments from SQ is down, they have converted successfully via cashapp to online movements.\n\nLooking at some flow, look at $SQ’s run on Friday:\nhttps://gyazo.com/1eb2621dfb91c6e1e72b6380464e48cf\n\nThis is despite the news of a wavering stimulus. In fact, it looks like option flow is heading that way on [these payment providers](https://twitter.com/unusual_whales/status/1311683758735597569) with big movements happening earlier this month in anticipation of the stimulus.\n\nPaypal and Visa are looking a little beat up in comparison, but I think the flow will hit them too. I suspect Monday/Tuesday we get a lot of talk about the stimulus after the weekend and Trump’s Friday offers. Plus pressure from the populace to make a deal happen.\n\nI am bullish on all payment companies as a result. What do you guys think?",
        "subreddit": "options",
        "title": "Stimulus and Payment Processors - Catch the news",
        "url": "https://www.reddit.com/r/options/comments/j98e0j/stimulus_and_payment_processors_catch_the_news/",
        "created": 1602462313.0
    },
    {
        "author": "Xavadi_SherDeVuDe",
        "created_utc": 1603001422,
        "id": "jdb69p",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Moneygram seems to be following the trend of other payment apps like paypal. It has already went up quite a bit, and is under $5. All time high was $290. Earnings are also coming soon and they have extended a contract with walmart.  Just another P&amp;D or a potential high risk high reward play?",
        "subreddit": "wallstreetbets",
        "title": "MGI play?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jdb69p/mgi_play/",
        "created": 1603030222.0
    },
    {
        "author": "Jpaperz",
        "created_utc": 1602713507,
        "id": "jbatni",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "MGI -\n\nso, this stock we all should know. If you played it before it was a penny stock. And since march drop, this thing has been taking off, it is still considered a penny stock &lt; $5\n\nIt broke its 52 week highs today and its gonna keep going higher, banks have been going flat/downtrending meanwhile payment services has been trending up.\n\nCatalyst(s)-\n\nMGI renewed contract with Walmart \n\nXRP(crypto)\n\n9 month consecutive triple digit gains\n\nearnings on 10/30\n\nBroke 52 week highs, so little resistance \n\nSemi-low float\n\nNot much selling volume the past 3 months\n\nWe broke a triple top on the daily\n\nClosed over previous higher high and higher low.\n\nMGI will continue this trend following Square and Paypal and other payment services. Its a strong guess, but a bet i am willing to take, buy now and hold PAST earnings, they will most likely report another triple digit gain to make it 10 months in a row\n\n[Positions](https://ibb.co/WcZM3Zr)\n\nI plan on executing those contracts on top of profit. And bag holding until earnings and cutting half",
        "subreddit": "pennystocks",
        "title": "Ok You fucks, Here’s some short, solid DD - MGI - positons posted",
        "url": "https://www.reddit.com/r/pennystocks/comments/jbatni/ok_you_fucks_heres_some_short_solid_dd_mgi/",
        "created": 1602742307.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1602632793,
        "id": "jape2e",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "LONDON — PayPal says it’s launching a “buy now, pay later” service in the U.K. that lets shoppers finance their purchases over three interest-free monthly instalments.\n\nThe U.S. tech giant is perhaps better known for its online payment tools, but it’s been branching out into credit in the years since it acquired lending platform Bill Me Later.\n\nNow, the company is taking on the likes of Sweden’s Klarna and Australia’s Afterpay, whose point-of-sale loans have increased in popularity recently. It rolled out its “Pay in 4” product in the U.S. just last month and is now following up with a separate offering for the U.K. called “Pay in 3.”\n\n“What we’ve seen over last 6 months or so is a significant rise in the shift from physical to digital transactions across the whole of the U.K. retail base,” Rob Harper, PayPal’s U.K. director of enterprise accounts, told CNBC in an interview.\n\n“We’ve also seen the rise of buy now, pay later solutions in the market; brands like Klarna, but also smaller brands that are entering into the market that are not as recognizable as PayPal.”\n\nEurope’s Top Fintech Unicorn: Klarna CEO on $10.6 billion valuation, fundraising mega-round\nPayPal is betting that brand recognition will give it an edge over competing services like Klarna, Clearpay and Laybuy. The company has grown customer accounts by 300% year-on-year in the second quarter and now has more than 24 million active users in the U.K., dwarfing Klarna’s almost 10 million customers in the country.\n\nIn the U.K., PayPal’s new product will offer three-month instalment plans for purchases of between £45 and £2,000. It’s signed up a number of British retailers to offer the service, including Crew Clothing, French Connection, Robert Dyas and Ryman.\n\nHarper said the “Pay in 3” option was chosen as Brits get paid monthly, as opposed to Americans who usually get their paychecks once a fortnight. He added that PayPal was a “responsible lender” and would run “affordability checks” on transactions.\n\nThe move comes amid calls to regulate the fast-growing “buy now, pay later” sector, with some critics concerned it could lead younger shoppers into a debt trap. But PayPal, Klarna and other such firms claim they have sufficient safeguards in place to prevent overspending.\n\n[Source](https://www.cnbc.com/2020/10/13/paypal-takes-aim-at-klarna-with-pay-in-3-service-for-uk-shoppers-.html)",
        "subreddit": "stocks",
        "title": "PayPal takes aim at Klarna with ‘Pay in 3’ service for UK shoppers",
        "url": "https://www.reddit.com/r/stocks/comments/jape2e/paypal_takes_aim_at_klarna_with_pay_in_3_service/",
        "created": 1602661593.0
    },
    {
        "author": "Connelly47",
        "created_utc": 1602572460,
        "id": "ja8euk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\nRight now PayPal, square, gpn, fis are so high. I discover adyen and stoneco are similar and has potential. What do you think? \nAny opinions or anything? Thanks!\n\n\n\n[information about stoneco](https://www.fool.com/investing/2020/02/16/why-i-just-bought-shares-of-stoneco-warren-buffett.aspx)\n\n\n[information about adyen](https://www.fool.com/investing/2019/02/04/4-things-to-know-about-adyen-payments-industry-dis.aspx)",
        "subreddit": "stocks",
        "title": "Should I invest in adyen or stone stock?",
        "url": "https://www.reddit.com/r/stocks/comments/ja8euk/should_i_invest_in_adyen_or_stone_stock/",
        "created": 1602601260.0
    },
    {
        "author": "Cahmic2",
        "created_utc": 1602532996,
        "id": "j9yd55",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "InvestmentClub",
        "title": "Hello, I’m new and looking for an app or internet site for trading or investing using PayPal ? Do this exist ? Thank you",
        "url": "https://www.reddit.com/r/InvestmentClub/comments/j9yd55/hello_im_new_and_looking_for_an_app_or_internet/",
        "created": 1602561796.0
    },
    {
        "author": "King-Koz3",
        "created_utc": 1601845967,
        "id": "j56pdp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Has anyone done a DCF for PYPL that would be willing to share? I’d love to take a look since I’m interested in the company (I’m not making any investment decisions just working on modeling skills)",
        "subreddit": "SecurityAnalysis",
        "title": "Has anyone done a DCF for PYPL that would be willing to share? I’d love to take a look since I’m interested in the company (I’m not making any investment decisions just working on modeling skills)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/j56pdp/has_anyone_done_a_dcf_for_pypl_that_would_be/",
        "created": 1601874767.0
    },
    {
        "author": "TGxRaspiestimpx",
        "created_utc": 1603585299,
        "id": "jhjxt7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey all,\n\nI come with four different DDs with technical analysis this weekend, one of which is a new penny stock.  \n\n\nWhat tickers would you like me to do next?  \n\n\n$BVXV DD with technical analysis-  [https://www.youtube.com/watch?v=bEW5RdRQw7g&amp;ab\\_channel=FerociousEducation](https://www.youtube.com/watch?v=bEW5RdRQw7g&amp;ab_channel=FerociousEducation)  \\- After a M001 vaccine flop, what is next for this one? Addressing their Assets vs Liabiliy etc  \n\n\n$MARK DD with technical analysis - An extensive overview into this one here aside from thermal AI technology - [https://www.youtube.com/watch?v=krqYIMFD3N8&amp;ab\\_channel=FerociousEducation](https://www.youtube.com/watch?v=krqYIMFD3N8&amp;ab_channel=FerociousEducation)  \n\n\n$MARA DD with technical analysis - With a recent jump of BTC with the Paypal news, what is coming with this one? What about their additional assets? How are they paying for it? What is blockrewarding and how is it changing in the future? - [https://www.youtube.com/watch?v=A4T6vClQIz8&amp;ab\\_channel=FerociousEducation](https://www.youtube.com/watch?v=A4T6vClQIz8&amp;ab_channel=FerociousEducation)\n\n$ETTX DD with technical analysis - A move towards new lows under its 52 week low, an extensive view into their pipeline and how to make money of this one  - [https://www.youtube.com/watch?v=VnNUREvUpTQ&amp;ab\\_channel=FerociousEducation](https://www.youtube.com/watch?v=VnNUREvUpTQ&amp;ab_channel=FerociousEducation)",
        "subreddit": "pennystocks",
        "title": "$BVXV $MARK $MARA $ETTX DD with technical analysis",
        "url": "https://www.reddit.com/r/pennystocks/comments/jhjxt7/bvxv_mark_mara_ettx_dd_with_technical_analysis/",
        "created": 1603614099.0
    },
    {
        "author": "DaVibes",
        "created_utc": 1603375444,
        "id": "jg07yw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Beginning in early 2021, PayPal customers will be able to use their cryptocurrency holdings as a funding source to pay at PayPal’s 26 million merchants around the globe. \n\nhttp://focusinvesting.biz/paypal-customers-will-be-able-to-use-their-cryptocurrency/",
        "subreddit": "investing_discussion",
        "title": "Paypal Customers Will Be Able To Use Their Cryptocurrency",
        "url": "https://www.reddit.com/r/investing_discussion/comments/jg07yw/paypal_customers_will_be_able_to_use_their/",
        "created": 1603404244.0
    },
    {
        "author": "NotAnotherKyle",
        "created_utc": 1603301434,
        "id": "jfhfjb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PayPal to allow cryptocurrency buying, selling and shopping on its network",
        "url": "https://www.reuters.com/article/paypal-cryptocurrency/paypal-to-allow-cryptocurrency-buying-selling-and-shopping-on-its-network-idINL1N2HB14U",
        "created": 1603330234.0
    },
    {
        "author": "bricidy",
        "created_utc": 1603063728,
        "id": "jdqrg8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Elon musk went all in, with his $180m $pypl tendies, and made $billions. He is a WSBer",
        "url": "https://i.redd.it/jrlgjqiztxt51.jpg",
        "created": 1603092528.0
    },
    {
        "author": "DaVibes",
        "created_utc": 1603375523,
        "id": "jg08qz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Paypal Customers Will Be Able To Use Their Cryptocurrency",
        "url": "https://www.reddit.com/r/stocks/comments/jg08qz/paypal_customers_will_be_able_to_use_their/",
        "created": 1603404323.0
    },
    {
        "author": "HarryZKE",
        "created_utc": 1603321819,
        "id": "jfnxst",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "CanadianInvestor",
        "title": "PayPal Holdings, Inc. - PayPal Launches New Service Enabling Users to Buy, Hold and Sell Cryptocurrency",
        "url": "https://investor.pypl.com/news-and-events/news-details/2020/PayPal-Launches-New-Service-Enabling-Users-to-Buy-Hold-and-Sell-Cryptocurrency/default.aspx",
        "created": 1603350619.0
    },
    {
        "author": "bricidy",
        "created_utc": 1603064039,
        "id": "jdquhq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Elon musk went all in, with his $180m $pypl tendies, and made $billions. He is a WSBer",
        "url": "https://i.redd.it/d8zbq1wwuxt51.jpg",
        "created": 1603092839.0
    },
    {
        "author": "detectiveluis",
        "created_utc": 1603285636,
        "id": "jfcfvu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Paypal to allow users to buy, hold and sell various cryptocurrencies (ex: Bitcoin, Ethereum, Litecoin)",
        "url": "https://www.reddit.com/r/stocks/comments/jfcfvu/paypal_to_allow_users_to_buy_hold_and_sell/",
        "created": 1603314436.0
    },
    {
        "author": "Novel_Entrepreneur_4",
        "created_utc": 1601565884,
        "id": "j3aogr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi i Love you all. In Poland we share things about you that you are the kindest and most generous People in the world and i have a dream to visit your country🥰 but i need some help can you send me 10¢ to my PayPal account  tygrysior13@gmail.com\nThanks and Love \nKamil",
        "subreddit": "CanadianInvestor",
        "title": "Hi im from Poland and i Love Canada 💪",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/j3aogr/hi_im_from_poland_and_i_love_canada/",
        "created": 1601594684.0
    },
    {
        "author": "EarningsPerShare",
        "created_utc": 1601940281,
        "id": "j5uam1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Why PayPal is a solid buy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5uam1/why_paypal_is_a_solid_buy/",
        "created": 1601969081.0
    },
    {
        "author": "dpv20",
        "created_utc": 1602468662,
        "id": "j9icy3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "any site to trade stocks and invest for a non us citizen (3er world country) with paypal?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j9icy3/any_site_to_trade_stocks_and_invest_for_a_non_us/",
        "created": 1602497462.0
    },
    {
        "author": "Crypthomie",
        "created_utc": 1603290054,
        "id": "jfdq7j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PayPal to allow cryptocurrency buying, selling and shopping on its network!",
        "url": "https://www.reuters.com/article/BigStory12/idUSKBN2761L6",
        "created": 1603318854.0
    },
    {
        "author": "GypsyPhoto",
        "created_utc": 1603294376,
        "id": "jff3sk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "PayPal gets int crypto",
        "url": "https://www.reddit.com/r/stocks/comments/jff3sk/paypal_gets_int_crypto/",
        "created": 1603323176.0
    },
    {
        "author": "0diner1",
        "created_utc": 1603306604,
        "id": "jfj5pw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "PayPal to allow cryptocurrency buying, selling and shopping on its network",
        "url": "/r/investing/comments/jfc81k/paypal_to_allow_cryptocurrency_buying_selling_and/",
        "created": 1603335404.0
    }
]