[
    {
        "author": "BawceHog",
        "created_utc": 1594400354,
        "id": "hoslq1",
        "num_comments": 174,
        "num_crossposts": 0,
        "selftext": "If you had $500,000 to disperse among 5 or so tech stocks today with plans to exit in roughly 5 years, what companies would you invest in? Although many tech stocks are likely far overvalued right now, I don't think we are in the same tech bubble like the early 2000's and hoping there is still room to ride the wave. Below are the technology plays I have made since 2011, all of which have worked out well except one.\n\n* Netflix 2011 \n* Facebook 2013 \n* Tesla 2013 \n* GoPro 2014 (IPO - sold at $98/share) \n* Salesforce 2014 \n* iRobot 2015 \n* Microsoft 2018, 2019 \n* ShotSpotter 2019, 1 loser",
        "subreddit": "investing",
        "title": "What tech stocks would you invest in today with plans to exit in ~5 years?",
        "url": "https://www.reddit.com/r/investing/comments/hoslq1/what_tech_stocks_would_you_invest_in_today_with/",
        "created": 1594429154.0
    },
    {
        "author": "MaxandmillionB89",
        "created_utc": 1593883631,
        "id": "hl72r0",
        "num_comments": 137,
        "num_crossposts": 0,
        "selftext": "What do you guys think of this company? Seems like a very good long-term investment. Salesforce is one of the investors, Amazon and Google are some of the clients, new CEO came from ServiceNow, revenues are keep growing at a rapid pace. Sounds like a no-brainer. What am I missing here?",
        "subreddit": "stocks",
        "title": "Snowflake IPO",
        "url": "https://www.reddit.com/r/stocks/comments/hl72r0/snowflake_ipo/",
        "created": 1593912431.0
    },
    {
        "author": "stenlis",
        "created_utc": 1596093945,
        "id": "i0hqu8",
        "num_comments": 132,
        "num_crossposts": 0,
        "selftext": "[A year ago I wrote a list of 20 stocks](https://www.reddit.com/r/investing/comments/coz3u7/strike_it_big_stocks_for_the_next_decade_a/) I believed were high-risk/high-reward investments into new technology for the future. I figured it would be interesting to actually track their development, so here's where we stand now:  \n\n|Ticker|12.08.2019|07.01.2020|30.07.2020|%|\n|---------|----------|----------|----------|-------|\n|GH|$98,63|$79,12|$84,15 |-15%|\n|FLXN|$11,37|$20,00|$13,52 |19%|\n|VRTX|$179,84|$224,03|$278,72 |55%|\n|OMER|$18,41|$13,17|$13,71 |-26%| \n|PCRX|$40,39|$43,87|$52,72 |31%|\n|HXL|$79,89|$75,36|$39,85 |-50%|\n|FMC|$85,57|$98,36|$108,32 |27%|\n|MELI|$623,55|$606,55|$1.086,90 |74%|\n|MSFT|$159,03|$135,79|$204,60 |29%|\n|AMZN|$1.784,92|$1.902,88|$3.033,53 |70%|\n|SHOP|$366,73|$413,33|$1.053,59 |187%|\n|CRM|$140,72|$173,45|$193,61 |38%|\n|SQ|$62,63|$62,57|$128,55 |105%|\n|AYX|$131,08|$108,69|$172,27 |31%|\n|PYPL|$102,72|$110,17|$184,60 |80%|\n|TTD|$255,08|$277,91|$427,84 |68%|\n|ZM|$92,16|$70,32|$252,39 |174%|\n|MDB|$143,51|$140,50|$216,30 |51%|\n|OKTA|$130,50|$123,43|$210,88 |62%|\n|ZS|$83,21|$48,70|$126,97 |53%|\n|TWLO|$131,49|$107,46|$264,62 |101%|  \n\nAverage return: 55%  \nAverage return on \"new tech\": 6%  \nAverage return on \"efficient tech\": 81%  \n\nMy comments:  \nI definitely did not expect the stocks would be this high after just one year. There is a clear divide between the \"new tech\" and the \"efficient tech\" type of companies though: the latter stocks expanded in valuations by a lot. The price to sales on some of them doubled. I'd approach these with caution - the market seems to be a little too exstatic about them, but on the other hand it seems like capital has nowhere else to go so I can't imagine the market abandoning the valuations anytime soon. \n\nOn the other hand the \"new tech\" stocks moved largerly side-ways with two outliers - HXL running into Covid19 trouble as an aerospace supplier and VRTX posting impressive earnings and continuing to execute well on their plan. All in all the valuations of these companies remained sensible in contrast to the \"efficient stocks\". While these should be the higher risk stocks, they seem now like a more reasonable investment.  \n\nLet's see what happens in one year!",
        "subreddit": "investing",
        "title": "\"Strike it big stocks for the next decade\", year 1 retrospective",
        "url": "https://www.reddit.com/r/investing/comments/i0hqu8/strike_it_big_stocks_for_the_next_decade_year_1/",
        "created": 1596122745.0
    },
    {
        "author": "bumblebear3012",
        "created_utc": 1595617451,
        "id": "hx7u89",
        "num_comments": 99,
        "num_crossposts": 0,
        "selftext": "Dates TBD, but Snowflake IPO is expected to value the data-warehouse-as-service company at up $20bn. Revenue has grown from under $100mn in 2018 to projected sales in excess of $400mn for 2020. \n\nSnowflake data is automatically integrated with Salesforce data, and the cloud platform requires next to no management and can process analytics on any scale of data. \n\nGonna be a good one methinks!",
        "subreddit": "stocks",
        "title": "Snowflake IPO: Who’s Excited?",
        "url": "https://www.reddit.com/r/stocks/comments/hx7u89/snowflake_ipo_whos_excited/",
        "created": 1595646251.0
    },
    {
        "author": "CensusWhistleBlower",
        "created_utc": 1595985302,
        "id": "hzr9o3",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "I have a short list of startups that I believe could be the next bucket of long term growth stories. \n\nThese probably won’t be the next goog, fb, Amzn, ntflx. But they could be the next crm, Uber, shop, zm, Tsla\n\nMy list:\n-snowflake\n-AirBnB\n-instacart\n-DoorDash \n-Stripe\n-Robinhood\n-rivian\n-impossible foods\n\nAnyone else have startups they are salivating for their ipo?",
        "subreddit": "investing",
        "title": "Most anticipated IPOs in 2020-2021 for long term hold?",
        "url": "https://www.reddit.com/r/investing/comments/hzr9o3/most_anticipated_ipos_in_20202021_for_long_term/",
        "created": 1596014102.0
    },
    {
        "author": "Cyssero",
        "created_utc": 1594511705,
        "id": "hpkk5f",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "**NCINO**\n\nnCino\n\nPrice Range: $28.00 - $29.00\n\nShares: 7,625,000\n\nMarket Cap: $2.78B\n\nnCino hits all the hot Momo buzzwords in the COVID market. The company is a cloud-based SaaS platform for banks built on the Salesforce platform. There are plenty of inefficiencies still within the world of banking today and nCino offers banks a solution to some of that, most importantly a revenue positive solution. Do they offer more than just buzzword meme potential though?\n\n&gt;On average, financial institutions using nCino’s Bank Operating System have enjoyed a 40% decrease in loan closing time, a 92% reduction in servicing costs, and a 127% increase in account opening completion rates.\n\nThe numbers don't just come from a handful of obscure banks, they already have a sizeable list of clients. See banks over 10 billion: https://www.ncino.com/success/banks-over-10-billion\n\n$138.2M of revenue in FY20 for +51% growth YoY and $44.7M of revenue in FY Q1'21, for +50% growth YoY. Ended FY20 with 1,180+ total customers across 10 countries. nCino ended last quarter at $139.3M of implied ARR, also being +66% growth YoY.\n\nnCino has 12 issued patents and one patent pending; I'm not autistic enough to try and figure out how huge these patents are, but it at least implies they have a decent amount of proprietary technology making it harder for anyone to try and rip off a clone of their service and offer it for cheaper.\n\nLike any startup, there is some cash burn. GAAP losses increased from $4.6m FY19 to $9m FY20. The important thing here though is operating margin has been seeing steady growth and GAAP losses have been steadily decreasing. The last slide on the charts and graphs link really helps put into perspective how good their numbers have looked. When you offer a comprehensive service that you can point to a history of being revenue positive for other clients, it's easy to see how this company could be going places from the IPO price.\n\nCharts, graphs: https://imgur.com/a/2fHifbw\n\n**GOCO**\n\nGoHealth\n\nPrice Range: $18.00 - $20.00\n\nShares:39,500,000\n\nMarket Cap: 5.96B\n\nTheir summary of the company:\n\n&gt;As a leading health insurance marketplace, GoHealth's mission is to improve access to healthcare in America. Enrolling in a health insurance plan can be confusing for customers, and the seemingly small differences between plans can lead to significant out-of-pocket costs or lack of access to critical medicines and even providers. GoHealth combines cutting-edge technology, data science and deep industry expertise to match customers with the healthcare policy and carrier that is best for them. Since its inception, GoHealth has enrolled millions of people in Medicare and individual and family plans. \n\nAlthough they have a fair amount of long-term debt ($840 million in total liabilities) they have already had years generating a profit. From FY 2019-20 they had a profit of $1.4m on $114m of revenue. Not a lot sure, but TDOC has never posted a profit and LVGO scrapes by a few pennies per share right now; with their very impressive revenue growth and swinging trend toward positive cashflow, there aren't any major short-term red flags.\n\nIBISWorld forecasts the market for online insurance brokerage to reach $31.3 billion in 2020 and the average annual growth in online insurance has been just under 10% YoY for the past 5 years so this is a growing market segment. Specifically relevant to this, there are a ton of Boomers set to retire over the next 5 years meaning more people funneling into Medicare.\n\nOnly images of financial data I could find: https://imgur.com/a/Z17KZqf",
        "subreddit": "wallstreetbets",
        "title": "IPOs to Watch this Week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hpkk5f/ipos_to_watch_this_week/",
        "created": 1594540505.0
    },
    {
        "author": "iKalculated",
        "created_utc": 1595374185,
        "id": "hvihb8",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "**Recap**\n\nPrevious Research:\n\n[**https://www.reddit.com/r/options/comments/hrbexa/bullish\\_options\\_plays\\_24\\_month\\_horizon/?utm\\_source=share&amp;utm\\_medium=web2x**](https://www.reddit.com/r/options/comments/hrbexa/bullish_options_plays_24_month_horizon/?utm_source=share&amp;utm_medium=web2x)\n\n[**https://www.reddit.com/r/options/comments/huwfat/short\\_long\\_option\\_plays\\_07202020/?utm\\_source=share&amp;utm\\_medium=web2x**](https://www.reddit.com/r/options/comments/huwfat/short_long_option_plays_07202020/?utm_source=share&amp;utm_medium=web2x)\n\n**This post covers Option Plays for $SQ, $DKNG, $BA**\n\nThe time frame of these options are 3-6 months out, to avoid Theta burn and maximize ITM potential. The beauty of long plays is that the stock only needs to move a few % to be profitable, with a long time horizon as a hedge. Close the position within 2-4 months to minimize theta and maximize delta opportunity. I have also included a shorter time frame with higher risk/reward and lower premiums. Short plays are laid out, but not recommended.\n\n**1) Square, Inc $SQ \\[Information Technology Services\\] - BULLISH**\n\nSquare, Inc. engages in the provision of credit card payment processing solutions. It is a cohesive commerce ecosystem that helps sellers start, run, and grow their businesses. The firms sellers downloads the Square Point of Sale mobile app, they can quickly and easily take their first payment, typically within minutes.\n\nBullish Square Case:\n\nThe ongoing shift toward electronic payments has created, and will continue to create, room for acquirers to see strong growth without stealing share from each other.\n\nAncillary services are becoming a more critical engine for growth and will help Square fully monetize its merchant client base and improve margins.\n\nElectronic payment growth is shifting overseas, and Square’s business model looks portable into international markets, as the company does not rely on a large local salesforce to attract merchants.\n\n[$SQ profile, from FindMarketPlays early access platform](https://preview.redd.it/4htcy9omoac51.png?width=3260&amp;format=png&amp;auto=webp&amp;s=1bb140c3c05f395894cdb3b52d3a3361b956a68b)\n\nIn both previous research posts, I discussed the bullish case of Twitter hinging on a successful subscription platform.\n\nSource: [https://www.theverge.com/2020/7/8/21317266/twitter-subscription-platform-codename-gryphon-job-listing](https://www.theverge.com/2020/7/8/21317266/twitter-subscription-platform-codename-gryphon-job-listing)\n\nSubscription platforms require a reliable payment processor. Guess who Dorsey is going to choose to process payments for Twitter's subscription platform?\n\n[$SQ overlaid with $SHOP, following the same trajectory](https://preview.redd.it/k68o7t9noac51.png?width=1114&amp;format=png&amp;auto=webp&amp;s=679804f6641121de052fc04cfb5927df44bc0e66)\n\n$SHOP is trading at a 69x Price to Revenue multiple, with -$1.16 EPS. $SQ is trading at a 11x Price to Revenue multiple, with $0.72 EPS. Not only is $SQ profitable, it is in a similar niche to $SHOP and has a huge growth opportunity with Twitter's subscription platform.\n\nLet's take a look at the unusual options activity scanner:\n\n[$2 Million in $97.5 calls, expiring Aug 21. Earnings Aug 5](https://preview.redd.it/7fnu22vnoac51.png?width=2144&amp;format=png&amp;auto=webp&amp;s=d5592f8fd416752213194cab97c54f1e123579fb)\n\n[$190 Jan 15 Calls](https://preview.redd.it/6zd9nk6ooac51.png?width=2152&amp;format=png&amp;auto=webp&amp;s=5818f6d7612d173c2c072be19ea9b73d46425646)\n\n[$100 Jan 15 Calls](https://preview.redd.it/23ils0iooac51.png?width=2190&amp;format=png&amp;auto=webp&amp;s=395f5cf3e2d27e4410ee9ef4a23a35dafae884d2)\n\nBig bullish bets on $SQ, notably dated around Jan 15. Coincidentally, that is the timeframe I pegged for $TWTR $40 Calls, and for the Subscription platform to be announced.\n\nPersonal Experience: I set up a Shopify site for a girl I know who started a brick-and-mortar clothing store. She is... technologically challenged, to say the least. Guess what she used for payments in retail? Square. Even with Shopify's poor integration with Square, she stuck with it (Against my advice for inventory &amp; tracking purposes). As states reopen, and smaller brick and mortars are back, farmers markets, carnivals, etc, expect growth from $SQ.\n\nI am eyeing a $118-$122 entry to incorporate the stock into my portfolio, and purchase options.\n\nWith this information, I propose:\n\n**Short Term Play \\[HIGH RISK\\]:**\n\n*SQ $130c Aug 7 2020, trading at $6.57 at time of writing. 41% Probability ITM. Earnings Aug 05 2020.*\n\n**Long Term Play:**\n\n*SQ $160c Jan 15 2021, trading $11.03 at time of writing. 23% Probability ITM*\n\n**2) DraftKings, Inc $DKNG \\[Internet Software/Services\\] - BULLISH**\n\nDraftKings, Inc. operates as a digital sports entertainment and gaming company. It provides online and retail sports wagering offerings, online daily fantasy contests and online casino games.\n\n[$DKNG profile, from FindMarketPlays early access platform](https://preview.redd.it/lc9f468poac51.png?width=3242&amp;format=png&amp;auto=webp&amp;s=81e9f76c2c46787272acfd038574c2ab805bb303)\n\nCurrently, only 5 states have legal online gambling \\[Delaware, Nevada, New Jersey, Pennsylvania, and West Virginia\\]. 23 states have Sports Betting legal and or in legislation.\n\n[From https:\\/\\/investmentu.com\\/sports-betting-stocks\\/](https://preview.redd.it/w3azv2npoac51.png?width=1200&amp;format=png&amp;auto=webp&amp;s=b5e2c311265de353e91d9a5c977398f7c9f39aa1)\n\n**Focus on casino gambling!**\n\nYou can gamble at a casino whether there are sports on or not, and the following states are most likely to legalize online casino gambling in the next 12 months \\[based on legislation\\]:\n\n* California \\[40 Million Population\\]\n* Connecticut \\[3.6 Million Population\\]\n* Illinois \\[13 Million Population\\]\n* Indiana \\[6.6 Million Population\\]\n* Massachusetts \\[6.8 Million Population\\]\n* Nevada \\[2.8 Million Population\\]\n* New York \\[20 Million Population\\]\n\nThese states represent 92.8 Million people, or 30% of the US population.\n\nSource: [https://www.bettingusa.com/states/](https://www.bettingusa.com/states/)\n\n[$DKNG overlaid with $PENN, following the same trajectory](https://preview.redd.it/sdz74goqoac51.png?width=1094&amp;format=png&amp;auto=webp&amp;s=e69918cb4b0687368a534c5e6a8b5e2dbeed5bda)\n\n52 Week high for $DKNG is $44. With Americans sitting at home, legalizing online gambling makes sense financially for governments and to satiate the appetite of the restless, short-attention span population.\n\nLet's take a look at the unusual options activity scanner:\n\n[A stream of bullish plays, ranging from $30 to $40, expiring July 24 and Aug 21.](https://preview.redd.it/mp7gvt4roac51.png?width=2190&amp;format=png&amp;auto=webp&amp;s=cf80ef25a890145cf4be575240aba0a43a7c6740)\n\n$DKNG is both a stock and option play. I am eyeing a $28-$30 entry to incorporate the stock into my portfolio, and purchase options.\n\nPersonal Experience: A buddy of mine ran an (illegal) sports book in college, and netted 6 figures over the course of four years. Tons of potential tax dollars on the line.\n\nWith this information, I propose:\n\n**Short Term Play \\[HIGH RISK\\]:**\n\n*DKNG $40 Aug 21 2020, trading at $3.50 at time of writing. 36.5% Probability ITM. Earnings Aug 13 2020.****\\*\\*21,690 open interest in this position, which would control 2.2 MILLION Shares\\*\\****\n\n**Long Term Play:**\n\n*DKNG $45c Jan 15 2021, trading $6.70 at time of writing. 28% Probability ITM*\n\n**3) Boeing, Co $BA \\[Aerospace &amp; Defense\\] - BULLISH**\n\nBoeing is the cornerstone of millions of stock portfolios. I remember hawking the stock price while on vacation in Paris, when the plane crashed in March '19. My ex was pissed. I was more pissed for not picking up some stock and options when it bottomed around $100 a few months ago.\n\nBullish Boeing case:\n\nBoeing has a large backlog that covers several years of production for the most popular aircraft, which gives us confidence in aggregate demand for aerospace products.\n\nBoeing is well-positioned to benefit from emerging market growth in revenue passenger kilometers and a robust developed market replacement cycle over the next two decades.\n\nWe expect that commercial airframe manufacturing will remain a duopoly over the foreseeable future. We think customers will not have many options other than continuing to rely on incumbent aircraft suppliers.\n\n[$BA profile, from FindMarketPlays early access platform](https://preview.redd.it/oe0qsf4soac51.png?width=3258&amp;format=png&amp;auto=webp&amp;s=fa0f3019289509157ecede2726fd3562dda5382b)\n\nCOVID-19 has been a blessing in disguise for $BA. COVID-19 gifted $BA time, the most important thing they needed to fix their issues. Airlines are not flying, so it is excusable for $BA to have cancelled orders. Finally, as long as the oil-based dollar is the global currency, $BA will be in business selling weapons.\n\n[$BA overlaid with $RTX, another major defense contractor.](https://preview.redd.it/hpbo50nsoac51.png?width=1082&amp;format=png&amp;auto=webp&amp;s=d2a21add244eab0e1d8f3bd0a947871f12eaeb0c)\n\nDespite the airline issues, $BA is tracking $RTX, because defense is where the big money is.\n\nLet's take a look at the unusual options activity scanner:\n\n[$1.3 Million in $195 Sept 18 Calls](https://preview.redd.it/lg1zc44toac51.png?width=2142&amp;format=png&amp;auto=webp&amp;s=92db195a91788d3092bba1429104f3c47fdce062)\n\n[$800K in $180 Aug 21 Calls](https://preview.redd.it/r720lxetoac51.png?width=2170&amp;format=png&amp;auto=webp&amp;s=d592683fd8921411e95e8798d4f2604313b50b76)\n\nEarnings is July 29th, but this is not an earnings play. The stock is consolidating in the $170-$180 range, a huge support and resistance in 2020. I am eyeing a $165-$170 entry to incorporate the stock into my portfolio, and purchase options.\n\nWith this information, I propose:\n\n**Short Term Play \\[HIGH RISK\\]:**\n\n*BA $200c Oct 16 2020, trading at $14.01 at time of writing. 31% Probability ITM.*\n\n**Long Term Play:**\n\n*BA $240c Jun 18 2021, trading $18.75 at time of writing. 20% Probability ITM*\n\n**Conclusion**\n\nBased on my research, $SQ stands to gain from $TWTR news, $DKNG is poised to dominate online gambling, $BA is slowly recovering, and will not fail.\n\n**TL,DR:**\n\n**Short Term Play \\[HIGH RISK\\]:**\n\n*SQ $130c Aug 7 2020, trading at $6.57 at time of writing. 41% Probability ITM. Earnings Aug 05 2020.*\n\n*DKNG $40 Aug 21 2020, trading at $3.50 at time of writing. 36.5% Probability ITM. Earnings Aug 13 2020.****\\*\\*21,690 open interest in this position, which would control 2.2 MILLION Shares\\*\\****\n\n*BA $200c Oct 16 2020, trading at $14.01 at time of writing. 31% Probability ITM.*\n\n**Long Term Play:**\n\n*SQ $160c Jan 15 2021, trading $11.03 at time of writing. 23% Probability ITM*\n\n*DKNG $45c Jan 15 2021, trading $6.70 at time of writing. 28% Probability ITM*\n\n*BA $240c Jun 18 2021, trading $18.75 at time of writing. 20% Probability ITM*\n\n***Final Note:***\n\nI will include the stock with the most mentions on this thread in my next analysis post. Will try to get to all your questions this time. This reddit post is not investment advice - do thorough research before ever investing.\n\nPlatform used is FindMarketPlays. Check my profile for a Demo. Enter your email here to know when it launches: [https://docs.google.com/forms/d/e/1FAIpQLSeUTcj420FlNTpk4Ynozlbi3CuxhaIu6HJkyHLxAfZpFfG37w/viewform?usp=pp\\_url](https://docs.google.com/forms/d/e/1FAIpQLSeUTcj420FlNTpk4Ynozlbi3CuxhaIu6HJkyHLxAfZpFfG37w/viewform?usp=pp_url)",
        "subreddit": "options",
        "title": "$SQ $DKNG $BA Options Plays [07/21/2020]",
        "url": "https://www.reddit.com/r/options/comments/hvihb8/sq_dkng_ba_options_plays_07212020/",
        "created": 1595402985.0
    },
    {
        "author": "BobLoblaw_BirdLaw",
        "created_utc": 1595798472,
        "id": "hyf2ff",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "Microsoft pulled the turnaround of the decade by going from a sleepy tech giant into the next big innovator competing with everyone, including aws and Salesforce. \n\nWalmart seems to be in a similar boat. An old giant that has potential to wake up. And go from 2% growth annually into a larger online presence. \n\nThey have $500B in revenue yet valued at only $300B. Granted they’ve optimized a lot already for Margins. \n\nAny thoughts on what else they might do to reawaken? \n\nPersonal note, I was trying to buy gel from amazon but couldn’t find the price I wanted. Ended up buying at Walmart in 2 minutes as my first ever Walmart purchase. It’s as easy now.",
        "subreddit": "stocks",
        "title": "Walmart is going to do what Microsoft did and turn into a growth story. Thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/hyf2ff/walmart_is_going_to_do_what_microsoft_did_and/",
        "created": 1595827272.0
    },
    {
        "author": "joeskunk",
        "created_utc": 1595431809,
        "id": "hvvtgh",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "I recommend people read the full prospectus for that this company offers, how it fits into the market, and the growth opportunity they respresent. For those unfamiliar they are a pure play tele-sales company. Their product combines features of video conferencing, in-app sales, and crm. It is a small company - 34m market cap. For reference, ZOOM is 74B. (Not implying this is will grow to ZOOM size at all. My point - a very, very small company with a LOT of room to grow in an emerging market). They are also releasing a online learning product.\n\n[https://www.m2compliance.com/hosting/company/myverb/link\\_files/2020/07-15-2020/FormFWP(07-15-2020)Verb/FormFWP.pdf](https://www.m2compliance.com/hosting/company/myverb/link_files/2020/07-15-2020/FormFWP(07-15-2020)Verb/FormFWP.pdf)\n\nRather than provide a straight-forward rehash of there investor slides (again, please read) - I will focus on my own interpretation of how they fit an emerging market need based on my own observations. And secondary address the offering and common 'pump and dump' criticism that have seemingly spooked investors (and IMO caused solid DD on the company from being removed from this site).\n\n**The Emerging Market in Online Courses and Training**\n\nInstagram feeds are now filled with ads for free courses.\n\nVerbLive fits this emerging need exactly. I.e. webinars with build in purchasing capability and CRM. I do not know of a product that fits this use case as well.\n\nIn app-purchases have been THE trend for games and apps. This may be the start of it for online courses and training - of which there are many.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2ap0yaz4gfc51.png?width=680&amp;format=png&amp;auto=webp&amp;s=b4c5a9bab829243fa91ba0f7f901ddb279893e96\n\n**The Emerging Market in Non-Traditional Online Learning (VerbLearn)**\n\nLittle talked about is there upcoming product **VerbLearn**. I see this as being in demand for non-traditional learning programs. ESL, coding camps, countless online training courses, tutoring programs, after school programs. These do not have the same business models as colleges and primary schools, yet they need some kind of platform.\n\nhttps://preview.redd.it/c35v1dd4gfc51.png?width=768&amp;format=png&amp;auto=webp&amp;s=f911dc0866f0945ddda1bd5f73ec097c963d8491\n\n**Robustness of Company (Addressing the Pump and Dump Criticism)**\n\nThe [$VERB](https://twitter.com/search?q=%24VERB&amp;src=cashtag_click) offering occurred on 7/13. The document is clearly posted on their website along with other SEC filings: [https://www.m2compliance.com/hosting/company/myverb/link\\_files/2020/07-15-2020/FormFWP(07-15-2020)Verb/FormFWP.pdf](https://www.m2compliance.com/hosting/company/myverb/link_files/2020/07-15-2020/FormFWP(07-15-2020)Verb/FormFWP.pdf)\n\nThere is nothing surprising about the offering - they declared it would happen. This was laid out prior to today's earnings spike and there was not a lot of abnormal price action occurring at that point.\n\nA raise in and of itself is not an issue. It is a red flag when raising and issuing PR seems to be the companies entire 'business model'.\n\nThis is not the case here. User downloads up \\~300% from a year ago. Recurring Saas up \\~200%. They had a combined revenue of 2.6m the most recent quarter.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5i7s01fagfc51.png?width=936&amp;format=png&amp;auto=webp&amp;s=e1f2285d29223ef99bdc91fbad3fd8593325cebe\n\nhttps://www.m2compliance.com/hosting/company/myverb/link\\_files/2020/07-15-2020/Form8-K(07-15-2020)Verb/Form8-K.pdf\n\nWhere is the money going? This is a company expanding and building out a product. Check the staff associated with them on LinkedIn: [https://www.linkedin.com/search/results/people/?facetCurrentCompany=%5B5223384%5D](https://www.linkedin.com/search/results/people/?facetCurrentCompany=%5B5223384%5D) . 76 employees - a mix of developers, sales force, and management. This is no shell of a company\n\nLikewise, it is not operating out of some PO box or strip mall as is a pattern with a lot of these vaporware companies. There offices. In Newport Beach, CA 92663.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/any43xe3gfc51.png?width=680&amp;format=png&amp;auto=webp&amp;s=4b0594eedcde311c62c7f43735dd61ca38dbcbbc\n\n**Bottom Line: This Remains a Relatively Undiscovered CRM Pureplay**\n\nCompare IDEX (first chart) with VERB (second chart). With IDEX the number of Robinhood users was driven to 120K as this was promoted prior to crashing.\n\nNow VERB (second chart) - where it appears a mere 3K Robinhood users invested based on the price action associated with an earning report with solid revenue growth. That's your massive 'pump and dump' 3K choosing to invest based on earnings and buzz around that.\n\nhttps://preview.redd.it/m16av8ozffc51.png?width=703&amp;format=png&amp;auto=webp&amp;s=0adb8c8b4ab2dfd348412507b92967f226305f7e\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7kvk03v0gfc51.png?width=670&amp;format=png&amp;auto=webp&amp;s=1edc1615b8f3e0b6395eb6766d329da28af0fbe8",
        "subreddit": "pennystocks",
        "title": "VERB - DD Megathread",
        "url": "https://www.reddit.com/r/pennystocks/comments/hvvtgh/verb_dd_megathread/",
        "created": 1595460609.0
    },
    {
        "author": "MaxandmillionB89",
        "created_utc": 1594396981,
        "id": "horkyd",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "The company has been around since 2011 to provide operating software to banks. Impressive list of clients (TD Bank, Regions, SunTrust, plus hundreds more), venture partners (Salesforce, T Rowe, Insight). If I am not mistaken, they should IPO next week. Any thoughts?",
        "subreddit": "stocks",
        "title": "nCino IPO",
        "url": "https://www.reddit.com/r/stocks/comments/horkyd/ncino_ipo/",
        "created": 1594425781.0
    },
    {
        "author": "aaploptionspl",
        "created_utc": 1593702852,
        "id": "hjytla",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I'm going to start with the TL:DR because most of you are on the spectrum. My wife said she'd leave her boyfriend if I showed her 300K in the bank. A month ago I got close and I told her I just had one more play left and she could kiss Daryl goodbye for good.\n\nWell, because I'm one of you I damn near yolo'd Linda's get home fund away. My phone is low on minutes but we talked last night and she said she's giving me until the end of July to get my shit together, otherwise Daryl's van is full of gas and she says they are going away for good. I can't stand the thought of having to raise our cool cats and kittens alone.\n\n\n[LOSS: The last 30 days I've been looking for a good deal on $ROPE\n](https://i.imgur.com/C8YXbFp.png)\n\nI've actually had a good year and was really looking forward to Linda moving back in and us rekindling our love. **Big wins** have been HAL 1/15/21 12.5C, HAL 1/15/21 15C, ALK 1/15/21 50C, DIS 10/16/20 110C, OAS 1/15/21 1C. Others trades were TSLA, BA, MRO, TAP, RCL, PCG, CRM, MGM, LUV, TPC, MRNA, BUD, XOM, PAGP, PAA, MPLX (sorta tanker gang), F. **Biggest realized losers** have been BLMN, DIS, RH and CVNA.\n\n[Proof. Linda, please come home. I'll do better](https://i.imgur.com/8tKgCGC.png)\n\n    PCG 1/15/21 13C -20K\n    PCG 1/15/21 15C -19K\n    PCG 1/15/21 10C -3K\n    (Also hold USFD, MRO, XOM, HAL, MGM, BUD)\n\n[Proof of current holdings](https://i.imgur.com/FflSkHQ.png)\n\n\n***So - here comes my plea***. And I legit will donate $1 from every $100 earned from suggestions on this post to https://www.autismspeaks.org/. If we can get Linda back, not only will I be a happy man I'll be donating $1000 to further the study of WSB members.\n\nWhat are your 30 day YOLOs to help be bounce from $200k to $300k? I'm only interested in options, selling puts, and other cool shit. GTFO with your stocks. Prefer large caps to penny stocks. Convince me to 💎🙌  hold on to my PCG plays.\n\nPlease post your plays below. I'll do my own DD and will tag you if/when I enter or exit a trade. Donations to https://www.autismspeaks.org/ at the end of July.\n\nTL:DR I should have inversed myself and instead I zagged when I should have zigged. Things were looking good but god damn I belong here and instead of holding on to my winnings I doubled down and quadrupled down on PCG as it was falling.",
        "subreddit": "wallstreetbets",
        "title": "Need help - YOLO back to my all time high a month ago after a devastating trade, keep my wife",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/hjytla/need_help_yolo_back_to_my_all_time_high_a_month/",
        "created": 1593731652.0
    },
    {
        "author": "Nhruch",
        "created_utc": 1596207494,
        "id": "i18xfh",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "These guys are on a tear lately and I'm speculating it will continue to rise past earnings. Online services and data processing is a big industry right now and what better way to gauge customer interactions than to take a look at their website's Alexa scores.\n\nTake a look: https://www.alexa.com/siteinfo/five9.com\n\nAfter winning a contract with AT&amp;T, and large customers such as Expedia, Cisco and Salesforce, Five9 has grown its online Alexa ranking from #14365 to #8586 over the last 90 days. It's time spent on their website has grown 84% and pages viewed has increased 42%. These guys are doing great business over the last few months and I believe their earnings will reflect that.\n\nTheir competitor, RingCentral is valued at $25B while Five9 is at $7.5B so their is plenty of room to run in this market.\n\nAdditional DD can be found on this Seeking Alpha article: https://seeking alpha.com/article/4351542-five9-strong-focus-comes-premium\n\nOnly here to provide the supplemental online statistics.\n\nI'm in for 25 Aug 21 $120 calls. I'll be willing to share the proof if someone can enlighten me on how to add images to this post.",
        "subreddit": "wallstreetbets",
        "title": "FIVN Monday Earnings - Expecting a Beat",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i18xfh/fivn_monday_earnings_expecting_a_beat/",
        "created": 1596236294.0
    },
    {
        "author": "parktart",
        "created_utc": 1594406205,
        "id": "houg27",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "  These dates are courtesy of Robinhood so if they are wrong you can thank your favorite broker \n\n\\---------------------------------------\n\nTuesday, July 14th: pre-market  \nDAL  \nWFC  \nJPM  \nC\n\nWednesday, July 15th: pre-market  \nGS\n\nThursday, July 16th: pre-market  \nDPZ  \nTFC  \nBAC  \nMS\n\nThursday, July 16th: after hours  \nNFLX\n\nFriday, July 17th: pre-market  \nALLY\n\n\\---------------------------------------\n\nMonday, July 20th: pre-market  \nHAL\n\nMonday, July 20th: after-hours  \nACC\n\nTuesday, July 21st: pre-market  \nCMA\n\nTuesday, July 21st: after-hours  \nSNAP  \nCOF\n\nWednesday, July 22nd: pre-market  \nWIX\n\nWednesday, July 22nd: after-hours  \nMSFT  \nTSLA  \nCMG  \nDFS  \nSAVE\n\nThursday, July 23rd: pre-market  \nAAL  \nTWTR  \nDOW\n\nThursday, July 23rd: after-hours  \nAMZN  \nBYND  \nSBUX\n\nFriday, July 24th: pre-market  \nAXP\n\n\\---------------------------------------\n\nTuesday, July 28th: pre-market  \nMA\n\nTuesday, July 28th: after-hours  \nEBAY  \nV\n\nWednesday, July 29th: pre-market  \nSHOP  \nBA\n\nWednesday, July 29th: after-hours  \nPYPL  \nFB  \nTDOC\n\nThursday, July 30th: after-hours  \nETSY  \nAAPL  \nPINS  \nRDFN  \nGOOG\n\nFriday, July 31st: pre-market  \nPSX\n\n\\---------------------------------------\n\nMonday, August 3rd: after-hours  \nNLS\n\nTuesday, August 4th: after-hours  \nDIS  \nPLNT\n\nWednesday, August 5th: pre-market  \nFVRR  \nW\n\nWednesday, August 5th: after-hours  \nFSLY  \nZNGA  \nROKU  \nSQ\n\nThursday, August 6th:  \nPLUG\n\nThursday, August 6th: pre-market  \nNCLH  \nHLT\n\nThursday, August 6th: after-hours  \nOSTK  \nNET  \nDDOG  \nZ  \nERI  \nUBER\n\n\\---------------------------------------\n\nThursday, August 13th: pre-market  \nBABA  \nJD  \nBAM\n\nThursday, August 13th: after-hours  \nNVDA\n\nFriday, August 14th: pre-market  \nDKNG\n\n\\---------------------------------------\n\nTuesday August 18th: pre-market  \nSE  \nWMT\n\nWednesday August 19th: pre-market  \nPDD  \nBZUN\n\nThursday August 20th: after-hours  \nCRM\n\n\\---------------------------------------\n\nWednesday August 26th: after-hours  \nOKTA\n\nThursday August 27th: after-hours  \nMRVL\n\n\\---------------------------------------\n\nThursday September 3rd: pre-market  \nLVGO\n\nThursday September 3rd: after-hours  \nDOCU  \nCRWD\n\n\\-------------------------------------------------------\n\nIn a Kangaroo market like this I find myself looking to SPY for entry points on calls/puts and try not to go against the grain..\n\nThe technical picture suggesting a move to SPY 315 and a break above that would send SPY to 327.50  \n\\*But from there, the index could pull back to a low of around 300  \n\\*A break below 296.50 opens for significant downside  \nand we would expect to see 273 within a few trading sessions\n\nJPOW also said he sees a three stage economic path..  \nstage 1 - the shutdown with sharp drop in activity - ends in June  \nstage 2 - the bounceback with sharp increase in MoM economic data - ends in July  \nstage 3 - we find that the economy is \"well short\" of pre-pandemic levels and go 'oh shit'\n\n\\*PPP funds running out in June for business that secured loans in April.. (PPP deadline extended to Aug 8th)  \n\\*Federal bans on evictions in federally assisted properties ends July 25  \n\\*Federal unemployment extra $600 ends July 31st\n\n\\*The markets will be prepping next month for the first release of 2nd quarter GDP which has been   \nprojected to drop anywhere from 30% to 50%  \nprior trends..  \nQ2 2019: +2.0%  \nQ3 2019: +2.1%  \nQ4 2019: +2.1%  \nQ1 2020: -5.0%\n\n\\*The HEROES Act, if passed by the senate, could include..  \nsecond round of stimulus checks  \nextension of the $600 increase in unemployment\n\nWhat to expect as banks report earnings:  \n\\-expect another big hit to earnings as they set aside more money to cover loan losses  \n\\-a boost in fee income from elevated trading activity  \n\\-Banks not allowed to raise dividends or perform share buy-backs through Q3 2020  \n\\*Wells Fargo &amp; Co. WFC appears at greatest risk for a dividend cut among the “big six” U.S. banks\n\n\\*analysis of the government data found that just over 554,000 small businesses who got PPP funds   \nreported retaining zero jobs - raising concerns about how many will be eligible for forgiveness in the future\n\n\\*Consumer borrowing fell dropped BIGLY in April, less in May, and even less in June.. But use of consumer credit is down YoY for each month of Q2  \n\\*Revolving credit, like credit cards, declined at a nearly 29% clip in May. In April, revolving credit shrank by a record 65% as people paid down debt.  \n\\*For companies that rely on transaction volume and late fees for revenue generation.. this will hurt Q2 earnings (MA, V, etc.)\n\n\\*Yet nonrevolving credit, typically auto and student loans, actually rose 2.3%. Auto sales rebounded   \nduring the month (ALLY CVNA)\n\n\\*As Bloomberg cautions, the pace of recent Chinese gains matches the market’s melt-up that started in the final weeks of 2014.. before a huge crash in SHCOMP.. \n\n\\*Global restaurant traffic data via OpenTable shows little improvement in late June  \nOpenTable recently warned that 25% of all U.S. restaurants would never reopen\n\nEnergy: A Deloitte analysis has found that almost a third of U.S. shale producers are technically insolvent with crude at $35 a barrel.  \nAnalysts predict 250 oil/gas/shale may go bankrupt with companies now filing for bankruptcy at the fastest pace since 2009\n\n(COF) Capital One said nearly three-quarters of its $6.24 billion exposure to the oil and gas industry   \nlies with companies responsible for exploration and production.\n\n(BAM) Broofield Asset Management tenants will go bankrupt.. but BAM has requested forbearance  \non the loans BAM owes for 12-months..\n\n\\-------\n\n\\*of course, any news on PPP-extension, more unemployment checks, or a vaccine could always cause a rally\n\n\\*\\*\\*If you must buy puts, buy them on IWM, not SPY.. FANG will have retard strength as long as printer go brrrr.. and JPOW buys AAPL bonds..",
        "subreddit": "wallstreetbets",
        "title": "Q2 Earnings Dates for a Kangaroo Market",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/houg27/q2_earnings_dates_for_a_kangaroo_market/",
        "created": 1594435005.0
    },
    {
        "author": "samofny",
        "created_utc": 1595118357,
        "id": "htrc03",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "This stock spiked on Friday on no news, so I think the July publication may be coming soon.\n\nFrom June 2020 corporate presentation:  [http://ir.acelrx.com/static-files/d07bc531-c1fc-4dbe-b24a-0d4e0638aa95](http://ir.acelrx.com/static-files/d07bc531-c1fc-4dbe-b24a-0d4e0638aa95) \n\n▪ DSUVIA commercial launch with full 40 rep salesforce beginning in Q3 2019 and now at 35 with Tetraphase co-promote\n\n▪ US Army Milestone C approval in April 2020 for all SKO’s; expecting initial stocking orders of $30M over three years and joint deployment formulary expected in late Q2/early Q3 \n\n▪ **Expected July publications of new data supporting substantial reductions in PACU opioid use and a significant decrease in PACU time when dosing DSUVIA** \n\n▪ Active business development: (a) term sheet discussions for collaboration in oral/dental surgery, (b) final agreement discussions for a new in-licensed product and (c) out-licensing DZUVEO \n\n▪ Zalviso FDA resubmission timing awaiting new FDA opioid approval policy finalization \n\n▪ 74 issued patents (24 in US); 16 Orange Book listed patents expiring from 2027 to 2031 \n\n▪ $52.7 million of cash at March 31, 2020",
        "subreddit": "pennystocks",
        "title": "AcelRx ($ACRX) expected July publication of new data about DSUVIA, more",
        "url": "https://www.reddit.com/r/pennystocks/comments/htrc03/acelrx_acrx_expected_july_publication_of_new_data/",
        "created": 1595147157.0
    },
    {
        "author": "PandemicInvestor",
        "created_utc": 1596185175,
        "id": "i144r4",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "There was hype around this stock a week or so ago and I believe it has now reached the bottom after a couple red market days. I currently hold a decent amount of shares in this but I have a good reason to.\n\n&amp;#x200B;\n\n1. VERB is in the work from home, online education and CRM/ERP space with VERB live (their newest), VERB learn and VERB CRM. These are all industries that benefit from covid-19 and I believe they will be even more relevant as we enter August.\n2. Recently integrated Salesforce into their system to maximize market penetration. At a time when their clients (CRM/ERP clients) need to innovate and change the way they operate, this solution compliments a lot of their existing customers and will attract a lot more partners as they open up Salesforce integration.\n3. VERB is currently below the offering price of 1.10. Its price history has always consistently hovered around the mid $1.30-$1.40s with no news. It hit $2.64 a few weeks ago and only came down because of the offering. \n4. VERB stated in their previous pr with preliminary results that they are expecting record revenue/profits. This is great and i'm confident this will continue to grow.\n5. VERB's venture into the japan market (multi-billion dollar market) for their VERB products recently and I am assuming there will be Japan/US PR soon.\n6. VERB's management is strong with their linkedin employees. Their employees have strong backgrounds in tech from multiple different companies. On the board, they have Nancy Heinen who was a previous Senior VP at Apple.\n7. Company offerings: In 2020, VERB has only done ONE offering. The company doesn't seem to need to do these that often and the one time they do it, I am without a doubt sure they're using the money to grow. \n8. VERB was included in the Russell Microcap Index as recently as 3 weeks ago. Companies that make it onto this index are considered to have great objectives, market-capitalization rankings and style attributes.\n9. As recently as yesterday, VERB had addressed in an 8k form that they have submitted a plan to NASDAQ in order to maintain compliance and stated that the plan is fully resolved and satisfactory for NASDAQ. Expect big things with their plan and vision.\n10. Analyst articles the past few days expecting a rise in VERB's share price. \n\n&amp;#x200B;\n\nI really believe in this company with their strong management, stock history (press releases, price, company vision, innovation). This year they're working extremely hard, appointing former Apple SVP, japan market, a brand new platform for VERB in online education, CRM/ERP and VERB live (comparable or in some cases have better use cases than zoom). \n\n&amp;#x200B;\n\nI truly believe that you will make money with this stock because it has hit rock bottom (and it definitely shouldn't be here) after a combination of red markets, offering momentum, etc. I know that the catalysts are coming soon with japan/new client prs, earnings which is expected to post record revenues/profits as per the CEO's statements in the preliminary earnings. Whether you decide to stick around for $1.50s-$1.70s-$2.00s-$2.50+, I think you will be very relatively safe with this investment. I am holding about 16500 shares as of this post because of my confidence in the company. I'm just here to share my knowledge, so I hope everyone does well and makes a decent amount of profit if you decide to join in. Feel free to chime in on anything you think I may have missed.",
        "subreddit": "pennystocks",
        "title": "VERB- The Reversal DD",
        "url": "https://www.reddit.com/r/pennystocks/comments/i144r4/verb_the_reversal_dd/",
        "created": 1596213975.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1595508354,
        "id": "hwf0ce",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "stocks",
        "title": "There’s growing evidence that Microsoft will overtake Salesforce in its core business within three years",
        "url": "https://www.reddit.com/r/stocks/comments/hwf0ce/theres_growing_evidence_that_microsoft_will/",
        "created": 1595537154.0
    },
    {
        "author": "DecoyThylacine",
        "created_utc": 1595045941,
        "id": "htaihv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm British and have just recently started investing.  I've only put in a small amount of money while I'm learning.  After doing some reading I feel the portfolio is maybe too diversified, especially with a world index already as the majority stock (I may adjust the percentage of this going forward).  It's admittedly a little tech heavy (I felt they were generally reliable picks) so opinions on that please, and let me know which stocks you'd drop in general if you like.  Anyway, have a look please and critique this for me.\n\n(VWRL) Vanguard FTSE All-World\n(VGOV) Vanguard UK Gilt \n\nApple\nAmazon\nGoogle\nMicrosoft\nSea Ltd.\nNvidia\nActivision Blizzard\nSalesforce\nShopify\nGames Workshop Group\nJP Morgan\nDanaher\nThermo Fisher\nLivongo\nRoyal Dutch Shell\nRepublic Services Inc.\nASML Holding\nTSMC\nL'Oréal\nOcado Group\nTesla\nReliance Industries Limited (don't own yet)\n\nThey aren't in order of %.  \nAny advice would be appreciated.  Thanks.",
        "subreddit": "investing",
        "title": "Rate My Portfolio - new investor",
        "url": "https://www.reddit.com/r/investing/comments/htaihv/rate_my_portfolio_new_investor/",
        "created": 1595074741.0
    },
    {
        "author": "HeavyG_93",
        "created_utc": 1593658951,
        "id": "hjp4kz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I’m 27 years old and managing a portfolio of 3 accounts worth roughly 30k total. My investment horizon is retirement by 55 at the latest. But my goal is to FIRE as soon as plausible, because I fucking hate being an employee. \n\n\n\nI have a Roth, and 2 brokerages. \n\nI have a RH account that I primarily utilize for investing in high priced growth stocks because of their great fractional shares options. Here I hold things like my Amazon, Spotify, Tesla, etc\n\nMy second Brokerage is with TD and it’s where I hold my Microsoft and Costco. 50/50 split between the two basically. I have no problem holding large positions in either company as I think they’re about as safe as it gets when it comes to equities. \n\nWhat I’m really struggling with is my Roth IRA strategy. Currently I’m thinking about using the Tax advantaged status to grow a passive income portfolio focused around dividend stocks with growth upside, DRIP’ing until I’m 59.5 years old. Here is where I hold my JNJ, MCD, WM, DIS, RTX, UNP, O, NXRT etc. \n\n\n\n\nI’m torn between chasing growth in my Roth too. Shopify salesforce twilio and AMD etc in a Tax advantaged account where I could freely take profits with no taxable events sounds nice too. \n\n\nWhat do y’all think, what would you guys do?",
        "subreddit": "investing",
        "title": "Struggling to decide between investment strategies for my Portfolio of Investment accounts",
        "url": "https://www.reddit.com/r/investing/comments/hjp4kz/struggling_to_decide_between_investment/",
        "created": 1593687751.0
    },
    {
        "author": "kanch08",
        "created_utc": 1596229494,
        "id": "i1fkha",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Zimmer Biomet Latest Alliance Points to Growing Importance of NeuroSurgery**Debbie S. Wang**Senior Equity Analyst\n\nWe were surprised by Zimmer Biomet’s announcement of its new exclusive development and distribution agreement with development-stage NeuroOne Medical but are holding steady on our fair value estimate as we expect the Evo cortical electrode will be an ancillary product to be sold in conjunction with Zimmer Biomet’s Rosa robot for brain surgery, which remains in the very early stages of commercialization. We remain confident in the firm’s wide economic moat, which is primarily driven by the high switching costs that characterize its main orthopedic business. However, if we see greater practitioner interest in this neurosurgical application of Rosa, we would consider turning Zimmer Biomet’s moat trend positive on the basis of spreading switching costs and intangible assets into a new specialty area.\n\nWe think this announcement is noteworthy because it suggests Zimmer Biomet is actively seeking to enter the neurosurgery arena, in a departure from its historical focus on orthopedics. While we’ve viewed this as a possibility, ever since the firm acquired the Rosa robot technology (Rosa was originally developed for brain and spine surgery use), it was clear that Zimmer Biomet’s first priority was to adapt and commercialize this technology for knee and hip replacement use. As the firm moves ahead with Rosa for the brain, we think this underscores CEO Bryan Hanson’s more expansive view and vision for Zimmer Biomet as a medical technology company.\n\nAlthough it can be nerve-wracking to move into a new therapeutic area, we think this move makes strategic sense for Zimmer Biomet. Thanks to healthcare reform, it has become more challenging to obtain pricing premiums for new technology without strong clinical data as support. It is significantly easier to gather that kind of data in neurosurgery and neurovascular procedures than in orthopedics. This dynamic also opens up the opportunity for investment in more revolutionary technologies, such as Rosa and Evo.\n\n**Business Strategy and Outlook** | by Debbie S. Wang Updated Jan 02, 2020\n\nZimmer, the leader in hip and knee reconstruction, enjoys the fruits of a wide economic moat. With the addition of smaller competitor Biomet, Zimmer is the undisputed king of large joint reconstruction, by far. We expect favorable demographics, which include aging baby boomers and rising obesity, to fuel solid demand for large-joint replacement that should offset price declines. However, Zimmer has been plagued with pitfalls since late 2016, including integration issues, supply and inventory challenges, and quality concerns that have caught the attention of the U.S. Food and Drug Administration. But new management has tackled these issues, and the firm is poised to ramp up its growth.\n\nZimmer has benefited from close relationships with orthopedic surgeons who make the brand choice. High switching costs and high-touch service keep the surgeons closely tied to their primary vendor, and the surgeons bring in enough profitable procedures to keep hospital administrators at bay. This close relationship and vendor loyalty also explain why market share shifts in orthopedic implants are glacial, at best. As long as Zimmer can launch comparable technology within a few years of its rivals, it can remain in a strong competitive position. Nevertheless, we think surgeon influence will inevitably erode, as the practice of medicine changes in response to healthcare reform. Over the long term, it will be more difficult for surgeons to run private practices profitably, and more of them will be open to employment at hospitals.\n\nWe think the growing emphasis by payers and hospitals on comparative effectiveness and cost-effectiveness will make conditions tougher for Zimmer and its rivals. By its nature, orthopedic innovation tends to be evolutionary rather than revolutionary. It is also less common for orthopedic innovation to tap into untreated patient pools with unmet needs, which is a strategy cardiac device makers have pursued successfully. The difficulty and ethical issues surrounding randomized controlled trials for orthopedics also weakens Zimmer's position when pressing for premium pricing. We think achieving meaningful innovation in orthopedic implants will be challenging.\n\n**Economic Moat** | by Debbie S. Wang Updated Jan 02, 2020\n\nZimmer's wide economic moat stems from two major sources. First, there are substantial switching costs for orthopedic surgeons. The extensive instrumentation, or tool sets, used to prepare bones and install implants are specific to each company. The learning curve to become proficient in using one company's instrumentation is significant. Additionally, relative to other specialists, orthopedic surgeon skill and experience play an outsize role in the clinical outcome for the patient. These issues all leave surgeons reluctant to train and master multiple instrumentation systems, especially if procedure volume is too low to maintain high surgical facility with more than one system. Surgeons' preferences for certain vendors can stretch back to their days in residency training. Research has found surgeons stick with their preferred vendor and sales rep for 5-15 years and use that vendor for approximately 95% of their orthopedic procedures during that time. Switching to another instrumentation system would require taking time out for training, developing a relationship with new sales rep, and working less efficiently during the early period of mastering another vendor's tools, possibly raising risks for the patient and reducing the number of procedures (and income for the surgeon). This dynamic explains why market share among the four top orthopedic implant makers has remained remarkably steady.\n\nZimmer's moat also involves intangible assets, including intellectual property that protects the product portfolio, which is characterized by evolutionary changes to technology, because new generations of products rely on intellectual property established by earlier iterations of those devices. Following changes to patent law introduced in 2012, the U.S. has switched to a first-inventor-to-file system, which had previously been a first-to-invent system. We think this change favors the moats of the larger orthopedic players like Zimmer. The new system encourages inventors to file an application as soon as possible. Inventors will also need to provide more detailed applications in order to head off competitors that may block improvement patents in future generations of products. The new law also mandates an opposition review after the patent has been granted. This will result in more challenges to patents. We think firms like Zimmer, which can support an extensive legal team, will be in a better position to take advantage of the new law by filing comprehensive patent applications on an accelerated timeline and mounting complex and time-consuming challenges to patents granted to competitors.\n\nWe think another intangible asset is the relationship between sales rep and surgeon. More so than with any other medical device or equipment, orthopedic sales reps play a critical role for the surgeons. The sales rep is present for every procedure, teaches the surgeon how to use each tool in the kit, and prepares selection of instrumentation in all the right sizes and sequence for the procedure according to individual surgeon preference. For most orthopedic surgeons, who may perform 20-40 hip replacements and 50-70 knee replacements in a year, the sales rep provides a valuable service. For the small group of high-volume surgeons, who may be performing multiple knee replacements in a day, there is less need for any training by the sales rep and the surgeon may wish to hire a nurse who can handle the procedure preparation.\n\n**Fair Value and Profit Drivers** | by Debbie S. Wang Updated Apr 07, 2020\n\nWe're moderately lowering our fair value estimate to $164 per share, down from $178, after incorporating an estimated 25% volume reduction in knees and hips for 2020, driven by the COVID-19 pandemic. We further project that recessionary conditions will follow into 2021, which translates into a gradual recovery from 2021 through 2023. During this downturn, we assume Zimmer Biomet's margins fall in the near term, as volume falls off and the firm attempts to keep its engineers and salesforce intact. We estimate operating margin should bottom out at 16% in 2020, before returning to the low-20s in 2021-22.\n\nNonetheless, we continue to stand by our more optimistic projections for longer-term growth now that Zimmer Biomet's turnaround efforts have begun to take hold. Despite all the recent turbulence related to regulatory issues, inventory mismanagement, management change, and now a pandemic, we think Zimmer Biomet's wide economic moat remains intact, its sources of moat haven't changed materially, and the underlying dynamics in the orthopedic market remain, on balance, favorable for manufacturers. We now project knee and hip volume to fall 25% in 2020, followed by three consecutive years of double-digit growth, while price erosion hovers around 2% annually. This translates into total revenue declining 19% in 2020, followed by 10% and 9% top-line growth in 2021 and 2022, respectively, before returning to longer-term normalized growth in the low to midsingle digits.\n\nWe assume Zimmer's cost of equity is 9%. This is equivalent to the 9% rate of return we expect investors to demand of a diversified equity portfolio, reflecting Zimmer's largely average sensitivity to the economic cycle and relatively lower financial leverage.\n\n**Risk and Uncertainty** | by Debbie S. Wang Updated Jan 02, 2020\n\nBased on the average volatility of cash flows from its extensive orthopedic product portfolio, we rate Zimmer Biomet's uncertainty as medium.\n\nThe most immediate near-term risk is the degree to which hospitalizations of COVID-19 patients crowd out elective procedures, such as hip and knee replacements. Associated with this is the risk that some of these patients awaiting joint replacement, many of them elderly, end up dying (of other causes than COVID-19) during that postponement period, as well as the very real possibility that some orthopedic surgeons and their nurses will, themselves, succumb to COVID-19.\n\nWe think surgeon reception of the Rosa robot is another near-term risk. If practitioners do not embrace Zimmer Biomet's robot and its array of features (which are different from those of Stryker's Mako robot), this will hinder the firm's ability to catch up with Stryker's installed base of robots and product pull-through of higher-margin cementless knees.\n\nThe greatest longer-term strategic risk for Zimmer is if the management team does not come to grips with the changing orthopedic environment. Although the change is unfolding slowly, the writing is on the wall: Bundled payments, surgeons joining hospitals as employees, and further transparency in pricing are coming down the pike. If management does not formulate a new model for its orthopedic products, Zimmer could be left in the dust. In the meantime, the firm is vulnerable to product recalls and related legal fees and inventory write-offs. With the regulatory and payer push for device registries, the orthopedic companies may be subject to more frequent discoveries of product failures and subsequent recalls.\n\n**Stewardship** | by Debbie S. Wang Updated Apr 07, 2020\n\nZimmer's stewardship is Standard, and primarily reflects former CEO David Dvorak's tenure at the helm. While Bryan Hanson has stepped into the CEO role, it remains early to assess any changes to the firm's plans for capital allocation. Nonetheless, we are fans of Hanson's previous performance at Covidien and Medtronic. Although he hasn't delved into the orthopedic market in the past, he has a deep understanding of the competitive dynamics in medical technology, a good handle on hospital clients, and the leadership skills to rally the employee base, which has struggled culturally as the two legacy companies have come together. Thus far, we've been pleased with Hanson's priorities and systematic approach to addressing the myriad issues hindering Zimmer Biomet. While results haven't yet fully manifested themselves in financial performance, we're optimistic that evidence of improvements should flow over the next 12-24 months.\n\nUnder Dvorak's leadership, Zimmer Biomet was committed to acquiring technology and had executed a number of tuck-in purchases. The substantially larger purchase of Biomet was more of an isolated event, and we don't expect that scale of acquisition on a regular basis. The firm has taken significant goodwill write-downs associated primarily with the Biomet purchase over the last couple of years. However, this isn't something commonly seen at Zimmer Biomet over its longer history.\n\nWe have seen some hints of management's strategic vision to partner more closely with orthopedic surgeons through its internal innovation and small acquisitions of technology that help practitioners address a wider span of potential treatments for orthopedic patients. Hanson has suggested that while the firm will keep its eye on potential tuck-in purchases, there are plenty of opportunities to innovate internally as well. With Hanson at the helm, we think its likely that Zimmer Biomet--which has generally stuck to its knitting and focused on developing its large-joint replacement franchise--will expand its horizons a bit and set its sights on other niches within orthopedics that offer more potential for innovation and growth. This would put the firm on stronger footing, than it was in the past, to take advantage of the faster growth in trauma and extremities (where it was beaten by Johnson &amp; Johnson and Stryker in the past).",
        "subreddit": "investing",
        "title": "I am long on ZBH..Zimmer Biomet. Want to share Morningstar report here. Any opinions appreciated.",
        "url": "https://www.reddit.com/r/investing/comments/i1fkha/i_am_long_on_zbhzimmer_biomet_want_to_share/",
        "created": 1596258294.0
    },
    {
        "author": "BradCable",
        "created_utc": 1594848390,
        "id": "hrwhn5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "First option ever (AAL 10c 7/17) giving me the confidence to yolo the stacc next week on $CRM",
        "url": "https://i.redd.it/w3rildhk93b51.jpg",
        "created": 1594877190.0
    }
]