[
    {
        "author": "mikeymikela",
        "created_utc": 1586223724,
        "id": "fwbl7e",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "A childhood friend has recently decided he is an oracle who can predict daily market movements.\n\nSince I am a soon-to-be unemployed part-time-MBA-program-graduate I suggested we track his calls for thirty trading days to see if he has The Sight.\n\nThis man's bona fides:\n\nHas investements \"in a Roth or something\"\n\n* Dropped out of engineering school so maybe took calculus once twenty years ago\n* Now has a shot at being the best quant trader in the world thanks to this board\n\nRules:\n\n* He must prognosticate the next day's percent close before 3:55PM Eastern so that, hypothetically, the prediction can be used in a real-life trade.\n* All predictions will be within ± 1.0% of the actual outcome of the next day's market action except for Mondays which can be within ± 2.0%.\n* Market data will be derived from \\^GSPC Adj Close on Yahoo Finance using simple arithmetic returns\n* Outcomes and predictions will be posted to WSB daily (not necessarily during trading hours)\n\nBottom line/TLDR: The [Mystery Prognosticator](https://www.youtube.com/watch?v=L3-1VL_ZD-4) says the S&amp;P 500 will close **UP 3.5% ± 1.0%** tomorrow, Tuesday April 7, 2020.\n\nDisclosure: this shitpost does not contain financial advice and contains forward looking statements about stonk movement. Please consult with a licensed financial adviser for actual investment advice and stop looking at WSB for YOLO plays you fucking retard.",
        "subreddit": "wallstreetbets",
        "title": "30-day Call the Market Challenge: Day Zero",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fwbl7e/30day_call_the_market_challenge_day_zero/",
        "created": 1586252524.0
    },
    {
        "author": "djsmfnskcifk",
        "created_utc": 1587590920,
        "id": "g69ucl",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nHoping for the tech industry to soar, and perhaps of the entertainment industry in 3 years or so; could could you rate the port foil I created this week, offering me suggestions?  Thanks.  Currently of 8k buying power and opened a margin account, so I can't fuck this up (I decided to take the interest rate.. its (total owed \\* .08)/360 .. less than a dollar per day I think if I calculated it right.\n\n2 ORCLE (planning to purchase more)\n\n4 Akamai Technologies, Inc. - Common Stock\n\n15  Digital Turbine, Inc. - Common Stock (CV EM)\n\n3  Alibaba Group Holding Limited American Depositary Shares each representing eight\n\n4 Canopy Growth Corp5 CHGG2  PC Connection, Inc. - Common Stock\n\n4  Salesforce.com Inc Common Stock\n\n4  Carriage Services, Inc. Common Stock\n\n1 Docusign\n\n1 Alphabet (Google)\n\n8  ETFMG Prime Cyber Security ETF\n\n2 Intuit\n\n3  iShares U.S. Financial Services ETF\n\n8  Lakeland Industries, Inc. - Common Stock\n\n1 Microsoft Corp\n\n65 Novabay Pharm (oops)\n\n1  Invesco Dynamic Leisure and Entertainment ETF  (prob gonna sell.. i was too hopeful. I bought dirt cheap though)\n\n1 Paypal\n\n1 QQQ\n\n3 SAP\n\n3  Service Corporation International Common Stock\n\n5  Sprouts Farmers Market, Inc. - Common Stock\n\n1 Smartsheet\n\n5  Global X Social Media ETF\n\n3 in Square\n\n5 in a shitty REIT Im going to sell\n\n6 AT&amp;T\n\n1 TeleDoc\n\n35 in Upwork\n\n1 in Vanguard Russell 1000 Value ETF\n\n2 in WIX\n\n9 in Slack\n\nI plan to invest in buying more WIX, PayPal, SQ,, Chegg, Oracle, and Docusign\n\nI have a few ETFs outside of the tech sector, but I am rather confident the world will be changed for years to come.\n\nPlease offer additional stocks, considerations, where I should allocate, etc.  I am a week into investing.  I feel that a fully diversified folio, given the boom in tech, is acceptable.  Also, I am about as high of a risk taker as it gets.  Went from investing to gambling and I still have money\n\nEdit:  Future stocks I will plan to buy include: Samsung, Comcast,",
        "subreddit": "StockMarket",
        "title": "Noob Here.. Rate my probably terrible portfolio.",
        "url": "https://www.reddit.com/r/StockMarket/comments/g69ucl/noob_here_rate_my_probably_terrible_portfolio/",
        "created": 1587619720.0
    },
    {
        "author": "eljunbo809",
        "created_utc": 1587783883,
        "id": "g7mbl3",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "I own a tesla model 3 love it. I love tesla because I consider tesla the apple of cars. As much I hate to say it any person short selling this stock is an idiot. I have done crazy research on the company To the point that all I do is talk to my self about tesla. I am upset because As much as I hate the valuation of the stock when you dig deep into it Tesla this stock is fucking cheap. Tesla could report ugly number this upcoming quarter. but they got so much going on that the stock automatic will go up. ROADSTER, TESLA TRUCK, SOLAR, ROBO TAXI, SOFTWARE ETC...\nThe only negative I have seen about tesla so far is google trend is down and they have a lot of cars in stock for sale. Here is my thesis to keep it short and simple.\n\nTOYOTA+ORACLE+AMD+CUMMINS+= TESLA \n\nCall me crazy but is the truth \nTesla sell cars \nTesla build software\nTesla build chips\nTesla build trucks\n+ \nTesla robo taxi\nTesla ExonMobil  aka superchargers\nElon Musk love for tesla is like Donald trump love for stock market. \n\nI HATE TO SEE PEOPLE LOSE THERE HARD EARN MONEY. PLEASE STAY AWAY FROM TESLA SHORT SELLER.",
        "subreddit": "wallstreetbets",
        "title": "Tesla into earnings, the only trend I see is up.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g7mbl3/tesla_into_earnings_the_only_trend_i_see_is_up/",
        "created": 1587812683.0
    },
    {
        "author": "silicapacks",
        "created_utc": 1586400188,
        "id": "fxkc14",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Senator Kelly is going to be liquidating her positions tomorrow. Let's kick up the put volume and drag it down so they don't feel like they missed out on profits.\n\nMarket is closed, I have no positions. I'll be jumping in tmmw or Monday. Jump in at your own peril.\n\nThey're selling individual companies in their portfolio. Below are a few I've found. Looks like a few of them have done tremendously well throughout this bear market.\n\nORCL  \nCTXS  \nAMZN (very small position from what I understand)  \nDD  \nCME  \nCVX\n\nStrike - closer to the money, the better.  \nExpiry - hmm... let's meme 5/20. Bi-weekly if you're feeling lucky.\n\nEDIT: Not Friday, meant tomorrow.",
        "subreddit": "wallstreetbets",
        "title": "Puts on Kelly",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fxkc14/puts_on_kelly/",
        "created": 1586428988.0
    },
    {
        "author": "TrustTheitalian",
        "created_utc": 1586353402,
        "id": "fx6p0l",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "How bad do you think these fuckers are going to be? On March 10th they came out and said they only expected at 10-15% drop in domestic air travel and haven't updated since.  There earnings date isn't even set currently, all we got is a range from 4/8-4/16 with no set date. Once this shit hits $DAL is going to ZERO. The Oracle of Ohama, Mr. Buffet for you dumb-fucks, sold 15% of his overall stake in the company that he has had for over a decade. If DAL earnings are shit and they are needing a bailout these budgets airline fucks can even stay open for much longer then.",
        "subreddit": "wallstreetbets",
        "title": "Delta Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fx6p0l/delta_earnings/",
        "created": 1586382202.0
    },
    {
        "author": "danny14164",
        "created_utc": 1587250129,
        "id": "g3wqk9",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "First and foremost I am an average investor. Nothing fancy, and around half a year of options experience and I am also very bearish. Technical analysis obviously has some truth to it, it's a tool to allow more accurate decision making but is not an oracle which is why I wanted to question one of the points that continuously get brought up - **volume**. Before the black swan event SPY traded at 50million average, now it's at around 130 million average. Given that there hasn't been extreme bearish news lately, wouldn't it be normal for SPY to be trading at a lower volume? The way I see it SPY shouldn't have increased volume unless there is a reason to, for example - a large GDP decrease, unexpected terrible earnings, a major country going under a 2nd lockdown, mass bankruptcy or extending lockdowns even further. I do believe DOW will decrease in the future but unless a major event happens, I don't see why SPY would gap down a lot within 2-6 weeks since there is also a good chance none of those examples will happen in that timeframe. Insight would be much appreciated.  \n\n\nIWM 7/17 100P, SPY300 5/15",
        "subreddit": "wallstreetbets",
        "title": "SPY Volume Discussion",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g3wqk9/spy_volume_discussion/",
        "created": 1587278929.0
    },
    {
        "author": "veritasinvestments",
        "created_utc": 1587072678,
        "id": "g2o4yz",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "You can call me the oracle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/g2o4yz/you_can_call_me_the_oracle/",
        "created": 1587101478.0
    },
    {
        "author": "GunduAshoka",
        "created_utc": 1588091260,
        "id": "g9qdlj",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "In the past week have bought Disney, Delta , Boeing, Discover Finanical services and Oracle shares. I just went on instinct and invested like 2000 in each . My friend now tells me that it is a very bad stock pick. How fucked am I ??",
        "subreddit": "stocks",
        "title": "I have been going in blind this whole thing",
        "url": "https://www.reddit.com/r/stocks/comments/g9qdlj/i_have_been_going_in_blind_this_whole_thing/",
        "created": 1588120060.0
    },
    {
        "author": "plott_hound",
        "created_utc": 1586048988,
        "id": "fv55l1",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "What do you use for analysis?  I used to use Option Oracle and I loved it but I''m on a Mac now and its not compatible.  does anyone have something similar that they use?",
        "subreddit": "options",
        "title": "option analysis tool",
        "url": "https://www.reddit.com/r/options/comments/fv55l1/option_analysis_tool/",
        "created": 1586077788.0
    },
    {
        "author": "JonahMan01",
        "created_utc": 1587994105,
        "id": "g90oib",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Hi all, I have been thinking of trying to get some early positions in cloud stocks. Sadly there aren't many that I have found that have good potential. Most of them that I really like are US only where for now I'm just trying to stay within the TSX. For example the best potential cloud stocks I can find when looking are Microsoft, Docu Sign, Oracle, VMware. \n\nI came across Absolute Software ([ABT.TO](https://ABT.TO)) which so far looks ok. Need to do more research before I commit but was wondering if anyone else out there has other cloud stock they are watching or any advise/information on Absolute. Look forward to the discussion..",
        "subreddit": "CanadianInvestor",
        "title": "Canadian Cloud Stock",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/g90oib/canadian_cloud_stock/",
        "created": 1588022905.0
    },
    {
        "author": "UnknownEssence",
        "created_utc": 1587948045,
        "id": "g8q8a1",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I'm looking to invest a Market Cap weighted technology ETF similar to QQQ but there's a few things I don't like about it. Since QQQ include the top 100 companies listed on the Nasdaq exchange.\n\n1.  It includes non-tech companies like PepsiCo. \n2. Some of the biggest tech companies in the world, such as Alibaba, Oracle, SAP, IBM, Accenture, VMware, are not included in QQQ because they are traded on NYSE and not Nasdaq. There's even more I left out that are traded on non-US exchanges, like Sony.\n\nIs there a better tech ETF that include more of these tech companies?\n\n####",
        "subreddit": "investing",
        "title": "Tech ETF that includes more than just Nasdaq?",
        "url": "https://www.reddit.com/r/investing/comments/g8q8a1/tech_etf_that_includes_more_than_just_nasdaq/",
        "created": 1587976845.0
    },
    {
        "author": "Paulthebigpapabear",
        "created_utc": 1588094691,
        "id": "g9rftf",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "01:00 PM EDT, 04/28/2020 (MT Newswires) -- Zoom Video Communications (ZM) picked Oracle's (ORCL) cloud platform to support the surge in demand for its product from both consumers and companies as the COVID-19 pandemic drove people into their homes to stem the spread of the respiratory disease.\n\nThe company said in a statement on Tuesday that it needed immediate additional cloud capacity after seeing daily meeting participants spike to 300 million this month, up 50% from March. Zoom had about 10 million free and paid users by the end of December last year, it said earlier this month.\n\n\"We recently experienced the most significant growth our business has ever seen, requiring massive increases in our service capacity,\" said Eric Yuan, Zoom's chief executive. \"We chose Oracle Cloud Infrastructure because of its industry-leading security, outstanding performance, and unmatched level of support.\"\n\nZoom's operations have gained attention during the pandemic as users sheltering in their homes signed up for the video platform to connect with coworkers, family and friends. More than 212,000 people have died and 3.06 million have fallen ill from the respiratory disease.\n\nThe stock has surged 134% this year as the outbreak grew, although the shares were 2.8% lower on Tuesday as the tech-heavy Nasdaq Composite turned lower.\n\nYuan said earlier this month it was shifting engineering resources to trust, safety and privacy issues after the Federal Bureau of Investigation said it received reports of video conferences being interrupted by hate images, pornography and threats. Last week, Zoom released an upgrade to its program that included \"robust security enhancements.\"\n\nZoom said it's now enabling \"millions\" of meeting participants on the Oracle Cloud Infrastructure, which will help it meet the changing demands of a growing customer base.\n\n\"Video communications has become an essential part of our professional and personal lives, and Zoom has led this industry's innovation,\" said Safra Catz, Oracle's chief executive.\n\nPrice: 159.30, Change: -5.30, Percent Change: -3.22",
        "subreddit": "stocks",
        "title": "Something Greasy Going on Here 🤔",
        "url": "https://www.reddit.com/r/stocks/comments/g9rftf/something_greasy_going_on_here/",
        "created": 1588123491.0
    },
    {
        "author": "BApepper",
        "created_utc": 1587483937,
        "id": "g5hm5z",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm a big fan of artificial intelligence and data analytics.\n\nI am looking to hold this fund for at least 7 years.\n\nTop holdings:\n\n1. Netflix 3.97%\n2. NVIDIA 3.85%\n3. Amazon 3.82%\n4. Tencent holdings 3.63%\n5. Microsoft 3.49%\n\nFollowed by (meituan dianping, adobe, Alibaba, oracle, intel, alphabet, facebook)\n\nThoughts?",
        "subreddit": "investing",
        "title": "AIQ etf - \"Big data and AI etf\"",
        "url": "https://www.reddit.com/r/investing/comments/g5hm5z/aiq_etf_big_data_and_ai_etf/",
        "created": 1587512737.0
    },
    {
        "author": "manfrmearth",
        "created_utc": 1586668506,
        "id": "fzqnu1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Ben Rickert is the true Oracle",
        "url": "https://i.redd.it/l5eo2mmkmbs41.jpg",
        "created": 1586697306.0
    },
    {
        "author": "Alternative-ambush",
        "created_utc": 1585768113,
        "id": "ft6fte",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The King Autist Speaks - Barstools Oracle",
        "url": "https://i.redd.it/6e4cept899q41.jpg",
        "created": 1585796913.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1586455006,
        "id": "fxx51l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Holy Oracle Martin Lawrence predicts Jerome Powell's interventions way back in 1994.",
        "url": "https://www.youtube.com/watch?v=u3nVgk09Dvo",
        "created": 1586483806.0
    },
    {
        "author": "LearningtoCompound",
        "created_utc": 1585934574,
        "id": "fucges",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST\n\nHas anyone worked on fair value estimates for any of these companies and is open to discussing it with someone who wants to learn the art from a professional?\n\nI understand its the owners earnings that can be taken out of the business throughout its life discounted at the proper discount rate. But want to learn how different professionals are doing it so I can understand it better.\n\nThank you!",
        "subreddit": "wallstreetbets",
        "title": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/fucges/fair_value_estimates_for_tsla_bynd_nflx_roku_nvda/",
        "created": 1585963374.0
    },
    {
        "author": "LearningtoCompound",
        "created_utc": 1585934452,
        "id": "fucf20",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST",
        "url": "https://www.reddit.com/r/investing/comments/fucf20/fair_value_estimates_for_tsla_bynd_nflx_roku_nvda/",
        "created": 1585963252.0
    },
    {
        "author": "LearningtoCompound",
        "created_utc": 1585934413,
        "id": "fucekz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST\n\nHas anyone worked on fair value estimates for any of these companies and is open to discussing it with someone who wants to learn the art from a professional?\n\nI understand its the owners earnings that can be taken out of the business throughout its life discounted at the proper discount rate. But want to learn how different professionals are doing it so I can understand it better.\n\nThank you!",
        "subreddit": "stocks",
        "title": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST",
        "url": "https://www.reddit.com/r/stocks/comments/fucekz/fair_value_estimates_for_tsla_bynd_nflx_roku_nvda/",
        "created": 1585963213.0
    }
]