[
    {
        "author": "picuron",
        "created_utc": 1604884790,
        "id": "jqnzvk",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "The auto-mod will automatically remove my submission if I say the \"RMP\" words, but here are the results:\n\n&amp;#x200B;\n\n    OTHER STOCKS has an allocation of 33.75%\n    AAPL has an allocation of 7.56%\n    TSLA has an allocation of 5.94%\n    MSFT has an allocation of 5.75%\n    NVDA has an allocation of 3.5%\n    NIO has an allocation of 3.33%\n    VOO has an allocation of 3.29%\n    AMZN has an allocation of 3.11%\n    VTI has an allocation of 2.57%\n    QQQ has an allocation of 2.47%\n    AMD has an allocation of 2.35%\n    ICLN has an allocation of 1.38%\n    SQ has an allocation of 1.36%\n    CASH has an allocation of 1.27%\n    BABA has an allocation of 1.26%\n    FB has an allocation of 1.06%\n    DIS has an allocation of 1.06%\n    SPY has an allocation of 0.93%\n    XLK has an allocation of 0.88%\n    KO has an allocation of 0.66%\n    WMT has an allocation of 0.58%\n    VGT has an allocation of 0.58%\n    GOOGL has an allocation of 0.55%\n    V has an allocation of 0.53%\n    VT has an allocation of 0.44%\n    CRM has an allocation of 0.41%\n    A has an allocation of 0.4%\n    ETSY has an allocation of 0.4%\n    BYND has an allocation of 0.39%\n    MA has an allocation of 0.38%\n    T has an allocation of 0.33%\n    INTC has an allocation of 0.32%\n    JPM has an allocation of 0.31%\n    PINS has an allocation of 0.29%\n    SBUX has an allocation of 0.28%\n    SHOP has an allocation of 0.28%\n    CRWD has an allocation of 0.28%\n    RTX has an allocation of 0.27%\n    GOOG has an allocation of 0.24%\n    DAL has an allocation of 0.24%\n    JNJ has an allocation of 0.24%\n    MCD has an allocation of 0.24%\n    PYPL has an allocation of 0.22%\n    BAC has an allocation of 0.2%\n    CVX has an allocation of 0.19%\n    BRK.B has an allocation of 0.18%\n    GOLD has an allocation of 0.18%\n    EA has an allocation of 0.17%\n    WM has an allocation of 0.17%\n    PEP has an allocation of 0.16%\n    SWKS has an allocation of 0.16%\n    WFC has an allocation of 0.16%\n    AXP has an allocation of 0.15%\n    BA has an allocation of 0.15%\n    HD has an allocation of 0.15%\n    PFE has an allocation of 0.15%\n    COST has an allocation of 0.14%\n    LOW has an allocation of 0.14%\n    QCOM has an allocation of 0.14%\n    O has an allocation of 0.14%\n    IWF has an allocation of 0.14%\n    GE has an allocation of 0.13%\n    NFLX has an allocation of 0.13%\n    CHWY has an allocation of 0.13%\n    VUG has an allocation of 0.13%\n    XOM has an allocation of 0.12%\n    NKE has an allocation of 0.12%\n    FVRR has an allocation of 0.12%\n    CCL has an allocation of 0.11%\n    DE has an allocation of 0.11%\n    TWTR has an allocation of 0.1%\n    PLTR has an allocation of 0.1%\n    SEDG has an allocation of 0.1%\n    AVGO has an allocation of 0.09%\n    CAG has an allocation of 0.09%\n    DFS has an allocation of 0.09%\n    KR has an allocation of 0.09%\n    SPG has an allocation of 0.09%\n    SNE has an allocation of 0.09%\n    ABBV has an allocation of 0.08%\n    ATVI has an allocation of 0.08%\n    AMGN has an allocation of 0.08%\n    CSCO has an allocation of 0.08%\n    DOW has an allocation of 0.08%\n    PG has an allocation of 0.08%\n    RCL has an allocation of 0.08%\n    NOW has an allocation of 0.08%\n    TGT has an allocation of 0.08%\n    VZ has an allocation of 0.08%\n    TTD has an allocation of 0.08%\n    UBER has an allocation of 0.08%\n    ZM has an allocation of 0.08%\n    AAL has an allocation of 0.07%\n    HAS has an allocation of 0.07%\n    PPL has an allocation of 0.07%\n    UAL has an allocation of 0.07%\n    BMY has an allocation of 0.06%\n    CMCSA has an allocation of 0.06%\n    GM has an allocation of 0.06%\n    HON has an allocation of 0.06%\n    MPC has an allocation of 0.06%\n    NCLH has an allocation of 0.06%\n    REGN has an allocation of 0.06%\n    TTWO has an allocation of 0.06%\n    LULU has an allocation of 0.06%\n    FDX has an allocation of 0.05%\n    MU has an allocation of 0.05%\n    SNAP has an allocation of 0.05%\n    SONY has an allocation of 0.05%\n    BBY has an allocation of 0.04%\n    CVS has an allocation of 0.04%\n    EL has an allocation of 0.04%\n    KHC has an allocation of 0.04%\n    REG has an allocation of 0.04%\n    LUV has an allocation of 0.04%\n    VRTX has an allocation of 0.04%\n    VTV has an allocation of 0.04%\n    MO has an allocation of 0.03%\n    ADSK has an allocation of 0.03%\n    CDNS has an allocation of 0.03%\n    CI has an allocation of 0.03%\n    IBM has an allocation of 0.03%\n    MLM has an allocation of 0.03%\n    NEE has an allocation of 0.03%\n    ODFL has an allocation of 0.03%\n    ROST has an allocation of 0.03%\n    TXN has an allocation of 0.03%\n    ULTA has an allocation of 0.03%\n    UAA has an allocation of 0.03%\n    UNH has an allocation of 0.03%\n    ACB has an allocation of 0.03%\n    CGC has an allocation of 0.03%\n    ACN has an allocation of 0.02%\n    ADBE has an allocation of 0.02%\n    AMT has an allocation of 0.02%\n    CAT has an allocation of 0.02%\n    DUK has an allocation of 0.02%\n    F has an allocation of 0.02%\n    GPS has an allocation of 0.02%\n    HRL has an allocation of 0.02%\n    HPQ has an allocation of 0.02%\n    LMT has an allocation of 0.02%\n    L has an allocation of 0.02%\n    MGM has an allocation of 0.02%\n    STX has an allocation of 0.02%\n    UNP has an allocation of 0.02%\n    WYNN has an allocation of 0.02%\n    XRX has an allocation of 0.02%\n    MRNA has an allocation of 0.02%\n    IVV has an allocation of 0.02%\n    FNILX has an allocation of 0.02%\n    MMM has an allocation of 0.01%\n    ABT has an allocation of 0.01%\n    AFL has an allocation of 0.01%\n    AMAT has an allocation of 0.01%\n    CBRE has an allocation of 0.01%\n    CMA has an allocation of 0.01%\n    CTVA has an allocation of 0.01%\n    FANG has an allocation of 0.01%\n    DG has an allocation of 0.01%\n    EOG has an allocation of 0.01%\n    EQIX has an allocation of 0.01%\n    IT has an allocation of 0.01%\n    IP has an allocation of 0.01%\n    J has an allocation of 0.01%\n    LHX has an allocation of 0.01%\n    LDOS has an allocation of 0.01%\n    LEN has an allocation of 0.01%\n    LLY has an allocation of 0.01%\n    LYV has an allocation of 0.01%\n    MAR has an allocation of 0.01%\n    NOC has an allocation of 0.01%\n    PM has an allocation of 0.01%\n    PLD has an allocation of 0.01%\n    SLB has an allocation of 0.01%\n    SO has an allocation of 0.01%\n    SWK has an allocation of 0.01%\n    SYF has an allocation of 0.01%\n    TSN has an allocation of 0.01%\n    WBA has an allocation of 0.01%\n    XLNX has an allocation of 0.01%",
        "subreddit": "stocks",
        "title": "I used a web-scraper and Python to compile the average portfolio of the quarterly thread:",
        "url": "https://www.reddit.com/r/stocks/comments/jqnzvk/i_used_a_webscraper_and_python_to_compile_the/",
        "created": 1604913590.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1604699334,
        "id": "jpe8q9",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 9th, 2020.\n\n# **After sharp bounce, market may take a ‘breather’ on lingering election uncertainty, virus outbreak  - [(Source)](https://www.cnbc.com/2020/11/06/after-sharp-bounce-market-may-take-a-breather-on-lingering-election-uncertainty-virus-outbreak.html)**\n*****\n&gt; After an initially exuberant election reaction, stocks may trade more cautiously in the week ahead, as investors watch election developments unfold and track the course of the coronavirus. \n*****\n&gt; The S&amp;P 500 was up more than 7.3% in the past week, at 3,509, and the Nasdaq rose 9%, the best weekly performance since April. Stocks slid Friday, but technology, communications services, health care and discretionary stocks had the biggest gains for the week, after it appeared Democrat Joe Biden could be the next president but with a split Congress.\n*****\n&gt; The election was still unresolved heading into the weekend, but even if Biden is declared winner, close votes and lawsuits are likely to result in recounts. The Senate appeared to be in Republican hands, but the margin of control is likely to be tight, and runoff elections are required for two Senate seats in Georgia in early January.\n*****\n&gt; “I think the uncertainty is going to catch up the market on a short-term basis,” said Leo Grohowski, BNY Mellon’s Wealth Management chief investment officer. “Perhaps next week could be a drifting lower kind of week.”\n*****\n&gt; Ahead of the election, the market had been betting on a “blue wave,” where Biden would take the White House and Democrats would get control of the Senate, giving them total control of Congress. But when it appeared the Senate would stay in Republican hands, stocks surged on the idea of gridlock, which would keep Biden from implementing tax increases and lots of new regulations.\n*****\n&gt; At the same time, there has been a surge in daily new coronavirus cases to more than 122,000. Economists are concerned that the economic recovery could suffer as some states could restrict activities and consumers may pull back heading into the important holiday season.\n*****\n&gt; The Fed, in its post-meeting statement Thursday, repeated that the course of the virus could help determine the path of the economy.\n*****\n&gt; There are a few economic reports in the week ahead, including consumer price index inflation data Thursday and the producer price index Friday. More than a dozen Fed officials are on the speaking circuit, including Fed Chairman Jerome Powell, who speaks Thursday on central banking at a European Central Bank forum.\n*****\n&gt; The earnings season is beginning to slow down, but there are still dozens of reports, including from McDonald’s on Monday and Walt Disney, Applied Materials and Cisco on Thursday.\n*****\n&gt; “I think next week is just setting up to be a breather. There’s still a lot to figure out here,” said Grohowski. “The equity market’s reaction has been I think understandable and probably better than many might have expected.”\n*****\n&gt; Grohowski said there may be uncertainty for awhile. “What I’m thinking about is the Senate races. Part of the market reaction has been relying on this divided government.” After the votes are all in or recounted, “a sweep is unlikely but possible.”\n*****\n&gt; “I think the longer this stays uncertain and messy, the more the post-election bounce comes into question,” he said.\n*****\n&gt; # Different than 2000\n&gt; It would not be unusual for the stock market to sell off before rallying into year end, according to Sam Stovall, chief investment strategist at CFRA. Stovall does not expect the type of turbulence there was in 2000, when former Vice President Al Gore lost to George W. Bush in a tight race that ultimately went to the Supreme Court.\n*****\n&gt; “In 2000, they were not expecting hanging chads. But they do expect a contested election this time. I think in many ways the market anticipated this,” said Stovall.\n*****\n&gt; But the market, after its election week surge, could pull back. “Historically, the market goes down in the month of November, after a Democratic victory,” said Stovall. Since World War II, Democrats won the White House nine times, and the market fell an average of 0.5% in November in those years, compared to the average gain for all Novembers of 1.4%, he said.\n*****\n&gt; After those Democratic victories, stocks then rose 1.9% in December on average, more than the normal 1.5% gain for all Decembers.\n*****\n&gt; Strategists said they currently do not expect the kind of lockdowns that states ordered when the pandemic started to spread in March. But there could still be some impact that could be negative for stocks.\n*****\n&gt; Grohowski said he sees some signs of optimism for the market. Strong data, like third quarter GDP, October’s drop in unemployment to 6.9%, and the better-than-expected earnings are all positives for the market. Another is that investors are so skeptical.\n*****\n&gt; “What does still exist is a great deal of dry powder. There’s $4.3 trillion in money markets alone,” he said. “I can tell you, being in touch with investors of all shapes and sizes this week, there’s still a lot of skepticism. From a contrarian view, high cash and a lot of skepticism is a contrarian indicator.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/WUlRQfd.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/FWN82Hs.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/ZnTzBNz.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/g52vqsv.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OiPuXi8.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/lA86Kou.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xmtVSEB.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RRxlWej.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/W80POso.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/eGUQXgr.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yoHWfIC.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hQyweyw.png))**\n\n*****\n\n&gt; # Presidential Election Anticipation Is Keeping Us Waiting\n\n&gt; While we all anxiously await the final count and outcome of the U.S. Presidential Election, here are some possible scenarios for 2021. Our analysis here is based on historical market performance during the most likely political alignments for next year. We ran these likely scenarios through the Almanac database software to create this graph.\n\n&gt; We are either going to have the fifth year of a two-term republican president or a first year of a new democratic presidency. It appears the democrats will hold the house and the republicans will hold the senate, but that is not a forgone conclusion either. So we also examined both presidential outcomes with a democratic, republican and split congress.\n\n&gt; Our study uses the S&amp;P 500 from 1949 to 2017. We start in 1949 because it is the first full 4-Year Presidential Stock Market Cycle since the end of WWII. The Twenty-Second Amendment that implemented presidential term limits for a max of two terms or eight years was ratified on February 27, 1951. Truman in 1949 was excluded as there was a no change of party in the White House. We gave Bush 41 the same treatment.\n\n&gt; Admittedly, there are limited data points; four each of fifth year republicans and first year democrats. Here’s what we found. A change in party with a new, first year democratic president came with democratic control of Congress and significantly higher performance for the S&amp;P 500, averaging 10.6% with a median gain of 15.1% versus 7.0% for the average post-election year since 1949.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/a89421df75f426e1b1ff90cb2c29cb90/b63e1cf962f89fdb-a3/s400x600/f9bde99a9e4ba83b0df266a8d3cc04cd732cc58f.jpg))**\n\n&gt; Fifth year republican presidents in 1957 (Eisenhower) and 1973 (Nixon) had to work with democratically controlled Congresses and the market suffered significant losses. The market did well in Reagan’s fifth year with a split Congress – a testament to how “The Great Communicator” was able to work across the aisle with then Speaker of the House Tip O’Neill. Even with republican control of Congress under Bush 43’s fifth year, the market had a tough year with ongoing issues in Iraq, North Korea declaring it’s a nuclear power and the most active and second costliest hurricane season on record.\n\n*****\n\n&gt; # Job Growth Continues as COVID-19 Cases Rise\n\n&gt; The US labor market shrugged off election uncertainty and continued to add jobs in October. Despite the waning effects of fiscal stimulus and rising COVID-19 cases, per the US Bureau of Labor Statistics, the US economy added 638,000 jobs, ahead of Bloomberg survey estimates calling for 580,000. The headline number was depressed by a 268,000 drop in government employment, including 147,000 temporary census workers. Meanwhile, the unemployment rate fell from 7.9% to 6.9% despite a rise in the labor force participation rate, a reversal of the dynamic we saw in September when unemployment fell while the labor force participation also declined.\n\n&gt; However, a troubling trend remains beneath the surface. As shown in the LPL Chart of the Day, the number of long-term unemployed—those out of work for 27 weeks or longer—continues to rise as a share of the total unemployed:\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-11.6.20.png?ssl=1))**\n\n&gt; “While the labor market has continued to show improvement, there are still many people out there who are having a hard time getting back to work,” noted LPL Chief Market Strategist Ryan Detrick. “With total jobs in the US around 10 million below pre-pandemic levels and rising COVID-19 cases, there’s a lot of room for improvement despite the declining unemployment rate.”\n\n&gt; COVID-19 cases in the United States have reached record highs with a weekly trend growth rate above 20%, according to the COVID Tracking Project. As the weather cools and more activity shifts indoors, additional restrictions to limit the spread of the virus could slow the fragile labor market recovery.\n\n&gt; In particular, much of the private sector gains in this month’s jobs report were in the services sector, where previous jobs reports had shown strength in goods-oriented industries. Many countries in Europe have reinstated restrictions or even gone as far as implementing new lockdowns. While we don’t expect lockdowns in the United States like we saw in March, restrictions on activity could limit future job gains.\n\n*****\n\n&gt; # One Sentiment Survey Soars While Another Sinks\n\n&gt; In an earlier post, we discussed how bullish sentiment in the AAII survey has been on the rise, but looking at another weekly sentiment survey from Investors Intelligence, the opposite is true. The percentage of respondents reporting as bullish fell sharply this week, 7 percentage points, down to 53.6%. While a majority are still optimistic and that reading is in the middle of its range, that was the largest weekly decline since a 7.4 percentage point decline to 41.7% in the first week of March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-II-Bull.png))**\n\n&gt; Meanwhile, the percentage of newsletter writers that are \"looking for a correction\" rose sharply to 25.8% this week following last week's over 5% decline for the S&amp;P 500.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-II-Correction.png))**\n\n&gt; The Investors Intelligence survey has a long history dating back to 1963, and in all weeks in that time, only 5% (174 weeks) have seen bullish sentiment fall 5 percentage points or more while the percentage of respondents looking for a correction has risen at least 5 percentage points in the same week. In the chart below, we show the average performance of the S&amp;P 500 following these past occurrences when there has not been another in the prior 3 months. The S&amp;P 500 has frequently been higher over the following weeks and months, but there is a slight underperformance relative to all periods since 1963 when the survey begins.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-II-Performance.png))**\n\n*****\n\n&gt; # 2 Post-Election Charts You Need to See\n\n&gt; The election is over, but the questions are mounting. We don’t know who will be the next president as of Wednesday morning, but we do know that stocks tend to do well the final two months of an election year. “Once the uncertainty is over, stocks tend to rally in November and December, with November the best month of the year during an election year,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Of course, 2020 isn’t like any other year, and we still could be a ways away from who the winner will be.”\n\n&gt; The LPL Chart of the Day shows that the S&amp;P 500 Index tends to do very well the final two months of the year, especially during election years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-11.4.20.png?ssl=1))**\n\n&gt; The modern design of the S&amp;P 500 stock index was first launched in 1957. Performance back to 1928 incorporates the performance of predecessor index, the S&amp;P 90\n\n&gt; One of the big takeaways so far from Tuesday night is that the Senate likely will stay Republican, meaning we may have a divided Congress. The chances of higher taxes and more regulation likely took a hit under this scenario. This could be a nice tailwind for stocks, as the S&amp;P 500 historically has done quite well under a divided Congress, up more than 17% on average. Additionally, in years with a divided Congress, stocks have been higher the past 10 times, with 2020 potentially being the 11th in a row.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-2-11.4.20.png?ssl=1))**\n\n&gt; This election is far from over, so stay tuned to LPL Research as we continue to monitor things!\n\n*****\n\n&gt; # Emerging Markets Cheering a Potential Biden Win\n\n&gt; The US equity market has seen a massive rally in reaction to what is looking like a Biden victory over President Trump coupled with the Republican party maintianing its majority in the US Senate. None of these results are official at this point, so they are subject to change, but these are the most likely scenarios as of now. Outside of the US, emerging markets have also rallied. In just the last two days, the MSCI Emerging Market ETF (EEM) has rallied 5% and broken above resistance to new 52-week highs. If for no other reason then Biden's campaign slogan isn't America First, the rationale behind the rally makes some sense.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-EEM-Now.png))**\n\n&gt; The reaction of EEM in the aftermath of this election is very much different from what happened in 2016. Heading into the 2016 election, EEM had been trending higher, but pulled back in the days leading up to the election and broke its uptrend that had been in place since earlier in the year. Again, Trump's America First approach was understandably viewed as a headwind to emerging market equities.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-EEM-2016-labels.png))**\n\n&gt; While the initial reaction of EEM to Trump's election was negative, that weakness didn't last long. The chart below shows the performance of EEM in the two months before and one year after the 2016 election. The gray box represents the same period shown in the chart above. Within days after breaking its uptrend after the 2016 election, EEM bounced back, rallied to its 50-DMA, tested its November low, and then in the early days of 2017 it was off to the races as EEM. In fact, even accounting for the post-Election Day declines, one year after the 2016 election, EEM was up 25% which was actually more than the 21% return for the S&amp;P 500! The moral of the story here is that first reactions aren't always the right reactions, and as an investor it's not just imperative to know the environment you are operating in, but also when the tides are turning.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-EEM-2016-2017.png))**\n\n*****\n\n&gt; # Winners and Losers During Trump's Presidency\n\n&gt; With Election Day upon us, below we take a look at the biggest winners and losers across financial markets during the Trump Presidency from Election Day 2016 through today. First off, below is a chart of the market cap of the Russell 3,000 since Election Day 2000 which George W. Bush eventually won. The Russell 3,000 makes up more than 98% of the total US equity market cap, so it's a good gauge to use for measuring the overall change in market cap levels. The current market cap of the Russell 1000 is just north of $35 trillion, which is up $11.5 trillion since Election Day 2016. President Obama oversaw US market cap growth of $12.3 trillion over his two terms, while President Bush actually saw market cap decline by $4.1 trillion after his two terms.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/mktcap.png))**\n\n&gt; Below is a look at the total return of various asset classes since Election Day 2016 using key ETFs listed on US exchanges. The S&amp;P 500 (SPY) is up 70.6% since Trump was elected, while the Nasdaq 100 (QQQ) more than doubled that at +144.3%. Of the broad index ETFs in the matrix, the Smallcap Value ETF (IJS) is up the least since Election Day 2016 at just +17.2%.\n\n&gt; Looking at US sector ETFs, the Energy sector (XLE) is a huge outlier with a decline of 48.3% since Trump was elected. Technology (XLK) and Consumer Discretionary (XLY) are up the most with gains of 154% and 97%, respectively.\n\n&gt; Along with Energy stocks, the oil (USO) and natural gas (UNG) ETFs have been more than cut in half since 11/8/16, while gold (GLD) is up 47% and silver is up 29.5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/assetclass1103.png))**\n\n&gt; Not every country has seen stock market gains since Trump was elected. As shown below, Mexico (EWW) is down 28.5%, Brazil (EWZ) is down 19.4%, Spain (EWP) is down 6.8%, and the UK (EWU) is just slightly in the red.\n\n&gt; The US (SPY) is up more than any other country with a gain of 70.6%, while China (ASHR) is up the second most at +51%. Whatever happened with the trade war certainly didn't hurt the US and China versus the rest of the world on a relative basis.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/countryreturns1103.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/sectors1103.png))**\n\n&gt; Within the Russell 1,000 in its current form, there are nine stocks that are up 1,000% or more since Election Day 2016, with Enphase Energy (ENPH) at the top with a gain of 8,590%. Trade Desk (TTD) is up the second most at +2,448%, followed by Novocure (NVCR), SolarEdge Tech (SEDG), and Quidel (QDEL). Square (SQ) ranks sixth with a gain of 1,203%. Other notables on the list of big winners since Trump was elected include Etsy (ETSY), Teladoc (TDOC), Tesla (TSLA), NVIDIA (NVDA), Atlassian (TEAM), Boston Beer (SAM), and Lululemon (LULU).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/best-since-2016.png))**\n\n&gt; In terms of market cap gains for individual stocks, the numbers below are quite eye-popping. Apple (AAPL) has gained the most in market cap since Trump was elected with an increase of $1.257 trillion! Amazingly, both Amazon (AMZN) and Microsoft (MSFT) have added more than $1 trillion in market cap as well. Prior to the last few years, no company was even close to having a $1 trillion market cap, but at this point, AAPL, AMZN, and MSFT have gained that much in the last four years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/capuse.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 6th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=AQ5sT7SXYTk))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.8.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/gziesWx.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Yme9cXS.png))\n\n&gt; # ***Monday 11.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/a6Kp4iF.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/XOR4bP6.png))\n\n*****\n\n&gt; # ***Tuesday  11.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TfDOPZJ.png))\n\n&gt; # ***Tuesday 11.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/OsrCLIc.png))\n\n*****\n\n&gt; # ***Wednesday 11.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/N7Ibl9s.png))\n\n&gt; # ***Wednesday 11.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/y4tBaZw.png))\n*****\n\n&gt; # ***Thursday 11.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/wVnvQZH.png))\n\n&gt; # ***Thursday 11.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9PnmIUs.png))\n\n*****\n\n&gt; # ***Friday 11.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uoiA0Bw.png))\n\n*****\n\n&gt; # ***Friday 11.13.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n**(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.)\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning November 9th, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/jpe8q9/wall_street_week_ahead_for_the_trading_week/",
        "created": 1604728134.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1604751175,
        "id": "jppumh",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 9th, 2020.\n\n# **After sharp bounce, market may take a ‘breather’ on lingering election uncertainty, virus outbreak  - [(Source)](https://www.cnbc.com/2020/11/06/after-sharp-bounce-market-may-take-a-breather-on-lingering-election-uncertainty-virus-outbreak.html)**\n*****\n&gt; After an initially exuberant election reaction, stocks may trade more cautiously in the week ahead, as investors watch election developments unfold and track the course of the coronavirus. \n*****\n&gt; The S&amp;P 500 was up more than 7.3% in the past week, at 3,509, and the Nasdaq rose 9%, the best weekly performance since April. Stocks slid Friday, but technology, communications services, health care and discretionary stocks had the biggest gains for the week, after it appeared Democrat Joe Biden could be the next president but with a split Congress.\n*****\n&gt; The election was still unresolved heading into the weekend, but even if Biden is declared winner, close votes and lawsuits are likely to result in recounts. The Senate appeared to be in Republican hands, but the margin of control is likely to be tight, and runoff elections are required for two Senate seats in Georgia in early January.\n*****\n&gt; “I think the uncertainty is going to catch up the market on a short-term basis,” said Leo Grohowski, BNY Mellon’s Wealth Management chief investment officer. “Perhaps next week could be a drifting lower kind of week.”\n*****\n&gt; Ahead of the election, the market had been betting on a “blue wave,” where Biden would take the White House and Democrats would get control of the Senate, giving them total control of Congress. But when it appeared the Senate would stay in Republican hands, stocks surged on the idea of gridlock, which would keep Biden from implementing tax increases and lots of new regulations.\n*****\n&gt; At the same time, there has been a surge in daily new coronavirus cases to more than 122,000. Economists are concerned that the economic recovery could suffer as some states could restrict activities and consumers may pull back heading into the important holiday season.\n*****\n&gt; The Fed, in its post-meeting statement Thursday, repeated that the course of the virus could help determine the path of the economy.\n*****\n&gt; There are a few economic reports in the week ahead, including consumer price index inflation data Thursday and the producer price index Friday. More than a dozen Fed officials are on the speaking circuit, including Fed Chairman Jerome Powell, who speaks Thursday on central banking at a European Central Bank forum.\n*****\n&gt; The earnings season is beginning to slow down, but there are still dozens of reports, including from McDonald’s on Monday and Walt Disney, Applied Materials and Cisco on Thursday.\n*****\n&gt; “I think next week is just setting up to be a breather. There’s still a lot to figure out here,” said Grohowski. “The equity market’s reaction has been I think understandable and probably better than many might have expected.”\n*****\n&gt; Grohowski said there may be uncertainty for awhile. “What I’m thinking about is the Senate races. Part of the market reaction has been relying on this divided government.” After the votes are all in or recounted, “a sweep is unlikely but possible.”\n*****\n&gt; “I think the longer this stays uncertain and messy, the more the post-election bounce comes into question,” he said.\n*****\n&gt; # Different than 2000\n&gt; It would not be unusual for the stock market to sell off before rallying into year end, according to Sam Stovall, chief investment strategist at CFRA. Stovall does not expect the type of turbulence there was in 2000, when former Vice President Al Gore lost to George W. Bush in a tight race that ultimately went to the Supreme Court.\n*****\n&gt; “In 2000, they were not expecting hanging chads. But they do expect a contested election this time. I think in many ways the market anticipated this,” said Stovall.\n*****\n&gt; But the market, after its election week surge, could pull back. “Historically, the market goes down in the month of November, after a Democratic victory,” said Stovall. Since World War II, Democrats won the White House nine times, and the market fell an average of 0.5% in November in those years, compared to the average gain for all Novembers of 1.4%, he said.\n*****\n&gt; After those Democratic victories, stocks then rose 1.9% in December on average, more than the normal 1.5% gain for all Decembers.\n*****\n&gt; Strategists said they currently do not expect the kind of lockdowns that states ordered when the pandemic started to spread in March. But there could still be some impact that could be negative for stocks.\n*****\n&gt; Grohowski said he sees some signs of optimism for the market. Strong data, like third quarter GDP, October’s drop in unemployment to 6.9%, and the better-than-expected earnings are all positives for the market. Another is that investors are so skeptical.\n*****\n&gt; “What does still exist is a great deal of dry powder. There’s $4.3 trillion in money markets alone,” he said. “I can tell you, being in touch with investors of all shapes and sizes this week, there’s still a lot of skepticism. From a contrarian view, high cash and a lot of skepticism is a contrarian indicator.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/WUlRQfd.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/FWN82Hs.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/ZnTzBNz.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/g52vqsv.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OiPuXi8.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/lA86Kou.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xmtVSEB.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RRxlWej.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/Piu5auo.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/W80POso.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/eGUQXgr.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/yoHWfIC.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/hQyweyw.png))**\n\n*****\n\n&gt; # Presidential Election Anticipation Is Keeping Us Waiting\n\n&gt; While we all anxiously await the final count and outcome of the U.S. Presidential Election, here are some possible scenarios for 2021. Our analysis here is based on historical market performance during the most likely political alignments for next year. We ran these likely scenarios through the Almanac database software to create this graph.\n\n&gt; We are either going to have the fifth year of a two-term republican president or a first year of a new democratic presidency. It appears the democrats will hold the house and the republicans will hold the senate, but that is not a forgone conclusion either. So we also examined both presidential outcomes with a democratic, republican and split congress.\n\n&gt; Our study uses the S&amp;P 500 from 1949 to 2017. We start in 1949 because it is the first full 4-Year Presidential Stock Market Cycle since the end of WWII. The Twenty-Second Amendment that implemented presidential term limits for a max of two terms or eight years was ratified on February 27, 1951. Truman in 1949 was excluded as there was a no change of party in the White House. We gave Bush 41 the same treatment.\n\n&gt; Admittedly, there are limited data points; four each of fifth year republicans and first year democrats. Here’s what we found. A change in party with a new, first year democratic president came with democratic control of Congress and significantly higher performance for the S&amp;P 500, averaging 10.6% with a median gain of 15.1% versus 7.0% for the average post-election year since 1949.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/a89421df75f426e1b1ff90cb2c29cb90/b63e1cf962f89fdb-a3/s400x600/f9bde99a9e4ba83b0df266a8d3cc04cd732cc58f.jpg))**\n\n&gt; Fifth year republican presidents in 1957 (Eisenhower) and 1973 (Nixon) had to work with democratically controlled Congresses and the market suffered significant losses. The market did well in Reagan’s fifth year with a split Congress – a testament to how “The Great Communicator” was able to work across the aisle with then Speaker of the House Tip O’Neill. Even with republican control of Congress under Bush 43’s fifth year, the market had a tough year with ongoing issues in Iraq, North Korea declaring it’s a nuclear power and the most active and second costliest hurricane season on record.\n\n*****\n\n&gt; # Job Growth Continues as COVID-19 Cases Rise\n\n&gt; The US labor market shrugged off election uncertainty and continued to add jobs in October. Despite the waning effects of fiscal stimulus and rising COVID-19 cases, per the US Bureau of Labor Statistics, the US economy added 638,000 jobs, ahead of Bloomberg survey estimates calling for 580,000. The headline number was depressed by a 268,000 drop in government employment, including 147,000 temporary census workers. Meanwhile, the unemployment rate fell from 7.9% to 6.9% despite a rise in the labor force participation rate, a reversal of the dynamic we saw in September when unemployment fell while the labor force participation also declined.\n\n&gt; However, a troubling trend remains beneath the surface. As shown in the LPL Chart of the Day, the number of long-term unemployed—those out of work for 27 weeks or longer—continues to rise as a share of the total unemployed:\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-11.6.20.png?ssl=1))**\n\n&gt; “While the labor market has continued to show improvement, there are still many people out there who are having a hard time getting back to work,” noted LPL Chief Market Strategist Ryan Detrick. “With total jobs in the US around 10 million below pre-pandemic levels and rising COVID-19 cases, there’s a lot of room for improvement despite the declining unemployment rate.”\n\n&gt; COVID-19 cases in the United States have reached record highs with a weekly trend growth rate above 20%, according to the COVID Tracking Project. As the weather cools and more activity shifts indoors, additional restrictions to limit the spread of the virus could slow the fragile labor market recovery.\n\n&gt; In particular, much of the private sector gains in this month’s jobs report were in the services sector, where previous jobs reports had shown strength in goods-oriented industries. Many countries in Europe have reinstated restrictions or even gone as far as implementing new lockdowns. While we don’t expect lockdowns in the United States like we saw in March, restrictions on activity could limit future job gains.\n\n*****\n\n&gt; # One Sentiment Survey Soars While Another Sinks\n\n&gt; In an earlier post, we discussed how bullish sentiment in the AAII survey has been on the rise, but looking at another weekly sentiment survey from Investors Intelligence, the opposite is true. The percentage of respondents reporting as bullish fell sharply this week, 7 percentage points, down to 53.6%. While a majority are still optimistic and that reading is in the middle of its range, that was the largest weekly decline since a 7.4 percentage point decline to 41.7% in the first week of March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-II-Bull.png))**\n\n&gt; Meanwhile, the percentage of newsletter writers that are \"looking for a correction\" rose sharply to 25.8% this week following last week's over 5% decline for the S&amp;P 500.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-II-Correction.png))**\n\n&gt; The Investors Intelligence survey has a long history dating back to 1963, and in all weeks in that time, only 5% (174 weeks) have seen bullish sentiment fall 5 percentage points or more while the percentage of respondents looking for a correction has risen at least 5 percentage points in the same week. In the chart below, we show the average performance of the S&amp;P 500 following these past occurrences when there has not been another in the prior 3 months. The S&amp;P 500 has frequently been higher over the following weeks and months, but there is a slight underperformance relative to all periods since 1963 when the survey begins.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-II-Performance.png))**\n\n*****\n\n&gt; # 2 Post-Election Charts You Need to See\n\n&gt; The election is over, but the questions are mounting. We don’t know who will be the next president as of Wednesday morning, but we do know that stocks tend to do well the final two months of an election year. “Once the uncertainty is over, stocks tend to rally in November and December, with November the best month of the year during an election year,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Of course, 2020 isn’t like any other year, and we still could be a ways away from who the winner will be.”\n\n&gt; The LPL Chart of the Day shows that the S&amp;P 500 Index tends to do very well the final two months of the year, especially during election years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-11.4.20.png?ssl=1))**\n\n&gt; The modern design of the S&amp;P 500 stock index was first launched in 1957. Performance back to 1928 incorporates the performance of predecessor index, the S&amp;P 90\n\n&gt; One of the big takeaways so far from Tuesday night is that the Senate likely will stay Republican, meaning we may have a divided Congress. The chances of higher taxes and more regulation likely took a hit under this scenario. This could be a nice tailwind for stocks, as the S&amp;P 500 historically has done quite well under a divided Congress, up more than 17% on average. Additionally, in years with a divided Congress, stocks have been higher the past 10 times, with 2020 potentially being the 11th in a row.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-2-11.4.20.png?ssl=1))**\n\n&gt; This election is far from over, so stay tuned to LPL Research as we continue to monitor things!\n\n*****\n\n&gt; # Emerging Markets Cheering a Potential Biden Win\n\n&gt; The US equity market has seen a massive rally in reaction to what is looking like a Biden victory over President Trump coupled with the Republican party maintianing its majority in the US Senate. None of these results are official at this point, so they are subject to change, but these are the most likely scenarios as of now. Outside of the US, emerging markets have also rallied. In just the last two days, the MSCI Emerging Market ETF (EEM) has rallied 5% and broken above resistance to new 52-week highs. If for no other reason then Biden's campaign slogan isn't America First, the rationale behind the rally makes some sense.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-EEM-Now.png))**\n\n&gt; The reaction of EEM in the aftermath of this election is very much different from what happened in 2016. Heading into the 2016 election, EEM had been trending higher, but pulled back in the days leading up to the election and broke its uptrend that had been in place since earlier in the year. Again, Trump's America First approach was understandably viewed as a headwind to emerging market equities.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-EEM-2016-labels.png))**\n\n&gt; While the initial reaction of EEM to Trump's election was negative, that weakness didn't last long. The chart below shows the performance of EEM in the two months before and one year after the 2016 election. The gray box represents the same period shown in the chart above. Within days after breaking its uptrend after the 2016 election, EEM bounced back, rallied to its 50-DMA, tested its November low, and then in the early days of 2017 it was off to the races as EEM. In fact, even accounting for the post-Election Day declines, one year after the 2016 election, EEM was up 25% which was actually more than the 21% return for the S&amp;P 500! The moral of the story here is that first reactions aren't always the right reactions, and as an investor it's not just imperative to know the environment you are operating in, but also when the tides are turning.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/110520-EEM-2016-2017.png))**\n\n*****\n\n&gt; # Winners and Losers During Trump's Presidency\n\n&gt; With Election Day upon us, below we take a look at the biggest winners and losers across financial markets during the Trump Presidency from Election Day 2016 through today. First off, below is a chart of the market cap of the Russell 3,000 since Election Day 2000 which George W. Bush eventually won. The Russell 3,000 makes up more than 98% of the total US equity market cap, so it's a good gauge to use for measuring the overall change in market cap levels. The current market cap of the Russell 1000 is just north of $35 trillion, which is up $11.5 trillion since Election Day 2016. President Obama oversaw US market cap growth of $12.3 trillion over his two terms, while President Bush actually saw market cap decline by $4.1 trillion after his two terms.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/mktcap.png))**\n\n&gt; Below is a look at the total return of various asset classes since Election Day 2016 using key ETFs listed on US exchanges. The S&amp;P 500 (SPY) is up 70.6% since Trump was elected, while the Nasdaq 100 (QQQ) more than doubled that at +144.3%. Of the broad index ETFs in the matrix, the Smallcap Value ETF (IJS) is up the least since Election Day 2016 at just +17.2%.\n\n&gt; Looking at US sector ETFs, the Energy sector (XLE) is a huge outlier with a decline of 48.3% since Trump was elected. Technology (XLK) and Consumer Discretionary (XLY) are up the most with gains of 154% and 97%, respectively.\n\n&gt; Along with Energy stocks, the oil (USO) and natural gas (UNG) ETFs have been more than cut in half since 11/8/16, while gold (GLD) is up 47% and silver is up 29.5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/assetclass1103.png))**\n\n&gt; Not every country has seen stock market gains since Trump was elected. As shown below, Mexico (EWW) is down 28.5%, Brazil (EWZ) is down 19.4%, Spain (EWP) is down 6.8%, and the UK (EWU) is just slightly in the red.\n\n&gt; The US (SPY) is up more than any other country with a gain of 70.6%, while China (ASHR) is up the second most at +51%. Whatever happened with the trade war certainly didn't hurt the US and China versus the rest of the world on a relative basis.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/countryreturns1103.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/sectors1103.png))**\n\n&gt; Within the Russell 1,000 in its current form, there are nine stocks that are up 1,000% or more since Election Day 2016, with Enphase Energy (ENPH) at the top with a gain of 8,590%. Trade Desk (TTD) is up the second most at +2,448%, followed by Novocure (NVCR), SolarEdge Tech (SEDG), and Quidel (QDEL). Square (SQ) ranks sixth with a gain of 1,203%. Other notables on the list of big winners since Trump was elected include Etsy (ETSY), Teladoc (TDOC), Tesla (TSLA), NVIDIA (NVDA), Atlassian (TEAM), Boston Beer (SAM), and Lululemon (LULU).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/best-since-2016.png))**\n\n&gt; In terms of market cap gains for individual stocks, the numbers below are quite eye-popping. Apple (AAPL) has gained the most in market cap since Trump was elected with an increase of $1.257 trillion! Amazingly, both Amazon (AMZN) and Microsoft (MSFT) have added more than $1 trillion in market cap as well. Prior to the last few years, no company was even close to having a $1 trillion market cap, but at this point, AAPL, AMZN, and MSFT have gained that much in the last four years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/capuse.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 6th, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=AQ5sT7SXYTk))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.8.20**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$PLUG** \n&gt; * **$WKHS** \n&gt; * **$CGC** \n&gt; * **$DKNG** \n&gt; * **$BYND** \n&gt; * **$MCD** \n&gt; * **$ACB** \n&gt; * **$RKT** \n&gt; * **$SPG** \n&gt; * **$JMIA** \n&gt; * **$NVAX** \n&gt; * **$TLRY** \n&gt; * **$NKLA** \n&gt; * **$DDOG** \n&gt; * **$CSCO** \n&gt; * **$DHI** \n&gt; * **$WIX** \n&gt; * **$CARS** \n&gt; * **$AMAT** \n&gt; * **$DIS** \n&gt; * **$INO** \n&gt; * **$GRWG** \n&gt; * **$NLS** \n&gt; * **$AAP** \n&gt; * **$DOYU** \n&gt; * **$RNG** \n&gt; * **$PRTS** \n&gt; * **$NBEV** \n&gt; * **$LMND** \n&gt; * **$TGNA** \n&gt; * **$WVE** \n&gt; * **$EXPI** \n&gt; * **$PRTY** \n&gt; * **$ICPT** \n&gt; * **$HUYA** \n&gt; * **$GOGO** \n&gt; * **$NCLH** \n&gt; * **$OXY** \n&gt; * **$PEIX** \n&gt; * **$CYBR**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/Piu5auo.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MDVAWXO.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.9.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Yme9cXS.png))\n\n&gt; # ***Monday 11.9.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/a6Kp4iF.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/XOR4bP6.png))\n\n*****\n\n&gt; # ***Tuesday  11.10.20 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TfDOPZJ.png))\n\n&gt; # ***Tuesday 11.10.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/OsrCLIc.png))\n\n*****\n\n&gt; # ***Wednesday 11.11.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/N7Ibl9s.png))\n\n&gt; # ***Wednesday 11.11.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/y4tBaZw.png))\n*****\n\n&gt; # ***Thursday 11.12.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/wVnvQZH.png))\n\n&gt; # ***Thursday 11.12.20 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/9PnmIUs.png))\n\n*****\n\n&gt; # ***Friday 11.13.20 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/uoiA0Bw.png))\n\n*****\n\n&gt; # ***Friday 11.13.20 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Plug Power, Inc. $18.86\n**Plug Power, Inc. (PLUG)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 9, 2020. The consensus estimate is for a loss of $0.06 per share on revenue of $104.91 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 86.09%. Short interest has increased by 23.6% since the company's last earnings release while the stock has drifted higher by 85.8% from its open following the earnings release to be 133.1% above its 200 day moving average of $8.09. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 6, 2020 there was some notable buying of 12,049 contracts of the $20.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 16.7% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLUG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Workhorse Group Inc. $17.29\n**Workhorse Group Inc. (WKHS)** is confirmed to report earnings at approximately 9:00 AM ET on Monday, November 9, 2020. The consensus estimate is for a loss of $0.11 per share on revenue of $400.00 thousand and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 35.29% with revenue increasing by 9,900.00%. Short interest has increased by 38.4% since the company's last earnings release while the stock has drifted higher by 8.3% from its open following the earnings release to be 59.2% above its 200 day moving average of $10.86. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, November 4, 2020 there was some notable buying of 11,008 contracts of the $25.00 put and 7,184 contracts of the $25.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 18.8% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WKHS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Canopy Growth Corporation $23.50\n**Canopy Growth Corporation (CGC)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, November 9, 2020. The consensus estimate is for a loss of $0.23 per share on revenue of $87.61 million and the Earnings Whisper ® number is ($0.15) per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 71.95% with revenue increasing by 35.08%. Short interest has decreased by 1.0% since the company's last earnings release while the stock has drifted higher by 28.6% from its open following the earnings release to be 38.7% above its 200 day moving average of $16.95. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 6, 2020 there was some notable buying of 18,766 contracts of the $25.00 call expiring on Friday, November 13, 2020. Option traders are pricing in a 15.9% move on earnings and the stock has averaged a 13.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CGC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # DraftKings Inc. $42.32\n**DraftKings Inc. (DKNG)** is confirmed to report earnings at approximately 7:00 AM ET on Friday, November 13, 2020. The consensus estimate is for a loss of $0.64 per share on revenue of $132.19 million and the Earnings Whisper ® number is ($0.60) per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. The stock has drifted higher by 24.5% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, October 21, 2020 there was some notable buying of 8,578 contracts of the $50.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 11.8% move on earnings and the stock has averaged a 10.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DKNG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Beyond Meat, Inc. $156.86\n**Beyond Meat, Inc. (BYND)** is confirmed to report earnings at approximately 4:20 PM ET on Monday, November 9, 2020. The consensus earnings estimate is $0.05 per share on revenue of $135.56 million and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 16.67% with revenue increasing by 47.41%. Short interest has increased by 17.9% since the company's last earnings release while the stock has drifted higher by 20.5% from its open following the earnings release to be 25.3% above its 200 day moving average of $125.16. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 23, 2020 there was some notable buying of 1,502 contracts of the $170.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 13.1% move on earnings and the stock has averaged a 20.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BYND&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # McDonalds Corp. $216.56\n**McDonalds Corp. (MCD)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, November 9, 2020. The consensus earnings estimate is $1.93 per share on revenue of $5.36 billion and the Earnings Whisper ® number is $1.98 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.53% with revenue decreasing by 1.30%. Short interest has decreased by 16.8% since the company's last earnings release while the stock has drifted higher by 9.0% from its open following the earnings release to be 9.8% above its 200 day moving average of $197.19. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 22, 2020 there was some notable buying of 3,674 contracts of the $220.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 4.0% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MCD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Aurora Cannabis Inc $9.79\n**Aurora Cannabis Inc (ACB)** is confirmed to report earnings at approximately 2:45 PM ET on Monday, November 9, 2020. The consensus estimate is for a loss of $0.24 per share on revenue of $46.18 million and the Earnings Whisper ® number is ($0.19) per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2,500.00% with revenue decreasing by 19.02%. Short interest has increased by 0.5% since the company's last earnings release while the stock has drifted higher by 85.1% from its open following the earnings release to be 17.2% below its 200 day moving average of $11.83. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 6, 2020 there was some notable buying of 17,785 contracts of the $14.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 20.4% move on earnings.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ACB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Rocket Companies, Inc. $21.31\n**Rocket Companies, Inc. (RKT)** is confirmed to report earnings at approximately 6:20 PM ET on Tuesday, November 10, 2020. The consensus earnings estimate is $1.03 per share on revenue of $4.34 billion and the Earnings Whisper ® number is $1.13 per share. Investor sentiment going into the company's earnings release has 91% expecting an earnings beat On Tuesday, November 3, 2020 there was some notable buying of 13,704 contracts of the $25.00 call and 13,005 contracts of the $25.00 put expiring on Friday, December 18, 2020.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Simon Property Group, Inc. $61.86\n**Simon Property Group, Inc. (SPG)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 9, 2020. The consensus earnings estimate is $2.25 per share on revenue of $1.12 billion and the Earnings Whisper ® number is $2.26 per share. Investor sentiment going into the company's earnings release has 44% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 26.23% with revenue decreasing by 20.93%. Short interest has decreased by 3.0% since the company's last earnings release while the stock has drifted lower by 9.2% from its open following the earnings release to be 17.3% below its 200 day moving average of $74.76. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, October 13, 2020 there was some notable buying of 5,266 contracts of the $70.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Jumia Technologies AG $18.95\n**Jumia Technologies AG (JMIA)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, November 10, 2020. The consensus estimate is for a loss of $0.60 per share on revenue of $45.98 million. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Short interest has increased by 8.4% since the company's last earnings release while the stock has drifted higher by 51.6% from its open following the earnings release to be 133.7% above its 200 day moving average of $8.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, October 23, 2020 there was some notable buying of 7,895 contracts of the $16.00 call expiring on Friday, November 20, 2020. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 19.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JMIA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 9th, 2020",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jppumh/wall_street_week_ahead_for_the_trading_week/",
        "created": 1604779975.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1605046568,
        "id": "jruy8d",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n* The S&amp;P 500 -0.15% today while the NASDaq decreased by (-1.74%). The Russell 2000 rose by (+1.86%). The Dow ended in positive territory at (+0.96%)\n* The best performing sector was Energy(+3.24%) while Information Technology(-1.86%)was the worst performer.\n* Conversely, many of the mega-cap stocks relinquished their leadership roles for the second straight day. Aside from the Nasdaq, these losses were manifested in the lagging positions of the information technology (-1.9%), consumer discretionary (-1.1%), and communication services (-0.3%) sectors. \n* Eli Lilly (LLY 146.56, +4.23, +3.0%) provided investors another reason to feel better about the coronavirus after it received emergency use authorization for its antibody treatment. Separately, Boeing (BA 188.69, +9.33, +5.2%) was one of the larger value stocks that outperformed amid news that it could receive FAA approval for the 737 MAX by Nov. 18. \n* On the earnings front, D.R. Horton (DHI 70.88, +5.92, +9.1%) exceeded quarterly expectations and issued upbeat FY21 revenue guidance. Beyond Meat (BYND 125.01, -25.49, -16.9%) provided disappointing Q3 earnings results, sending shares down 17%.\n* U.S. Treasuries finished near their flat lines in a quiet session, leaving longer-dated yields at recent highs. The 2-yr yield was flat at 0.18%, and the 10-yr yield was flat at 0.96%. The U.S. Dollar Index increased 0.1% to 92.81. WTI crude futures rose 2.6%, or $1.06, to $41.37/bbl.  \n## Index Summary\n **S&amp;P 500 :** (-0.15%); **NasDaq :** (-1.74%); \\\n**Russell 2000 :** (+1.86%); **Dow :** (+0.96%); \\\n**Vix :** 25.75 (-3.69%); [-30.24%]; {-38.43%} \n## Sectors Summary \n_Three highest sectors for today were -_ \n **Energy:** (+3.24%); **Consumer Staples:** (+1.97%); **Industrials:** (+1.76%)\n _Three lowest sectors for today were -_\n **Information Technology:** (-1.86%); **Consumer Discretionary:** (-0.36%); **Communication Services:** (-0.32%)\n ## Commodities/Futures \\n_**Top 5 Highest Commodity % Changes – -**_ \\\n1\\. Brent Crude,(LCO) 42.4 +2.95 (6.96%)  \n2\\. Lumber,(LB) 556.8 +32.0 (5.75%)  \n3\\. Feeder Cattle,(FC) 140.725 +4.8 (3.41%)  \n4\\. Crude Oil,(CL) 41.39 +1.1 (2.66%)  \n5\\. Silver,(SI) 24.247 +0.55 (2.25%)  \n\n**Top 5 Lowest Commodity % Changes -**  \n1\\. Natural Gas,(NG) 2.859 -0.03 (-1.01%)  \n2\\. Feeder Cattle,(GF) 140.475 -1.15 (-0.82%)  \n3\\. Wheat,(W) 597.5 -4.5 (-0.75%)  \n4\\. Rough Rice,(RR) 12.39 -0.02 (-0.2%)  \n5\\. Sugar,(SB) 14.88 -0.03 (-0.2%)   \n## Anticipated Earnings for this Week - \n **Monday Earnings -** \n**RNG** 277.01 +10.0,(+3.74%);\n **OXY** 12.38 +0.15,(+1.23%);\n **WKHS** 19.0 +0.04,(+0.21%);\n **SPG** 78.84 -0.26,(-0.33%);\n **PLUG** 19.98 -0.33,(-1.62%);\n **NKLA** 17.98 -0.65,(-3.49%);\n **NCLH** 20.12 -1.39,(-6.46%);\n **NVAX** 78.735 -11.575,(-12.82%);\n **BYND** 125.02 -25.48,(-16.93%);\n **TLRY** 8.31 -1.79,(-17.72%);\n  \n**Tuesday Earnings -** \n**DHI** 70.88 +5.93,(+9.13%);\n **RKT** 21.6 +0.15,(+0.7%);\n **AAP** 155.42 -1.21,(-0.77%);\n **DDOG** 92.49 -2.4,(-2.53%);\n **LYFT** 36.09 -1.6,(-4.25%);\n **PRPL** 25.35 -1.93,(-7.07%);\n **CYBR** 95.67 -9.87,(-9.35%);\n **JMIA** 12.91 -3.09,(-19.31%);\n  \n**Wednesday Earnings -** \n**LMND** 65.92 +0.3,(+0.46%);\n **DOYU** 13.6 -0.68,(-4.76%);\n **HUYA** 19.91 -1.11,(-5.28%);\n **GRWG** 19.435 -2.095,(-9.73%);\n  \n**Thursday Earnings -** \n**CSCO** 38.73 +0.53,(+1.39%);\n **DIS** 142.11 -0.48,(-0.34%);\n **AMAT** 69.31 -1.99,(-2.79%);\n **WIX** 244.04 -9.96,(-3.92%);\n  \n**Friday Earnings -** \n**DKNG** 40.34 -1.16,(-2.79%);\n  \n## Dark Pool Summary - \nHighest Dark Pool buys by rank -\n 1. Z 5 buys totaling 2,956,600 shares. Average Price : 99.92, Cost : $295,703,105\n 2. XLC 3 buys totaling 2,972,717 shares. Average Price : 62.55, Cost : $185,602,877\n 3.DHR 3 buys totaling 450,000 shares. Average Price : 225.83, Cost : $101,625,000\n 4.TMO 1 buys totaling 208,472 shares. Average Price : 465.0, Cost : $96,939,480\n 5. SNAP 9 buys totaling 2,453,700 shares. Average Price : 38.46, Cost : $94,272,005\n ## Options Fast Facts -\n_**CBOE Put/Call Ratio**_ - 0.37\\\n_**Highest Multiple Over Daily Average**_- \nREV with 26x the ADV of 1491. There were 17864 calls and 21083 puts. \\\n_**Ticker with Most Contracts**_ -HYG with 637964 contracts traded today with an AVD of 291029. There were 54231 calls and 583733 puts.\\\n_**Largest Put / Call Ratio -**_ TRGP with a 68 P/C ratio. There were 24715puts and 365 calls. \\\n_**Largest Call / Put Ratio -**_ PS with a67 C/P ratio. There were 12578 calls and 189 puts. \n*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "stocks",
        "title": "Market and Options Summary for Nov-10-2020",
        "url": "https://www.reddit.com/r/stocks/comments/jruy8d/market_and_options_summary_for_nov102020/",
        "created": 1605075368.0
    },
    {
        "author": "NoeticOptions",
        "created_utc": 1604957190,
        "id": "jr6sjc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "## Daily Synopsis \n* The S&amp;P 500 increased +1.25% today while the NASDaq weakened by (-2.13%). The Russell 2000 outperformed by (+3.57%). The Dow ended in positive territory at (+2.92%)\n* The best performing sector was Energy(+14.29%) while Communication Services(-0.88%)was the worst performer.\n* The energy (+14.2%) and financials (+8.2%) sectors finished comfortably atop the leaderboard, aided by noticeably higher oil prices ($40.31, +3.17, +8.5%) and curve-steepening activity caused by selling in longer-dated Treasuries. The consumer discretionary (-1.6%), information technology (-0.7%), consumer staples (-0.5%), and communication services (-0.3%) sectors closed lower. \n* The 2-yr yield increased two basis points to 0.18%, while the 10-yr yield increased 11 basis points to 0.96%. The U.S. Dollar Index advanced 0.6% to 92.82. \n* In other important news, Joe Biden was projected the winner of the U.S. presidential election, although President Trump did not concede and said he would file legal challenges. Note, media reports indicated that Mr. Trump would unlikely succeed in overturning the election results. \n* It's worth mentioning that at one point today, the S&amp;P 500 was up as much as 11.5% over the prior six sessions. Presumably, that left it primed for profit taking amid an understanding that the market still has to get through the new wave of coronavirus and uncertainty surrounding another stimulus package.  \n## Index Summary\n **S&amp;P 500 :** (+1.25%); **NasDaq :** (-2.13%); \\\n**Russell 2000 :** (+3.57%); **Dow :** (+2.92%); \\\n**Vix :** 24.86 (+3.26%); [-30.86%]; {-23.03%} \n## Sectors Summary \n_Three highest sectors for today were -_ \n **Energy:** (+14.29%); **Financials:** (+8.15%); **Industrials:** (+3.37%)\n _Three lowest sectors for today were -_\n **Communication Services:** (-0.88%); **Information Technology:** (-0.75%); **Consumer Discretionary:** (-0.45%)\n ## Commodities/Futures \\\n_**Top 5 Highest Commodity % Changes – -**_ \\\n\n1\\. Crude Oil(CL) 40.02 +2.88 (7.2%)  \n2\\. Palladium(PA) 2500.0 +116.4 (4.66%)  \n3\\. Sugar(SB) 14.91 +0.43 (2.88%)  \n4\\. Nickel(NICKEL) 15790.0 +450.0 (2.85%)  \n5\\. None(GF) 140.925 +3.23 (2.29%)  \n\n**Top 5 Lowest Commodity % Changes -**  \n1\\. Silver(SI) 24.195 -1.86 (-7.69%)  \n2\\. Lumber(LB) 524.8 -30.9 (-5.89%)  \n3\\. Gold(GC) 1866.1 -85.6 (-4.59%)  \n4\\. Platinum(PL) 869.8 -36.2 (-4.16%)  \n5\\. Lean Hogs(LH) 64.9 -2.52 (-3.89%)   \n## Anticipated Earnings for this Week - \n **Monday Earnings -** \nSPG 79.39 +17.53(+28.34%)\n NCLH 21.53 +4.56(+26.87%)\n OXY 12.225 +2.215(+22.13%)\n WKHS 18.95 +1.66(+9.6%)\n PLUG 20.32 +1.46(+7.74%)\n TLRY 10.07 +0.44(+4.57%)\n NVAX 90.3 +0.44(+0.49%)\n BYND 150.52 -6.34(-4.04%)\n NKLA 18.725 -0.855(-4.37%)\n RNG 267.12 -27.22(-9.25%)\n  \n**Tuesday Earnings -** \nLYFT 37.705 +7.865(+26.36%)\n RKT 21.48 +0.17(+0.8%)\n AAP 156.71 +0.33(+0.21%)\n CYBR 105.27 -2.36(-2.19%)\n DDOG 94.9 -5.45(-5.43%)\n DHI 64.98 -5.63(-7.97%)\n PRPL 27.345 -3.695(-11.9%)\n JMIA 16.005 -2.945(-15.54%)\n  \n**Wednesday Earnings -** \nLMND 65.42 +4.05(+6.6%)\n DOYU 14.26 -0.65(-4.36%)\n HUYA 21.01 -0.99(-4.5%)\n GRWG 21.55 -1.43(-6.22%)\n  \n**Thursday Earnings -** \nDIS 142.56 +15.1(+11.85%)\n CSCO 38.19 +0.66(+1.76%)\n AMAT 71.36 +0.83(+1.18%)\n WIX 254.005 -32.285(-11.28%)\n  \n**Friday Earnings -** \nDKNG 41.5 -0.82(-1.94%)\n  \n## Dark Pool Summary - \nHighest Dark Pool buys by rank -\n 1. MSFT 1 buys totaling 1,011,050 shares. Average Price : 225.5, Cost : $227,991,775\n 2. PFE 6 buys totaling 2,863,000 shares. Average Price : 39.72, Cost : $113,567,315\n 3.BILI 4 buys totaling 2,111,300 shares. Average Price : 46.9, Cost : $98,973,325\n 4.GE 17 buys totaling 10,201,006 shares. Average Price : 8.86, Cost : $90,371,075\n 5. SQ 1 buys totaling 385,000 shares. Average Price : 193.5, Cost : $74,497,500\n ## Options Fast Facts -\n_**CBOE Put/Call Ratio**_ - 0.41\\\n_**Highest Multiple Over Daily Average**_- \nIMAX with 30x the ADV of 1061. There were 31152 calls and 582 puts. \\\n_**Ticker with Most Contracts**_ -BAC with 982975 contracts traded today with an AVD of 291071. There were 691528 calls and 291447 puts.\\\n_**Largest Put / Call Ratio -**_ FEZ with a 24 P/C ratio. There were 53014puts and 2245 calls. \\\n_**Largest Call / Put Ratio -**_ WBT with a228 C/P ratio. There were 16436 calls and 72 puts. \n*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "subreddit": "stocks",
        "title": "Market and Options Summary for Nov-09-2020",
        "url": "https://www.reddit.com/r/stocks/comments/jr6sjc/market_and_options_summary_for_nov092020/",
        "created": 1604985990.0
    }
]