[
    {
        "author": "jjwalla",
        "created_utc": 1607269954,
        "id": "k7w303",
        "num_comments": 340,
        "num_crossposts": 0,
        "selftext": "&gt; Chip designer Advanced Micro Devices, Inc (AMD) announced its decision to acquire programmable computing solutions designer Xilinx, Inc in October.\n\n&gt; As part of its offer and calculations for the deal, AMD provided its future financial projection estimates to DBO Partners, LLC - AMD's financial advisory firm for the entire affair. These projections go beyond the details that AMD had revealed in its financial analyst day earlier this year, and they provide a glimpse into what the company expects of itself over the course of the next five years.\n\n&gt; At the analyst day, AMD provided a compound annual growth rate (CAGR) of 20% for the next five years. During the company's presentation, chief financial officer (CFO) Mr. Devinder Kumar had stated that this figure, part of the company's long term model, was for the next four years - or for the end of the fiscal year 2023\n\n&gt; AMD's EPS forecasts for the fiscal year 2020 and the following five years in the S4 Form are $1.20, $1.56, $2.19, $2.90, $3.41 and $3.90 respectively\n\n[see full article here](https://wccftech.com/amd-22-billion-2025-growth-2019/)",
        "subreddit": "stocks",
        "title": "AMD Hopes To Earn $22 Billion Revenue In 2025 For A Staggering 232% Growth Over 2019",
        "url": "https://www.reddit.com/r/stocks/comments/k7w303/amd_hopes_to_earn_22_billion_revenue_in_2025_for/",
        "created": 1607298754.0
    },
    {
        "author": "snendroid-ai",
        "created_utc": 1608425134,
        "id": "kgk32t",
        "num_comments": 215,
        "num_crossposts": 0,
        "selftext": "Disclaimer: Copied from [this twitter thread](https://twitter.com/ChrisBloomstran/status/1340414130658820096) by **Christopher Bloomstran**  \n\n\nLet’s get ready to tumble! Come Monday, $TSLA enters the S&amp;P 500, as the world is aware. This is the one you will tell your grandkids about, or at least the new crop of investors, wondering what the bubble of 2020 was like. Tesla can be your example of the insanity....1/ \n\nFor all of the cost-saving benefits of passive investing, the Standard &amp; Poor’s committee that actively chooses the components for its indices will prove why passive investors are the dumb money with this coming Monday’s inclusion of $TSLA into its venerable S&amp;P 500 index. 2/ \n\nThe committee is not known for a price consciousness. It chases what’s hot and eliminates from its august roster what’s not. 3/ \n\nIt’s disregard for fundamentals or value was seen sharply in late 1999 &amp; early 2000 when bubble darlings like Peoplesoft, New Century Energy, Global Crossing, Xilinx, Teradyne, Quintiles Transnational, Citrix and JDS Uniphase made their way into the index. 4/ \n\nPull up the long-term charts to see how these “timely” additions fared post admittance. The most prominent additions in 1999 were America Online (discussed in my 12/5 thread) and Yahoo, whose mania also reminds me of Tesla... 5/ \n\nYahoo went public in 1996, priced at $13 per share, opened at $24.50 and closed at $33 on its first trading day, a market cap of $850 million. From there the shares zoomed ahead by more than 6x in 2 years reaching $354 in January 1999. 6/ \n\nThe company then bought Geocities for $3.6B and Broadcast for $5.7B and the stock was more than cut in half, trading down to $120. Recovering by late 1999, the wizards at S&amp;P announced they would add Yahoo to the index on 11/30/1999. 7/ \n\nThe stock climbed 67% from $210 on the day of the announcement to $350 on the day of its inclusion on 12/7, one week later. Sound familiar? The rollercoaster didn’t high point for another month. 8/ \n\nYahoo peaked not quite a month later at a share price of $475, a market cap of $127B on January 3, 2000 (the cap didn’t include another 124 million option shares, 38M granted in 1999 alone, which implied an additional \\~$50B in market cap on January 3, 2000). 9/ \n\nIn hindsight, or for anyone with reason, which was lacking in those days, there was no need to count the fully diluted shares. Why? Those options would not be exercised. The stock fell 98.3% over the next 1 ¾ years, from $475 to $8.11 on 9/26/2001, a market cap of $2.2B. Yep. 10/ \n\nAt the peak, Yahoo's $127B market cap compared to $600 million in trailing 12-month revenues, so 211 times revenues. 11/ \n\nBut the Yahoo and tech bulls would get right in your face (or on the Yahoo Finance message board) and tell you, moron, that sales had grown 141%, 248%, 258% and 1,345% in the prior 4 years, which they did. 12/ \n\nHeck, even after the stock dropped from a STOCK PRICE of $475 to $30 (a mere 93.7% in a year for those counting) by the end of 2000, sales still GREW by 88% to $1.1B, to “only” 15 times revenues! From there, however, the company flailed. 13/ \n\nSales actually fell 35%, from $1.1B to $717m from 2000 to 2001, which is what drove the shares down to $8.11 and a $2.2B market cap. To what had been the first and dominant home page, and really the dominant search engine, competition came fast. 14/ \n\nYahoo even eventually outsourced its search function to upstart Google if you can believe that. Yahoo did ultimately grow its revenues another 5x to $5B by 2016, when it was bought by Verizon $VZ in 2016 for $4.5B, excluding a sub's partial investment in Alibaba. 15/ \n\nThe buyout was at a far cry from the day Yahoo came into the S&amp;P 500 as the 30th largest capitalization in the index, with a market cap of roughly $90B and I’d guess at a weight of 0.7%. 16/ \n\nAt its January 3, 2000 peak, Yahoo had climbed to the #15 spot in the index, well ahead of Berkshire Hathaway $BRKA $BRKB (which was not yet in the index despite its mere $83B market cap, $131B in assets and $38B in shareholders equity.) 17/ \n\nHad Berkshire been in the index the day Yahoo peaked it would have held only the 37 spot, behind notorious tech darlings Cisco at $358B, Intel $290B, Time Warner $184B, Lucent $171B Sun Mico $168B, AT&amp;T $160B, WorldCom $148B, Dell $130B, HP $120B, Oracle $120B, EMC $116B,... 18/ \n\nQualcomm $116B, DirecTV $102B, Verizon $93B, AOL $93B, Motorola $90B, and Bellsouth $87B. Many of these are gone today, which leads us back to $TSLA. 19/ \n\nNever has the S&amp;P 500 committee brought in a company so large by market cap as will be the case with Tesla's inclusion. Nor have they ever brought in a company at so high a spot in the cap-weighted index, at #6, one notch ahead of Berkshire Hathaway. Insanity. 20/ \n\nOf course, by sales &amp; profits, plenty of companies have entered the index as larger constituents, but that’s not what counts in the passive index. It’s all about float adjusted market cap. Fundamental valuation matters not. Qualifying for index inclusion required some hijinks.21/ \n\nTesla had cut R&amp;D &amp; SG&amp;A, drew on reserves and leaned on environmental carbon credits to “earn” a GAAP profit for a necessary four quarters. They did so for five. Oddly, revenues only grew 15% in 2019, prior to the pandemic, in part for a reduction in customer tax incentives. 22/ \n\nImpressively, they have grown revenues 15% for the first 9 months of 2020 during the crisis while the incumbents saw sales decline. No doubt the business is growing. But how to value it? 23/ \n\nOn November 16, the S&amp;P index committee announced Tesla would be added on December 21. The market cap was $380B. Here on Saturday December 19, the stock price at $695 yields a market cap of $659B ($BRK, the current #6 is $528B) up $279B or 73% since the announcement. 24/ \n\nThe gain matches the percentage rise seen by Yahoo during the week between its announcement &amp; addition. The $279B gain is LARGER than the $215B market cap of the world’s largest auto manufacturer, Toyota. Tesla’s $659B cap is on 948M shares out at 9/30 (up 5% since YE 2019). 25/ \n\nThe share count excludes another 157M unvested or unexercised option and RSU shares, which would add more than $100B to the market cap on a fully diluted basis. 26/ \n\nLet’s not count those for the same reason they were excluded in the Yahoo calculation. Why? Many may go unexercised. Why? Nobody in their right mind would pay $659B, $760B diluted, for a car co w/ $30B in sales, little or no economic profit and an enormous growth capital need.27/ \n\n25x sales? 2,030x GAAP earnings? 422x earnings assuming Toyota’s best in industry 6% profit margin? Heck, even 85 times Microsoft’s 30% profit margin (a bone for the Tesla is not a car company but also a software/robotaxi crowd). Welcome to the game, index fund investors. 28/ \n\n80% of Tesla’s shares float, not owned by insiders, which means the adjusted market cap weight will be $528B, compelling somewhere between $50 and $75B of direct index purchases, not to mention those needed by index huggers and closet indexers. 29/ \n\nThe stock will come in at \\~1.75% of the $30.5 trillion index, itself significantly overvalued, not unlike when Yahoo peaked in January 2000 and the index peaked at over 30x earnings and 44x cyclically adjusted (CAPE) shortly thereafter. 30/ \n\nWhat prospective return does the Tesla bull expect, or the passive investor with 1.75% of capital in the shares come Monday? At 15% a year, the market cap, assuming no further dilution, grows to $3T over the next decade, \\~10% of the market value of the entire S&amp;P 500 today. 31/ \n\nAt “only” 10% per year, the fully diluted market cap grows to $2 trillion, almost where $AAPL is valued these days. At a 10% shareholder return, to trade at 30x earnings, Tesla will need to be earning $67 billion. 32/ \n\nFor grins let’s assume the company actually earns some blend of auto maker profit (most earn \\~3%, Toyota \\~6%) and a subscription software, robotaxi margin of 30%. Generously call it a 20% blended profit margin, which I’d bet heavily against. 33/ \n\nAt the impossible 20% margin, $67B would sit under $335B in revenues, roughly 11 times today’s run rate. Revenues will need to grow by almost 28% per year, and profits to 20% of revenues, to get to a 30x multiple on earnings. 34/ \n\nTo finance the necessary capital stock to produce $335B in revenues will require about half that much in capital, either debt or equity. 35/ \n\nCar companies require roughly a dollar in capital to produce a dollar in revenues, but remember we are \"assuming\" this is a software company or whatever else hallucinogens conjure up in the minds of bulls. 36/ \n\nThe best course of action for Tesla is to keep selling “at-the-market” blocks, with no prospectus, road show or risk warning, to the dumb money that is willing, or compelled, as is the passive crowd, to pay dangerous prices. The dilution at today’s prices is infinitesimal. 37/ \n\nThrough the end of 2019 Tesla had sold $12.7B in shares and borrowed $16B in debt and preferred stock. Total capital raised of $28B exceeded FY 2019 revenues of $25B and produced a $6B cumulative LOSS. 38/ \n\nSo far in 2020, Tesla has borrowed an additional net $200m and sold $12.3B of new shares (assuming a sale of the most recent $5B “at-the-market”). Bulls revere the cash on the balance sheet, but it didn’t come from profit or free cash. 39/ \n\nTotal capital raised is now $40B before retained losses. What does Tesla earn on capital? Nothing yet. Equity is less than capital raised from stock sales by the amount of cumulative losses. Per share book is of course higher thanks to successful stock sales way above book...40/ \n\nFrom a business case and investment standpoint, the math doesn’t work. Consider that total automobiles sold worldwide peaked two years ago at about 95m passenger and commercial car and truck units. At $20,000 per new vehicle, we can call the global auto market $2T in size. 41/ \n\nOur example has Tesla’s market cap growing over the next decade at “only” 10% per year to a like $2T. Car companies, with the exception of Ferrari, which makes three cars per year, don’t trade for one times sales. They trade for less. 42/ \n\nToyota, which earns a 6% margin and 6% on capital, trades itself at an all-time-high $215B on revenues of $280B in 2019, less in 2020. 43/ \n\nAuto manufacturers trade for less than sales because they make \\~3% net margins and earn that same \\~3% on capital and revenues grow at \\~3%. We can call the industry 3x3x3 (new material here folks). The car business is a bad business, and that’s what Tesla is trying to disrupt? 44/ \n\nThe best case for shareholders: If Tesla grows the aforementioned sales for the next decade by 28% to $335B (it won’t), the stock will trade for no more than 1x sales, because it’s a CAR company. 45/ \n\nIf it earns Toyota’s best in class 6% margin, even allowing for software “upgrades,” it earns $20B and trades for 25x, or a $500B market cap, which is a 33% loss from here people using diluted shares. If sales, margins or the multiple are lower, shareholders lose more. 46/ \n\nThe realistic case: The performance of the stock from here is a giant loss over time and the Tesla cult loses interest in the brand. In fact, they come to hate the brand because of their coming stock losses, customer and employee mistreatment. 47/ \n\nAsk the guys and gals on the S and X lines about their unpaid “break” here at quarter end. Rumor has it they can \"volunteer their time\" to help boost production before yearend. Sales grow nowhere near 28% a year. The incumbent auto manufacturers won’t roll over and play dead. 48/ \n\nMy prior tweet elaborated on [@elonmusk](https://twitter.com/elonmusk) using his inflated shares as currency to acquire another manufacturer w/ capacity, as he mentioned he’d be up for in a friendly merger of equals. The point of that message was that the incumbents won’t take his dangerous scrip in a deal. 49/ \n\nThat leaves Elon with having to sell new shares perpetually to finance his growth. It makes 100% sense when the shares are insanely overvalued to do so, and despite the ethics of doing so in these recent at-the-market deals. 50/ \n\nBy contrast, Mr. Buffett points out he’d prefer new and current shareholders to have a fair experience in his company’s shares. If the auto makers won’t take them in a deal, and they shouldn’t, then that leaves new shareholders to provide growth capital. Hello passive crowd. 51/ \n\nWe’ll see what happens after Monday, when Tesla assumes the #6 perch in the index. When the argument for passive is low fees, remind me in ten years how much of the loss in Tesla’s shares from here should be considered a “fee,” or a tax on stupidity. 52/ \n\nAt 1.75% of the index, a decline of 80-90% would be heavy, but realistic. Impossible to decline that much? An 88% drop takes you all the way back to….where Tesla’s shares began the year. 53/ \n\nA 90% decline takes the cap to $66B, 2.2x current run rate revenues &amp; 37x a hypothetical 6% net margin. A mere 80% drop gets to a $132B cap, 4.4x revenues, and to give the bulls on Tesla not being a car company credit, still 37x a 12% hypothetical profit margin. Ridiculous. 54/ \n\nYou can play around all you like w/ assumptions for growth, market share, expansion into new markets, profit &amp; returns on capital, but paying for some fractional ownership of today’s $760B fully diluted market value is highly likely to produce a disastrous investment result. 55/ \n\nBravo, S&amp;P. The decision to add $TSLA at present valuation is almost sure to exact pain on passive investors, compelled to “invest” 1.75% of capital in one of the most overvalued companies on record. Brilliant. As the other Buffett sings, “Come Monday, it’ll be all right...” 56/ \n\nAs disclosure, I have a small short position in $TSLA. Don’t take this note as investment advice because it’s not. Do your own research. Stocks go up &amp; down, and shorting is extremely dangerous. Upside is capped and downside is unlimited. $TSLA has risen 8.3x just this year. 57/ \n\nIf Tesla repeats the same return over the next year the market cap would be $6.3 trillion. Two years of repeat performance and the cap becomes $52 trillion. Of course, that’s 70% larger than the entire S&amp;P 500, but by then any short seller is long bankrupt. 58/58 END",
        "subreddit": "wallstreetbets",
        "title": "Story Time: $TSLA, SP500, 2020 Bubble &amp; History",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kgk32t/story_time_tsla_sp500_2020_bubble_history/",
        "created": 1608453934.0
    },
    {
        "author": "MathFerret1013",
        "created_utc": 1607888999,
        "id": "kchb2p",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "Gather round you hopeless autists. We have to talk. Listen to me you hopeless stupid fucking retards.  \nThe only reason I am not posting this on r/investing is because you asstards need help. There is some  \nserious chicken fucking tendies to be made here.  \nI'm the guy who famously claimed that Bob Swan, Intel CEO, should fabricate a silicone butt and fuck it  \nduring Intel's next earning call to appease stock holders instead of going over their financials. (See: [https://www.reddit.com/r/wallstreetbets/comments/j6ioot/intel\\_is\\_fucked/](https://www.reddit.com/r/wallstreetbets/comments/j6ioot/intel_is_fucked/)) As it turns out, I was right and Bob Swan showed everyone how much of a dipshit he really is and how he literally knows nothing about this industry. I doubled my principal on my last Intel put and I plan to do the same with my next more here.  \nFirst, let us a take a good look at what happened to intel. There is so much wrong with that company and I talked about it a lot in my last post. This analyst, Stacy Rasgon, who actually seems to have a basic understanding of this shit, sums it up fairly well. Click the fucking link asshole. Listen to him.  \nhttps://www.youtube.com/watch?v=jzTg6vWgDhQ  \nSo what do we have here:  \n  \"If you start digging in, theres almost no good news here. Gross margins have collapsed.\"  \n  \"This is the beginning of the bear thesis which seems to be embedded in the numbers here.\"  \n  \"Current trajectory of the business does not look good.\"  \nJesus Christ. Should have gone with the silicone butt bobby. Intel is ACTUALLY on fire. So what the fuck does intel plan to do about it? Bob Swan said himself on the earnings call that he wants to go with TSMC. Interesting choice Bobby Boy. Interesting because for once this is not a bad decision. But WHY would Bob Swan want to go with TSMC?  \nTSMC is perhaps the most strategically important company in the world right now. The American government has dramatically increased military operations with Taiwan.   \nOne very critical point that the average wsb idiot misses is that TSMC is only a foundry. Because of this they can focus only on improving their chip-manufacturing and not have to worry at all about selling/marketing the chips. Some of the major customers of TSMC are \\[3\\]:  \n\n\n* AMD\n* Apple (25% of TSMC revenue)\n* Broadcom\n* Marvell\n* MediaTek\n* Nvidia\n* Qualcomm\n* Xilinx\n\nSoon intel as well. Simply put, if any one of those companies above do well then TSMC wins. Their financials are perfect, they are the world leaders in their covid-proof industry, the only fab with a 5nm process and have a ton of massive customers for whom they have great relationships with (they built and bankrolled a new fabrication center just for Apple for fucks sake). If you pay close attention to this stuff, you may have heard how Nvidia recently went to Samsung for fabrication, yeah, Nvidia backtracked quickly on that and they are going back to TSMC due to Samsungs shit yields \\[4\\].\n\n  \n**Stop massaging your wife's boyfriend's vas deferens and listen up.** The American government  \nis currently preparing for a war with china over TSMC. The US is rapidly heading from a cold to a hot war with China. Some experts, such as Niall Furgeson, a well respected Stanford historian is already calling it \"Cold War 2\" \\[7\\].  \nThere is a video you must watch on this topic. It is produced by a Chinese-Hating-Korean-Trump-Supporter but it is most primary sources from China and it sums up quite well the China internal sentiment on this issue. (Click it you fucking autist):  \nhttps://www.youtube.com/watch?v=X2uP\\_8YoJTU&amp;ab\\_channel=KoreanaJones  \nWell, shit. So here we are:\n\n* The US can no longer fabricate semiconductors, only Taiwan can.\n* America will do everything is can as a matter of national security to protect TSMC.\n* USA bans China's only serious semi conductor fabricator SMIC. \\[5\\]\n* USA bans anyone from doing business with Chinese tech firms like Huawei. TSMC even confirmed AGAIN they will not fabricate for Huawei. \\[6\\]\n* Taiwan HATES China so they don't actually even want to work with their shitty fake tech companies.\n* Semiconductors are critical to a modern economy/military. (Xi JinPing has said this himself.)\n* Taiwan's military is a joke compared to China's so they will do everything to appease the Americans  \n  for the survival of their nation.\n* Hong Kong proved to the world, especially Taiwan, that China has zero interest in honoring any governance agreements made. This raises the stakes for Taiwan dramatically as a cooperation with China means a complete erasure of their culture and history.\n* ASML, the people who make the machines for TSMC, are a German company. Unsurprisingly, Germany has taken a similar stance, including military aid, for Taiwan. ASML is a \"crown jewel\" for Germany and they make a shit ton supporting TSMC.\n\n  \nSo what is the bear case for a company that is at the heart of US/Taiwan/Germany/Europe national security interests? A company which is ACTUALLY technologically superior to their competition and is basically the only game in town?  \nThe bear case is potential war with China. But if that happens your positions are going to shit anyway.\n\n**Options (Wish I bought more):**\n\nhttps://preview.redd.it/r9uchpxpd0561.png?width=1080&amp;format=png&amp;auto=webp&amp;s=4ba1bc3a98783399ddfe80637b527ceb032ec742\n\n  \n**Stocks:**\n\n  \n\n\nhttps://preview.redd.it/knuge7gsd0561.png?width=1080&amp;format=png&amp;auto=webp&amp;s=b72bd468a5e77f97a423835eaaf2e87b6c1d8275\n\n**References**\n\n1. [https://www.youtube.com/watch?v=jzTg6vWgDhQ](https://www.youtube.com/watch?v=jzTg6vWgDhQ)\n2. [https://www.fool.com/earnings/call-transcripts/2020/10/23/intel-intc-q3-2020-earnings-call-transcript/](https://www.fool.com/earnings/call-transcripts/2020/10/23/intel-intc-q3-2020-earnings-call-transcript/)\n3. [https://en.wikipedia.org/wiki/TSMC](https://en.wikipedia.org/wiki/TSMC)\n4. [https://www.techpowerup.com/273302/nvidia-reportedly-moving-ampere-to-7-nm-tsmc-in-2021](https://www.techpowerup.com/273302/nvidia-reportedly-moving-ampere-to-7-nm-tsmc-in-2021)\n5. [https://www.nytimes.com/2020/09/26/technology/trump-china-smic-blacklist.html](https://www.nytimes.com/2020/09/26/technology/trump-china-smic-blacklist.html)\n6. [https://www.scmp.com/tech/gear/article/3105678/tsmc-keeps-mum-over-huawei-licence-amid-rising-demand-chips-5g](https://www.scmp.com/tech/gear/article/3105678/tsmc-keeps-mum-over-huawei-licence-amid-rising-demand-chips-5g)\n7. [https://www.bloomberg.com/opinion/articles/2020-07-05/is-the-u-s-in-a-new-cold-war-china-has-already-declared-it](https://www.bloomberg.com/opinion/articles/2020-07-05/is-the-u-s-in-a-new-cold-war-china-has-already-declared-it)",
        "subreddit": "wallstreetbets",
        "title": "TSMC holds the Crown",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kchb2p/tsmc_holds_the_crown/",
        "created": 1607917799.0
    },
    {
        "author": "azn_stock_bimbo",
        "created_utc": 1608566135,
        "id": "khk1ew",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "Most of you already know INTL CEO [Bob Swan should’ve \\*\\*\\*\\*ed a silicone butt](https://www.reddit.com/r/wallstreetbets/comments/j6ioot/intel_is_fucked/) instead of blowing old man farts during every earnings call this year.\n\nNow, AMD CEO Dr. Lisa Su, who ran the best performing semiconductor company of the past 5 years (+3,242%), is about to rip and tear little Bob \"Boomer\" Swan a new permanent one.\n\nHow will she send him off? Well, here it is, hot off the press: [MSFT is going to transition to ARM for servers and PCs.](https://www.bloomberg.com/news/articles/2020-12-18/microsoft-is-designing-its-own-chips-for-servers-surface-pcs)\n\nDr. Lisa Su has been upping her power level BIGLY to bring MSFT the customized best price/performance, performance/watt and performance/transistor in both [Xbox](https://news.xbox.com/en-us/2020/10/28/a-closer-look-at-how-xbox-series-xs-integrates-full-amd-rdna-2-architecture/) and [Surface](https://www.amd.com/en/processors/ryzen-surface-edition) products.\n\nDr. Lisa Su, last year, asked MSFT CVP of OS Platforms, Roanne Sones, \"[So you know, Roanne, our audience is wondering what next... Are you gonna tell them? ](https://youtu.be/_96stDCb-mk?t=2324)\" Sones responds\\*\\*, \"\\*\\*\\[...\\] Lisa and I have an inside scoop on the **depth of partnership** between AMD and MSFT not just in the PC space, but also as we look in **the data center and the cloud** and the graphics-gaming. I am REALLY excited about what we are doing there. I think it's going to be **next level**, in terms of what you can expect from us. \\[...\\] We have a **deeper level of resourcing for co-engineering** here in Taipei as well as back in Redmond...\"\n\nCo-engineering? Hrm, AMD has made an impressive [ARM server CPU](https://www.servethehome.com/the-amd-opteron-a1100-an-editorial/) before.\n\nDr. Lisa Su has proclaimed, [“We continue to do ARM-based development in a couple of areas. We have custom products around ARM, and we actually use ARM in our PSP as you know. We always look at ARM, and if it makes sense down the road to introduce another ARM standard product, we’ll consider that...”](https://www.anandtech.com/show/12312/getting-radeon-vega-everywhere-an-exclusive-interview-with-dr-lisa-su-amd-ceo)\n\nDr. Lisa Su has 2 APUs (\"Mero\" and \"1638\") and a related server CPU (\"Badami\") on [roadmap](https://twitter.com/KOMACHI_ENSAKA/status/1263064682371223556).\n\nDr. Lisa Su still has a yet-to-be-released [K12, an ARM server chip](https://www.anandtech.com/show/7990/amd-announces-k12-core-custom-64bit-arm-design-in-2016), [blessed by Jim \"Big D\" Keller](https://en.wikipedia.org/wiki/Jim_Keller_(engineer)).\n\nDr. Lisa Su [“\\[AMD\\] has an M1 competitor in prototype stages\\[:\\] one version with integrated RAM, and one without it. \\[...\\] said ‘almost ready’”](https://mobile.twitter.com/MauriQHD/status/1332601734565416962)\n\nDr. Lisa Su will be giga-tera-peta-exa-flexing at the [CES 2021 keynote](https://digital.ces.tech/sessions/123407f2-3ad9-4b35-9155-f676b7006e7c?source=sessions) in January.\n\n**Conclusion: Microsoft and AMD have co-developed new ARM processors.**\n\n**TL;DR:** This transgender, Asian bimbo with silicone, DD tits is DD'ing for Dr. Lisa Su’s silicon-weaving hands 🙏🏼 and will be ready to 😩 all the way to AMD Valhalla (affording a computer hardware college degree to eventually work for Dr. Lisa Su)!\n\n**🚀Strap-in, bois.🚀**\n\n**Position**: $XLNX 148c; Cost $10.33; B/E $158.33",
        "subreddit": "wallstreetbets",
        "title": "🚀 $AMD 's Lisa Su and her shiny new ARM'ed ROCKET 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/khk1ew/amd_s_lisa_su_and_her_shiny_new_armed_rocket/",
        "created": 1608594935.0
    },
    {
        "author": "azn_stock_bimbo",
        "created_utc": 1608561592,
        "id": "khimtt",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**Hiiiiii,** r/wsb **bois❤️ and Jim Cramer Senpai! ❤️**\n\n![img](tjqqaf8qf9661 \"Cramer senpai knows. 🤔\")\n\n**Most of you already know INTL CEO** [Bob Swan should’ve \\*\\*\\*\\*ed a silicone butt](https://www.reddit.com/r/wallstreetbets/comments/j6ioot/intel_is_fucked/) **instead of blowing old man farts during every earnings call this year.** \n\n![img](u9w8979u09661 \"Silicone Butt Bobby... 😨\")\n\n**Now, AMD CEO Dr. Lisa Su, who ran the best performing semiconductor company of the past 5 years (+3,242%), is about to rip and tear little Bob \"Boomer\" Swan a new permanent one.**\n\n![img](yimhw1wah9661 \"New Logos! More Buybacks! Butthurt!\")\n\n[Boomer Bobby boy's butt is finished.](https://www.reddit.com/r/AMD_Stock/comments/kdmpac/charlie_demerjian_on_twitter_call_with_susquehana/gfxk0t2?utm_source=share&amp;utm_medium=web2x&amp;context=3) \n\n**How will she send him off? Well, here it is, hot off the press:** [MSFT is going to transition to ARM for servers and PCs.](https://www.bloomberg.com/news/articles/2020-12-18/microsoft-is-designing-its-own-chips-for-servers-surface-pcs)\n\n**Dr. Lisa Su has been upping her power level BIGLY to bring MSFT the customized best price/performance, performance/watt and performance/transistor in both** [Xbox](https://news.xbox.com/en-us/2020/10/28/a-closer-look-at-how-xbox-series-xs-integrates-full-amd-rdna-2-architecture/) **and** [Surface](https://www.amd.com/en/processors/ryzen-surface-edition) **products.**\n\n**Dr. Lisa Su, last year, asked MSFT CVP of OS Platforms, Roanne Sones, \"**[So you know, Roanne, our audience is wondering what next... Are you gonna tell them? ](https://youtu.be/_96stDCb-mk?t=2324)**\"** Sones responds**, \"**\\[...\\] **Lisa and I have an inside scoop on the depth of partnership between AMD and MSFT not just in the PC space, but also as we look in the DATA CENTER and the CLOUD and the graphics-gaming.** I am REALLY excited about what we are doing there. **I think it's going to be NEXT LEVEL, in terms of what you can expect from us. \\[...\\] We have a deeper level of resourcing for** **CO-ENGINEERING** **here in Taipei as well as back in Redmond...\"**\n\n**Co-engineering?** **AMD has made an impressive** [ARM server CPU](https://www.servethehome.com/the-amd-opteron-a1100-an-editorial/) **before.**\n\n**Dr. Lisa Su still has a yet-to-be-released** [K12, an ARM server chip](https://www.anandtech.com/show/7990/amd-announces-k12-core-custom-64bit-arm-design-in-2016)**,** [blessed by Jim \"Big D\" Keller](https://en.wikipedia.org/wiki/Jim_Keller_(engineer))**.**\n\n**Dr. Lisa Su has proclaimed,** [“We continue to do ARM-based development in a couple of areas. We have custom products around ARM, and we actually use ARM in our PSP as you know. We always look at ARM, and if it makes sense down the road to introduce another ARM standard product, we’ll consider that...”](https://www.anandtech.com/show/12312/getting-radeon-vega-everywhere-an-exclusive-interview-with-dr-lisa-su-amd-ceo)\n\n[Dr. Lisa Su buys out XLNX](https://ir.amd.com/news-events/press-releases/detail/977/amd-to-acquire-xilinx-creating-the-industrys-high)**, and Microsoft uses** [XLNX FPGA's for Azure ML models](https://docs.microsoft.com/en-us/azure/machine-learning/how-to-deploy-fpga-web-service).\n\n**Dr. Lisa Su asked for TSMC, the 👑**[CROWN JEWEL](https://www.reddit.com/r/wallstreetbets/comments/kchb2p/tsmc_holds_the_crown/) **👑of Taiwan and the semiconductor world, to make something** [SPECIAL in 2021 with leading edge node 5nm+](https://twitter.com/chiakokhua/status/1249925996209266688) ([even more volume than APPL and a better node](https://www.eetimes.com/tsmc-expected-to-rebound-in-2021-on-amd-gains/)**).**\n\n[Leather Jacket Man (NVDA) is stuck](https://www.kedglobal.com/newsView/ked202012170015) **with inferior Samsung 8nm in 2021 and printing stock for Masayoshi \"WeWork\" Son's** [ARM IP leftovers](https://ir.amd.com/news-events/press-releases/detail/524/amd-unveils-ambidextrous-computing-roadmap)**. 😂**\n\n**Dr. Lisa Su** [“\\[AMD\\] has an M1 competitor in prototype stages\\[:\\] one version with integrated RAM, and one without it. \\[...\\] said ‘almost ready’”](https://mobile.twitter.com/MauriQHD/status/1332601734565416962)\n\n![video](vmnje2q8m4661 \"Dr. Lisa Su Power Overwhelming! Credit: https://twitter.com/bryanheemskerk\")\n\n**Dr. Lisa Su will be giga-tera-peta-exa-flexing her DOMINANCE at the** [CES 2021 keynote](https://digital.ces.tech/sessions/123407f2-3ad9-4b35-9155-f676b7006e7c?source=sessions)**.**\n\n**🚀Strap-in, bois.🚀**\n\n# Boring Stuff:\n\n![img](mcc0hivwgf661 \"XLNX and AMD have been moving together since acquisition. Source: barchart.com\")\n\n [1.7234 \\[AMD/XLNX\\]](https://ir.amd.com/news-events/press-releases/detail/977/amd-to-acquire-xilinx-creating-the-industrys-high) ; [AMD FY20Q4 earnings 01/26/2021](https://www.nasdaq.com/market-activity/stocks/amd/earnings) ; [XLNX FY20Q4 earnings 01/25/2021](https://www.nasdaq.com/market-activity/stocks/xlnx/earnings)\n\n# Position:\n\n**$XLNX 01/29/2021 $148c; $1100 per 100 share contract**\n\nBreak even @ $159\n\n🐂**Beefy-based projected $XLNX price target: 🖐👀🤚**$175\n\n🐃**Ahegao-bullish projected $XLNX price target: 🖐💎🤚**$200\n\n# TL;DR:\n\n**This transgender, Asian bimbo with silicone, DD tits is DD'ing for Dr. Lisa Su’s silicon-weaving hands 🙏🏼 and will be ready to 😩 all the way to AMD Valhalla (affording a computer hardware college degree to eventually work for Dr. Lisa Su)! 🙇🏻‍♀️**",
        "subreddit": "wallstreetbets",
        "title": "DD STRAP IN BOIS🚀🚀: Lisa Su Got a New ARM-Sized 🍆; INTL CEO Bob Swan is Her Bottom Bitch😭",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/khimtt/dd_strap_in_bois_lisa_su_got_a_new_armsized_intl/",
        "created": 1608590392.0
    },
    {
        "author": "Jannis368",
        "created_utc": 1609080143,
        "id": "kl4qcr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Take Two and EA made an offer to buy Codemasters and EA seems to have won. EA is paying 604 Pence per share, but the current value is 663 Pence per share. How is that possible?\nI compared this to Xilinx, they are still below the takeover price from AMD.",
        "subreddit": "wallstreetbets",
        "title": "Why is the share price of Codemasters above the takeover price from EA?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kl4qcr/why_is_the_share_price_of_codemasters_above_the/",
        "created": 1609108943.0
    },
    {
        "author": "freehouse_throwaway",
        "created_utc": 1609881296,
        "id": "kr7ze8",
        "num_comments": 181,
        "num_crossposts": 0,
        "selftext": "* The market opened slightly red but quickly reversed because JPow realized this was no way to start a New Year, with Chadsdaq and S&amp;P being propelled to green status thanks to Tim Apple and gang. DOW got further lifted by action from BA, GS, CVX, and INTC (who's really only being carried by MU). Small caps eclipsed SPX and IXIC today with RUT/IWM up as high as almost 2% during intraday high as value play starts looking more appealing. RUT closed up 1.7% and IWM closed up 1.61%.\n\n* \"I'm totes not dead.\" Says Jack Ma, according to a person familiar with the situation who's relaying the info to a CNBC  reporter on Ma's whereabouts. The beleaguered CEO who's in the crosshair of the CCP is keeping it easy and out of the limelight after running afoul of his overlords by talking up CCP's heavy handed action towards Ant Group. Who knew if your fucking financial empire touches the livelihood of 90% of the country there may be consequences if you don't toe the line. BABA closed the day up 5.51% to $240. Meanwhile, PDD touches new ATH and closed the day up 12.24% to $187 while JD is up 10.61% to $95.\n\n* The Chinese ADR/ADS sector gets a lift today partly thanks to NYSE's overnight about-face on delisting Chinese Telecoms. BILI hits new ATH and closed up 8.15% to $102.46 thanks to favorable reception from their secondary listing on the Heng Sheng\n\n* Semi sector is on a run today thanks to MU, with Citi upping, NAND and DRAM manufacturer from Sell all the way up to Buy with a PT of freaking $100 as we enter another cyclical season. RBC Capital also raised PT from $57 to $83, Deutsche Bank from $75 to $83. Will MU $90 be back in favor and no longer a meme strike? Find out later this week. F in the chat for MartyMoho. If only he bought fooking shares and ride through two more additional cyclical season and a global pandemic. Ez dub. MU closed up 4.33% to $77, LRCX closed up 3.46% to $494, and AMAT closed up 3% to $89. MU reports earnings this Thursday after market close.\n\n* GM pop 2% when news broke at 10:29 on positive US sales number from Q4, while shares were fading slightly as the market digest the news, eventually the positive momentum took over and shares closed the day up 2.84% to $41.66. ROKU pop to close up 5.44%, closing at $335 thanks to WFC analyst raising PT from $275 to $414 (yep) and keeping his overweight rating. \n\n* Today's big movers: FUBO was up as high as 21%, M-A-R-A was up as high 23% while B-N-G-O drilled more than -30% during intraday lows after an initial halt in the early mornings. FUBO closed up 12.83% to $27.35, M-A-R-A closed up 23.43% to $13.59, and B-N-G-O closed down -31.25% to $4.95.\n\n* The GA run-off election is on the market mindset as voters are heading to the polls. Meanwhile, Congress is set to confirm Biden's win over Trump, a procedural formality that generally receives little news coverage but not in the current timeline. Expect POTUS to rage over Pence on Twitter later tonight if the latter confirms Biden's Electoral College win. Look to weed and clean energy sector for pops if the Dems somehow wins both seat. No doubt many WSBer have already loaded up on FDs to showcase the sick gains porn tomorrow if the magic happens.\n\n* In WSB meme stock land, PLTR is up more than 5% but those with OTM Jan 15 calls are likely having their ass handed to them by the greeks, while a similar story exist over at GME as the stock fades away morning gain to close the day up 0.70% as theta rampage $20c, $22c, and $23c (if your strike is even further out then RIP to you). MT and steel gang are faring better, with the stock retaking yesterday's high and closed up 2.84% to 24.63. Steel prices continues to rip and earnings will be early next month on Feb 11th.\n\n* The DOW closed up 167 pts to 0.55%, Nasdaq up 120 pts to 0.95%, S&amp;P up 26 pts to 0.71%, and RUT closed up 33 pts to 1.71%. Notable numbers tomorrow: ADP employment report at 8:15 AM ET, factory orders at 10 AM ET, EIA draw at 10:30 AM, and FOMC minutes at 2PM ET. \n\n(Yesterday's [recap](https://www.reddit.com/r/wallstreetbets/comments/kqi8e8/reeeeeeeeecap_of_todays_and_recent_market_driving/)).",
        "subreddit": "wallstreetbets",
        "title": "Reeeeeeeeecap of today's market driving news (Jan 5, 2021 after market close)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kr7ze8/reeeeeeeeecap_of_todays_market_driving_news_jan_5/",
        "created": 1609910096.0
    },
    {
        "author": "freehouse_throwaway",
        "created_utc": 1609978905,
        "id": "ks13de",
        "num_comments": 109,
        "num_crossposts": 0,
        "selftext": "(*Editor's note: It's a wild day for the market and the country, and I will try to be as neutral as possible despite the fuckery afoot)*.\n\n* Dems clinched the GA Senate run-off election as Warnock defeats Loeffler while Ossoff defeats Perdue (the first millennial Senator). As the results became more clear last night, futures took a deep dive particularly for NQ, while conversely small caps enjoys a favorable bump. The market opened deeply red for QQQ as big tech retreated with renew fear on antitrust probes  and overall an unfriendly corporate environment as Democrats will control WH and both chambers of Congress. \n\n* By early morning, the sell-off quickly reversed and big tech recovered most of their red, with big tech such as AAPL going from -3% to just shy of yesterday's close during day's high. In contrast to big tech, clean tech and weed soared on Dems securing the Senate. ICLN was up almost 4% during pre-market and as high as 9% during intraday high and HASI was up 10% during intraday high. Weed stock such as TLRY was up as high as 21%, ACB as high as 11%+, and APHA as high as 14%.\n\n* Things quickly pulled back and tech started fading in earnest at 2:15 PM ET when protestors [cosplaying as revolutionaries](https://image.cnbcfm.com/api/v1/image/106820104-1609961746992-gettyimages-1230453313-AFP_8YA6MW.jpg) stormed the capitol and Congress had to quickly pause their certifying of the Electoral College votes. Shit got real when a lady got shot as these protestors attempt to storm the [barricaded House chamber](https://dynaimage.cdn.cnn.com/cnn/w_1600/https%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F210106150417-03-house-chamber-0106.jpg) while Reps were still in the building.\n\n* The sell-off accelerated for AAPL, AMZN, FB, MSFT, and NFLX as most drilled back to opening lows by EOD. AAPL closed the day -3.37% to $126.60, AMZN -2.49% to $3,138, FB -2.83% to $263, MSFT -2.59% to $212, and NFLX -3.9% to $500.49. Thanks to overall negative sentiment of all things tech, QQQ closed the day red at -1.39% to $307 (retreating quite a bit more than IXIC given the weigh of big tech in QQQ).\n\n* Morning economic numbers had ADP reporting payrolls dropping to 123k in Dec, slightly below consensus of 130k. PMI was at 54.8 while consensus was 55.3, while factory order was up 1.0% MoM. Thankfully, none of these number fucking matters as the Dow, SPY, and IWM proceed to sky rocket with the market looking forward to stronger spending and stimulus from a Dem controlled govt.\n\n* Beyond weed, clean tech, and infrastructure - financial sector killed it today in particular mid-cap banks such as ZION (up 11.24%), CNC (up 9.81%), and KEY (up 9.73%). You'll find a similar story for large-cap bank stock with JPM closing up 4.70%, BAC up 6.25%, C up 5.75%, and WFC up 7.08%. It's a good thing I've already dumped my reopening [WFC leaps play](https://www.reddit.com/r/wallstreetbets/comments/kftjzt/weekend_discussion_thread_for_the_weekend_of/ggarcbi/) of $25c and $30c which are now fucking ITM by $3~$8 and still have a year left to go on them. Nice.\n\n* In yet another confusing about-face and showing a real Karen spunk, the NYSE is *really* delisting the three Chinese telecoms this time. The real kicker though came in at 2:25 PM ET when news broke that US officials are considering *more* Chinese stock delisting, adding Chinese big tech Alibaba, Tencent, et al. to the potential list. A sea of red soon followed to compound the sell-off as BABA crater to the Earth's core and closed down -5.32%. Following suit, PDD closed down -5.58%, JD down -7.66%, and the same goes for Chinese EV NIO at -5% and XPEV at -2.62%. LI escapes semi-unscathed and closed the day up 2.48% thanks to a new BofA coverage with a Buy rating and a PT of $42.\n\n* In WSB meme stock land, GME was on track for a solid 8-9% day until the storming of the capitol occurred, PLTR's fade accelerated further while MT stays modestly flat, bouncing back from the overall market sell off. GME closed up 5.70% to $18.36, PLTR closed down -4.31% to $23.54, and MT closed up 0.32% to $24.70. ICLN, a new WSB favorite due to new balance of power in Congress might be added to future roundup if it continues to pump. Imagine that, a clean energy boomer ETF becoming a meme stock. The iShares fund managers are probably wondering why their alerts going tits up with social media mentions and sentiment brewing.\n\n* Random trade ideas (these are not financial advice and if it goes wrong that's your own gdamn fault):\n\n    1) FSLY leaps Jan 2022 90c or 100c+ for eventual TikTok climbing back fully onto the service as ByteDance pointedly makes a political jab at outgoing administration. Headwind on this retarded play: cloud/stay-at-home stock continues to take a beating as rona gets under control as vaccine roll out picks up. \n\n    2) Sell AAPL cash secured puts Jan 15 120p to 122p if the big tech fade continues rest of the week. These ~0.18 to 0.24 delta strikes are likely safe enough and if assigned, you'll have an upcoming ER on Jan 26 to sell IV pumped covered calls to get out of the trade intact. Feb 19 puts are likely okay to sell as well given you'll receive much more premium from the ~43 dte chains. Headwinds on this retarded play: its CSP and CC. As boomer as it gets. \n\n    3) BABA leaps and/or March debit call spread for another bounce in a wild trading week for BABA. March 230c/250c is probably a sufficient spread while baking in a bit of IV via ER which is on Feb 11. Jan 230c to 250c if you're not poor. Headwind on this retarded play: Jack Ma really is missing and the US govt really will delist a 600 bil market cap Chinese ADR, forcing out all major US institution holders. Yeah, right.\n\n* The DOW closed up 1.44% or 437 pts, Nasdaq down -0.61% or -78 pts, S&amp;P up 0.57% or 21 pts, and RUT closed up 3.98% (!!) or 78 pts. Stay in school kids and avoid storming federal buildings or Twitter will start banning your fucking account. (TWTR locks POTUS account for 12 hrs and is down -1.99% AH).\n\n(Yesterday's [recap](https://www.reddit.com/r/wallstreetbets/comments/kr7ze8/reeeeeeeeecap_of_todays_market_driving_news_jan_5/)).",
        "subreddit": "wallstreetbets",
        "title": "Reeeeeeeeecap of today's market driving news (Jan 6, 2021 after market close)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ks13de/reeeeeeeeecap_of_todays_market_driving_news_jan_6/",
        "created": 1610007705.0
    },
    {
        "author": "keysworld253",
        "created_utc": 1609969020,
        "id": "krxsy9",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "While everyone was drowning in the tendies they got from the Democrats taking the Senate today (I am jealous I sat on my hand and didn't buy and ICLN weekly calls) did anyone notice how absolutely terrible the ADP numbers were?\n\nConsensus was 120k and actual was -123k. \n\nWell I guess when I type it out it's not that bad cause they really only forgot to put the minus sign on their estimate which isn't really a big deal. And oh yeah fundamentals don't matter worth shit. \nBut what happens when unemployment claims are back to a million tomorrow? \n\nTSLA calls?\nGME calls?",
        "subreddit": "wallstreetbets",
        "title": "Unemployment numbers are going to be bad bad tomorrow",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/krxsy9/unemployment_numbers_are_going_to_be_bad_bad/",
        "created": 1609997820.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610024446,
        "id": "kscstt",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "**Stocks go bonkers while the Dems take Georgia. The Capitol is breached. Is this the time to buy Solar, Pot &amp; Industrial stocks? Let’s talk about this and other stock market news** \n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a mixed day with the [Dow Jones](https://ibb.co/nsJ4qqL) leading the way up over 400points and closing at a new record high, with the broad stock market [SP500](https://ibb.co/kKxbFdQ) also finishing 0.57% up for the while the tech heavy [Nasdaq Composite](https://ibb.co/C7CdfX8) finished the day down 0.6%. All 3 of the big indexes were trading higher earlier in the day before the [VIX](https://ibb.co/4PR24Fc) saw a spike of more than 10% as rioters [STORMED](https://ibb.co/KjbQPkD) the US Capitol, before eventually getting back to certifying the electoral votes, which brought back some stability. This was a very bad incident but shouldn’t have long-lasting effects on the stock market.\n\nYesterday we saw almost 70% of [COMPANIES](https://ibb.co/Br0Y0hB) advancing with over 300 new highs as the volume also spiked up, as 8 of the 11 [SECTORS](https://ibb.co/FmhD70s) finished in the green with Financials, Energy and Materials gaining more than 3%, while the biggest loser was by far the tech sectors, dropping 1.7%, as we saw Large-Cap Growth companies underperforming the [MARKET](https://ibb.co/XpbdM7p), while small &amp; mid-caps, especially the value plays, outperformed the market.\n\nHere is the [HEAT MAP](https://ibb.co/WKhNSZh) from yesterday which show how Big tech companies suffered yesterday, as the perceived threat of increased [TAXES](https://ibb.co/D79SMMP) spooked the market, while the Industrials, Financials, Green Energy &amp; [POT](https://ibb.co/XZFHGvj) stocks flourished on the hope of a big stimulus with new &amp; improved regulations, as it is expected that there will be an improved legislation that will help the cannabis stocks soar and the possible big stimulus would be a huge boost to most of the [RETAIL](https://ibb.co/GfwgQ3Z) sector which saw names like Nordstrom, GameStop, Target and many others posting big moves to the upside. Joining them should be [COSTCO](https://ibb.co/pQdXm2H), which did lag yesterday, but posted terrific December numbers after hours, with comparable sales increasing more than 10% while e-commerce rose by more than 60% for the month.\n\nYesterday we also saw the [FED](https://ibb.co/mFgqXN4) deciding to continue the current QE pace, as they still see plenty of uncertainty around, especially in the first quarter of 2021. They will continue to buy $120B worth of securities every month, as well as possibly moving on to some lengthier term maturities, while being opened to even more monetary easing if necessary.\n\nIn some more good news, we saw the [Factory Orders](https://ibb.co/jRqfPf7) for November coming it at +1%, better than expected as shipments increased by 0.7%.\n\nWhile in some other not so good numbers we saw the December [PMI](https://ibb.co/7XjyFjB) slowing to 55.3, less than the 55.7 expected and 58.6 in the previous month, but this is still an indicator of expanding business activity, while ADP [numbers](https://ibb.co/kJ6jjRx) came in worse than expected, as the US lost 123K nonfarm jobs, worse than the 130K addition of jobs expected and 304K jobs gained in the previous month, as we saw a big loss of jobs in large business especially in the leisure/hospitality [SECTOR](https://ibb.co/9sCLVqY). This was the first [month](https://ibb.co/3F8Q9j0) since April when we saw a lose of jobs in the nonfarm private business. \n\n[TODAY](https://ibb.co/vsB6NM2) we have a loaded economic data calendar starting with jobless numbers early in the morning and finishing with the Fed Balance Sheet at the market close.\n\nIn some other stock market news, we saw a report that [ROBLOX](https://ibb.co/3yqfGFZ) is looking to go public via direct listing, rather the traditional IPO. The latest funding round at $45/share saw the company valued at almost $30B, which is very high but we have to see the latest books of the company before making a prediction if it will go higher or not. This may be a better opportunity for retail investors to get in at lower prices, rather than buying at 2-3 times the IPO price.\n\nSo, guys, due to the latest political developments we have seen a huge shift in the markets, as we saw yesterday the [SOLAR](https://ibb.co/KWH2wHh) stocks having spectacular gains with Sunrun, &amp; SunPower gaining more than 16% with many other companies like [ENPHASE](https://ibb.co/72jTgdq) also soring, while the hydrogen play Plug Power also [soared](https://ibb.co/xDxrq80) more than 20% in after-hours after agreeing to a collaboration with SK Group.\n\nWe also saw gambling names move up after with the Senate changing leadership and states like New York pushing for the legalization of [gambling](https://ibb.co/CPFdVpv) in most of the US.\n\nWe also saw other companies posting great numbers, with [T-Mobile](https://ibb.co/qC2rXQC) adding 5.5M customers, its best ever number as they lead the industry, while [ROKU](https://ibb.co/qxWCNg4) continued to be one of the best plays in the streaming business alongside Disney &amp; Netflix as they have surpassed 50M accounts.\n\nAnd on the industrial side we saw companies like Caterpillar and US Steel posting big gains in anticipation of an infrastructure bill that would benefit them. \n\n[Ford](https://ibb.co/yNz7PjD) also beat expectations with a decline in sales of just under 10%, better than the 14% expected as the company continues to move towards more trucks, SUVs &amp; EVs.\n\nOn the other-hand we also saw [Chinese](https://ibb.co/rbRQwyq) tech and EV stocks fall, after more bad headlines like the US looking to ban even more big companies in the US like Alibaba &amp; Tencent. This is a continuing story which has peaked up steam in the recent year after the political tensions between the US and China have increased. This companies were also joined by the big tech which continuing to face selloff pressure after the blue sweep in Georgia.\n\nMy opinion is that you should start buying some green energy, pot and industrial stocks but you shouldn’t go to heavy on the first day. You should wait for things to cool-off a little and not buy everything at the top. I think a bi-weekly split strategy or monthly strategy would be nice. Which would mean you should divide your investment money and buy especially on red days every couple of weeks or on a monthly basis, but I would avoid Chinese stocks for now at least.\n\nSo, let’s hope for a good day in the market as the [WORLD](https://ibb.co/LCv8Dp1) markets are mixed while the US [FUTURES](https://ibb.co/wghkCJ1) seem to be pointing at a good open with the Nasdaq leading the way, though in the last few days every single time the futures were up the stocks finished higher and vice-verse, when the futures were red the stocks finished higher, so you shouldn’t base your investment on this.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! \n\nHave a great day and see you next time!",
        "subreddit": "StockMarket",
        "title": "Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F &amp; Other Stock News [01-07]",
        "url": "https://www.reddit.com/r/StockMarket/comments/kscstt/stock_market_news_for_today_run_enph_tlry_acb_nio/",
        "created": 1610053246.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610024631,
        "id": "kscunh",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "**Stocks go bonkers while the Dems take Georgia. The Capitol is breached. Is this the time to buy Solar, Pot &amp; Industrial stocks? Let’s talk about this and other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a mixed day with the [Dow Jones](https://ibb.co/nsJ4qqL) leading the way up over 400points and closing at a new record high, with the broad stock market [SP500](https://ibb.co/kKxbFdQ) also finishing 0.57% up for the while the tech heavy [Nasdaq Composite](https://ibb.co/C7CdfX8) finished the day down 0.6%. All 3 of the big indexes were trading higher earlier in the day before the [VIX](https://ibb.co/4PR24Fc) saw a spike of more than 10% as rioters [STORMED](https://ibb.co/KjbQPkD) the US Capitol, before eventually getting back to certifying the electoral votes, which brought back some stability. This was a very bad incident but shouldn’t have long-lasting effects on the stock market.\n\nYesterday we saw almost 70% of [COMPANIES](https://ibb.co/Br0Y0hB) advancing with over 300 new highs as the volume also spiked up, as 8 of the 11 [SECTORS](https://ibb.co/FmhD70s) finished in the green with Banks , Energy and Materials gaining more than 3%, while the biggest loser was by far the tech sectors, dropping 1.7%, as we saw Large-Cap Growth companies underperforming the [MARKET](https://ibb.co/XpbdM7p), while small &amp; mid-caps, especially the value plays, outperformed the market.\n\nHere is the [HEAT MAP](https://ibb.co/WKhNSZh) from yesterday which show how Big tech companies suffered yesterday, as the perceived threat of increased [TAXES](https://ibb.co/D79SMMP) spooked the market, while the Industrials, Banks, Green Energy &amp; [POT](https://ibb.co/XZFHGvj) stocks flourished on the hope of a big stimulus with new &amp; improved regulations, as it is expected that there will be an improved legislation that will help the cannabis stocks soar and the possible big stimulus would be a huge boost to most of the [RETAIL](https://ibb.co/GfwgQ3Z) sector which saw names like Nordstrom, GameStop, Target and many others posting big moves to the upside. Joining them should be [COSTCO](https://ibb.co/pQdXm2H), which did lag yesterday, but posted terrific December numbers after hours, with comparable sales increasing more than 10% while e-commerce rose by more than 60% for the month.\n\nYesterday we also saw the [FED](https://ibb.co/mFgqXN4) deciding to continue the current QE pace, as they still see plenty of uncertainty around, especially in the first quarter of 2021. They will continue to buy $120B worth of securities every month, as well as possibly moving on to some lengthier term maturities, while being opened to even more monetary easing if necessary.\n\nIn some more good news, we saw the [Factory Orders](https://ibb.co/jRqfPf7) for November coming it at +1%, better than expected as shipments increased by 0.7%.\n\nWhile in some other not so good numbers we saw the December [PMI](https://ibb.co/7XjyFjB) slowing to 55.3, less than the 55.7 expected and 58.6 in the previous month, but this is still an indicator of expanding business activity, while ADP [numbers](https://ibb.co/kJ6jjRx) came in worse than expected, as the US lost 123K nonfarm jobs, worse than the 130K addition of jobs expected and 304K jobs gained in the previous month, as we saw a big loss of jobs in large business especially in the leisure/hospitality [SECTOR](https://ibb.co/9sCLVqY). This was the first [month](https://ibb.co/3F8Q9j0) since April when we saw a lose of jobs in the nonfarm private business.\n\n[TODAY](https://ibb.co/vsB6NM2) we have a loaded economic data calendar starting with jobless numbers early in the morning and finishing with the Fed Balance Sheet at the market close.\n\nIn some other stock market news, we saw a report that [ROBLOX](https://ibb.co/3yqfGFZ) is looking to go public via direct listing, rather the traditional IPO. The latest funding round at $45/share saw the company valued at almost $30B, which is very high but we have to see the latest books of the company before making a prediction if it will go higher or not. This may be a better opportunity for retail investors to get in at lower prices, rather than buying at 2-3 times the IPO price.\n\nSo, guys, due to the latest political developments we have seen a huge shift in the markets, as we saw yesterday the [SOLAR](https://ibb.co/KWH2wHh) stocks having spectacular gains with Sunrun, &amp; SunPower gaining more than 16% with many other companies like [ENPHASE](https://ibb.co/72jTgdq) also soring, while the hydrogen play Plug Power also [soared](https://ibb.co/xDxrq80) more than 20% in after-hours after agreeing to a collaboration with SK Group.\n\nWe also saw gambling names move up after with the Senate changing leadership and states like New York pushing for the legalization of [gambling](https://ibb.co/CPFdVpv) in most of the US.\n\nWe also saw other companies posting great numbers, with [T-Mobile](https://ibb.co/qC2rXQC) adding 5.5M customers, its best ever number as they lead the industry, while [ROKU](https://ibb.co/qxWCNg4) continued to be one of the best plays in the streaming business alongside Disney &amp; Netflix as they have surpassed 50M accounts.\n\nAnd on the industrial side we saw companies like Caterpillar and US Steel posting big gains in anticipation of an infrastructure bill that would benefit them.\n\n[Ford](https://ibb.co/yNz7PjD) also beat expectations with a decline in sales of just under 10%, better than the 14% expected as the company continues to move towards more trucks, SUVs &amp; EVs.\n\nOn the other-hand we also saw [Chinese](https://ibb.co/rbRQwyq) tech and EV stocks fall, after more bad headlines like the US looking to ban even more big companies in the US like Alibaba &amp; Tencent. This is a continuing story which has peaked up steam in the recent year after the political tensions between the US and China have increased. This companies were also joined by the big tech which continuing to face selloff pressure after the blue sweep in Georgia.\n\nMy opinion is that you should start buying some green energy, pot and industrial stocks but you shouldn’t go to heavy on the first day. You should wait for things to cool-off a little and not buy everything at the top. I think a bi-weekly split strategy or monthly strategy would be nice. Which would mean you should divide your investment money and buy especially on red days every couple of weeks or on a monthly basis, but I would avoid Chinese stocks for now at least.\n\nSo, let’s hope for a good day in the market as the [WORLD](https://ibb.co/LCv8Dp1) markets are mixed while the US [FUTURES](https://ibb.co/wghkCJ1) seem to be pointing at a good open with the Nasdaq leading the way, though in the last few days every single time the futures were up the stocks finished higher and vice-verse, when the futures were red the stocks finished higher, so you shouldn’t base your investment on this.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "subreddit": "wallstreetbets",
        "title": "Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F &amp; Other Stock News [01-07]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/",
        "created": 1610053431.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1609939777,
        "id": "krnvkz",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "**What is the impact of the Georgia Election on the Stock market? Is Alibaba going to recover or is it going down? GM outperforms in 2020, let’s talk about this and other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw the stock market recovering a good part of the losses from the first trading day of 2021, as the [Nasdaq Composite](https://ibb.co/P4FW6dK) gained almost 1%, the broad stock market [SP500](https://ibb.co/Jd46zGb) rose by .71% and the [Dow Jones](https://ibb.co/Cs47MP1) finished 167 points higher. We also saw the [VIX](https://ibb.co/kH2gz8v) dropping by more than 6% after the huge spike on Monday as more than 70% of the companies were advancing [yesterday](https://ibb.co/59qrWLY) on average volume with 109 new highs. We saw 8 of the 11 [SECTORS](https://ibb.co/hFqx3Gg) finish the day in the green, lead by Energy up over 4% and Materials up over 2%, while Consumer staples finished flat and Utilities &amp; Real Estate just finished in the red.\n\nMost small &amp; mid-cap value &amp; core companies were outperforming [yesterday](https://ibb.co/dWszjdG), as large-caps did finish mostly flat.\n\nHere is the [HEAT MAP](https://ibb.co/gDLn3Bc) from yesterday which revels plenty of gains in most of the areas of the stock market, with Big Tech companies advancing moderately, while most of the Oil&amp; Gas industry finished up significantly higher alongside companies from China.\n\nThe economic data that we received yesterday was mostly positive, starting with bankruptcy fillings falling to the lowest monthly number since early 2006, continuing the trend of this year, as this number, is the [lowest](https://ibb.co/26hzbrN) we have seen since 1986, as companies have been hugely supported by fiscal and monetary policies with record-breaking capital injections.\n\nWe also saw the December ISM Manufacturing [INDEX](https://ibb.co/q73Fj2m) coming at 60.6, higher than the 56.6 expected and the 57.5 in the previous month. This was led by a growth in new orders, productions, prices index &amp; supplier deliveries, while the employment index changed direction and was in expansion territory again this month, standing at 51.5. This was the highest PMI we have seen in 2020, with December being the 7th straight month of [expansion](https://ibb.co/12gpyy2) and the biggest one of this year, with this PMI corresponding to a 5.2% increase in GDP on an annualized basis, as we also saw a 5.5% increase on a yearly basis in the latest Redbook chain store [SALES](https://ibb.co/qWjH5dJ).\n\n[TODAY](https://ibb.co/2n4jcFm) we continue to get auto sales numbers, MBA mortgage applications, ADP jobs numbers, factory orders and a final read on the PMI composite, as we also await the Georgia Runoff [ELECTION](https://ibb.co/zXyZWmR) final results, as right now one of the seats has been called by multiple media channels for the Democrats while the other one is still too tight to call.\n\nIf the Dems to sweep, this could cause an increased volatility in the markets, especially in the tech sectors as investors would probably overreact and just start selling off. This could be a good buying opportunity in my opinion, as I believe it’s very unlikely that even if Democrats do have the power to make big changes, which is very unlikely on big &amp; important subjects as they themselves are divided on many subjects, they wouldn’t do that when things are still very bad in the economy, and the future still looks uncertain. Things should get better before any “big tax changes” or any other “big regulation changes”. So, if the Dems win the other seat, expect volatility, that could lead to a healthy correction after a huge run or a consolidation period before the markets recovers. So, I just wouldn’t bet against the bull market that we are in right now.\n\nIn some other stock market news, we saw a report that Alibaba is [planning](https://ibb.co/s2vb2L8) to raise $5B through bonds again, following the 2014 and 2017 capital raising operation, with the company also getting downgraded at CFRA to a sell [rating](https://ibb.co/QbJwG53) while also cutting their PT from $280 to $210. I know the political factors are really pushing this stock in the wrong direction, but after all of this will pass, Alibaba is still a great company, even [without](https://ibb.co/m4x7CCs) Ant Group and despite the latest moves by trump to continue banning Chinese [APPS](https://ibb.co/X8xr9Cs), with the latest big ones being Alipay &amp; WeChat Pay. In my opinion this is a severe overreaction as long-term investing goes. Yeah, maybe in the short-term the company can go either way depending on what restrictions they get, but I really don’t think Alibaba will go bust in the long-run.\n\nYesterday we also receive auto sales number from a couple of manufacturers, with [GM](https://ibb.co/6HhqwZr) stealing the show, with Q4 sales up almost 5% year/year, as the company estimated they gained market share in both retail and fleet deliveries in 2020, while NISSAN’s [sales](https://ibb.co/gFhYd60) continued to drop, as they sold 19% less vehicles in Q4 over the last quarter, as the total sales in 2020 dropped by more than 33%, as the automaker has fallen out of flavor with outdated models and no innovative developments.\n\nMeanwhile [VW](https://ibb.co/st5S7fh) did slightly worse overall in 2020, but saw a 11% increase in sales in Q4, as this was led by a 22% increase in the total SUVs sold. The SUV trend continues to keep on getting more &amp; more meaningful and most automakers must try and compete in this highly demanded market if they do want to survive. If you do want to invest in this industry, I suggest you take a look at the product development &amp; future outlook for the company before. I think both GM &amp; Ford are going in the right direction, but you should do your own research.\n\nSo, let’s hope for a good day in the market as the [world](https://ibb.co/55PMcBq) stock markets and the US [FUTURES](https://ibb.co/bN3RK87) seem to be pointing to a mixed open, with the Dow leading the way, while the tech heavy Nasdaq is down almost 1.3% on panic selling &amp; portfolio rebalancing happening due to the possible Democratic sweep in Georgia.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "subreddit": "wallstreetbets",
        "title": "Stock Market News for Today | BABA | GM &amp; Other Stock Market News [01-06]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/krnvkz/stock_market_news_for_today_baba_gm_other_stock/",
        "created": 1609968577.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610024447,
        "id": "kscsu0",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**Stocks go bonkers while the Dems take Georgia. The Capitol is breached. Is this the time to buy Solar, Pot &amp; Industrial stocks? Let’s talk about this and other stock market news** \n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a mixed day with the [Dow Jones](https://ibb.co/nsJ4qqL) leading the way up over 400points and closing at a new record high, with the broad stock market [SP500](https://ibb.co/kKxbFdQ) also finishing 0.57% up for the while the tech heavy [Nasdaq Composite](https://ibb.co/C7CdfX8) finished the day down 0.6%. All 3 of the big indexes were trading higher earlier in the day before the [VIX](https://ibb.co/4PR24Fc) saw a spike of more than 10% as rioters [STORMED](https://ibb.co/KjbQPkD) the US Capitol, before eventually getting back to certifying the electoral votes, which brought back some stability. This was a very bad incident but shouldn’t have long-lasting effects on the stock market.\n\nYesterday we saw almost 70% of [COMPANIES](https://ibb.co/Br0Y0hB) advancing with over 300 new highs as the volume also spiked up, as 8 of the 11 [SECTORS](https://ibb.co/FmhD70s) finished in the green with Financials, Energy and Materials gaining more than 3%, while the biggest loser was by far the tech sectors, dropping 1.7%, as we saw Large-Cap Growth companies underperforming the [MARKET](https://ibb.co/XpbdM7p), while small &amp; mid-caps, especially the value plays, outperformed the market.\n\nHere is the [HEAT MAP](https://ibb.co/WKhNSZh) from yesterday which show how Big tech companies suffered yesterday, as the perceived threat of increased [TAXES](https://ibb.co/D79SMMP) spooked the market, while the Industrials, Financials, Green Energy &amp; [POT](https://ibb.co/XZFHGvj) stocks flourished on the hope of a big stimulus with new &amp; improved regulations, as it is expected that there will be an improved legislation that will help the cannabis stocks soar and the possible big stimulus would be a huge boost to most of the [RETAIL](https://ibb.co/GfwgQ3Z) sector which saw names like Nordstrom, GameStop, Target and many others posting big moves to the upside. Joining them should be [COSTCO](https://ibb.co/pQdXm2H), which did lag yesterday, but posted terrific December numbers after hours, with comparable sales increasing more than 10% while e-commerce rose by more than 60% for the month.\n\nYesterday we also saw the [FED](https://ibb.co/mFgqXN4) deciding to continue the current QE pace, as they still see plenty of uncertainty around, especially in the first quarter of 2021. They will continue to buy $120B worth of securities every month, as well as possibly moving on to some lengthier term maturities, while being opened to even more monetary easing if necessary.\n\nIn some more good news, we saw the [Factory Orders](https://ibb.co/jRqfPf7) for November coming it at +1%, better than expected as shipments increased by 0.7%.\n\nWhile in some other not so good numbers we saw the December [PMI](https://ibb.co/7XjyFjB) slowing to 55.3, less than the 55.7 expected and 58.6 in the previous month, but this is still an indicator of expanding business activity, while ADP [numbers](https://ibb.co/kJ6jjRx) came in worse than expected, as the US lost 123K nonfarm jobs, worse than the 130K addition of jobs expected and 304K jobs gained in the previous month, as we saw a big loss of jobs in large business especially in the leisure/hospitality [SECTOR](https://ibb.co/9sCLVqY). This was the first [month](https://ibb.co/3F8Q9j0) since April when we saw a lose of jobs in the nonfarm private business. \n\n[TODAY](https://ibb.co/vsB6NM2) we have a loaded economic data calendar starting with jobless numbers early in the morning and finishing with the Fed Balance Sheet at the market close.\n\nIn some other stock market news, we saw a report that [ROBLOX](https://ibb.co/3yqfGFZ) is looking to go public via direct listing, rather the traditional IPO. The latest funding round at $45/share saw the company valued at almost $30B, which is very high but we have to see the latest books of the company before making a prediction if it will go higher or not. This may be a better opportunity for retail investors to get in at lower prices, rather than buying at 2-3 times the IPO price.\n\nSo, guys, due to the latest political developments we have seen a huge shift in the markets, as we saw yesterday the [SOLAR](https://ibb.co/KWH2wHh) stocks having spectacular gains with Sunrun, &amp; SunPower gaining more than 16% with many other companies like [ENPHASE](https://ibb.co/72jTgdq) also soring, while the hydrogen play Plug Power also [soared](https://ibb.co/xDxrq80) more than 20% in after-hours after agreeing to a collaboration with SK Group.\n\nWe also saw gambling names move up after with the Senate changing leadership and states like New York pushing for the legalization of [gambling](https://ibb.co/CPFdVpv) in most of the US.\n\nWe also saw other companies posting great numbers, with [T-Mobile](https://ibb.co/qC2rXQC) adding 5.5M customers, its best ever number as they lead the industry, while [ROKU](https://ibb.co/qxWCNg4) continued to be one of the best plays in the streaming business alongside Disney &amp; Netflix as they have surpassed 50M accounts.\n\nAnd on the industrial side we saw companies like Caterpillar and US Steel posting big gains in anticipation of an infrastructure bill that would benefit them. \n\n[Ford](https://ibb.co/yNz7PjD) also beat expectations with a decline in sales of just under 10%, better than the 14% expected as the company continues to move towards more trucks, SUVs &amp; EVs.\n\nOn the other-hand we also saw [Chinese](https://ibb.co/rbRQwyq) tech and EV stocks fall, after more bad headlines like the US looking to ban even more big companies in the US like Alibaba &amp; Tencent. This is a continuing story which has peaked up steam in the recent year after the political tensions between the US and China have increased. This companies were also joined by the big tech which continuing to face selloff pressure after the blue sweep in Georgia.\n\nMy opinion is that you should start buying some green energy, pot and industrial stocks but you shouldn’t go to heavy on the first day. You should wait for things to cool-off a little and not buy everything at the top. I think a bi-weekly split strategy or monthly strategy would be nice. Which would mean you should divide your investment money and buy especially on red days every couple of weeks or on a monthly basis, but I would avoid Chinese stocks for now at least.\n\nSo, let’s hope for a good day in the market as the [WORLD](https://ibb.co/LCv8Dp1) markets are mixed while the US [FUTURES](https://ibb.co/wghkCJ1) seem to be pointing at a good open with the Nasdaq leading the way, though in the last few days every single time the futures were up the stocks finished higher and vice-verse, when the futures were red the stocks finished higher, so you shouldn’t base your investment on this.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! \n\nHave a great day and see you next time!",
        "subreddit": "stocks",
        "title": "Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F &amp; Other Stock News [01-07]",
        "url": "https://www.reddit.com/r/stocks/comments/kscsu0/stock_market_news_for_today_run_enph_tlry_acb_nio/",
        "created": 1610053247.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1609939778,
        "id": "krnvll",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "**What is the impact of the Georgia Election on the Stock market? Is Alibaba going to recover or is it going down? GM outperforms in 2020, let’s talk about this and other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw the stock market recovering a good part of the losses from the first trading day of 2021, as the [Nasdaq Composite](https://ibb.co/P4FW6dK) gained almost 1%, the broad stock market [SP500](https://ibb.co/Jd46zGb) rose by .71% and the [Dow Jones](https://ibb.co/Cs47MP1) finished 167 points higher. We also saw the [VIX](https://ibb.co/kH2gz8v) dropping by more than 6% after the huge spike on Monday as more than 70% of the companies were advancing [yesterday](https://ibb.co/59qrWLY) on average volume with 109 new highs. We saw 8 of the 11 [SECTORS](https://ibb.co/hFqx3Gg) finish the day in the green, lead by Energy up over 4% and Materials up over 2%, while Consumer staples finished flat and Utilities &amp; Real Estate just finished in the red.\n\nMost small &amp; mid-cap value &amp; core companies were outperforming [yesterday](https://ibb.co/dWszjdG), as large-caps did finish mostly flat.\n\nHere is the [HEAT MAP](https://ibb.co/gDLn3Bc) from yesterday which revels plenty of gains in most of the areas of the stock market, with Big Tech companies advancing moderately, while most of the Oil&amp; Gas industry finished up significantly higher alongside companies from China.\n\nThe economic data that we received yesterday was mostly positive, starting with bankruptcy fillings falling to the lowest monthly number since early 2006, continuing the trend of this year, as this number, is the [lowest](https://ibb.co/26hzbrN) we have seen since 1986, as companies have been hugely supported by fiscal and monetary policies with record-breaking capital injections.\n\nWe also saw the December ISM Manufacturing [INDEX](https://ibb.co/q73Fj2m) coming at 60.6, higher than the 56.6 expected and the 57.5 in the previous month. This was led by a growth in new orders, productions, prices index &amp; supplier deliveries, while the employment index changed direction and was in expansion territory again this month, standing at 51.5. This was the highest PMI we have seen in 2020, with December being the 7th straight month of [expansion](https://ibb.co/12gpyy2) and the biggest one of this year, with this PMI corresponding to a 5.2% increase in GDP on an annualized basis, as we also saw a 5.5% increase on a yearly basis in the latest Redbook chain store [SALES](https://ibb.co/qWjH5dJ).\n\n[TODAY](https://ibb.co/2n4jcFm) we continue to get auto sales numbers, MBA mortgage applications, ADP jobs numbers, factory orders and a final read on the PMI composite, as we also await the Georgia Runoff [ELECTION](https://ibb.co/zXyZWmR) final results, as right now one of the seats has been called by multiple media channels for the Democrats while the other one is still too tight to call.\n\nIf the Dems to sweep, this could cause an increased volatility in the markets, especially in the tech sectors as investors would probably overreact and just start selling off. This could be a good buying opportunity in my opinion, as I believe it’s very unlikely that even if Democrats do have the power to make big changes, which is very unlikely on big &amp; important subjects as they themselves are divided on many subjects, they wouldn’t do that when things are still very bad in the economy, and the future still looks uncertain. Things should get better before any “big tax changes” or any other “big regulation changes”. So, if the Dems win the other seat, expect volatility, that could lead to a healthy correction after a huge run or a consolidation period before the markets recovers. So, I just wouldn’t bet against the bull market that we are in right now.\n\nIn some other stock market news, we saw a report that Alibaba is [planning](https://ibb.co/s2vb2L8) to raise $5B through bonds again, following the 2014 and 2017 capital raising operation, with the company also getting downgraded at CFRA to a sell [rating](https://ibb.co/QbJwG53) while also cutting their PT from $280 to $210. I know the political factors are really pushing this stock in the wrong direction, but after all of this will pass, Alibaba is still a great company, even [without](https://ibb.co/m4x7CCs) Ant Group and despite the latest moves by trump to continue banning Chinese [APPS](https://ibb.co/X8xr9Cs), with the latest big ones being Alipay &amp; WeChat Pay. In my opinion this is a severe overreaction as long-term investing goes. Yeah, maybe in the short-term the company can go either way depending on what restrictions they get, but I really don’t think Alibaba will go bust in the long-run.\n\nYesterday we also receive auto sales number from a couple of manufacturers, with [GM](https://ibb.co/6HhqwZr) stealing the show, with Q4 sales up almost 5% year/year, as the company estimated they gained market share in both retail and fleet deliveries in 2020, while NISSAN’s [sales](https://ibb.co/gFhYd60) continued to drop, as they sold 19% less vehicles in Q4 over the last quarter, as the total sales in 2020 dropped by more than 33%, as the automaker has fallen out of flavor with outdated models and no innovative developments.\n\nMeanwhile [VW](https://ibb.co/st5S7fh) did slightly worse overall in 2020, but saw a 11% increase in sales in Q4, as this was led by a 22% increase in the total SUVs sold. The SUV trend continues to keep on getting more &amp; more meaningful and most automakers must try and compete in this highly demanded market if they do want to survive. If you do want to invest in this industry, I suggest you take a look at the product development &amp; future outlook for the company before. I think both GM &amp; Ford are going in the right direction, but you should do your own research.\n\nSo, let’s hope for a good day in the market as the [world](https://ibb.co/55PMcBq) stock markets and the US [FUTURES](https://ibb.co/bN3RK87) seem to be pointing to a mixed open, with the Dow leading the way, while the tech heavy Nasdaq is down almost 1.3% on panic selling &amp; portfolio rebalancing happening due to the possible Democratic sweep in Georgia.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "subreddit": "StockMarket",
        "title": "Stock Market News for Today | BABA | GM &amp; Other Stock Market News [01-06]",
        "url": "https://www.reddit.com/r/StockMarket/comments/krnvll/stock_market_news_for_today_baba_gm_other_stock/",
        "created": 1609968578.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610024448,
        "id": "kscsui",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Stocks go bonkers while the Dems take Georgia. The Capitol is breached. Is this the time to buy Solar, Pot &amp; Industrial stocks? Let’s talk about this and other stock market news** \n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a mixed day with the [Dow Jones](https://ibb.co/nsJ4qqL) leading the way up over 400points and closing at a new record high, with the broad stock market [SP500](https://ibb.co/kKxbFdQ) also finishing 0.57% up for the while the tech heavy [Nasdaq Composite](https://ibb.co/C7CdfX8) finished the day down 0.6%. All 3 of the big indexes were trading higher earlier in the day before the [VIX](https://ibb.co/4PR24Fc) saw a spike of more than 10% as rioters [STORMED](https://ibb.co/KjbQPkD) the US Capitol, before eventually getting back to certifying the electoral votes, which brought back some stability. This was a very bad incident but shouldn’t have long-lasting effects on the stock market.\n\nYesterday we saw almost 70% of [COMPANIES](https://ibb.co/Br0Y0hB) advancing with over 300 new highs as the volume also spiked up, as 8 of the 11 [SECTORS](https://ibb.co/FmhD70s) finished in the green with Financials, Energy and Materials gaining more than 3%, while the biggest loser was by far the tech sectors, dropping 1.7%, as we saw Large-Cap Growth companies underperforming the [MARKET](https://ibb.co/XpbdM7p), while small &amp; mid-caps, especially the value plays, outperformed the market.\n\nHere is the [HEAT MAP](https://ibb.co/WKhNSZh) from yesterday which show how Big tech companies suffered yesterday, as the perceived threat of increased [TAXES](https://ibb.co/D79SMMP) spooked the market, while the Industrials, Financials, Green Energy &amp; [POT](https://ibb.co/XZFHGvj) stocks flourished on the hope of a big stimulus with new &amp; improved regulations, as it is expected that there will be an improved legislation that will help the cannabis stocks soar and the possible big stimulus would be a huge boost to most of the [RETAIL](https://ibb.co/GfwgQ3Z) sector which saw names like Nordstrom, GameStop, Target and many others posting big moves to the upside. Joining them should be [COSTCO](https://ibb.co/pQdXm2H), which did lag yesterday, but posted terrific December numbers after hours, with comparable sales increasing more than 10% while e-commerce rose by more than 60% for the month.\n\nYesterday we also saw the [FED](https://ibb.co/mFgqXN4) deciding to continue the current QE pace, as they still see plenty of uncertainty around, especially in the first quarter of 2021. They will continue to buy $120B worth of securities every month, as well as possibly moving on to some lengthier term maturities, while being opened to even more monetary easing if necessary.\n\nIn some more good news, we saw the [Factory Orders](https://ibb.co/jRqfPf7) for November coming it at +1%, better than expected as shipments increased by 0.7%.\n\nWhile in some other not so good numbers we saw the December [PMI](https://ibb.co/7XjyFjB) slowing to 55.3, less than the 55.7 expected and 58.6 in the previous month, but this is still an indicator of expanding business activity, while ADP [numbers](https://ibb.co/kJ6jjRx) came in worse than expected, as the US lost 123K nonfarm jobs, worse than the 130K addition of jobs expected and 304K jobs gained in the previous month, as we saw a big loss of jobs in large business especially in the leisure/hospitality [SECTOR](https://ibb.co/9sCLVqY). This was the first [month](https://ibb.co/3F8Q9j0) since April when we saw a lose of jobs in the nonfarm private business. \n\n[TODAY](https://ibb.co/vsB6NM2) we have a loaded economic data calendar starting with jobless numbers early in the morning and finishing with the Fed Balance Sheet at the market close.\n\nIn some other stock market news, we saw a report that [ROBLOX](https://ibb.co/3yqfGFZ) is looking to go public via direct listing, rather the traditional IPO. The latest funding round at $45/share saw the company valued at almost $30B, which is very high but we have to see the latest books of the company before making a prediction if it will go higher or not. This may be a better opportunity for retail investors to get in at lower prices, rather than buying at 2-3 times the IPO price.\n\nSo, guys, due to the latest political developments we have seen a huge shift in the markets, as we saw yesterday the [SOLAR](https://ibb.co/KWH2wHh) stocks having spectacular gains with Sunrun, &amp; SunPower gaining more than 16% with many other companies like [ENPHASE](https://ibb.co/72jTgdq) also soring, while the hydrogen play Plug Power also [soared](https://ibb.co/xDxrq80) more than 20% in after-hours after agreeing to a collaboration with SK Group.\n\nWe also saw gambling names move up after with the Senate changing leadership and states like New York pushing for the legalization of [gambling](https://ibb.co/CPFdVpv) in most of the US.\n\nWe also saw other companies posting great numbers, with [T-Mobile](https://ibb.co/qC2rXQC) adding 5.5M customers, its best ever number as they lead the industry, while [ROKU](https://ibb.co/qxWCNg4) continued to be one of the best plays in the streaming business alongside Disney &amp; Netflix as they have surpassed 50M accounts.\n\nAnd on the industrial side we saw companies like Caterpillar and US Steel posting big gains in anticipation of an infrastructure bill that would benefit them. \n\n[Ford](https://ibb.co/yNz7PjD) also beat expectations with a decline in sales of just under 10%, better than the 14% expected as the company continues to move towards more trucks, SUVs &amp; EVs.\n\nOn the other-hand we also saw [Chinese](https://ibb.co/rbRQwyq) tech and EV stocks fall, after more bad headlines like the US looking to ban even more big companies in the US like Alibaba &amp; Tencent. This is a continuing story which has peaked up steam in the recent year after the political tensions between the US and China have increased. This companies were also joined by the big tech which continuing to face selloff pressure after the blue sweep in Georgia.\n\nMy opinion is that you should start buying some green energy, pot and industrial stocks but you shouldn’t go to heavy on the first day. You should wait for things to cool-off a little and not buy everything at the top. I think a bi-weekly split strategy or monthly strategy would be nice. Which would mean you should divide your investment money and buy especially on red days every couple of weeks or on a monthly basis, but I would avoid Chinese stocks for now at least.\n\nSo, let’s hope for a good day in the market as the [WORLD](https://ibb.co/LCv8Dp1) markets are mixed while the US [FUTURES](https://ibb.co/wghkCJ1) seem to be pointing at a good open with the Nasdaq leading the way, though in the last few days every single time the futures were up the stocks finished higher and vice-verse, when the futures were red the stocks finished higher, so you shouldn’t base your investment on this.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! \n\nHave a great day and see you next time!",
        "subreddit": "wallstreetbets",
        "title": "Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F &amp; Other Stock News [01-07]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kscsui/stock_market_news_for_today_run_enph_tlry_acb_nio/",
        "created": 1610053248.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1609939777,
        "id": "krnvlc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**What is the impact of the Georgia Election on the Stock market? Is Alibaba going to recover or is it going down? GM outperforms in 2020, let’s talk about this and other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw the stock market recovering a good part of the losses from the first trading day of 2021, as the [Nasdaq Composite](https://ibb.co/P4FW6dK) gained almost 1%, the broad stock market [SP500](https://ibb.co/Jd46zGb) rose by .71% and the [Dow Jones](https://ibb.co/Cs47MP1) finished 167 points higher. We also saw the [VIX](https://ibb.co/kH2gz8v) dropping by more than 6% after the huge spike on Monday as more than 70% of the companies were advancing [yesterday](https://ibb.co/59qrWLY) on average volume with 109 new highs. We saw 8 of the 11 [SECTORS](https://ibb.co/hFqx3Gg) finish the day in the green, lead by Energy up over 4% and Materials up over 2%, while Consumer staples finished flat and Utilities &amp; Real Estate just finished in the red.\n\nMost small &amp; mid-cap value &amp; core companies were outperforming [yesterday](https://ibb.co/dWszjdG), as large-caps did finish mostly flat.\n\nHere is the [HEAT MAP](https://ibb.co/gDLn3Bc) from yesterday which revels plenty of gains in most of the areas of the stock market, with Big Tech companies advancing moderately, while most of the Oil&amp; Gas industry finished up significantly higher alongside companies from China.\n\nThe economic data that we received yesterday was mostly positive, starting with bankruptcy fillings falling to the lowest monthly number since early 2006, continuing the trend of this year, as this number, is the [lowest](https://ibb.co/26hzbrN) we have seen since 1986, as companies have been hugely supported by fiscal and monetary policies with record-breaking capital injections.\n\nWe also saw the December ISM Manufacturing [INDEX](https://ibb.co/q73Fj2m) coming at 60.6, higher than the 56.6 expected and the 57.5 in the previous month. This was led by a growth in new orders, productions, prices index &amp; supplier deliveries, while the employment index changed direction and was in expansion territory again this month, standing at 51.5. This was the highest PMI we have seen in 2020, with December being the 7th straight month of [expansion](https://ibb.co/12gpyy2) and the biggest one of this year, with this PMI corresponding to a 5.2% increase in GDP on an annualized basis, as we also saw a 5.5% increase on a yearly basis in the latest Redbook chain store [SALES](https://ibb.co/qWjH5dJ).\n\n[TODAY](https://ibb.co/2n4jcFm) we continue to get auto sales numbers, MBA mortgage applications, ADP jobs numbers, factory orders and a final read on the PMI composite, as we also await the Georgia Runoff [ELECTION](https://ibb.co/zXyZWmR) final results, as right now one of the seats has been called by multiple media channels for the Democrats while the other one is still too tight to call.\n\nIf the Dems to sweep, this could cause an increased volatility in the markets, especially in the tech sectors as investors would probably overreact and just start selling off. This could be a good buying opportunity in my opinion, as I believe it’s very unlikely that even if Democrats do have the power to make big changes, which is very unlikely on big &amp; important subjects as they themselves are divided on many subjects, they wouldn’t do that when things are still very bad in the economy, and the future still looks uncertain. Things should get better before any “big tax changes” or any other “big regulation changes”. So, if the Dems win the other seat, expect volatility, that could lead to a healthy correction after a huge run or a consolidation period before the markets recovers. So, I just wouldn’t bet against the bull market that we are in right now.\n\nIn some other stock market news, we saw a report that Alibaba is [planning](https://ibb.co/s2vb2L8) to raise $5B through bonds again, following the 2014 and 2017 capital raising operation, with the company also getting downgraded at CFRA to a sell [rating](https://ibb.co/QbJwG53) while also cutting their PT from $280 to $210. I know the political factors are really pushing this stock in the wrong direction, but after all of this will pass, Alibaba is still a great company, even [without](https://ibb.co/m4x7CCs) Ant Group and despite the latest moves by trump to continue banning Chinese [APPS](https://ibb.co/X8xr9Cs), with the latest big ones being Alipay &amp; WeChat Pay. In my opinion this is a severe overreaction as long-term investing goes. Yeah, maybe in the short-term the company can go either way depending on what restrictions they get, but I really don’t think Alibaba will go bust in the long-run.\n\nYesterday we also receive auto sales number from a couple of manufacturers, with [GM](https://ibb.co/6HhqwZr) stealing the show, with Q4 sales up almost 5% year/year, as the company estimated they gained market share in both retail and fleet deliveries in 2020, while NISSAN’s [sales](https://ibb.co/gFhYd60) continued to drop, as they sold 19% less vehicles in Q4 over the last quarter, as the total sales in 2020 dropped by more than 33%, as the automaker has fallen out of flavor with outdated models and no innovative developments.\n\nMeanwhile [VW](https://ibb.co/st5S7fh) did slightly worse overall in 2020, but saw a 11% increase in sales in Q4, as this was led by a 22% increase in the total SUVs sold. The SUV trend continues to keep on getting more &amp; more meaningful and most automakers must try and compete in this highly demanded market if they do want to survive. If you do want to invest in this industry, I suggest you take a look at the product development &amp; future outlook for the company before. I think both GM &amp; Ford are going in the right direction, but you should do your own research.\n\nSo, let’s hope for a good day in the market as the [world](https://ibb.co/55PMcBq) stock markets and the US [FUTURES](https://ibb.co/bN3RK87) seem to be pointing to a mixed open, with the Dow leading the way, while the tech heavy Nasdaq is down almost 1.3% on panic selling &amp; portfolio rebalancing happening due to the possible Democratic sweep in Georgia.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "subreddit": "stocks",
        "title": "Stock Market News for Today | BABA | GM &amp; Other Stock Market News [01-06]",
        "url": "https://www.reddit.com/r/stocks/comments/krnvlc/stock_market_news_for_today_baba_gm_other_stock/",
        "created": 1609968577.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1609488015,
        "id": "ko7nxv",
        "num_comments": 393,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia Tuturiol](https://www.investopedia.com/university/all/fundamental-analysis/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Jan 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/ko7nxv/rstocks_daily_discussion_fundamentals_friday_jan/",
        "created": 1609516815.0
    },
    {
        "author": "Berisha11",
        "created_utc": 1609517124,
        "id": "kodn0w",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "This is my first DD so I hope it goes well.\n\nCC Neuberger Principal Holdings I (PCPL) has an agreement to merge with E2OPEN.\n\n**What is E2OPEN?**: E2OPEN is a cloud-based, artificial intelligence, on-demand SaaS platform company. E2OPEN is the largest cloud-based provider of networked supply chain applications. More than 70,000 partner companies and 200,000 users, many of the biggest companies in the world use the E2OPEN network today.\n\n**Who are E2OPEN's customers?**: Some of their customers include Google, Facebook, AMD, Nvidia, Intel, HP, IBM etc. [Complete list taken from the investor presentation.](https://i.imgur.com/FfcVX7o.png)\n\n**Who is leading the SPAC?**: The founder &amp; CEO of PLPC is Chinh Chu. A billionaire with 30+ years of investment experience, including 25 years at [Blackstone](https://en.wikipedia.org/wiki/The_Blackstone_Group). He has created 3 SPACs since 2016. The first SPAC, CF Corp, raised $1.2 billion and successfully merged with Fidelity &amp; Guaranty Life. The second SPAC, Collier Creek Holdings, raised $475 million and successfully merged with a company in the consumer sector. And now we have his most recent, third SPAC, PCPL. It has raised $414 million and will merge with E2OPEN. This man was also in charge of taking Dun &amp; Bradstreet private in a large $7.2 billion deal. Before joining Blackstone in 1990, this man also worked in the Mergers &amp; Acquisitions Deparment at Salomon Brothers. His experience is undeniable. \n\n**Backstory**: E2OPEN used to be a public company. Their stock price went as high as $28. They were bought by a private company and were taken off the market in 2015. Ever since they were taken private, E2OPEN was able to grow from $80M in revenue 5 years ago to $335M in 2020. They have acquired a handful of companies and continue to do so. E2OPEN's revenue is about four times what it was in 2015. The percent of revenue that is subscription-based, which is always a key metric for a SaaS company, was 80% in fiscal 2020 and is expected to grow in 2021. It also stands to benefit as companies automate their supply chains further in the COVID-19 pandemic.\n\n**The potential negatives:** Their estimated revenue for next year is about +10%. There was an additional funding from instutions through a private investment in public equity (PIPE) of $175M which will be used to pay down existing debt. E2OPEN traded publicly before they were acquired by another company. Their stock price went as high as $28 but also went as low as $8. They were then acquired by Insight Venture Partners and have grown since. \n\n**The Merger**: SPAC shareholders will own 20% of the shares. The merger has a valuation of $2.57B. Upon closing of the transaction with E2OPEN, the ticker will change from 'PCPL' to 'ETWO'.\n\n**TL:DR:** A cloud-based SaaS platform company with customers from some of the biggest corporations in the world today, has a definitive agreement to merge with 'PCPL'. PCPL is run by a billionaire with an unbelievable resume that has already had two previous successful SPAC mergers and this is his third SPAC. The company's revenue has grown massively and their revenue today is about four times higher than it was in 2015. The percent of their revenue that is subscription-based is 80% and is expected to grow in the future. \n\n**Disclaimer:** I own 420 shares of PCPL. Invest at your own risk. As of this writing the price of PCPL is **$10,84.**",
        "subreddit": "SPACs",
        "title": "E2OPEN, A software company with big-name customers like Microsoft, AMD, Nvidia &amp; Intel, is set to merge with CC Neuberger Principal Holdings I (PCPL)(My first DD)",
        "url": "https://www.reddit.com/r/SPACs/comments/kodn0w/e2open_a_software_company_with_bigname_customers/",
        "created": 1609545924.0
    },
    {
        "author": "Furloughedinvester",
        "created_utc": 1609565601,
        "id": "korpwk",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "I'll start. Biggest winners were AMZN +61% , TTWO +57% , AMD +56% , TSM +51% and NVDA +42%. Been a pretty amazing year for tech.\n\nBiggest losers were RKT -22% , BABA -13%, and NWARF -86% (very small position). BABA hurt the worst. Really had high hopes for that stock.\n\nOverall ended the year with a +30% portfolio so i can't complain. Aiming for a modest 10-15% growth next year. Anyone want to share their biggest hits and misses feel free.",
        "subreddit": "stocks",
        "title": "So what were your biggest winners and biggest losers of 2020?",
        "url": "https://www.reddit.com/r/stocks/comments/korpwk/so_what_were_your_biggest_winners_and_biggest/",
        "created": 1609594401.0
    },
    {
        "author": "SkykarJones",
        "created_utc": 1609569234,
        "id": "kosknf",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Ok retards I’m going to give it to you str8 you guys are truly retarded to the point that I know for a sure fact that most you are sheep who are gladly walking into the slaughter house just because a stock is cheap and someone told you to buy something.. no no this is truly a financially retarded move that cost you to blow up your account and cause your girlfriends boyfriend to fuck her right in front of you and make you pay him money for it.. look I understand GameStop had a great year but truth be told who actually made more money because of ps5 and Xbox’s? Fucking Sony, Microsoft and AMD but no you retards think it’s GameStop and failing third party vendor who clearly makes money by selling you used games at a ridiculous higher price just to make their money back... really truly retarded and you guys deserve a pat on the back for your efforts. I’m just saying do the fucking research on how the company makes money before you Hail Mary your money into nothing and then cry bout how the gay bears 🌈 🐻 fuck you everyday of course they cuz the people with a brain already got out and leaving you retards to scramble for a profit. \n\nNow if you any of you wanna tell me I belong on r/investing I want you to do me a favor.... tie a tight string around your balls in a few weeks your balls will fall off ultimately castrating yourselves.... Thank you",
        "subreddit": "wallstreetbets",
        "title": "You guys are truly retards with no finesse when it comes to the markets. $GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kosknf/you_guys_are_truly_retards_with_no_finesse_when/",
        "created": 1609598034.0
    },
    {
        "author": "SorenLantz",
        "created_utc": 1609528327,
        "id": "kogze1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "# The Metric\n\nI recently had an idea for a metric to be used to find hot stocks. I call the metric \"Price Elasticity\" and it is comprised of two numbers: upturn elasticity and downturn elasticity.\n\n* Upturn elasticity: the average % change in a stock on market up days\n* Downturn elasticity: the average % change in a stock on market down days\n\nUsing these numbers and a few additional basic requirements (like positive EPS and at least 31 days of trading history), my screener found 99 stocks out of about 5700 searched that have good to exceptional price elasticities. (the list of these stocks is linked below and also [here](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing))\n\n# What makes for good price elasticity numbers?\n\nI made two classifications for stocks with good price elasticity data.\n\n1. **Irrational** \\- Upturn elasticity &gt; 1, Downturn elasticity &lt; 0\n2. **Responsible** \\- Upturn elasticity &gt; 1, 0 &lt; Downturn elasticity &lt; 1\n\nWith any stock I want an upturn elasticity &gt; 1, meaning that the stock tends to move higher than the market when the market goes up. The \"Irrational\" classification gets its name because if a stock's downturn elasticity is negative this means the stock, on average, moves up when the market goes down. So a stock that moves higher than the market when the market goes up and also moves up when the market goes down is classified as \"Irrational\". These stocks tend to have less trading history and are very volatile.\n\nThen there are \"Responsible\" stocks which like Irrational stocks move higher than the market when the market goes up. Unlike Irrational stocks though, Responsible stocks move lower when the market moves lower. The reason I still consider them good is because their downturn elasticity is &lt;1 and &gt;0, meaning that, while they do move down with the market, they move down to a lesser degree.\n\nSome popular stocks picked up by the screener include: AMD, ADSK, ETSY, NFLX, NVDA, SHOP and TSLA. Many of the other stocks have lower market caps and could be interesting value / growth plays given they too made the cut.\n\n# Link to the 99 stocks found:\n\n[https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing)\n\n&amp;#x200B;\n\nI have no idea if there is merit to my Price Elasticity metric (or if it has already been \"invented\") but it was a fun project and the screener found some interesting stocks I would have never discovered otherwise. The validity of the metric is entirely based on the assumption that past trends indicate future performance, and for those looking to beat the market the trends of these 99 stocks should be very appealing. I made the screener using Python3 and TD Ameritrade's API. Of the stocks in that list I am currently holding AMD, CAMT, EPAM, and NLOK.",
        "subreddit": "stocks",
        "title": "My Custom Stock Screener Findings",
        "url": "https://www.reddit.com/r/stocks/comments/kogze1/my_custom_stock_screener_findings/",
        "created": 1609557127.0
    },
    {
        "author": "krey0r",
        "created_utc": 1609582523,
        "id": "kov7o1",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hey,\n\nI have been lurking on here for quite some time now and, going into 2021, I figured I'd start a thread to ask some of my questions for 2021. Maybe I will see them answered, or read suggestions / find inspiration.\n\nI started investing about three months ago and am currently invested in Vanguard All World, SAP (buying after the dip has worked out well), ICLN, Nvidia, AMD. I intend to hold all of them long-term with a hopeful profit of over 5%. Nvidia has a bit more room to grow, I hope, given their sales numbers, different tech and ARM acqusition, and I am also hoping for incredible sales numbers of AMD. \n\n I also hold GME because I am an absolute sheep idiot who bought into the hype high; I will probably sell low but am waiting for Jan 11. In the next few days, I want to buy a bit of Microsoft for 2021. Overall, I am looking for a relatively \"safe\" return of at least 5 - 10%, ideally a bit more of course. All my stock choices, however, are very tech-oriented. That is because it's the field in which I know most about the companies and their numbers, and also because they've been running well.\n\nHowever, I am very new and none of this of course means that these companies will run well in 2021. If we start seeing a return to normalcy in mid 2021, what are stocks that really benefit from that return to \"normalcy\"? I figured Salesforce could be an option because of its dip and them also probably benefiting from overall economic upturn, just like SAP. But that, again, would be tech. I read JPM and on this subreddit a lot, what would be the reasoning here? People are also mentioning Disney: is that because of Disney+ or because of reopening theme parks? \n\nSo, as you can see, I am open for suggestions. It'd be cool if you could help me out a bit! Thank you in advance. \n\nUnfortunately, I cannot invest in ARK ETFs, as none of my three European brokers offer these funds, and I am not willing to open a fourth broker account.",
        "subreddit": "stocks",
        "title": "\"Return to Normalcy\" / general Stock Suggestions - 2021",
        "url": "https://www.reddit.com/r/stocks/comments/kov7o1/return_to_normalcy_general_stock_suggestions_2021/",
        "created": 1609611323.0
    },
    {
        "author": "SportsLaughs",
        "created_utc": 1609558706,
        "id": "kopysk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Here are some random tickers\n\nI know r/wsb had their longs out since october\n\nWhat were they and how are they looking going into earnings?\n\n&amp;#x200B;\n\n \n\nHere are some earnings dates coming up - totally random bunch -\n\nFCEL 1/08  \n1/14 Blackrock  \nAMD 1/28  \nMA 1/28  \nAMZN 1/29  \nAAPL 1/29  \nCAT 1/29  \nhumana 2/03  \ncern 2/0  \nseneca 2/03  \nCRSR 2/03  \nF 2/04  \nDIS 2/04  \nTWLO 2/04  \nSONOS 2/04  \nSNAP 2/04  \nPTON 2/04  \nSTVI 2/05  \nTRNO 2/05  \nTWTR 2/09  \nCME 2/10  \nTHS 2/10  \nCHGG 2/1  \nLYFT 2/10  \nNVDA 2/11  \nROKU 2/12  \nUA 2/12  \nCRES 2/12  \nSHOP 2/12  \nSHAK 2/12  \nYETI 2/12  \nLSI 2/17\n\n[r/wsb](https://www.reddit.com/r/wsb/) had all this shit done by october, but which of your contracts are paying out?\n\nsay position and %s",
        "subreddit": "wallstreetbets",
        "title": "Earnings Season Option Longs",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kopysk/earnings_season_option_longs/",
        "created": 1609587506.0
    },
    {
        "author": "StockHeadz",
        "created_utc": 1609526444,
        "id": "kogel8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "When you take that step to [become a day trader,](https://www.stockheadslive.com/invest) you will run into situations your long term investing friends usually don’t deal with. \n\nIndividuals who are looking to to enter and exit a trade on the same day (day trade) more than 3 times a week are restricted in doing so by the Pattern Day-Trade Rule or, “PDT”. There are important exceptions to this rule that new investors should understand and consider.\n\n1. Does not apply to cash accounts\n2. Does not apply to accounts LARGER than 25k\n3. For every one account you open you get 3 day trades a week.\n\nAssuming most of us don’t have $25,000 to put into an investing account right away and opening multiple accounts can over complicate your investing, we are going to go with **opening a cash account.**\n\nA cash account in investing is a direct/non-credit account. This means you will receive no margin/funds from your [broker](https://tdameritrade.com/) to invest with on top of your initial cash balance. **There is no day trading limit on cash accounts**, keep in mind though this also means you will have to wait for your money to clear which usually takes 2-3 days from the closing date of a stock position. **Good news for options traders!** Funds from your daily option buying and selling are available the next day for you to trade with, without the PDT rule. Funds recieved from closing option contracts take less time to clear than funds recived from closing stock positions.\n\nMany traders will allocate the amount of money they will use to buy and sell options. For new traders, lets say I have $1000, I am going to put $800 in long term positions and use $200 to trade options. If I buy an AMD contact for $180, even if I sell that AMD contract right after buying it, that $180 won’t be available for me to use again until it has cleared the following morning. This is one of the many reasons why it is important for small account holders to plan their trades, ensuring they will have funds available to them for their planned entrances.\n\nThat’s it… a cash account is the best option by far for aspiring day traders.\\* make sure to Pay attention to the account type you have opened with your broker. They want everyone to open a margin account. Financially this makes the most since for them, but maybe not for you.",
        "subreddit": "stocks",
        "title": "Getting Around The PDT Rule",
        "url": "https://www.reddit.com/r/stocks/comments/kogel8/getting_around_the_pdt_rule/",
        "created": 1609555244.0
    },
    {
        "author": "simdee",
        "created_utc": 1609491331,
        "id": "ko88wv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "NET: 25%\nCRWD: 25%\nSQ: 16%\nSE: 12%\nAMD: 8%\nBEKE: 13%\n\nI'm trying to bet on growth. I like exposure to other markets, ie. Beke, SE. \nI was thinking of dumping AMD for more SE. Do you think net &amp; crwd have a better shot at running up over the next year vs sq? I'm also following ARKK on beke, if it ends up not moving in 6 months, I'll end up throwing it into some green energy stock. \n\nThoughts?\nWhere could I make improvements?",
        "subreddit": "stocks",
        "title": "Help identify growth potential in a few stocks",
        "url": "https://www.reddit.com/r/stocks/comments/ko88wv/help_identify_growth_potential_in_a_few_stocks/",
        "created": 1609520131.0
    },
    {
        "author": "StockHeadz",
        "created_utc": 1609526126,
        "id": "kogb6h",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "When you take that step to [become a day trader,](https://www.stockheadslive.com/invest) you will run into situations your long term investing friends usually don’t deal with. \n\nIndividuals who are looking to to enter and exit a trade on the same day (day trade) more than 3 times a week are restricted in doing so by the Pattern Day-Trade Rule or, “PDT”. There are important exceptions to this rule that new investors should understand and consider.\n\n1. Does not apply to cash accounts\n2. Does not apply to accounts LARGER than 25k\n3. For every one account you open you get 3 day trades a week.\n\nAssuming most of us don’t have $25,000 to put into an investing account right away and opening multiple accounts can over complicate your investing, we are going to go with **opening a cash account.**\n\nA cash account in investing is a direct/non-credit account. This means you will receive no margin/funds from your [broker](https://tdameritrade.com/) to invest with on top of your initial cash balance. **There is no day trading limit on cash accounts**, keep in mind though this also means you will have to wait for your money to clear which usually takes 2-3 days from the closing date of a stock position. **Good news for options traders!** Funds from your daily option buying and selling are available the next day for you to trade with, without the PDT rule. Funds recieved from closing option contracts take less time to clear than funds recived from closing stock positions.\n\nMany traders will allocate the amount of money they will use to buy and sell options. For new traders, lets say I have $1000, I am going to put $800 in long term positions and use $200 to trade options. If I buy an AMD contact for $180, even if I sell that AMD contract right after buying it, that $180 won’t be available for me to use again until it has cleared the following morning. This is one of the many reasons why it is important for small account holders to plan their trades, ensuring they will have funds available to them for their planned entrances.\n\nThat’s it… a cash account is the best option by far for aspiring day traders.\\* make sure to Pay attention to the account type you have opened with your broker. They want everyone to open a margin account. Financially this makes the most since for them, but maybe not for you.",
        "subreddit": "investing",
        "title": "Getting Around The PDT Rule",
        "url": "https://www.reddit.com/r/investing/comments/kogb6h/getting_around_the_pdt_rule/",
        "created": 1609554926.0
    },
    {
        "author": "rascalscooters",
        "created_utc": 1609557593,
        "id": "kopo5y",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "https://www.slickcharts.com/nasdaq100\n\nA couple months ago, Zoom's market cap was ~130 billion, AMD's was ~100 billion, and AMD still had a larger weighting than Zoom! Why is this? The NDX-100 is clearly capitalization weighted, but where can I find the rules surrounding the exceptions?",
        "subreddit": "stocks",
        "title": "Why does Zoom have approximately the same market cap as AMD but only about half the weight in the Nasdaq-100?",
        "url": "https://www.reddit.com/r/stocks/comments/kopo5y/why_does_zoom_have_approximately_the_same_market/",
        "created": 1609586393.0
    },
    {
        "author": "SportsLaughs",
        "created_utc": 1609552009,
        "id": "koo4za",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Here are some earnings dates coming up - totally random bunch - \n\n&amp;#x200B;\n\n FCEL 1/08  \n 1/14 Blackrock  \n LGI 1/19  \n AMD 1/28  \n MA 1/28  \n AMZN 1/29  \n AAPL 1/29  \n CAT 1/29  \n humana 2/03   \ncern 2/0  \n seneca 2/03  \n CRSR 2/03  \n F 2/04  \n DIS 2/04  \n TWLO 2/04  \n SONOS 2/04  \n SNAP 2/04  \n PTON 2/04  \n STVI 2/05  \n TRNO 2/05  \n TWTR 2/09  \n CME 2/10  \n THS 2/10  \n CHGG 2/1  \n LYFT 2/10  \n NVDA 2/11  \n ROKU 2/12  \n UA 2/12  \n CRES 2/12  \n SHOP 2/12  \n SHAK 2/12  \n YETI 2/12  \n LSI 2/17\n\n&amp;#x200B;\n\nr/wsb had all this shit done by october, but which of your contracts are paying out? \n\nsay position and %s",
        "subreddit": "wallstreetbets",
        "title": "Earnings Date Longs Ideas",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/koo4za/earnings_date_longs_ideas/",
        "created": 1609580809.0
    },
    {
        "author": "Furloughedinvester",
        "created_utc": 1609564839,
        "id": "korjdr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I'll start. My biggest winners were AMZN +61% ,  TTWO +57% , AMD +56% , TSM +51% , and NVDA +43%.\n\nBiggest lovers were RKT -22% and BABA -13%. BABA hurt the worst. I had very high hopes for that stock. I played a few meme stocks towards the end of the year. Had mixed results. Otherwise all bluechips and etfs.\n\nOverall portfolios up 30% so I had a great year. My goal is to maintain a modest 12% growth next year. Anyone want to share their winners and lovers feel free",
        "subreddit": "stocks",
        "title": "So what were you're biggest winners and biggest lovers of 2021?",
        "url": "https://www.reddit.com/r/stocks/comments/korjdr/so_what_were_youre_biggest_winners_and_biggest/",
        "created": 1609593639.0
    }
]