[
    {
        "author": "Brothanogood",
        "created_utc": 1604340141,
        "id": "jmsln8",
        "num_comments": 186,
        "num_crossposts": 0,
        "selftext": "Apple announced on Monday an event for Nov. 10 where it’s expected to announce new Macs.\n\nApple said earlier this year that it planned to release Mac computers with its own Apple-designed chips based on ARM, instead of Intel processors. Apple’s iPhones and iPads have long used Apple-designed processors, which the company says helps extend battery life and provide faster performance.\n\nApple could launch a iMac desktop with a new design and laptops using Apple chips, according to a research note from TF Securities analyst Ming-Chi Kuo published earlier this year.\n\nMac sales have been a highlight for Apple during the pandemic. In the quarter ending in June, Apple reported $9 billion in Mac sales, which was up 28% year-over-year.\n\n[Source](https://www.cnbc.com/2020/11/02/apple-announces-event-for-nov-10-where-new-macs-with-apple-chips-expected.html)",
        "subreddit": "stocks",
        "title": "Apple announces event for Nov. 10 where new Macs with Apple chips expected",
        "url": "https://www.reddit.com/r/stocks/comments/jmsln8/apple_announces_event_for_nov_10_where_new_macs/",
        "created": 1604368941.0
    },
    {
        "author": "birdy10007",
        "created_utc": 1604292207,
        "id": "jmh8m5",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I’m very worried I just bought a shit tone on the dip on Friday.\n\nTesla\nApple\nFacebook\nMicrosoft \nAMD\nINTC",
        "subreddit": "wallstreetbets",
        "title": "Do you guys think trump can still win the election.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmh8m5/do_you_guys_think_trump_can_still_win_the_election/",
        "created": 1604321007.0
    },
    {
        "author": "6ixSwings",
        "created_utc": 1604292020,
        "id": "jmh73z",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "title says it all. markets were pumped obnoxiously throughout the few months or so. my portfolio is eating shit. my calls vanishing in thin air. i want to hedge. regardless the winner and whoever they air on the news, I see the markets reacting, in a negative way. just like covid, when officially aired on the news, the markets reacted. here's my problem. i don't know which markets that will react to the news. for covid, it was the travel sector. not sure where my post is, but i bet roughly 3.7k on airlines and cruise line puts (RCL DAL UAL CCL) which accumulated to roughly 40k. that was my only win and lost it all. the first one is free and now I fully understand what that means. i followed some autist named wsbgod during the travel sector puts and now he has been banished. intel on stocks here on wsb has been pretty limited and disappointing throughout the last months or years for some of you. i learned a lot about options back during phase 1 covid days. im trying to duplicate that this week but not with covid news, but with what's happening in america this coming week.  the travel sector was given due to lockdowns and restrictions DUE to covid. now what markets will get affected DUE to the winner of the elections. \n\ntl;dr i need ticker symbols for puts IF markets reacts in a negative way to the election winner. let's just get rich. im tired of losing. just dead out tired. need a couple W's you fucking retards",
        "subreddit": "wallstreetbets",
        "title": "If Biden or Trump wins, how will markets react? and what puts are you buying?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmh73z/if_biden_or_trump_wins_how_will_markets_react_and/",
        "created": 1604320820.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1604351118,
        "id": "jmw6mo",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, November 2, 2020**\n\nStocks opened today’s session higher before paring some gains ahead of an extremely busy week, with market participants closely monitoring the results of the US presidential election, a meeting of the Federal Reserve, and the October jobs report, and rising coronavirus numbers in the US and Europe.\n\nAfter an extremely choppy day, the Nasdaq (QQQ) finished 0.22% up, the S&amp;P 500 (SPY) finished 1.11% up, and the Dow Jones (DIA) performed the best, finishing 1.56% up.\n\nOn Tuesday is the US presidential election between incumbent Donald Trump and Democrat Joe Biden. Needless to say, given the political divide, the coronavirus pandemic, and social unrest that exists in the United States right now, the outcome of this election will be extremely significant. According to a study done by Edward Jones, since 1932, the stock market has dipped 64% percent of the time the day after a presidential election. This likely reflects anxiety about the future if a large cohort of the population is unhappy with the election result. Regardless of the election result,  it's likely a large section of the population will be unhappy. Moreover, given the surge of early and mail-in ballots due to the pandemic, the possibility exists that the outcome may not be clear after Tuesday. This scenario would certainly cause a massive spike in volatility and uncertainty in the markets. According to the US Elections Project at the University of Florida, as of Friday of last week, around 85 million individuals have cast their ballots, over half of the total turnout in 2016. If this pace picks up, this election could have the highest voter participation rate in over 100 years.\n\nRegardless of the outcome, the election will have a number of consequences for Corporate America. For example, a change in the political control in either the Senate or the White House (which are Republican-controlled right now) could potentially alter corporate tax rates, increase or decrease regulation in some industries, affect trade relations with other countries, and changes in capital gains tax, which is important for market participants. Moreover, the outcome of the election will likely influence the timing and size of much-needed additional fiscal stimulus \n\nThe Federal Open Market Committee (FOMC) is set to hold the first of its two-day rate-setting meeting the day after Election Day, with the twelve FOMC meeting Wednesday and monetary policy statement and press conference from Federal Reserve Chair Jerome Powell on Thursday. Going off previous meetings, the Fed is virtually guaranteed to keep interest rates, near zero. After their last meeting in September, the Fed signaled that it would maintain interest rates are current levels until “at least 2023”. Throughout these meetings, FOMC members, including Powell, have increasingly escalated their calls for further fiscal stimulus to complement the Fed’s monetary support. In early October, Powell said, “too little support would lead to a weak recovery, creating unnecessary hardships for households and businesses.”\n\nOn Friday, the Department of Labor is set to release the October job report, a crucial piece of data to understand the state of the labor market and gauge the pace of recovery. According to Bloomberg consensus data, non-farm payrolls are expected to increase by around 600,000. While this estimate would the sixth month of net payroll gains, it would also be the four, straight month of deceleration, indicating the pace of recovery is slowing. The unemployment rate is also predicted to tick lower, from 7.9% to 7.6%. However, worryingly, there appears to be a trend towards long-term unemployment for many Americans. The number of individuals filing continuing claims, people filing for unemployment benefits who have already filed an initial claim, has continued to increase the past several weeks. This means that people who lost their job due to the pandemic are having an increasing harder time finding new employment quickly.\n\nThe US just set a new record for the highest seven-day average of daily new cases: 81,336 as of Sunday. That's the first time the number has ever topped 80,000, according to data from Johns Hopkins University. new cases are far exceeding new testing. Over the past week, new cases have increased 18%, according to Johns Hopkins. But the number of new tests performed has increased only 4.29%, according to the Covid Tracking Project. \n\nLast week, Europe recorded around 1.5 million new cases of coronavirus, a new record, according to data from Johns Hopkins. Trends are worrying across the continent now, including in countries such as Greece and the Czech Republic, where infection rates had been low until recently. Measures are tightening up everywhere. England, in response to the surge, announced a nationwide lockdown for at least the next four weeks.\n\n**Highlights**\n\n* Apple (AAPL) announced on Monday an event for Nov. 10 where it’s expected to announce new Macs that are powered by their own chips powered by ARM processors, instead of the Intel chips it had been using. Could impact Nvidia (NVDA) stock, which owns ARM chips, and Intel, who has not been doing very well lately, judging from last earnings report and stock price action (INTC).\n* Images for the updated Tesla Cybertruck could come next Musk, according to CEO Elon Musk.\n* Chinese electric vehicle maker NIO announced its October deliveries, and the number has shares on the move, again. NIO delivered 5,055 vehicles in October, doubling from a year ago. The result is doubly impressive because NIO very recently raised its manufacturing capacity to 5,000 vehicles a month. The company is selling all the cars it can make. This stock is an absolute monster and is one we love at PsychoTrader!\n* Alibaba (BABA), is doubling its Singles’ Day offerings this year, running the massive online sales event across two periods rather than one. Alibaba says it expanded the shopping window for Singles’ Day to provide more relief for merchants that have been hit hard by the pandemic. Single’s day is a counter to Valentine’s Day that celebrates being single. Normally it’s held on Nov 11. This is the world’s largest shopping festival. According to Fortune Magazine, BABA shipped $38.4 billion in gross merchandise value on Singles’ Day last year. Amazon’s Prime Day, by comparison, sold around $6 billion in goods last year.\n* Asian shares were mostly higher on Monday buoyed by further signs of recovery in China's manufacturing sector. The Caixin manufacturing PMI, a major indicator for China's manufacturing sector, rose in October, showing that domestic demand is holding up, reports said over the weekend.\n* Allegiant Travel (ALGT) upgraded by Morgan Stanley (MS) to $175 OVERWEIGHT. Stock currently around $131\n* Alibaba (BABA) target raised by Keycorp from $330 to $350 OVERWEIGHT. Stock currently around $310\n* ChampionX (CHX) target raised by Barclays from $16 to $19 OUTPERFORM. Notable because stock currently around $9\n* Carvana (CVNA) target raised by Morgan Stanley (MS) from $215 to $225. Stock currently around $190.\n* Floor &amp; Decor (FND) target raised by Raymond James from $75 to $100. Stock currently around $75.\n* Alphabet (GOOG, $GOOGL) target rasied by Argus from $1620 to $1850 at BUY. Stock currently around $1650.\n* Cloudfare (NET) target raised by two notable institutions. Stock currently around $53.\n   * Royal Bank of Canada frm $50 to $55 OUTPERFROM \n   * Oppenheimer from $55 to $65 OUTPERFORM \n* Peleton (PTON) target raised by Needham from $110 to $125 at BUY. Stock currently around $115. \n* Paypal (PYPL) target raised by Morgan Stanley (MS) from $210 to $229 at OUTPERFORM. Stock currently around $192.\n* Solaredge (SEDG) with massive target increase by Roth Capital from $191 to $300 at BUY. Stock currently around $266.\n* Vipshop (VIPS) target raised by Keycorp from $22 to $24 at OUTPERFORM. Stock currently around $21. This is one we have been looking at for a while\n\n\"Strive not to be a success, but rather to be of value.\" –Albert Einstein",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, November 2, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/jmw6mo/here_is_a_market_recap_for_today_monday_november/",
        "created": 1604379918.0
    },
    {
        "author": "hugosilvarocha",
        "created_utc": 1604310139,
        "id": "jmkmcv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi, here some heads up for this week, we have 5 great stocks with ex-dividend date this week on the 05/11/2020.\n\n$MET - MetLife Inc with dividend yield of 4.49% and $0.46 pay per stock\n\n$BP - BP Plc with dividend yield of 12.16% and $0.31 pay per stock\n\n$CIT - CIT Group Inc with dividend yield of 4.90% and $0.35 pay per stock\n\n$PFE - Pfizer Inc with dividend yield of 4.06% and $0.38 pay per stock\n\n$INTC - Intel Corp with dividend yield of 2.86% and $0.33 pay per stock\n\nDon't forget to check this week video: [https://youtu.be/W1Vb95kIDlA](https://youtu.be/W1Vb95kIDlA)",
        "subreddit": "StockMarket",
        "title": "Best stocks with ex-dividend date this week.",
        "url": "https://www.reddit.com/r/StockMarket/comments/jmkmcv/best_stocks_with_exdividend_date_this_week/",
        "created": 1604338939.0
    },
    {
        "author": "esInvests",
        "created_utc": 1604285451,
        "id": "jmfmyi",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "October was a productive month while maintaining limited exposure into the end. Primary core products were IWM and QQQ. Speculative trade products were NFLX, ABBV, PFE, INTC, MOS, and / GC. Primary strategy (shocker) short puts. I also traded long calls, long call diagonals, and short calls. \n\nGoing into November, I will be managing a handful of trades that are threatened from the recent downmoves and positioning to take long stock on the short calls if there is a continued downmove. Otherwise, I will modulate risk keeping smaller exposure into the end of the year. I am ahead of my return schedule and have limited incentive to take unnecessary risk. \n\nI'm also looking to build out my veteran one on one schedule for November so if you are or know any veterans that would be interested in a 45min one on one session with me, drop me a line in the GForm below. If there's anything that anyone would like to see me cover, drop it in the GForm below. \n\nHow did everyone else make out in October? What would you have done differently? \n\nVideo review: [https://youtu.be/BYCZklqdMHg](https://youtu.be/BYCZklqdMHg)  \nGForm (no personal info required): [https://forms.gle/Ge5tEgzKjmfYj3SUA](https://forms.gle/Ge5tEgzKjmfYj3SUA)\n\n\\-Erik",
        "subreddit": "options",
        "title": "October Performance Review - 106% ROIC | 3.6% ROC",
        "url": "https://www.reddit.com/r/options/comments/jmfmyi/october_performance_review_106_roic_36_roc/",
        "created": 1604314251.0
    },
    {
        "author": "esInvests",
        "created_utc": 1604285496,
        "id": "jmfndh",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "October was a productive month while maintaining limited exposure into the end. Primary core products were IWM and QQQ. Speculative trade products were NFLX, ABBV, PFE, INTC, MOS, and / GC. Primary strategy (shocker) short puts. I also traded long calls, long call diagonals, and short calls. \n\nGoing into November, I will be managing a handful of trades that are threatened from the recent downmoves and positioning to take long stock on the short calls if there is a continued downmove. Otherwise, I will modulate risk keeping smaller exposure into the end of the year. I am ahead of my return schedule and have limited incentive to take unnecessary risk. \n\nI'm also looking to build out my veteran one on one schedule for November so if you are or know any veterans that would be interested in a 45min one on one session with me, drop me a line in the GForm below. If there's anything that anyone would like to see me cover, drop it in the GForm below. \n\nHow did everyone else make out in October? What would you have done differently? \n\nVideo review: [https://youtu.be/BYCZklqdMHg](https://youtu.be/BYCZklqdMHg)  \nGForm (no personal info required): [https://forms.gle/Ge5tEgzKjmfYj3SUA](https://forms.gle/Ge5tEgzKjmfYj3SUA)\n\n\\-Erik",
        "subreddit": "pennystocks",
        "title": "October Performance Review - 106% ROIC | 3.6% ROC",
        "url": "https://www.reddit.com/r/pennystocks/comments/jmfndh/october_performance_review_106_roic_36_roc/",
        "created": 1604314296.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1604340141,
        "id": "jmsln8",
        "num_comments": 186,
        "num_crossposts": 0,
        "selftext": "Apple announced on Monday an event for Nov. 10 where it’s expected to announce new Macs.\n\nApple said earlier this year that it planned to release Mac computers with its own Apple-designed chips based on ARM, instead of Intel processors. Apple’s iPhones and iPads have long used Apple-designed processors, which the company says helps extend battery life and provide faster performance.\n\nApple could launch a iMac desktop with a new design and laptops using Apple chips, according to a research note from TF Securities analyst Ming-Chi Kuo published earlier this year.\n\nMac sales have been a highlight for Apple during the pandemic. In the quarter ending in June, Apple reported $9 billion in Mac sales, which was up 28% year-over-year.\n\n[Source](https://www.cnbc.com/2020/11/02/apple-announces-event-for-nov-10-where-new-macs-with-apple-chips-expected.html)",
        "subreddit": "stocks",
        "title": "Apple announces event for Nov. 10 where new Macs with Apple chips expected",
        "url": "https://www.reddit.com/r/stocks/comments/jmsln8/apple_announces_event_for_nov_10_where_new_macs/",
        "created": 1604368941.0
    },
    {
        "author": "birdy10007",
        "created_utc": 1604292207,
        "id": "jmh8m5",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "I’m very worried I just bought a shit tone on the dip on Friday.\n\nTesla\nApple\nFacebook\nMicrosoft \nAMD\nINTC",
        "subreddit": "wallstreetbets",
        "title": "Do you guys think trump can still win the election.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmh8m5/do_you_guys_think_trump_can_still_win_the_election/",
        "created": 1604321007.0
    },
    {
        "author": "hhh888hhhh",
        "created_utc": 1604379743,
        "id": "jn4bkd",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "This can’t be good news for [INTC](https://www.bloomberg.com/news/articles/2020-11-02/apple-to-hold-nov-10-event-to-announce-macs-with-own-chips) \n“The change highlights a crisis engulfing the world’s largest chipmaker. It has delayed a new manufacturing process, giving rivals a chance to catch up. These problems are at least partly behind Apple’s decision to move to in-house chips, although the company has been steadily shifting to this approach for years.”\n\nI was about to buy INTC at it’s current 52 week low price, but now I no longer know what to do. If it goes lower, 35$ looks like the next support.",
        "subreddit": "investing",
        "title": "Apple Inc.’s 15-year relationship with Intel Corp. will officially begin to unwind next week when new Mac computers are revealed.",
        "url": "https://www.reddit.com/r/investing/comments/jn4bkd/apple_incs_15year_relationship_with_intel_corp/",
        "created": 1604408543.0
    },
    {
        "author": "6ixSwings",
        "created_utc": 1604292020,
        "id": "jmh73z",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "title says it all. markets were pumped obnoxiously throughout the few months or so. my portfolio is eating shit. my calls vanishing in thin air. i want to hedge. regardless the winner and whoever they air on the news, I see the markets reacting, in a negative way. just like covid, when officially aired on the news, the markets reacted. here's my problem. i don't know which markets that will react to the news. for covid, it was the travel sector. not sure where my post is, but i bet roughly 3.7k on airlines and cruise line puts (RCL DAL UAL CCL) which accumulated to roughly 40k. that was my only win and lost it all. the first one is free and now I fully understand what that means. i followed some autist named wsbgod during the travel sector puts and now he has been banished. intel on stocks here on wsb has been pretty limited and disappointing throughout the last months or years for some of you. i learned a lot about options back during phase 1 covid days. im trying to duplicate that this week but not with covid news, but with what's happening in america this coming week.  the travel sector was given due to lockdowns and restrictions DUE to covid. now what markets will get affected DUE to the winner of the elections. \n\ntl;dr i need ticker symbols for puts IF markets reacts in a negative way to the election winner. let's just get rich. im tired of losing. just dead out tired. need a couple W's you fucking retards",
        "subreddit": "wallstreetbets",
        "title": "If Biden or Trump wins, how will markets react? and what puts are you buying?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jmh73z/if_biden_or_trump_wins_how_will_markets_react_and/",
        "created": 1604320820.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1604351118,
        "id": "jmw6mo",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, November 2, 2020**\n\nStocks opened today’s session higher before paring some gains ahead of an extremely busy week, with market participants closely monitoring the results of the US presidential election, a meeting of the Federal Reserve, and the October jobs report, and rising coronavirus numbers in the US and Europe.\n\nAfter an extremely choppy day, the Nasdaq (QQQ) finished 0.22% up, the S&amp;P 500 (SPY) finished 1.11% up, and the Dow Jones (DIA) performed the best, finishing 1.56% up.\n\nOn Tuesday is the US presidential election between incumbent Donald Trump and Democrat Joe Biden. Needless to say, given the political divide, the coronavirus pandemic, and social unrest that exists in the United States right now, the outcome of this election will be extremely significant. According to a study done by Edward Jones, since 1932, the stock market has dipped 64% percent of the time the day after a presidential election. This likely reflects anxiety about the future if a large cohort of the population is unhappy with the election result. Regardless of the election result,  it's likely a large section of the population will be unhappy. Moreover, given the surge of early and mail-in ballots due to the pandemic, the possibility exists that the outcome may not be clear after Tuesday. This scenario would certainly cause a massive spike in volatility and uncertainty in the markets. According to the US Elections Project at the University of Florida, as of Friday of last week, around 85 million individuals have cast their ballots, over half of the total turnout in 2016. If this pace picks up, this election could have the highest voter participation rate in over 100 years.\n\nRegardless of the outcome, the election will have a number of consequences for Corporate America. For example, a change in the political control in either the Senate or the White House (which are Republican-controlled right now) could potentially alter corporate tax rates, increase or decrease regulation in some industries, affect trade relations with other countries, and changes in capital gains tax, which is important for market participants. Moreover, the outcome of the election will likely influence the timing and size of much-needed additional fiscal stimulus \n\nThe Federal Open Market Committee (FOMC) is set to hold the first of its two-day rate-setting meeting the day after Election Day, with the twelve FOMC meeting Wednesday and monetary policy statement and press conference from Federal Reserve Chair Jerome Powell on Thursday. Going off previous meetings, the Fed is virtually guaranteed to keep interest rates, near zero. After their last meeting in September, the Fed signaled that it would maintain interest rates are current levels until “at least 2023”. Throughout these meetings, FOMC members, including Powell, have increasingly escalated their calls for further fiscal stimulus to complement the Fed’s monetary support. In early October, Powell said, “too little support would lead to a weak recovery, creating unnecessary hardships for households and businesses.”\n\nOn Friday, the Department of Labor is set to release the October job report, a crucial piece of data to understand the state of the labor market and gauge the pace of recovery. According to Bloomberg consensus data, non-farm payrolls are expected to increase by around 600,000. While this estimate would the sixth month of net payroll gains, it would also be the four, straight month of deceleration, indicating the pace of recovery is slowing. The unemployment rate is also predicted to tick lower, from 7.9% to 7.6%. However, worryingly, there appears to be a trend towards long-term unemployment for many Americans. The number of individuals filing continuing claims, people filing for unemployment benefits who have already filed an initial claim, has continued to increase the past several weeks. This means that people who lost their job due to the pandemic are having an increasing harder time finding new employment quickly.\n\nThe US just set a new record for the highest seven-day average of daily new cases: 81,336 as of Sunday. That's the first time the number has ever topped 80,000, according to data from Johns Hopkins University. new cases are far exceeding new testing. Over the past week, new cases have increased 18%, according to Johns Hopkins. But the number of new tests performed has increased only 4.29%, according to the Covid Tracking Project. \n\nLast week, Europe recorded around 1.5 million new cases of coronavirus, a new record, according to data from Johns Hopkins. Trends are worrying across the continent now, including in countries such as Greece and the Czech Republic, where infection rates had been low until recently. Measures are tightening up everywhere. England, in response to the surge, announced a nationwide lockdown for at least the next four weeks.\n\n**Highlights**\n\n* Apple (AAPL) announced on Monday an event for Nov. 10 where it’s expected to announce new Macs that are powered by their own chips powered by ARM processors, instead of the Intel chips it had been using. Could impact Nvidia (NVDA) stock, which owns ARM chips, and Intel, who has not been doing very well lately, judging from last earnings report and stock price action (INTC).\n* Images for the updated Tesla Cybertruck could come next Musk, according to CEO Elon Musk.\n* Chinese electric vehicle maker NIO announced its October deliveries, and the number has shares on the move, again. NIO delivered 5,055 vehicles in October, doubling from a year ago. The result is doubly impressive because NIO very recently raised its manufacturing capacity to 5,000 vehicles a month. The company is selling all the cars it can make. This stock is an absolute monster and is one we love at PsychoTrader!\n* Alibaba (BABA), is doubling its Singles’ Day offerings this year, running the massive online sales event across two periods rather than one. Alibaba says it expanded the shopping window for Singles’ Day to provide more relief for merchants that have been hit hard by the pandemic. Single’s day is a counter to Valentine’s Day that celebrates being single. Normally it’s held on Nov 11. This is the world’s largest shopping festival. According to Fortune Magazine, BABA shipped $38.4 billion in gross merchandise value on Singles’ Day last year. Amazon’s Prime Day, by comparison, sold around $6 billion in goods last year.\n* Asian shares were mostly higher on Monday buoyed by further signs of recovery in China's manufacturing sector. The Caixin manufacturing PMI, a major indicator for China's manufacturing sector, rose in October, showing that domestic demand is holding up, reports said over the weekend.\n* Allegiant Travel (ALGT) upgraded by Morgan Stanley (MS) to $175 OVERWEIGHT. Stock currently around $131\n* Alibaba (BABA) target raised by Keycorp from $330 to $350 OVERWEIGHT. Stock currently around $310\n* ChampionX (CHX) target raised by Barclays from $16 to $19 OUTPERFORM. Notable because stock currently around $9\n* Carvana (CVNA) target raised by Morgan Stanley (MS) from $215 to $225. Stock currently around $190.\n* Floor &amp; Decor (FND) target raised by Raymond James from $75 to $100. Stock currently around $75.\n* Alphabet (GOOG, $GOOGL) target rasied by Argus from $1620 to $1850 at BUY. Stock currently around $1650.\n* Cloudfare (NET) target raised by two notable institutions. Stock currently around $53.\n   * Royal Bank of Canada frm $50 to $55 OUTPERFROM \n   * Oppenheimer from $55 to $65 OUTPERFORM \n* Peleton (PTON) target raised by Needham from $110 to $125 at BUY. Stock currently around $115. \n* Paypal (PYPL) target raised by Morgan Stanley (MS) from $210 to $229 at OUTPERFORM. Stock currently around $192.\n* Solaredge (SEDG) with massive target increase by Roth Capital from $191 to $300 at BUY. Stock currently around $266.\n* Vipshop (VIPS) target raised by Keycorp from $22 to $24 at OUTPERFORM. Stock currently around $21. This is one we have been looking at for a while\n\n\"Strive not to be a success, but rather to be of value.\" –Albert Einstein",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, November 2, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/jmw6mo/here_is_a_market_recap_for_today_monday_november/",
        "created": 1604379918.0
    },
    {
        "author": "hugosilvarocha",
        "created_utc": 1604310139,
        "id": "jmkmcv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi, here some heads up for this week, we have 5 great stocks with ex-dividend date this week on the 05/11/2020.\n\n$MET - MetLife Inc with dividend yield of 4.49% and $0.46 pay per stock\n\n$BP - BP Plc with dividend yield of 12.16% and $0.31 pay per stock\n\n$CIT - CIT Group Inc with dividend yield of 4.90% and $0.35 pay per stock\n\n$PFE - Pfizer Inc with dividend yield of 4.06% and $0.38 pay per stock\n\n$INTC - Intel Corp with dividend yield of 2.86% and $0.33 pay per stock\n\nDon't forget to check this week video: [https://youtu.be/W1Vb95kIDlA](https://youtu.be/W1Vb95kIDlA)",
        "subreddit": "StockMarket",
        "title": "Best stocks with ex-dividend date this week.",
        "url": "https://www.reddit.com/r/StockMarket/comments/jmkmcv/best_stocks_with_exdividend_date_this_week/",
        "created": 1604338939.0
    },
    {
        "author": "esInvests",
        "created_utc": 1604285451,
        "id": "jmfmyi",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "October was a productive month while maintaining limited exposure into the end. Primary core products were IWM and QQQ. Speculative trade products were NFLX, ABBV, PFE, INTC, MOS, and / GC. Primary strategy (shocker) short puts. I also traded long calls, long call diagonals, and short calls. \n\nGoing into November, I will be managing a handful of trades that are threatened from the recent downmoves and positioning to take long stock on the short calls if there is a continued downmove. Otherwise, I will modulate risk keeping smaller exposure into the end of the year. I am ahead of my return schedule and have limited incentive to take unnecessary risk. \n\nI'm also looking to build out my veteran one on one schedule for November so if you are or know any veterans that would be interested in a 45min one on one session with me, drop me a line in the GForm below. If there's anything that anyone would like to see me cover, drop it in the GForm below. \n\nHow did everyone else make out in October? What would you have done differently? \n\nVideo review: [https://youtu.be/BYCZklqdMHg](https://youtu.be/BYCZklqdMHg)  \nGForm (no personal info required): [https://forms.gle/Ge5tEgzKjmfYj3SUA](https://forms.gle/Ge5tEgzKjmfYj3SUA)\n\n\\-Erik",
        "subreddit": "options",
        "title": "October Performance Review - 106% ROIC | 3.6% ROC",
        "url": "https://www.reddit.com/r/options/comments/jmfmyi/october_performance_review_106_roic_36_roc/",
        "created": 1604314251.0
    },
    {
        "author": "esInvests",
        "created_utc": 1604285496,
        "id": "jmfndh",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "October was a productive month while maintaining limited exposure into the end. Primary core products were IWM and QQQ. Speculative trade products were NFLX, ABBV, PFE, INTC, MOS, and / GC. Primary strategy (shocker) short puts. I also traded long calls, long call diagonals, and short calls. \n\nGoing into November, I will be managing a handful of trades that are threatened from the recent downmoves and positioning to take long stock on the short calls if there is a continued downmove. Otherwise, I will modulate risk keeping smaller exposure into the end of the year. I am ahead of my return schedule and have limited incentive to take unnecessary risk. \n\nI'm also looking to build out my veteran one on one schedule for November so if you are or know any veterans that would be interested in a 45min one on one session with me, drop me a line in the GForm below. If there's anything that anyone would like to see me cover, drop it in the GForm below. \n\nHow did everyone else make out in October? What would you have done differently? \n\nVideo review: [https://youtu.be/BYCZklqdMHg](https://youtu.be/BYCZklqdMHg)  \nGForm (no personal info required): [https://forms.gle/Ge5tEgzKjmfYj3SUA](https://forms.gle/Ge5tEgzKjmfYj3SUA)\n\n\\-Erik",
        "subreddit": "pennystocks",
        "title": "October Performance Review - 106% ROIC | 3.6% ROC",
        "url": "https://www.reddit.com/r/pennystocks/comments/jmfndh/october_performance_review_106_roic_36_roc/",
        "created": 1604314296.0
    }
]