[
    {
        "author": "DeepFuckingValue",
        "created_utc": 1598904884,
        "id": "ik5mvp",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO month-end update — Aug 2020",
        "url": "https://i.redd.it/k5ru4uvjaek51.png",
        "created": 1598933684.0
    },
    {
        "author": "farting_tomato",
        "created_utc": 1597612865,
        "id": "ib0pdh",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": " [https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter](https://www.zerohedge.com/markets/what-hedge-funds-bought-and-sold-second-quarter)\n\nTL;DR\n\nADAGE CAPITAL PARTNERS\n\n* Top new buys: RPRX, ABBV, W, HZNP, FIVE, ST, CCK, TRV, USB, JCI\n* Top exits: BMY, GILD, ETN, PNC, MAS, EXC, AON, CCMP, NI, CX\n* Boosted stakes in: BURL, PYPL, FTV, ITT, LOW, GOOGL, TMUS, EYE, AZO, BMRN\n* Cut stakes in: LMT, JNJ, PFE, HON, VZ, VRTX, TGT, VMC, PXD, LLY\n\nAPPALOOSA\n\n* Top new buys: T, V, MA, PYPL, DIS, SYY, EMR, MO, SQ, TEN\n* Top exits: INTEQ, XLU, BKLN\n* Boosted stakes in: TMUS, BABA, MU, HCA, MSFT, BSX, TWTR, WFC, CRM, GT\n* Cut stakes in: PCG, UNH, TSLA, HUM, VST, AMLP, AVGO, NFLX, QCOM, ADBE\n\nBALYASNY ASSET MANAGEMENT\n\n* Top new buys: SCHW, ABT, TGT, HD, ADBE, SHOP, ITW, COST, C\n* Top exits: JCI, AMTD, INTC, CHTR, KR, TMUS, TTWO, NVDA, ICE, ROST\n* Boosted stakes in: PYPL, FISV, BABA, JPM, FLT, NSC, LITE, DKS, QCOM, LHX\n* Cut stakes in: BSX, LOW, DG, FIS, ABBV, BAX, INTU, JD, BK, ETFC\n\nBAUPOST GROUP\n\n* Top new buys: HCA, VRNT, VTR, SSNC\n* Top exits: LNG, ET, XPO, SPR, CARS\n* Boosted stakes in: LBTYK, TBIO, QRVO, ATRA, HDS\n* Cut stakes in: FB, GOOG, PCG, UNVR, ABC, HPQ, CLNY, VIST, AKBA\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: GOLD\n* Top exits: DAL, LUV, UAL, AAL, QSR, GS, OXY\n* Boosted stakes in: STOR, KR, SU\n* Cut stakes in: WFC, JPM, SIRI, PNC, MTB, BK, MA, V, CHTR, USB\n\nBRIDGEWATER ASSOCIATES\n\n* Top new buys: UPS, ZLAB, CSX, ECL, TT, RNG, PAYC, ROP, GWW, FICO\n* Top exits: TLT, HYG, EMB, RY, TD, TIP, CNI, BNS, TRP, BCE\n* Boosted stakes in: SPY, GLD, IVV, FXI, BABA, MCHI, IAU, JD, PDD, VEA\n* Cut stakes in: EWZ, LQD, INDA, EWY, EEM, IEMG, VWO, EWW, BAM, EWT\n\nCOATUE MANAGEMENT\n\n* Top new buys: BA, DOCU, INO, DXCM, WYNN, HWM, LYV, ALGN, TDG, DHT\n* Top exits: RNG, SNAP, BYND, LKNCY, GLUU, ISRG, CGC, STNE, MCD, VGK\n* Boosted stakes in: DIS, PYPL, ZM, SQ, CRWD, PTON, LRCX, SHOP, MU, PODD\n* Cut stakes in: MSFT, LBRDK, BABA, TWTR, JD, NKE, GPN, CREE, GH, NFLX\n\nCORSAIR CAPITAL MANAGEMENT\n\n* Top new buys: IWO, IWM, WMB, NATR, MFIN\n* Top exits: LAUR, RHP, ECPG, ATKR, NMRK, TROX, KRA, FSK, HHC, SATS\n* Boosted stakes in: VRT, WSC, GDDY, CC, BH, BBCP, METC, BRK/B\n* Cut stakes in: HGV, HMHC, FMC, NWSA, REPH, GOOG, CHDN, C, CUBI, PLYA\n\nCORVEX MANAGEMENT\n\n* Top new buys: TMUS, EXC, EVRG, CMCSA, JPM, IAA, TIF, LYV, PCG\n* Top exits: ZEN, CRM, FANG, UNP, VMC, MPC, UNH, ANTM, SPY\n* Boosted stakes in: MGM, GLD, BABA, CNP, NFLX, HUM, CNC, MSGS\n* Cut stakes in: ADBE, ATUS, ATVI, AMZN\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: JPM, AVB, EXPE, TGT, DEI, AAP, ESS, CVNA, SMAR, PNC\n* Top exits: LIN, GWRE, TME, NKE, UNH, BAC, PDD, DHI, INMD\n* Boosted stakes in: BABA, USB, JD, LVS, MSFT, HPP, KRC, CCC, LYV, HLT\n* Cut stakes in: NFLX, FB, AMZN, DIS, RACE, ORLY, PPD, AZO, SBUX, GOOGL\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: TMUS, JPM, XBI, SBUX, BKNG, SMAR, CCL, WFC, LYV, CB\n* Top exits: ABT, QCOM, NOW, ADBE, INDA, COUP, TWOU, EDU, SNE, TWLO\n* Boosted stakes in: MSFT, JD, FCX, FSLY, BABA, CRWD, RETA, PLAN, FLEX\n* Cut stakes in: NFLX, FB, AMZN, WDAY, ATVI, GOOGL, GE, IQV, FIS, DISH\n\nELLIOTT MANAGEMENT\n\n* Top new buys: WELL, FSCT\n* Top exits: LQD, RRTS, ESI, HYG, XOP, NEWR, CSOD, NTNX, CNHI, EGHT\n* Boosted stakes in: DELL, TWTR, RYAAY\n\nENGAGED CAPITAL\n\n* Top new buys: JACK, MGLN, SMPL, IWM\n* Top exits: APOG\n* Boosted stakes in: STKL, NCR\n* Cut stakes in: HAIN\n\nFIR TREE\n\n* Top new buys: SQ, LYV, PS, SNAP, VG, EIX, SABR, EXPE, J, PCPL\n* Top exits: FLT, FPAC, BKNG, SHLL, CCH, GOOG, APXT, OAC, DMS, EXPC\n* Boosted stakes in: CNC, CTXS\n* Cut stakes in: DIS, MSFT, TMUS, LAUR, ANTM, DELL, EXC, CMCSA, SLM, TRNE\n\nGREENLIGHT CAPITAL\n\n* Top new buys: GDX, AAWW, TECK, REZI, JACK, GLD, APG, TPX, SATS, WHR\n* Top exits: ATUS, ADNT, CNC, MO, PAYX, AXP, GS, DHR, BRK/B, DIS\n* Boosted stakes in: AER, CHNG, NBSE, GPOR\n* Cut stakes in: CNX, XELA, CC\n\nICAHN\n\n* Top exits: HPQ, HTZ, FCX\n* Boosted stakes in: IEP, LNG, TEN\n* Cut stakes in: CLDR\n\nIMPALA ASSET MANAGEMENT\n\n* Top new buys: LAD, DRI, NSC, HES, CMI, VAC, TOL, ADNT, DOOO, MU\n* Top exits: MSFT, PCAR, CSX, KBH, VMC, MA, AMZN, FDX, EXP\n* Boosted stakes in: HOG, RIO, AAWW, FUN, WYNN, UFI\n* Cut stakes in: TGT, QCOM, KSU, SBLK, TTWO, SIX, KNX, TCKRF, NVR, TECK\n\nJANA PARTNERS\n\n* Top exits: NEWR, JACK\n* Boosted stakes in: PRSP, SPY\n* Cut stakes in: AXTA, HDS, HI, BLMN, ELY, CAG\n\nLAKEWOOD CAPITAL MANAGEMENT\n\n* Top new buys: HDS, CRL, LBTYK, LBTYA, UE, CDK, NKLA, ABG, CROX, SHAK\n* Top exits: WUBA, AMZN, ICE, FNF, TWO, YY, RNR, TPR, WW, REAL\n* Boosted stakes in: FAF, BABA, ANTM, AXS, BIDU, BHC, HCA, SKX, C, ACGL\n* Cut stakes in: GOOGL, CI, FB, MA, DELL, GS, AGNC, APO, CMCSA, BC\n\nLANSDOWNE\n\n* Top new buys: C, VMC, LUV, ED, FCX, RYAAY, AES, COG, TMUS, BKNG\n* Top exits: DHT, NKLA, AGI, TT, IQ, BABA\n* Boosted stakes in: MU\n* Cut stakes in: UAL, DAL, FSLR, GE, ETN, ADI, REGI, LRCX, TSM, SMMT\n\nLONG POND\n\n* Top new buys: PEAK, LVS, DEI, EQR, SHO, WELL, SEAS, UDR, INVH, MAR\n* Top exits: H, DHI, VNO, PEB, PGRE, MGM, VAC, RRR, JLL, CUZ\n* Boosted stakes in: CPT, AVB, MAA, AIV, HLT, ESS, FR, KRC, JBGS\n* Cut stakes in: WH, HGV, RHP, HPP, SBRA\n\nMAGNETAR FINANCIAL\n\n* Top new buys: ADCT, NVS, PKI\n* Top exits: HPQ, TSG, DLR, DKNG, ET, EPD, KMI, LHCG, CRL\n* Boosted stakes in: GRUB, WLTW, LH, BDX, LCA, CPAA, SYNH, ABBV, CRSA, DGX\n* Cut stakes in: PFE, ADSW, TIF, UBER, NVST, BAX, WMB, PPD, MEET, FREE\n\nMAVERICK CAPITAL\n\n* Top new buys: AXP, LIVN, VFC, MKC, GE, BGS, THS, GIS, CRI, FL\n* Top exits: QSR, COMM, ALKS, H, BX, GME, WING, ARMK, ORCL, LB\n* Boosted stakes in: FB, AMZN, DLTR, MSFT, LRCX, APD, ATRA, NFLX, NKTR, UBER\n* Cut stakes in: FLT, BABA, DD, CCK, STNE, PRSP, TMUS, CNC, ADBE, KKR\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: DOCU, TWLO, SE, GOOGL, AEO, LOW, NUAN, HLT, TPX, PINS\n* Top exits: TTWO, CPRT, EDU, DG, ADYEN, EFX, ADI, LKNCY, IQV, QSR\n* Boosted stakes in: FISV, AZO, BKNG, JD, PYPL, LB, AAP, MA, FICO, DPZ\n* Cut stakes in: FIS, FB, CSGP, LH, NFLX, DRI, VRSN, AMZN, EL, PLAN\n\nOAKTREE CAPITAL MANAGEMENT\n\n* Top new buys: PCG, GTH, API, SRNE\n* Top exits: CEO, SRLP, WMB, BRFS, ASRT, ORCC, PVAC, MDRIQ\n* Boosted stakes in: TMHC, AU, TSM, CX, ITUB, MELI, BIDU, AFYA, IBN, AZUL\n* Cut stakes in: BABA, BCEI, CZR, CCS, SMCI\n\nOMEGA ADVISORS\n\n* Top new buys: DNRCQ\n* Top exits: GOOGL, SSSS, TWO, GPMT\n* Boosted stakes in: COOP, JPM, FOE, GTN, MGY, SNR, SRGA, AMCX\n* Cut stakes in: VICI, GCI, FCRD, NBR, ASPU, OCN, EFC, MVC, PE, ABR\n\nNEVER MISS THE NEWS THAT MATTERS MOST\n\nZEROHEDGE DIRECTLY TO YOUR INBOX\n\n*Receive a daily recap featuring a curated list of must-read stories.*\n\nPERSHING SQUARE\n\n* Top exits: BRK/B, BX, PK\n* Boosted stakes in: QSR, LOW\n* Cut stakes in: HHC\n\nSOROBAN CAPITAL\n\n* Top new buys: RTX, CMCSA, HLT, MAR, YUM\n* Top exits: LHX, QSR, NSC\n* Boosted stakes in: BABA, SNE\n* Cut stakes in: NOC, UNP, CSX, ATUS, AMZN, MSFT\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: IGSB, SLQT, HAIN, PCG, DKNG, DRI, SPSB, BAC, MS, C\n* Top exits: XLU, WMGI, UNH, LNT, SHW, ALL, CBOE, LEN, DIS, CVE\n* Boosted stakes in: LQD, TMUS, NLOK, VICI, TDG, ARMK, BK, GS, ETFC, FOCS\n* Cut stakes in: PTON, TIF, TCO, ORCC, VST, KKR, CLVS, AVTR, ATVI, DHI\n\nSTARBOARD\n\n* Top new buys: IWM, IWR\n* Top exits: REZI\n* Boosted stakes in: MD, ACIW\n* Cut stakes in: EBAY, IWN, CERN, NLOK, CVLT, BOX, MMSI, GDOT\n\nTEMASEK HOLDINGS\n\n* Top new buys: BLK, PDD, SBUX\n* Top exits: BMRN, UNVR, RDS/B, PAGS, STNE, TOUR, FSLY, WORK\n* Boosted stakes in: BGNE, HDB, IBN, CBPO, VMW\n* Cut stakes in: BABA, FIS, VIRT, NIO, DDOG, VNET, INFO\n\nTIGER GLOBAL\n\n* Top new buys: ZI, API, DADA\n* Top exits: IQ, LVGO, BILL, STG, JCPNQ\n* Boosted stakes in: JD, AMZN, MSFT, CRWD, SPOT, PDD, DDOG, CRM, WDAY, ZM\n* Cut stakes in: ATH, SVMK, RDFN, MA, STNE, PYPL\n\nTUDOR INVESTMENT\n\n* Top new buys: ADSW, PCG, TMUS, TME, LHX, ATHM, BXMT, NFLX, ESS, EQR\n* Top exits: TIP, DEI, ABBV, FHN, KRC, GLPI, COP, PEG, LAD, MS\n* Boosted stakes in: AMTD, ETFC, GLIBA, SOXX, X, O, AAPL, UBER, CRWD, TCO\n* Cut stakes in: SPY, JAZZ, CERN, TEAM, HPQ, MCD, EA, LRCX, CUZ, PSB\n\nVIKING GLOBAL INVESTORS\n\n* Top new buys: TMO, HLT, APG, NUAN, MCO, PH, ADI, SHW, DRI, ZNTL\n* Top exits: ANTM, GOOGL, FB, NSC, ORLY, A, NOW, PGR, BMRN, AJG\n* Boosted stakes in: AXP, CMCSA, FIS, LVS, TMUS, PLAN, JPM, AON, CB, SE\n* Cut stakes in: NFLX, BSX, JD, LOW, UBER, CME, MELI, MU, CRM, CHNG\n\nWHALE ROCK CAPITAL MANAGEMENT\n\n* Top new buys: SQ, NXPI, MELI, CREE, VRM, ZI\n* Top exits: DIS, BABA, INTC, MU, MIME, ZS, ATVI, TSM, KLIC, PLAN\n* Boosted stakes in: FSLY, SHOP, DOCU, TSLA, COUP, AMZN, W, FB, OKTA, BILL\n* Cut stakes in: NOW, MSFT, NET, PTON, SMAR, FTNT, CRWD, AVLR, ZM, DDOG",
        "subreddit": "StockMarket",
        "title": "This Is What Hedge Funds Bought And Sold In The Second Quarter",
        "url": "https://www.reddit.com/r/StockMarket/comments/ib0pdh/this_is_what_hedge_funds_bought_and_sold_in_the/",
        "created": 1597641665.0
    },
    {
        "author": "ahderia",
        "created_utc": 1598307269,
        "id": "ifz7vt",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "I have this crazy thought in my head that GameStop will rise quite a bit for a week or two in November due to the next generation consoles coming out. I’m thinking about purchasing a few shares while it’s ridiculously low in hopes of selling when it peaks when in season. Now I’m no fool and know that GME is well on its way to liquidation but am I being too optimistic here? I’m new to trading and don’t want to get my hopes up on something that is obvious to others that I might not be seeing. \nAlso, if I’m breaking any rules in this post then please let me know or take the post down. I mean no Ill intent. Just wanted to ask those who are wiser in this than I am.",
        "subreddit": "stocks",
        "title": "Thoughts on GME?",
        "url": "https://www.reddit.com/r/stocks/comments/ifz7vt/thoughts_on_gme/",
        "created": 1598336069.0
    },
    {
        "author": "DeepFuckingValue",
        "created_utc": 1596306075,
        "id": "i1wvqu",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO month-end update — July 2020",
        "url": "https://i.redd.it/wzxupbttnfe51.png",
        "created": 1596334875.0
    },
    {
        "author": "baseballmal21",
        "created_utc": 1598897834,
        "id": "ik3cdx",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Money managers got so greedy that they shorted more shares than the company actually had. These giant gay bears need a lesson in the next TLRY squeeze.\n\n\nGME IF YOU HAVE ANY CALLS DO NOT SELL YOUR CALLS EXERCISE THEM SO THAT SOMEONE HAS TO GO OUT AND BUY ALL YOUR 100 SHARES PER CONTRACT!!!!\n\nYou'll receive almost the same amount of gain but the domino effect will skyrocket the stock higher on every single exercised contract!\n\nHolding Friday's $6calls, $9calls, and a austic amount of January $20calls. Let's go.",
        "subreddit": "wallstreetbets",
        "title": "Gamestop's short float over 100%",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik3cdx/gamestops_short_float_over_100/",
        "created": 1598926634.0
    },
    {
        "author": "Khaledhajabual",
        "created_utc": 1596597540,
        "id": "i3xsub",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "GameStop has 97.75% of the float sold short but multiple reasons to own:\n\n&amp;#x200B;\n\n* Market cap of $268m and net cash (cash minus all debt) of $100m\n* Projected to generate $200m in cash flow in Q4 (almost equivalent to the market cap)\n* PS5 and Xbox Series X launch in Q4 of 2020 will provide a massive boost to revenue (last consoles were dropped in 2013)\n* Gaming companies just released record Q2s (Take-Two and Sony yesterday and Activision today) as stay-at-home trends are boosting sales\n* Market thinks that the transition to digital games is happening faster than it is. There are still many reasons people buy physical copies of games (sentimental value, resale, offline play to name a few)\n* Ecommerce sales are soaring (grew 519% in Q1)\n* Famous hedge fund manager Michael Burry owns about 4.3% of the company.\n\nIn summary,  GameStop has lots going for it but the PS5 and the Xbox Series X launch is exactly the catalyst it needs to start a massive short squeeze in Q3/Q4 2020.\n\n&amp;#x200B;\n\n[http://shortsqueeze.com/shortinterest/stock/GME.htm](http://shortsqueeze.com/shortinterest/stock/GME.htm)",
        "subreddit": "wallstreetbets",
        "title": "The greatest short squeeze of our generation (98% of float short)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3xsub/the_greatest_short_squeeze_of_our_generation_98/",
        "created": 1596626340.0
    },
    {
        "author": "krullord",
        "created_utc": 1598901635,
        "id": "ik4l0t",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "GameStop is up over 30% to around $7 per share after one of the guys from Chewy took a 9% stake. Puts are down, time to buy and bank for a correction back below $6? We all know GameStop is a standing corpse right now.\nGME $6p 9/18\nGME $6.5p 9/18",
        "subreddit": "wallstreetbets",
        "title": "GameStop +31%, Buy Puts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik4l0t/gamestop_31_buy_puts/",
        "created": 1598930435.0
    },
    {
        "author": "officialhibana",
        "created_utc": 1597867900,
        "id": "icvdos",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I’m gonna conveniently skip the part where OP calls you a bunch of names and go straight to the shit, diptard. \n\nGME is already a piece of shit company, who even goes to a store to buy video games anymore that isn’t Best Buy or some shit when the new Autists Anonymous 3 Survival Edition game comes out. Their revenue is declining like crazy and it [kinda looks like ](https://www.macrotrends.net/stocks/stock-comparison?s=gross-profit&amp;axis=single&amp;comp=GME) what happened to Blockbuster. \n\nWhy is GameStop trash?\nRemember when Netflix and other streaming services came out and blockbuster got a shit taken on them? It’s the same situation now, with digital games being much easier to buy and pay for online. And lets face it, people are lazy, especially gamers. Look at the new PS5 and the new XBOX, there’s two options, the digital one, and the one with a disk slot. The one with a disk slot is 50$ more. Who the fuck would pay 50$ just for a disk slot, aight i get it if you wanna keep your old games but honestly I doubt many people will be willing to do so. \nFurthermore, GameStop is always diarrhead on by the gaming community on the fact that whenever you want to turn in a game that you played for like 2 months and paid 50$ for they’ll offer you 12$. Fuck that. Gay shit. Theres also waaay more PC players than Console players, who GameStop is targeted at. Well likely see a further decline in console players as they keep getting more expensive and pc part companies are growing like a monkeys dick in a whale enclosure. \n\nExtra professional DD\n\nThe other day I went to my local GameStop and there were literally 3 other people in it; the cashier, his homie, and his homies girlfriend. Idk about that but that sounds like a smashing amount of people for a company in a dying niche!\n\nTLDR: Fuck GameStop, its gay. \n\nYeah you’ll call me a gay bear but I know another blockbuster when I see one.",
        "subreddit": "wallstreetbets",
        "title": "Game Stop is going to fucking 0",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/icvdos/game_stop_is_going_to_fucking_0/",
        "created": 1597896700.0
    },
    {
        "author": "cyanlce",
        "created_utc": 1598656451,
        "id": "iihrzw",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "That guy has been long GME for more than a year.\n\nNow GME might go parabolic with Ryan Cohen (Chewy founder) buying a 10% stake and a short squeeze (more than 100% short interest).",
        "subreddit": "wallstreetbets",
        "title": "Can't wait to see GME YOLO guy's account after Chewy founder buys 10% stake",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/iihrzw/cant_wait_to_see_gme_yolo_guys_account_after/",
        "created": 1598685251.0
    },
    {
        "author": "kalesh1",
        "created_utc": 1598153929,
        "id": "iewen8",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "First time investor here.\nI have 500 dollars to invest in any stock. I was planning on investing in Sony because there stock prices is $78 and with the next gen coming holiday 2020 would it be smart to invest in them or should I invest in gamestop who are trading for around 5. I think both companies will have a good last quarter. \nThanks\nSorry if this is a dumb question.",
        "subreddit": "StockMarket",
        "title": "Should I invest in Sony?",
        "url": "https://www.reddit.com/r/StockMarket/comments/iewen8/should_i_invest_in_sony/",
        "created": 1598182729.0
    },
    {
        "author": "ThesisRobot",
        "created_utc": 1596623815,
        "id": "i42yod",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hey killers, hope you guys are doing alright! be sure to drop any news in I might have missed.   \n\n\n**WLL -**  Earnings tomorrow. From what I understand this company is pretty hated with a Short interest of 30% so could be interesting here.   \n\n\n**ARPO - News out (8/4)**  Aerpio Pharmaceuticals, Inc. Announces a Second Clinical Trial with Funding from MTEC to Evaluate Razuprotafib for the Prevention and Treatment of ARDS in Patients with Moderate to Severe COVID-19  \n\n**DOYU -**   Tencent Holdings Ltd. is driving discussions to merge China's two leading game-streaming platforms, a deal that would create an online streaming giant with a combined market value of $10 billion, Bloomberg reports, citing unnamed sources.\n\n* Tencent holds a stake of more than 35% in each of the two companies that could be merged, DouYu International Holdings and HUYA Inc., and has been discussing the potential deal with the two firms for a few months, according to Bloomberg.  \n\n\n**MVIS** \\- news out yesterday - Several possible buyers engaged with MVIS including top tier OEMs as well as technology companies looking at licensing; MVIS may see a scenario where one buyer acquires one part of the company instead of the whole, Sharma tells Dealreporter\n\n* MVIS short interest 14% of the float\n\n**VAL -**  Pulled from 8k 2 days ago - Valaris plc (the “Company”) continues to have discussions with its lenders and bondholders regarding the terms of a potential comprehensive restructuring of its indebtedness. bankruptcy play? if I am missing something let me know!  \n\n\n**GME -** supposedly up on sonys positive results? short squeezing hard. Will meade for Goldman sacks was pumping thew short squeeze yesterday calling it the next JMIA",
        "subreddit": "pennystocks",
        "title": "Morning Gappers News &amp; Catalysts (updated befoe open) &amp; $VAL $WLL $MVIS $DOYU $GME $ARPO &amp; 8/5",
        "url": "https://www.reddit.com/r/pennystocks/comments/i42yod/morning_gappers_news_catalysts_updated_befoe_open/",
        "created": 1596652615.0
    },
    {
        "author": "Cclose2002",
        "created_utc": 1598029533,
        "id": "ie0pod",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "PULL OUT OF GME. right now unless you want a sweet check to be eaten by the money men. Blew up 20% today. Fall is starting. About to crash towards the 7th ring of hell. Sell you Gamestop, boys and collect the check.",
        "subreddit": "stocks",
        "title": "GameStop (GME)",
        "url": "https://www.reddit.com/r/stocks/comments/ie0pod/gamestop_gme/",
        "created": 1598058333.0
    },
    {
        "author": "unknown_stoink",
        "created_utc": 1598903242,
        "id": "ik5401",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "so i just saw that the share holder of Chewy sold his shares and put his money into GameStop. GameStop is obviously shit but i’m still a bit new to the options game and this is going to be my first time buying a put (an option in general). i’m wondering if this would be a smart play? what do y’all think?",
        "subreddit": "stocks",
        "title": "GME puts?",
        "url": "https://www.reddit.com/r/stocks/comments/ik5401/gme_puts/",
        "created": 1598932042.0
    },
    {
        "author": "gamble-stock-idiot",
        "created_utc": 1597727412,
        "id": "ibuuqs",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "There’s lines to get into Walmart like a it was black ops 2 at game gamestop on drop night just to shop at Walmart. No reason stock don’t go up at least $10 when they Butt fuck earnings tomorrow",
        "subreddit": "stocks",
        "title": "Walmart to 150",
        "url": "https://www.reddit.com/r/stocks/comments/ibuuqs/walmart_to_150/",
        "created": 1597756212.0
    },
    {
        "author": "AtrumCanis",
        "created_utc": 1598656445,
        "id": "iihrxx",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I'm looking to diversify my portfolio after the large jumps the stocks have made during the recovery .My plan is to trim down some of my positions and rotate some of it into cash until I can find a better place to put it. I'm not sure what percentage I should move into cash or what other segments I should be looking at to add diversification.\n\n&amp;#x200B;\n\nHere is my portfolio.\n\n&amp;#x200B;\n\n|Name|Percentage|Industry|\n|:-|:-|:-|\n|AES|4.22|Energy|\n|ALLY|6.71|Financial|\n|AMZN|2.7|Retail/Technology|\n|COF|2.87|Financial|\n|Cash|5.6||\n|DHT|25.08|Oil|\n|DIS Call Options|5.85|Entertainment|\n|DIS Stock|6.47|Entertainment|\n|GME Stock|4.27|Retail|\n|GME Call Options|1.86|Retail|\n|GRAF Warrents|2.73|Industrial|\n|IHI|2.64|Health|\n|MSFT|5.11|Technology|\n|NFIN|1.44|Financial|\n|PINS|6.72|Technology|\n|SPY Hedge Put Option|2.14||\n|VHT|2.63|Health|\n|V|2.75|Financial|\n|WMT Call Option|5.07|Retail|\n|WINA|3.1|Retail|\n\nTotals: Retail 17%, Health 5.2%, Financial 13.8%, Technology 14.52%, Oil 25%, Energy 4.22%, and Cash 5.6%  \n\n\n  \nThis is half of the portfolio the other half is in VOO but that's in my retirement program and I don't do anything to manage it. \n\n&amp;#x200B;\n\nI haven't done anything with bonds due to the low interest environment so its a pure stock and stock derivative portfolio.   \n\n\nI plan to trim DHT down a lot when I find a good exit point and will sell off NFIN soon I'm not too confident in the company. V,AMZN,MSFT have done very well for me and I believe in their future but already have a bunch of exposure to them with VOO.   \n\n\nWhat other industries should I look at?   \n\n\nWhat other investment types could I get that are uncorrelated to the SP500 outside of bonds/precious metals?",
        "subreddit": "investing",
        "title": "Rebalancing/Diversifying Portfolio",
        "url": "https://www.reddit.com/r/investing/comments/iihrxx/rebalancingdiversifying_portfolio/",
        "created": 1598685245.0
    },
    {
        "author": "fezzisfezz",
        "created_utc": 1598367248,
        "id": "igdpfb",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "There's been some odd price action on GameStop the past few days, with little spikes to $5.20 or so followed by a push back down to sub-five, so it still counts as a penny stock right? \n\nAnyway [check out GME's short float](https://finviz.com/quote.ashx?t=GME). 99.7% of shares are short right now on GameStop, meaning a decent sized catalyst could send the stock flying. \n\nPotential catalysts coming up: \n\n* Next-gen console release dates set to be announced soon\n* Earnings report coming up, where GameStop will probably beat analyst expectations due to a huge jump in e-commerce ([up over 500% last quarter, and that was only with part of the quarter being during the pandemic](http://news.gamestop.com/news-releases/news-release-details/gamestop-reports-first-quarter-results). \n\nGet in before it flies! Price target of 6 for me.",
        "subreddit": "pennystocks",
        "title": "Get ready for a $GME Short Squeeze",
        "url": "https://www.reddit.com/r/pennystocks/comments/igdpfb/get_ready_for_a_gme_short_squeeze/",
        "created": 1598396048.0
    },
    {
        "author": "brookeg98",
        "created_utc": 1598826693,
        "id": "ijm4fm",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Swing &amp; Momentum FREE Watchlist \n\nDETAILED DD 👉 https://marketnotify.net/post/latest-swing-momentum-gameplan\n\nCovers: RKT $LPCN $CGIX $REDU $SURF $GME $VVPR $MDGS",
        "subreddit": "pennystocks",
        "title": "Swing &amp; Momentum Watchlist 🔥 👁",
        "url": "https://www.reddit.com/r/pennystocks/comments/ijm4fm/swing_momentum_watchlist/",
        "created": 1598855493.0
    },
    {
        "author": "Drugs-anonymous",
        "created_utc": 1597333998,
        "id": "i92et0",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Buy the calls",
        "subreddit": "pennystocks",
        "title": "GME IS BREAKING OUT ON THE DAILY CALLS/SHARES TO 5$ TRIM ON SHARES TP ON CALLS",
        "url": "https://www.reddit.com/r/pennystocks/comments/i92et0/gme_is_breaking_out_on_the_daily_callsshares_to_5/",
        "created": 1597362798.0
    },
    {
        "author": "JgjordanJG",
        "created_utc": 1597244596,
        "id": "i8fba2",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Anyone noticing a correlation with GameStop stocks and console release 👀 I believe it will rise coming up to console release then plummet again.",
        "url": "https://i.redd.it/1bvioiyp6lg51.jpg",
        "created": 1597273396.0
    },
    {
        "author": "Zoml3ieTacos",
        "created_utc": 1598027012,
        "id": "idzvrk",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Gamestop..?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/idzvrk/gamestop/",
        "created": 1598055812.0
    },
    {
        "author": "Drugs-anonymous",
        "created_utc": 1598628868,
        "id": "ii98b1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Gme short squeeze incoming 5.5 yolo today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ii98b1/gme_short_squeeze_incoming_55_yolo_today/",
        "created": 1598657668.0
    },
    {
        "author": "rejiuspride",
        "created_utc": 1598297254,
        "id": "ifvw9x",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "By using the power of RNGesus Gamestop will beat earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ifvw9x/by_using_the_power_of_rngesus_gamestop_will_beat/",
        "created": 1598326054.0
    },
    {
        "author": "NickNewport42",
        "created_utc": 1596631760,
        "id": "i44qm0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "why is GME going up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i44qm0/why_is_gme_going_up/",
        "created": 1596660560.0
    },
    {
        "author": "i_love_food_1974",
        "created_utc": 1598896138,
        "id": "ik2s9g",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME to the Moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik2s9g/gme_to_the_moon/",
        "created": 1598924938.0
    },
    {
        "author": "TheRoaringKitty",
        "created_utc": 1596558176,
        "id": "i3mddz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I just published my analysis on GameStop (GME, $4.01, $260M). Let me know what you think!",
        "url": "https://www.youtube.com/watch?v=JWdWCtLMoU0&amp;list=PLlsPosngRnZ1OLfGPDLLC3a8k_rrwFNk6&amp;index=1",
        "created": 1596586976.0
    },
    {
        "author": "Cclose2002",
        "created_utc": 1598030637,
        "id": "ie12o8",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "EASY $$$ (GME)",
        "url": "https://www.reddit.com/r/investing/comments/ie12o8/easy_gme/",
        "created": 1598059437.0
    },
    {
        "author": "floridabuds",
        "created_utc": 1596552503,
        "id": "i3kmt8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME giving me those good gains! 95%+ short interest on this one.",
        "url": "https://i.redd.it/wg9hmafn00f51.png",
        "created": 1596581303.0
    },
    {
        "author": "Affectionate-Monk526",
        "created_utc": 1598894097,
        "id": "ik24u9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "YOLO TRADE GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ik24u9/yolo_trade_gme/",
        "created": 1598922897.0
    },
    {
        "author": "Ilovedonutss",
        "created_utc": 1596484589,
        "id": "i348ud",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "InvestmentClub",
        "title": "GameStop: Why Michael Burry From 'The Big Short' May Be Right (NYSE:GME)",
        "url": "https://seekingalpha.com/article/4363919-gamestop-why-michael-burry-from-the-big-short-may-be-right",
        "created": 1596513389.0
    },
    {
        "author": "centaursteve",
        "created_utc": 1596553217,
        "id": "i3ku7e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GME SHORT SQUEEZE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/i3ku7e/gme_short_squeeze/",
        "created": 1596582017.0
    },
    {
        "author": "TheRoaringKitty",
        "created_utc": 1598025779,
        "id": "idzhbm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SecurityAnalysis",
        "title": "On a slow Friday could I post this video so I could get some feedback on my new style of presenting DD on GameStop ($GME, $4.61, $299M market cap)",
        "url": "https://www.youtube.com/watch?v=alntJzg0Um4&amp;list=PLlsPosngRnZ1OLfGPDLLC3a8k_rrwFNk6",
        "created": 1598054579.0
    },
    {
        "author": "TheRoaringKitty",
        "created_utc": 1598029117,
        "id": "ie0klh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "What are your thoughts on this new style of presenting analysis on GameStop ($GME)?",
        "url": "https://www.youtube.com/watch?v=alntJzg0Um4&amp;list=PLlsPosngRnZ1OLfGPDLLC3a8k_rrwFNk6&amp;index=1",
        "created": 1598057917.0
    },
    {
        "author": "BuyTheDipFD",
        "created_utc": 1598608667,
        "id": "ii4a83",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Gamestop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ii4a83/gamestop/",
        "created": 1598637467.0
    },
    {
        "author": "TheRoaringKitty",
        "created_utc": 1598026246,
        "id": "idzmve",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "What do you think of this new style of presenting DD on GameStop ($GME)?",
        "url": "https://www.youtube.com/watch?v=alntJzg0Um4&amp;list=PLlsPosngRnZ1OLfGPDLLC3a8k_rrwFNk6&amp;index=1",
        "created": 1598055046.0
    },
    {
        "author": "DivendedsRlife",
        "created_utc": 1598899484,
        "id": "ik3wbp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Shorting GameStop cuz we all know this boom just becuz a dog food guy invested is gonna shatter",
        "url": "https://i.redd.it/afpm65rjvdk51.jpg",
        "created": 1598928284.0
    }
]