[
    {
        "author": "dvdmovie1",
        "created_utc": 1602597679,
        "id": "jadzs5",
        "num_comments": 425,
        "num_crossposts": 0,
        "selftext": "https://www.cnn.com/2020/10/13/media/amc-theatres-money-movies/index.html\n\n\"Boosting liquidity won't be easy without a return to business-as-usual. It's exploring additional debt financing, renegotiations with landlords, and even potential sales of assets. But AMC threw cold water on those options. \"There is a significant risk that these potential sources of liquidity will not be realized or that they will be insufficient to generate the material amounts of additional liquidity that would be required until the company is able to achieve more normalized levels of operating revenues,\" AMC said.\"",
        "subreddit": "investing",
        "title": "AMC Theatres could run out of money by the end of the year",
        "url": "https://www.reddit.com/r/investing/comments/jadzs5/amc_theatres_could_run_out_of_money_by_the_end_of/",
        "created": 1602626479.0
    },
    {
        "author": "whiskeyclouds",
        "created_utc": 1602342428,
        "id": "j8m13s",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "They way I see it, is it's only a matter of time before movie theaters open back up again fully, and we're pumping out massive blockbusters every year again. \n\nIn 2016, AMC stock price was hovering around $30.00, now it's around 4.00 last I checked. Seems like a great time to buy, especially as their main competitor, Cineworld, shuddered their US locations. \n\nOf course this could also be the tipping point where we stop going to movie theaters entirely and begin to shift new releases to at home streaming, which wouldn't bode too well for AMC I imagine.\n\nDo you guys think it's a safe buy?",
        "subreddit": "investing",
        "title": "How do y'all feel about AMC stocks?",
        "url": "https://www.reddit.com/r/investing/comments/j8m13s/how_do_yall_feel_about_amc_stocks/",
        "created": 1602371228.0
    },
    {
        "author": "Xslayah420X",
        "created_utc": 1603293397,
        "id": "jfesdj",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "Yesterday got shit faced and bought calls on AMC. Lost $3,000 in 20 minutes and then sold. I’m a fucking retard",
        "subreddit": "wallstreetbets",
        "title": "anyone else get drunk and buy stupid calls and then lose all your money?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jfesdj/anyone_else_get_drunk_and_buy_stupid_calls_and/",
        "created": 1603322197.0
    },
    {
        "author": "fastnlite",
        "created_utc": 1602686899,
        "id": "jb2266",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "think about it, retard. \n\nin 2017, amc stock was around $30. now the stock is less than $3. big rona is raging hard in people's hearts and ballots, and meanwhile america's biggest corporations are getting a raging hard-on for buying a chain of movie theaters.\n\nbloomberg reported last night \"rumors\" that AMC is going to go bankrupt. True, they are running out of cash--which they had reserves for through the end of this year.\n\nbut where are suburban 14 year olds supposed to do with their time? where else they gonna try and hold a girl's hand, and get rejected? the movies, retard. they aren't going away, no matter how \"sick\" your home theater system is. you live in a studio apartment anyways, dumbass.\n\nand honestly, movie theaters are simple enough to retrofit, you just install some new HVAC filters or donald glover's air conditioning character tells you to do. unlike cruise ships or airplanes.\n\nCEO Adam Aron said on bloomberg following the rumors: \n\n&gt; \"the company isn't considering bankruptcy, and is instead looking at ways in which it might raise cash to ride out the pandemic. Bankruptcy, Aron says, might have to be an option down the road, \"but that time has not yet arrived, and any reports to the contrary are wholly inaccurate.\"\n\nAMC is definitely looking for a buyer. It's allowed now, thanks to a court ruling this last summer, i think.\n\nLookin at you Bezos, and maybe you, netflix guy. also, have you seen the AMZN Studios intro on prime? they show AMZN branded movie theaters, if that's the kinda dd you like. prime early access for showings? yes.\n\nbesides, rona gonna be background noise by next summer's blockbusters. they might even replay the blockbusters that got blueballed this year (tenet, 007, mulan).\n\nposition: **AMC Jan-15-21 $5 calls** (jan-22 leaps too are fun and cheap)\n\n*tl;dr: HTZ replay*",
        "subreddit": "wallstreetbets",
        "title": "AMC in contract talks with AMZN for bezos-themed butter sauce",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jb2266/amc_in_contract_talks_with_amzn_for_bezosthemed/",
        "created": 1602715699.0
    },
    {
        "author": "Killtrend",
        "created_utc": 1601935088,
        "id": "j5sukq",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "What up. I’ll put the TL;DR up front so you can downvote and move on. \n\nTL;DR - Cinemark is near or at basement prices trading for 8.37. Do your own DD.\n\nPosition - CNK $10c 1/20/2023 @ 4.50\n\nCinemark sold off today. Down damn near 18% because Cineworld is closing theaters nationwide because of NY’s new restrictions. What if I told you Cinemark wasn’t closing and it got caught tied to bad news it’s actually prepared for. What if I told you pre-Covid it was 30+ a share (high in the low 40s) and a month ago it was $10? Smart money says “lol, movie theater stock in 2020?” but no one here is smart, we’re trying to flip garbage for gains. Maybe this one isn’t the biggest pile of garbage though. \n\nhttps://deadline.com/2020/08/cinemark-has-525m-in-cash-sees-2021-as-transition-year-with-normalized-box-office-in-2022-1203003451/\n\n-Cinemark doesn’t have any NYC theaters. They aren’t closing all their stores. \n\n-Cinemark has enough cash to last well [into 2021](https://deadline.com/2020/08/cinemark-has-525m-in-cash-sees-2021-as-transition-year-with-normalized-box-office-in-2022-1203003451/)\n\n-“COO and CFO Sean Gamble said the company’s cash balance as of July 31 was about $525 million and it is burning about $50 million a month.” A little math and rounding for error  puts them at a cash positive until may/June 2021. \n\n-97 percent of guests express satisfaction with Cinemark “protecting their health and safety.” This is big for when things come back. \n\n-AMC, while higher up the food chain, is riddled with debt. Cinemark? No debt. \n\n-Stim news pumps it. Vaccine news pumps it. Hollywood doing anything positive pumps it. It’s a risky short term play but I think it’s at a bargain price to add to your long term plays - or flip in a few months. \n\n-Did i mention they have a wild dividend? If that’s your thing.",
        "subreddit": "wallstreetbets",
        "title": "Cinemark ($CNK) sell off is overreaction",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5sukq/cinemark_cnk_sell_off_is_overreaction/",
        "created": 1601963888.0
    },
    {
        "author": "036Gooddaysir036",
        "created_utc": 1602949480,
        "id": "jcxenh",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "**Introduction:**  \n \n\nAMC Entertainment and Cinemark are the two largest U.S. theater companies. \n\n* AMC is the largest theater chain in the U.S. and the world.\n   *  AMC has acquired Carmike Cinemas along with the European Odeon and Nordic shortly thereafter. \n   * AMC operates 630+ theaters in the U.S. and 365 theaters in Europe.\n   * There are even plans for AMC to open theaters in Saudi Arabia.\n* Cinemark is the second largest in the U.S.\n   * It operates 342 US theaters\n   * Operates 205 theaters across Latin America. \n   * In an interesting twist Cinemark has a 25% stake in National Cinemedia (NASDAQ: NCMI) (The focus for NCMI is advertising)  \n\n\n**52 Week Highs/Lows:**\n\n* AMC High: $10.95 / Low 1.95$ - Currently trading at $3.04 (17 October)\n* CNK High $37.83 / Low $5.71 - Currently trading at $7.86 (17 October)\n\n&amp;#x200B;\n\n**Comparing the balance sheets (At a glance):**\n\n&amp;#x200B;\n\nBefore this comparison just some quick notes: Movie attendance has decreased gradually over the last 20 years. Both Cinemark and AMC have released rewards programs which has actually increased attendance in 2019 (And then a wild COVID appeared). Additionally both companies have increased their prices to bump up their revenues over the years. (Popcorn obv tastes better when you spend 500$ on it)\n\n&amp;#x200B;\n\nAMC has spend the last several years buying up Cinema chain (Lots of acquisitions in 2016-17), naturally the fund this they loaded up on debt. So, naturally, COVID-19 has put the company in a very difficult spot. \n\n* Last year the company had $340 million in interest payments.\n* It's debt totals over $5 billion. (As of last year)\n* AMC is holding just $198.5 million in cash\n* AMC has more theaters in high-rent locations compared to Cinemark - This lowers their revenue.\n* Their current debt is 5x their current  EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization)\n\nAMC is currently in fund-raising mode, they have stated they have enough funds through the year and possibly a bit longer. Recently though AMC has made a deal with Universal. A step into the streaming market, especially during these lockdowns, could move the company in a brighter direction if they can weather their current conditions.\n\n&amp;#x200B;\n\nCinemark, unlike AMC, has committed to more conservative growth, a move that puts Cinemark in an excellent position to weather the current COVID downturns.  \n\n* CNK has over $571.76 million in cash\n* Additonally they have access to over $100 million in additional credit\n* Their expenses total to \\~$520 million if we lump their interest and lease payments. (Plus some other obligations I'm sure)\n* Their current debt is \\~2x their current  EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization)\n\nCinemark has states they have enough money to last through 2021 comfortably. One important note, unlike AMC, Cinemark does not appear to have made move  towards streaming services. This could impact their future revenues if theater attendance continues to decline more in favor for streaming. \n\n&amp;#x200B;\n\n**The Takeaway:**\n\n&amp;#x200B;\n\nThis choice definitely comes down to personal risk tolerance, and depend on your view of the resiliency of the movie industry. Theaters have been on the decline for years, the reward programs have decreased this flow a bit, but how much will it continue to do so especially if people have unsubscribed from these to pinch pennies during COVID?  \n\n\nAMC is definitely the riskier of the two, they have tons of debt and Europe has seen less theater attendance than Latin America has for CNK. However if AMC survives (by its own means or government money), there is potential for stronger upside, especially since they are getting their foot in the door with universal.   \n\n\nCinemark's conservative growth is definitely paying off during this time. However, if AMC does survive then what will Cinemark's moves be in the future to ensure their continues relevance as theaters continue to decline?\n\n&amp;#x200B;\n\n**Final Thoughts:**\n\n&amp;#x200B;\n\nDo I think these (AMC &amp; CNK) are super long term holds? I am hesitant to say. Looking at a 1-2 year window I do believe they both have strong potential for profit. Beyond that it is difficult to say. AMC's moves with universal could put the company on a new future path away from traditional theaters. It'll be interesting to see where that goes and what Cinemark will do to move itself from a potentially dying market. If you buy definitely set stop-losses just incase, and/or plan an exit price. \n\n&amp;#x200B;\n\nThankyou to all that have read this far. This is not all inclusive so please please do your own research to supplement the quick comparison here. Additionally thankyou to everyone who provided constructive comments on the AT&amp;T post. That was definitely more of a controversial stock, it was interesting to hear everyone's different takes.",
        "subreddit": "stocks",
        "title": "AMC Entertainment (NYSE: AMC) vs. Cinemark (NYSE: CNK) - An upside comparison and the future for traditional Movie Theaters",
        "url": "https://www.reddit.com/r/stocks/comments/jcxenh/amc_entertainment_nyse_amc_vs_cinemark_nyse_cnk/",
        "created": 1602978280.0
    },
    {
        "author": "TrueKoalas",
        "created_utc": 1601867200,
        "id": "j5c2ep",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Regal Cinemas is going to close all of its US locations. AMC, I predict, will soon follow. Coronavirus has killed all chances of theaters reopening until 2021, and people would have to wear a mask in there. Also, why spend money on a ticket when you can watch it on Netflix, in the comfort of your own house?\n\nThey'll fucking crash. AMC has lost almost 33% per share this past month alone. I predict it'll go down to like $1-1.25 a share by January.\n\n&amp;#x200B;\n\n[https://twitter.com/SonnyBunch/status/1312551036020809728](https://twitter.com/SonnyBunch/status/1312551036020809728)\n\n[https://www.businessinsider.com/regal-cinemas-likely-close-us-movie-theaters-cineworld-delays-2020-10](https://www.businessinsider.com/regal-cinemas-likely-close-us-movie-theaters-cineworld-delays-2020-10)\n\n[https://www.cnn.com/2020/10/04/business/regal-cinemas-theater-shutdown/index.html](https://www.cnn.com/2020/10/04/business/regal-cinemas-theater-shutdown/index.html)",
        "subreddit": "wallstreetbets",
        "title": "Theater Stocks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5c2ep/theater_stocks/",
        "created": 1601896000.0
    },
    {
        "author": "paradox34690",
        "created_utc": 1602984274,
        "id": "jd7b2x",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "What do you fellow autists and retards think? AMC Is so fucked at this point, I feel like they're just trying *anything* now.\n\nDoes this reek of desperation to you as well?\n\n[You can now rent a private AMC theater for just $99\n\nhttps://www.cnn.com/2020/10/17/business/amc-rental-99-trnd/index.html](http://You can now rent a private AMC theater for just $99\n\nhttps://www.cnn.com/2020/10/17/business/amc-rental-99-trnd/index.html)",
        "subreddit": "wallstreetbets",
        "title": "Puts on AMC??",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jd7b2x/puts_on_amc/",
        "created": 1603013074.0
    },
    {
        "author": "jesseaboutdat",
        "created_utc": 1602973602,
        "id": "jd4jbl",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "I was literally able to torrent Mulan in HD the day after Disney+ released. If theaters die, the pirates will attack studios with relative ease and steal all them booty. The studios will lose out on millions, and the Jewish cohort (alot of hollywood) is known for keeping their money. AMC &amp; CNK leaps it is 😂\n\nPosition: 12/18 $5c AMC",
        "subreddit": "wallstreetbets",
        "title": "Theaters can’t die",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jd4jbl/theaters_cant_die/",
        "created": 1603002402.0
    },
    {
        "author": "DonutBeers",
        "created_utc": 1601954545,
        "id": "j5xvau",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "https://www.hollywoodreporter.com/news/amc-entertainment-to-run-out-of-liquidity-in-6-months-ratings-agency-warns\n\n\nThey gone right?\n\n\nI’m guessing either Disney, ATT, AMZN, or Viacom picks up AMC, Regal, or IMAX once they hit rock bottom\n\n\nThoughts \nTendies\nEtc\n\nAlso, govenbent ain’t gonna do shit",
        "subreddit": "wallstreetbets",
        "title": "A discussion on movie theaters",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5xvau/a_discussion_on_movie_theaters/",
        "created": 1601983345.0
    },
    {
        "author": "rampwn",
        "created_utc": 1603754322,
        "id": "jiprh4",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "\\- CNK down 7.5% on the day.\n\n\\- AMC down 7.4%; now at all time lows of $2.75/share. \n\nPoints to consider:\n\n1. Bankruptcy is a very real possibility, particularly for AMC. \n2. Potential for acquisition by Netflix, Amazon, others?\n3. Ibid. 2; interested buyers may wait for bankruptcy. \n\nIs now the time to buy?",
        "subreddit": "stocks",
        "title": "Movie Theater Stocks - Time to Buy?",
        "url": "https://www.reddit.com/r/stocks/comments/jiprh4/movie_theater_stocks_time_to_buy/",
        "created": 1603783122.0
    },
    {
        "author": "asdfqwer12332112",
        "created_utc": 1601963880,
        "id": "j5zuds",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "What happened guys? Months ago I'll see green tendie picture all across this subreddit. Everyday people were pushing up high 5-6 figure tendies. Now I'm just lucky to get a glimpse of a new one every other day with some small ~~gay~~ 5-figure tendies. Even during the covid crash gay bears were posting high tendies but now even gay bears and ~~chad~~ bulls do nothing but fight in the comment sections saying stuff like \"oh circuit breakers morrow cause it'll bleed red\" or \"oh orange porange he'll make our market green again\". It's sad guys the only winners this month will be the MM and hedgies at this rate. We CAN\"T let them win we have to show them our autistic power that no MM or hedgie can control the market but only us ,the WSBetters (WSBetians, WSBarians, idk whatever sounds better as a civilized name)\n\nI'm going to nap nap now and wake up for tomorrows ~~market~~ casino \n\nPOS: 10/9 AMC $4.5 C",
        "subreddit": "wallstreetbets",
        "title": "What happened you guys?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j5zuds/what_happened_you_guys/",
        "created": 1601992680.0
    },
    {
        "author": "nafizzaki",
        "created_utc": 1602818678,
        "id": "jc2b5t",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Here me out everyone, I know you will think that I am an idiot to say this but ever heard of the news that AMC is likely going to be bankrupt?\n\nAlso, remember Hertz (HTZ) and how it mooned to infinity and beyond revolving around its bankruptcy?\n\nWell, now you remember.\n\n[Hertz going to the moon](https://preview.redd.it/sqx6grhrhdt51.png?width=929&amp;format=png&amp;auto=webp&amp;s=cc8b7c56fa2f434e1a72d7a3a85bf2be902b8bd6)\n\nAs you can see from the image that even if you were bagholding HTZ till June 10 you would have a CAGR of around 9,093,855,482.2% and if you sold it during its highs, well I don't need to explain you that it's going to be much higher.\n\nCalls in AMC especially that are OTM are very cheap right now. And if AMC files for bankruptcy then these OTM calls will literally be printing money.\n\nMoreover, with all those stimulus talks uncertainty, election uncertainty are making people nervous not to go all in. But you know the deal.\n\nYou know what Warren Buffet said, right? \"Be greedy when others are fearful.\" Don't forget this abridged quote, because it will change your life.\n\n[AMC valuation extremely cheap](https://preview.redd.it/56vae53ukdt51.png?width=647&amp;format=png&amp;auto=webp&amp;s=49be9d799bbdb030ca3d95ae193af25ed50f809c)\n\nYou can further see from the image that it's relatively cheapest valuation in sixth months. If you go far OTM you can't ever go wrong.\n\nNOTE: :) :) :-)",
        "subreddit": "wallstreetbets",
        "title": "AMC To The Moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jc2b5t/amc_to_the_moon/",
        "created": 1602847478.0
    },
    {
        "author": "Chase_Fitness",
        "created_utc": 1603026180,
        "id": "jdfz2d",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "AMC stock has had its lowest dip since the COVID-19 crash after a denied rumor of bankruptcy. Only one way to go from here.",
        "url": "https://i.redd.it/ap0u506cqut51.jpg",
        "created": 1603054980.0
    },
    {
        "author": "BeyondTheGreenHill",
        "created_utc": 1602279920,
        "id": "j882or",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "1. AMC will have 520 of 600 theaters open by the end of October.\n\nhttps://www.marketwatch.com/story/amc-entertainment-expects-520-of-its-600-us-theaters-to-be-open-by-mid-october-2020-10-08\n\n2. AMC has a deal with Universal to receive a cut of streaming profits after it leaves the theater.\n\nhttps://www.fool.com/investing/2020/09/09/amcs-deal-with-universal-will-accelerate-the-luxur/\n\n3. Recent interview with CEO.\n\nhttps://www.cnbc.com/2020/10/06/amc-cinemark-wont-close-theaters-even-as-blockbusters-flee-2020.html\n\n4 This is an obvious stonk go up after vaccine play. It is $4 right now and went as high as $7 in the beginning of September.\n\n5. Buy long dated calls and wait for vaccine news.\n\n$5c 3/19/21 &lt;- I bought this 2 days ago and I’m already up 20%.",
        "subreddit": "wallstreetbets",
        "title": "AMC will go up when a vaccine is available.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j882or/amc_will_go_up_when_a_vaccine_is_available/",
        "created": 1602308720.0
    },
    {
        "author": "leobanksjr",
        "created_utc": 1603642864,
        "id": "jhw3jh",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "*\" Twilio is a communication platform-as-a-service company that allows software developers to integrate messaging and communications functionality into existing or new applications via application programming interfaces and software development kits.*  \n\n\n*The firm's Programmable Communications Cloud addresses several use cases, including Programmable Voice to make and receive phone calls, Programmable Messaging for SMS and MMS delivery, and Programmable Video that allows developers to embed video functionality in mobile and web applications. \"*\n\n\\-Basically any chat or video conferencing company is likely to use Twilio program framework, especially given the times for cloud infrastructure (yes, Im aware of FSLY)\n\n[I not going to bore you with the fundamentals they can be found here](https://www.notion.so/Earnings-10-26-2020-551ce9e145da4633a8ff4dd2f4f99ccc)\n\n* Please use the download or save the image to the web if your having trouble viewing on mobile device.\n\nLooking at a $325 price target on earnings\n\nEarnings are 10/26/2020 AMC\n\n&amp;#x200B;\n\n[30 min gives strong indications of a move up throughout the day, very likely with zero day PT revisions](https://preview.redd.it/70rpxghkn9v51.png?width=3840&amp;format=png&amp;auto=webp&amp;s=8c8fe3703dbd66b59296f609b3da145ee8740018)\n\n[2\\/4 tools suggest consolidation to bullish reversal inbound within 3 days on the 4 HR](https://preview.redd.it/cb8o1e6hm9v51.png?width=3840&amp;format=png&amp;auto=webp&amp;s=7b2c274f4e20d3a8811859ada22d5c0b0aae7b5b)",
        "subreddit": "wallstreetbets",
        "title": "Twilio DD - Start the week off right",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jhw3jh/twilio_dd_start_the_week_off_right/",
        "created": 1603671664.0
    },
    {
        "author": "runslow0148",
        "created_utc": 1602696945,
        "id": "jb5dgu",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "It looks like AMC might be filling for bankruptcy. The markets seem to think this is a bad thing.. I think we know better. This is going to pop just like hertz before it. Currently just under 3, so I think it’s safe to assume 10/30 $5 call is safe.",
        "subreddit": "wallstreetbets",
        "title": "AMC Bankruptcy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jb5dgu/amc_bankruptcy/",
        "created": 1602725745.0
    },
    {
        "author": "Avacados-Anonymous",
        "created_utc": 1602821038,
        "id": "jc2wcw",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Theaters now have digital projectors and no longer use film. So, why don’t they stream Live Trump rallies, Trump town halls, and other Trump shit?  Think about it, they don’t have to worry about costly CoVid precautions. Trump supporters don’t care about CoVid, Diabetes, Obesity, and gladly YOLO their health too spite Liberals. More concessions can be sold too fat middle Americans and AMC can fill every seat and operate at max capacity to Trump Supporters. Diehard Trump supporters don’t die from CoVid they just happen to have traces of CoVid in their system when they die of other causes. Therefore AMC will not be blamed by their new customer base. No matter the precautions AMC implements people scared of CoVid aren’t going to go to the Theater. So go all in on CoVid deniers and stream Amy Coney Barrett’s hearing while serving beer, Coca Cola, PopCorn, and Hot Dogs. Face it only Trump Supporters and Middle Americans  are going to go to the movie theatres during a global pandemic.",
        "subreddit": "wallstreetbets",
        "title": "I know how AMC Theaters can recover Bigly.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jc2wcw/i_know_how_amc_theaters_can_recover_bigly/",
        "created": 1602849838.0
    },
    {
        "author": "Danieldinho7",
        "created_utc": 1602859470,
        "id": "jcb2p8",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "What are your thoughts about me potentially YOLOing on theaters stock options, particularly AMC. It would be long term 01/20/23. Do you think a vaccine would be distributed out by then?  My only concern is the chance of these theaters going out of business before then. What are you thoughts?",
        "subreddit": "wallstreetbets",
        "title": "YOLOing on AMC options",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jcb2p8/yoloing_on_amc_options/",
        "created": 1602888270.0
    },
    {
        "author": "036Gooddaysir036",
        "created_utc": 1603039731,
        "id": "jdjm8n",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": " \n\n**Introduction:**\n\nBlink Charging owns, operates, and provides electric vehicle (EV) charging equipment and networked EV charging services primarily in the United States.   It also provides the \"Blink Network\", a cloud that  tracks charging stations and the associated charging data. This data provides property owners, managers, and parking companies remote monitoring and management of EV charging stations and payment processing. Additionally it provides drivers with station information, info such as location, availability, and applicable fees.   \n\n\n&amp;#x200B;\n\n**Current setup:**\n\nAs of December 2019 it has approx. 14,700+ EV charging stations across the US East Coast, West Coast, and locations in the Mid-West. Additionally they are expanding into Europe and the Middle East. (Can't attach the map because rules)\n\nThe following types of locations currently have stations (It is pretty much where you'd expect):  airports, auto dealers, healthcare/medicals, hotels, municipal locations, residential and condos, parks and recreation areas, parking lots, religious institutions, restaurants, retailers, schools and universities, stadiums, supermarkets, transportation hubs, and workplace locations. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Predictions:** \n\nEV charging industry is projected to be a $112 billion industry by 2027.  The growing demand and sentiment for electric vehicles is a major factor responsible for aggressive growth. Additionally expansion of this industry will increase rapidly as more world governments move towards becoming carbon-neutral status the next few decades. \n\n*  In 2018 US EV sales were up 81% from 2017\n*  In 2018 global EV sales totaled 2.1 million, up 64% from 2017\n* There are currently more than 1.2 million electric vehicles in the U.S.\n* The global EV market is expected to grow at a 25.6% CAGR from 2019-2026 and is forecasted to reach over $567B by 2026\n*  By 2025 EV sales are projected to account for 30% of all global vehicle sales \n*  By 2030, the US is estimated to need 13 million charging stations \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Recent Developments for Blink:**\n\n* Agreement with Cushman &amp; Wakefield for Deployment of EV Charging Stations \n* Agreement with InterEnergy for the purchase of $1.2 million of Blink EV charging equipment to be deployed in the Dominican Republic\n* Co-recipient of a $900,000 grant from the BIRD energy program for the development of a DC fast-charging solution\n* Reached more than 23,000 deployments of EV charging stations at multiple living complexes and offices\n* Migrated the Blink Network to Microsoft Azure to optimize performance, operability and driver experience and prepare for future expansion\n* Expansion into Greece with Eunice Energy joint venture, deploying 40+ ports \n*  Blink enhanced its software to work seamlessly with Google Maps \n\n&amp;#x200B;\n\nA more recent agreement with SG Blocks (NASDAQ: SGBX) aims to deploy a rapid and cost-effective innovative EV charging containers designed to provide off-grid charging solutions through a combined solar and battery components in multiple capacities. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Competitors:**\n\nChargepoint (their main competitor, they are not publically traded) - focused on manufacturing and selling hardware (SemaConnect is another competitor we could lump here)\n\nEVgo, Electrify America - DCFC (Direct-current fast charger) charging solutions that are mainly beneficial for long road trips\n\n&amp;#x200B;\n\n**Blink Charging claims to stand out from their competitors claiming: \"We are the only company in the U.S. that can provide a full package of EV charging solutions under one roof, from start to finish!\"** \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Prices &amp; Market Cap:**\n\n52 Week Range $1.25—$14.58 \n\nMarket Cap $310M \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**The Takeaway &amp; Final Thoughts:**\n\nInterest and sentiment towards Electric Vehicles has been booming and the EV charging industry is poised to grow along side them. Like many of the companies that produce electric cars, EV charging is not the most profitable right now, however, having the infrastructure in place sets Blink and Chargepoint in excellent positions to capitalize in this upcoming market. Additionally there is the possibility of future government subsidies. \n\n&amp;#x200B;\n\nThank you to all that have read this. This is not all inclusive so please please do your own research to supplement, especially since I did not talk in depth about the company financials, and since there are many competitors in this emerging market. Additionally thank you to everyone that provided constructive comments to the AMC vs Cinemark post. I hope everyone has a good day.",
        "subreddit": "stocks",
        "title": "Blink Charging (NASDAQ: BLNK) - EV Charging - The Future \"Gas Station\" - Building alongside the EV Hype.",
        "url": "https://www.reddit.com/r/stocks/comments/jdjm8n/blink_charging_nasdaq_blnk_ev_charging_the_future/",
        "created": 1603068531.0
    },
    {
        "author": "Driver20001",
        "created_utc": 1603809835,
        "id": "jj2eyc",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Going full RETARD on AMC stocks right now they should bounce back am I home yet!!",
        "subreddit": "wallstreetbets",
        "title": "IM DOING IT AMC I'M GOING IN!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jj2eyc/im_doing_it_amc_im_going_in/",
        "created": 1603838635.0
    },
    {
        "author": "BoardButcherer",
        "created_utc": 1602623884,
        "id": "jampcr",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "[https://www.bbc.com/news/business-54528598](https://www.bbc.com/news/business-54528598)\n\n&amp;#x200B;\n\nSeems like it didn't matter how hard we laughed, every week there was someone in here plugging AMC as the next great recovery stock.\n\nDown 13% today and she ain't comin' back. RIP to all the marvel fans who thought Captain Ultra was going to punt this one over the goalpost.",
        "subreddit": "wallstreetbets",
        "title": "Pour a watery Diet Coke out for tha bois.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jampcr/pour_a_watery_diet_coke_out_for_tha_bois/",
        "created": 1602652684.0
    },
    {
        "author": "AJs2ndAlt",
        "created_utc": 1602953257,
        "id": "jcykg6",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "What are some cheap (below $10) stocks that are expected to rise within the next year? Currently I'm invested in AMC Entertainment and some Energy companies (for if Biden gets re-elected) and I was just wondering if there's anything that'll rise by summertime next year",
        "subreddit": "pennystocks",
        "title": "Stock advice",
        "url": "https://www.reddit.com/r/pennystocks/comments/jcykg6/stock_advice/",
        "created": 1602982057.0
    },
    {
        "author": "Rambo_Rude",
        "created_utc": 1602734889,
        "id": "jbgksg",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I'm thinking about buying and holding $AMC for potential upside on a bankruptcy plan. Similar to what happened with Hertz. If it's been on your radar recently, you'll know they've been getting absolutely clobbered lately. With no end in sight to COVID-19, this pandemic may be the proverbial final nail in the coffin as they themselves expect to run dry on cash reserves by the end of this year. Yea or Nay ? Why or why not? \n\nPlease no one word answers. Detailed, honest feedback is appreciated.",
        "subreddit": "wallstreetbets",
        "title": "Could it work?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jbgksg/could_it_work/",
        "created": 1602763689.0
    },
    {
        "author": "Po-Tar",
        "created_utc": 1602879260,
        "id": "jchcyx",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "[https://imgur.com/hehlyYK](https://imgur.com/hehlyYK)\n\n&amp;#x200B;\n\nNew to investing here, still trying to fully understand how shit works in the stock market, especially when it comes to options trading.\n\n&amp;#x200B;\n\nYesterday, I bought 4 AMC call contracts at 0.62c at a $10 strike for Jan 20, 2023. This morning, the price of my contracts shot up to $1.09, as shown above, at 10am. However, the actual share price of AMC hadn't risen much at all at that point, only to $2.89 - in fact, the peak for today was $3.28/share at 11:35am, and the price of my contracts actually went down to 0.79c at that time.\n\n&amp;#x200B;\n\nBasically, can you ELI5 why my contracts, this far out from expiration, aren't influenced by the share price in the way I'd think they would be? Why didn't my contract prices peak as the share prices did? I'm trying to understand theta/time decay, but it doesn't seem like that would be what's influencing it?",
        "subreddit": "investing",
        "title": "Beginner here; can someone explain why my AMC call contracts spiked in price at 10 am this morning?",
        "url": "https://www.reddit.com/r/investing/comments/jchcyx/beginner_here_can_someone_explain_why_my_amc_call/",
        "created": 1602908060.0
    },
    {
        "author": "jmb00308986",
        "created_utc": 1603212309,
        "id": "jetcc1",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Can we talk about AMC going to the floor. Puts. I’m addition to covid, they are being hammered by streaming services, not to even mention nextgen consoles dropping and msft bundling stuff with their system. Everybody and their mom has amazon prime which includes movies and tv, YouTube adding ads now which is pushing people to pay for their services and Leah towards YouTube tv. And on slightly more obscure level, tv prices are dumb cheap for massive 4K screens now (ie paid under 600 for a 65 4K Samsung). There no real reason for folks to move back to movie theaters and pay 15$ for a coke. TLDR amc long puts will print.",
        "subreddit": "wallstreetbets",
        "title": "AMC taking a dump",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jetcc1/amc_taking_a_dump/",
        "created": 1603241109.0
    },
    {
        "author": "norget85",
        "created_utc": 1601713729,
        "id": "j4cal0",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hello guys,\n\nI am researching AMC Networks Inc. (AMCX).  I would like to ask your opinion on the company because I can't find out why it's share price is declining so badly over the years. The company's avg, ROIC is above 10% . I find that its intrinsic value is about 40ish % above it's current price. \n\nI can't really seem to find problems with the company. It has series like Breaking Bad and The walking dead, which were huge successes. Anyway what do you think about AMCX?",
        "subreddit": "ValueInvesting",
        "title": "AMC Networks",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/j4cal0/amc_networks/",
        "created": 1601742529.0
    },
    {
        "author": "Griffinkeeler",
        "created_utc": 1602685966,
        "id": "jb1rya",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I wake up this morning half asleep. Look at my watchlist, see that AMC is down like 20%. So logically I buy a put. But my screen doesn’t fucking show me any numbers in the morning for some reason, so I don’t know the Greeks on my put or any of that. I buy the put and realize even though AMC is dropping I’m not making any money. THATS BECAUSE MY BREAKEVEN IS LIKE 0.441 AND THE STOCK IS AT 2.4. Then my retard self looks at the open interest: it’s fucking me and one other retard. If someone would like to take these off my hands that’d be great, otherwise I’m fucked. \n\nPositions: AMC $1p 10/16",
        "subreddit": "wallstreetbets",
        "title": "I’m the king of retards",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jb1rya/im_the_king_of_retards/",
        "created": 1602714766.0
    },
    {
        "author": "BulwarkTrading",
        "created_utc": 1602730483,
        "id": "jbfhqg",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "$AMC has taken a big hit with news of potential bankruptcy. They have also reported a plan to have 520 of 600 theaters open very soon. I have seen this happen with other companies over the past 8 months and seen stock prices come back pretty strong. Thoughts?",
        "subreddit": "StockMarket",
        "title": "$AMC panic selling. Opportunity to profit?",
        "url": "https://www.reddit.com/r/StockMarket/comments/jbfhqg/amc_panic_selling_opportunity_to_profit/",
        "created": 1602759283.0
    },
    {
        "author": "IDontBeleiveImOnFIre",
        "created_utc": 1602797261,
        "id": "jbwpal",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Cinemas are fucking retarded but AMC dropped down to a measly 2%. I’m a foreigner but I’ll assume most Americans use AMC as their go-to cinema, though the retards are literally going to go bankrupt within one more fucking ice step. High risk high reward. What do you think brothers?",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on $AMC?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jbwpal/thoughts_on_amc/",
        "created": 1602826061.0
    },
    {
        "author": "stonks5k",
        "created_utc": 1603861083,
        "id": "jjhp07",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "If they can pay for ads, they can pay for my tendies. AMC calls, all in",
        "url": "https://i.redd.it/esry3eovorv51.jpg",
        "created": 1603889883.0
    },
    {
        "author": "Maybe_a_CPA",
        "created_utc": 1603585318,
        "id": "jhjxz2",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Literally didn’t even look up if this is a real ticker. But we were all in on AMD, now AMC is in our sights, only a matter of time until AMB, followed by AMA have their moments in the spotlight. After that, do we go to ALZ??? Sky’s the limit.  Can’t go tits up.",
        "subreddit": "wallstreetbets",
        "title": "I’m from the future, AMB will be the next one to moon🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jhjxz2/im_from_the_future_amb_will_be_the_next_one_to/",
        "created": 1603614118.0
    },
    {
        "author": "Introbyte",
        "created_utc": 1602828845,
        "id": "jc4ml7",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I’m in a serious financial dilemma right now: should I go all in on GME, or take 5% of that and out it on AMC too so it’s not as risky?\n\nI’m thinkin’ about snaggin’ some spicy weeklies for GME and AMC LEAPS.",
        "subreddit": "wallstreetbets",
        "title": "Risk Analysis",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jc4ml7/risk_analysis/",
        "created": 1602857645.0
    },
    {
        "author": "ValueStreet",
        "created_utc": 1603056149,
        "id": "jdom8x",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Alright bois some top notch DD for you all to gamble on.\n\nTLDR: AMCX LEAPS are cheap and so is the stock. \n\nAMC Networks (no not the theatre, the TV channel) is going to be losing viewers because Walking Dead, which we all watched in 2015, is finally ending. Spoiler: &gt;!basically everyone from the earlier seasons is already dead and no one wants to watch it.!&lt;\n\nHowever, the company has been able to maintain 25% margins for over 10 years and can still generate substantial amounts of cash even if viewership declines (like $100m - $200m per year).\n\nOn top of this, they have one of the biggest niche streaming services in Shudder, Acorn TV, and a couple others. At the end of this year, they'll have 4m subscribers on that. Competitor Crunchyroll, with 3m subscribers, is being shopped by AT&amp;T for $1B. There's your marketcap right there.\n\nSo basically the company is worth probably double the current price, even if things go poorly. If they can find another show like Walking Dead, stock could be a 10x.",
        "subreddit": "wallstreetbets",
        "title": "AMCX is the next GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jdom8x/amcx_is_the_next_gme/",
        "created": 1603084949.0
    },
    {
        "author": "Keyl3ss",
        "created_utc": 1602835984,
        "id": "jc601p",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Ok,,, an idea for fucks sake\n\nCan a sloppy fishy dream or what?\n\nI'm sure all of you are aware of AMC taking a fat shit right now, but what if it was lowkey getting a plumpkin this whole time behind the scenes? Will AMC wipe its ass soon or go Elvis Presley... idfk, but I do have a vision of future theaters that just might change the dynamic of how movie tickets are bought and/or presented to the public. Hear me out, BEZOS has revolutionized mail today as we know. What if any streaming company buys out AMC theaters, but makes some reservations to the theater itself. Such as creating a revolutionary way to buy our tickets or group up to meet friends to watch movies at theaters. What if you could use your PRIME(could be anything else just throwing shit out there) from Amazon(or any other) as a subscription to go watch movies at theaters on a weekly or monthly basis? Would such a system be possible to implement? Creating a new dynamic where movies are streamed from Amazon to the screen itself. Lots of possibilities. One being, creating custom theater rooms where friends can buy into certain rooms with specific showings? Or maybe give the moviegoers the option to book a room to a certain movie released they want to watch with friends? Maybe random people who want to meet other random people to select a room that incentivizes engagement because ik society can use something like this nowadays. Somehow connect dating apps with this infrastructure to create blind or wanted dates? I just feel like there is so much potential if one of these big companies actually looked into this in some form or fashion...\n\nRegardless... A hopeless fuck as myself has procrastinated enough on this random thought as this shit probably will hit chapter 11. At least the property is an asset. Can a fishy dream?\n\n\\-a tired hallucinogenic pleb\n\n&amp;#x200B;\n\nConclusion: If you read this far, FDs all day on this bitch",
        "subreddit": "wallstreetbets",
        "title": "AMC proposal... BEZOS / DIS / NFLX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jc601p/amc_proposal_bezos_dis_nflx/",
        "created": 1602864784.0
    },
    {
        "author": "Driver20001",
        "created_utc": 1603814406,
        "id": "jj3uxn",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " Going full RETARD on AMC stocks right now they should bounce back am I home yet!! \n\nhttps://preview.redd.it/l0rjs4f3unv51.png?width=1182&amp;format=png&amp;auto=webp&amp;s=b8aaf6acb9677c4f6337d487770ffd6e1956ac70",
        "subreddit": "smallstreetbets",
        "title": "I WAS TOLD TO POST HERE SO I AM!!",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/jj3uxn/i_was_told_to_post_here_so_i_am/",
        "created": 1603843206.0
    },
    {
        "author": "sovaart713",
        "created_utc": 1602885487,
        "id": "jcj55p",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Go all in on cinemark for the following reasons \n1. THEORY: Everyone thinks movie theaters r dead\nFacts: it's not dead it's sleeping. 2019 was biggest blockbuster year in movie theater history. So fuck u\n2. Once vaccine is found wife's bf will need to take wife out somewhere. Only place to take her is movie theater.\n3. Amc will go bk. Cinemark has 600 mill on hand. Will be last major theater chain left. \n4. U remember that gme god? U could be that God with cinemark with 2021 to 2022 calls. \n\nHow retarded I am. Plz rank.",
        "subreddit": "wallstreetbets",
        "title": "Rate this retard move",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jcj55p/rate_this_retard_move/",
        "created": 1602914287.0
    },
    {
        "author": "Environmental_Ad222",
        "created_utc": 1603482306,
        "id": "jgu9y6",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "How likely are they going to be bankrupt? Is it a good time to buy amc and look it for months? I am thinking of few thousand s in amc in hope it will bounce back to 6-7$ within few months . Any idea?",
        "subreddit": "wallstreetbets",
        "title": "Any opinion on buying $amc ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jgu9y6/any_opinion_on_buying_amc/",
        "created": 1603511106.0
    },
    {
        "author": "lllkill",
        "created_utc": 1602012946,
        "id": "j6bvbp",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "So me and my lovely lady were tired of the insane 200 degree weather and we were looking for a way to escape the heat.  What better way but to watch a movie?  Lucky for us the local theater had the doors wide open (AMC to the moon) if you were willing to trade air conditioning for covid, which was a no brainer seeing as our dear leader told me to not be afraid.  To match the Halloween spirits, we chose to watch Possessor which looked scary af.  Little did we know it was actually a sci fi movie featuring Elon's new neural link chip.  This movie is literally fleshes out how amazing the neural link can be in the near future.  10/10 would watch again. \n\nhttps://d2s94cyhu2tzlj.cloudfront.net/assets/photos/2020/possessor-uncut-the-cronenberg-horror-brand-liveth/_articlePhotoFull/Possessor-Uncut_BTS2_CourtesyNEON.jpg?mtime=20201002131913",
        "subreddit": "wallstreetbets",
        "title": "Tesla is going to 696 by EOY, DD INSIDE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j6bvbp/tesla_is_going_to_696_by_eoy_dd_inside/",
        "created": 1602041746.0
    },
    {
        "author": "Justinatron",
        "created_utc": 1602654870,
        "id": "jav0rz",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "This stock is going down because theater companies like $AMC and $CNK are in trouble. But guess what, IMAX has most of its screens in international markets and china.\n\nRecently, the Chinese film “The Eight Hundred” became the #1-grossing movie of 2020 surpassing “Bad Boys for Life”\n\nIMAX states that their box office revenue for Q3 is currently 70.3 million, with 40.4 million coming from China.\n\nThis would equate to about the same revenue posting from Q1, which didn’t have the cost saving measures from Q2. I believe Q3 will combine the revenue of Q1 with the cost saving measures in Q2. Which will cause an EPS that beats current predictions and might even be profitable.\n\nTheir earnings are 10/29.\n\nPositions: \nIMAX 15c 11/20",
        "subreddit": "wallstreetbets",
        "title": "Get in IMAX while you can",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jav0rz/get_in_imax_while_you_can/",
        "created": 1602683670.0
    },
    {
        "author": "haasvacado",
        "created_utc": 1602878925,
        "id": "jch9c7",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "##The Boomer Weekly\n\n###Where dreams die. Slowly.\n\nI have to get to the course for my tee time so this week we’re going to punch it through Boomerland in an [AMC Gremlin](https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Gremlin_side_%285903000893%29.jpg/1200px-Gremlin_side_%285903000893%29.jpg) so that I can get there on time. Fuck you, AMC had sexy cars including the [Matador](https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/1972_AMC_Matador.jpg/280px-1972_AMC_Matador.jpg) and the [Pacer](https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/AMC_Pacer_1975_French_advertisement.jpg/220px-AMC_Pacer_1975_French_advertisement.jpg) (*that* is how you sell a car, folks). \n\nLet’s just look at all companies’ performance on Monday: fuuuuuuuuuuuuck that’s green. Right. Now on to the rest of the week. \n\nPsyche. This is Boomerland and youthful exuberance is rarely tolerated here.\n\nLet’s circle back to IBM, who sells International Business Machines but did not get the memo that Monday was supposed to be green. Tuesday was ugly. Wednesday was nice. Thursday was *not*. Had a good Friday to close out the week -1.7% to 125.93. Side note: you may remember that IBM spiked in early February at over $156/share. Only about 24% more to go. \n\nGE, who sells General Electrics, also failed to have a green Monday (see, *this* is why Boomerland is special) and muddled through the week only to become the hottest fucking stock on everyone’s mind starting late Thursday and rising 7% to close out the week +5.5%.  Why? Because the Boeing 737 Max could fly again this year. Yep, that’s right - the stock rose 7% because they are a supplier for a company who delivered 11 planes in September, had no new orders, and released an apocalyptic industry forecast last week but got encouraging news from the FAA on their most scandalous plane. Jebus, that was a long sentence. Let’s just say this: makes total sense and there’s nothing to see here.\n\nLet’s just slide right into BA, who *also* did not have a green Monday. BA touched a low of -4.8% on the week at open on Thursday but quickly rose back to green for the day before taking off overnight (pun fully intended so suck my Gremlin) to reach soaring heights of +2.75% for the week at open on Friday. Somewhat of a sensor issue shortly after takeoff and rolled into the weekend -0.2% for the week to 167.35. \n\nLet’s find a company that *did* get to participate in Monday’s extravaganza. Coca-Cola ($KO) got above $51/share on Monday but then Tuesday happened. And Wednesday. And Thursday. But Friday was at least flatish. Down -1.8% for the week to close out at $49.94/share.\n\nHON (Honeywell). A lot of action happened between pre-market Monday and close on Friday. Very little of that actually mattered. Closed the week +0.1%. It’s like the new person in The Villages - still has a lot of spunk but just wants to fit in with its slower friends at the Dow. (Just like KO, I have a raging conflict of interest here and I don’t think that tucking it into my waistband is going to help.)\n\nHSBC. It’s one week chart just looks like one long groan punctuated by a hiccup. Had a stellar Monday for +0.02% and then proceeded to dump. Bottomed out at -5.7% for the week on Thursday morning and recovered a bit to close out the week -2.6%. Why? Who knows, maybe investors think all this talk of legalizing weed in Mexico is bad for their business. \n\nI’m definitely going to be late for my tee time. One more.\n\nF (Ford) snazzy af on Monday flirting with +6% near open but proceeded give most of that up by Thursday morning. Investors saw the words “China” and “good” in the company’s sales report released Thursday and gave themselves CTE as they bashed their heads against the buy button as fast as they could. Closed out the week +4%. \n\nHope you enjoyed our tour through Boomerland for the week ending October 16th, 2020. Now get out of my AMC Gremlin, I have an appointment at the Putt-Putt.",
        "subreddit": "wallstreetbets",
        "title": "The Boomer Weekly October 16th, 2020",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jch9c7/the_boomer_weekly_october_16th_2020/",
        "created": 1602907725.0
    },
    {
        "author": "bullsd21",
        "created_utc": 1602636023,
        "id": "jaqacl",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Amc bullish!!!!! 🚀🚀🚀🚀🚀",
        "url": "https://deadline.com/2020/10/cinema-stocks-teeter-wall-street-ponders-possible-amc-entertainment-bankruptcy-1234596738/amp/?__twitter_impression=true",
        "created": 1602664823.0
    },
    {
        "author": "pizzapizzayoyo",
        "created_utc": 1602708024,
        "id": "jb93fi",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Popcorn any autist? Anyway we all know AMC is a lost cause and most likely will file for chapter 11 in the next month or so. That leaves cinemark which wasn't completely retarded ans has some cash to carry them through 2021 if covid keeps going. \n\nDisney recently said they want to push to streaming but really... they aren't going to make the $$ like the theater which in result leaves them in a bizzare position. \n\nSo two things to make this jump hard. Vaccine pending news will make this shit hard. Amc filing leaves one major player still in the market. If anything they could buy some amcs and rebrand em.",
        "subreddit": "wallstreetbets",
        "title": "CNK bitches",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jb93fi/cnk_bitches/",
        "created": 1602736824.0
    },
    {
        "author": "fallenangeI",
        "created_utc": 1602109941,
        "id": "j70z0r",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "AMC has been on the Regulation SHO threshold list for 13 days as of October 6. It also has almost 40% short interest, what are the chances of this having a mini squeeze? Mind you I couldn’t give a fuck about the fundamentals, only a potential catalyst, that being, possibly the shorts having to cover because of the SEC.",
        "subreddit": "wallstreetbets",
        "title": "$AMC short squeeze?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j70z0r/amc_short_squeeze/",
        "created": 1602138741.0
    },
    {
        "author": "SnapPunch",
        "created_utc": 1604001543,
        "id": "jkhfgj",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I have no special insights or articles to post other than what we already know.\n\nThe latest rumor is that we may see a takeover attempt by AMZN or NFLX at some point. There is also the possibility of recovery IF we don't go into a hardcore 2nd lockdown.\n\nPersonally I feel like this is one to watch, but there is a very real chance they will file bankruptcy. With bankruptcy comes the possibility of a pop like we saw with HTZ. This would be very hard to time, but it's another option to consider.\n\nAnyone smarter than me have better ideas or plays?",
        "subreddit": "wallstreetbets",
        "title": "Is AMC the next GME?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jkhfgj/is_amc_the_next_gme/",
        "created": 1604030343.0
    },
    {
        "author": "chungus_wungus",
        "created_utc": 1602855904,
        "id": "jca2gt",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Imagine yourself driving from your home with your significant other. An Amazon drone flies narrowly ahead as the sun sets beautifully in the distance. The children are in the backseats reading **On the Ethos of Being Bearish** on their Kindle devices as your loved one trades afterhours on MooMoo. You stop at a red light and see a holographic advertisement manifest itself from the Nikola Manufactured *Virtual Crosswalk*.\n\n***Amazon Movie Cinemas is proud to announce the release of the new remake, only in AMC approved theatres: WEEKEND AT BEARNIES 2. Now Playing***\n\nYou instinctively mutters aloud,\"Alexa, set destination for AMC and prepurchase 4 tickets for the 6:15pm viewing of the new Weekend at Bearnies 2.\" Instantly, you see the tickets purchase in realtime on your Tesla dashboard. Your wife smiles as she gets a Snapchat (SNAP +6.9%) notification from your Neighbor John, as she hastly mentions that she has to go home to clean the restroom. \n\n\nThis is the future of 2025. A year in which the walk in movie industry makes a comeback. Amazon(AMZN +2%) began the revitalization of the industry by buying AMC and renaming it from whatever it stood for to something more profound, *Amazon Movie Cinemas*. A new future envelops the movie industry. \n\nNow when new movies get released to cinemas across the world, they negotiate deals with AMC to provide IMAX to Prime Users, discounts to users who watch Amazon Original movies in theatres and 1 year exclusivity rights to future releases of new movies in theatres to Amazon Prime Video. \n\nThis is the future of walk in Cinemas in the US and potentially the entire world. P&amp;G is valued at $1200 a share, AMZN moons to $2000 post split and the movie industry is vitalized as Amazon installs repurposes the sprinkler systems in theatres to shower hand sanitizer over the whole room while viewing.\n\nThis\n\n\nIs\n\nThe\n\n\nFuture",
        "subreddit": "wallstreetbets",
        "title": "The Future of AMC - A University of Stanford Study on the potential outlook of cinema futures",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jca2gt/the_future_of_amc_a_university_of_stanford_study/",
        "created": 1602884704.0
    },
    {
        "author": "jnf_goonie",
        "created_utc": 1602611508,
        "id": "jaik13",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "RIP Cineplex and AMC \n\nhttps://ca.reuters.com/article/businessNews/idCAKBN26X2JJ",
        "subreddit": "CanadianInvestor",
        "title": "Disney says it's primary focus for releasing shows and movies will be online streaming",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/jaik13/disney_says_its_primary_focus_for_releasing_shows/",
        "created": 1602640308.0
    },
    {
        "author": "OSRS_CLONE_WARS",
        "created_utc": 1602082831,
        "id": "j6sejq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Amc options are currently trading for break even at long calls (december 18) is it worth it? I think so because looks like there isnt much going lower without just being bought out. Ik they are closing up shop for alot of theators but there also keeping some cherry picked ones out. They also are selling 15 milloin shares and a few investors are looking to get bulk for cheap, they havnt said what price they are selling it yet though. Might be current price.",
        "subreddit": "wallstreetbets",
        "title": "AMC, to good to be true?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j6sejq/amc_to_good_to_be_true/",
        "created": 1602111631.0
    },
    {
        "author": "monaliza24",
        "created_utc": 1603188423,
        "id": "jemkdy",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "So I’d like to buy leaps for covid affected stocks like $AMC $CCL and $CNK.\n\nI took a look and IV is over 100% for these options.\n\nNow I’m not sure if I should buy leaps or not. What’s the most sensible play here other than call spreads or common stocks? Does buying ITM option reduce IV exposure?\n\nEven if I buy deep ITM option, my concern is that, the open interest is low on LEAPs for these options, so if I buy deep ITM, what happens if no one wants to buy my deep ITM calls next year?",
        "subreddit": "options",
        "title": "LEAPs for covid affected stocks",
        "url": "https://www.reddit.com/r/options/comments/jemkdy/leaps_for_covid_affected_stocks/",
        "created": 1603217223.0
    },
    {
        "author": "Danieldinho7",
        "created_utc": 1602859105,
        "id": "jcaytn",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "What are your thoughts about me potentially YOLOing on theaters stock options, particularly AMC. It would be long term 01/20/23. Do you think a vaccine would be distributed out by then?  My only concern is the chance of these theaters going out of business before then. What are you thoughts?",
        "subreddit": "wallstreetbets",
        "title": "YOLOing on AMC options",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jcaytn/yoloing_on_amc_options/",
        "created": 1602887905.0
    },
    {
        "author": "DYLSTER501",
        "created_utc": 1602283270,
        "id": "j891jo",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Forget AMD its all about that AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j891jo/forget_amd_its_all_about_that_amc/",
        "created": 1602312070.0
    },
    {
        "author": "ibeg989",
        "created_utc": 1602790404,
        "id": "jbujja",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "AMC March 19 ‘21 calls",
        "url": "https://www.reddit.com/r/options/comments/jbujja/amc_march_19_21_calls/",
        "created": 1602819204.0
    },
    {
        "author": "DYLSTER501",
        "created_utc": 1602283366,
        "id": "j892ir",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Forget about AMD its all about that AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j892ir/forget_about_amd_its_all_about_that_amc/",
        "created": 1602312166.0
    },
    {
        "author": "Hvarfa-Bragi",
        "created_utc": 1602800134,
        "id": "jbxjlo",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Does AMC Theaters come back from Corona? Place your bets...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jbxjlo/does_amc_theaters_come_back_from_corona_place/",
        "created": 1602828934.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1602688241,
        "id": "jb2hbp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**US equities little changed: Dow +0.07%, S&amp;P 500 +0.09%, Nasdaq +0.09%, Russell 2000 +0.09%**\n\n* US equities little changed in Wednesday midday trading, after opening higher. Follows a decline in the prior session. Energy and industrials the notable outperformers. REITs, consumer discretionary, financials trailing. Treasuries little changed to a touch firmer. Dollar weaker vs the majors, particularly sterling. Gold up 1.0% after losing nearly 2% in the prior session. WTI crude up 1.6%.\n* Quiet session with nothing particularly incremental surrounding the higher-profile topics. **Earnings** beat rates remain elevated but bar also higher. **Fiscal stimulus** headlines seem to be more noise than news given the still fairly wide gap between Democrats and Republicans over the size and scope of the package. **Coronavirus** headlines have revolved around the recent pauses in vaccine and treatment trials (though optimism on both fronts remains elevated) and worries uptick in US cases suggest next big wave has begun. Not much new on **politics** where the key themes as of late have revolved around dampened concerns about a contested election and the potential for a Democratic sweep (though Senate expected to be very close).\n* Bank earnings in focus**.** **BAC-US** beat but lower quality as NII/NIM remain pressured. **WFC-US** mixed with NII/NIM and expenses worse and provisions and fee income better. **GS-US** had a blowout Q with trading, equity investments and expense control bright spots. **USB-US** and **PNC-US** both beat on lower provisions and better fee income. Elsewhere, **UNH-US** beat but guidance raise may have underwhelmed. **ASML-US** beat though some focus on slower node transition and lower EUV targets. **COP-US** reportedly in talks to acquire **CXO-US** . **MDRX-US** up big on news it will sell its CarePort Health business for $1.35B. **AMC-US** hit by bankruptcy concerns.\n\n**Notable Gainers:**\n\n* \\+30.9% **MDRX-US** (Allscripts Healthcare): Will sell CarePort Health business to WellSky for $1.35B; said proceeds would be used for investment in its solution portfolio, deleveraging, and significant share repurchases; analysts generally positive.\n* \\+17.7% **NIO-US** (NIO): Upgraded to overweight from neutral at JPMorgan; noted China's EV demand likely to quadruple by 2025 with NIO positioned as a leader in the premium market and able to post meaningful upside in the long term.\n* \\+11.5% **CXO-US** (Concho Resources): Bloomberg reported that COP-US is in talks to acquire the company; provided no terms but suggested a deal could be announced within weeks; added deal could be year's largest oil and gas takeover.\n* \\+5.9% **NYT-US** (New York Times): Initiated at overweight at Morgan Stanley; noted its conviction market-share leadership in paid news will lead to rising scale advantages; sees opportunity to more than double digital-only subscriptions by 2025.\n* \\+5.0% **INFY-US** (Infosys): FQ2 earnings and revenue beat with both revenue and operating margin guidance raised; dividend increased by 50% on stronger free cash flow; Financial Services, Retail, Hi-Tech segments the best performers with Digital revenues outpacing Core.\n* \\+4.9% **PPC-US** (Pilgrim's Pride): Entered plea agreement with DOJ over investigation into sales of broiler chicken products; to pay fine of $110.5M; WSJ reported penalty cut in exchange for cooperation in case against ex-CEO Jayson Penn.\n* \\+0.9% **USB-US** (US Bancorp): Q3 EPS beat with help from lower provisions; NII also ahead with unexpected NIM expansion; fee income a particular bright spot with some focus on a better rebound in payments volume and strength in mortgage banking; core expenses largely in line.\n\n**Notable Decliners:**\n\n* \\-17.6% **AMC-US** (AMC Entertainment): Disclosed it would deplete its cash by early 2021 and is considering liquidity measures including additional debt/equity financing and asset sales; Bloomberg reported the company and lenders may be preparing for bankruptcy though the CEO said raising equity capital is the first focus.\n* \\-4.5% **SPLK-US** (Splunk): Downgraded to sell from buy at UBS as coverage was assumed; channel checks suggested a sharply lower rate of annual recurring revenue growth than the firm cites, sees valuation inflated.\n* \\-3.7% **WFC-US** (Wells Fargo): Q3 earnings missed; NII/NIM below consensus though fee income better on mortgage strength (service charges, card income also solid); lower provision a bright spot but big increase in expenses driven by customer remediation and restructuring charges.\n* \\-3.2% **BAC-US** (Bank of America): Q3 EPS beat with help from lower provisions/credit costs and taxes; Investing Banking also ahead; however, NII and NIM remained pressured by depressed rate and soft lending (total EOP loans down 4% q/q); fee income light with trading missing (in both FICC and Equities) vs upside surprises at peers; expenses missed even when excluding legal.\n* \\-2.1% **KR-US** (Kroger): Downgraded to equal weight from overweight at Wells Fargo; suggested possible flipsides from pandemic strength including erosion of share gains leading to competitive price cuts; noted valuation no longer compensates for risk from unionized workforce.\n* \\-1.6% **ALB-US** (Albemarle): Downgraded to underperform from sector perform at RBC Capital Markets; said near-term lithium pricing outlook remains muted, which could lead to new contracts signed at lower price levels; also cautious on expansion projects given low utilization rates.\n* \\-1.0% **UNH-US** (UnitedHealth): Q3 EPS, revenue beat; raised FY20 EPS guidance; Optum earnings a bit light, while ending people served missed in both Medical and Standalone Part D; analysts cautious on domestic medical enrollment, said MLR beat driven by lower utilization.\n\n09:59:42 AM CDT on 14 Oct '20",
        "subreddit": "stocks",
        "title": "Morning Market Synopsis - Wednesday, Oct. 14, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/jb2hbp/morning_market_synopsis_wednesday_oct_14_2020/",
        "created": 1602717041.0
    },
    {
        "author": "horseradishking",
        "created_utc": 1602612757,
        "id": "jaizex",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMC warns it will run out of cash at end of year/beginning of 2021 -- be greedy when others are fearful??",
        "url": "https://finance.yahoo.com/m/33c81534-7371-3b17-ba79-2c5d4cd14fc2/amc-scrambling-to-raise-cash.html",
        "created": 1602641557.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1603204229,
        "id": "jeqlym",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**US equities higher: Dow +0.73%, S&amp;P 500 +0.82%, Nasdaq +0.80%, Russell 2000 +0.80%**\n\n* US equities higher in Tuesday morning trading after coming under pressure to start the week with the major indexes down \\~1.5% on fairly broad-based weakness. Financials best performer with regional banks leading the upside on earnings (better NII takeaways). Consumer discretionary another standout with retail, autos and casinos among the bright spots. Not much dispersion elsewhere. Energy only sector lower. Treasuries mostly weaker with more curve steepening. Dollar stronger vs yen but weaker vs euro. Gold down 0.4%. WTI crude down 1%, near worst levels.\n* **Fiscal stimulus** continues to grab most of the attention. Pelosi and Mnuchin have continued to narrow their differences and the two sides will talk again today. However, there are still a number of big stumbling blocks, including the lack of appetite among Senate Republicans for a large stimulus package Very quiet elsewhere. **Politics** the other big story with Biden up 9 points over Trump in the latest national poll but Trump cutting into Biden's lead in Pennsylvania. In terms of the **coronavirus**, MRNA-US CEO said its vaccine could get EUA in December, more mitigation measures in Europe and some focus in US on successful school reopenings.\n* **Q3 earnings** activity has picked up today with beat rates remaining elevated. According to FactSet, more than 86% of the companies that have reported earnings thus far have surpassed consensus EPS expectations. In aggregate, earnings are beating the consensus by more than 18%, not far from the record beat rates seen in Q2. Companies leveraged to at-home themes continue to report some of the strongest results though bar has moved higher. Outside of earnings, more energy M&amp;A may be on tap with **PXD-US** reportedly in talks to acquire **PE-US** . **INTC-US** sold NAND business to SK Hynix for just over $9B. DOJ to file widely anticipated antitrust lawsuit against **GOOGL-US** today.\n\n**Notable Gainers:**\n\n* \\+16% **LOGI-US** (Logitech): Big fiscal Q2 beat and company raised FY guidance; Street takeaways positive, highlighting work-from-home and stay-at-home tailwinds; also discussed strong growth across segments, record GMs on volumes, mix, and reduced promotions, and second straight guidance increase.\n* \\+8.3% **CCK-US** (Crown Holdings): Q3 earnings and revenue beat; NA results boosted by accelerating beverage-can shipment growth; raised FY EPS guidance; said will initiate a dividend in Q1'21 and expects to opportunistically repurchase shares in 2021.\n* \\+6.6% **RF-US** (Regions Financial): Q3 EPS beat with the focus on NII upside (NII pressure a big overhang on bank-stock performance last week despite earnings beats), in-line NIM performance, fee income upside on strength in mortgages and lower provisions and NCOs.\n* \\+6% **IQV-US** (IQVIA Holdings): Q3 earnings and revenue beat with guidance mostly ahead; company to resume share buybacks; analysts noted strength in Technology &amp; Analytics segment though R&amp;D Solutions weaker.\n* \\+5.7% **CMA-US** (Comerica): Big Q3 EPS beat on lower provisions/good credit quality, better fee income and lower expenses; in addition, NII was largely in line with expectations, which was considered a positive; some moving pieces in guidance but deemed largely in line.\n* \\+4.5% **PNR-US** (Pentair): Q3 earnings and revenue beat; highlighted strength in residential markets (particularly Pool business); Industrial &amp; Flow results not as bad as feared; management noted some stabilization commercial/industrial trends; raised FY20 guidance.\n* \\+2.9% **ACI-US** (Albertsons): Big fiscal Q2 EPS and EBITDA beat; ID sales up 13.8% , helped by 243% growth in digital sales and increase in store sales; margin expansion another bright spot; guided FY20 EPS and EBITDA above the Street, highlighting meaningful tailwind for product demand and overall basket size from the coronavirus; authorized $300M share repurchase program.\n* \\+2.2% **TRV-US** (The Travelers Cos): Q3 core revenue, EPS beat; loss and expense ratios both better than estimates; net premiums written also beat on Personal segment upside; analysts noted catastrophe losses smaller than expected, highlighted renewal rate strength even with price increases.\n* \\+2% **PG-US** (Procter &amp; Gamble): FQ1 EPS, revenue beat; raised EPS, organic revenue growth projections guidance; increased y/y repurchases for FY21; analysts highlighted borad-based growth, guidance increase signaling confidence to deliver growth through tough comps.\n\n**Notable Decliners:**\n\n* \\-11.4% **AMC-US** (AMC Entertainment): Entered into new 15.0M share at-the-market equity distribution agreement; reported weaker-than-expected preliminary Q3 revenues and said it expects to take material non-cash charges relating to the impairment of long-lived assets, indefinite-lived intangible assets and goodwill.\n* \\-6.4% **IBM-US** (IBM): Q3 EPS and revenue in line with 8-Oct guidance; GM beat, but pre-tax margin missed; analysts said both top and bottom lines missed consensus adjusting for FX, taxes, flagged weaker Mainframe, Red Hat revenue trends.\n* \\-4.2% **SYF-US** (Synchrony Financial): Q3 earnings missed; RSAs and NII/NIM weaker than consensus; expenses higher than the Street; provision lower than expected with credit metrics somewhat better; yesterday announced extension of deal with Sam's Club.\n* \\-4% **HXL-US** (Hexcel): Q3 earnings, revenue, and margins missed; ongoing weakness from all segments with sequential decline in Commercial Aerospace; cautioned channel adjustments could take another two or three quarters to work through; offered no guidance.\n\n09:23:37 AM CDT on 20 Oct '20",
        "subreddit": "stocks",
        "title": "Morning Market Synopsis - Tuesday, Oct. 20, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/jeqlym/morning_market_synopsis_tuesday_oct_20_2020/",
        "created": 1603233029.0
    },
    {
        "author": "lawson2g",
        "created_utc": 1603383038,
        "id": "jg2l90",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "That dip at the end was AMC.. Im glad it happened though. I learned not to panic sell. And lost almost nothing from the entire thing",
        "url": "https://i.redd.it/r7lzvkkg7ou51.png",
        "created": 1603411838.0
    },
    {
        "author": "CapitalLie",
        "created_utc": 1603997750,
        "id": "jkg70i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "Reached my yearly goal thanks to AMC!",
        "url": "https://i.redd.it/m5h5dxabz2w51.jpg",
        "created": 1604026550.0
    },
    {
        "author": "Meme_Pope",
        "created_utc": 1603724788,
        "id": "jig77r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The National Suicide Prevention Hotline needs to preemptively reach out to AMC holders",
        "url": "https://i.redd.it/ooni54dnfgv51.jpg",
        "created": 1603753588.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1601911190,
        "id": "j5labu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **US equities higher: Dow +1.09%, S&amp;P 500 +1.14%, Nasdaq +1.53%, Russell 2000 +1.82%**\n\n* US equities higher in Monday midday trading after snapping a four-week losing streak last week. Materials, energy, healthcare among the standouts. Defensives underperforming with REITs the only sector lower. Treasuries weaker some notable curve steepening. 10-year yields highest since late August. Dollar outperforming yen but lagging on euro cross. Gold up 0.6% following a 2%+ gain last week. WTI crude up 6.3%, near best levels, after losing \\~8% last week.\n* **President Trump could be discharged from the hospital as soon as today**. However, still a lot of uncertainty given the disclosure that he had received supplemental oxygen and a steroid called dexamethasone usually given to people seriously ill with COVID-19. **House Speaker Pelosi said on Sunday that lawmakers are \"making progress\" on another coronavirus relief bill** after Trump called for swift action, but she did not offer any details. **Biden expanded lead over Trump in the national polls** following the chaotic first presidential debate. NYC, France and Italy all reportedly set to impose **new coronavirus mitigation measures**.\n* Pretty quiet elsewhere with so much of the focus on Trump's coronavirus infection, election implications, and fiscal stimulus. **September ISM Services index was stronger than consensus**. WSJ discussed how **big tech stocks may be among most vulnerable to** **a** **corporate tax increase** that could result from a Democratic sweep in November. **Heightened regulatory on tech** also a big them with antitrust lawsuit against GOOGL-US expected late this week. There were a number of articles highlighting **concerns about a pickup in permanent job losses**. NY Times also discussed how **job losses are spilling over to many industries not impacted by the coronavirus**.\n* Several M&amp;A headlines in focus. **BMY-US** to acquire **MYOK-US** for $13.1B. NY Post said Carl Icahn would accept a $50 per share bid for **NAV-US** from Traton. **CAT-US** to acquire O&amp;G division from the Weir Group for $405M **BBIO-US** to acquire **EIDX-US** . **TRP-US** to acquire rest of **TCP-US** it does not already own. **FTV-US** positively preannounced. **DKNG-US** out with a 23M share secondary. **NCLH-US** extended sailing suspension. **AMC-US** and **CNK-US** down on closure of Regal theaters and delay of new Bond film. **PZZA-US** announced new CFO. **GAN-US** signed 10-year agreement with **WYNN-US** to provide iGaming and Internet sports betting in Michigan.\n\n**Notable Gainers:**\n\n* \\+58.2% **MYOK-US** (MyoKardia): BMY-US confirmed it will acquire company for $225/sh in cash; represents a \\~61% premium over Friday's close; BMY expects transaction to add a significant growth driver but may be minimally dilutive to 2021-22 EPS.\n* \\+42.7% **EIDX-US** (Eidos Therapeutics, Inc.): Agreed to be acquired by BBIO-US in a cash-and-stock deal valued at $73.26 a share; represents a 41% premium to prior close.\n* \\+14.2% **LTHM-US** (Livent Corp.): Barron's favorable on lithium miners on growing demand from Tesla and other car makers, most notably Livent with assets around the world and strong growth forecasts among street analysts; also mentioned positively were ALB-US and SQM-US .\n* \\+13.3% **JELD-US** (JELD-WEN Holding): Upgraded to overweight from equal weight at Wells Fargo; said windows and interior doors channel inventories are lean and lead times may have increased; positive on pricing announcements and improvements in window quality control.\n* \\+12.8% **HMSY-US** (HMS Holdings): Bloomberg reported the company is exploring strategic options including a sale; HMS has been strongly impacted by Covid-19 on lower volume as US hospitals allow fewer elective procedures; stock has underperformed the S&amp;P by almost 50% in past year.\n* \\+9.8% **REAL-US** (The RealReal, Inc.): Announced it is partnering with Gucci through the end of the year to launch an online shop featuring pre-owned Gucci items and to promote circularity for luxury fashion.\n* \\+6.5% **REGN-US** (Regeneron Pharmaceuticals): President Trump's COVID-19 treatment included company's experimental antibody cocktail; also upgraded to overweight from neutral at Cantor Fitzgerald, citing Dupixent as growth driver in both short- and long-term.\n* \\+5.0% **DOCU-US** (DocuSign): Upgraded to overweight from equal-weight at Morgan Stanley; cited valuation following 19% decline since September, strong fundamentals coupled with durable COVID tailwinds; also said pandemic should help with new customer acquisition and renewal rates.\n* \\+4.1% **CRWD-US** (CrowdStrike Holdings, Inc.): Upgraded to buy from neutral after new analyst assigned at Goldman Sachs; noted disruptive platform in Endpoint Security market, room for upside with revenue growing at near double the rate of peers.\n* \\+2.6% **GILD-US** (Gilead Sciences): President Trump received remdesivir as part of its treatment for Covid-19.\n* \\+2.6% **NAV-US** (Navistar): NY Post reported Carl Icahn would be willing to accept bid of \\~$50 per share; Volkswagen's Traton, Navistar's largest shareholder, expected to finish its due diligence by the end of the week and increase its $43 per share offer.\n* \\+2.1% **FTV-US** (Fortive Corp.): Positive Q3 preannouncement; expects revenue to be up 2% vs prior guidance for flat to down 3%; Professional Instrumentation (PI) and Industrial Tech (IT) both tracking better than expected; also expects positive y/y growth in operating profit ibn both segments.\n* \\+2% **ATUS-US** (Altice US): Upgraded to outperform from market perform at Bernstein; cited valuation; notes underlying fundamentals bottomed earlier this year; expects expanded investments in 2021; believes Q3 results will help rebuild investor trust.\n\n**Notable Decliners:**\n\n* \\-10.8% **AMC-US** (AMC Entertainment): Cineworld announced the closure of its more than 500 US Regal theaters; new James Bond movie \"No Time To Die,\" pushed back from November to April 2021.\n* \\-2.0% **NCLH-US** (Norwegian Cruise Line Holdings): Announced an extension of its previously announced suspension of global cruise voyages to include all voyages embarking between 1-Nov and 30-Nov across its three brands.\n* \\-1.4% **DNKN-US** (Dunkin' Brands): Downgraded to neutral from buy at BTIG; cited valuation following doubling of share price since March; also expect decline in franchisee cash flow this year, focus on development outside core geographies could weigh on 2021 growth.\n\n10:10:55 AM CDT on 05 Oct '20",
        "subreddit": "stocks",
        "title": "Morning Market Synopsis - Monday, Oct. 5, 2020",
        "url": "https://www.reddit.com/r/stocks/comments/j5labu/morning_market_synopsis_monday_oct_5_2020/",
        "created": 1601939990.0
    },
    {
        "author": "emadrid2099",
        "created_utc": 1602714553,
        "id": "jbb4py",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "If AMC goes bankrupt, my calls will print, right?",
        "url": "https://i.redd.it/23aobskpz4t51.jpg",
        "created": 1602743353.0
    },
    {
        "author": "BeyondTheGreenHill",
        "created_utc": 1602278104,
        "id": "j87j0n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC will go up after a vaccine is available.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/j87j0n/amc_will_go_up_after_a_vaccine_is_available/",
        "created": 1602306904.0
    },
    {
        "author": "Tendie_Town_420",
        "created_utc": 1602801389,
        "id": "jbxwk2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on AMC?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jbxwk2/thoughts_on_amc/",
        "created": 1602830189.0
    },
    {
        "author": "OneFourtyFivePilot",
        "created_utc": 1603425321,
        "id": "jgflt9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Read the comments on AMC stock. I researched and it just ain’t clicking yet with me. Any specific smart folks. I could watch a video on?",
        "subreddit": "RobinHood",
        "title": "Any video tutorials for Put Options",
        "url": "https://www.reddit.com/r/RobinHood/comments/jgflt9/any_video_tutorials_for_put_options/",
        "created": 1603454121.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1603861047,
        "id": "jjhoqu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "If they can pay for ads, they can pay for my tendies. AMC calls, all in",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/jjhoqu/if_they_can_pay_for_ads_they_can_pay_for_my/",
        "created": 1603889847.0
    },
    {
        "author": "DCSquared07",
        "created_utc": 1603716622,
        "id": "jidxjs",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Now Playing: AMC",
        "url": "/r/Zombie_Bonds/comments/jib9sy/now_playing_amc/",
        "created": 1603745422.0
    }
]