[
    {
        "author": "psychotrader00",
        "created_utc": 1607462506,
        "id": "k9dc5v",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": " **PsychoMarket Recap - Tuesday, December 8, 2020**\n\nStocks turned positive Tuesday, with the S&amp;P 500 and Dow Jones shaking yesterday’s losses and the Nasdaq recording a new intraday recor. Market participants continue to weigh rising coronavirus cases in the United States and optimism surrounding a vaccine and additional fiscal stimulus. \n\nIn Washington, lawmakers continue to negotiate in order to agree on measures to fund the government and provide another virus relief package. Lawmakers are poised to vote tomorrow Wednesday on a resolution to push back the deadline to fund the government from this Friday to next week in order to avoid a government shutdown, House Majority Leader Steny Hoyer said. We’ll closely monitor developments in this matter. \n\nIn an effort to support the economy, a bipartisan group of Senators unveiled a new stimulus proposal worth $908 billion, a sum greater than the ceiling Senate Leader Mitch McConnel (Rep.) set but below the Democrat’s original $2 billion proposal. House Speaker Nancy Pelosi (Dem.) and Senate Minority Leader Chuck Schumer (Dem.) have indicated they support the proposal and Senator Bill Cassidy (Rep.) told Fox News he is confident the President and Senator McConnell will support the bill. We’ll have to wait and see how it plays out but we do not expect the passage of any stimulus at least until Biden’s administration takes over.\n\nDr. Anthony Fauci, the top infectious disease expert in the United States, says the full impact of Thanksgiving gatherings hasn’t been seen yet. He said, “The blip from Thanksgiving isn't even here yet. So we’re getting those staggering numbers of new cases and hospitalizati0ns before we even feel the full brunt of the Thanksgiving holiday”. The US is averaging nearly 200,000 infections and 2,237 deaths in the last seven numbers, the deadliest week in the pandemic since late April, according to Johns Hopkins University. There are well over 100,000 patients hospitalized with coronavirus. Yesterday, the US recorded around 202,000 new daily infections, 101,487 patients hospitalized, and 1,522 deaths, according to Johns Hopkins Univerisity.\n\nDespite rising cases,  the market is reacting positively to the prospects for widespread vaccine distribution next year and the possibility of additional fiscal stimulus in the US. Margaret Keenan, a 90-year-old woman from the United Kingdom, became the first person in the world to receive the Pfizer/BioNTech vaccine outside of the clinical trial. While expectations for growth in 2021 remain high, we expect volatility in the market in the short-term, given the surge in coronavirus cases and the reimposition of restrictions across the nation. California recently placed more than 85% of its residents under stay-at-home order after ICU capacity fell below 15%.\n\nLooking ahead, market participants will continue to eagerly follow developments on the coronavirus vaccine. The U.S. Food and Drug Administration is expected to convene its outside scientific advisory board on Thursday to discuss Pfizer’s (PFE) emergency use authorization request for its vaccine. The advisors could vote as soon as that day whether to recommend that the FDA green-light the inoculation and allow the first phase of roll-outs to states. Moderna (MRNA) has also filed an emergency use authorization with the FDA. The FDA is expected to make an announcement about Moderna’s vaccine sometime this week as well. \n\n**Highlights**\n\n* The FDA says the Pfizer $PFE vaccine meets all safety and success criteria. They are expected to approve the vaccine in the coming days. \n* A QuantumScape executive claimed the company’s new solid-state lithium-metal battery being developed initially developed for electric cars could be powerful enough for use in electric aircraft. The director said, “Electric aviation starts to look a lot more attractive and viable when you have this kind of energy density and power”.\n* After falling to the low $20s following Citron’s report, Palantir (PLTR) has mounted a remarkable comeback, back close to $30. Today it was announced the company was awarded a $44.4 million contract by the FDA for data analytics services to speed up review of new medicines, according to a company statement. \n* Amazon $AMZN target set by Needham &amp; Co to $3,700 at BUY rating. Stock currently around $3150s.\n* Equifax $EFX target raised by Needham from $200 to $210. Stock currently around $170s.\n* Fedex $FDX target rasied by UBS Group from $320 to $380 at BUY. Stock currently around $297.\n* Intuit $INTU with two target raises. Stock currently around $370s.\n   * Keycorp at $400 OVERWEIGHT\n   * Piper Sandler at $418 OVERWEIGHT\n* Keros Therapeutics $KROS target raised by Piper Sandler from $75 to $95. Stock currently around $75.\n* StitchFix $SFIX target raised by Keycorp from $36 to $56 at OVERWEIGHT. Stock was on a tear today!\n\n\"The way to get started is to quit talking and begin doing.\" - Walt Disney",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tues, December 8, 2020. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/k9dc5v/here_is_a_market_recap_for_today_tues_december_8/",
        "created": 1607491306.0
    },
    {
        "author": "notlikethis1994",
        "created_utc": 1609160301,
        "id": "klq2wt",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "2020 was a great year to trade the news. COVID, stimulus bill, cyberattack, and many countless other examples were news that the market only reacted to after a while, letting astute traders establish positions early before the pumps (or dumps) began.\n\nSo what is the biggest developing story in 2021?\n\nIt's the 2021 tax season.\n\nTens of millions of people started trading in 2020, probably including you, fellow retard. Robinhood's userbase alone went up by 30% in mid June. What does this mean for 2021? Well all these traders need to pay taxes.\n\nThe best tax season play is $HRB.\n\nHere's why. H&amp;R Block is a pure-play tax prep company specializing in doing taxes for you or an online tax prep software. If you did a bunch of trading in 2020, you need special tax help, because online tax prep software doesn't handle important rules like wash sales or capital loss carryover. Miss a wash sale here or there and expect Mr. John IRS to give you a knock on the door for a special consulation ( ͡° ͜ʖ ͡°)\n\nHRB also has a small market cap of 2.8B and a low P/E of 15.2. Management is seeing a massive rebound from COVID lows and continues to pay the 7% dividend and also bought back $150 million in shares last quarter. \\[All wall street analysts give it a price target of $21\\]([https://www.nasdaq.com/market-activity/stocks/hrb/analyst-research](https://www.nasdaq.com/market-activity/stocks/hrb/analyst-research)).\n\n97% of HRB shares are also owned by institutions.\n\nSo you might think $INTU is a good play, and you're not wrong, but the biggest 🚀🚀🚀 potential is $HRB. $INTU is overbought and focused on self-service tax prep for normies while $HRB is a better tax prep company for traders and is also undervalued.\n\nBuy low and sell high. Position yourself for the 2021 tax season with 🚀🚀🚀 $HRB 🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "Are you ready for the massive 2021 tax season? A sleeping giant trade for the end of 2020 ($HRB)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/klq2wt/are_you_ready_for_the_massive_2021_tax_season_a/",
        "created": 1609189101.0
    },
    {
        "author": "yakkamah",
        "created_utc": 1608744666,
        "id": "kixaxl",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Courtesy of The Great Correction from Yahoo.\n\nSKLZ family and future family...\n\nI took some time and created an accurate DD resource for anyone new and curious about SKLZ and its prospects as an investment going forward. This should serve as a good jumping off point for anyone who wants to research further.\n\nTo the best of my knowledge, everything here is FACT and easily verifiable with a google search and/or listening to some of the recent interviews with the CEO, who by the way, is borderline giddy in some of them at the prospect of finally going public.\n\nSo without further ado... This is why I sincerely believe that being able to buy into this company at the current valuation is a VERY rare opportunity with huge long-term upside potential.\n\nMARKET GROWTH&gt;&gt;&gt;\n\n\\-The mobile game market is currently experiencing explosive growth.\n\n10 years ago it was an 8B market. Today it is 68B. In 2025 it is projected to be a 150B market.\n\n\\-Video games are rapidly becoming the leading form of entertainment.\n\n\\-Already more popular than books, movies and music, video games are on a path to even eclipse TV.\n\n\\-SKLZ DOES NOT CREATE GAMES. SKLZ provides a PLATFORM for game developers to monetize their creations through competition.\n\n\\-There are currently 10M game developers world-wide that are are looking for the best way to monetize.\n\n\\-Before SKLZ, game developers relied on advertising and in-app purchases to monetize their creations.\n\n\\-SKLZ has found that developers who monetize their games through competition (game-centric) instead of advertising are up to 5X More profitable.\n\n\\-SKLZ will run 2B (yes BILLION) tournaments in 2022.To put that in perspective, that's 1700 tournaments EVERY SECOND.\n\n\\-SKLZ user engagement (minutes a day spent gaming) trumps many other popular platforms.\n\nSKLZ 62 minutesTikTok 52Facebook 41YouTube 40Snap 28Mobile Gaming Average 17\n\nMARKET OPPORTUNITY&gt;&gt;&gt;\n\n\\-90% of SKLZ revenue comes from North America\n\n\\-TAM outside of North America is roughly 4X as large.\n\n\\-SKLZ currently has 2.7M monthly active users.\n\n\\-Total MAU world-wide is 2.7 Billion.\n\nThat mean currently SKLZ has only penetrated .1% (that's 1/10th of one percent) of the potential market. It's almost impossible to imagine a longer runway for potential growth.\n\nMOAT&gt;&gt;&gt;\n\n\\-SKLZ Competitive moat is its Anti-cheat tech which involved years of data science development.\n\n\\-SKLZ measures 300 individual data points a minute during gameplay.\n\nThink McAfee Anti-virus but specifically designed for competition-based games.\n\n\\-58 issued or pending PATENTS for this Anti-cheat technology.\n\nINVESTORS&gt;&gt;&gt;\n\nThe people behind Flying Eagle Acquisition Corporation, the company that merged with SKLZ to take them public are the same people that took DKNG public through Diamond Eagle. Yes... These are the Exact Same Guys.\n\n\\-PIPE investors are of the highest quality.\n\n\\-Wellington, Fidelity, Franklin Templeton, Nueberger Berman.\n\n\\-Existing SKLZ stockholders and PIPE investors have agreed to a 24-month lock up period, a testament to all involved party's faith in the business.\n\n\\-SKLZ has been able to deliver incredibly consistant, predictable growth since 2017.\n\n\\-In 2017, SKLZ met with Flying Eagle (DKNG guys) and provided them with growth projections for 3 years out.\n\n\\-SKLZ has met its growth projections every quarter within 1%-5% since 2017.\n\n\\-SKLZ is expected to grow at 57% CAGR through 2022.\n\nFINANCIALS 2020 Q#/YTD&gt;&gt;&gt;\n\n\\-Third Quarter Revenue of 60M, Up 92% YoY-Revenue YTD of 162M, up 91% Over Prior Year-Affirming Full Year Guidance of 255M\n\n\\-Gross Margins of 90%+-Long-term projected EBITDA of over 30%.\n\nVALUATION DISPARITY&gt;&gt;&gt;\n\n\\-At $20, SKLZ is valued at Approximately 12X 2022 Revenue (P/S 12)\n\n\\-Currently SKLZ is valued at Roughly 24X 2020 Revenue (P/S of 24)\n\n\\-Unity Software, a company in a very similar space, is currently valued at 60X Revenue (P/S of 60)\n\nCEO&gt;&gt;&gt;\n\n\\-SKLZ CEO Andrew Paradise is a Big-Idea kind of a guy.\n\n\\-He previously founded and sold his startup AisleBuyer, a company that let consumers check out in stores via their mobile phones, to intuit in 2012.\n\n\\-He is always talking about his company's \"100-year vision\". That vision- Creating the \"competition layer\" of the internet.\n\n\\-My favorite quote from him from a recent interview....\n\n\"What a lot of people don't understand about our business is that SKLZ is not so much a video game system as much as it is.... (wait for it...... ;) a DATA AND FINANCIAL PAYMENTS SYSTEM.\n\nAka... FINTECH.\n\nBig things in the future here folks, short AND long-term.\n\nAs always... Good Luck!!!!",
        "subreddit": "wallstreetbets",
        "title": "$SKLZ DD LETS GO BULL GANG",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kixaxl/sklz_dd_lets_go_bull_gang/",
        "created": 1608773466.0
    },
    {
        "author": "piss-in-a-bottle",
        "created_utc": 1607451825,
        "id": "k99p2g",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "**Sales Growth**\n\nPalantir's (PLTR) growth increased by 51.87% in the last quarter. As shown within Figure 1, this is a quick and promising recovery from the COVID quarter. This coupled with the downturn of COVID cases and PLTR's active involvement in combatting the virus should continue to enable revenue uptick. It should be particularly noted that PLTR'S September Net Income (\\~900m) has increased dramatically now they have signed a number of significant contracts.\n\n&amp;#x200B;\n\n**DO WALL STREET ANALYSTS RECOMMEND INVESTORS BUY SHARES OF PALANTIR TECHNOLOGIES?**\n\n6 Wall Street analysts have issued \"buy,\" \"hold,\" and \"sell\" ratings for Palantir Technologies in the last year. There are currently 5 hold ratings and 1 buy rating for the stock, resulting in a consensus recommendation of \"Hold.\" This is relevant as of 12/2. **I got banned before making this post because the mods are fgts so I'm too lazy to update.**\n\n&amp;#x200B;\n\n**WHEN IS PALANTIR TECHNOLOGIES' NEXT EARNINGS DATE? SHALL I GET SHARES TO HOLD FOR GLORIOUS TENDIES?**\n\nPalantir Technologies is scheduled to release its next quarterly earnings announcement on Thursday, February 11th 2021. Holding shares until this point would be my advice, especially given their newly executed contracts with substantial SLAs.\n\n&amp;#x200B;\n\n**WHEN DID PALANTIR TECHNOLOGIES IPO?**\n\n(PLTR) raised $0 in an initial public offering (IPO) on Wednesday, September 30th 2020. The company issued 257,100,000 shares at $0.00 per share. None served as the underwriter for the IPO. This is a NEW stock. It will be volatile, as is a lot of IPOs.\n\n&amp;#x200B;\n\n**WHO ARE PALANTIR TECHNOLOGIES' MAJOR SHAREHOLDERS?**\n\nPalantir Technologies' stock is owned by a variety of retail and institutional investors. Top institutional shareholders include Point72 Asset Management L.P. (1.95%), BlackRock Inc. (1.91%), Soros Fund Management LLC (1.20%), Allen Operations LLC (0.45%), Myriad Asset Management Ltd. (0.31%) and Public Sector Pension Investment Board (0.29%). Company insiders that own Palantir Technologies stock include Alexander C Karp, Alexander D Moore, David A Glazer, Matthew A Long, Shyam Sankar and Stephen Andrew Cohen.\n\n**WHAT IS PALANTIR TECHNOLOGIES' STOCK PRICE TODAY?**\n\nOne share of PLTR stock can currently be purchased for approximately $28.87. High band priced at 36.70 by EOY based on current trends. Low band priced at $21.10 by EOY based on current trends. This prediction is indicative of current trends, however would not be a sign for future performance. My personal view is if you own shares, hold them. Similar companies within PLTR's industry Oracle (ORCL), SAP (SAP), Shopify (SHOP), ServiceNow (NOW), Intuit (INTU), Square (SQ), Snowflake (SNOW), Activision Blizzard (ATVI), Autodesk (ADSK), VMware (VMW) on average have shown a steady uptick of growth and will continue to do so given the future viability of the product. Buying is under your own discretion, if you think that big data is going to be a part of the future then consider a buy. If not, don't.\n\n&amp;#x200B;\n\n**TLDR**: Newly IPO'd company, high likelihood to continue to grow exponentially over time now commercialised, strong contracts but volatile stock. \n\n**Recommendation:** Ban anyone who bad-mouths PLTR",
        "subreddit": "wallstreetbets",
        "title": "PLTR Stock - Main Summary Points",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/k99p2g/pltr_stock_main_summary_points/",
        "created": 1607480625.0
    },
    {
        "author": "InnerShinigami",
        "created_utc": 1606966516,
        "id": "k5phwh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "With so many people using Robinhood now (which uses Turbotax for easy tax imports) and people going to need help with taxes this upcoming filing from the government payouts that happened this year, I wonder if Intuit will have a huge first half of the year with its Turbotax software. When would be the good options timing for this play anyways? End of next year, mid year, not sure when they would report on earnings for this timeframe. Thanks friends.",
        "subreddit": "options",
        "title": "Options on Intuit, maybe?",
        "url": "https://www.reddit.com/r/options/comments/k5phwh/options_on_intuit_maybe/",
        "created": 1606995316.0
    },
    {
        "author": "ChardsyDoesOneWeed",
        "created_utc": 1608497470,
        "id": "kh21yh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Connecting Intuit and Robinhood?",
        "url": "https://www.reddit.com/r/RobinHood/comments/kh21yh/connecting_intuit_and_robinhood/",
        "created": 1608526270.0
    }
]