[
    {
        "author": "ASoftEngStudent",
        "created_utc": 1589776463,
        "id": "glun2n",
        "num_comments": 536,
        "num_crossposts": 0,
        "selftext": "In this week's edition of DDDD (Data-Driven DD), I'll be following up on a few posts I made a few weeks ago about what the stock market will look like over the next few weeks. [Three weeks ago](https://www.reddit.com/r/wallstreetbets/comments/g9h9np/an_indepth_look_into_the_next_few_weeks/), I talked about the stock market needing consolidating, staying in between 272 and 293, which mostly stayed true (+- 2%). [I then talked about the declining retail sentiment](https://www.reddit.com/r/wallstreetbets/comments/gd1t2g/dddd_the_rise_of_buy_the_dip_retail_investors_and/), which drove the stock market to euphoria levels, and how we won't be making any new highs in the bull rally we've been seeing any time soon, which also so far has held true. Let's take another look at potential catalysts that can cause us to break the channel that we've been in the past few weeks.\n\n*Disclaimer - This is not financial advice, and a lot of the content below is my personal opinion. In fact, the numbers, facts, or explanations presented below could be wrong and be made up. Don't buy random options because some person on the internet says so; look at what happened to all the SPY 220p 4/17 bag holders. Do your own research and come to your own conclusions on what you should do with your own money, and how levered you want to be based on your personal risk tolerance.*\n\n**Oil**\n\nThe WTI June oil futures contract will be expiring on May 19th. Everyone around the world remembered what happened when May oil futures expired - reality caught up. While futures prices can be driven by speculation, on expiration, it will need to converge with the real price (spot price) of oil based on supply and demand for it. Let’s see how crude prices have been for the June contract.\n\n[\\/CLM2020](https://preview.redd.it/wb0yl0zh6gz41.png?width=1600&amp;format=png&amp;auto=webp&amp;s=9e6235b72d8806e665396616eccfa9bc25b6ce19)\n\n[Oil Futures Contango](https://preview.redd.it/wlhqr7sk6gz41.png?width=488&amp;format=png&amp;auto=webp&amp;s=f583cd5a30fd28c41fd6fe0195a42b0ccf07b517)\n\nLooks like oil prices have recovered to pre-lockdown levels, with June contracts priced right under $30 / barrel. Super-contango seems to also be gone, with only a $0.09 difference between June and July contracts. Another way to think about this is that it should thus only cost $0.09 to store one barrel of oil for one month. Contrast this with April 21, where the difference between June and July contracts were more than $7 / barrel. This should put immense downwards pressure on oil storage spot prices, hence a decline in oil tanker stock prices due to expected lower revenue as a result of this.\n\n[$EURN Daily](https://preview.redd.it/kqw9o85m6gz41.png?width=952&amp;format=png&amp;auto=webp&amp;s=ec9f2fde4096ac652c6735c9ebe1ea5931a3a883)\n\nSo is the higher oil prices and decreased contango justified? Let’s look at some metrics published by the Department of Energy.\n\n[Refinery inputs and production](https://preview.redd.it/j8chnhxo6gz41.png?width=1600&amp;format=png&amp;auto=webp&amp;s=ad4ff0aa483c5905489bdff25ab417749cc956cb)\n\n[Crude Oil Stocks](https://preview.redd.it/i6m64iqq6gz41.png?width=1600&amp;format=png&amp;auto=webp&amp;s=25a09370dbeaa5293a27c43a116b6adb5cadf3dd)\n\n[Crude Oil Spot Prices](https://preview.redd.it/sqt6jzwr6gz41.png?width=1600&amp;format=png&amp;auto=webp&amp;s=eaae60e3f929bd79a1139ad512d79db21b29be9a)\n\nCrude inputs to refineries have decreased for the week of May 8 compared to May 1 by about 600kbpd, and is still below the 4-week moving average. Refinery capacity is also still moving on a downtrend, with a 68% utilization for the week of May 8, below the 71% utilization the week before and slightly below the 69% 4-week moving average. We do see a dramatic increase in motor fuel outputs, increasing by about 800kbpd in between weeks of May 8 and May 1, above the 4-week MA. This is likely due to lockdown restrictions being lifted across multiple states, and refineries increasing production in anticipation of increased motor fuel consumption.The decrease in crude inputs last week may indicate that they’ve been overly optimistic and have since decreased utilization.\n\nCrude oil stocks are still increasing, with an additional 1.2M barrels compared to May 1, despite net oil imports decreasing. In Cushing, we do see oil stocks to finally be decreasing with a net change of 3M barrels being taken out of that area in between May 1 and May 8, probably in anticipation of futures contracts expiring. Stocks of motor gasoline are decreasing, indicating increased demand for it as lockdowns ended, and probably prompted refineries to increase production.\n\nOverall, it seems like the story has been that oil demand is slowly restoring with states lifting lockdown, but not as fast as refiners are expecting. Despite decreased supply, crude oils stocks are still slowly increasing. Storage facilities in Cushing have shit their more together this time and are moving their oil stocks from Cushing towards other storage facilities with availability to avoid a storage squeeze like last time. Oil stocks are still increasing, but oil stocks are being allocated more efficiently to utilize excess capacity in other regions, especially away from Cushing, leading to a slowly increasing spot oil price in Cushing despite oil stocks nationwide oil stock increases.\n\n**COVID-19 and Lockdowns**\n\nThe US is currently at approx. 1.5M confirmed cases, and 90K deaths.\n\n[US New Cases](https://preview.redd.it/22m7lkrv6gz41.png?width=952&amp;format=png&amp;auto=webp&amp;s=4b1fc1f6a9be6ecf930510315965754469989bd4)\n\nWe’re seeing a slow decline of new cases; i.e. “flattening the curve”. It doesn’t seem like new cases are being decreased significantly even during lockdown.\n\nIn New York, which has been hardest hit and still under lockdown, we see a significant decline.\n\n[New York New Cases](https://preview.redd.it/huqo5mhx6gz41.png?width=934&amp;format=png&amp;auto=webp&amp;s=4dc3c1f5589540876c8099abff0386ffe70c0ae1)\n\nWe see stay-at-home orders being lifted in several states, and most states reopening retail stores, as well as being in the process of opening dine-in restaurants back up.\n\n[States under lockdown](https://preview.redd.it/og5slqiz6gz41.png?width=1274&amp;format=png&amp;auto=webp&amp;s=af542da9d3ed3a10a6cac00820e87274dc323794)\n\n[States with dine-in restaurants open](https://preview.redd.it/177ddp607gz41.png?width=1286&amp;format=png&amp;auto=webp&amp;s=5f437c681cf1e4e4dee3c6e59caa7336807b222e)\n\n[States with retail stores open](https://preview.redd.it/ltr5a0117gz41.png?width=1298&amp;format=png&amp;auto=webp&amp;s=5e6911b52af75529a4dbb736e6c623793e5aa37f)\n\nWhat has the effects of reopening been so far? Let’s look at one state, Georgia, which has been the earliest to reopen three weeks ago.\n\n[Georgia New Cases](https://preview.redd.it/13que5f87gz41.png?width=952&amp;format=png&amp;auto=webp&amp;s=51ecadebd82c3103fdf1825c249fa743453f6ab4)\n\nTheir new cases have remained effectively flat since re-opening. So while there hasn’t been a new surge in cases, their situation is not improving.\n\nItaly, which has been one of the hardest hit countries, along with the United States, has seen a dramatic improvement with a steady and consistent decline of new cases, giving hope that the US, with a timeline a few weeks behind Italy, will soon be on the other side of the first wave. Italy started easing restrictions around May 4, with shops and restaurants planning to be re-opened by May 18.\n\n[Italy New Cases](https://preview.redd.it/dnlfhp9b7gz41.png?width=972&amp;format=png&amp;auto=webp&amp;s=21b4120501444755353304be2368c4048a04a02c)\n\nOn the other hand, Iran, a country that also was hit by COVID-19 earlier than the US is seeing another spike in cases and is already dealing with a second wave.\n\n[Iran New Cases](https://preview.redd.it/i47hzm5d7gz41.png?width=950&amp;format=png&amp;auto=webp&amp;s=d7cfc32b6ffa7a23b2b730bd82715d3a26d6d7e4)\n\nWe’ll likely see lockdowns across multiple US states being lifted over the next few weeks.\n\n**US-China Tensions**\n\nThe US has recently imposed export restrictions on Huawei that will prevent any chipmakers using American technology from making sales to it. In response, China may be putting American technology companies, including Apple, Qualcomm, and Cisco, on a “unreliable entity list”, which will apply very severe restrictions to those companies’ operations and trade within China.\n\n**Round 4 Stimulus**\n\nThe house has recently passed a phase 4 stimulus bill, the HEROES Act, which will include many provisions including another $1200 check to everyone. This bill passed with Republican resistance, with a 208-199 vote. Most political analysts agree that this phase will take a long time to negotiate and won’t pass as quickly as previous phases, with it passing in June at the earliest.\n\n**Tech Antitrust Filings**\n\nA leak on Friday from the Justice Department indicates that antitrust lawsuits will be filed against Google later this year. Facebook, Amazon, and Apple are also currently under investigation and may also have antitrust suits filed against them at the same time.\n\n**Liquidity the Federal Reserve**\n\nThe Fed recently published their [financial stability report](https://www.google.com/url?q=https://www.federalreserve.gov/publications/files/financial-stability-report-20200515.pdf&amp;sa=D&amp;ust=1589777923796000) on Friday, which talks about the state of the economy, financial system, and gives forward guidance on what might happen next. Here’s a summary of the interesting parts of their report.\n\nVulnerabilities in the financial sectors\n\n* Asset Valuations especially risky assets (i.e. equities) have risen since mid-March and may be vulnerable to significant declines.\n* Business debt, relative to GDP, entered 2020 at historic highs, and had seen rapid increases among businesses with weak credit ratings.\n* Banks and brokers were well capitalized, but hedge funds and insurance companies were highly leveraged, which caused market dislocations when asset prices fell.\n* Funding risk - Although not as bad as 2007-2009, they saw significant strain in funding markets and required Fed intervention\n\nThe report then talks about various monetary issues that came up over the past few months, and actions that the Fed has taken to address them, like lowering interest rates, buying commercial paper and bonds, and infinite QE to stabilize credit markets. They also talk about the strain on the global dollar funding markets, and the international demand for dollars causing a widening of FX spreads (i.e. spike in DXY). To alleviate this, they extended swap lines to other central banks.\n\nIt also looks like the Fed is slowly winding down their “infinite QE” program, falling from a peak of $75B / day of purchases to $6B / day.\n\n[Fed Treasury Purchases](https://preview.redd.it/h8sjmlge7gz41.png?width=1086&amp;format=png&amp;auto=webp&amp;s=2789b31a207100ef863facd3ad514a7a07608500)\n\n**The Bigger Picture**\n\nWe’re still seeing a slow net increase in oil stocks, despite the lower production and imports, as well as increased refinery utilization. However, oil is being stored more efficiently, with barrels being moved in places with a shortage capacity, like Cushing, to other places in the US. This, along with other actions recently taken by futures brokers, NYMEX, and USO, makes it a shock such as the one we saw when May contracts expired much less likely for the June contracts.\n\nNothing bad has yet to happen with states that have reopened, with daily increases stabilizing. We have yet to see if this translates to an economic recovery, and if current equity prices are justified. On the other hand, escalating US-China tensions around Huawei may further hurt equity valuations, especially technology companies, which seem to be possible targets of China for retaliation. The confirmation of antitrust filing to at least one tech giant, and the likelihood of further filings for other giants, may also further hurt stock prices in the tech sector, where equity valuations have declined the least throughout the crisis.\n\nThe Federal reserve is slowly winding down their QE, and warning that there are still substantial prices in the credit markets and that asset valuations may see a dramatic decrease. From the fiscal side, although a phase 4 stimulus is being considered and has passed the house, it is unlikely we will see this pass anywhere as quickly as the other rounds.\n\nThe market has already seemed to price in lifting of lockdowns, combined with weakening monetary stimulus and uncertainty about the possibility of further fiscal stimulus, provides a weak bullish case for further upside in equities. In the meanwhile, potential shocks from antitrust actions and Chinese retaliation to large technology monopolies, which consists of more than a fifth of the S&amp;P500, along with a potential second wave, such as seen in Iran, can be a catalyst to break below 272.\n\n**Magic Markers and My Personal Strategy**\n\nFor those interested in what I'll be personally doing, and those that have been following me, I'm currently holding SPY puts and VIX calls (among other positions) which I entered back when SPY hit 293, although I did exit my shorter-term SPY puts on Friday after fucking up and missing my exit on Thursday after not following my own strategy that I wrote.\n\n[\\/ES Daily](https://preview.redd.it/xx3cge849gz41.png?width=1710&amp;format=png&amp;auto=webp&amp;s=a28b3decaeb6f5514077e76254f35788053f4f61)\n\nThe 1D MACD on both /ES and SPY did crossover to bearish, with a larger volume than previous days, which makes me confident that over the medium-term we'll be seeing a downtrend, and is one of the things I need to confirm a drop below 272 for the next drop.\n\nOn the short-term, the 1H MACD is bullish, meaning we're going to need to consolidate over the next day or two. That being said, RSI is heading towards overbought territory.\n\n[\\/ES Hourly](https://preview.redd.it/xlkdmefw9gz41.png?width=1864&amp;format=png&amp;auto=webp&amp;s=d6808ddf2340b95ef34caef4d1edc0c3ecf1c634)\n\nLooking at the 15M chart, we've already hit overbought territory, and MACD is turning bearish.\n\n[\\/ES 15M](https://preview.redd.it/56esfbwgagz41.png?width=1342&amp;format=png&amp;auto=webp&amp;s=e2f4c77be858e0bc264cdbc5478754e1e9215db9)\n\nThis probably means we're going to be opening somewhere below 288 on SPY tomorrow. Depending on how futures act overnight, we'll probably either see a trading range of 285 - 290 or 278 - 285, depending if we open above or below 285. My strategy is to hold my longer-dated SPY puts and VIX calls, and re-enter my short-dated spreads when SPY RSI is overbought again on the 1H chart or 1H MACD crosses over again.\n\nAs with my posts the last few weeks, I'll be updating this post with a regular updates on what my magic marker horoscope says.\n\nP.S. - I got alot of invites and requests to just form a Discord channel with TA updates and thoughts. Although I was originally considering moving this to Discord, I've decided against it since you should not be basing your trading strategy on what some person on the internet is saying, and I'm personally very against trading chat rooms. This is your own money and you should be doing your own DD. If you were going to be spending thousands of dollars on buying something, you would probably be spending hours doing your own research on which product to buy and pros and cons of buying something - this should be no different. I'll post these for inspiration, and to help teach everyone reading how to do their own research, but this is by no means a recommendation on what you should do. Form your own opinions; it's your money.",
        "subreddit": "wallstreetbets",
        "title": "DDDD - A Story of Oil, a Pandemic and Lockdowns, a Money Printer, and Tech Giants",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/glun2n/dddd_a_story_of_oil_a_pandemic_and_lockdowns_a/",
        "created": 1589805263.0
    },
    {
        "author": "3STmotivation",
        "created_utc": 1590334239,
        "id": "gprlg1",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "Every once in a while you will come across a stock that very few people seem to talk about, for whatever reason that might be. Below I will talk about 3 companies that I feel like are underrated and deserve some consideration by investors. Of course always do your own research on all companies and don't buy these because I wrote about them, I am just a random guy on the internet.\n\nFirst company:\nOpenText (OTEX)\nMarket cap: 10,76 billion\nCurrent share price: 55.64 CAD\nYear high: 63.28 CAD\nForeward PE: 12.63\nTotal cash: 1.45 bilion\nTotal debt: 4.47 billion\nEstimated growth next year: 16.70%\nEstimated sales growth: 8:00%\n\nA Canadian softwate company that is the leader in Enterprise Information Management (EIM), which means they help companies work more efficiently on things like the cloud and within their own systems. Their 2019 1.42 billion doller acquisition of Boston based software company Carbonite, who focused mainly on providing software backups and data protection, also gives them more strings to their bow in the ever growing cloud industry.\n\nThey have around 684 companies that use their software, some of the biggest companies are: Aegon, BMW, British American Tobacco, T-Mobile, Fox, Michelin, Qualcomm, Rio Tinto and Unilever. With more and more companies placing emphasis on online work and the importance of the cloud, OpenText is well situated to profit from these trend in the coming decade.\n\nSecond company:\nTakeTwo Entertainment (TTWO)\nMarket cap: 15.95 billion\nCurrent share price: 140.51 USD\nYear high: 140.51 USD\nForeward PE: 32.38\nTotal cash: 2 billion\nTotal debt: 177.25 million\nEstimated growth next year: -7.90% but with a 5 year estimate of 11.88% per annum\nEstimated sales growth: -5.10%\n \nOne of the largest video game companies in the world and holder of titles like GTA, Red Dead Redemption, Bioshock, Borderlands, Civilization and NBA2K. These blockbuster gaming franchises make them the producers of the most popular video games in several of the gaming genres. They also recently signed a deal with the NBA to extend their popular 2K series, which also grants them the rights to the ever growing popularity of e-sports focused on NBA2K.\n\nIn the recent year they have also shifted their focus more towards the mobile gaming industry, an industry responsible for 60% of the global video game market in 2019 and forecast to grow much more in the coming years. With the video game market as a whole growing and more and more people using their spare time to play video games, TakeTwo is well positioned for the future growth that comes with the industry, especially as games get more realistic and virtual reality starts playing a big role in these games.\n\nThird company:\nBlackberry (BB)\nMarket cap: 2.54 billion\nCurrent share price: 4.54 USD\nYear high: 8.96 USD\nForeward PE: 28.38\nTotal cash: 909 million\nTotal debt: 758 million\nEstimated growth next year: 166.70%\nEstimated sales growth: 10.70%\n\nLast but not least, the company that everyone still associates with their popular cellphones in the 2010's. Blackberry has fallen a long way since then, but they have since shifted their focus to software rather than hardware. Since CEO John Chen took over at the helm in 2013, he has drastically changed the future outlook of this company. Blackberry is now mainly focused on cyber security, with their QNX embedded systems software platform being their main flagship for future growth. The QNX platform is used to secure and aid self driving car systems. This platform has helped them land a collaboration deal with Amazon Web Services to produce save self driving cars. It doesn't stop there however, as they also have deals to provide security software for Microsoft, Audi, BMW, Ford, GM and the US government.\n\nIt certainly doesn't help that most people still think Blackberry is focused on producing cellphones and I have even heard people asking if they still exist as a company, but they most certainly do and I would argue they are ready for a shot to reclaim their 2010 glory days as a cyber security company instead of a hardware one.\n\n\nIf you have any stocks that you feel like are underrated or you have a different view on the ones I wrote about, feel free to let me know.\n\nTLDR:\nOpenText, TakeTwo Entertainment and Blackberry are well positioned for growth in the coming decade with a stronger emphasis on the integration of technology into every aspect of our daily personal and working lives.",
        "subreddit": "stocks",
        "title": "Sharing my 3 most underrated stocks",
        "url": "https://www.reddit.com/r/stocks/comments/gprlg1/sharing_my_3_most_underrated_stocks/",
        "created": 1590363039.0
    },
    {
        "author": "sceptic-fox",
        "created_utc": 1588427862,
        "id": "gc6w0k",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I am aware of general mantra about picking stocks: Do not pick stocks, nobody can successfully pick stocks, even Warren Buffet. However sometimes I feel an urge, currently I am eyebowling QCOM. \n\nShare your story about how stock picking went bad for you. When you were 100 percent sure it will go up and you are making a right bet, but in the end you had to accept a loss.",
        "subreddit": "investing",
        "title": "Share your failure story about stock picking",
        "url": "https://www.reddit.com/r/investing/comments/gc6w0k/share_your_failure_story_about_stock_picking/",
        "created": 1588456662.0
    },
    {
        "author": "CyberTygerFire",
        "created_utc": 1588544799,
        "id": "gczl7n",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Where MVIS is mentioned:\n\n\"One of the safest bets for investors looking for AR exposure seems to be the chipmakers and those making components, like Qualcomm, Intel, NVIDIA and \\*[**Microvision**](https://www.ig.com/au/shares/markets-shares/microvision-inc)**\\***. Not only because they are already supplying vital components needed to bring AR to smartphones (suggesting they could be among the earliest profiteers from early AR) but also the new headsets and other upcoming devices coming onto the market.\"\n\n\"NVIDIA is a prime example, having shown off its AR interface for cars that, rather than going for the more ambitious windscreen design, is a display to replace the speedometer and fuel gauge etc… It has major carmakers on board including Tesla, Toyota, and Audi. Equally, \\*Microvision\\* has secured work to use its laser scanning technology that is not only key to autonomous vehicles but for other AR applications too.\"\n\nSource:\n\n[https://www.ig.com/au/news-and-trade-ideas/shares-news/augmented-reality-companies--where-to-next-after-niantic-raises--190110](https://www.ig.com/au/news-and-trade-ideas/shares-news/augmented-reality-companies--where-to-next-after-niantic-raises--190110)",
        "subreddit": "pennystocks",
        "title": "MVIS listed among Qualcomm, Intel, NVIDIA, Tesla, Toyota, and Audi for it's AR Tech",
        "url": "https://www.reddit.com/r/pennystocks/comments/gczl7n/mvis_listed_among_qualcomm_intel_nvidia_tesla/",
        "created": 1588573599.0
    },
    {
        "author": "for-S-and-Gs",
        "created_utc": 1588819315,
        "id": "geybgh",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "What stocks are you watching for future potential in AI applications? \n\nThere are the usual suspects who'll be on it like MSFT, GOOG, AAPL, AMZN. I've looked at semiconductors like AMD, QCOM, NVDA thinking the semiconductor space is big due to compute power requirements.\n\nI feel like I'm sitting in the water waiting for the wave but could be in a better spot.",
        "subreddit": "investing",
        "title": "AI stocks",
        "url": "https://www.reddit.com/r/investing/comments/geybgh/ai_stocks/",
        "created": 1588848115.0
    },
    {
        "author": "RR_Davidson",
        "created_utc": 1588703371,
        "id": "ge389v",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "**\\[Source: Invezz found via Beeken io\\]**\n\nThe upcoming transition from 4G to 5G is likely to initiate a new vibration in the tech industry. In the same way that a transition to 4G opened up space for the emergence of smartphones, mobile commerce, and mobile banking, the introduction of 5G network is expected to usher the next wave of technological advancements.\n\n&amp;#x200B;\n\n**QCOM: Qualcomm**\n\nQualcomm has an agreement with Apple to produce 5G chips for the iPhone-maker until at least 2023. Apple is expected to rollout its new 5G-enabled smartphone later this year, which should also include Qualcomm’s Snapdragon X55 5G chip. \n\nTherefore, supplying Apple – which sold 72.9 million iPhones in the fourth quarter last year – with 5G chips should enable Qualcomm with enough revenue to continue investing in the 5G network. \n\n&amp;#x200B;\n\n**MRVL: Marvell**\n\nMarvell has been on a roll recently, striking a contract with Samsung to provide chips to power LTE and 5G base stations. Moreover, the California-based company was chosen by Nokia to help the Finnish telecom giant to solve its 5G chip problems.\n\nShares of Marvell are trading around 10% off the 2020 highs, with technicals aligning for a potential move to $32 later this year, a 24.5% premium on the current market price.\n\n&amp;#x200B;\n\n**TXN: Texas Instruments**\n\nAs a major player in the semiconductor industry, Texas Instruments is another company expected to benefit from an uptick in demand for chips it produces. \n\nTexas Instruments reported stronger-than-expected financial results for the first quarter, with revenues for the second quarter seen in the region of $3 billion. \n\n&amp;#x200B;\n\n**SWKS: Skyworks**\n\nSkyworks is one of the most prominent suppliers for Apple with nearly 50% of annual revenues coming from the iPhone producer. \n\n“I think the technologies that we’re working on in our ecosystem with partners like Verizon and infrastructure players and even the Chinese, we’re all coming together to make this work, but it’s a real indication of how necessary these applications are to the economy,” said Skyworks Solutions CEO Liam Griffin.\n\nThe tech giant also produces turnkey engines that are seen as a critical element of the wireless infrastructure.\n\nAfter a deep pullback in March, shares of Skyworks have since rebounded nearly 50%, trading above the $100 mark once again.\n\n&amp;#x200B;\n\n**My thoughts**\n\nQCOM for me seems like the safest bet. Texas Instruments looks really interesting as well. \n\n&amp;#x200B;\n\n**Which do you fancy?**",
        "subreddit": "investing",
        "title": "Best 5G stocks to buy right now",
        "url": "https://www.reddit.com/r/investing/comments/ge389v/best_5g_stocks_to_buy_right_now/",
        "created": 1588732171.0
    },
    {
        "author": "batcave007",
        "created_utc": 1590675273,
        "id": "gs70wo",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hey folks, I'm ready to YOLO my savings into RH. I have been reading up on it, would like to confirm what I know so far...hence I decided to turn to you experts. \n\n&amp;#x200B;\n\nSuppose Qualcomm is currently trading for 78.71. \n\nConsider the following call option: \n\n$40 Call; Breakeven: +.062%; Contract = 39.20; Expiring 5/29.  \n\n\nHere is my understanding, please let me know how wrong I'm.\n\nI can buy this option for $3920 and if I do I basically will have the choice to buy 100 shares at $40 on 5/29, correct? \n\nAssuming I buy the option, it is now 5/29 and the stock is trading at $80. I have two options to make some profit:  \n1. Go ahead and buy the 100 shares at $40, basically spending $4000 more? \\[ So basically I spent 7920 (4000+3920) on buying the 100 shares, right? \\] In order for me to make an immediate profit, I would sell those shares, which would net me 8000, thereby just getting an $80 profit? Seems like I'm missing something\n\n&amp;#x200B;\n\n2. Sell that option for a profit. How does this work? How will I make a profit of it? What if no one buys this option? I lose $3920?\n\n&amp;#x200B;\n\nThank you!",
        "subreddit": "wallstreetbets",
        "title": "Is my understanding of calls correct?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gs70wo/is_my_understanding_of_calls_correct/",
        "created": 1590704073.0
    },
    {
        "author": "Robluntski",
        "created_utc": 1590168338,
        "id": "gonmli",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I could use some help deciding on which of the following 5 pharmaceutical stocks to add to my portfolio. I have 5 contenders and I would sincerely appreciate if you would take the time to choose which one you personally think would be the best and give me your reasoning behind it! I will only add one. If you want to tell me which one is the worst I'd love to hear that too!\n\nABBV (AbbVie Inc.)\n\nGILD (Gilead Sciences)\n\nJNJ (Johnson &amp; Johnson)\n\nPFE (Pfizer)\n\nZTS (Zoetis)\n\nThanks so much for your time.\n\nAlso, I'm open to any feedback about the rest of my portfolio! This will be the 10th and final stock in my portfolio for now. I don't plan on holding more than 10 at a time.\n\nThe rest of the stocks in my portfolio are.. JPM , MSFT , ET , SBUX, HD , QCOM , VZ , LYB , IBM .",
        "subreddit": "stocks",
        "title": "Pharmaceuticals - Which do I add? (Choose 1 of 5)",
        "url": "https://www.reddit.com/r/stocks/comments/gonmli/pharmaceuticals_which_do_i_add_choose_1_of_5/",
        "created": 1590197138.0
    },
    {
        "author": "12mediumSizedDucks",
        "created_utc": 1589698626,
        "id": "glaylw",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hi guys, I'm looking to liquidate some stocks and increase my cash position because I have a hunch another crash is coming after the Q2 reports. Also, I feel like I have to many different stock and would like to consolidate to max 15\n\nHowever, I'm having a hard time deciding what to sell. Here's my portfolio:\n\n&amp;#x200B;\n\n|0700 (tencent)|@ 340|up 24%|\n|:-|:-|:-|\n|AAPL|@ 307|up 13%|\n|AIR|@ 60|down 17%|\n|AMZN|@ 1774|up 34%|\n|AWK|@ 96|up 20%|\n|BABA|@ 181|up 10%|\n|DAL|@ 29|down 33%|\n|DELL|@ 51|down 18%|\n|DIS|@ 90|up 17%|\n|GOOG|@ 1318|up 2%|\n|GS|@ 185|down 6%|\n|KHC|@ 26|up 11%|\n|LMT|@ 390|down 9%|\n|MA|@ 278|\\-|\n|MSFT|@ 148|up 22%|\n|NFLX|@ 323|up 36%|\n|NKE|@ 101|down 15%|\n|QCOM|@ 698|up 3%|\n|TSLA|@ 607|up 32%|\n|XI|@ 12.5|down 4%|\n\nI have around 30k total in this portfolio.\n\nWhat would you sell and why?",
        "subreddit": "stocks",
        "title": "Looking to liquidate, not sure what to sell",
        "url": "https://www.reddit.com/r/stocks/comments/glaylw/looking_to_liquidate_not_sure_what_to_sell/",
        "created": 1589727426.0
    },
    {
        "author": "tenziki",
        "created_utc": 1588824836,
        "id": "gezmgq",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Everyone knows that TMobile recently purchased Sprint.  \nBut people dont know that they are perhaps the leading company in 5g right now, its coverage compared to other carriers is the best(though not the fastest). They're currently rolling out the Stand Alone 5G mode which delivers better performance and range.  \n\"T-Mobile has partnered with companies like Cisco, Ericsson, MediaTek, Nokia, OnePlus, and Qualcomm to accomplish several standalone (SA) 5G world firsts. These include the first SA 5G data session between two commercial modems from two suppliers on a production network with Cisco, Ericsson, MediaTek, Nokia, and Qualcomm \"  \n [https://www.rcrwireless.com/20200505/carriers/t-mobile-ericsson-sa-5g-achievements](https://www.rcrwireless.com/20200505/carriers/t-mobile-ericsson-sa-5g-achievements)   \nMoreover, TMobile has continued to add new subscribers to its base beating all other carriers(Not including Sprint)   [https://www.barrons.com/articles/t-mobile-continues-to-outpace-at-t-verizon-now-the-focus-turns-to-sprint-and-5g-51588802443](https://www.barrons.com/articles/t-mobile-continues-to-outpace-at-t-verizon-now-the-focus-turns-to-sprint-and-5g-51588802443)   \nIts balance sheet does not look the best but it has been holding steady.\n\nIn the next 2 years we may see Tmobile achieving the top spot.  \n\n\nTMUS CALL 2021  \nERIC  CALL 2021",
        "subreddit": "wallstreetbets",
        "title": "Long $TMUS DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gezmgq/long_tmus_dd/",
        "created": 1588853636.0
    },
    {
        "author": "ThompsonJJ",
        "created_utc": 1589722099,
        "id": "glfeq1",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "**Monday**\n*Sell my HD calls. Currently up 80%\n\n**Tuesday**\n*Buy PCG 16c 6/17\n*Buy ICLK 7.5c 5/19\n*Buy QCOM 73p 5/5\n\n**Wendesday**\n*Buy ATM SPY straddle\n\n**Thursday**\n*Sell my NVDA calls. Currently up 151%\n\n**Friday**\n*Sell my TTWO calls. Currently up 50%\n*Sell my ICLK calls.",
        "subreddit": "wallstreetbets",
        "title": "My trading strategy for this week.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/glfeq1/my_trading_strategy_for_this_week/",
        "created": 1589750899.0
    },
    {
        "author": "zephead98",
        "created_utc": 1589558579,
        "id": "gkbuuu",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "What's your favorite \"day trade\" stock?  This is a stock you can buy any day, and it will usually fluctuate a buck or two, EVERY day.   Not a long term gainer, or (hopefully) a long term loser, just a stock that is volatile enough that it moves a dollar or two every day.  And I like to keep the cost of the stock under $100  \n\n\nSome of my favorites:\n\nQCOM - Lots of movement, ATROCIOUS amount of debt, but stable business plan.  \nAMD - Still think INTC will kill it some day (again), but for now, it's a great play.  Sometimes you might have to wait a week or two to make your buck, but it usually comes right back.  \nCSCO - Have to be careful, I feel like they are overmilking their main business and huge danger could be ahead.  For now, it's a good fit here.  \nMO - Great stock, great dividends, nice momentum, though lately it's been a lot of down momentum.\n\nAny others you like to trade almost every day?",
        "subreddit": "stocks",
        "title": "Your Favorite Day Trade Stock",
        "url": "https://www.reddit.com/r/stocks/comments/gkbuuu/your_favorite_day_trade_stock/",
        "created": 1589587379.0
    },
    {
        "author": "LoganProch",
        "created_utc": 1588780971,
        "id": "gems9d",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I would like opinions on my stock portfolio, but I won’t share numbers because I don’t want to “boast”. I just want the real thoughts and opinions from you guys. \n\nThe companies that hold most of my equity are: UCO, USO, OXY, QCOM, and VOO. \n\nI plan to hold these for &lt;1 year, except QCOM and VOO. Those I plan to hold for longer than a year. What do you think of this? I know I didn’t include much information but based on these companies, but as far as their name carries is what I’m looking for in terms of advice. \n\nThank you for reading, it is much appreciated",
        "subreddit": "stocks",
        "title": "Opinions on companies that I have invested into",
        "url": "https://www.reddit.com/r/stocks/comments/gems9d/opinions_on_companies_that_i_have_invested_into/",
        "created": 1588809771.0
    },
    {
        "author": "D0rk0",
        "created_utc": 1590506097,
        "id": "gqyw34",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I have some of BRK/B, thinking of DCA’ing down...while its red for me.\n\nAll green: DAL, DKNG, NVDA, CVX, MSFT, JPM, AAPL, QCOM and V.\n\nBRK/B is my only red.\n\nThoughts...",
        "subreddit": "stocks",
        "title": "Just sold BABA &amp; PEP, I free’d up $5500...",
        "url": "https://www.reddit.com/r/stocks/comments/gqyw34/just_sold_baba_pep_i_freed_up_5500/",
        "created": 1590534897.0
    },
    {
        "author": "zandarkyn21",
        "created_utc": 1589212560,
        "id": "ghq76r",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "What’s on everyone’s watchlist? What’s a bank for your buck stock? Atm I’ve gone all in on risk/reward stocks such as CCL, MGM, ERI, DKNG. Also have some shares of Nokia. Should I pop the rest in one of the above mentioned or look elsewhere? Maybe something restaurant related?\n\nOn my watchlist: RTX, MU, QCOM, MRVL, SYF, FUN.",
        "subreddit": "stocks",
        "title": "$700 left of my start up bank roll.",
        "url": "https://www.reddit.com/r/stocks/comments/ghq76r/700_left_of_my_start_up_bank_roll/",
        "created": 1589241360.0
    },
    {
        "author": "3STmotivation",
        "created_utc": 1590334282,
        "id": "gprluz",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Every once in a while you will come across a stock that very few people seem to talk about, for whatever reason that might be. Below I will talk about 3 companies that I feel like are underrated and deserve some consideration by investors. Of course always do your own research on all companies and don't buy these because I wrote about them, I am just a random guy on the internet.\n\nFirst company:\nOpenText (OTEX)\nMarket cap: 10,76 billion\nCurrent share price: 55.64 CAD\nYear high: 63.28 CAD\nForeward PE: 12.63\nTotal cash: 1.45 bilion\nTotal debt: 4.47 billion\nEstimated growth next year: 16.70%\nEstimated sales growth: 8:00%\n\nA Canadian softwate company that is the leader in Enterprise Information Management (EIM), which means they help companies work more efficiently on things like the cloud and within their own systems. Their 2019 1.42 billion doller acquisition of Boston based software company Carbonite, who focused mainly on providing software backups and data protection, also gives them more strings to their bow in the ever growing cloud industry.\n\nThey have around 684 companies that use their software, some of the biggest companies are: Aegon, BMW, British American Tobacco, T-Mobile, Fox, Michelin, Qualcomm, Rio Tinto and Unilever. With more and more companies placing emphasis on online work and the importance of the cloud, OpenText is well situated to profit from these trend in the coming decade.\n\nSecond company:\nTakeTwo Entertainment (TTWO)\nMarket cap: 15.95 billion\nCurrent share price: 140.51 USD\nYear high: 140.51 USD\nForeward PE: 32.38\nTotal cash: 2 billion\nTotal debt: 177.25 million\nEstimated growth next year: -7.90% but with a 5 year estimate of 11.88% per annum\nEstimated sales growth: -5.10%\n \nOne of the largest video game companies in the world and holder of titles like GTA, Red Dead Redemption, Bioshock, Borderlands, Civilization and NBA2K. These blockbuster gaming franchises make them the producers of the most popular video games in several of the gaming genres. They also recently signed a deal with the NBA to extend their popular 2K series, which also grants them the rights to the ever growing popularity of e-sports focused on NBA2K.\n\nIn the recent year they have also shifted their focus more towards the mobile gaming industry, an industry responsible for 60% of the global video game market in 2019 and forecast to grow much more in the coming years. With the video game market as a whole growing and more and more people using their spare time to play video games, TakeTwo is well positioned for the future growth that comes with the industry, especially as games get more realistic and virtual reality starts playing a big role in these games.\n\nThird company:\nBlackberry (BB)\nMarket cap: 2.54 billion\nCurrent share price: 4.54 USD\nYear high: 8.96 USD\nForeward PE: 28.38\nTotal cash: 909 million\nTotal debt: 758 million\nEstimated growth next year: 166.70%\nEstimated sales growth: 10.70%\n\nLast but not least, the company that everyone still associates with their popular cellphones in the 2010's. Blackberry has fallen a long way since then, but they have since shifted their focus to software rather than hardware. Since CEO John Chen took over at the helm in 2013, he has drastically changed the future outlook of this company. Blackberry is now mainly focused on cyber security, with their QNX embedded systems software platform being their main flagship for future growth. The QNX platform is used to secure and aid self driving car systems. This platform has helped them land a collaboration deal with Amazon Web Services to produce save self driving cars. It doesn't stop there however, as they also have deals to provide security software for Microsoft, Audi, BMW, Ford, GM and the US government.\n\nIt certainly doesn't help that most people still think Blackberry is focused on producing cellphones and I have even heard people asking if they still exist as a company, but they most certainly do and I would argue they are ready for a shot to reclaim their 2010 glory days as a cyber security company instead of a hardware one.\n\n\nIf you have any stocks that you feel like are underrated or you have a different view on the ones I wrote about, feel free to let me know.\n\nTLDR:\nOpenText, TakeTwo Entertainment and Blackberry are well positioned for growth in the coming decade with a stronger emphasis on the integration of technology into every aspect of our daily personal and working lives.",
        "subreddit": "StockMarket",
        "title": "My top 3 most underrated stocks",
        "url": "https://www.reddit.com/r/StockMarket/comments/gprluz/my_top_3_most_underrated_stocks/",
        "created": 1590363082.0
    },
    {
        "author": "MBlaizze",
        "created_utc": 1588828561,
        "id": "gf0fac",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "They seem to be very well positioned for the 5G boom, with their Snap Dragon 5G modem chips and antennas going into the newest 5G Samsung and Apple smartphones, as well as the expectation that their other technologies will expand into markets like streaming Virtual reality and Augmented reality, streaming gaming, near instant access to cloud computing, next gen IoT, and the multitude of potential new, unexpected companies that may emerge from all of these new capabilities. \n\nI am about to pull the trigger and buy a few shares, Any other thoughts?\n\nThanks",
        "subreddit": "stocks",
        "title": "Any thoughts on Qualcomm a s a 5G play?",
        "url": "https://www.reddit.com/r/stocks/comments/gf0fac/any_thoughts_on_qualcomm_a_s_a_5g_play/",
        "created": 1588857361.0
    },
    {
        "author": "ThompsonJJ",
        "created_utc": 1589723136,
        "id": "glfnj6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Monday**\n\nSell my HD calls. Currently up 80%\n\n**Tuesday**\n\nBuy PCG 16c 6/17\n\nBuy ICLK 7.5c 5/19\n\nBuy QCOM 73p 5/5\n\n**Wendesday**\n\nBuy ATM SPY straddle\n\n**Thursday**\n\nSell my NVDA calls. Currently up 151%\n\n**Friday**\n\nSell my TTWO calls. Currently up 50%\n\nSell my ICLK calls.",
        "subreddit": "wallstreetbets",
        "title": "My trading strategy for this week.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/glfnj6/my_trading_strategy_for_this_week/",
        "created": 1589751936.0
    },
    {
        "author": "12mediumSizedDucks",
        "created_utc": 1589532773,
        "id": "gk5jsr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi guys, I'm looking to liquidate some stocks and increase my cash position because I have a hunch another crash is coming after the Q2 reports. Also, I feel like I have to many different stock and would like to consolidate to max 15\n\nHowever, I'm having a hard time deciding what to sell. Here's my portfolio:\n\n&amp;#x200B;\n\n|0700 (tencent)|@ 340|up 24%|\n|:-|:-|:-|\n|AAPL|@ 307|up 13%|\n|AIR (airbus)|@ 60|down 17%|\n|AMZN|@ 1774|up 34%|\n|AWK|@ 96|up 20%|\n|BABA|@ 181|up 10%|\n|DAL|@ 29|down 33%|\n|DB|@ 6.5|up 2%|\n|DELL|@ 51|down 18%|\n|DIS|@ 90|up 17%|\n|GOOG|@ 1318|up 2%|\n|GS|@ 185|down 6%|\n|KHC|@ 26|up 11%|\n|LMT|@ 390|down 9%|\n|MA|@ 278|\\-|\n|MSFT|@ 148|up 22%|\n|NFLX|@ 323|up 36%|\n|NKE|@ 101|down 15%|\n|QCOM|@ 698|up 3%|\n|TSLA|@ 607|up 32%|\n|XI|@ 12.5|down 4%|\n\n I have around 30k total in this portfolio.\n\nWhat would you sell and why?",
        "subreddit": "stocks",
        "title": "looking to liquidate, not sure what to sell",
        "url": "https://www.reddit.com/r/stocks/comments/gk5jsr/looking_to_liquidate_not_sure_what_to_sell/",
        "created": 1589561573.0
    },
    {
        "author": "2fastand2furious",
        "created_utc": 1589844057,
        "id": "gmcrnj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Pooh Bear &amp; Gay Bears, Natural Allies? \"China ready to target Apple, Qualcomm, Cisco and Boeing in retaliation against US' Huawei ban\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gmcrnj/pooh_bear_gay_bears_natural_allies_china_ready_to/",
        "created": 1589872857.0
    },
    {
        "author": "2fastand2furious",
        "created_utc": 1589841194,
        "id": "gmbwc0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Pooh Bear &amp; Gay Bears, Natural Allies? \"China ready to target Apple, Qualcomm, Cisco and Boeing in retaliation against US' Huawei ban\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gmbwc0/pooh_bear_gay_bears_natural_allies_china_ready_to/",
        "created": 1589869994.0
    },
    {
        "author": "codingprofessor",
        "created_utc": 1589524360,
        "id": "gk3xle",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "\\## **My history investing in college and my first month investing in February:**\n\nLearned about miners and blockchain validation with a chemical engineering friend before the rally.\n\n\\- Bought **XRP** at $.15 and $.25, sold at $3.28 (I valued at $4 or $5 dollars MAX in 10 years if blockchain found adoption)\n\n\\- Bought **AMD** after the rally at $11 because it was ridiculous how much cost efficiency they had introduced to the market to poor people like me unlike **NVIDIA** products which always seemed far removed and discouraged me.\n\n\\- I started with **Panasonic** because I had missed out on the window to invest in **Tesla** at 200-300 range. I believed **Panasonic** to be similar to **AMD's** relationship to **bitcoin**; while all eyes looked at the shiny object, I looked at the boring parts that built it.\n\n\\- The market crashed, so I DCA'd aggressively and controlled my emotions through out. I was more concerned with my performance to commitment rather than my returns at the time. I did well.\n\n\\- My investments in March 19 was **SQ** and **Lyft**\n\n\\## **My Strategy now that I have income**\n\n\\- I bought up to 5,000 dollars in stocks ranging from **FANUC** (industrial robotics) to **DENNYS** (logistics/real estate)\n\n\\- I trimmed down to $2,300 but will rapidly rebuild with a different approach:\n\n\\- I'm buying 1 stock in the company before making any further developments with. Following this, I will purchase ETFs in sectors that I **want** to see develop in the next 5-15 years. I will buy 1 stake into these ETFs and combine it with my 1 stock purchase to create the necessary offset.\n\n\\- For example, I bought 1 stock of **Texas Instruments**  for $109 followed by a purchase in **SOXX ETF** for semiconductors, which has the largest ETF allocation to **Texas Instruments.** I will apply similar logic to companies like **Facebook, Paypal,** etc.\n\n&amp;#x200B;\n\n\\- I do this \"1 chip\" start in multiple industries because I want to pick some arbitrary point in time but I have a lot of industries &amp; ecosystems that I would like to reasonably participate in. This will still cost a lot of money to start off with and buys me time to study company numbers and outlooks.\n\n&amp;#x200B;\n\n\\## **My current market sentiment**\n\n**-** I consider where you start on a graph as somewhat arbitrary and see the current market stability as somewhat of an exercise in game theory and rowing a boat throat a thick fog. I believe it's optimal to row cautiously forward and to not stay still. With cautious rowing, you'll be able to react appropriately if you are suddenly met by a waterfall or a path with clearer vision.\n\n&amp;#x200B;\n\n\\- I am **\\`*****BEARISH\\`*** on Amazon in the long term. I believe that slowly, but surely, the market will consume Amazon's hold on its markets. I don't believe Amazon will maintain the status quo on cloud computing due to the quality of its competitors. I absolutely LOVE **Google Cloud Platform** and utilize **Firebase real-time database** very often. **Microsoft** has made some extremely important acquisitions recently in **Github and NPM - that's enormous.**\n\n\\-  I have suspicions about **Amazon** will struggle internationally. I don't know if Amazon will penetrate China the way China does, or if it will succeed in locations south of Mexico against things like **Mercado Libre**\n\n\\- I have suspicions that tech platforms will soon integrate in a meaningful way with financials. As in, the virtualization of stores and forwarded payments in places like the **Facebook(Visa) Market Place, Twitter(Square) payment sending, Paypal(honey) &amp; Amazon purchasing, Gaming credits, etc.**\n\n**-** I am \\`**bullish**\\` on Facebook. Facebook is utterly invaluable and scales globally. The reason it's adopted in **Mexico**, for example, is because it's cheaper and faster than other services. They also service millions of developers with **React** and its growing development ecosystem. They provide a standardized marketting platform for small businesses on Instagram, Facebook, WhatsApp, and soon to be JIO. I would not be surprised if they soon enter the fintech sector.\n\n\\- I am \\`**bullish\\`** on **Paypal**. They are seemingly repeating their previous success by servicing large online commerce that are upgrading their systems. **Honey/Paypal** will scrape coupons for Amazon and force organizations like Visa to compete with  **real-time financial services**.\n\n&amp;#x200B;\n\n\\- I am **\\`bullish\\`** on cloud software and networking. I think **CDNs** and dedicated **services for Cybersecurity** will maintain. Sure Google provides these services but things like **Cloudflare** and **Fastly** have dedicated solutions to fast image processing, DDoS protection, and more that other platforms may not be able to **allocate their resources to**. **Cloudflare** has an enormous network, and **Fastly** provides a great system for you to enjoy content like **Reddit.** I think it's hard to miss the mark here - the highway of the internet is going to get faster and more assets will be maintained in the server's space - the ecosystem must grow with it.\n\n&amp;#x200B;\n\n\\- I am ***\\`EXTREMELY BEARISH***\\*\\*\\`\\*\\* on Beyond Meat. I've been vegetarian for 10 years. IT'S BAD. WE HAVE NOTHING ELSE TO BE EXCITED ABOUT AND WE'RE NOT USED TO HAVING ATTENTION. VEGETARIANS ARE LYING IF THEY SAY IT'S AMAZING. ***IT'S LITERALLY DOG FOOD***\n\n&amp;#x200B;\n\n\\- I am \\`**BULLISH\\`** on the long term development of **Mexico**. I think companies like **Kansas City Southern** that services **Mexican-American** relationships will grow well in the long run.\n\n\\- I am **\\`BULLISH\\`**  on Apple and Adobe. Amazing products.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## **CURRENT HOLDINGS (ordered by priority &amp; checkup time):**\n\n&amp;#x200B;\n\n**GOOG &amp; AMZN exposure through tech ETFs** ::: priority FB\n\n**NVIDIA, AMD, Intel EXPOSURE through semiconductor ETFS** ::: priority Texas Instruments\n\n**Environmental Services exposure through Sanitation ETFS** ::: priority Waste Management\n\n**Adobe and AutoDesk exposure through cloud software ETFs** :: priority Adobe\n\n**Nintendo exposure through gaming ETFS ::** priority Nintendo\n\n**Cisco exposure through cloud networking and edge computing ETFS** Cicsco, Fastly, Cloudflare, etc\n\n**TELECOM networking ETFS** :: priority TMobile\n\n**Manufacturing technology, industrial sectors, and robotics exposure to**  Fanuc, ABB, Siemens, Sherwin-Williams, VW, GM, Nissan, Toyota, Panasonic,\n\n**Healthcare services ETF** :: priority Cigna\n\n**FB -- LONG**\n\n**PAYPAL --  LONG**\n\n**TEXAS INSTRUMENTS - LONG**\n\n**MSFT     --  LONG**\n\n**APPLE   --  LONG**\n\n**ADOBE -- LONG**\n\n**DISNEY -  LONG**\n\n**BITCOIN - LONG**\n\n**TMOBILE - 2 YEARS**\n\n**VISA -- 2 YEARS**\n\n**JPM - 2 YEARS**\n\n**TWITTER - 2 YEARS**\n\n**SQUARE - 1 YEAR**\n\n**LYFT - 1 YEAR**\n\n**FASTLY - QUARTERLY**\n\n**CLOUDFLARE - QUARTERLY**\n\n**1LIFE MEDICAL - QUARTERLY**\n\n**FIVERR - QUARTERLY**\n\n**DRAFT KING - QUARTERLY YEAR + CHICAGO POLITICS**\n\n**GROUPON - SPARE CHANGE JAR**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**## EXCITED TO ACQUIRE**\n\n**- ADOBE**\n\n\\- **QQQ**\n\n\\- **SHERWIN WILLIAMS**\n\n\\- **TOYOTA**\n\n\\- **KANSAS CITY SOUTHERN**\n\n\\-",
        "subreddit": "investing",
        "title": "I started my career in November and investing February 5th, 2020 - my strategy as a once peasant Mexican",
        "url": "https://www.reddit.com/r/investing/comments/gk3xle/i_started_my_career_in_november_and_investing/",
        "created": 1589553160.0
    },
    {
        "author": "RR_Davidson",
        "created_utc": 1588703371,
        "id": "ge389v",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "**\\[Source: Invezz found via Beeken io\\]**\n\nThe upcoming transition from 4G to 5G is likely to initiate a new vibration in the tech industry. In the same way that a transition to 4G opened up space for the emergence of smartphones, mobile commerce, and mobile banking, the introduction of 5G network is expected to usher the next wave of technological advancements.\n\n&amp;#x200B;\n\n**QCOM: Qualcomm**\n\nQualcomm has an agreement with Apple to produce 5G chips for the iPhone-maker until at least 2023. Apple is expected to rollout its new 5G-enabled smartphone later this year, which should also include Qualcomm’s Snapdragon X55 5G chip. \n\nTherefore, supplying Apple – which sold 72.9 million iPhones in the fourth quarter last year – with 5G chips should enable Qualcomm with enough revenue to continue investing in the 5G network. \n\n&amp;#x200B;\n\n**MRVL: Marvell**\n\nMarvell has been on a roll recently, striking a contract with Samsung to provide chips to power LTE and 5G base stations. Moreover, the California-based company was chosen by Nokia to help the Finnish telecom giant to solve its 5G chip problems.\n\nShares of Marvell are trading around 10% off the 2020 highs, with technicals aligning for a potential move to $32 later this year, a 24.5% premium on the current market price.\n\n&amp;#x200B;\n\n**TXN: Texas Instruments**\n\nAs a major player in the semiconductor industry, Texas Instruments is another company expected to benefit from an uptick in demand for chips it produces. \n\nTexas Instruments reported stronger-than-expected financial results for the first quarter, with revenues for the second quarter seen in the region of $3 billion. \n\n&amp;#x200B;\n\n**SWKS: Skyworks**\n\nSkyworks is one of the most prominent suppliers for Apple with nearly 50% of annual revenues coming from the iPhone producer. \n\n“I think the technologies that we’re working on in our ecosystem with partners like Verizon and infrastructure players and even the Chinese, we’re all coming together to make this work, but it’s a real indication of how necessary these applications are to the economy,” said Skyworks Solutions CEO Liam Griffin.\n\nThe tech giant also produces turnkey engines that are seen as a critical element of the wireless infrastructure.\n\nAfter a deep pullback in March, shares of Skyworks have since rebounded nearly 50%, trading above the $100 mark once again.\n\n&amp;#x200B;\n\n**My thoughts**\n\nQCOM for me seems like the safest bet. Texas Instruments looks really interesting as well. \n\n&amp;#x200B;\n\n**Which do you fancy?**",
        "subreddit": "investing",
        "title": "Best 5G stocks to buy right now",
        "url": "https://www.reddit.com/r/investing/comments/ge389v/best_5g_stocks_to_buy_right_now/",
        "created": 1588732171.0
    },
    {
        "author": "WYBJO",
        "created_utc": 1588345795,
        "id": "gbjuhd",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " MPWR stock is too good. MPWR was 10% over all time high, even after yesterday's dip. Their stock price is an anomaly in their sector: $SOXX is up 30% from the march drop, still below february highs. MPRWs larger competitors like Analog devices($ADI), Texas Instruments($TXN), ON semiconductor(ON), and Intel show similar gains. This makes sense: these companies make fundamental manufacturing parts and are sensitive to weak global manufacturing and trade. So what makes MPWR so special? What do they do?\n\n90+% of MPWR's business is the design and sale of DC power supply/power converter chips, the rest is similar derived devices like motor drivers and power sensors. They do not actually manufacture chips themselves, instead contracting to semiconductor foundries. The vast majority of their customers are manufacturers of integrated circuits, mostly in china. This risk profile is common in the segment, but it does leave them exposed to China specific market forces like tariffs, quarantines.\n\nTheir product is so universal to electronic devices that they have a very broad customer base in consumer electronics, industrial automation,  automotive, computing and telecom infrastructure. This has insulated them from some of the cyclic boom-bust patterns of the sector, and historically MPWR's performance is consistently better than the semiconductor ETFs $SOXX.\n\nMPWRs recent history shows some decent management moves. 2018 was a banner year for MPWR. They posted 61% year over year profit growth and their stock price mostly traded sideways for the year. They invested heavily until q4 2019 tanked the sector. They were smart enough to see the contraction coming and were able to eke out 1% profit growth through investment returns and executive pay structure deferments. A better than expected Q1 earnings report helped kick them up over 200$.\n\nSo there's stuff to like. Seems like a good buy in the 150-160 range.nce it comes down, and I think it will come down, here's why:\n\nThe most basic indicators are wrong: P/E ratio is 83. This is 4x higher than typical for the sector, 2x higher than is normal for their closest competitors during the best times. Market analysts are not recommending this stock, it's not being pumped on twitter. MPWR stock looked pretty normal until the second week of april until april 9:\n\nAround April 9-10 MPWR begins to diverge from competitor $POSI after a press release announcing they built a ventilator gets picked up by a few news aggregators. I encourage you to go look at this ventilator:\n\nhttps://www.monolithicpower.com/en/mps-open-source-ventilator\n\nThis is not a remotely viable product. It doesn't even offer practical improvements on the open source ventilator it's based on. It's a medium quality arduino project put together using spare parts, lithium batteries, and MPWR off-the shelf hardware. To me this suggests MPWR has engineers and marketing staff short for paying work.\n\nYou have likely noticed ads/speculation/spam about making money from 5G networks and internet infrastructure. After the ventilator story brought attention to MPWR I expect unfamiliar traders began investigating and found MPWR's marketing materials about these products. MPWR makes almost all of its money from 5 markets:\n\n1) Computer/server gear at roughly 30% of their business\n\n2) Consumer Electronics at 25% of their business\n\n3) Industrial/Commercial Devices 15%\n\n4) Embedded Automotive Devices 15%\n\n5) Infrastructure to consumer scale Telecommunications gear, 15%\n\nNone of their markets are in great shape.\n\nComputer and semiconductor markets are projected to shrink this year, even with some cloud growth.  Unemployment is hurting consumer spending and with that Auto/Consumer electronics spending will shrink.  Telecommunications infrastructure spending could grow this year but broad 5g rollout is scheduled at least a year out. Industrial products might have opportunities with new customers who don't already know who they are, but a locked down sales force and the lack of variety in their product development are bad signs: their sales teams will be less effective globally and I don't expect viable new products from their engineering team.\n\nWithout good new revenue lines they'll need to cut costs. Signs point to them being fucked here. They bought a new US facility shortly before the crash/shelter in place. They purchase their silicon wafers in yearly installments based on sales projections, so inventory costs are locked in. They have an abysmal 1.94 inventory turnover ratio. Maybe this is secretly good: sucking that bad suggests ample room for supply chain improvements.\n\nFinally, their  Q1 earnings which kicked the stock to record highs might not be a good indicator of their health during that quarter. Earnings transcripts describe their sales are long cycle collaborations with oems, with orders taking 8-16 weeks to fulfill. With lead times that long new bookings could have dropped 90% during the end of Q1 and the signal wouldn't show up until next quarter.\n\nAlso: an aside: breathing equipment is a saturated and losing game. Thousands of people are working on solutions, but they won't beat the existing ventilator manufacturers. They are competing with tested, regulatory approved products manufactured with purpose built tooling and process. These companies have already multiplied their throughput with quick purchases of tooling and wiped out the supply of valves, instrumentation and raw materials needed to make that gear. The flattening of infection curves points to less gear being needed than was thought. Look for profits in suppliers of these raw parts.($PH)",
        "subreddit": "wallstreetbets",
        "title": "MPWR is beyond overpriced.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/gbjuhd/mpwr_is_beyond_overpriced/",
        "created": 1588374595.0
    },
    {
        "author": "mtmtrader",
        "created_utc": 1588337344,
        "id": "gbhhs1",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Gap Up: $SPI $MDGS $CHFS $MVIS $AKRX $AMTX\n\nGap Down: $EYES $WDC $VVUS $NAIL\n\nPrevious Day Movers: $XELA $THMO $CHAP $MTP $TTI\n\nClick the link below to view news headlines, support levels, resistance levels, and other info for these stocks!\n\n[https://imgur.com/a/SILyKur](https://imgur.com/a/SILyKur)\n\nPlease read before commenting “How can I use this after these stocks have already gone up?”\n\nGaps in either direction present great day trade opportunities and usually have strong relative volume, increased volatility, and recent news/press releases! There are **tons** of different gap trading strategies, some of which allow you to profit from them going up from buying and selling and others that allow you to profit from them going down from short-selling and covering.\n\n**Example 1**: Some stocks will gap up and continue running throughout the day… known as a “gap and go.” These make great buy opportunities. Not all gap ups will gap and go, but you can use both fundamental and technical analysis to find ones with the highest probability of doing so.\n\n**Example 2**: Other gap ups will come straight back down at the open. These are usually stocks with poor fundamentals and a history or dilution/offerings. If you have an account with a broker that allows short-selling, these often make great short opportunities that allow you to profit from them coming back down after they gap up.\n\n**Example 3**: A lot gap downs will become very oversold and end up bouncing back up a bit after the market opens. Depending on the news and the individual company, gap downs can offer a great opportunity to get shares at a discount before a bounce.\n\nAt the end of the day, I hope this just shows that I am **not** posting these to show what has been missed out on, but to hopefully give some good day trade opportunities. It’s still important to do additional research on these stocks before you decide to place any trades!",
        "subreddit": "RobinHoodPennyStocks",
        "title": "05/01/20 MORNING WATCHLIST",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/gbhhs1/050120_morning_watchlist/",
        "created": 1588366144.0
    },
    {
        "author": "Kant_sleep13",
        "created_utc": 1588337097,
        "id": "gbhfk4",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Good Morning, Here's the watch list\n\nGap Ups: BA, CLX, MDGS, MRNA, TVIX/UVXY, \n\nGap Downs: JNUG/NUGT, NVDA, TQQQ, WDC\n\nMarkets gapping down again. As I have stated previously, trading large gap days are some of the most difficult to trade. Hundreds of stocks are reporting earnings, yet almost none are reacting pre market which is concerning. There is a good chance I will sit today out as most gap downs are gapping into moving averages and I don't see many stocks with good opportunities. If I decide to trade today, I will be patient off of the immediate open and concentrate on key levels of support or resistance for entries. Due to most stocks gaping into support, the list today will be short and I will be running scans intraday to look for better opportunities on earnings plays if any decide to trigger. Before entering into any positions, have a defined risk to reward with stops and targets calculated before entering trades. Good luck trading and have a good weekend.",
        "subreddit": "StockMarket",
        "title": "Stock Watch List May 1, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/gbhfk4/stock_watch_list_may_1_2020/",
        "created": 1588365897.0
    }
]