[
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612294999,
        "id": "lb4h1m",
        "num_comments": 52,
        "num_crossposts": 1,
        "selftext": "**Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!**\n\n**\\~Warning! Very Very Long Post\\~**\n\n\\[Disclosure: I made this DD 2 weeks ago &amp; I wasn't part of this Subreddit until the last few days\\]\n\n\\[Wanted to post this before the next Amazon earnings later tonight!\\]\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon.\n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September.\n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products.\n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services. Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe.\n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world?\n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future.\n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced early in February.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\nThank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "ValueInvesting",
        "title": "Amazon Stock Price Target Prediction &amp; Analysis [Fundamental &amp; Tehnical]",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/lb4h1m/amazon_stock_price_target_prediction_analysis/",
        "created": 1612323799.0
    }
]