[
    {
        "author": "GreedySpeculator",
        "created_utc": 1615286606,
        "id": "m13x68",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": " \n\n# What is priced in FED Land ? \n\nNearly a full hike in EOY 22 | 2.3 % Average fed funds over next 30 years | 10/2 at 143 bps which is a level last seen in Dec 2016 which is the peak of the Trump era.  \nI Believe in light of recent fed communication that this is too aggressive. Fed communication has made it clear that what matters is u6 ^((the real unemployment figure)) and that their tolerance of the constraint is a “sustained overshoot of 50bps - Bullard or \"even 3% wouldn’t worry me as long as it’s not 3% on the way quickly to 4% - Evans   \nFor those who have offered concrete formulation of what the AIT, it is clear that what will be the rate hiking cause is NOT inflation but the path to max employment as, by all accounts and consensus, we will NOT reach such a high inflation path over a year. **Thus any Employment data surprise will be hawkish and vice versa Now that we have defined the optimization problem which the FED is solving**, let’s try to solve it using the data and see if we agree with the market:   \n\n\n**CapEcon - (Does not take into account infra bill)**  \n We anticipate QE will be tapered from the start of 2022, and a very gradual rate liftoff will begin in mid-2023. We expect base-effects and fiscally stimulated growth will allow inflation to reach levels rarely experienced over the past decade, with headline inflation flirting with 3% and core inflation around 2.4%, Uncontrolled overheating isn’t likely if inflation expectations remain anchored. JPM forecast anticipates this move, but frames it as transitory volatility rather than trend. So should the Fed. Given that money markets are pricing an early Fed liftoff but TIPS markets are not pricing an inflation overshoot, either investors doubt the Fed or don’t understand it Markets likely to struggle to price in an even earlier Fed hike. Take profit on tactical longs in 5Y UST and stay neutral duration\n\n**Barclays**   \nDespite the sharp sell-off, long -term yields do not look high in the context of a stronger growth outlook. Still, front-end yields are inconsistent with the FAIT framework. We maintain our recommendation to be long 3y US Treasuries. Given the steepening, we are turning neutral on our front to intermediate steepener view. While it seems premature to declare that the hiking cycle (the start of which is two years away) would be finished within five years, with more stimulus likely down the road, there is some risk of an overshoot as well. Also, as we argued here, passage of an infrastructure plan later this year could still push long-term real yields higher. At the upcoming FOMC meeting, the Fed is likely to convey a greater tolerance for above-target inflation before raising short-rates than is priced in. This should push out the timing of the start of the hiking cycle, in our view. We view the rise in long-term yields as reflecting a brighter economic outlook. Progress on infrastructure spending poses upside risks to them.\n\n**YELLEN**   \nIt would take 2 years at this rate to get back to pre covid u6 (puts us on March 23)\n\n**GS** WITH INFRA /!\\\\   \nthe simulation implies 7% Q4/Q4 GDP growth in 2021, a decline in the unemployment rate to 3.7% in 2021Q4 and 3% by 2023Q4, a pickup in core inflation to 2.2% by 2023, and one to two rate hikes in 2023 under our interpretation of the Fed’s new framework. We expect FOMC participants to be more conservative in their projections at this early stage of the recovery, with a median forecast of 2.1% inflation and one rate hike in 2023. Our own forecast instead calls for liftoff somewhat later, in the first half of 2024, because our inflation forecast is a bit lower, reflecting a lesson from last cycle that an extremely tight labor market will likely be needed to generate the level of inflation that the FOMC now requires for liftoff.\n\n**MS**   \nWhile inflation in the reopening-sensitive sectors is likely to prove transient,a more sustainable impulse to inflation will start to take shape in 2021 – led by shelter inflation,healthcare services,and a multi-quarter passthrough of dollar weakness into goods. The sustainable inflation impulse intensifies in 2022as cyclically sensitive inflation components start to dominate – based on a tightening labor market and robust levels of demand. Core PCE to peak at 2.3 on DEC 22 !!!!*that TIPS-based breakeven inflation, based on CPI inflation measures, could move considerably higher and still be consistent with a PCE inflation outcome modestly above the 2% target.”*\n\n**My own Conclusion** If you assume no infra or an infra bill that is close to entirely paid for via additional taxes and has a low multiplier we are definitely slightly above fair value in terms of rates. The Fed into FOMC next week WILL not assume an infra bill or its implications within the SEP thus in this case it is still possible to have a SEP that shows **no HIKE in 2023** So I cannot help but be bullish duration (&amp; implications, see title) into FOMC March 16 and Auctions March 11 However - **Progress on infra / Data points indicating or suggesting faster path to min u6 will be hawkish EuroDollars (&amp; implications)**   \nI DO Believe there will be progress on an infra bill that will be generally expansionary in the end - thus the real trend is still an increase in real rates / ED and the implications that come with it : \\* Gold down / \\* TXN down / \\* Dollar up vs EUR,CHF,Yen / \\*NQ valuation down / \\*Banks up / \\*Value &gt; Growth / But there should be a respite as we’ve already had strong progress in this direction and   \na) we will get a FED that, by ignoring the infra bill, will be able to push back VERY strongly through the SEP   \nb) We are hearing stories of Manchin refusing to use fillibuster (which would make the infra bill A LOT Less exciting)   \nHow to trade this then ? Clearly, the real solution is to sell puts on NQ expiring soon to buy puts expiring later (apply that to all the other asset classes) \n\n**TLDR : LONG $QQQ, $GLD, $TLT into FOMC.** \n\n**Super monkey trade : Sell near term QQQ/GLD/TLT puts to buy longer term ones.**",
        "subreddit": "wallstreetbets",
        "title": "My thoughts going into FOMC next week | Long Duration : $QQQ $GLD $TLT $FXI",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m13x68/my_thoughts_going_into_fomc_next_week_long/",
        "created": 1615315406.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614701654,
        "id": "lw5odk",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n\n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n\n\\-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n\n\\-Do you think there’s a Semiconductor shortage? Y/N\n\n\\-Do you like 3x Leverage? \n\n\\-Bears🌈🐻say: “ShoRtaGe MeANs     LeSs PrOFitS”\n\n\\-Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation! Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n\n\\-Stimmy?💉💰💰💰\n\n\\-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n\n\\-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\n\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\n\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks hard on dips but that’s when you buy MOAR calls for insane gains.\n\nSee Posted Positions:Shares @ ATHs &amp; dips (pre split)\n\nCalls @ ATHs &amp; dips \n\n(My Entry: Everyday) - Shares\n\nCalls at dips\n\n📷📷\n\n*Processing img n1vvvtye3nk61...*\n\n*Processing img cw8tg1ze3nk61...*",
        "subreddit": "wallstreetbets",
        "title": "$SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw5odk/soxl_3x_semiconductor_play/",
        "created": 1614730454.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614699566,
        "id": "lw4t8w",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n-Do you think there’s a Semiconductor shortage? Y/N\n-Do you like 3x Leverage? \n                -Bears🌈🐻say: “ShoRtaGe MeANs     LeSs PrOFitS”\n\n-Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation! Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n-Stimmy?💉💰💰💰\n-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks hard on dips but that’s when you buy MOAR calls for insane gains.\n\nSee Posted Positions:Shares @ ATHs &amp; dips (pre split)\n                 Calls @ ATHs &amp; dips \n\n(My Entry: Everyday) - Shares\nCalls at dips",
        "subreddit": "smallstreetbets",
        "title": "Tired of Meme Stocks? $SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lw4t8w/tired_of_meme_stocks_soxl_3x_semiconductor_play/",
        "created": 1614728366.0
    },
    {
        "author": "pltr_gang_rise_up",
        "created_utc": 1615311456,
        "id": "m1bokv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "My fellow autists, degenerates, gambling addicts, and of course, my dear retards: It is I - u/pltr_gang_rise_up and I am here to share with you a true post in the spirits of WallStreetBets and would like to put on your radar - SOXL. \n\n**Backstory:**\n\n**Semiconductors,** as most are aware, are in short supply. There has been some movement by world leaders to improve supply chains in order to get the semiconductors to the place they need to be. Some car manufacturers have had to cut production in vehicles due to this ongoing issue. I believe this issue will be fixed in due time, but probably not in the immediate future. \n\n**What is SOXL?**\n\n**SOXL** is a Leveraged ETF that invests in the biggest semiconductor manufacturers in the world (INTC, AMD, QCOM, TSM, etc). \n\nBe careful, this is a \"Leveraged\" ETF - and therefore it's rather aggressive and aiming for high returns. Do some more research here if you want. Essentially it means, if the sector of semiconductors does well, the fund will do well. \n\n**Breakdown:**\n\nNow, they recently had a 15:1 split on their shares, which were trading at about $636 in February. This brought the public float to **99.40M.**\n\nWhen looking into a company, I like to start with what they own, followed by who owns them.\n\n**What they own:**\n\nHere is a breakdown of the assets that SOXL owns with their 1.46bn market cap:\n\nDreyfus Government Cash Management Institutional Shs\t11.00%\n\nFinancial Square Treasury Instruments Fund FST Shares\t9.39%\n\nBroadcom Inc.\t5.22%\n\nQualcomm Inc.\t4.96%\n\nIntel Corp.\t4.94%\n\nTexas Instruments Inc.\t4.88%\n\nNVIDIA \t4.67%\n\nMicron Technology Inc.\t2.81%\n\nTaiwan Semiconductor Manufacturing Co. Ltd. ADR\tTSM\t2.69%\n\nAnalog Devices Inc.\t2.54%\n\nApplied Materials Inc.\t2.51%\n\nLam Research Corp.\t2.50%\n\nKLA Corp.\t2.41%\n\nNXP Semiconductors N.V.\t2.40%\n\nAdvanced Micro Devices Inc.\t2.37%\n\nASML Holding N.V.\t2.22%\n\nMicrochip Technology Inc.\t2.16%\n\nXilinx Inc.\t2.01%\t\n\nMarvell Technology Group Ltd.\t1.92%\n\nSkyworks Solutions Inc.\t1.53%\n\nTeradyne Inc.\t1.20%\n\nQorvo Inc.\t1.14%\n\nMonolithic Power Systems MPWR\t0.99%\n\nON Semiconductor Corp.\t0.81%\n\nEntegris Inc.\t0.78%\n\n&amp;#x200B;\n\n**Now, I'm not sure what the first two are, but that throws up a potential flag.** These two entities represent nearly 20% of the portfolio owned. It could be nothing more than some type of government investment in such a company, as it is critical right now. \n\n**Who owns them?:**\n\nLooks like mostly hedge funds. No one really of note other than Citadel and Susquehanna. \n\n**Short Interest:**\n\nNot a heavily shorted stock. About 3.4m shares are available to short with a ratio of about 25%.\n\n**Technicals** (got me excited):\n\n&amp;#x200B;\n\nhttps://preview.redd.it/a7ndly6se1m61.png?width=1018&amp;format=png&amp;auto=webp&amp;s=698eae9b1d4ff4726eac546d2a6a8f4bb753fbc6\n\nHere we have a bounce just under the (white) 200sma. On this 4h chart, the bottom represents the buy/sell volume over time. the middle represents where we're at in terms of a squeeze. You also can see heavy buy volume at the bottom followed by a potential turn up ahead in the next few days. TONS of buy volume since the beginning of the month. \n\nThe daily was also looking nice:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/id2j5879f1m61.png?width=452&amp;format=png&amp;auto=webp&amp;s=23cbb6a2b7af021cadc9d35a9d2f8413c636cb90\n\nThere is an AIM on the indicator, meaning at this point the next logical step might be a shot to the upside in the next week. There was heavy call and put volume on the $37 strike, which seemed quite coincidental. Why that level? There were more calls than puts. The OI is still over 10k on the option. \n\nMy target is $42 by 3/19. But I encourage you to do your own analysis and come up with your own targets. I happen to think this is a good potential trade. I think in this case, the probability in my belief is to the upside.",
        "subreddit": "wallstreetbets",
        "title": "SOXL will rock your SOXL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1bokv/soxl_will_rock_your_soxl/",
        "created": 1615340256.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614700562,
        "id": "lw57ow",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n\n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n\n\\-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n\n\\-Do you think there’s a Semiconductor shortage? Y/N\n\n\\-Do you like 3x Leverage? (let the pros do some of the work!) \n\n \n\nBears🌈🐻say: “ShoRtaGe MeANs LeSs PrOFitS”\n\nRe: Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation. Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n\n\\-Stimmy?💉💰💰💰\n\n\\-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n\n\\-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\n&amp;#x200B;\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\n\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\n\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks harder on dips but that’s when you buy MOAR calls for insane gains.\n\nShares @ ATHs &amp; dips 1455 (68 pre split)\n\nCalls @ ATHs &amp; dips \n\n&amp;#x200B;\n\nPosting today cause: dipped\n\n📷📷",
        "subreddit": "wallstreetbets",
        "title": "Tired of Meme Stocks? $SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw57ow/tired_of_meme_stocks_soxl_3x_semiconductor_play/",
        "created": 1614729362.0
    },
    {
        "author": "GreedySpeculator",
        "created_utc": 1615299669,
        "id": "m17d8o",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " What is priced in FED Land ?\n\nNearly a full hike in EOY 22 | 2.3 % Average fed funds over next 30 years | 10/2 at 143 bps which is a level last seen in Dec 2016 which is the peak of the Trump era.  \nI Believe in light of recent fed communication that this is too aggressive. Fed communication has made it clear that what matters is u6 (the real unemployment figure) and that their tolerance of the constraint is a “sustained overshoot of 50bps - Bullard or \"even 3% wouldn’t worry me as long as it’s not 3% on the way quickly to 4% - Evans  \nFor those who have offered concrete formulation of what the AIT, it is clear that what will be the rate hiking cause is NOT inflation but the path to max employment as, by all accounts and consensus, we will NOT reach such a high inflation path over a year. **Thus any Employment data surprise will be hawkish and vice versa Now that we have defined the optimization problem which the FED is solving**, let’s try to solve it using the data and see if we agree with the market:\n\n**CapEcon - (Does not take into account infra bill)**  \nWe anticipate QE will be tapered from the start of 2022, and a very gradual rate liftoff will begin in mid-2023. We expect base-effects and fiscally stimulated growth will allow inflation to reach levels rarely experienced over the past decade, with headline inflation flirting with 3% and core inflation around 2.4%, Uncontrolled overheating isn’t likely if inflation expectations remain anchored. JPM forecast anticipates this move, but frames it as transitory volatility rather than trend. So should the Fed. Given that money markets are pricing an early Fed liftoff but TIPS markets are not pricing an inflation overshoot, either investors doubt the Fed or don’t understand it Markets likely to struggle to price in an even earlier Fed hike. Take profit on tactical longs in 5Y UST and stay neutral duration\n\n**Barclays**  \nDespite the sharp sell-off, long -term yields do not look high in the context of a stronger growth outlook. Still, front-end yields are inconsistent with the FAIT framework. We maintain our recommendation to be long 3y US Treasuries. Given the steepening, we are turning neutral on our front to intermediate steepener view. While it seems premature to declare that the hiking cycle (the start of which is two years away) would be finished within five years, with more stimulus likely down the road, there is some risk of an overshoot as well. Also, as we argued here, passage of an infrastructure plan later this year could still push long-term real yields higher. At the upcoming FOMC meeting, the Fed is likely to convey a greater tolerance for above-target inflation before raising short-rates than is priced in. This should push out the timing of the start of the hiking cycle, in our view. We view the rise in long-term yields as reflecting a brighter economic outlook. Progress on infrastructure spending poses upside risks to them.\n\n**YELLEN**  \nIt would take 2 years at this rate to get back to pre covid u6 (puts us on March 23)\n\n**GS** WITH INFRA /!\\\\  \nthe simulation implies 7% Q4/Q4 GDP growth in 2021, a decline in the unemployment rate to 3.7% in 2021Q4 and 3% by 2023Q4, a pickup in core inflation to 2.2% by 2023, and one to two rate hikes in 2023 under our interpretation of the Fed’s new framework. We expect FOMC participants to be more conservative in their projections at this early stage of the recovery, with a median forecast of 2.1% inflation and one rate hike in 2023. Our own forecast instead calls for liftoff somewhat later, in the first half of 2024, because our inflation forecast is a bit lower, reflecting a lesson from last cycle that an extremely tight labor market will likely be needed to generate the level of inflation that the FOMC now requires for liftoff.\n\n**MS**  \nWhile inflation in the reopening-sensitive sectors is likely to prove transient,a more sustainable impulse to inflation will start to take shape in 2021 – led by shelter inflation,healthcare services,and a multi-quarter passthrough of dollar weakness into goods. The sustainable inflation impulse intensifies in 2022as cyclically sensitive inflation components start to dominate – based on a tightening labor market and robust levels of demand. Core PCE to peak at 2.3 on DEC 22 !!!!*that TIPS-based breakeven inflation, based on CPI inflation measures, could move considerably higher and still be consistent with a PCE inflation outcome modestly above the 2% target.”*\n\n**My own Conclusion** If you assume no infra or an infra bill that is close to entirely paid for via additional taxes and has a low multiplier we are definitely slightly above fair value in terms of rates. The Fed into FOMC next week WILL not assume an infra bill or its implications within the SEP thus in this case it is still possible to have a SEP that shows **no HIKE in 2023** So I cannot help but be bullish duration (&amp; implications, see title) into FOMC March 16 and Auctions March 11 However - **Progress on infra / Data points indicating or suggesting faster path to min u6 will be hawkish EuroDollars (&amp; implications)**  \nI DO Believe there will be progress on an infra bill that will be generally expansionary in the end - thus the real trend is still an increase in real rates / ED and the implications that come with it : \\* Gold down / \\* TXN down / \\* Dollar up vs EUR,CHF,Yen / \\*NQ valuation down / \\*Banks up / \\*Value &gt; Growth / But there should be a respite as we’ve already had strong progress in this direction and  \na) we will get a FED that, by ignoring the infra bill, will be able to push back VERY strongly through the SEP  \nb) We are hearing stories of Manchin refusing to use fillibuster (which would make the infra bill A LOT Less exciting)  \nHow to trade this then ? Clearly, the real solution is to sell puts on NQ expiring soon to buy puts expiring later (apply that to all the other asset classes)\n\n**TLDR : LONG $QQQ, $GLD, $TLT into FOMC.**\n\n**Super monkey trade : Sell near term QQQ/GLD/TLT puts to buy longer term ones.**",
        "subreddit": "stocks",
        "title": "My thoughts going into FOMC next week | Long Duration : $QQQ $GLD $TLT $FXY",
        "url": "https://www.reddit.com/r/stocks/comments/m17d8o/my_thoughts_going_into_fomc_next_week_long/",
        "created": 1615328469.0
    }
]