[
    {
        "author": "reddefense",
        "created_utc": 1612133949,
        "id": "l9of92",
        "num_comments": 7723,
        "num_crossposts": 6,
        "selftext": "For what it's worth...\n\nThis morning I called up Fidelity because I wanted to make sure my extended hours trading was enabled on my account...took 90 minutes on hold to get through.  Apparently, they are slammed over at Fidelity, I asked the gal on the phone what's it been like today...she said because of all this stuff with Robinhood, they're looking at +700% daily volume for transferring accounts, which is quite amazing.\n\nHappy hunting! \n\nWE LIKE THE STOCK!\n\nSTICK IT TO THE MAN!",
        "subreddit": "wallstreetbets",
        "title": "Robinhood is toast....Fidelity massive transfer volume",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9of92/robinhood_is_toastfidelity_massive_transfer_volume/",
        "created": 1612162749.0
    },
    {
        "author": "CriticDanger",
        "created_utc": 1612029808,
        "id": "l8rhr3",
        "num_comments": 4745,
        "num_crossposts": 0,
        "selftext": "Hello all,\n\nLet's use this thread to discuss the GameStop situation this weekend, please don't open new threads about it unless it is a unique perspective or brings very valuable information.\n\nDo note, posts and comments are still restricted to users with a higher Karma and account age.\n\n##Important information\n\nFirst, let's get some things out of the way:\n\n* The short squeeze has not squoze yet, short interest estimates are still extremely high, I won't post the sources and encourage you to search for it yourself.\n* The gamma squeeze has not happened, it may happen Monday, it may happen gradually, it may not happen (if their positions have already been covered), it isn't necessary for anything to happen, however.\n* The establishment is still lying about many things for the purpose of market manipulation (Jim Cramer, CNBC, etc.). These people are SOLD. Read Canadian news channels regarding situation, they are much less biased!\n\n---\n\n##Let's make a list of the Brokers that betrayed the Retail Investor\n\nThe worst thing that happened this week, was the betrayal of our Brokers, choosing instead to side with the establishment and restricting the purchase of certain stocks, tanking those tickers.\n\nNow, I'm aware this is more complicated than that, and some clearing houses forced some Brokers to do it. **Even if that was true, the Brokers should tell clients that this is the cause, and they should be pushing, as much as we are, at getting this resolved.**\n\nHere is my initial list, please comment below and let me know which ones I've missed:\n\n## Bad Brokers - Restricted purchasing of certain tickets\n\n* Robinhood - [Join the lawsuit against them if you were affected](https://robinhoodgamestopclassaction.com/)\n* Interactive Brokers (US/CAN)\n* Webull - [Admitted they were forced to by clearing firm](https://finance.yahoo.com/news/we-bull-ceo-explains-why-trading-was-restricted-amid-the-game-stop-market-mania-172539318.html)\n* E-Trade\n* E-Toro\n\n\n\n## Good Brokers - Did not restrict trading\n\n* Fidelity \n* Questrade (CAN)\n\n\n---\n\nWe will keep this list on the sidebar...forever. Please help me build this list to completion.\n\nThank you all for your patience, we are sorry new members are not able to comment yet, we promise you will be allowed to once this is over!",
        "subreddit": "stocks",
        "title": "Weekend GME Thread + Homework for all: Let's stop using brokerages that halted trading",
        "url": "https://www.reddit.com/r/stocks/comments/l8rhr3/weekend_gme_thread_homework_for_all_lets_stop/",
        "created": 1612058608.0
    },
    {
        "author": "joeykomari",
        "created_utc": 1611841044,
        "id": "l6wrig",
        "num_comments": 3710,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "YOU CAN STILL BUY GME &amp; BB on WeBull, eTrade, fidelity, and others, post your platform of choice and keep those 💎🙌🏻 strong!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6wrig/you_can_still_buy_gme_bb_on_webull_etrade/",
        "created": 1611869844.0
    },
    {
        "author": "TitusSupremus",
        "created_utc": 1610895967,
        "id": "kz7ygv",
        "num_comments": 2872,
        "num_crossposts": 0,
        "selftext": "# Ok retards listen up. Been seeing lots of cucks writing small DD pieces of bullish or bearish shit. You cucks need to read this cos this is the whole fucking thing.\n\nthis is also basically my magnum fucking opus so upvote retards. Dont give me awards, legit go buy a powerup membership for a year. Cant tell you to buy shares because we gonna get closed down by Suck Elons Cock somehow.\n\nim also not some fininacial advisor or whatever just read this and make your own conclusions degenerates.\n\nTLDR: GME DD sumarized, Margin doesnt affect longs the same way as shorts right now. Dont buy shares on margin though and get ready to supply collateral regardless. Short interest is up and some smart retards are on our side. Read the post to raise your IQ from 8 to 9 though. **🐻 🌈s  mega fuk and even posting high level bear shit to scare us.**\n\nCompulsory 7 rockets so you autists dont start having a seizure or something:\n\n🚀🚀🚀🚀🚀🚀🚀\n\nBasically been seeing posts about \"blah blah margin this, short interest this, WS to clever blah\". Going to split this post into distinct sections but im no english degree cuck so dont expect any bear bloomberg  level shit or something\n\n# 1. GME is a fucking steal regardless of squeeze. Buy now or be left on a dying planet while we head to alpha fucking centauri.\n\nSo basically everyone here knows about Ryan cohen and his horsemen of the apocalypse coming to steal melvins lunch money. This man bought apple stock in 2017. Hes fucking rich. Hes also an eccommerce wizard, taking CHEWY from a measly 100k co-founded company to a $4 Billion company in 2017 at which point he sold it to petsmart or something. Its now valued at $40 Billion, granted anything eccommerce now gets money thrown at it like a stripper in a high flying strip club or some shit idk im a virgin so dont listen to me, so it may well be a bubble. Regardless the thing grows its revenue like bacteria doing mitosis on agar jelly 🚀🚀🚀🚀.\n\nTHEY SELL FUCKING PET FOOD. the market for that is like what? $1?. Gaming is going to the moon and is basically recession proof because of how cheap game is compared to other things for how much you get out of it. Any bears saying that Gamestop cant compete with digital or with amazon. Ryan cohen already slapped amazons head in with a no name brand. Hell fucking do it again. About digital everyone here already knows, microsoft deal, Ryan cohen also mentioned the possibility of having \"Digital game exchanging\" or something, image below.\n\n*Processing img 2ba9j5d2zvb61...*\n\nHe also mentions streaming, digital content etc and aside from all the digital stuff wants GME to move to a community centric structure where big stores operate with VR centres, Internet cafe, table games like Dungeons and dragons and  40k (rapidly growing somehow will boom post covid) and as we now might know due to this post:\n\n[https://www.reddit.com/r/wallstreetbets/comments/kypuyb/gme\\_dd\\_buildapc\\_kiosks\\_coming/](https://www.reddit.com/r/wallstreetbets/comments/kypuyb/gme_dd_buildapc_kiosks_coming/)\n\nBUILD YOUR OWN PC KIOSKS. This is the literal smell of money. Go to your Gamestop to build your PC with your kid? Gamestop is already the goto place wher your parents go to get you your latest digital fix so now they can go build PC's and it cant go tits up?\n\n**Now for some pussy boomer talk (aka fundametals or something).**\n\nThe expected Q3 EPS was -0.84$ or something close to that. The actual loss was -0.53$ but boomzoids only talked about the revenue drop. No shit sherlock its closing all its dead weight stores.\n\nIn the holiday report I will talk about a bit more below, 11% of stores were closed and revenue dropped only 3%. Comparitive store sales increased nearly 5%. They cant get enough consoles to sell so expect the momentum to carry on for the whole year I expect. Eccommerce is up 300% over holidays. In Q3 they reported 800% to date. In 2020 Gamestops eccomerce went up 24x. YES YOU READ THAT RIGHT. Online sales now account for \\~33% of Gamestops sales now. This is literally gold dust for ryan cohen.\n\nWe are still trading at 0.38 P/S at this price. The average P/S for the SP500 is 2.753. Massive upside on these two numbers alone.\n\nBurry got in this for the MOASS and the intrinsic value. At the time intrinsic value was like $22 and this will pump up as RC takes it to new heights.\n\nGME in Q3 somehow halved the expected loss. Big Bad Boomer sherman somehow didnt fuck it up that bad by saying \"omnichannel\" at the speed of light. Yes the revenue dropped 30% but thats covid for you. As the PC kiosk post above shows GME now sells small items basically so fast they have to have fake stock lmao. The new console cycle always spikes the share price sky high too, as youll see in a crayon drawing later. The potential revenue that this console cycle brings in could be huge. Biggest ever is potentially a true statement and Gamestop sells every fucker they get. Combine the fact that they share game pass ( a massive hit) revenue from the xboxes they sell, something no other retailer has, revenue could be sky high.\n\nNow I know you autists are starting to develop short term dyslexia or something but keep reading. This could be the most important piece of shit you read in your life. How do you think I feel? My brains overheating just trying to write coherent sentences.\n\nHoldiay report was a bear trap imo, saw people saying the decrease in revenue was bearish blah blah blah. Lies. Comparitve store sales rose 5% and thats with some towns having like 4 gamestops. When the leases dont get renewed and these stores get liquidated (Also in Ryan cohens letter) they can just get this influx of cash and pay down debt and invest in logistics and marketing and new growth. Gamestop realistically needs like 1/2 the stores they have now and just need to improve efficiency. \n\n[https://www.entrepreneur.com/article/349890](https://www.entrepreneur.com/article/349890) this article the messiah himself wrote. In it he states:\n\n&gt;At Chewy, we had maniacal discipline when it came to how we spent money. The company-wide culture of frugality came from his example. Free cash flow was our unwavering governor of growth. We grew Chewy from $200 million in sales in 2013 to $3.5 billion in 2018 while spending only $130 million in capital, all of which went into opening distribution centers across the country and acquiring new customers.\n\nManiacal. Thats all I need to say. The guy is going to get to mars before papa musk and he wont even break a sweat. When FCF starts to catch up to WS expectations every cuck analyst who donwgraded them is gonna get ditched and upgrades will start to happen.\n\nSo in the headin i said its a steal. That implies some future higher price target right? Well here is my guess for a conservative price target based on the information above and also some more I probably forgot cos im a retard.\n\n&amp;#x200B;\n\n[The difference is where share price looks to be and where market cap places us is due to difference in outstanding shares \\(another reason shorts are fuk\\)](https://preview.redd.it/dehiug393wb61.png?width=1552&amp;format=png&amp;auto=webp&amp;s=f198773c36d5109382eb2beba6fade3c059121df)\n\n&gt;The difference is where share price looks to be and where market cap places us is due to difference in outstanding shares (another reason shorts are fuk)\n\nThis alone means if for not inflation adjusted terms we reached 9.8Bn or whatever the crayon chart says we should reach:\n\n9.8/2.48 = \\~3.95   3.95 \\* $35.5 = \\~$140. The share price now to reach old mkt cap is $140 fucking dollars. Thats a 4 bagger from now. It gets better. \n\nfrom [statista](https://statista.com) :\n\n&gt;Considering the **annual inflation rate in the United States** in recent years, a 2.24 percent **inflation rate** is a very moderate projection.\n\nIf we take 2.24% inflation, the this share price target in todays money means we should reach $182 because of $140 \\* 1.0224\\^12, = $182 in adjusted. Thats more than a 5 bagger. basically we could see $10 GME price from short manipulation and buying more is basically a lottery ticket!\n\nI really dont understand the bear thesis. The only bear thesis ( short term this one) was that margin would affect longs more but I looked at it on ortex and its basically bullshit. Buy shares with cash though dont use margin. Own your piece of GME dont borrow it. Bears just spout \"DigITaL\" or \"BlOCKbuSTER\" so much Ryan tweeted a shit emoji at them. All the bears think theyre clever. What the fuck makes those cucks special? How are they different now than the ones from $2, or $4, or $10. \n\n**Bears are betting against:**\n\nRyan fucking cohen, buisness legend CHEWY from 100k investment, now 40 billion\n\nMichael burry, Investing legend, predicted the housing crisis and is in GME since april\n\nu/DeepFuckingValue , the new WSB god chad, now basically a whale\n\nReggie Fils-Aimé, gaming and buisness legend, former COO of nintendo\n\nSenvest, a mega fund thats actively managed\n\nNorweigan sovereign wealth fund\n\nFidelity, Vanguard and blackrock own this shit and are never selling they literally dont give a shit\n\nAll of WSB has now formed a shield wall against the bears\n\nMicrosoft gave GME highly discounted azure deals and free office use for all employees and a revenue sharing agreement. Bears are stupid if they think MSFT didnt vet GME.\n\n&amp;#x200B;\n\nSome valid bear thesis left now (the only ones left) ----&gt; Ryan Cohen dies.\n\n# 2. Now some analysis on the short squeeze and some technical data on puts and calls and ortex data.\n\nOk everyone on here and their cat, dog, bedbugs and wifes boyfriend  knows about the squeeze. Jimmy chill aka cramer even talking about it. Gamestop is literally the most shorted stock of all time and space. The squeeze makes every autist salivate because its basically free money while cucking big money out of like what 1% of their fund.\n\nAlthough I know all you cucks hate shares, and hate holding, if the squeeze doesnt happen selling is probably the most retarded thing anyone could do. Its literally buy high sell low and you fucking disgust me. STONK ONLY GOES UP.\n\nThis squeeze is so monumental that its been sucking sharks in like fresh blood. Most of the funds where shorting this from 30-15 dollars before this year so they didnt really care. It all changed with 2 people. u/DeepFuckingValue and Dr. Michael Burry. These guys are as OG as it gets with GME. I think u/DeepFuckingValue may have even sniffed this trade out before the legend himself. Since then funds will have churned this through their rules and started jumping on this train. Ive been in since $13 with 125 shares. If I had more money Id be buying but im just some stupid student ok. Im merely a medium for this money made information.\n\n**The stats for this stock now short wise are, from ortex:**\n\n*Concrete* short interest as of 31 December 2020: **71 Million**.\n\n*Estimated* short interest, *January 11th data:* (This isnt predicted, this is from data in flow, has margin of error) : **77 Million**\n\nShort shares on loan 7 days ago: **50 Million**\n\nShort shares on loan *now* (This breaks the bearish margin calls affect longs more thesis): 54.2 Million\n\n% of known float short: **147%** as of 31 December 2020\n\n% of know free float on loaned shorts: **108%** as of January 11th.\n\nSome [guy](https://www.reddit.com/r/wallstreetbets/comments/kyocql/updated_potential_holdings_of_gme/) on here took into account extra buying on wednesday, Institutions, Burry, RC's extra 7% and WSB ownership (something so stupendously  retarded no serious firm will do it) that float on short could be in the 100s of %. Total short float now I would say could be **200-400%** if the numbers are correct.  This pisses on all other short squeezes. Some countries ban shorting above 100% cos of how autistic it is.\n\nThe recent hike in interactive brokers available shares is probably a mix of sell off on friday (remember  some guys are now buying lambos with GME money. If they held they could by 10), calls exercising and puts being covered and brokers ditching the shares. Nakedshort even reported 5 million naked GME shorts on friday. This is bullish as fuck because the best the shorts could do on a red market day was **-10%**.\n\nGamestop is still on the SECs threshold list for 27 days now.\n\n*Processing img xsetax08pwb61...*\n\nNeed rockets 🚀 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀:\n\nOk so now if WSB owns an estimated 6-8% of the stock and we all know to move over to cash accounts now to avoid margin calls, we should be minimizing longs getting margin called. Every bear on stockwits is a clueless cuck who spouts \"blockbuster\" and these guys dont even know what margin even is so my bet is the colossal **54 Million** shares short on loan are gonna be affected by the margin calls more. Why? Because every long on margin is in the green, and now a true zealot/extremist/autist for ryan cohen so will supply their account with collateral to avoid margin call. Shorts are in the massive red zone. How do I know you ask?\n\nOrtex data from Jan 4th 2021:\n\n*Processing img urqb3c3zbwb61...*\n\nSo this shows for jan 4th the estimated short interest is 66.98 Million shares. From the exchange reported 71 Million on december 31st this makes a lot of sense because the share price fell from \\~21 to \\~17 so shorts took profits. The shares on loan arent for longs too. This is all purely short data, and 47M  shorted at $17 this shows.\n\nThese shorts are in a circle of hell we cant comprehend and makes satan scared.\n\nNow for the data for this week:\n\n&amp;#x200B;\n\n[Ortex short data for Jan 14th for Gamestop](https://preview.redd.it/5ryumpl1dwb61.png?width=1152&amp;format=png&amp;auto=webp&amp;s=fb80c09e1be7b2f36f6d3745983cef4ce2b2df9b)\n\nSHARES ON LOAN HAVE GONE UP.  BUT 87% OF LOANED SHORTS WHERE SHORTING AT SUB $20. \n\nCost to borrow is also up, estimated short interest is up to a cataclysmic amount.\n\nLongs on margin need to supply collateral, but we are in the massive green zone, shorts are underwater. Margin calls will ravage the shorts and sting the longs. We also have the uptick rule in place until the end of the day, so shorts can only short on the way up. Im not saying itll happen but this shit is skewed in our favour big time. we need to 💎[🙌](https://emojipedia.org/raising-hands/)💎[🙌](https://emojipedia.org/raising-hands/)💎[🙌](https://emojipedia.org/raising-hands/)💎[🙌](https://emojipedia.org/raising-hands/)💎[🙌](https://emojipedia.org/raising-hands/)💎[🙌](https://emojipedia.org/raising-hands/)💎[🙌](https://emojipedia.org/raising-hands/)💎[🙌](https://emojipedia.org/raising-hands/).\n\n**Seen a lot of talk about Gamma hedging and delta.**\n\nYou realize that the fucking bankers and brokers dont understand gamma hedging right? That shits up their with the black-scholes equation and feynman-kac solution. Forget about it. The retards claiming to understand it are either payed by hedge funds or lose money. The guy who took out outs thinking options exercising and gamma hedging would lead to a collossal sell off on friday lost money on his puts because **no one** except some quants in a goldman sachs server room know this shit. The idea is simple about neutral delta on options that people take out, but the simple system interacts with every other thing in the stock market, and wow who couldve guessed it, like nearly any other element of the stock market predicting something by the day is nigh impossible. That guy talking about Gamma , Delta and margin calls is on weeklies. Hes no more autistic and equally retarded as all of us. Hes a chill guy though so dont berate a fellow brother.\n\n**Now weve established the likelihood of longs getting margin called is far smaller than shorts, on to the options distributions**\n\n**Two images now: Top one is before the end of the 15th, the other one is after market close:**\n\n&amp;#x200B;\n\n*Processing img t8odq9btgwb61...*\n\n&amp;#x200B;\n\n*Processing img 3nqb33f0hwb61...*\n\nThese two graphs, show before market close and after. As we can see the massiver 51000 put contracts didnt get rolled over and the chances that those were melvins july puts rolled up is very high. They expired worthless. Lots of calls are printing big time while huge amounts of puts are worthless and bleeding money.\n\nSomething else we can extrapolate from the charts is that massive options trades are not present on the scale we saw before (tens of thousands).\n\n🚀 🚀 🚀 🚀 🚀 🚀 🚀 \n\nWe are seeing a discrepancy in the number of puts/calls opening up at the higher prices with calls gaining fast. This could show that some funds are now becoming optimistic on the long or short term prospects of gamestop. There are also more puts than options and if we assume this for shorts vs longs on margin (without even taking into account that all shorts are borrowed shares and pay interest further bleeding cash) then shorts are likely on more margin than longs.\n\nRegardless fellow autists my main point is two show that the bears are underwater and the bulls are flying high with regards to options.\n\n**Now lets compare this possible squeeze with others.**\n\nBear in mind this is the most shorted stock of all time, but differences in free float change the share price differently.\n\nKodak went from **$2.16 to $33.2**\n\nVolkswagen went from **\\~200 euro to nearly 1000.**\n\nOverstock went from **\\~$21 to $123**\n\nBlue apron went from **$2.31 to $18** \n\nIve been seeing some estimated that 1 million shares is roughly a dollars move in share price. This maths is about to be pretty autistic so bear with me degnerates.\n\n$1 now is 2.81% of the share price. Everything in the markets is exponential and based on percentages. So if we assume a full squeeze of ortexs estimated short interest (This assumes no sell off and no new shorts, new shorts can be positive or negative depedning on when in the squeeze they happen) **$35.5 \\* 1.0281\\^77 = $299.** GME to moon. 🌑 .\n\nThis shit can happen. Hold on.\n\n**GME has squeezed and been manipulated before and it always happens around the console cycles. Shorts never win and they wont win now.**\n\n&amp;#x200B;\n\n*Processing img 4ysv7bzclwb61...*\n\nBasically the crayon chart shows green (outstanding shares) orange ( short shares) purple (Market cap) and cyan (Share price). In 2006-2008 the share price rose in tandem with short interest ( Like now ) Until console releases when you can see an abrupt squeeze happend mooning the share price. \n\nThis happend to a degree in 2013 with the xbox one but worse conditions for the company and a worse console launch lead to slow short covering but the share price still mooned.\n\nNow we get to the best part. History is repeating itself for the third time and the shares sold short are literally higher than the outstanding shares, which have been decreasing since 2010. Short shares are also at the highest point ever and GME hasnt had a brighter future, well ever. Ps5 and Xbox Series X. are the two most hyped consoles since the Ps2. This is setting up the foundations for massive price movements weve never seen before. This shit has literally never happend, ever. Uncharted waters and we are the captain.\n\n**For the insurmountably retarded autists who think that the squeeze has happend look upon this and despair:**\n\n[**https://www.reddit.com/r/wallstreetbets/comments/kwpf6k/gme\\_gang\\_there\\_hasnt\\_been\\_a\\_short\\_squeeze\\_yet/**](https://www.reddit.com/r/wallstreetbets/comments/kwpf6k/gme_gang_there_hasnt_been_a_short_squeeze_yet/)\n\nIHOR IS A MEGA WIZARD\n\nIhor I quote:\n\n&gt;**A long-buying tsunami ... is the primary factor for the price move**\n\nIhor Dusaniwsky is managing director of predictive analytics at S3 a firm similar to ortex. He told bloomberg that the squeeze hasnt happend yet and that this was long buying. If someone knows this shit its him. He was talking about the tesla squeeze in january 2020. He has access to resources we can only imagine. Barrons cut his comment that the squeeze hasnt happend yet out it was that fucking bullish. All the media ramming down \"Short squeeze has happend\" down peoples throats because bears are fucking scared.\n\nThe bots on stocktwits spamming bearish sentiment should show how rattled they are.\n\n**Conclusion: Buy shares with cash not margin. Hold shares forever unless RC dies (Shame hes a cybernetic demigod), Melvin bad, Shorts fuk, 🐻 🌈  posting bearish shit are doing weeklies for the second time after they expired red on friday, GME to $200 without squeeze, Ryan cohen a god, GME is still a value play, Good luck have fun.**",
        "subreddit": "wallstreetbets",
        "title": "(GME DD) One DD to rule them. One DD to find them. One DD to to bring them all and in the darkness bind them.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kz7ygv/gme_dd_one_dd_to_rule_them_one_dd_to_find_them/",
        "created": 1610924767.0
    },
    {
        "author": "Puzzleheaded-Air9290",
        "created_utc": 1612043485,
        "id": "l8woiw",
        "num_comments": 2837,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Move to Fidelity retards!! There are no restrictions. Bought a ton. Buying more🚀🚀🔥💎🙌🏻 GME AMC",
        "url": "https://i.redd.it/0dq5pttejje61.jpg",
        "created": 1612072285.0
    },
    {
        "author": "enter--matrix",
        "created_utc": 1612107074,
        "id": "l9eih1",
        "num_comments": 2764,
        "num_crossposts": 5,
        "selftext": "*Disclaimer: I'm not giving you retards any financial advise whatsoever. You are free to do whatever you want with your money. I'm just providing you with my research for you to make up your own conclusions.*\n\n--------------\n\nListen.\n\nFidelity and Vanguard are in a class of their own when it comes to retail brokers available to retail investors. Shithood, Interactive Dumbasses and so on do NOT compare. \n\nShithood is a little startup that has to answer to hedge funds, HFTs (their main customers of order flow buys), and venture capitalists. Shithood CEO has no fucking idea what he's doing and is clearly vested in our failure.\n\n## **Fidelity and Vanguard** 🚀🚀✅\n\nHere come the big fucking boys!\n\nFidelity has **$3.3 trillion**, YES trillion, in assets under management. Vanguard has **$8.8 trillion** in assets under management. I am saying TRILLIONS, not little billions.\n\nGuess what? **THEY ANSWER TO NO FUCKING ONE**.\n\n## **Fidelity owns 13.67% of GME shares.** 💸💸💸\n\nAnd Vanguard? 6.27% of GME shares. \n\nhttps://preview.redd.it/8gutt1kephe61.png?width=667&amp;format=png&amp;auto=webp&amp;s=574fc95b38139a8679a593999934fe531c796c6a\n\nSource: [https://money.cnn.com/quote/shareholders/shareholders.html?symb=GME&amp;subView=institutional](https://money.cnn.com/quote/shareholders/shareholders.html?symb=GME&amp;subView=institutional)\n\nCollectively, **they literally own 21.10% of GME**. They are INVESTED in its success.\n\nConsider putting your volume, our customer base, behind them. They are with retailers.\n\n# **Okay, so what do I fucking do now?**\n\nOpen a new account in either of these brokerages. Deposit your money and buy GME! Fidelity gives you INSTANT funds as margin. \n\n# **LEAVE YOUR SHARES IN RH. TRANSFER YOUR MONEY OUT.** \n\nI know, this sounds fucking stupid. But your shares are needed in play next week. LEAVING THEM IN RH FOR NOW! HOLD DIAMOND-HAND IT 💎👋\n\nTransferring your assets (shares, options) takes [5-14 days with Fidelity](https://www.fidelity.com/customer-service/transfer-assets), and [similarly at Vanguard](https://investor.vanguard.com/contact-us/faqs/what-investment).\n\n# again: **LEAVE YOUR SHARES IN RH. TRANSFER YOUR MONEY OUT.** \n\nDo NOT transfer your shares from RH yet!! Just your money.\n\nHere is how to **open a new brokerage account**:\n\n\n## **Fidelity Brokerage account: [https://www.fidelity.com/trading/the-fidelity-account](https://www.fidelity.com/trading/the-fidelity-account)**\n\n\n## **Vanguard Brokerage account: [https://investor.vanguard.com/investing/online-trading/](https://investor.vanguard.com/investing/online-trading/)**\n\n\n-----------------------\n\n**FAQ**\n\n*How long does it take to open an account w/ Fidelity?*\n\nAbout 5 minutes! Transfers are instantly credit in your account as margin.\n\n*Okay, so I opened a Fidelity account. Now what?*\n\nEnable \"Real-Time Quotes\"! Go to [this link from Fidelity](https://www.fidelity.com/customer-service/how-to-get-real-time-quotes).\n\n*What tools or apps are available to me in Fidelity?*\n\nThere are three available to retail investors. The website, the mobile app (iOS &amp; Android), and Active Trader Pro. I use all three, with the mobile app being my favorite.\n\n-----------------\n\n*positions: 300 GME*",
        "subreddit": "wallstreetbets",
        "title": "FIDELITY and VANGUARD!! Transfer your MONEY now if you're stuck in RH. They've combined $9.3 trillion in AUM! They own 21.1% of GME collectively! SWITCH OVER NOW 💎👋",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9eih1/fidelity_and_vanguard_transfer_your_money_now_if/",
        "created": 1612135874.0
    },
    {
        "author": "0MNIBU5",
        "created_utc": 1612126296,
        "id": "l9looo",
        "num_comments": 2752,
        "num_crossposts": 3,
        "selftext": "I am holding and I am buying. They’ve had the weekend to decide what they’re going to do. If I was in their shoes, allowing a game squeeze to 1000 and knocking the price down because they think people will sell is not a bad move for them to make.\n\nThink about the hype of this subreddit, 1k is not a meme is the mindset of most people still. we are sitting at 320 AH, and the germans are going to have to do some work to get us higher in the pre market tomorrow. The goal is to close green EVERY SINGLE DAY THIS WEEK. It’s the way that GME gets squeezed. A realistic way is if we maintain hype. Billboards, planes flying fuck you robinhood. Remember that we are not actually organized. And tomorrow is the start of what I think is the most crucial day for GME. The swings will be wild, a lot of people have transitioned to fidelity and more and more are coming. We need the eurobros to hold for us. They will tire us, they will start to seed doubt into your mind. Do not let them. Hold strong, hold steady, the squeeze has not happened yet. \n\nDiamond. Fucking. Hands.\n\nEDIT: REMEMBER TO TURN OFF THE DELAY FOR FIDELITY.\n\nEDIT 2: i’m also not giving financial advice.\n\nEDIT 3: BEWARE THE BOTS AND THE ACCOUNTS PLANTING DOUBT.\n\nEDIT 4: To answer some questions -&gt; Fidelity is an app that is currently unrestricted. Buy game at your own discretion, I firmly believe that shorts haven’t covered, and that the massive amounts of bots and MM is proof that they’re getting more worried by the day. We are winning. We have won small battles, big battles, overcame walls, and so long as everyone here does their fucking job, this WILL succeed. I believe in all of you.",
        "subreddit": "wallstreetbets",
        "title": "Tomorrow is a big day",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9looo/tomorrow_is_a_big_day/",
        "created": 1612155096.0
    },
    {
        "author": "MasterCookSwag",
        "created_utc": 1612019568,
        "id": "l8nntv",
        "num_comments": 2076,
        "num_crossposts": 0,
        "selftext": "Honestly, I didn’t want to post this myself since there’s probably two dozen of these posts in the queue, but all of the recent ones look like they’re written by 8 year olds. \n\nNormally this belongs in the daily advice thread, but because of recent events and concerns over Robinhood’s ability to serve customer(I been telling y’all for years) we can have a thread in it\n\n\nSo here we are: recommend and discuss brokers, fees, features, mobile apps, whatever.  In general I think everyone is best served by Fidelity, Schwab, or Vanguard.  TD is another major player but for those unaware they are in the process of being acquired by schwab.  All three of those actually have phone numbers where you can call and speak to a person about your account.\n\nFor the younger crowd; a phone call is similar to voice to text, but instantaneous. \n\nAlso, feel free to chat apps or whatever too,\n\n#**No referral codes. Posting a referral code will result in an immediate no questions asked permanent ban** \n\nThanks.",
        "subreddit": "investing",
        "title": "By popular demand: official “I hate Robinhood and want a new broker thread”",
        "url": "https://www.reddit.com/r/investing/comments/l8nntv/by_popular_demand_official_i_hate_robinhood_and/",
        "created": 1612048368.0
    },
    {
        "author": "BuddyGuyBruh",
        "created_utc": 1611913803,
        "id": "l7opbs",
        "num_comments": 1518,
        "num_crossposts": 0,
        "selftext": "I have to start his post that I am retarded and that this is not financial advice, you all here do your own research and make your own decisions, all I know is that **I LIKE THE STOCK!**\n\n&amp;#x200B;\n\n💎🙌🚀🚀**TLDR at the bottom.**🚀🚀💎🙌\n\n&amp;#x200B;\n\nI do not think that you all here realize that we have essentially won yesterday at 9:58 AM and that we almost crashed the entire thing. There was a post here describing a [\"30 Seconds From Triggering Market Nuclear Bomb\"](https://www.reddit.com/r/wallstreetbets/comments/l7bpf5/30_seconds_from_triggering_market_nuclear_bomb/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\nIn this post, they described and expressed their outrage with the Interactive Brokers Chairman interview. \n\n# THEY ARE CORRECT!\n\nThere was ANOTHER interview with  [Anthony Denier, CEO of Webull](https://www.youtube.com/watch?v=4RS4JIEVyXM&amp;feature=youtu.be) that I did not see that received  as much attention here.\n\nIn this interview, it is a bit longer **(** **must watch imo).**\n\nIt explains *some* of the ambiguity with the previous interviews with Vlad from Robinhood and what happened in general.\n\n# It confirms that:\n\n1. THEY HAD A LIQUIDITY PROBLEM \n2. THE SHORTS  ARE STARTING TO GO BUST\n3. THE BROKERS ARE ON THE HOOK TO GET SHARES THAT THEIR CLIENTS CANT GET \n4. THE BROKERS THEMSELVES CANNOT COVER THESE POSITIONS PROPERLY\n5. THE CLEARING HOUSE ALSO CANNOT COVER AND ARE GETTING LOANS FROM THE BANKS DUE TO THE CAPITAL REQUIREMENTS.\n\n&amp;#x200B;\n\nEssentially, we **liked** the stock so much 🚀🚀🚀  that the shorties (all my homies hate melvin capital and shitron) blew up so fast that the BROKERS could not properly margin call them in time.  THEY COULD NOT LIQUIDATE THEM IN TIME TO GET THEM TO COVER THEIR POSITIONS IN TIME.  \n\nNow, the brokers are on the hook to go get the shares for you if their clients cannot. THIS is why there is a margin call and margin maintenance to avoid this from happening. But we BLEW past all of this so fast that they are now on the hook since their clients the  **🌈🐻** now cannot get the share that they legally need to provide you. \n\nSince these brokers are large, they usually have the capital to cover these losses and get the shares themselves. As [Thomas Peterffy](https://www.youtube.com/watch?v=7RH4XKP55fM&amp;feature=youtu.be) flexes that he has billions to cover. When I heard it first has made me raise my eyebrows since why would he flex this number and then highlight the 15billion losses. Then it hit me... **THEY CANNOT COVER THESE POSITIONS.** These brokers are starting to not be able to clear these transactions so their clearing house does it for them. \n\nThe clearing house in short makes sure that when you sell your share you get your money in your account. They usually have about 1-2% of capital requirements for the stock that is being traded to make sure that they can settle the transaction. HOWEVER, for GME it is raised to a 100%. \n\n**THE CLEARING HOUSE CANNOT SETTLE THESE TRANSACTIONS!**\n\nOnce Robinhood's clearinghouse went down the transactions started getting routed through Webull's clearing house ( I belive it is [Apex](https://www.apexclearing.com/) that they use). They almost IMMEDIATELY had to put a halt on it because they could not settle the transactions. \n\nTHEY STARTED TAKING LOANS FROM BANKS TO KEEP THEMSELVES FROM HALTING THE **ENTIRE** STOCK MARKET.\n\n# THE ENTIRE STOCK MARKET WAS ABOUT TO COLLAPSE BECAUSE THEY WERE ABOUT TO NOT BE ABLE TO SETTLE THE TRANSACTIONS! \n\n# THERE IS NOT ENOUGH STOCK TO GO AROUND!\n\nAt this point, what that all means is that THERE IS not enough stock to go around and the LOSES of these  **🌈🐻** are so **LARGE** that the brokers cannot get the shares that they are legally bound to do. And their CLEARING HOUSE cannot do it either.\n\nTHIS IS WHY THEY STOPPED YOU FROM BUYING BUT ALLOWED SELLING.\n\nThey used the short ladder attack and essentially in a low volume caused the price to drop by trading in between themselves to a point where they were sort of able to cover some losses. **BUT,**\n\nIN THE MIDDLE OF THIS SHORT LADDER ATTACK,\n\nThe most beautiful thing happened...\n\n# EVERYONE HELD:\n\n(From [Luis Rossmann's Video (6:18)](https://www.youtube.com/watch?v=enLiJfijWBI) )\n\n*Processing img oaf0eab8m8e61...*\n\nLook at that difference between BID and ASK.\n\nI love ALL of you. \n\nYou all  💎🙌  that shit so hard!\n\n&amp;#x200B;\n\nYou , yes **YOU** reading this , because **you** 💎🙌 that shit the price did not drop further. Because of every single one of you, they were not able to cover their positions.\n\n&amp;#x200B;\n\nWhat this all means is that we are close to winning and we will not only take out the greedy **🌈🐻 hedge fund 🌈🐻** managers but also THE BROKERS, THE CLEARING HOUSES and the WHOLE THING.\n\n&amp;#x200B;\n\nNow, this all means that we are very, very VERY close to winning. At this point, IF we manage to get all these options to exercise in the money today, it will be 15million -20 million shares that will have to be bought up by the market makers ( this is the gamma squeeze that is probably going to happen today and would then cause **the SQUEEZE** to the moon 🚀) \n\n&amp;#x200B;\n\nAt this point,  I plan to hold and you should too. \n\nIf we keep drying out these clearing houses, brokers like fidelity do not have clearing houses and there you should be able to buy freely. The more we clear them out the more they will have to cover and we have a chance for a real financial revolution.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTLDR:\n\nThe brokers have let their **🌈🐻  clients🌈🐻** lose so much money so fast that they were not able to margin call them in time and now they are on the hook to provide the shares.\n\nThe losses are so large that THEY the BROKER are not able to provide the share and then the clearing house has to do it. \n\nTHE CLEARING HOUSE CANNOT PROVIDE THE SHARES because of the capital requirements for GME and they are borrowing from the banks.  \n\nThis is creating a liquidity problem that can affect the entire market. Buy them out and then buy on brokers like Fidelity that do not have a clearing house.\n\nThis is why they stopped allowing GME to be bought but you could still sell it because they wanted to save their own asses. \n\nEveryone here managed to 💎🙌  so hard that caused the price to stop falling and the BID/ASK price to increase drastically.\n\nI am buying and holding.\n\n🚀🚀 🚀🚀🚀 🚀GME to the moon 🚀🚀 🚀🚀🚀 🚀\n\nI have 15 shares @ $40.44 (not much I know but I am gonna reload asap) and I am planning to sell 10%-20% at $10k and hold to sell the rest of my position at $42,069.69/share",
        "subreddit": "wallstreetbets",
        "title": "Explaing how we WON yesterday and how we have the potential to DESTROY all the hedge funds that shorted GME and change the ENTIRE Financial system forever disrupting the clearinghouses themselves!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7opbs/explaing_how_we_won_yesterday_and_how_we_have_the/",
        "created": 1611942603.0
    },
    {
        "author": "Humbuker",
        "created_utc": 1612051351,
        "id": "l8zg30",
        "num_comments": 1149,
        "num_crossposts": 0,
        "selftext": "You have decided to say FU to your shady broker that you no longer trust or maybe you are new to the finance world.\n\nYou chose Fidelity. Great choice.\n\n&amp;#x200B;\n\nWhat you need to know is that Fidelity by default shows charts that are delayed 15 min.\n\nIn order to fix this and have real time data, visit: \n\n[https://www.fidelity.com/customer-service/how-to-get-real-time-quotes](https://www.fidelity.com/customer-service/how-to-get-real-time-quotes)\n\n&amp;#x200B;\n\nMany people do not know that so I encourage you to spread the word!",
        "subreddit": "wallstreetbets",
        "title": "Fidelity users, beware!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8zg30/fidelity_users_beware/",
        "created": 1612080151.0
    },
    {
        "author": "CalamariAce",
        "created_utc": 1611320132,
        "id": "l2n5wv",
        "num_comments": 1110,
        "num_crossposts": 0,
        "selftext": "Do you remember when you bought that first used car off your friend, only to find out that you couldn't actually **use** the car, because he was actually renting it out to his buddies?\n\nOf course your fucking don't, that would be fucking ridiculous. A 5 year-old understands property rights well enough to know this would be beyond stupid.\n\nAND YET, this is exactly what your broker is doing to you when you hold shares in your account. Brokers make TONS of money by *loaning your shares to people who want to SHORT your stock*.\n\nThis is transparent to you as the stock holder. It all happens behind the scenes. Your broker is providing liquidity to shorts courtesy of YOU, which helps the shorts keep down the price of the stock you're holding. If you sell the shares, they gets yours back (or find them elsewhere) to close out your position, all without you being any the wiser than your own assets are being rented out under your nose to the benefit of your broker and of speculators who are taking the opposite side of the trade.\n\nIf you want to maximize the odds of a real short squeeze, you should stop playing into the hands of the shorts and OPT OUT of your broker's share lending program. Unfortunately, not all brokers allow this. If yours does not, you might be able to bargain with them or worst-case move to a broker that allows opt-out. This is one of the hidden costs of some (but not all) of the low-cost brokers out there.\n\n**TL;DR: Your broker lends your shares to shorts which helps drive down prices. You should opt-out of this with your broker, or consider switching brokers to one that allows opt-out.**\n\nEvery broker has a different marketing name for their share lending program (usually some positive-spun euphemism). ***Post the name of your broker and the name of their share-lending program*** (if they have one), and I'll add it to the table here to help others:\n\n&amp;#x200B;\n\n|Broker|Share-lending program name|Notes|\n|:-|:-|:-|\n|Interactive Brokers|Stock Yield Enhancement program|Disable under Settings --&gt; Account Settings. They push you to opt-in during account creation.|\n|Fidelity|Fully Paid Lending program|Opt-in does not appear to be default and only available for accounts &gt;= 250k|\n|Webull|Stock Lending Income program|Opt-in is the default. Must explicitly opt-out.|\n|TD Ameritrade|None|AFAIK there is no way to opt-out of TDA loaning your shares|",
        "subreddit": "wallstreetbets",
        "title": "Most of you are helping the GME shorts and you don't even know it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l2n5wv/most_of_you_are_helping_the_gme_shorts_and_you/",
        "created": 1611348932.0
    },
    {
        "author": "gariepy13",
        "created_utc": 1611869517,
        "id": "l79iay",
        "num_comments": 994,
        "num_crossposts": 0,
        "selftext": "They tried to short the stock into oblivion. \n\nWe saw. We bought. We held. \n\nThey hemorrhaged funds and bailed each other out. \n\nWe laughed and bought more.\n\nThey manipulated the stock down with short ladders and doubling down on their short interest. \n\nWe bought the dips and began to squeeze. \n\nThey convinced our platforms to block us from buying, even forced some to sell. \n\nWe said fuck robinhood et all, rode the wave, and bought and held with platforms that support the people (shoutout fidelity). \n\nWhat else have they left to do? The brokers who still allow free trading wouldn’t dare face the same backlash robinhood and others have received. Hedge funds can keep doubling down on their shorts and try to manipulate their stock but they know we’ll hold. The day of reckoning is upon us, the battle has just begun, and they’re already out of bullets. This is a fight for the people now, stand strong brothers. \n\nNot financial advice, take your own risks.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street is out of bullets.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l79iay/wall_street_is_out_of_bullets/",
        "created": 1611898317.0
    },
    {
        "author": "yzy_",
        "created_utc": 1611954571,
        "id": "l84alu",
        "num_comments": 936,
        "num_crossposts": 0,
        "selftext": "We made it through the battle today and are UP 69% (nice). The hedges are only getting more desperate after the put options that expired today but REMEMBER: they have at LEAST 2-6 days in the market to pay these off, and likely have MANY MORE options expiring in coming weeks. With the lack of shenanigans today I predict an extended-hours ladder attack is incoming when many retail traders are sidelined from the action, combined with another media push of scare tactics incoming. We were caught off guard with the RH bullshit but hopefully enough people can get set up with Fidelity next week to even the playing field. But above all else: fuckin hold and we're golden\n\nDON'T TRUST EXTENDED HOURS PRICES TODAY OR MONDAY MORNING.\n\n DON'T TRUST ANY MEDIA HITPIECES CLAIMING THE SQUEEZE IS OVER THIS WEEKEND. \n\nTHEY WILL TRY TO KILL THE HYPE WHEN TRADING IS DOWN AND CAUSE A MONDAY SELL-OFF. \n\nHOLD. THE. FUCKIN. LINE.\n\n*obligatory 'not a financial advisor' BS goes here, we just like the fuckin' stock*\n*",
        "subreddit": "wallstreetbets",
        "title": "BEWARE WEEKEND SCARE TACTICS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l84alu/beware_weekend_scare_tactics/",
        "created": 1611983371.0
    },
    {
        "author": "JordanLeDoux",
        "created_utc": 1612042632,
        "id": "l8wdmf",
        "num_comments": 812,
        "num_crossposts": 0,
        "selftext": "**NOTE: By \"next TSLA\" I mean a stock that grows far beyond what talking heads think is \"reasonable\". Not that they are company *like* TSLA or that they will see similar returns.**\n\n---\n\nBB has some elevated short interest for sure. That short interest may even be increasing. However the float on the stock is massive compared to GME. There are over 550 million available shares of BB, and the short interest is below 100%. While there may be some movement up based on shorts covering, GME is a once in a lifetime thing.\n\nNothing is the next GME. Not AMC, not NOK, not BB. The large players aren't ever going to be caught this way again in a place where retail investors can screw them, and GME isn't over. If what you want it to participate in that, then you should buy GME.\n\nBut I think BB is *fundamentally* more valuable than its current price.\n\n## Current Situation of the Company\n\nBlackBerry, which started as Research In Motion, was the \"original\" smartphone company, before Apple ate them alive. They didn't have the product pipelines or the money to compete against Apple, and the company was nearly killed by the iPhone and later the Samsung Galaxy brand.\n\nOver the last several years, BlackBerry has pivoted into a software security company. They mainly sell security products with a focus on machine learning and artificial intelligence.\n\nFrom Fidelity:\n\n&gt; BlackBerry Limited provides intelligent security software and services to enterprises and governments worldwide. The company leverages artificial intelligence and machine learning to deliver solutions in the areas of cybersecurity; safety and data privacy; and endpoint security management, encryption, and embedded systems.\n\nOver the last year, BB has re-positioned itself to take advantage of the nascent market of autonomous and intelligent vehicles. (Source: [AWS and BlackBerry QNX join forces to accelerate auto innovation with BlackBerry IVY, a new intelligent vehicle data platform](https://aws.amazon.com/blogs/industries/aws-and-blackberry-qnx-join-forces-to-accelerate-auto-innovation-with-blackberry-ivy-a-new-intelligent-vehicle-data-platform/))\n\n&gt; BlackBerry IVY is a scalable, cloud-connected software platform that allows automakers to provide a consistent and secure way to read vehicle sensor data, normalize it, and create actionable insights from that data both locally in the vehicle and in the cloud. Automakers can use this information to create responsive in-vehicle services that enhance driver and passenger experiences as well as provide valuable product insights back to the manufacturer.\n\nThey also have a partnership with Baidu for that company's Apollo autonomous driving open platform. (Source: (BlackBerry Expands Partnership with Baidu to Power Next Generation Autonomous Driving Technology)[https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberry-expands-partnership-with-baidu-to-power-next-generation-autonomous-driving-technology])\n\n&gt; BlackBerry Limited (NYSE: BB; TSX: BB) today announced an expansion of its strategic partnership with Baidu, whose high-definition maps will run on the QNX® Neutrino® Real-time Operating System (RTOS) and will be mass-produced in the forthcoming GAC New Energy Aion models from the EV arm of GAC Group (Guangzhou Automobile Group Co., Ltd.).\n&gt; \n&gt; ...\n&gt; \n&gt; The QNX Neutrino RTOS foundation for Baidu’s high-definition maps is a robust real-time microkernel operating system that provides deterministic performance as well as flexibility to address the limited resources of the embedded system.\n\nTheir QNX system is already used in over 100 million cars that are currently on the road, including a direct partnership with [Ford](https://www.industryweek.com/technology-and-iiot/article/22007012/blackberry-ford-extend-partnership-to-develop-car-software) that they've had since 2016.\n\nThey are in the final stages of completing an amazing turnaround as a company, and it looks like they have a good chance of doing it successfully. So what are the challenges?\n\n## Balance Sheet Issues\n\nBB has almost 2/3 of their current \"assets\" tied up in patents. This can be seen on their 2019 balance sheet as \"Intangible Assets – Total: $2.352 billion\". Their assets which are easier to liquidate are nearly exactly their current liabilities ($1.196 billion vs. $1.121 billion), as they added $638 million in debt in FY2019.\n\nJust a few weeks ago, BlackBerry sold 90 of its smartphone patents to Huawei. It also signed a licensing deal with OnwardMobility and Foxconn to allow it's name and software to be used in making a new 5G Android-powered smartphone that has a physical keyboard, filling a small but important niche in the smartphone industry that is mostly untapped at this point.\n\nThese moves signal the intent of BlackBerry to leverage parts of its balance sheet that have been mostly sitting idle since 2016 when they exited the smartphone market for good as a manufacturer.\n\nThe challenge is that their cash flow and income have been negative or paltry for quite a while. That was never going to turn around until they were able to monetize some of their existing IP and position the company for a solid market segment. At this point, they have successfully done both.\n\n## Earnings\n\nThis section definitely depends on your focus and perspective. For instance, BlackBerry's GAAP EPS has been negative more than positive since 2016. But on the other hand, their adjusted actual EPS has beaten consensus estimates for every single quarter going back to Q3 2015.\n\nIf you believe in Chen's ability to execute the turnaround, then this seems positive. If you think the company is destined for failure and a slow death, then this seems negative.\n\n## Conclusions\n\nOverall, I think BB is undervalued at its current price. They are very well positioned to take off as autonomous vehicles become more common, and most importantly, they have extremely valuable partnerships in many different markets, including some fantastic access to the Chinese market through their partnership with Baidu.\n\nAutonomous vehicles are a market that doesn't exist yet. Not truly. But many people believe that autonomous vehicles are going to turn into a HUGE segment of the market over the next decade. While car companies (particularly TSLA) provide direct exposure to that, they come with manufacturing risks and other things such as supply-chain risks. TSLA, Toyota, Ford... they could all face issues that simply come down to \"we ran out of good suppliers of Cadmium\" or something similar, while what you want is exposure to autonomous vehicles.\n\nBB has none of that. Their revenue and exposure to the market is entirely within the software, and because of their wide range of partnerships they shouldn't be dependent on any particular manufacturer. I expect to see them reporting positive earnings during FY2021 (though only slightly), and a much more obviously robust performance in FY2022.\n\nTheir patent portfolio alone in 2020 was worth about what their market cap was, that's how undervalued this company was due to concern about earnings. Once those earnings turn around, I think the valuation based on *only* fundamentals should but the stock at about $20 *right now*, and about $30-$35 by the end of this year.\n\nThere is also a non-trivial chance of a purchase by another company such as Alphabet that wants access to their partnerships, patent portfolio, and machine learning software.\n\n---\n\nOverall, BB benefits from its meme-stock status, and a bit of a short squeeze could happen for sure. But based just on my reading of their business itself, I think the stock has room to as much as triple within a year.\n\nCurrent position disclosure:\n\n100 BB @ 14.2687  \n+4 19 FEB 21 15c @ 4.125  \n+2 19 FEB 21 40c @ 1.93  \n+1 19 MAR 21 25c @ 4.64",
        "subreddit": "options",
        "title": "BB is probably not the next GME, it's probably the next TSLA",
        "url": "https://www.reddit.com/r/options/comments/l8wdmf/bb_is_probably_not_the_next_gme_its_probably_the/",
        "created": 1612071432.0
    },
    {
        "author": "Lunar909",
        "created_utc": 1611996893,
        "id": "l8hoqw",
        "num_comments": 799,
        "num_crossposts": 0,
        "selftext": "One of my good friends is an analyst at one of the bigger financial firms and during market hours yesterday, he pulled up the updated short interest on AMC. Here is the data: https://imgur.com/a/VRS7vLY\n--------------------------------------------------------------------------------\nNow, as of market close on Thursday, shorts on AMC have doubled down on their positions. Almost no shorts exited their positions during the criminal and illegal period where brokerages halted AMC/GME buying. This looks good for us, because a short squeeze has yet to happen.\n--------------------------------------------------------------------------------\nAs seen on the short shares data, around 165 million of AMC shares are being sold short. To calculate short interest, we mainly want to look at 2 things: shares outstanding and market float. For all you autists out there, the difference between these 2 numbers is that market float is the total number of publicly available shares in the market. ON THE OTHER HAND, shares outstanding includes restricted shares (like executive stock options) that cannot be exercised without special permission from the SEC.\n--------------------------------------------------------------------------------\nWhat's important to look at here is the market float, because that is what we are competing against the hedge funds with. The current market float of AMC is around 100 million shares. With some quick monkey math, we see that the short interest with respect to the market float is 165%.\n--------------------------------------------------------------------------------\nWhat does this mean for AMC? The squeeze has yet to happen. Buy shares and hold baby. Hedge Funds playing the short side will have nasty tactics up their sleeve, but they played their biggest trick on Thursday by restricting clearing firms and brokers. If we hold and buy shares, they are FUCKED.\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\nNOW, ONTO GAMESTOP: Based on the data from my friend, the news is not as great for GME as it is for AMC, but it is still VERY good. Here is the short interest data for GME: https://imgur.com/a/N77KcfS. As we can see, those criminal hedge fund bastards closed a fuck ton of their short positions when the brokers restricted GME buying. As of now, the shorted GME shares is hovering around 60 million shares.\n--------------------------------------------------------------------------------\nLet's do some more quick monkey math: Based on Yahoo finance, the market float of GME is around 47 million shares. This means the short interest with respect to market float is around 127% for GME. Although it is not as high as it used to be, the squeeze has yet to be squoze.\n--------------------------------------------------------------------------------\nSo what do we do with GME? The same as AMC. We buy and hold and buy and hold until the criminal bastards at the hedge funds are forced to close their positions. I asked my friend for the short data on our other beloved stocks, and I will say that AMC has the highest short interest currently with respect to market float. However, if we buy and hold everything, the price will eventually squeeze. I know that RH is being retarded right now, but do everything you can to purchase these shares if we want to squeeze AMC/GME. Open Webull, Fidelity, etc. Personally, I hopped over to Cashapp to buy a fuck ton of AMC shares on the dip. Anything works. It's us against them.\n--------------------------------------------------------------------------------\n--------------------------------------------------------------------------------\nIf this get's enough attention/if all of you guys are interested, I will ask my friend to pull up the updated short data over the weekend to update you guys on Friday's (yesterday) price action. \n--------------------------------------------------------------------------------\n\nTLDR: AMC/GME 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n--------------------------------------------------------------------------------\nMy positions: 50x AMC calls, 4x GME calls, 10k in AMC shares.\n--------------------------------------------------------------------------------\nGodspeed retards.\n--------------------------------------------------------------------------------",
        "subreddit": "wallstreetbets",
        "title": "Update on AMC/GME Short Interest from an HF Analyst (DD, will update with more info tomorrow)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8hoqw/update_on_amcgme_short_interest_from_an_hf/",
        "created": 1612025693.0
    },
    {
        "author": "0MNIBU5",
        "created_utc": 1612064427,
        "id": "l93m8p",
        "num_comments": 695,
        "num_crossposts": 0,
        "selftext": "   A lot of you are thinking of selling if this hits 1k. I’m not selling at 1k. 1k a share would EXTREMELY good for the hedgies, as they can afford to buy your shares at 1k and survive another day. Due to the low volume trades we’ve been witnessing and the stock maintaining above 300 (couldn’t even break 250 on friday with 3 hours of our asses getting slammed sideways by ladder attacks) I’m confident if this holds we can outlast them to MINIMUM $4,000-$20,000. \n\nConsidering that fidelity and vanguard can support the volume, i’m further confident that Monday is going to be a shit show for the hedgies.",
        "subreddit": "wallstreetbets",
        "title": "GME: Moving the goal posts.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l93m8p/gme_moving_the_goal_posts/",
        "created": 1612093227.0
    },
    {
        "author": "Daegoba",
        "created_utc": 1612027250,
        "id": "l8qh9s",
        "num_comments": 601,
        "num_crossposts": 1,
        "selftext": "Well, congratulations. You guys have positioned yourselves to be in the best position imaginable tocapitalize on a perfect scenario that will explode your customer base and membership moving forward. \n\nYou still have one mountain to climb, however.\n\nYOUR USER INTERFACE IS EMBARRASSINGLY TERRIBLE. I am well aware of the time, effort, energy, and capital you’ve spent building your app and website over the years, and that’s great. However, RobinHood has walked the fucking dog on you when it comes to simplicity, ease of use, and approachability. They’ve brought millions of new investors to the market, and have had world changing successes of which I’m sure you’re all well aware of (you know, like when they changed the game my forcing you to make trades free?).\n\nI’m a Gen X Millennial, and although I may be able to adapt to your convoluted-ass website and mobile app, a lot of the future investors will not have the patience or inclination to do the same. *You have to change it, and do it quickly.* It needs to be sleek, modern, and user-friendly. You don’t have to copy RobinHood (hell, why would you want to?), but you do have to come up with something that can keep the influx of new customers from jumping ship once their aboard, and **I’m not talking about making it hard for us to leave, you have to make it easy for us to stay.**\n\nThe last week’s debacle is as best an opportunity as you’ll ever have to catapult yourself into the front of your industry. It’s the World Series, bottom of the 9th, the bases are loaded, and you’re down by 3. RobinHood is pitching with a broken arm, and you are the batter with the .989 average.\n\nWill you hit the Home Run, or let the ball roll across home plate?",
        "subreddit": "wallstreetbets",
        "title": "A Little Advice To Vanguard And Fidelity",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8qh9s/a_little_advice_to_vanguard_and_fidelity/",
        "created": 1612056050.0
    },
    {
        "author": "NotAnADC",
        "created_utc": 1612022920,
        "id": "l8osi7",
        "num_comments": 570,
        "num_crossposts": 0,
        "selftext": "Firstly, get the fuck off Robinhood and make a fidelity account. It took 10 minutes and a couple hours to transfer money. \n\nStrap in you 💎 🖐 studs, we’re about to leave the solar system 🚀🚀🚀\n\nThis was always a good play. The logic and reasoning was there. A large number of shorts were in play and so long as people hold, there is money to be made. \n\nThis requires 2 things. \n* That the retail investor buys and holds\n* That the market doesn’t cheat\n\nThe first one is tough. If people start 🧻 🖐‘ing this bitch, it’s not going to work and Wall Street wins. You have to rely on a bunch of random strangers to make the same play as you, and that implies inherent risk. \n\nBut you mother fucking autists did it! You held through everything they’ve thrown at us! I’ve never been more proud to be a retard. \n\nSo one out of the two we’re set for, if Reddit held through that dip, they will hold through everything. If DFV can hold, I can hold. \n\nWhich leads to the second point. Wall Street cheating. The thought is(was) that as long as this is fair, we 100% make money as long as point one holds true. The bad news is that it isn’t fair and the market always cheats, so again risky. \n\nExcept we knew those corporate shills were going to cheat, did cheat and you fucking autists still held! You’ve proved your valor time and time again. \n\nWhich is the wrap up. Wall Street cheated and still is losing! We know for a fact point one holds true, and because of Wall Streets cheating it will be even harder now that every eye is on them. \n\nThis literally can’t go tits up positions all in $GME 🚀 🌙 \n\n\nBonus point*\n\n#(The argument for why no one gets left behind.)\n\nThe first thing to say is that even after a squeeze happens keep holding. \n\nThe reason for this is as follows. \n\nFirstly, Thursday the shorts position went from 140% to 250%. This means they think they can win and doubled down. So there is a lot more at play. \n\nBut here’s why the HF will always lose if we hold. Think about the stock, it’s doing really well, but is it going to hold long term? Eventually it has to fall, right?\n\nThat’s exactly what hedge funds are thinking. They think it’s overvalued and therefore will drop. So their play is to take out more shorts. \n\nExcept this time, the community knows this, so we just keep holding. Eventually the hedge funds can’t keep taking out shorts cause they know we will keep holding and the stock will stay stagnant with Wall Street never being able to win. Sure the price may fall gradually from 10k+, but wall street will never be able to make money cause as soon as they short, we hold. \n\n\nHope the logic is easy to follow, I’m not a financial advisor, just someone who got high last night \n\n $GME 10k EOW",
        "subreddit": "wallstreetbets",
        "title": "Market analysis of why $GME literally can’t go tits up, and why no one will get left behind because the price won’t fall",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8osi7/market_analysis_of_why_gme_literally_cant_go_tits/",
        "created": 1612051720.0
    },
    {
        "author": "its-Loki",
        "created_utc": 1610750713,
        "id": "ky5vsz",
        "num_comments": 567,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nToday has been an incredible day for us despite the 11% share price drop. I want to use this opportunity to thank everyone for holding their line. Many of us, including myself, have bought more shares today and will continue to do so until we see the actual squeeze happening.\n\n  \n\n### 📅 This has happened today:\n\n* GME board members who are resigning have sold their shares causing today's price drop (NEGATIVE but the market came together and held the line to minimize impact)\n* Fidelity and Schwab are confirmed to have eliminated margin on $GME (POSITIVE)\n* There is current talk about margin calls going out soon (POSITIVE)\n* Uptick rule (SEC 210) is in effect until at least EOD Tuesday (POSITIVE)  \n\n\n### 🔮 This will happen soon:\n\n* Short sellers will be margin called soon - there is no way around this now\n* **We will have another large squeeze**\n* GameStop will undergo a huge transformation and capitalize on the ever-growing esports / video game market\n\n&amp;#x200B;\n\n### 🐻 Melvin and other short sellers\n\nYou targeted the wrong firm! You were gambling on 45,000+ people (FT &amp; PT) to loose their jobs as GameStop would slowly go out of business. \n\nBut guess what: after Ryan Cohen bought further into GME this will never happen. The team at RC Ventures will make sure of that. And us, we will hold the line and buy further into it until we get rid of all large short positions. GME is not a dead company, it is just getting started.\n\n**GameStop is here to stay and will undergo an amazing transformation!**\n\n&amp;#x200B;\n\nNote: For everyone who is new to this, please be aware that options have no impact on share prices and that volatility (among many other things) plays a huge factor in your trades. Be careful with your trades and always do your own due diligence.\n\nPS:  🚀🚀🚀🚀\n\nPositions: 190 shares, 5 1/22 $38c (full reinvestment of my old calls)\n\nTL;DR: Today was a rough day but an amazing setup for the coming week. $GME will go to the moon.",
        "subreddit": "wallstreetbets",
        "title": "Gamestop Friday Notes - Short Sellers will loose 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ky5vsz/gamestop_friday_notes_short_sellers_will_loose/",
        "created": 1610779513.0
    },
    {
        "author": "its-Loki",
        "created_utc": 1610985604,
        "id": "kzxdlq",
        "num_comments": 553,
        "num_crossposts": 0,
        "selftext": "# It has been a wild ride so far - and it gets crazier by the day...\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0rczw3dcp3c61.jpg?width=260&amp;format=pjpg&amp;auto=webp&amp;s=75a07e89ddbff71469b8e33ea7c26393d3216a35\n\nHoly \\*\\*\\*\\* everyone! After my post on Friday explaining why that day's dip wasn't problematic a lot of things have happened. Once again, **thank to everyone for holding the line**!!! And also thanks to **everyone who keeps buying into the cause**. Stay put (aka don't press the f\\*cking sell button)... Keep in mind, that not only are we likely to make big dollars but we are also protecting 45,000 people who work at a company that was important in many people's childhoods - and soon will be relevant for future generations again. Without further ado, here are the updates regarding GameStop:\n\n&amp;#x200B;\n\n# 📅 A Summary of GameStop's moon mission\n\n***GENERAL INFORMATION***:\n\n* At this point we have many different investors that are in it for the long term (sorted by investment size): **Fidelity** (including their Intrinsic Opportunities Fund), Daddy Cohen's **RC Ventures**, **Blackrock**, **Susquehanna**, the OG u/DeepFuckingValue, and of course us *fellow retards* \\- among others\n* GameStop is still a Fortune 500 company which operates as the **WORLD'S LARGEST MULTICHANNEL VIDEO GAME RETAILER**\n* The firm has huge potential for expansion (including in ecommerce) as the **video game market is valued at $160 billion dollars** with an estimated **Compound Annual Growth Rate of 12.9%** (according to *Grand View Research).*\n\n***SHORT INFORMATION (Ortex Estimates; exact Updates not for another week)***:\n\n* *Estimated short interest*: \\~72 Million (decreased after spike but still up from 2020 EOY)\n* *Estimated short float*: still at \\~**101%+** (other estimates as high as 180%)\n* GameStop is still on the **SEC threshold list for 28th consecutive days**\n* Cost to borrow increased by an estimated 14.2%\n* Around 80% to 85% of shorts were likely shorted with a stock price under $20  ❗ ❗\n\n***NEWS***:\n\n* Jim Cramer acknowledged that the short busting seems to be working\n* Fidelity, IBKR and Schwab are confirmed to have eliminated/limit margin on $GME (heavily limiting short sellers)\n* Outgoing board members sold a total of nearly $20 Million dollars in stock on Friday sending the stock tumbling bc of the news. Having that said,  💎 **✋ s** saved the stock from a potential panic selloff\n* **Ryan Cohen Tweeted yesterday (1/17): Peanut Emoji &amp; GIF saying \"So you're telling me there's a chance\".** The actual meaning remains unclear but many interpreted this as his confirmation that there is a chance for an infinity squeeze 🥜🥜🥜\n* Multiple sources have confirmed that PC-Building Stations are coming in near future (mini microcenter-style)\n* Uptick rule (SEC 210) is in effect until at least EOD Tuesday\n* **$GS2C (Frankfurt) is up nearly 17% at the time** of writing this DD (on a NYSE holiday)\n* Webull and Etoro disabled shorting $GME\n\n***OTHER FACTORS***:\n\n* There are talks about **potential margin calls** (which would strongly affect shorts)\n* Additional stimulus potential will increase the WSB meme buy\n* u/TitusSupremus DD post ended up on Reddit's popular page (with 300+ awards and 11k+ upvotes) making it inevitable for Reddit users outside of this sub to miss out on this. (This play has literally reached the Front Page of the \"Front Page of the Internet\")\n\n**News about GameStop seem to be never-ending. This renders technical analysis nearly irrelevant as well. Despite some major publications releasing a bearish outlook on the firm, the bullish signs are overwhelming**\n\n&amp;#x200B;\n\n# 🔮 Outlook over the coming days:\n\n* Expect yet another highly **volatile day/week on the market**. Be careful with options at the moment; shares are likely the way to go and will also help the cause more...\n* There is no doubt that the **potential for another squeeze exists** (maybe even a legendary MOASS)!!!\n* Even if the squeeze does not happen (for whatever reasons) this stock is an **absolute value buy**, as many people before me have explained here. Another reason to go with shares rather than options!\n\n**As long as idiots don't 📄✋ there is a fairly low potential for downside and HIGH POTENTIAL FOR LARGE UPSIDE on the LONG POSITION**\n\n&amp;#x200B;\n\n# 🐻 Media Outlets, Melvin &amp; other short sellers\n\nI feel like I am a broken record, but GameStop is here to stay. I know WallStreetBets will never change your mind but if you were honest you would go back an analyze past short squeezes.\n\nLet's take the example of KBIO's 10,000% squeeze:\n\n* KBIO was entirely defunct and insolvent unlike **GME which actually has an amazing opportunity in a fast-growing space**. The childhood memories of most American's and brand recognition alone play a huge factor. Plus, their subsidiaries are solid as well!\n* **Fundamentals don't matter in these situations**... it's a result of a variety of different factors that cause a short squeeze, and now you have an unprecedented influence: bullish individuals who will never give up - aka us!\n* Most squeezes undergo a similar sequence of events:\n\n1. Shares are **massively over-shorted** (over 100% is banned by some governments for a reason)\n2. **Big news regarding the overhaul** of the firm (happened with RC ventures buying in and overhauling board control)\n3. Forced **borrow recall** and/or margin removal (this already started)\n4. An actual squeeze happens as **panic breaks out** among short sellers - it's just a matter of time before someone starts folding (BTW, doubling down is a horrible bet and has barely ever gone well after a squeeze)\n\n* News Outlets and analysts tend to focus on patterns or traditional methods of pricing stocks. There is no way to say that this will be a good stock to short and therefore short selling downside far outweighs the upside.\n\n&amp;#x200B;\n\n**EASY TO SHORT does not mean EASY TO COVER. Now it's time to realize that SHORTING THIS STOCK WAS A HORRIBLE IDEA and in fact STILL IS A HORRIBLE IDEA. For institutional and retail short sellers alike: you may see the same consequences as $KBIO short sellers did - many of which went bankrupt. LONG POSITIONS are the way to go.**\n\n&amp;#x200B;\n\nNote: For everyone who is new to this, please be aware that options have low impact on share prices and that volatility (among many other things) plays a huge factor in your trades. Be careful with your trades and always do your own due diligence. This is for educational purposes only.\n\nPS: 🚀🚀🚀🚀\n\nPPS: Now would be the perfect time for an announcement by GME for future plans. Even a small announcement relating to a technology-shift will slingshot-launch our moon mission. Maybe a potential for that happening as GameStop canceled appearance at ICR?? This is a big maybe, hence just a note as PPS...\n\n&amp;#x200B;\n\nPositions: 190 shares (for the long run), 5 1/22 $38c (very risky and make up full reinvestment of my calls that printed last week) - will buy more shares tomorrow morning\n\n# CAN'T STOP, WON'T STOP, GAMESTOP\n\n&amp;#x200B;\n\nTL;DR: Over the weekend we have seen more bullish signs than anticipated. Even if we don't see a squeeze, we for sure have a value stock on our hands. $GME goes to the moon no matter what...",
        "subreddit": "wallstreetbets",
        "title": "GameStop Monday Notes - The Rocket is fueling up 🚀🚀🚀🥜",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kzxdlq/gamestop_monday_notes_the_rocket_is_fueling_up/",
        "created": 1611014404.0
    },
    {
        "author": "The_Ron_Swansonson",
        "created_utc": 1610458942,
        "id": "kvrv7b",
        "num_comments": 531,
        "num_crossposts": 0,
        "selftext": "**TL;DR** on the bottom unless you're into masochism cuz I took Adderall for this and it's long as fuck.\n\nI called GRWG, I called RAVN, now its time for me to take Mommy Cathie’s hand and lead my fellow WSBautists to the moon once more. KTOS makes rockets, and there's one with our name on it. 🚀\n\n**Quick Wikipedia Introduction:**\n\n&gt;**Kratos Defense &amp; Security Solutions, Inc**, (NASDAQ: [KTOS](https://www.nasdaq.com/symbol/ktos)), headquartered in San Diego, California,specializes in directed-energy weapons, unmanned systems, satellite communications, cyber security/warfare, microwave electronics, missile defense, training and combat systems.   \n&gt;  \n&gt;Customers include the U.S. federal government, foreign governments, commercial enterprises and state and local government agencies. Kratos is organized into six major divisions:   \n&gt;  \n&gt;Defense and Rocket Support Services   \n&gt;  \n&gt;Microwaves Electronics  \n&gt;  \n&gt;Modular Systems  \n&gt;  \n&gt;Public Safety and Security  \n&gt;  \n&gt;Technology and Training  \n&gt;  \n&gt;Unmanned Systems.  \n&gt;  \n&gt;Some of Kratos' newest products are part of a Pentagon effort to partner with innovators and incubate technology-focused businesses in Silicon Valley  \n&gt;  \n&gt;Kratos has primarily an engineering and technically oriented work force of approximatively 2,700 with a substantial number of the Company's employees holding national security clearances. Virtually all of Kratos' work is performed on a military base, in a secure facility or at a critical infrastructure location. [Source](https://en.wikipedia.org/wiki/Kratos_Defense_%26_Security_Solutions)\n\n**Why You’re Really Here**\n\n**October 8th, 2020**, ARK Investment Management LLC filed a 13F-HR form disclosing ownership of **558,726 shares** worth $8,733,000.\n\n**November 30th, 2020**, ARK Investment Management LLC filed a 13F-HR form disclosing ownership of **1,106,685 shares** worth about $21,337,000 USD—representing a 98% increase in shares and a 144% increase in value in under two months. GUH 🚀🚀🚀\n\nARK recently doubled their stake in KTOS, and they're are not alone in their confidence. \n\nSmart money loves KTOS, as illustrated by their 89.86% institutional ownership: \n\n* Blackrock has a 6.83% stake in the company at 8.3 million shares\n* Vanguard has a 6.55% stake at 8 million shares\n* Fidelity has a 5.36% stake at 6.6 millions shares. [Source](https://money.cnn.com/quote/shareholders/shareholders.html?symb=KTOS&amp;subView=institutional)\n\nI'm no genius, and neither are you. But I have made myself good money riding the coattails of those with billions at stake and teams of researchers behind them.\n\nThat said, institutional ownership comes as no surprise as far as defense companies go. Instituions love to own them. They’re safe investments. The military's got deep pockets and smart money knows never to bet against America. \n\nHowever, Kratos is not just any old Defense and Aerospace company. There is a reason that ARKQ [added 153,098 shares to their fund just last week.](https://cathiesark.com/ark-combined-holdings-of-ktos)\n\n**Like GRWG, Kratos Defense and Security Solutions has spent the last ten years gobbling up their competition.** Six acquisitions and one merger later, the frequency of their contracts reflect their place as a leader in military tech development:\n\n* December 8th, 2020: [Kratos Receives $37.7 Million Skyborg Program Contract Award from USAF Advanced Aircraft Office](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-receives-377-million-skyborg-program-contract-award-usaf)\n* December 10th, 2020: [Naval Air Systems Command Exercises Option for an Additional $38.7 Million for Full Rate Production (Lot 2) of the BQM-177A Subsonic Aerial Target System](https://ir.kratosdefense.com/news-releases/news-release-details/naval-air-systems-command-exercises-option-additional-387)\n* December 21st, 2020: [Kratos Receives $17.8 Million Contract Modification Related to XQ-58A Valkyrie from USAF Research Laboratory](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-receives-178-million-contract-modification-related-xq-58a)\n* December 28th, 2020: [Naval Air Systems Command Exercises Option for an Additional $3.6 Million to Kratos for Contractor Logistics Support &amp; Engineering Services for the BQM-177A Subsonic Aerial Target System](https://ir.kratosdefense.com/news-releases/news-release-details/naval-air-systems-command-exercises-option-additional-36-million)\n* December 29, 2020: [Kratos Awarded Contract Modification Valued at $22 Million to Provide Satellite Command and Control System Sustainment](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-awarded-contract-modification-valued-22-million-provide)\n* December 30, 2020: [Kratos C5IS Business Receives $10.5 Million in National Security Related Program Orders](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-c5isr-business-receives-105-million-national-security)\n* Januray 4, 2020: [Kratos Receives $11 Million Development Contract for Next Generation Satellite Program](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-receives-11-million-development-contract-next-generation)\n\nKratos’ acquisitions have allowed it to develop proprietary technologies that are sold as products. Not only that, but as many of the above contracts show, they are also being paid 🚀 buku bucks 🚀 to maintain and service the products and tech that they sell.\n\nBut ok yeah, sure, they produce: disposable missiles made for aerial target practice, small sUAS swarming drones, satellites, radios, and augmented reality simulation training systems and microwave electronics—but that is not what grabbed my attention and surely not what grabbed the attention of Cathie Ark. \n\nReady for the kicker? Say it with me now:\n\n**Ground Vehicle Automation**\n\n&gt;The Kratos Multi-Platform Appliqué Kit (M-PAK) is the next generation of Ground Vehicle automation. The system can be used to quickly and easily convert your existing fleet of standard human-driven vehicles into optionally-manned systems that can be driven in manned or unmanned modes. M-PAK is a scalable system that can be used as a stand-alone vehicle mobility kit or sensors can be added to offer various levels of autonomy… M-PAK allows for a semi-permanent installation in a vehicle, which releases the user from committing to one vehicle platform or a particular vehicle.\n\nThese two developments are why Cathie bought up KTOS for ARKQ. These vehicle conversion kits also represent Kratos’ foray into the commercial space. Their ground vehicle automation kits, originally used to safely lead military convoys, are now used to man impact-absorbing trailers behind slow-moving highway construction vehicles. Up until recently, the job of driving the impact truck was filled by some poor employee. Now, with Kratos’ product, this job can be completely automated, with the GPS-guided computer safely trailing whatever work vehicle it is instructed to. [Source](https://www.kratosdefense.com/systems-and-platforms/unmanned-systems/ground/autonomous-truck-mounted-attenuator)\n\nBasically, you can turn any truck into a completely independently acting, simple, autonomous vehicle with the installation of this semipermanent kit.\n\n&amp;#x200B;\n\n**Sea Surface Vehicle Automation** \n\n&gt;Kratos \\[has also\\]developed a number of vehicle control systems that are easily installed and quickly convert most human-driven seaborne vessels to unmanned systems.  \n&gt;  \n&gt;The Kratos C2 is currently in use and supporting mission operations for the U.S. Navy and Army utilizing the High-Speed Maneuvering Surface Target (HSMST), which was developed in response to a requirement for a 40+ knot target to represent littoral threats encountered by the fleet and which would retain 35 kt capability in advanced sea states. [Source](https://www.kratosdefense.com/products/uav/land-and-sea/sea-surface-vehicle-automation)\n\nSo they’re making boat drones too. \n\nMilitarily, these unmanned sea surface vehicles can be used against seaborne targets and mine hunting. Commercially, the tech being developed by Kratos may have applications in cargo shipping, seaweed farming, and data collection.\n\n**Most Importantly**\n\nIn terms of the fundamentals, **tomorrow, January 13, there will be a virtual conference during which time they will be exhibiting some more of their new tech.** I believe that they will play into the recent EV/AI hype and focus on these automation kits and their potential foray into the commercial space. With some good media coverage, I think this could be a very positive catalyst for the stock. I tried calling investor relations to ask some questions, but they dubbed my calls. **Big dick energy. Bullish.** 🚀🚀🚀\n\n&gt;President &amp; CEO, Eric DeMarco, and its Executive VP &amp; CFO, Deanna Lund, will present at the 23rd Annual Needham Virtual Conference on January 13th at 11:30am Eastern. [Link to webcast.](https://wsw.com/webcast/needham103/register.aspx?conf=needham103&amp;page=ktos&amp;url=https://wsw.com/webcast/needham103/ktos/2276742)\n\n**NOW ON TO MY FAVORITE PART: THE TECHNICALS!!!!!**\n\nVery simple, very bullish. Consolidation on an upwards trend. \n\n&amp;#x200B;\n\n[MACD\\/RSI Bullish. Beautiful technical setup](https://preview.redd.it/uvhok3mnmwa61.png?width=2004&amp;format=png&amp;auto=webp&amp;s=339ee0941d924979ad9345a82d07760a7693843f)\n\nBreakout above the channel and a retest of resistance becoming support. Super solid buy wall at around $25.69. Anything around these levels I would count as buying the bottom. Set a stop loss slightly below the support to minimize downside risk. \n\nThis morning January 12th, premarket action suggests a moon mission. They were [just awarded another 12 million dollar contract a few hours ago](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-awarded-127-million-task-order-complete-cost-optimized). \n\n**TL;DR: : With its powerful acquisitions, sticky government contacts, consistent revenue growth, institutional backing, THICC technicals and TOMORROW'S imminent positive catalyst, KTOS cannot go tits up. Not to mention Blackrock, Vanguard, and most importantly—Mommy ARK are on our side.** \n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n**Positions:**\n\n🦅(Cashed out of RAVN when my calls went ITM as I said I would). 🦅\n\nSome miscellaneous shit, the odd LEAP or whatever\n\nPLTR: 400 Shares\n\nGME: 400 Shares\n\nKTOS: 100 shares,\n\nKTOS: 25x Feb/19/21 $30C\n\nKTOS: 3x May/21/21 $30C",
        "subreddit": "wallstreetbets",
        "title": "Cathie Ark-Backed Tech Innovator Kratos Defense [KTOS] Will Moon After Tomorrow’s Conference. [Free Crayon Bonus Included] [THICC Fundumendals] 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kvrv7b/cathie_arkbacked_tech_innovator_kratos_defense/",
        "created": 1610487742.0
    },
    {
        "author": "DJLowKey",
        "created_utc": 1611965818,
        "id": "l88uio",
        "num_comments": 505,
        "num_crossposts": 0,
        "selftext": "Robinhood has been on some real bullshit, that much is clear. There are enough posts here to show how shitty they are and how they are fucking us over, so I feel like I don't need to get into the why of what I'm proposing.  \n\nWe were the best advertising for Robinhood. Think about it... Seeing a fellow WSBer post awesome gains was almost always via a Robinhood screenshot. You see those gains, you want those gains, so you get Robinhood. You post your Robinhood screenshot. The cycle continues...\n\nI've been here long enough to remember people saying \"not RH, don't understand\" to posts from WeBull or Fidelity or whatever the fuck you non-US people use. \n\nWe need to end that now. After all this shakes out, **I propose banning screenshots from Robinhood.** Who's with me? \n\nTLDR - Fuck Robinhood.",
        "subreddit": "wallstreetbets",
        "title": "We were the best advertising for Robinhood. We need to end that now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l88uio/we_were_the_best_advertising_for_robinhood_we/",
        "created": 1611994618.0
    },
    {
        "author": "Dessiato",
        "created_utc": 1611969726,
        "id": "l8a7b2",
        "num_comments": 504,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "🚀🚀🚀 Why we ONLY can use Fidelity and Vanguard for future Buys: A breakdown 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8a7b2/why_we_only_can_use_fidelity_and_vanguard_for/",
        "created": 1611998526.0
    },
    {
        "author": "i_am_not_a_bird",
        "created_utc": 1611889572,
        "id": "l7hdpd",
        "num_comments": 497,
        "num_crossposts": 0,
        "selftext": "**A week ago we were just a couple of retards trying to make a quick bag.** Then the hedge funds started playing dirty – they exploited our order flows, they attacked us with short ladders, they blitzed the media against us so hard *even my mom* was saying fuck the degens on reddit. And today, they de-platformed the average investor and literally removed his ability to trade.\n\nBut now I feel that something has fundamentally changed. People are joining purely to take a stand against being screwed over for millennia.\n\nJust look at the recent posts. You've got people who've never even owned a single stock going balls deep into GME just to make a statement. Think about that. **You've got regular working class people willing and happy to lose their hard-earned money just to take a stand.** Last week I was worried the shorts would get off easy buying back shares from holders trying to lock in life-changing profits. Now, half of the apes aren't even here to make money anymore. **We're diamond hands 💎🤚in this bitch just because we're tired of getting dicked.**\n\nWebull, Fidelity, TDA and supposedly even Robinhood have already re-established trading for GME. Tomorrow there are millions worth of options expiring so far ITM the 7-elevens in NYC are running out of lube. And guess what. The long, 12 inch dick 🍆 of the people is a straight up **chode**.\n\n**tldr;** GME to Uranus 🚀🚀🚀🚀🚀🚀🪐",
        "subreddit": "wallstreetbets",
        "title": "Today the game has changed.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7hdpd/today_the_game_has_changed/",
        "created": 1611918372.0
    },
    {
        "author": "emilstyle91",
        "created_utc": 1611761640,
        "id": "l66xrs",
        "num_comments": 488,
        "num_crossposts": 0,
        "selftext": "Etoro is down.\nFidelity down.\nSchawb down.\nIB down.\n\nThey are trying everything they can to get those stocks down. They dont even let you buy or sell anymore.\n\nSomething must change. I say that wall street has to fail as a whole. Bunch of scumbags. They really deserve to lose every single penny.\n\nWe stand together. To the moon and valhalla fuck those bastards 🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "This is the WORST stock manipulation I've ever seen. They are jamming brokers and traders accounts all over the world. MASSIVE MANIPULATION",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l66xrs/this_is_the_worst_stock_manipulation_ive_ever/",
        "created": 1611790440.0
    },
    {
        "author": "Fair_Chart3403",
        "created_utc": 1610819754,
        "id": "kynnxf",
        "num_comments": 441,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI'm going to use this space to say what I would expect Tues/Wed regarding GME (obviously not an expert).\n\n# First some facts:\n\n1) There was an obscene amount of shorts of GME before it went up last week (138%+ of float). There is now still an EVEN MORE obscene amount of shorts of GME (120-170% of float as high-quality estimates).\n\n2) There has been over a month of likely \"naked short selling.\" Aka, ILLEGAL market manipulation (Sells of unconfirmed shares that then end up not going through) in an attempt to further drive down price (27 days on NYSE Threshold securities list, since Dec 8th).\n\n3) Fees to borrow GME have gone up significantly (sitting around 30% atm) and required margins have increased at brokers (75% for Fidelity, 100% for Schwab). This means those brokers are less confident in it going down, and that there are less available shares floating around (lower volumes).\n\n4) Friday, there was a huge early shorting of the stock (the rapid 10% drop) that led to Rule 201 being invoked (stock can only be shorted on an uptick until EOD Tuesday). How do I know it was likely shorting? Because the drop stopped as soon as the Rule was invoked.\n\n# From these facts, what are conclusions I have drawn?\n\n1) Investors (firms or otherwise) who have shorted GME are **repeatedly doubling down**. Big players are doing so to directly (and sometimes illegally, see naked short selling above) manipulate the market in a downward direction. **They have been working on this for months, making the stock undervalued by far,  which is why short volume has been so high, and are continuing to manipulate this stock downward in an attempt to make those earlier shorts less of a failure.**\n\n2) They believe the current price increase will not be sustained or, more like IMHO, that they can out-short any increase that is sustained, so they are paying increasing fees on those shorts every day until the price drops enough (and it needs to drop A LOT for their earlier shorts).\n\n# So what do I think will happen Tues/Wed?\n\n**1) On Tuesday, SEC Rule 201 is still in effect. That means that short sellers can only sell shorts on \"upticks\" (aka, they can only short at prices above the current market price). I expect that those short sellers will continue to double down, so we may see a price ceiling come into effect. Every time the price increases, the shorting can happen so they'll short it. I expect volume will be relatively low, and the price will not move very far.**\n\n**2) On Wednesday, SEC Rule 201 is not in effect yet. If price moves significantly upwards on Tues, I would almost definitely expect an early short on Wednesday in an attempt to drive small profit selling and further drop the price. If price moves significantly downward on Tues, I would expect the same early shorting in an attempt to induce panic selling. Finally, if price doesn't move much on Tuesday, its much more of a toss-up on their strategy, but I would (personally) anticipate another attempt to short sell the price down as we saw Friday (deep pockets of shorters, already in very deep on shorts).**\n\n**TL;DR: I think shorters gonna keep shorting (legally and illegally) so everyone should be prepared for that. They think the risks of losing older shorts outweighs the risks of additional shorting/the fees of new/old shorts. They've done this level of consistent, repetitive shorting/market manipulation before and have only paid for it a handful of times.**\n\nJust sharing my opinion of what happens next. I'm not here to convince anyone to do anything.\n\nGME 266 at 36.54",
        "subreddit": "wallstreetbets",
        "title": "On GME and what to expect Tues/Wed (DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kynnxf/on_gme_and_what_to_expect_tueswed_dd/",
        "created": 1610848554.0
    },
    {
        "author": "BenjaminGunn",
        "created_utc": 1612014494,
        "id": "l8m1oj",
        "num_comments": 438,
        "num_crossposts": 0,
        "selftext": "Good morning retards. \n\nI've broken out my robe, my pipe, and my helmet so that we can sit down and contemplate the most singular and engaging question of our time:\n\n&gt; If you were a short what would you do if you were SUPER fucked but you knew in two days you were going to be SUPER DUPER fucked? \n\nThat's the question that we're faced with this fine Saturday morning. But let's do a quick review of the facts to understand where the shorts are possibly at before trying to answer that one.\n\n**Current short situation**\n\n* According to the DD floating around here we're still at 100% short interest - at least.\n* Melvin and Shitron say they're out of their positions. But are they? \n* Doesn't matter. New shorts are still short and will be forced to cover. \n* We saw liquidity dry up Friday with a bid ask gap of like thousands at one point\n* Shorts launched multiple short ladder attacks\n* Reports of whales coming in an buying up the shorts shares during the attacks, short can't keep that up\n* If shorts can't short attack because of the whales hovering up their shares, what can they do? They have to buy eventually.\n* Oh and then there's the big gamma squeeze coming from Friday. \n* All call contracts expired ITM Friday. Any naked calls must be covered. More importantly - MMs will be forced to gamma hedge existing contracts for further out expiration. They do this by buying shares.\n* Retail is now buying out of spite. Which is the best kind of investing I think.\n* I chew crayons. I put that together from what's here. If I did you know the shorts brokers did as well. Margin requirement increase anyone?\n\nMuch of this is a summation of DD by /u/jkn_ku so read their post if you want a REALLY good blow-by-blow of Friday with some really keen insights on order flow sniping and things I had no fucking clue about: [post](https://old.reddit.com/r/investing/comments/l7qlfh/gamestop_big_picture_the_short_singularity_pt_3/).  I know, I know, /r/investing but goddamn if that isn't some killer DD and it reads like a fucking action thriller. Respect.\n\ntl;dr shorts current situation\n\n&gt; They are SUPER DUPER fucked early next week because of the incoming gamma squeeze, likely increasing margin requirements, whales getting involved and of course continued retail interest.\n\n**But what's the shorts next move?**\n\nThe shorts have had a lot of tactics to scare off retail - ladder attacks, PR blitzs, lots of bots, etc. But they have ONLY ever had one move - the move they HAVE to make eventually. And that's of course to buy back the shares they owe their brokers. They're under contact to do so - it's the law.\n\nBut that's what will cause the MOASS and force them to buy from retail, right? That's what we want?\n\nYes! But there are other longs out there other than retail - institutional longs. These are usually big companies or funds who purchase gme for long term strategies. We haven't talked that much about them.\n\nHere's a list and the amount of shares they own from an Investors.com [article](https://www.investors.com/etfs-and-funds/sectors/gme-stock-gamestop-investors-instantly-make-16-billion-gamestop-stock-squeeze/).\n\nHolder |Common Shares Held (Millions) |% Of CSO |Gain ($ Billions) |Position Date Update\n---|---|----|----|----|----\nFMR (Fidelity Investments) |9.5 |13.7% |$3.0 |Sep-30-2020\nRyan Cohen |9.0 |12.9 |2.9 |Jan-10-2021\nBlackRock |8.6 |12.3 |2.7 |Sep-30-2020\nVanguard Group |5.3 |7.6 |1.7 |Sep-30-2020\nSusquehanna International Group |4.4 |6.3 |1.4 |Sep-30-2020\nDimensional Fund Advisors |3.9 |5.7 |1.3 |Sep-30-2020\nSenvest Management |3.6 |5.2 |1.2 |Oct-07-2020\nDonald A. Foss |3.5 |5.0 |1.1 |Feb-28-2020\nMUST Asset Management |3.3 |4.7 |1.1 |Mar-18-2020\n\nI want to be clear. Longs only represent 51.m shares. And many of these are funds that probably cannot sell due to their fund balancing requirements and what not (I don't know - just guessing there). \n\nShorts are shorts AT LEAST 100% according to all of the DD we've read. They still have to buy ALL of retails shares. There is no way that I can see for them to avoid doing so. But they WILL try to lessen the pain. \n\nAnd these institutional longs are seeing BILLIONS in gains (with a B) so who knows what could happen.\n\nSo I am speculating that the shorts will approach institutional longs over the weekend for some sort of deal. So keep your eyes and ears open and helmets strapped on tight!\n\nThis is not investment advice. Don't take investment advice from the internet.\n\nPositions: 1000 shares bought @ 16\n\nAPES TOGETHER STRONG.",
        "subreddit": "wallstreetbets",
        "title": "GME Shorts Will Try to Buy From Longs Over Weekend - Discuss",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8m1oj/gme_shorts_will_try_to_buy_from_longs_over/",
        "created": 1612043294.0
    },
    {
        "author": "42isthenumber_",
        "created_utc": 1612109964,
        "id": "l9fixg",
        "num_comments": 423,
        "num_crossposts": 0,
        "selftext": "I am a bit confused with the recent rhetoric of sticking it to the big guys wrt to GameStop. Since so many shares are owned by other financial institutions (BlackRock, Fidelity, Vanguard) what is preventing them from just selling and leaving individual investors with the bill ? Sure /r/wallstreetbets will hold but what about all those others who own a large majority of the shares ?\n\nJust curiosity here. Not trying to pick sides.\n\nHope your weekend is going well !\n\nEdit: Thank you all for taking the time to reply! Learning a lot from this thread.",
        "subreddit": "stocks",
        "title": "Are GME shares not 70% owned by financial insitutions ?",
        "url": "https://www.reddit.com/r/stocks/comments/l9fixg/are_gme_shares_not_70_owned_by_financial/",
        "created": 1612138764.0
    },
    {
        "author": "hypeb1337",
        "created_utc": 1611983691,
        "id": "l8ek8e",
        "num_comments": 405,
        "num_crossposts": 0,
        "selftext": "They have already attempted to stop the squeeze from happening by limiting buying on the shorted stocks. They have previously completely taken away buying power on these stocks from you guys, this caused serious backlash by users of the app forcing them to re-allow trading of these stocks, but not without a catch. There are purchase stock and option limits, which fluctuates throughout the trading hours to clearly manipulate the market, as seen with $BB and $GME today.\n\nThere also been plenty of people posting liquidation of their stocks without their approval, probably due to borrowing money on margin, but typically you should still have 5\\~ days to fulfill the margin equity percentage requirement.\n\nAnyways, that's besides the point:  \nWhat makes you think these retards won't fucking limit selling due to \"technical issues\" or have ANOTHER \"outage\" AGAIN. They'll let the hedgefucks liquidate, then allow us to sell after all the hedgefucks are out. C'mon tards you've seen this shit before during the SPY put days.\n\nI'd move to Vanguard, Fidelity, or TD Ameritrade. Vanguard and Fidelity have $GME shares so surely they'll allow trading on $GME indefinitely.\n\nPositions:\n\n440 shares $BB\n\n6 shares $GME\n\n**TLDR: ROBINHOOD HAVE OUTAGE/STOP SELLING DUE TO \"TECHNICAL ERRORS\" DURING SQUEEZE. GET YOUR MONEY OUT BEFORE MONDAY OR U R FUCK**",
        "subreddit": "wallstreetbets",
        "title": "Robinhood will fuck you when the short squeeze actually happens...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8ek8e/robinhood_will_fuck_you_when_the_short_squeeze/",
        "created": 1612012491.0
    },
    {
        "author": "Zestytaco89",
        "created_utc": 1612104016,
        "id": "l9dj5u",
        "num_comments": 403,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I’m a broke idiot, and can’t afford much. But I want to do something of my part, I opened a fidelity and will be putting small tendie money in there too! F Robinhood. If I can get cash for GME stonk I will! Either way 💎🙌🏼🚀🌚",
        "url": "https://i.redd.it/bkjxjhmejoe61.jpg",
        "created": 1612132816.0
    },
    {
        "author": "FatAspirations",
        "created_utc": 1610521104,
        "id": "kwb827",
        "num_comments": 400,
        "num_crossposts": 0,
        "selftext": " \n\nHello again folks. I’ve taken some time to do my own DD on GME and sharing it with you, in addition to all the other great DD out there. I’m going to cover shorts, debt, and what I think might accelerate GME’s mission to Mars. \n\n**TL:DR;** GME is a ticking time bomb. Shorts R Fuk. Buy shares, Sell puts to acquire shares cheaper. Buy leaps on red days. No idea what's gonna happen in the very short term but 2021 will be massive. \n\n# About the Shorts\n\nSo, updated short interest came out today. If you haven’t seen it, shorts **increased** their positions through the end of the year:\n\n&amp;#x200B;\n\n[12\\/31 short position update](https://preview.redd.it/k66xyn1oq1b61.png?width=781&amp;format=png&amp;auto=webp&amp;s=a61c48086c09a509fe4a7152db90ba4a3c082323)\n\nWhat. The. Fuck. \n\nI really can’t figure out the macro logic here because from the outside it looks like they’re digging their own graves. \n\nOn the day-to-day scale, I think I understand how this is happening. If you look at the days with a high short volume ratio, the narrative is clear: Shorts are actively trying to defend GME crossing 20 significantly, and coming in hard when threatened. Shorts also took advantage of general market selloff on Jan 4 to push GME down. \n\n&amp;#x200B;\n\n[Days with heavy shorting activity](https://preview.redd.it/dir3ss9sq1b61.png?width=1175&amp;format=png&amp;auto=webp&amp;s=7d0859c5aff4dce709a27b945786507ba9c4de18)\n\nThis is also why GME ended up ***only*** \\~12% after the recent RC announcement. Short volume was a whopping **4MM** shares on that day. \n\nThe problem is shorts are doing all this active shorting to defend their existing short positions, but they’re either not able or not choosing to close all of the intraday shorting, so it’s accumulating. As of 12/31 the **total short positions (71.2M) exceed total issued shares (69.75M).**\n\n# The precarious position of the shorter \n\nShorts find themselves in a very precarious position. Let’s talk about the float and DTC (days-to-close). **The DTC number you see above is a lie.** There’s an argument to be made that **DTC is infinity.**\n\nThere are a total of 69.75M shares issued by GME. According to [this guy](https://www.reddit.com/r/wallstreetbets/comments/kw0djb/gme_floatshort_data/) who has a CapIQ subscription, insiders hold 22.8M shares. I was able to verify using this [nasdaq source](https://www.nasdaq.com/market-activity/stocks/gme/insider-activity) that the top insiders hold about 20% of shares:\n\n&amp;#x200B;\n\n[Top Insider Holdings](https://preview.redd.it/id7ppwjvq1b61.png?width=781&amp;format=png&amp;auto=webp&amp;s=abc9f4103776787f435ebbe719f5420c776d7ad1)\n\nThe thing with insiders is that they can’t easily sell due to lots of restrictions so they’re not considered part of the “actively” traded part of the stock. I.e. They can’t just sell on price action. \n\nIn addition to insiders, [**institutions now own 110% of GME shares**](https://www.nasdaq.com/market-activity/stocks/gme/institutional-holdings)**.** (Thanks shorters!). Some of these institutions may actively trade, but the top holdings (FMR, BlackRock, Vanguard, etc.) *will not trade based on price action* as they are generally holding for their ETFs / index funds that hold GME. \n\n&amp;#x200B;\n\n[Institutional Holdings](https://preview.redd.it/de46p98yq1b61.png?width=790&amp;format=png&amp;auto=webp&amp;s=6b3b9332efb259e72eae6209a3ce1743ed0b462f)\n\nNow, thought experiment. What happens ***if*** shorts decide to cover? They have to buy back 71M shares. Who are they going to buy it back from?\n\n1. They can’t buy them back from insiders.\n2. Let’s be conservative here, and say that Fidelity, BlackRock, Vanguard will hold on to their shares, but all of the other institutions will paper hand when shorts start to cover. This is very conservative because there are other institutions that hold GME for their own ETFs. \n\nSo, 69.75M shares - 22.8M for insiders - 23.43M held by BlackRock/Vanguard/Fidelity = **23.52M shares left.** So fuck all other short-to-float ratios out there, the **short % of tradable float is at least 300%.**\n\n[Investopedia ](https://www.investopedia.com/terms/d/daystocover.asp#:~:text=Key%20Takeaways-,Days%20to%20cover%2C%20also%20called%20short%20ratio%2C%20measures%20the%20expected,for%20the%20company%20in%20question.)tells us that days to cover is *“calculated by taking the* ***number of currently shorted shares*** *and* ***dividing that amount by the average daily trading volume*** *for the company in question.”*\n\nGME’s [20-day average daily volume](https://www.barchart.com/stocks/quotes/GME/technical-analysis) is about 10.4M shares, so that’s about 6.83 days to cover. This, however, is **a lie.** *The DTC definition listed by Investopedia stops making sense when short interest exceeds purchasable float.* \n\nMath whiz’s out there… if you have to buy 71M shares from a pool of 23.5M shares, and GME’s daily volume is 11M shares a day, how many days will it take to cover? \n\nAnswer: **Infinity. You can’t. You can never cover.** There literally are not enough shares to buy to close your shorts. You can only buy-to-close 23.5M shares, and that’s even if you can convince all of them to sell (i.e. $$$$$). **True DTC is Infinity.** This is part of the reason shorts haven’t covered. *There’s no way out of the burning building they’re in.* \n\n# How it gets worse part 1) Institutional Buying\n\nHere’s how it gets worse. Besides all the retards like you and me buying GME b/c of Lord Cohen and Lord Burry, GME is about to cross some serious thresholds that make it attractive to more institutional buying. \n\nFirst, in the recent [Q4 numbers](https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-2020-holiday-sales-results) release: \n\n* “The Company is continuing to suspend guidance, however, unless further unforeseen COVID-19 related impacts occur, it expects to realize positive comparable store sales results and **profitability** in the fiscal fourth quarter.    \n\nSo, GME is about to cross into the positive EPS category, which in addition to the debt story below is going to potentially **unlock** **more institutional buying** that is currently blocked by rules like not investing in companies with negative P/E. \n\nSecond, let’s talk about debt. \n\n## Debt\n\nBusinesses leverage debt to scale; particularly true with retail businesses that have to pay for inventory in advance of selling it. High cost of debt -&gt; lower profits -&gt; lower ability to pay debt -&gt; higher debt costs, and the cycle continues. On the flipside, if GME was able to increase its credit rating, you get lower debt costs, higher profitability, which leads to higher credit rating, etc. \n\nI believe we’re seeing a campaign from GME to pay down debt to reduce a) restrictive covenants in the 2021 notes (preventing things like more share buybacks) and b) upgrade their bonds to investment grade.\n\nNot only will a credit upgrade lead to cheaper debt, it will **unlock more institutional investment that are currently restricted against buying equities with below-investment-grade debt ratings.** \n\n### Debt \n\n* Debt was $472MM up until July 2020\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l87lqgtwr1b61.png?width=1069&amp;format=png&amp;auto=webp&amp;s=7c897cd39f4b8874839fcdf602802cf015d78b22\n\n* GME announced a voluntary pre-payment of $125MM of debt ([link](https://www.globenewswire.com/news-release/2020/11/10/2124246/0/en/GameStop-Announces-Voluntary-Early-Redemption-of-Senior-Notes.html)) that will happen 3 days after the earnings call (earnings Dec 8, debt repayment Dec 11)... “**using cash generated from operations to reduce our outstanding debt”**\n\n### Debt rating: \n\n* First, take a look at GME’s bond pricing. GME’s bonds were significantly impacted by the March crash. However, GME’s bond pricing has recovered and is now **trading at par**, meaning the market believes that GME will pay back its debt (i.e. not a bankruptcy risk). \n\n&amp;#x200B;\n\n[GME Bonds trading at par](https://preview.redd.it/cu6rpvpur1b61.png?width=1063&amp;format=png&amp;auto=webp&amp;s=8cd2fd2376d717c198e65aa7d9f22ed4ec77b853)\n\n* Now, look at its Moody’s rating history. First, for context, anything under a Baa3 rating is considered junk (ratings chart here) and greatly affects who can buy your bonds and what types of rates you get. \n\n&amp;#x200B;\n\n[Moody's debt ratings. GME currently sits at Ba3](https://preview.redd.it/56e3ba82s1b61.png?width=867&amp;format=png&amp;auto=webp&amp;s=c1f56f076c11f01204a1086b43670a5a48ab7f30)\n\nHere are Moody’s actions on GME ([source](https://www.moodys.com/credit-ratings/GameStop-Corp-credit-rating-808528072)). In particular: \n\n* Downgrade on 5/2019 to Ba2\n* Downgrade on 1/2020 to B2\n* Downgrade on 4/2020 to Caa1\n* Upgrade on 7/2020 to B3\n\n&amp;#x200B;\n\n[GME upgraded to B3 in Jul 2020](https://preview.redd.it/menraih6s1b61.png?width=786&amp;format=png&amp;auto=webp&amp;s=da868433f2546ffe1c5ce3294e48559d9f03e256)\n\n### Speculation on debt: \n\n* GME is working with Moody’s &amp; others to get credit rating back to Investment grade. Showing **positive earnings/profitability** and **paying back debt early** is key to this. I believe we should see an upgrade soon to at least Baa3 (the lowest level of investment-grade debt).\n* The market is not generally considering GME’s debt as risky as Moody’s credit rating would suggest. The market can move faster than Moody’s. \n\nPositive EPS + Debt ratings upgrade = massive institutional buying = shorts further in the hole.  \n\n# How it gets worse part 2) Passive Buying Feedback Loop\n\nGME is part of [62 ETFs holding about 10.7M shares](https://www.etf.com/stock/GME) in addition to a whole bunch in index funds (not ETFs). I couldn’t get a number for index funds but am going to estimate around 10M for them as well given the Vanguard/Fidelity numbers above. \n\nMore than 50% of these holdings are passive, **market-cap weighted funds**. Now here’s the feedback loop that really fucks the short story up. \n\n1. Institutions buy GME -&gt; \n2. Price goes up -&gt; \n3. Market Cap Goes up -&gt; \n4. Weight in Funds Goes up -&gt; \n5. ETFs buy more GME for every $ of inflow -&gt; \n6. Price goes up -&gt; return to step 3 \n\nAt $20, GME is already up &gt;5x from its low of \\~$4 in 2020. This means that for every $1 thrown into IWM, for example, Blackrock is putting 5x as much of that $1 into GME as it was back at GME’s lows. As GME’s price goes up, **any market-cap weighted fund puts more money into GME for every $1 of inflow.**\n\nThe passive feedback loop has already started. It will really kick into high gear with institutional buying. \n\n# Other speculations:\n\n1. I believe RC is already slated to be CEO, and this will be announced in the June 2021 annual shareholder meeting. \n   1. This is why the ICR presentation was pulled. RC didn’t want the content in the ICR presentation to be the market-adopted story on the GME strategy. \n   2. 3 board members are retiring. I believe this is part of a pre-negotiated deal where RC is taking over. The 3 that are stepping down didn’t agree with the mgmt change.\n2. GME is due for a re-rate of price/sales. GME is currently trading at a P/S of 1 - if you ONLY include the ecommerce revenue. From a total revenue perspective it’s closer to .2. **GME is currently worth less than its quarterly revenue.** From the [Q4 sales pre-release](https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-2020-holiday-sales-results):\n   1. “Net quarterly sales were $1.770 billion”\n   2. “E-Commerce sales, which are included in comparable store sales, rose 309% and represented approximately 34% of total company sales, with total worldwide E-Commerce sales year to date reaching over $1.35 billion, far exceeding the Company’s $1.0 billion growth objective;”\n\nAt this point, it’s really the endgame for shorts. They have to find a way to exit before Cohen is CEO. \n\n# Positions:\n\n1. 10K shares at 13.7 cost basis\n2. a buttload of sold 1/15 puts (trying to add more shares at the lowest price I can get them)\n3. 20 20/30 call spreads for april\n4. \\~30 itm calls (9c/10c) for jan 15 I plan to roll forward \n\n&amp;#x200B;\n\n[Positions in IBKR](https://preview.redd.it/s3og2vxas1b61.png?width=1047&amp;format=png&amp;auto=webp&amp;s=9608d6218c48aac7d488626c6ef52e1a5ca2d1ce)\n\n&amp;#x200B;\n\n[Positions in RH](https://preview.redd.it/5oe8oi7ds1b61.png?width=1047&amp;format=png&amp;auto=webp&amp;s=2be531cfc5b934b48a53a0b9f2c94725eccc8b1f)",
        "subreddit": "wallstreetbets",
        "title": "GME - EndGame: DTC Infinity.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kwb827/gme_endgame_dtc_infinity/",
        "created": 1610549904.0
    },
    {
        "author": "ahminus",
        "created_utc": 1611954654,
        "id": "l84bw8",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "[Look at this total bullshit.](https://robinhood.com/us/en/support/articles/changes-due-to-recent-market-volatility/)\n\n\nI've commented before about what trash this company is, and what trash their fucking app. is.\n\nThis is the equivalent of telling you that now you're only allowed to sell, not buy, because Citadel got on the wrong side of these trades when you made them.\n\nRobinhood does not send your trades to the exchange.  They send them directly to Citadel or one of three or four other market makers.  You're betting directly against Robinhood when you use it.  They clear their own trades.\n\nIt's a total sham, and they are exactly the antithesis of what they bill themselves as.  They are designed for these big money players to make money, and for you to lose.\n\nGet a fucking Fidelity account.  They send your trade to the exchange, and pay for that.  They don't get paid for order flow.  They're not on the other side of your trade, so they have *no incentive* to tell you that you can't buy something.",
        "subreddit": "wallstreetbets",
        "title": "Robinhood is total fucking garbage. Stop using it.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l84bw8/robinhood_is_total_fucking_garbage_stop_using_it/",
        "created": 1611983454.0
    },
    {
        "author": "CaregiverWest739",
        "created_utc": 1610639434,
        "id": "kx8859",
        "num_comments": 387,
        "num_crossposts": 0,
        "selftext": "I never post but i've been lurking in this group for 2 months and just soaking up all the knowledge everyone gives out. These SPAC's have changed my life. I can't focus at work b/c i'm constantly searching for the next play and watching my accounts grow daily. I turned 200k (Rollover IRA) that was mainly invested in Fidelity funds into 475k in less than 2 months with this new way to invest.   \nI turned a individual account from 30k to 135k in less than 2 months due to the information sharing of the people in this group. \n\nI'm just feeling all soft n pink and wanted to let the folks know that you are much appreciated. I'm sure there are others in here that don't post but share my sentiment.",
        "subreddit": "SPACs",
        "title": "Thank You All!!!!",
        "url": "https://www.reddit.com/r/SPACs/comments/kx8859/thank_you_all/",
        "created": 1610668234.0
    },
    {
        "author": "CryOfTheBlackBirds",
        "created_utc": 1612007475,
        "id": "l8k4es",
        "num_comments": 364,
        "num_crossposts": 0,
        "selftext": "I’ve seen a lot of posts discussing how Fidelity and Vanguard are able to fulfil orders without a middleman so weren’t in the same boat as Robinhood and refused to restrict trading.\n\nAfter Trading212 pulled the same shit Thursday, I was wondering if there are equivalent UK apps?\n\nAs I understand it:\n\n* Freetrade - Uses a third party and restricted some US stocks\n\n* Revolut - Uses a third party\n\n* HL - Terrible app, long order fulfilment time\n\n* Saxo?\n\n\nI probably can’t switch now because I prefer to trade in an ISA wrapper but looking for an alternative post April.\n\nObligatory: This is not financial advice and I’m not looking for advice either, just information.\n\n$GME 🚀 🌝 💎 🙌🏻",
        "subreddit": "wallstreetbets",
        "title": "UK Alternatives to Trading212 without a middleman",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8k4es/uk_alternatives_to_trading212_without_a_middleman/",
        "created": 1612036275.0
    },
    {
        "author": "Baileythenerd",
        "created_utc": 1611854232,
        "id": "l72tfu",
        "num_comments": 362,
        "num_crossposts": 0,
        "selftext": "I will edit this post as needed, I'm aggregating info from another post, and I'll be trying to do some research to support any of the suggestions that have been made: \n\nStock trading alternatives to RobinHood: \n\n**~~TD Ameritrade~~**\n\n**Cash App**\n\n**Vanguard**\n\n**Fidelity**\n\n**M1 Finance**\n\n**Etrade**\n\nTrading apps to avoid- \n\n**RobinHood** &gt;!More like Robbin' the poor!&lt; \n\n**Webull** (also blocked GME etc.) \n\n**TD Ameritrade** (also blocked GME etc.) \n\nIf anyone has any input/info about pros/cons between any of the trading app thingies mentioned above, or if anybody can make a better post than this one- **DO IT**. \n\nI don't care about the damn upvotes, I want to make stocks accessible to everyone and I want everyone to have the best tools possible to ~~stick it to these hedgefunds~~ *get stocks they just really like for no reason*",
        "subreddit": "wallstreetbets",
        "title": "Robinhood alternatives- upvote for visibility",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l72tfu/robinhood_alternatives_upvote_for_visibility/",
        "created": 1611883032.0
    },
    {
        "author": "DavyJones21",
        "created_utc": 1612085819,
        "id": "l9941m",
        "num_comments": 348,
        "num_crossposts": 1,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "💎🙌 Buying more GME Monday on Fidelity. Here's my current position 💎🙌🚀🚀🚀🚀🚀🚀🚀",
        "url": "https://i.redd.it/3y1gk08p0ne61.png",
        "created": 1612114619.0
    },
    {
        "author": "EinsteinRidesShotgun",
        "created_utc": 1612035081,
        "id": "l8tjna",
        "num_comments": 341,
        "num_crossposts": 0,
        "selftext": "I tried to transfer $600 out of my Robinhood earlier (moving to Fidelity after all this is over, for obvious fucking reasons) and I got an error message. Tried it with three different bank accounts. No dice. It either gave me a \"server error\" message, or it told me that a bank had to be verified.\n\nAt this point I'm getting bad vibes, try to post my screenshot (still pending with the mods), and leave it for a minute. Come back later on my PC and try again. No dice. Then, I think, well, let's try it with $100 instead of $600.\n\nAnd it lets me withdraw.\n\nOK, we'll try a bigger number.\n\nNope.\n\nNow I'm sus, so I fire up OBS studio and screen record all of this shit as I go through and attempt to get it to let me withdraw any amount larger than $100. Nothing larger than $100 can withdraw, but $100 (and presumably lower) can. I kept going right up until I run out of daily withdrawals. \n\nIt looks to me very much like **Robinhood is limiting withdrawals to $100 or less and pretending it's a server error.** \n\nThis can't possibly be legal, and I don't know how it could be a server error. I'm not as strong on comp sci as I used to be, but 100 is a fucking int and 600 is a fucking int and they're both three digits and should require the exact same amount of computational power to transact/calculate/whatever.\n\nAgain, I have screenshots from my phone, and I took a screen recording as I went through and did this on my PC. Can anyone advise whether it is 1) possible that it is indeed a server error, or 2) if not, how it could possibly be legal? Cause like I said it still fucking looks to me like they're just not allowing us to get our money out.",
        "subreddit": "wallstreetbets",
        "title": "Robinhood not allowing us to withdraw money?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8tjna/robinhood_not_allowing_us_to_withdraw_money/",
        "created": 1612063881.0
    },
    {
        "author": "StarSwitch",
        "created_utc": 1610422206,
        "id": "kvjbuk",
        "num_comments": 333,
        "num_crossposts": 0,
        "selftext": "In November a fellow autist, u/ronoron, wrote an excellent DD detailing Melvin Capital Put positions on GameStop which you can read [here](https://www.reddit.com/r/wallstreetbets/comments/k3gn91/people_pumping_gme_melvin_capital_management/). He found that Melvin Capital held a short position of GameStop of 54,000 15 Put Contracts exp Jul 16 2021 equaling their disclosed short exposure of 5,400,000 shares on the [Q3 13F](https://www.sec.gov/Archives/edgar/data/1628110000090571820001111/0000905718-20-001111-index.htm) form.\n\n&amp;#x200B;\n\n[Short Interest vs. Share Price](https://preview.redd.it/qpoz2i4agra61.jpg?width=3038&amp;format=pjpg&amp;auto=webp&amp;s=544c69e831f419afc6cdf5f87853d57b2ac58225)\n\nSince that DD, GameStop has risen to a high of $23.35, Ryan Cohen increased his stake to 12.9% along with obtaining board seats for himself and Chewy CFO and COO. The Q4 13F form for Melvin Capital will be released on February 16 so their concise short exposure isn't public yet. \n\n*Processing img di6hfhz0gra61...*\n\nThrough the OI on the options chain we can get a decent enough picture of the institutional short positions and which positions Melvin Capital and other Institutions are likely holding. As of EOD Jan 11, the open interest on Melvin Capitals Jul 15p is down 88% to 620. We will see in their new 13F if they fully closed their position however after some further investigation, I believe they rolled their position to Jan 15. \n\nOn the 15 Jan 21 chain, there is significant open interest for the 24 put. Currently 51025 contracts are open which is a similar quantity to Melvins July puts. Melvin Capital is the only institution with such a large put position publicly disclosed. \n\n*Processing img kw0u0igljta61...*\n\nSecondly, the lower strike puts (Under $10) have significant OI. There is a specific block of puts, strike 5-10, totaling 57155 in open interest. These strikes have disproportionate OI to comparable strikes and other expiration dates. Melvin Capital is retarded but they aren't stupid. To hedge their long put position of 15 Jan 24 puts, they would open up put debit spreads to cap their max loss and cheapen their positions. \n\nImportantly, their 24 Put FD's are decently fuk. Accounting for the average expected move, their position has an 81% chance of closing ITM. Overall those puts have been destroyed by GME's increase in value and theta decay. If you remember Ryan Cohen just announced his board seat than Melvins position is looking seriously precarious. They cannot escape their position right now since they have gone all in on one strike which is significantly illiquid. Trying to sell would crater the bid/ask. \n\nAccounting for all of this, todays price action makes a good amount of sense. After the board announcement, the stock rose in PM over 21% briefly before getting crushed. Simultaneously, shares available to borrow on IBKR dried up from 45,000 to just 100 shares. Fidelity experienced similar action. Someone is going all in trying to keep the price down and it stands to reason it is Melvin, the only institution with FD puts and an underwater position. They have the capital to keep the price down for this week until their position expires and by no means face solvency issue.\n\n*Processing img tpuciifxlta61...*\n\nThe most important factor here is delta hedging from whichever Market Makers wrote the puts for Melvin. Contrary to WSB belief, they are not out just to fuck over retards. They are supposed to be delta neutral to avoid conflicts with customer interest. This means they will hedge their short options positions with Delta\\*Contracts number of shares. For the week ending 15 January, the total hedging is disproportionately short at -8124390 shares. Those are all shares MM as an aggregate sold to neutralize their positions. As they unwind their positions on Friday, MM's will be buying back a decent portion of those shares. This unwinding happens every week however volume is typically more balanced and less of an effect is felt. \n\n*Processing img 4dn5x8zemta61...*\n\nAll of this evidence points towards massive upside for next week. Melvins short selling pressure should be off and a significant degree of institutional buying should be expected as those positions are unwound. The shorts are more fuk than you would believe and if Melvins puts are worthless by Friday the top is blowing off.\n\n&amp;#x200B;\n\n**TLDR: Gay Melvin bears are fuk when their 51000 FD puts expire on Friday**",
        "subreddit": "wallstreetbets",
        "title": "GameStop: Melvin Capital Put Positions",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kvjbuk/gamestop_melvin_capital_put_positions/",
        "created": 1610451006.0
    },
    {
        "author": "enter--matrix",
        "created_utc": 1612021351,
        "id": "l8o8t0",
        "num_comments": 330,
        "num_crossposts": 0,
        "selftext": "*Disclaimer: I'm not giving you retards any financial advise whatsoever. You are free to do whatever you want with your money. I'm just providing you with my research for you to make up your own conclusions.*\n\n--------------\n\nListen.\n\nFidelity and Vanguard are in a class of their own when it comes to retail brokers available to retail investors. Shithood, Interactive Dumbasses and so on do NOT compare. \n\nShithood is a little startup that has to answer to hedge funds, HFTs (their main customers of order flow buys), and venture capitalists. Shithood CEO has no fucking idea what he's doing and is clearly vested in our failure.\n\n## **Fidelity and Vanguard** 🚀🚀✅\n\nHere come the big fucking boys!\n\nFidelity has **$3.3 trillion**, YES trillion, in assets under management. Vanguard has **$6 trillion** in assets under management. I am saying TRILLIONS, not little billions.\n\nGuess what? **THEY ANSWER TO NO FUCKING ONE**.\n\n## **Fidelity owns 13.67% of GME shares.** 💸💸💸\n\nAnd Vanguard? 6.27% of GME shares. \n\nhttps://preview.redd.it/8gutt1kephe61.png?width=667&amp;format=png&amp;auto=webp&amp;s=574fc95b38139a8679a593999934fe531c796c6a\n\nSource: [https://money.cnn.com/quote/shareholders/shareholders.html?symb=GME&amp;subView=institutional](https://money.cnn.com/quote/shareholders/shareholders.html?symb=GME&amp;subView=institutional)\n\nCollectively, **they literally own 21.10% of GME**. They are INVESTED in its success.\n\nConsider putting your volume, our customer base, behind them. They are with retailers.\n\n# **Okay, so what do I fucking do now?**\n\nOpen a new account in either of these brokerages. Deposit your money and buy GME! Fidelity gives you INSTANT funds as margin. \n\n# **LEAVE YOUR SHARES IN RH. TRANSFER YOUR MONEY OUT.** \n\nI know, this sounds fucking stupid. But your shares are needed in play next week. LEAVING THEM IN RH FOR NOW! HOLD DIAMOND-HAND IT 💎👋\n\nTransferring your assets (shares, options) takes [5-14 days with Fidelity](https://www.fidelity.com/customer-service/transfer-assets), and [similarly at Vanguard](https://investor.vanguard.com/contact-us/faqs/what-investment).\n\nHere is how to **open a new brokerage account**:\n\n\n## **Fidelity Brokerage account: [https://www.fidelity.com/trading/the-fidelity-account](https://www.fidelity.com/trading/the-fidelity-account)**\n\n\n## **Vanguard Brokerage account: [https://investor.vanguard.com/investing/online-trading/](https://investor.vanguard.com/investing/online-trading/)**\n\n*positions: 300 GME*",
        "subreddit": "wallstreetbets",
        "title": "FIDELITY and VANGUARD!! Switch over now if you're stuck in RH. They've combined $9.3 trillion in AUM! They own 21.1% of GME collectively! SWITCH OVER NOW 💎👋",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8o8t0/fidelity_and_vanguard_switch_over_now_if_youre/",
        "created": 1612050151.0
    },
    {
        "author": "baha12022001",
        "created_utc": 1611949158,
        "id": "l81x7r",
        "num_comments": 309,
        "num_crossposts": 0,
        "selftext": "WE CAN'T TRUST ROBINHOOD ANYMORE after yesterday. I heard some reports that the restrictions today are being tightend even more. \n\nConsider following tips when contemplating to switch:\n\n• If you plan to switch but have $GME shares on Robinhood, DON'T transfer (because it may freeze your stocks for an uncertain amount of time). In this case HOLD on with RH and SIGN UP parallel to that to another Broker when considering buying more shares (recommendations below)\n\n• In all other cases, CASH OUT (of your unimportant positions) and TAKE the money with you \n\n\nRecommended brokers:\n\n• FIDELITY!!!!!!!! (super quick + didn't sell us out yesterday)\n•SoFi/CashApp (cool and simple interfaces)\n•TD Ameritrade (had issues yesterday but still a pretty good broker from what I saw on their website)\n• FEEL FREE TO ADD MORE IN THE COMMENTS\n\nI urge someone to pin further information on brokers on this sub (I'm a Europoor from Germany so I'm not very exposed to American brokers beyond informing myself on their websites)\n\nFor legal reasons, I'm not a financial advisor and this is not financial advise, I'm literally 🦍.",
        "subreddit": "wallstreetbets",
        "title": "IMPORTANT POST ON BROKERS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l81x7r/important_post_on_brokers/",
        "created": 1611977958.0
    },
    {
        "author": "MidgetSwiper",
        "created_utc": 1611949665,
        "id": "l8258u",
        "num_comments": 301,
        "num_crossposts": 0,
        "selftext": "So after robinhood and a few other brokers restricted buying on GME, a lot of you have been looking into other brokers. I’ve seen many recommend fidelity and vanguard. I am here to STRONGLY caution against this, and I will explain why.\n\nAt some point, there will be a squeeze, and we will hold until the price skyrockets. Most of you will be selling with limits well into the thousands for massive profit. But guess who else owns a LOT of GME stock? If you guessed Fidelity and Vanguard, you’d be absolutely right, because they own 13.67% and 7.43% respectively.\n\nThey are both big ass whales in this game, and whenever the squeeze is squoze, they’re gonna sell whenever they feel like it. It’s also best for them that they have more people holding, not selling, that way they can sell as high as they want. They have MASSIVE incentive to lock retail investors out of buying AND selling so that they can name their price to the hedge funds shorting GME.\n\nMaybe I’m just being cynical, but I don’t want anybody to get screwed on this. Stick with your current broker as long as you can still hold your positions, and if fidelity and vanguard end up not screwing us over, I’ll be the first to hand them my money. But I’m skeptical to say the least.\n\nI am not a financial advisor, in fact I’m *this* close to eating glue off my fingers.",
        "subreddit": "wallstreetbets",
        "title": "Why you should think twice before switching to fidelity or vanguard",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8258u/why_you_should_think_twice_before_switching_to/",
        "created": 1611978465.0
    },
    {
        "author": "Giant_leaps",
        "created_utc": 1611852218,
        "id": "l71ttg",
        "num_comments": 299,
        "num_crossposts": 0,
        "selftext": " \n\nRobinhood has proved time and time again that they are nothing but weaselly little corporate shills who are to busy sucking off hedge fund managers so they can sell our information and make a quick buck off us I'll include multiple reasons why you should take all your money out of Robinhood and put it in other reputable brokerages like interactive brokers and Charles Schwab .\n\n1. Free Trades Are Now Commonplace\n\nRobinhood is no longer the only show in town. Since its arrival, several major brokers have followed suit and now also offer free trades. Today, you can get free trades with Webull, M1, Fidelity, Charles Schwab, E\\*TRADE, Interactive Brokers, and many more. It means you need to question whether some of Robinhood's other major shortcomings are still acceptable. In practice, they are probably not.\n\n2. Major Downtime Problems\n\nWhen a broker is inaccessible on some of the most volatile days of the last 50 years you may get some small outages . But Robinhood has consistently had major outage that led people to lose millions of dollars . Not once. Not twice. Not three times but over five times.\n\nWorse still, all the outages occurred in the space of one week in early March during the most unpredictable days of the COVID19 crisis. It cost people millions of dollars in positions they could not close. And Robinhood's response? A \"goodwill\" payment of $75. It is now facing multiple lawsuits over the issue.\n\nUsers can no longer maintain any reasonable faith in the service being available when they need it most. That alone is enough reason to switch broker.\n\n3. Delayed Stock Quotes\n\nIf you read Robinhood's FAQs or independent reviews of the service, you will see that the app has real-time quotes.\n\nThat's only half true. Yes, your orders will always be completed at the real-time price, but the charts and data you see on screen are often delayed. This will prevent you from getting in and out of trades in the most efficient manner.\n\n4. Terrible Crypto Product\n\nI understand the appeal of being able to do your stock trading and crypto trading in the same place. On paper, that's something that Robinhood offers; it launched its crypto trading service in 2018.\n\nBut the crypto platform has some shocking drawbacks. The drawbacks are so severe that we'd strongly urge all users to look elsewhere for your crypto needs.\n\n* Coin withdrawals are not available. If you own Bitcoin, you cannot transfer it out of Robinhood to your own private wallet.\n* Robinhood does not supply you with access to your wallet or your wallet address.\n* You do not hold the private keys for your crypto assets. An oft-repeated (and accurate) piece of advice in the crypto world is that if you don't have the private keys, you do not own the coins.\n\n5. Payment for Order Flow, Selling Your Data and Poor Execution\n\nGiven the free trades, how does Robinhood make money? Sure, there's Robinhood Gold, but the signup rate is nowhere near enough to warrant the $8 billion company valuation.\n\nThe answer is via a practice called payment for order flow. It means that instead of searching for the best price for a given stock, Robinhood is instead selling your data to high-frequency trading (HFT) firms for massive profit. The HTF firms add the data to their algorithms to better understand the flow of retail money. It is they who are Robinhood's real customers.\n\nIn reality, the no-fee movement may end up being described as a no-explicit-fee movement, as the payment for order flow revenues have grown at many of these firms. Not to rehash the whole argument, but investors trading at firms with higher PFOF are paying a hidden fee in terms of poorer execution on their trades.\n\nThis means that they may pay a higher price when buying or get a lower price when selling than they would with another broker less focused on PFOF as a revenue generator. For regular investors making only a few trades a year, PFOF-related slippage may not be a huge burden, but it is a bigger issue for more active investors and traders.\n\n6.Robinhood Gold is a Scam\n\nRobinhood Gold is a subscription service that introduces a few extra features for $5 per month.\n\n* Margin investing.\n* Access to professional research such as Morningstar reports.\n* Level II market data.\n* Larger instant deposits (rather than waiting for money to clear).\n\nSounds reasonable. But here's the catch---any broker worth its salt will make all that stuff available for free on its respective platform. It really isn't worth $5 per month. Robinhood Gold just feels like a way to eke more cash out of inexperienced investors who think that by subscribing they will become better traders.\n\n7. Poor Customer Service\n\nRobinhood's customer support is notoriously bad. Users complain of waiting weeks for an answer in the app's Help section, lengthy queues to speak to someone on the phone, no responses to emails, and a general lack of urgency in responding to important issues.\n\nIn ordinary circumstances, poor customer service might be forgivable in a free app. However, when large sums of money are involved, clients deserve better. Given the company's value, we're sure they could hire a few extra reps easily enough.\n\nTLDR: FUCK ROBINHOOD BUY GME ELSEWHERE 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀\n\nSources:\n\n[https://www.investopedia.com/robinhood-pays-settlement-but-gamification-remains-a-concern-5093195](https://www.investopedia.com/robinhood-pays-settlement-but-gamification-remains-a-concern-5093195)\n\n[https://www.makeuseof.com/tag/shouldnt-invest-robinhood-app/](https://www.makeuseof.com/tag/shouldnt-invest-robinhood-app/)\n\n[https://katusaresearch.com/robinhood-trading-exposed-steal-from-the-poor-and-give-to-the-ultra-rich/](https://katusaresearch.com/robinhood-trading-exposed-steal-from-the-poor-and-give-to-the-ultra-rich/)",
        "subreddit": "StockMarket",
        "title": "Robinhood is Stealing From the Poor and Giving to the Rich",
        "url": "https://www.reddit.com/r/StockMarket/comments/l71ttg/robinhood_is_stealing_from_the_poor_and_giving_to/",
        "created": 1611881018.0
    },
    {
        "author": "thefakeleedler",
        "created_utc": 1611840791,
        "id": "l6wo0a",
        "num_comments": 290,
        "num_crossposts": 0,
        "selftext": "Thought a thread that lists popular brokers that AREN'T manipulating the market may be useful.  \n\n\nAs far as I know the following brokers allow trading of GME  \n\n\nWebull  \nE\\*Trade  \nFidelity  \nTDA/TOS (without margin)",
        "subreddit": "wallstreetbets",
        "title": "[GME] What brokers still allow trading",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6wo0a/gme_what_brokers_still_allow_trading/",
        "created": 1611869591.0
    },
    {
        "author": "RoundComfortable5",
        "created_utc": 1611947556,
        "id": "l818e2",
        "num_comments": 286,
        "num_crossposts": 0,
        "selftext": "Yeah, I'm fucking late. And I'm down a little. There's no sell limit, there's no stop loss. \n\nShow me that you are still in. Boost the morale of the soldiers. Show them that they aren't the only one's sweating, but that you both see the light at the end of the infinite money-glitching tunnel. \n\nHold strong. **Rocket emoji.** Switch to Fidelity, they let you buy however many you want. **Eat my ass gay bears.** **Eat the bears' ass, Citadel/Vlad/Citron.** \n\n[Figure 1](https://preview.redd.it/xiu81thwkbe61.png?width=1814&amp;format=png&amp;auto=webp&amp;s=7565c3e5fa434919b83013e15d3c99af2ba0260f)",
        "subreddit": "wallstreetbets",
        "title": "GME Support: Post your position, show your brothers and wife's bf that you are still holding",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l818e2/gme_support_post_your_position_show_your_brothers/",
        "created": 1611976356.0
    },
    {
        "author": "baha12022001",
        "created_utc": 1611981129,
        "id": "l8dtsj",
        "num_comments": 282,
        "num_crossposts": 0,
        "selftext": "STEP 1. STAY WITH ROBINHOOD UNTIL THIS IS OVER AND OPEN ANOTHER ACCOUNT SIMULTANEOUSLY\n\nBy doing so, we circumvent the restrictions and still hold on to our shares on Robinhood. It would be a mistake to transfer or cash out shares as we all know that they're bedpartners with Citadel. They could freeze them for weeks. Btw prepare for sudden server outages and more restrictions.\n\nSTEP 2. FIND A BROKER THAT DIDN'T F*** US UP ON THURSDAY...\n\n**Fidelity** is instantly setup with fast sign up and instant deposit/buying power. **Vanguard** is another alternative broker (keep in mind that are one of the largest institutional holders of GME). **SoFi** went well with us too.\n\nSTEP 3. ***HOLD 💎🤚🏾🚀🚀🚀 WE LIKE THIS STOCK A LOT***\n\n(I'm not a financial advisor. We're all 🦍🦧)",
        "subreddit": "wallstreetbets",
        "title": "FOR EVERYONE WHO WANTS TO LEAVE ROBINHOOD 🚫🌈🐻",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8dtsj/for_everyone_who_wants_to_leave_robinhood/",
        "created": 1612009929.0
    },
    {
        "author": "wishihadaps42",
        "created_utc": 1612054688,
        "id": "l90jz6",
        "num_comments": 281,
        "num_crossposts": 0,
        "selftext": "Sup people. Been watching this stock market moment last few weeks, almost brings me to tears. J remember the 08 crash I was just about graduate highschool, dd eventually lost his job, I was stuck at lue dead end minimum wage job and about to start college knowing it was pointless given the economy was shit and still was shit when I graduate in 2014, was working min age again didn't get a somewhat decent job last year and after layoffs and constant focus on \"tighten our belts\" aka help company continue increase profits while never givening me a raise even though I work hard and ot. Now I see what's happening with Game and want to buy a share or two and hopefully punish the scum that we're rewards in 2008 for destroying so much, almost 30 and can't afford my own rent, cr insurance, health insurance etc all at once, hence living with family again... :(\n\nAnyway I played with arobinhood around 2017 it was easy, free and company seemed great eventually cashed out breaking even after playing around and not knowing wtf I was doing.\n\nThis week tried to log into my account and can't get in. Repeatded support messages sent, they are not sending a sms code to my phone and then they pulled that stock restriction fuck this company. What good brpkreage do you recommend I sign up filr? Was thinking fidelity or vanguard but I don't know shit about fees and if I would make in time by market open. Looking to start buy some safe etfs like vgt, vti etc and get back into buying a couple stocks (I sold my tsla like an idiot) and make some money on the side. No wage growth so I'm shooting myself in the foot just saving in the bank should have just thrown $20000 in spy back in March would have been a smart idea.",
        "subreddit": "wallstreetbets",
        "title": "I'm done with Robinhood what brokerage should I get this weekend that will get me up to buy gme Monday/be a good place for investing going forward?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l90jz6/im_done_with_robinhood_what_brokerage_should_i/",
        "created": 1612083488.0
    },
    {
        "author": "ItsAllJustASickGame",
        "created_utc": 1612067872,
        "id": "l94nqq",
        "num_comments": 281,
        "num_crossposts": 0,
        "selftext": "I keep seeing people say move to Fidelity but this is the most egregious act on the market outside what Robinhood is doing.\n\nLocking sell orders to only 50% above asking limits current sell orders to roughly 500. That's fucking terrible. Stop promoting their services.\n\nWhen we try to exit, all you smoothbrains will have to sell at shitty rates or do it manually, making it infinitely harder to sell to shorts during the squeeze.\n\n\n\nGo to Vanguard. Not Fidelity. Vanguard did nothing. No blocks, no limits. Nothing.",
        "subreddit": "wallstreetbets",
        "title": "Fidelity locks GME sales to 50% above asking price. Stop promoting them, retards!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l94nqq/fidelity_locks_gme_sales_to_50_above_asking_price/",
        "created": 1612096672.0
    },
    {
        "author": "GlobalRevolution",
        "created_utc": 1612026249,
        "id": "l8q347",
        "num_comments": 275,
        "num_crossposts": 0,
        "selftext": "....from just holding back to buying up GME. It doesn't take a lot and I'm sure a lot of you are already leveraged to your tits. Pay day was yesterday for some of you.\n\nCreate a fidelity account right now and start that transfer.\n\nIf you can afford it buy shares and calls. The shares dry up the supply for shorts, and then you can lend these out on fidelity, collect interest and recall them back to really fuck with them. The calls contribute to MM buying up shares to cover their position which causes gamma squeezing to push the price up further. Normally I wouldn't condone FD weeklies (unless the cocaine was really good that week) but they actually work pretty well for GME right now.\n\nThe price is high and so are the stakes but I've never been more erect in my life with my family - you god damn degenerates.\n\nAs soon as I have the funds I'm doing the same. Who needs alcohol, cocaine, and hooker money when you finally have friends and purpose.\n\n🚀 🚀 Rocket 🚀🐂🍆🚀🐂🚀 💎 ✋",
        "subreddit": "wallstreetbets",
        "title": "Happy Weekend! It's time to rotate the GME strategy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8q347/happy_weekend_its_time_to_rotate_the_gme_strategy/",
        "created": 1612055049.0
    },
    {
        "author": "lFUCK",
        "created_utc": 1612117580,
        "id": "l9idz3",
        "num_comments": 275,
        "num_crossposts": 1,
        "selftext": "**Charles Schwab/TD Ameritrade and Fidelity/Vanguard** were the only large brokerages that did not lock out its users and allow massive market manipulation by Citadel.\n\n$SCHW owns and operates both TD Ameritrade and Charles Schwab and has the most to gain from this Citadel/market manipulation fiasco.\n\n**Breakdown of Restrictions by Brokerage: Worst to Best**\n\n**RobinHood: (Worst)**\n\n\\- Trading restrictions limiting purchasing power to as little as 1-5 shares on over 50 stocks\n\n[https://www.theverge.com/2021/1/29/22256419/robinhood-limits-wall-street-bets-stock-buys](https://www.theverge.com/2021/1/29/22256419/robinhood-limits-wall-street-bets-stock-buys)\n\n\\- Allowing closing out of positions but banning purchasing of GME and AMC during Thursday's trading rally. (coercion with Citdael/Melvin to tank price)\n\n\\- Liquidity issues: RH is racing to raise 1$ billion from its existing investors as of Friday as many individuals are withdrawing their funds in protest of restrictions\n\n\\-Raised margin requirements on many securities\n\n\\-Banning naked call option sales on GME and volatile securities\n\n**Interactive Brokers (garbage)**\n\n\\- Trading restrictions on GME/AMC/BB allowing closing out of positions but banning purchasing of these securities during Thursdays trading Rally. (coercion with Citdael/Melvin to tank price)\n\n\\- CEO stated in CNBC interview they imposed restrictions to help out hedge funds (and stabilize the market)\n\n\\-Banning naked call option sales on GME and volatile securities\n\n\\-Raised margin requirements on many securities\n\n[https://www.investopedia.com/robinhood-latest-broker-to-restrict-trading-of-gamestop-and-others-5100879](https://www.investopedia.com/robinhood-latest-broker-to-restrict-trading-of-gamestop-and-others-5100879)\n\n**WeBull + ETrade (garbage)**\n\n\\- Trading restrictions on GME/AMC/BB allowing closing out of positions but banning purchasing of these securities during Thursdays trading Rally. (coercion with Citdael/Melvin to tank price)\n\n\\-Banning naked call option sales on GME and volatile securities\n\n\\-Raised margin requirements on many securities\n\n**Schwab/TD Ameritrade (reasonable)**\n\n\\- Banning naked call option sales on GME and volatile securities\n\n\\- Limiting short selling on volatile tickers (limiting trades with unlimited risk)\n\n\\- Raised margin requirements on many securities\n\n\\- Allowed trading of volatile securities once cash deposits were verified (many new accounts experienced this issue as new funds were not settled)\n\nBoth of these restrictions are reasonable as they have unlimited risk and are not trying to be liable for any substantial losses\n\n**Fidelity/Vanguard (Best)**\n\n\\- Raised margin requirements on many securities\n\n\\- Limiting short selling on volatile tickers (limiting trades with unlimited risk)\n\nBoth of these restrictions are reasonable as they have unlimited risk and are not trying to be liable for any substantial losses\n\nThousands of upset retail investors will be fleeing RH, IBRK, Webull and Etrade over the next couple of weeks. Switching to Fidelity and Schwab/TD Ameritrade.\n\nI would also go long Fidelity investments but it is not publicly traded.\n\n**Schwab Analysis**\n\n**User Growth:**\n\nThe amount of brand new retail investors opening up accounts over the past week is ridiculous. GME + AMC + BB pump has been blasted across every media station. Every online brokerage was experience server lag and strain over the past week due to the increased volume from new retail investors. Traffic on these sites were 3-4 times what they normally were during the recent trading frenzy.\n\n[https://www.barrons.com/articles/schwab-vanguard-fidelity-suffer-service-problems-amid-trading-surge-51611773909?siteid=yhoof2](https://www.barrons.com/articles/schwab-vanguard-fidelity-suffer-service-problems-amid-trading-surge-51611773909?siteid=yhoof2)\n\nRH/Webull/Etrade/IBRK transfers - many retail investors will be transferring over their accounts as a result of the trade restrictions and collusion with hedge funds. Listed below are the total accounts at each brokerage\n\nRH: 13 million accounts\n\nEtrade: 5.2 million accounts\n\nWebull: 2 million accounts\n\nIBRK: 700k accounts\n\nEven if only a small portion of users switch brokerages 5-10% we are still looking at 1-2 million new accounts up for grabs between TD/Schwab/Fidelity/Vanguard\n\nMore users = more deposits/commission = more profits = stonks go up\n\n**Reputation -** RH/Webull/Etrade/IBRK have had their app ratings and reputation destroyed thanks to reviewing bombing as a result of market collusion. These low reviews will discourage any new retail investors from using their platforms and push them towards TD/Schwab/Fidelity.\n\n[https://tech.hindustantimes.com/tech/news/google-deletes-1-star-reviews-saves-robinhood-app-rating-from-massive-nosedive-71611945295584.html#:\\~:text=On%20Friday%2C%20Google%20finally%20stepped,app's%20listing%2C%20according%20to%20reports](https://tech.hindustantimes.com/tech/news/google-deletes-1-star-reviews-saves-robinhood-app-rating-from-massive-nosedive-71611945295584.html#:~:text=On%20Friday%2C%20Google%20finally%20stepped,app's%20listing%2C%20according%20to%20reports).\n\n**Discount:**\n\n$SCHW is trading at a 17% discount (as of PM on Friday) from its January high all while new retail investors and user registrations and deposits reached an all time high over the past week. Negative media coverage and market sell off this week has caused every publicly traded brokerage company to sell of from their highs. With a market rebound and new user registration data for January this stock will fly past its ATH's and run into the 70's.\n\n**Average Daily Users**\n\nThe average daily website users has seen almost a 20% increase from the October 2020 numbers to December 2020 alone. The January numbers will even be substantially higher with TD Ameritrade and Schwab both reporting network strain due to the influx of new investors signing up last week to get into GME/AMC/BB. This trend wont be stopping anytime soon, the retail investor's strength is gaining. Just look at Wallstreetbets alone we had 2.2 million members as of Monday and now we are sitting at 7 million.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ijgfrltunpe61.png?width=728&amp;format=png&amp;auto=webp&amp;s=005ccd498604e7f9fe60d63a6d74e77f5e6ed9e1\n\n**Upcoming Earnings**\n\n$SCHW is going to crush their upcoming earnings for Q1 2021 in April. They acquired TD Ameritrade on October 6. The amount of new retail investors has exploded over the last couple of months. Just look at last years growth in new accounts most brokerages have seen a over 100% increase in 2020 traffic. Their next earnings report for Q1 2021 will be the first quarter with 3 full months of combined revenue from both TD Ameritrade and Charles Schwab. There will also be a mass exodus of upset traders fleeing Webull, Etrade and Robinhood by the thousands and transferring their assets into TD Ameritrade and Schwab.\n\n**Future/Longevity of Brokerages:**\n\nTD Ameritrade/Schwab will be one of the few brokerages not being slammed by class action lawsuits as a result of the manipulation today. E Trade, RobinHood, IBRK and Webull will have users fleeing in the masses to new brokerages. Do you really want to leave your money sitting on a brokerages that may have pending lawsuits against it and possible liquidity issues? (looking at you Robinhood)\n\n**Price Target:** Bank of America just upgraded $SCHW on January 12 giving it a $68 target. Stating their has been mass growth in retail users. This was prior to the new user explosion the past 2 weeks. This stock will easily run to $70 once data comes out for January 2021 on the amount of new users and transfers.\n\n**TLDR:** $SCHW will crush its Q1 2021 earnings thanks to an explosion in new retail investors as a result of the media coverage on GME and AMC. Retail traders on platforms that halted trading activity on Thursday will also be transferring their holdings to Schwab + TD Ameritrade. $SCHW is at a discount thanks to the market sell off and will rebound to $70+ once registration data comes out for January.\n\nPosition: 02/05/2021 &amp; 02/12/2021 $57 Calls\n\nCalls are dirt cheap as this stock is seen as a boomer stock with low volatility.\n\nEDIT: A few people saying TD/Schw/Fidelity were no allowing GME/BB/AMC trading. This may be a result of your cash not settling. New accounts needed their funds to settle before trading these higher volatility tickers. Any errors popping up may also be due to server strain, I was using TD and RBC in Canada and had issues finding tickers/entering into positions\n\nEDIT 2: Schwab will be giving its winter business update on Tuesday at 11am. I expect them to discuss the massive growth in retail investors which should help this stock bounce.\n\nEDIT 3: talked to a online agent about transferring over investments into Schwab. He mentioned that there has been more transfer requests in the last couple days then all of last quarter causing wait times/rep times to go from 5 minutes on hold to over a hour on average.",
        "subreddit": "wallstreetbets",
        "title": "Schwab DD - The company who stands to gain the most out of the restriction/collusion fiasco - $SCHW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9idz3/schwab_dd_the_company_who_stands_to_gain_the_most/",
        "created": 1612146380.0
    },
    {
        "author": "LifeTopic",
        "created_utc": 1611990128,
        "id": "l8g7qu",
        "num_comments": 275,
        "num_crossposts": 0,
        "selftext": "Credit to /u/Dessiato\n\nYOU FUCKIN WRONG CAUSE WE GOT SOME HOMIES ON DECK ROBINHOODS JUST A SMALL INDIE COMPANY COMPARED TO THEM\n\nA PREFACE: DO NOT XFER OUT OF RH. THIS ADVICE IS FOR NEW BUYERS ONLY OR FOR THOSE WHO HOLD MORE THAN 5 SHARES IN RH AND WANT TO BUY MORE. ANYONE BOUGHT ON RH, DISABLE STOP LIMIT. DISABLE MARGIN, AND HOLD ON CASH.\n\nLets get this shit out of the way right now. The reality of the situation is Robinhood does NOT have the liquidity or capital to support buys any further WE GOT TOO FUCKING BIG!. GOOD! due to their clearing house being in house and run by baling wire and dreams. Their owners have a vested interest in ensuring they don't make the collateral demanded by the DTC to move the cash required.\n\nSo here's the fucking rub. There are two CONFIRMED brokers that will do anything in their fucking power to ensure we trade as much as we fucking want. They are...\n\n🚀🚀Fidelity and Vanguard🚀🚀. You want to know why? They both own millions of shares in GME, do you think they won't do whatever they absolutely can to ensure collateral is covered on GME? They are profiting hardcore off of this. We NEED to be throwing their weight behind them, they are the ONLY future we have if we need to be backing this stock as retail.\n\nThis weekend, we need to push harder than we ever have before to educate people on this reality. Robinhood is bush league shit for processing this kind of demand, and it's time we take it to the big boys like Fidelity and Vanguard to handle the rest of this.\n\nTLDR: Robinhood CANNOT SUPPORT OUR VOLUME. The ONLY brokers right now are Vanguard and Fidelity because they OWN GME SHARES. This is PERFECT for us. They will flip fucking gravity to keep us trading. PUSH ON.\n\nTake this opportunity by the balls and never let go. 🚀🚀🚀🚀🚀🚀\n\nUSE YOUR 💎🙌\n\nTHIS POST IS COPYPASTA APPROVED. SPREAD IT",
        "subreddit": "wallstreetbets",
        "title": "USE FIDELITY OR VANGUARD [NEW BUYERS]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8g7qu/use_fidelity_or_vanguard_new_buyers/",
        "created": 1612018928.0
    },
    {
        "author": "VMoney9",
        "created_utc": 1611101549,
        "id": "l0x25w",
        "num_comments": 273,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Shoutout to the hottest cell phone manufacturer of 2004 and also Fidelity for letting me take out 550k on margin",
        "url": "https://i.redd.it/avmep7ggqdc61.png",
        "created": 1611130349.0
    },
    {
        "author": "WSByolobaggins",
        "created_utc": 1612023028,
        "id": "l8oty9",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "Vanguard and Fidelity (combined with Blackrock) own 33.9% of all GME shares. Make no mistake, they refused to block it not because they are \"the good guys\". They did not block it because they like money and they'd like to see their competition go under.\n\nMake no mistake - if there is in fact collusion going on behind the scenes, you can be certain that Citadel and the others are doing everything in their power to get these 3 \"good guys\" to help them out.\n\nBe careful retards. 33.9% of shares is plenty of ammo to move markets against us.\n\n[Source](https://www.investors.com/etfs-and-funds/sectors/gme-stock-gamestop-investors-instantly-make-16-billion-gamestop-stock-squeeze/)\n\nEdit: By no means am I saying to sell. Hold the fucking line 💎👐*\n\n*If you like the stock",
        "subreddit": "wallstreetbets",
        "title": "Have you stopped to consider why Fidelity and Vanguard didn't block trading on Thursday?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8oty9/have_you_stopped_to_consider_why_fidelity_and/",
        "created": 1612051828.0
    },
    {
        "author": "Caitybeck",
        "created_utc": 1611933427,
        "id": "l7v19a",
        "num_comments": 261,
        "num_crossposts": 0,
        "selftext": "So apparently an old employer of mine setup a 401k for me with Fidelity that I didn't know about. Not only, they also put the wrong birthday. So every time I tried to setup a brokerage account, it said I was entering the wrong credentials. \n\nI called Fidelity and they told me I was going to have to submit a paper application to correct the incorrect birthday. I said I'll do that, but I'll probably try to find someone else, because I'm trying to get my assets out of my Robin Hood account. He asked to put me on hold to see if there was something he could do in the back office. He put me on with someone with the 401k department (he stayed on the line while I talked to her). In the end, she told me I was going to have to do a paper application too. He thanked her for her help and told me to stay on the line so he could see if he could try something else. Best fucking customer service. He helped walk me through creating an account, changed my birthday, and walked me through get a transfer set up for my assets at Robin Hood. \n\nI love capitalism. The power of competition. Fuck Robin Hood.",
        "subreddit": "wallstreetbets",
        "title": "Fidelity is helping to make sure Robin Hood gets fucked.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7v19a/fidelity_is_helping_to_make_sure_robin_hood_gets/",
        "created": 1611962227.0
    },
    {
        "author": "NattyZyzz",
        "created_utc": 1612124548,
        "id": "l9l1jn",
        "num_comments": 252,
        "num_crossposts": 0,
        "selftext": "I can't believe there hasn't been a sticky on WSB yet considering it will usually take 2 days to get approved for a broker. Please, for the sake of GME and AMC, get a second broker like Fidelity or Vanguard. This is the most important factor in the upcoming war tomorrow.",
        "subreddit": "smallstreetbets",
        "title": "Word needs to be spread to get a second broker that isn't Robinhood",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/l9l1jn/word_needs_to_be_spread_to_get_a_second_broker/",
        "created": 1612153348.0
    },
    {
        "author": "neg_equity",
        "created_utc": 1610455873,
        "id": "kvr2hv",
        "num_comments": 248,
        "num_crossposts": 0,
        "selftext": "(Bloomberg) --\n\nElectric-bus maker Proterra Inc. agreed to go public through a merger with special purpose acquisition company ArcLight Clean Transition Corp.\n\nThe deal represents an enterprise value of $1.6 billion for Proterra and includes $415 million from investors Daimler Trucks, Franklin Templeton, Fidelity Management &amp; Research Co. and funds and accounts from BlackRock, among others, according to a statement. It’s expected to close in the first half of 2021 subject to approval by ArcLight Clean’s shareholders.\n\nLink to follow",
        "subreddit": "SPACs",
        "title": "EV-Bus Manufacturer Proterra to Go Public Through ArcLight SPAC (Ticker ACTC)",
        "url": "https://www.reddit.com/r/SPACs/comments/kvr2hv/evbus_manufacturer_proterra_to_go_public_through/",
        "created": 1610484673.0
    },
    {
        "author": "investingfucker",
        "created_utc": 1611963567,
        "id": "l88096",
        "num_comments": 247,
        "num_crossposts": 0,
        "selftext": "# Transferring from RH to Fidelity\n\nThis process is actually very simple. Earlier, I used to move \"mature\" positions from RH to Fidelity. I moved all my positions today. This is how I did this:\n\n1. Log on to your Fidelity trading account on a browser.\n2. In a different tab, log on to your RH account. Go to your info, and copy your RHS account number. Focus back on the Fidelity tab after copying this number.\n3. In the top right of the Fidelity home page, type \"transfer asset\". Click on the link, and you should be in the Transfer of Assets (TOA) page.\n4. Click on \"Start a transfer\"\n5. In the \"Select your current firm\" field, type \"Robinhood\". It should show up as \"Robinhood Securities Llc.\". Select that to go to the next step.\n6. In the next screen, paste the previously copied RH account number, and select \"individual\" in the account type.\n7. In the next screen, you can select a specific equity or the whole account. Like I mentioned above, earlier I used to transfer single equities, but today, I selected \"entire account\".\n8. I know that this works as I have transferred other accounts into Fidelity in the past without an issue (once I had an incorrect cost-basis, but that was taken care of with a phone call).\n9. Wait 2-3 days for your RH account to show nothing, and a day or two after that for everything to pop up on Fidelity.\n10. Now, you may shut down the RH account. Make sure you download ALL transactions before you close out the account. Who knows whether RH will even exist by the time it's the next tax filing season.",
        "subreddit": "wallstreetbets",
        "title": "Fuck Robinhood!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l88096/fuck_robinhood/",
        "created": 1611992367.0
    },
    {
        "author": "DangerActiveRobots",
        "created_utc": 1612062509,
        "id": "l9314h",
        "num_comments": 245,
        "num_crossposts": 0,
        "selftext": "Hypothetically let's say the the squeeze truly does squoze during the next couple of weeks and we're all sipping fresh GME juice aboard our moon rocket. RH clearly doesn't want the retail sector coming out ahead here. If GME were to hit 5k a share or whatever, could they just disable selling? Or could they \"go down\" for a day at peak times?\n\nIs there any recourse for someone who might want to sell but can't due to app/website errors? If I try to initiate a sell at X time, but it doesn't go through because of problems on their end, is there any way I can prove that and force them to sell at the amount I asked for, or am I SOL?\n\nI'm not just asking for myself, I'm asking for the probably hundreds of thousands of us sitting with shares in RH who can't move to Fidelity or another broker because the securities transfer would take too long. We have no choice but to hold out hope that if the iron gets hot, we'll be allowed to strike.\n\nFor the record, I plan on holding until at least 10k, and depending on how the next couple of weeks go that might be increasing substantially. I just want to know that I can GET the fair price for my stocks if I do sell and that RH isn't going to fuck me over and then play the \"whoopsie, network error!\" card. \n\nI mean people could sue for such an event, right?",
        "subreddit": "wallstreetbets",
        "title": "Can Robinhood prevent selling at their discretion? Can they experience \"technical difficulties\" when someone might want to sell?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9314h/can_robinhood_prevent_selling_at_their_discretion/",
        "created": 1612091309.0
    },
    {
        "author": "skullybud",
        "created_utc": 1611888962,
        "id": "l7h5fi",
        "num_comments": 241,
        "num_crossposts": 0,
        "selftext": "First time actually trying to get a post through on this subreddit, although I think it's good that it's difficult, we need only high quality posts on this subreddit to get through, especially because of the volume. I'm only doing this because I haven't seen a big post about it yet. We need to leave Robinhood yesterday.\n\nAnyways:\n\nAs we all know, Robinhood **SELLS/GIVES** their order information straight to Citadel, LLC., putting us, *a large portion Robinhood user base*, at a **HUGE DISADVANTAGE.** This allows Citadel, LLC., and thus Marvin Capital, to know our exact stop losses, limit sells, and allows them to manipulate a VERY LARGE portion of this subreddit and other retail traders in the current GME fiasco. They are out direct enemies.\n\nPlease. You **NEED** to:\n\n1. Keep your current shares in Robinhood, sell *after* all of this.\n2. Open a new account at a different acceptable brokerage like:\n   1. E\\*TRADE\n   2. Fidelity\n   3. Vanguard\n   4. Schwab (I'm pretty sure is good)\n   5. There may be others, but really just stick with these 3/4 if you're in the U.S.\n\nNow, if we want to buy stock we can not be manipulated into not being allowed to, and you don't even have to sell anything. Start your brokerage transfers AFTER all of this is done in the coming weeks, maybe months, so that you can have control of your shares and not have them locked up for two weeks.\n\nWe should never allow our information to be sold like this directly to the people and institutions trying to hurt us and commit illegal action directly against this subreddit. The people who are *conspiring* against us.\n\n**ROBINHOOD** will burn because of this, along with Citadel, LLC., Melvin Capital, and Point72. We must leave their platform TONIGHT and open new accounts so we can have freedom in OUR free market come tomorrow morning. $300 is extremely low for the galactic prices this stock is going to hit.\n\nLastly,\n\nRockets: 🚀🚀🚀🚀🚀🚀🚀🚀\n\nPosition: 100 shares GME @ $29",
        "subreddit": "wallstreetbets",
        "title": "IMPORTANT CALL TO ACTION! YOU NEED TO GET OFF ROBINHOOD, NOW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7h5fi/important_call_to_action_you_need_to_get_off/",
        "created": 1611917762.0
    },
    {
        "author": "BrandyFL",
        "created_utc": 1611859314,
        "id": "l74tm2",
        "num_comments": 234,
        "num_crossposts": 0,
        "selftext": "Hi All!  I am buying GME and AMC through Fidelity and support everything you are doing!  But I do know people with children with Down Syndrome and other genome deficiencies and they have the kindest, biggest hearts and are certainly smarter than Wall Street scum.  There are a lot of other great words out there like idiots/fuckups/assclowns etc that are fun to use!",
        "subreddit": "wallstreetbets",
        "title": "LOVE THIS MOVEMENT-BUYING THE STOCK-REQUEST TO CHANGE USE OF \"R WORD\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l74tm2/love_this_movementbuying_the_stockrequest_to/",
        "created": 1611888114.0
    },
    {
        "author": "artichoke2me",
        "created_utc": 1612106893,
        "id": "l9eg6l",
        "num_comments": 230,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This is why you should buy GME with fidelity. Their investors made 3 billions on GME rise.",
        "url": "https://www.investors.com/etfs-and-funds/sectors/gme-stock-gamestop-investors-instantly-make-16-billion-gamestop-stock-squeeze/?repost",
        "created": 1612135693.0
    },
    {
        "author": "LeviFritzroy",
        "created_utc": 1611861908,
        "id": "l760x3",
        "num_comments": 228,
        "num_crossposts": 0,
        "selftext": "Hear me out.\n\nGet a fidelity account.\n\nGet a second email address if you don't have one, use your buddies, mom's, sisters, wife's bfs, work, whatever phone number and get a new venmo. \n\nAdd your credit card to the new venmo account and venmo your nornal venmo money using the credit card you'll pay a 3% fee or so. Yes you are venmoing yourself money off of your credit card. You got to use a different credit card than the one linked with your venmo. It's called diversifying.\n\nTransfer that money from your venmo to your debit card instantly for another 3% fee. It's now instantly in your bank account.\n\nDeposit into Fidelity using ACH. They give you a certain amount of money to spend before it settles like Robin Hood.\n\nBuy and HoLd.\n\n\nEdit: (Only use money you have or are waiting to transfer. Don't pay interest on this shit)\n\nVenmo doesn't count as cash advance ethier!\n\nI am.not a financial advisor. If I was I'd have no customers this isn't good advice.",
        "subreddit": "wallstreetbets",
        "title": "How you can still buy GME/BB with a credit card if your money's tied up in RH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l760x3/how_you_can_still_buy_gmebb_with_a_credit_card_if/",
        "created": 1611890708.0
    },
    {
        "author": "bestgopmemes",
        "created_utc": 1610780727,
        "id": "kye7o9",
        "num_comments": 225,
        "num_crossposts": 0,
        "selftext": "First: 🚀🚀🚀\n\nNow, on to the business at hand.\n\nA lot of you are making the correct choice in buying shares at this point in the game while waiting for the short squeeze - which could be coming as soon as Tuesday now that SEC Rule 201 is in play. \n\nBut some of you are extra greedy/retarded and are buying GME ***on margin***\n\nI'm here to tell you that you are potentially fucking over the short squeeze by doing so. \n\n**If \"Fidelity and Schwab are confirmed to have eliminated margin\" it means all the traders that bought on margin will get a MARGIN CALL and be forced to either liquidate their positions or add more funds.**\n\nThat means the 100,000 shares you bought on margin are going to be forcibly liquidated when you can't cover the actual cost of getting them. \n\n**This will force prices down.**\n\nAnd I know for a fact that most of you have zero porfolio diversity to liquidate, especially retards who are buying GME shares on margin. \n\n**tl;dr:** If you're buying GME shares, you want to buy with cash on hand and nothing more\n\nAlternatively, buy LEAPs with as high strike as possible - follow u/deepfuckingvalue and hop on mid-April calls\n\nFinally: 🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "PSA: Do NOT buy GME on margin",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kye7o9/psa_do_not_buy_gme_on_margin/",
        "created": 1610809527.0
    },
    {
        "author": "tepchan",
        "created_utc": 1610842140,
        "id": "kyuu13",
        "num_comments": 222,
        "num_crossposts": 0,
        "selftext": "I initially wrote this as a comment but wanted to share it with the rest of you retards. There have been a lot of posts about GME this weekend but none have really gone into the implications of the [changes in margin requirements last week.](https://twitter.com/BooRileyMusic/status/1350159960877879296) This post gets long and rambly so up front **TLDR; retail shorts will be forced out creating upwards price pressure, but making the squeeze smaller and shorter** \n\n- The first question is, why are banks increasing margin requirements or removing margin altogether? \n\nThere are two possible answers. Either the banks can't find the shares or they're trying to protect themselves from potential losses. Not being able to acquire shares seems unlikely, if that were the case we should be seeing low availability and high interest [which just isn't there.](https://iborrowdesk.com/report/GME) People assuming banks are worried about their clients money are wonderfully optimistic but woefully naïve. You can take your account from 100k to zero and the bank won't blink. What they're worried about is you taking your account from 100k to -100k. \n\n- The banks are protecting themselves. But from what? \n\nThe longs, with 75% margin requirement, would have to take 75% losses before losses exceed their collateral, and after that their losses are capped. For a GME bull that entered at 35$ that means a share price of &lt; $8.75. **Shorts, on the other hand, have their losses exceeding collateral at any price &gt; $26.25 (assuming 35$ price) and are exposed to potentially unlimited losses.** So banks are exposed to far more risk from the short positions than the long ones.\n\n- Banks are limiting their indirect exposure to shorts by restricting or removing client's margin. Why does this matter? Aren't most shorts institutional and not affected by margin requirements?\n\nIt's true, most of the short volume is big players, but there is a large amount of retail shorts as well. Not only will you have contrarians looking to capitalize off the correction, you'll have all the boomers and casual investors who see Cramer, CNBC, and SA articles predicting the fall. The assumption that most retail shorts are in puts I think is false. If you ask anyone on WSB they would probably make that play, but most retail investors aren't degenerate retards. Most are boomers who favor slow steady growth and get hard thinking about their 2% dividend from MCD. When they see Cramer railing millennials for taking some deadbeat stock through the roof, they log into fidelity or schwab and sell shares short. They're not on RH blowing their retirement on FD puts at 30+% premium.\n\n- Boomers short. Banks restricting margin. What happens from here?\n\nLast week we saw Schwab increase margin requirements first to 100% and then eliminated it altogether. Fidelity increased their requirements from 70 to 75%. Rumors are IKBR were planning to do the same. It's important to note that while removing margin does decrease bank's indirect short exposure, it has the possible effect of triggering a short squeeze if too many clients are forced to close their positions at once. That might explain why IKBR didn't end up changing their margin requirement on the same day as Schwab, and why these changes haven't been widely publicized by the banks themselves. So lets assume that banks take a gentle approach, progressively rising margin requirements before removing margin altogether. This forces some longs and shorts out of their positions over time as they become too high for the trader. But there's an interesting difference when the longs are forced to cover vs. the shorts. Say I'm long 200 shares of GME, 100 bought on margin. If the margin requirement increases from 75% to 100%, I can sell 12.5 shares and I now have enough collateral to cover the remaining position. If I'm short 100 shares with 75% collateral and the requirement goes to 100%, and I close part of the position with my collateral, my margin requirement will decrease but my collateral will decrease by an equal amount. **This means that the traders who forced out of long margin positions will only have to close a portion of their position while those forced out of shorts will have to close the entire position.** Moreover, given the recent price increase, it's likely that on average the shorts will need to cover more collateral than the longs. So shorts are more likely to be in financial distress and will have to close larger proportions of their positions than longs. The overall effect is net buying. \n\n- Short squeeze intensifies. Retail shorts forced out.\n\nAt this point in the lifecycle of a short squeeze with the stock running to new highs you typically have more and more short pressure- old shorts double down, new shorts see Cramer having a seizure and get fomo, some retard checks RH and sees a giant green dildo he doesn't agree with. This can potentially start the lifecycle over, if a new catalyst can force this new generation of shorts out. **By limiting retail shorting, big banks are effectively turning off the gas for squeeze continuation down the line.** \n\n-What does that mean for you? What do you do with this info?\n\nWhatever the fuck you want. GME will probably have some amount of upwards buying pressure this week as banks further restrict margin, the magnitude of which will be proportional to the volume of retail shorts. Combined with /u/unlucky-prize's [prediction](https://www.reddit.com/r/wallstreetbets/comments/kyoixl/gme_option_margin_and_other_factors_for_trading/) of volatility due to gamma hedging, I'm betting it's going to be a hell of a week. \n\nPositions: short 35p 3/19, 35p 4/16, 60p 1/29, long spread 50-60c 3/19",
        "subreddit": "wallstreetbets",
        "title": "GME Margin Changes and their implications",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kyuu13/gme_margin_changes_and_their_implications/",
        "created": 1610870940.0
    },
    {
        "author": "Just_another_dude_09",
        "created_utc": 1611878350,
        "id": "l7d5an",
        "num_comments": 221,
        "num_crossposts": 0,
        "selftext": "This turd is on CNBC right now trying to explain why he limited access these stocks today. Those assholes had a liquidity problem - won’t admit it - and that’s why all of you got bent over today. I’m with Fidelity so I didn’t feel your pain but this guy is so full of shit. \n\nBecause he offered margin but didn’t have enough themselves he told all of you that you could only sell to cover his ass not yours. \n\nI hope you all are able to recoup something from this asshat.",
        "subreddit": "wallstreetbets",
        "title": "Fuck Robinhood CEO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7d5an/fuck_robinhood_ceo/",
        "created": 1611907150.0
    },
    {
        "author": "thethinkernut",
        "created_utc": 1612022235,
        "id": "l8oinu",
        "num_comments": 220,
        "num_crossposts": 0,
        "selftext": "I get that Robinhood has been limiting people to buying one or two shares and that’s because they have that vested interest since they get a lot of revenue from Citadel. But I’ve also heard people talking about Fidelity and Vanguard have access to a shit ton of shares and is the reason everyone should move. Could someone explain how fidelity and vanguard have access to all these shares but Robinhood doesn’t? Or does robinhood have the same access but is limiting investor access to them? Thanks",
        "subreddit": "wallstreetbets",
        "title": "Can someone explain the switch from Robinhood to Fidelity?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8oinu/can_someone_explain_the_switch_from_robinhood_to/",
        "created": 1612051035.0
    },
    {
        "author": "LucasBixtch",
        "created_utc": 1612098251,
        "id": "l9bwy1",
        "num_comments": 219,
        "num_crossposts": 0,
        "selftext": "Hi everyone, \n\nLooking for people in Europe trading with SwissQuote as I have couple questions about it. \n\nI’m looking at changing Broker after Revolut instantly cancelled my buy order and sell limit order every time I’ve put one on Friday. I’m concerned about what might happen later and how they will find a way to fuck us like robinhood did with our fellow Americans Brothers. \n\nI’m looking for something similar to Fidelity in the US if anyone have another alternative they know about in EU (doesn’t have to be fee free just an honest broker that will listen and execute orders properly). \n\nThanks to all. \n\n🙌💎🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "Looking for people using SwissQuote",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9bwy1/looking_for_people_using_swissquote/",
        "created": 1612127051.0
    },
    {
        "author": "baha12022001",
        "created_utc": 1611885434,
        "id": "l7fvoe",
        "num_comments": 207,
        "num_crossposts": 0,
        "selftext": "I would not be in the slightest surprised if ROBINHOOD planned \"outages\" or \"server problems\" for tomorrow...in case we go up again 🚀. \n\nYou have to understand that in today's downturn, there was probably NOT a single share available for the funds to buy (some even reported here that their sell limit was executed at prices above 2000$). So Citadel and the MM will definitely try to increase their coordinated attacks tomorrow.\n\nAs an infinite gamma/short/epic squeeze may be looming, BE CAREFUL\n\n• Switch to brokers who didn't fold to the pressure today, such as FIDELITY or SCHWAB. If you do switch, make sure to do it ONLY if you have cash because they will freeze your positions if you take them to another broker. It's not a problem in case your stuck with Robinhood...just HOLD 🤚🏾💎\n\n• NEVER buy on margin. We saw what Robinhood did today executing orders without consent\n\n• KEEP cool and STAY calm....they are starting to fear the implications of their own conducts. \n\nAND MOST IMPORTANTLY: 🤚🏾💎🤚🏾",
        "subreddit": "wallstreetbets",
        "title": "They will double down on their tricks tomorrow...pay attention!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7fvoe/they_will_double_down_on_their_tricks_tomorrowpay/",
        "created": 1611914234.0
    },
    {
        "author": "Rain_sc2",
        "created_utc": 1611868583,
        "id": "l793tc",
        "num_comments": 203,
        "num_crossposts": 0,
        "selftext": "NOTE: THERE HAVE BEEN REPORTS OF RH SELLING PEOPLE'S POSITIONS THAT ARE ON MARGIN. IF YOU BOUGHT $GME WITH MARGIN ON RH, BE WARY. NOT FINANCIAL ADVICE.\n\n\n======================================\n\n\n**FOR THE UNITED STATES 🚀:**\n\nE TRADE\n\nWEBULL (Currently limiting buys, but still do-able. Proceed with caution.)\n\nTRADESTATION\n\nFIDELITY\n\nVANGUARD\n\nSCHWAB\n\nDOUGH\n\nSOFI\n\nCHASE\n\n\n\n\n**FOR OUR CANADIANS 🚀:**\n\nTD WEB.BROKER (CA)\n\nWEALTHSIMPLE\n\nRBC DIRECT INVESTING\n\n====================\n\n\nSAY IT WITH ME.\n\nFUCK ROBINHOOD💎🙌 FUCK ROBINHOOD💎🙌FUCK ROBINHOOD💎🙌\n\n**THEY CAN SLOW US DOWN BUT THEY CAN'T STOP US. IT'S OURS TO BUY. THE FREE MARKET IS THE TRUE ARBITER OF PRICE.** 🚀🚀🚀🚀🚀🚀 \n\n**WE LIKE THE STOCK, NOTHING MORE, NOTHING LESS.** 🚀🚀🚀🚀🚀\n\n\n**THIS IS A DISCUSSION THREAD, FEEL FREE TO SHARE INFORMATION WITH OTHERS REGARDING WHERE TO TRADE $GME IN A COMPLETELY UNORGANIZED, DECENTRALIZED FASHION**\n\n\n** THE $BB DIP LOOKS PRETTY NICE RIGHT NOW, NOT FINANCIAL ADVICE THOUGH  🚀🚀🚀🚀🚀 **",
        "subreddit": "wallstreetbets",
        "title": "PSA: IF YOU WANT TO BUY MORE $GME, MIGRATE TO THE FOLLOWING BROKERAGES (FOR THICK BOIS AND CANNUCKS)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l793tc/psa_if_you_want_to_buy_more_gme_migrate_to_the/",
        "created": 1611897383.0
    },
    {
        "author": "The-Legend-Of-Chaw",
        "created_utc": 1611981237,
        "id": "l8duy1",
        "num_comments": 202,
        "num_crossposts": 0,
        "selftext": "Originally posted by u/yzy_\n\nJust spreading your gospel. We all need to see this. \n\nBEWARE WEEKEND SCARE TACTICS\n\nWe made it through the battle today and are UP 69% (nice). The hedges are only getting more desperate after the put options that expired today but REMEMBER: they have at LEAST 2-6 days in the market to pay these off, and likely have MANY MORE options expiring in coming weeks. With the lack of shenanigans today I predict an extended-hours ladder attack is incoming when many retail traders are sidelined from the action, combined with another media push of scare tactics incoming this weekend. We were caught off guard with the RH bullshit but hopefully enough people can get set up with Fidelity next week to even the playing field. But above all else: fuckin hold and we're golden\n\nDON'T TRUST EXTENDED HOURS PRICES TODAY OR MONDAY MORNING.\n\n DON'T TRUST ANY MEDIA HITPIECES CLAIMING THE SQUEEZE IS OVER THIS WEEKEND. \n\nTHEY WILL TRY TO KILL THE HYPE WHEN TRADING IS DOWN AND CAUSE A MONDAY SELL-OFF. \n\nHOLD. THE. FUCKIN. LINE.\n\n*obligatory 'not a financial advisor' BS goes here, we just like the fuckin' stock*\n\nEdit: This is NOT my post. Please refer to u/yzy_ as they are the OP. I firmly believe their words and only want to further spread the message. Hold the fucking line 💎🤲🏻",
        "subreddit": "wallstreetbets",
        "title": "REPOST - BEWARE WEEKEND SCARE TACTICS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8duy1/repost_beware_weekend_scare_tactics/",
        "created": 1612010037.0
    },
    {
        "author": "monarchy8822",
        "created_utc": 1612075701,
        "id": "l96sl7",
        "num_comments": 199,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Had to open a fidelity account cause Robinhood ass. Got a loan and I’m back in. And I’m not fucking leaving🚀🥜🚀🥜",
        "url": "https://i.redd.it/ao1sayg77me61.jpg",
        "created": 1612104501.0
    },
    {
        "author": "veryeducatedinvestor",
        "created_utc": 1611363038,
        "id": "l31gj2",
        "num_comments": 198,
        "num_crossposts": 0,
        "selftext": "Guys, girls, degens in any form,\n\n&amp;#x200B;\n\nGME has earnings coming up in a few months and we still have time to BOOST the shit out of this thing. The quarter officially closes Jan 31. This means we have until the end of the month to pump GME's sales and membership counts.\n\n&amp;#x200B;\n\n**Here's the action plan-**\n\n**Step 1 - Download the App and upgrade to a Powerup Rewards Pro membership**\n\n* Increased Membership counts and App downloads/ratings demonstrate that GME is picking up candidates for reoccurring sales which is very attractive from an investor's POV\n\n&amp;#x200B;\n\n**Step 2 - Buy something, fucking anything.**\n\n* **Video Games**\n* **Consoles** \n* **Accessories** (Headsets, Controllers, Peripherals)\n* **Electronics** (Cell Phones, Tablets, Smart Watches, Speakers, TVS &amp; Monitors, Drones, [HOVERBOARDS](https://www.gamestop.com/electronics-hoverboards))\n* **Toys &amp; Collectibles**\n* **Games &amp; Puzzles** (Card games, Trading cards, Board games)\n* **Clothing** (Tshirts, Hats, Costumes, Backpacks, Laptop Bags)\n\nBuy it for yourself, your friend, your wife's boyfriend, my mom.\n\nIma buy my GF a Nintendo Switch with these fucking tendies that have been graced upon me\n\nNote: Try to use the App for your purchases. **Take notes on anything frustrating about the user experience while you are making the purchases.** I've already noted a bunch of Feedback that would be easy for them to change.\n\n&amp;#x200B;\n\n**Step 3 - PROVIDE FEEDBACK ON THE APP**\n\n*Processing img 7varjk87azc61...*\n\n* Submit any feedback from the notes you took while making your purchases\n* What the fuck is better than thousands of degenerates Quality Assurance testing the GameStop App and filing bugs? It takes a huge workload off internal GME resources and we, as the users, are in the best position to provide meaningful suggestions.\n* Rate the App 5 stars if you are feeling inclined\n\n**Example feedback:** I found that I'm not able to use my regular password due to special character limitations. This limitation would have an effect on user that relies on a Password Vault auto-generated password.\n\n# TLDR: Here's the point... we can stop buying many products from other companies entirely- and try to leverage GameStop as our one-stop-shop as much as possible. We have until end of January for one last push to make upcoming Earnings an interstellar journey 🚀🚀🚀🥜🥜🥜\n\n&amp;#x200B;\n\n**Positions:**\n\nFidelity Regular - 110 Shares, Fidelity IRA - 700 shares, Robinhood - 450 shares\n\nBTW, I confirmed with Fidelity today that \"Share Lending\" is NOT enabled by default on the brokerage. You have to sign a bunch of documents to grant those fuckers the ability to lend out your shares to the 🌈🐻s \n\n**Final thoughts:** PEANUT GANG, RISE UP!!! 🥜🥜🥜\n\nIf you have any other good strategies to help bolster GME's upcoming earnings, let me know and I'll add it.\n\nfake edit: 🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "PSA: GME Earnings March 25 - Here's how we send GME to Mars",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l31gj2/psa_gme_earnings_march_25_heres_how_we_send_gme/",
        "created": 1611391838.0
    },
    {
        "author": "TheHugeMan",
        "created_utc": 1611895953,
        "id": "l7jnqw",
        "num_comments": 197,
        "num_crossposts": 0,
        "selftext": "I've seen tons of questions in the daily thread asking about basic concepts such as market/limit orders, what brokerage should I use, or even how to purchase any shares. I thought I would make a post to help clear up a lot of these basic questions and to hopefully save the new degenerates some trouble. \n\n**So you want to buy meme stocks but you barely know what a stock is?**\n\n&amp;#x200B;\n\nTo start, you'll have to register an account at some brokerage and deposit money to buy shares. Popular brokerages on this sub include Robinhood, WeBull, Fidelity, TD Ameritrade, and many more. Do a little research to find a brokerage that works for you. As I'm sure you have heard, many brokerages have limited the ability to buy meme stocks, including Robinhood. As of now, though, Robinhood has opened trading back up for GME and other meme stocks, although they have limited they amount of shares you're able to purchase. After finding your brokerage, you'll have to deposit money from your bank into your brokerage account so you can buy shares. Most brokerages take 3-5 business days to process your bank transfer, so you will have to wait until your transfer goes through to purchase shares. This is one major upside of Robinhood. Robinhood gives their users up to $1,000 of instant access, which means you have up to $1,000 of purchasing power instantly while you wait for your transfer to go through. Just make sure you actually have the money in your account if you plan on taking advantage of this. \n\n&amp;#x200B;\n\n**Now that you have money in your brokerage account, what do?** \n\n&amp;#x200B;\n\nFirst of all, regular market hours are 9:30 AM to 4:00 PM ET Monday - Friday . I've seen many people trying to place orders at 10pm wondering why they're not going through; it's because the market isn't open. Many brokerages offer trading during extended hours, so it is possible to trade outside this window, but I wont get into that now. \n\n&amp;#x200B;\n\nI'm assuming the majority of the new people here want to get into one of the meme stocks as quickly as possible, and hey, more power to ya. But, you have to be careful when buying in to such a volatile market. \n\nBecause of this insane volatility, especially during market open, I would HEAVILY recommend against using a market order. A market order is a buy or sell order that executes at whatever the best available price in the market is currently. This sounds great, but with crazy volatility and low liquidity we are seeing on many of these stocks, the best available price for a stock may be much higher than the number listed on your screen. For example, I've heard rumors recently of GME sell orders executing at &gt;$1,000 at market open today. Here's a screen shot of someone selling half a share for over $5,000:\n\n[https://imgur.com/gallery/7nZGizq](https://imgur.com/gallery/7nZGizq)\n\nAlthough this is probably very unlikely, you do not want to be in the guy buying these shares.\n\n&amp;#x200B;\n\nSo instead of using a market order, I recommend using a limit order instead. A limit order sets a limit price at which your order can execute. That means that if there are currently shares being sold under your limit price, they will be purchased. If there aren't any shares being sold at or below that price, your order will remain active until it is filled or it expires. \n\nSo what should you set your limit price at? \n\nThere is no way to insure you will be getting a great price and that your order will fill.  I recommend waiting an hour or two after the market opens, seeing where the price settles at, and place your limit order based on that price. Buying at market open, especially with very volatile stocks, is a bad idea in general.  \n\n&amp;#x200B;\n\nThat should clear up a lot of questions regarding the basics of trading stocks. If you want to know what a short or gamma squeeze is and why everybody is buying GME, browse the sub for DD posts explaining the situation so you know what you're getting into before you buy. It should go without saying that these meme stocks are high volatile and a not a safe investment whatsoever, only put money in that you are ok with losing. \n\n&amp;#x200B;\n\nI am not a financial advisor, I JUST REALLY LIKE THESE STOCKS 🚀🚀🚀🚀\n\nMONKE STRONG TOGETHER 🐵🐵🐵\n\n&amp;#x200B;\n\nIf you have any other questions PM or ask in the comments",
        "subreddit": "wallstreetbets",
        "title": "Information for the newbies who want to join the fun",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7jnqw/information_for_the_newbies_who_want_to_join_the/",
        "created": 1611924753.0
    },
    {
        "author": "jcodes57",
        "created_utc": 1611850492,
        "id": "l70z7h",
        "num_comments": 197,
        "num_crossposts": 0,
        "selftext": "I know everyone loves their UI and they make things pretty much idiot proof, but time and time again Robinhood has failed us, and this time has actively tried to make us lose money. \n\nBy hiding equities like GME, NOK, AMC, etc from the search AND making these equities SELL ONLY they are blatantly deliberately and maliciously manipulating the market. \n\nI encourage EVERYONE to wait out this absolute shit storm. Try and hold your positions if you can, it seems there may be [legal action](https://www.reddit.com/r/wallstreetbets/comments/l6x130/class_action_against_robinhood_allowing_people_to/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) already in process which means these restrictions may be lifted sooner rather than later and in which case we will see all of these stocks rocket right back to where they were. \n\nHOWEVER, AFTERWARDS, EVERYBODY NEEDS TO LEAVE. Every single person with an account needs to withdraw their funds and close their account. MAKE THEM SUFFER. There are plenty of other platforms who don’t crash during volatility and don’t prevent us from trading like Robinhood has. Fidelity for example is free and I think you can even import assets from another brokerage directly without selling / re-buying. Ive heard TD-Ameritrade is decent as well. \n\nTHIS IS A MATTER OF PRINCIPAL. This is incredibly important to me. Every day I see more freedoms and liberties stripped from us. Manipulation, censorship, and control. We as people cannot continue to let things slide. You have to make a stance and you have to push the issue. \n\nI wish everyone the best of luck through this bullshit, try to keep fighting. 🚀",
        "subreddit": "options",
        "title": "Robinhood - Mass Exodus Required",
        "url": "https://www.reddit.com/r/options/comments/l70z7h/robinhood_mass_exodus_required/",
        "created": 1611879292.0
    },
    {
        "author": "SruNano",
        "created_utc": 1611997756,
        "id": "l8hv8c",
        "num_comments": 196,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Fidelity data backs up you degenerates fought the good fight today. I like the top 2 stocks, bought and holding still. Not financial advice, me gustan los valores 🚀🚀🚀",
        "url": "https://i.redd.it/a51rqdbfrfe61.jpg",
        "created": 1612026556.0
    },
    {
        "author": "pixelblue1",
        "created_utc": 1611980858,
        "id": "l8dqx7",
        "num_comments": 193,
        "num_crossposts": 0,
        "selftext": "Lots of people asking, money in Robinhood....Robinhood suk.  Wat do?\n\n&amp;#x200B;\n\nI am not a financial services advisor.   This is just my opinion.  I do not work for these companies.  This is not an ad.  \n\nPick any one of these:\n\n* Fidelity\n* Charles Schwab\n* Vanguard\n* TD Ameritrade\n* WeBull(for you autists who love fingering your phones all day)\n\nOf those, Fidelity and Vanguard are possibly the best for mutual funds, research, etc.  Yeah I said mutual funds - the boomer stuff.  Fidelity also has a high quality technical desktop trading app, and a good iOS/Android experience.   So does TD Ameritrade.  The rest - don't know, but probably good.\n\nThey have very low management fees for their funds.  And of course, offer options trading as well.  One stop shop for your grandma's 401k, dad's Apple stock purchases, and your pants on head stupid calls.\n\nGodspeed. And hold your GME stock.",
        "subreddit": "wallstreetbets",
        "title": "Friendly PSA: Move your money off Robbinghood to any of these brokerages",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8dqx7/friendly_psa_move_your_money_off_robbinghood_to/",
        "created": 1612009658.0
    },
    {
        "author": "runrun8",
        "created_utc": 1611207970,
        "id": "l1s627",
        "num_comments": 191,
        "num_crossposts": 0,
        "selftext": "Conservative estimate on why GME will squeeze to $69 ($68.85) AT THE MINIMUM.  🚀 🚀 🚀\n\nI've seen a bunch of people on here directly comparing the Volkswagen short float (13%) back in '08 to Gamestop's short float (138%). And since GME has 10x the shorts, it'll squeeze harder or 10x harder. Stop doing that. Here's why.\n\nFirst, you have to understand why Volkswagen squeezed so hard. While a 13% short float seems insignificant, what happened was Porsche secretly gobbled almost all shares of Volkswagen behind everyone's backs. Then one day, they announced that only 1% of shares were left in the public float (% of shares available to retail investors basically) Hence, the shorts rushed to close and Volkswagen squeezed. What's important to take from this is that the effective short float was 13 times the true public float. This 13:1 ratio of outstanding shorts to shares available to close short positions was what caused Volkswagen to triple (2.9x) from €348 to over €1K in the single day that it squeezed.\n\nAs for GameStop, 138% is the short float that gets thrown on here pretty often, but this is dumb. While this is true, it doesn't take into account all the diamond handers and institutional investors other than Cohen and execs. If there truly was a 1.38:1 ratio of outstanding shorts to shares available to close short positions, GameStop wouldn't squeeze that hard - but there isn't. So I went ahead and calculated the true, effective short float of GameStop so we can compare it to Volkswagen. These numbers are VERY conservative. I didn't include many Hedge Funds who filed 13Fs; while some might diamond hand through these time, we'll never know. So I only included Cohen, ETFs such as Vanguard who  won't sell, Mutual Funds, and WSB. I included the two biggest whales u/DeepFuckingValue and u/LemniscateSideEight and placed WSB institutional ownership at a conservative 5% based on a bunch of studies (done months ago so it's probably increased since then).\n\nInstitutional Certified Diamond Handers\n\n|**Fund**|**Shares Held**|**% O/S**|\n|:-|:-|:-|\n|Fidelity Management &amp; Research Company LLC|9,534,090|13.67|\n|RC Ventures LLC|9,001,000|12.91|\n|BlackRock Institutional Trust Company, N.A.|7,897,907|11.32|\n|Fidelity Series Intrinsic Opportunities Fund|6,801,757|9.75|\n|The Vanguard Group, Inc.|5,288,116|7.58|\n|iShares Core S&amp;P Small-Cap ETF|3,514,708|5.04|\n|Fidelity Low-Priced Stock Fund|2,000,679|2.87|\n|Vanguard Total Stock Market Index Fund|1,468,071|2.1|\n|iShares Russell 2000 ETF|1,368,843|1.96|\n|DFA U.S. Small Cap Value Portfolio|1,121,503|1.61|\n|Vanguard Extended Market Index Fund|817,863|1.17|\n|Vanguard Strategic Equity Fund|703,551|1.01|\n|Vanguard Small-Cap Index Fund|634,259|0.91|\n|WSB: DeepFuckingValue|50,000|0.07|\n|WSB: LemniscateSideEight|1,562,262|2.24|\n|rest of WSB estimation|3,800,000|5.4|\n\nOutstanding shares (not the public float) is 69.7M (nice). The people that won't sell or diamond handers adds up to 55.5M shares. Subtract that from the outstanding shares 69.7M-55.5M and we get a true public float or shares floating around of 14.2M. So based on this super conservative estimation, not including Hedge funds and most individual retail investors, we've come to an effective short float of 14.2M. If you take the latest short interest of 71M shorted shares, you get a 5:1 ratio of outstanding shorts to shares available to close short positions. This is not as great as Volkswagen's 13:1 ratio, but it's still solid. Obviously this stuff isn't linearly correlated and is more complex, but assuming GameStop squeezes 5/13 as much as Volkswagen, GameStop will squeeze 76% instead of Volkswagen's 190%. A 76% from GameStop's current share price of $39.12 is $68.85, so basically $69 (nice)!\n\nAgain, these were conservative calculations, if you play around with the numbers and include the 2 largest funds not included: Susquehanna International Group, LLP with 4.4M shares and Dimensional Fund Advisors, L.P. with 3.9M shares, this reduces the true ratio of outstanding shorts to shares available to close short positions to 12:1, which basically matches Volkwagen's 13:1 scenario that tripled the stock so you could expect a GME squeeze \\~$120 from this scenario.",
        "subreddit": "wallstreetbets",
        "title": "138% sHoRT fLoAt! Why it's wrong (and right) to compare GameStop to Volkswagen",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l1s627/138_short_float_why_its_wrong_and_right_to/",
        "created": 1611236770.0
    },
    {
        "author": "JOCHANGY",
        "created_utc": 1611030344,
        "id": "l0c48r",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "Alright Autist,\n\n&amp;#x200B;\n\n**TL;DR** Retards stronger together.  Cum together and make a vow to 💎🙌 $GME for maximum 🚀 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 \n\n&amp;#x200B;\n\nFirst a disclaimer. This post is written not as financial advice but for educational and entertainment purposes only.\n\nI've been waiting patiently for the markets to open up(insert Pablo meme), and to my great surprise, found that both the Europoors and Mexican $GME lunar programs made great strides. I was so inspired by the international $GME activity,  I thought I would double check our upcoming launch operations and ensure that this mission doesn't face any Challenger-esque issues as we prepare to hit escape velocity. Strap the fuck in retards, I'm going to show how your behavior this very week is going to determine how the rest of the MOASS plays out.\n\nMembers of r/wallstreetbets have had to explain to you, as a teacher does to a toddler, to ball up your goddamn fists, so you don't  📝👐 the $GME shares that Gabe Plotkin and the rest of his cuck associates at Melvin Capital desperately need to stave off financial ruin. For the devout and 💎🙌 autist, this is accepted canon, but I can sense through my overpriced Bloomberg terminal and the lack of 🚀 in some posts and comments.  There exists a meaningful cohort of uncommitted retards, for whom only a scientific explanation will make them believe.\n\nEnter - The Prisoner's dilemma. The Prisoner's dilemma is a hypothetical scenario, where two rational actors don't cooperate and by acting in their self-interest, don't produce the most ideal outcome. The classic example put forth by economists and mathematicians is when two bank robbers, placed in solitary confinement and sans communication with each other, are faced with a decision.  The prosecutor lack sufficient evidence to convict the pair on the main charge, but they have enough to convict both to lesser offenses. In this example, the prosecutors negotiate with the prisoner and make an offer. Each prisoner is given the opportunity either to betray the other by confessing that the other committed the crime, or to cooperate with each other by remaining silent. \n\nOutcome #1) When one prisoner confesses and the other remains silent, the confessor goes free and his accomplice receives 20 years behind bars.\n\nOutcome #2) Both prisoners confess, they both receive 5 years.\n\n**Outcome #3 and the ideal outcome) Both prisoners remain silent and only receive 1 year each.**\n\n&amp;#x200B;\n\n[Fig 1. for illiterate retards](https://preview.redd.it/h5t19j8m57c61.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e91ef2db00068e95dd2e23a4d8f2a25a7eca6d27)\n\nThe most ideal outcome is through cooperation with both prisoners serving only 1 year, but academics in various fields, such as John Mearsheimer, the father of neorealism in international politics, would state that blah blah blah shut the fuck up, you know exactly where I'm going with this shit.\n\nIn the case of the VW short squeeze, there were only a handful of shareholders that controlled the float, where engineering a short squeeze was all but certain.  In our case, the number of shareholders is significantly higher to include our lord and savior Ryan Cohen, boomer institutions(Scion, Hestia, Vanguard, etc) and the million strong soldiers of r/wallstreetbets. While one can be critical of my explanation stating that this is in fact a N-person prisoner's dilemma, because they're a  **🌈🐻** with a PhD in the social sciences, or argue that r/wallstreetbets is a community of rational actors, I would like to offer some counter-arguments.\n\n**First**, the soldiers of r/wallstreetbets are not rational. See General u/deepfuckingvalue, loaded to the tits with 💎🙌 that were forged through immense pressure and heat**. Read my lips - IRRATIONAL**\n\n**Second,** there are instances in life where people don't act in their self-interest/self-preservation and cooperate. See marriages(successful ones you dipshit) and war(Battle of  Thermopylae).\n\n**Third,** we have already seen how cooperation has succeeded in the most recent skirmishes against the shorts. Boomer brokerages like schwab and fidelity are cockteasing some of you with increased interest rates to loan your shares to the likes of Melvin Capital. Don't. Hold. The. Line\n\nSo in the same spirit of a marriage or war, we must make a sacred vow to hold our shares, for if we do not cooperate by  📝👐, we may as well have bought gourds. A mixture of 💎🙌 and 📝👐, and we go back to the floor of $17 set by the godfather Ryan Cohen. The only outcome that I or anyone on this sub should accept is where all soldiers💎🙌 to send this 🚀 around the moon to use the lunar orbit and slingshot $GME to the furthest reaches of the galaxy. My model says this price is $420.69. Only at this point, does it make sense for the GameStop leadership to issues the shares and acquire the capital needed for the long haul.  \n\n\n[Fig 2. for illiterate retards](https://preview.redd.it/dhtgik3fe7c61.png?width=796&amp;format=png&amp;auto=webp&amp;s=15336b2a10ca00569efbce71704edd9cecebdf3c)\n\nIt's time to make history, a tale that will be told by your progeny on this Earth and the stars when our $GME starship 🚀. They will honor the legacy and future that you helped create, so now is the time to take this vow.\n\n**I, \\[state your name\\], solemnly swear to hold my $GME shares from this day forward, for green days, for red days, for volatile swings, against the 🌈🐻, according to Ryan Cohen's board leadership, in the presence of** r/wallstreetbets **I make this vow.** \n\nPosition: 6000+ shares in $GME 🚀 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "$GME, the moon, and the prisoner's dilemma",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l0c48r/gme_the_moon_and_the_prisoners_dilemma/",
        "created": 1611059144.0
    },
    {
        "author": "Vaginosis-Psychosis",
        "created_utc": 1612034773,
        "id": "l8tfi8",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "https://fintel.io/so/us/gme\n\nThis DD needs a lot more attention. \n\nIma keep this simple. The following DD posted by u/fyzle deserves more attention than it's been getting. It's simple, clear and common sense. \n\nBasically, about 30% of GME shares are owned by just 3 investment firms (Blackrock, Fidelity, Vanguard). Another 30% is own by other investment firms and Ryan Cohen, which brings it to over 60%... all of who have a vested interest in seeing GME moon.\n\nIf you think for one second that Blackrock, the world's largest investment fund, is going to let GME fail then you must be literally retarded. \n\nThey do not lose money. Period. \n\nCitadel, Melvin and Citron are nothing compared to the might of just Blackrock alone. Throw in Fidelity, Vanguard, Schwab, Susquehana Capital and a bunch of others (see link), and you quickly realize that shorts don't have a leg to stand on. \n\nAutists prepare for take off.🧑🏻‍🚀🧑🏼‍🚀🧑🏽‍🚀🧑🏾‍🚀🧑🏿‍🚀\n\nGME to the mothafuckin moon! 🚀🌙🪐🚀🌙🪐🚀🌙🪐🚀🌙🪐🚀\n\n\n\nhttps://fintel.io/so/us/gme",
        "subreddit": "wallstreetbets",
        "title": "#Common Sense GME DD. 🚀🚀🚀 This DD is so obvious it's easily overlooked and any smooth brain can understand.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8tfi8/common_sense_gme_dd_this_dd_is_so_obvious_its/",
        "created": 1612063573.0
    },
    {
        "author": "BruceInc",
        "created_utc": 1612041288,
        "id": "l8vwc7",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "This has been posted before, but some people are still asking if they should switch to Webull from Rh, I see people recommending SoFi and TastyTrade too. No! Don’t do it. You need to switch to an established broker that has in-house clearing. \n\nHere is a list of which brokers use which clearing houses. \n\nhttps://investorjunkie.com/stock-brokers/broker-clearing-firms/\n\nIf it says “Apex” - stay the hell away. If it says Self clearing: No - stay the hell away. \n\n*I know Rh is now self-clearing, but that literally happened Friday morning and they do not have anywhere close to the required liquidity to handle the current volumes - so stay the hell away.\n\nIt doesn’t matter if you are GME or AMC gang or if you don’t plan on owning any of the meme stocks. Liquidity issues will effect other stocks too. Robinhood had to limit stocks like AMD, GM and even Starbucks. They can not keep up. Most of those other brokers also use the same clearing house - Apex Clearing. That’s a lot of volume to handle. They will be the weak link in the chain that causes the whole system to fail. They already did on Thursday. All the sketchy  shit pulled by various brokers was a direct result of Apex’s inability to keep up with demand. \n\nTLDR - find your broker on [this list](https://investorjunkie.com/stock-brokers/broker-clearing-firms/) and if they say “self clearing -no” then you really should switch to a broker that is self-clearing\n\nThis is is not financial advice, just my opinion. I like the stock 🚀",
        "subreddit": "wallstreetbets",
        "title": "If your broker does not do in-house clearing (RH*, WeBull, TastyTrade, Sofi, CashApp, Stash) you really should switch to one that does (TD, Fidelity, Vanguard, Schwab, Etrade, Merrill)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8vwc7/if_your_broker_does_not_do_inhouse_clearing_rh/",
        "created": 1612070088.0
    },
    {
        "author": "gologologolo",
        "created_utc": 1611873859,
        "id": "l7bbsn",
        "num_comments": 187,
        "num_crossposts": 0,
        "selftext": "Screenshot of WSJ article: \n\nRobinhood posted in their blog [here](https://blog.robinhood.com/) - it's a bunch of BS, they could've circumvented by just blocking margin purchases. Instead they chose to solely allow sells. In crunch times we find, we're the product, the institutions are their customers.\n\n\"Limited buys\" is even worse, since it makes it seem like the stock is underperforming, while producing the illusion that there isn't a reason it should be. Last I looked, that is textbook manipulation, especially for a broker to be controlling the volatility of a stock.\n\nGame plan, buy $GME, $AMC or everything else on a broker than is intuitive, large and disassociated enough from the hedge funds and doesn't limit or block these trades tomorrow - Cashapp or Fidelity",
        "subreddit": "wallstreetbets",
        "title": "Robinhood to allow limited buys starting Friday (tomorrow)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7bbsn/robinhood_to_allow_limited_buys_starting_friday/",
        "created": 1611902659.0
    },
    {
        "author": "jackdskis",
        "created_utc": 1612069481,
        "id": "l954p7",
        "num_comments": 181,
        "num_crossposts": 0,
        "selftext": "I’m currently using Robinhood (fuck) and have been doing so since March as I first began my journey as a Professional Autist. I just opened a fidelity account, and I’ve of heard a lot of people having issues with transferring. What’s the best way to transfer everything so that Robinhood doesn’t fuck me like my wife’s boyfriend does? My portfolio is only worth like 5k, so I was thinking about just liquidating my positions, transferring my funds to my bank account, and then depositing it in fidelity.",
        "subreddit": "wallstreetbets",
        "title": "What’s the best way to transfer brokers?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l954p7/whats_the_best_way_to_transfer_brokers/",
        "created": 1612098281.0
    },
    {
        "author": "gamblingman777",
        "created_utc": 1611966271,
        "id": "l890ga",
        "num_comments": 177,
        "num_crossposts": 0,
        "selftext": "Hey GME gang, I've been trying to figure why I'm feeling sour when I'm sitting here on a Friday, enjoying a 10 bagger on my GME plays and a celebratory tumbler of whiskey. It certainly has everything to do with Robinhood--those fuckers sold my $310 call expiring today at 11:09 a.m. PT with no notice, no questions, nothing (you might recognize 11:09 a.m. PT as basically the low point of the day; that option was worth about $10k at 3:55 today) and they sold it for a grand. Thanks, fuckers!\n\nBut no, that's not the reason I'm writing this post. I'm writing because I'm pissed off about the screenshot I stole from another post by u/tsukune_surprise. I'm sure we all know about the infamous ladder selling by now that hedge funds use to force down the price to artificial lows. What's eating me up is that, while they certainly employed this bullshit tactic before in our run from $20 to $300+ at present, the results have never been so dramatic as they were today and yesterday. You all know the reason--up until yesterday, WSB and our allies would buy back those shares right away, on the cheap. Now, of course, I'm guessing at least half of our people can't hardly do shit but watch it crash thanks to Robinhood and others who suspended buying in GME.\n\nYou can see it plainly in the level two data when ladder selling occurs. To put it bluntly, there are virtually **no buyers and only sellers**. We all know there's no shortage of demand for shares, but the price continues to drop. These fuckers are gaming the system to spite us and if we sit on our hands, there's nothing we can do about it.\n\nSo here's the rub: Get off your butt, pick up your phone, log onto your computer, do whatever you have to to #DumpRobinhood and get on a platform that actually supports its people. My portfolio transfer to **Fidelity** is happening as we speak and I hope I'm not the only one. Thanks for reading and stay angry at the powers that be. This is our moment and we can't waste it because of some bullshit app.\n\nThis is not financial advice as I'm rtard like you. Positions: 157 shares at an AC of $120.47; two $160 2/5 calls",
        "subreddit": "wallstreetbets",
        "title": "I'm Mad as Hell When I See All Sellers and No Buyers--You Should Be Too",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l890ga/im_mad_as_hell_when_i_see_all_sellers_and_no/",
        "created": 1611995071.0
    },
    {
        "author": "apan-man",
        "created_utc": 1609882752,
        "id": "kr8i8r",
        "num_comments": 175,
        "num_crossposts": 0,
        "selftext": "**TLDR Summary**\n\nLong Hydrafacial ($VSPR), a highly profitable, fast-growing established platform in the beauty care industry delivering +3.2M treatments annually with significant recurring revenue and +47% CAGR growth. This “Becky stock” is a post-COVID reopening play with a stellar top-tier management team led by Brent Saunders, who has a decorated history of driving highly accretive growth via M&amp;A.  Hydrafacial’s merger IPO is backed by reputable, long-term investors like Seth Klarman’s Baupost, Fidelity, Principal Global, Redmile Group, Camber Capital, and Woodline Partners. Current price at $11.45 ($1.3B enterprise value) offers pre-merger asymmetric upside of potentially reaching +$20 and a hard floor of $10 per share\n\n**Company Presentation:** [https://2y7msb2elfoj22q7jr2xnc83-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Project-Hydrate-Investor-Presentation\\_vFinal.pdf](https://2y7msb2elfoj22q7jr2xnc83-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Project-Hydrate-Investor-Presentation_vFinal.pdf)\n\n**Deal Webcast:** [http://public.viavid.com/player/index.php?id=142715](http://public.viavid.com/player/index.php?id=142715)\n\n**Company Overview**\n\n* The Hydrafacial Company (Hydrafacial) offers the **one of the** **most popular facial skincare treatments across the world**, with an army of loyal middle and upper-class customers receiving regular treatments on a **monthly basis at +$200 / session**\n* **Skincare is already a fast growing market (\\~14% CAGR in the U.S. alone) with worldwide TAM of +$200B** \n* Consumers have been shifting their **expenditures from goods to experiences** and have shown an **increasing willingness to spend on high end beauty** **and health services**. \n* Growth in the beauty industry is now being driven by an emphasis on **skincare rather than cosmetics.**\n* Hydrafacial is a **patented protected (38 awarded and 18 pending)**, 30-minute, 3 step facial treatment that cleanses, extracts and hydrates \n\n&amp;#x200B;\n\n*Processing img 0qesxplnhg961...*\n\n* Hydrafacial is known for its strong customer loyalty, high customer satisfaction, and great reputation among estheticians\n   * Hydrafacial is the **ONLY beauty product/service with a higher Net Promoter Score than Botox**\n   * Hydrafacial is a **non-invasive service that can be used in conjunction with other treatments** like Botox \n* Hydrafacial boasts a broad and growing base of estheticians including:\n   * Aesthetics: Advanced Dermatology and Cosmetic Surgery, Marina Plastic Surgery, Ideal Image\n   * Spa Services: Bella Sante, Equinox, Four Seasons, Lifetime, OrangeTwist, The Ritz-Carlton\n   * Beauty Retail: Sephora  \n* The company operates a **“razor &amp; razor blade”** model with **highly attractive blended gross margins of +75%:**\n   * The razor: Hydrafacial delivery machine estimated at **$25k-$30k per unit** accounts for roughly **49% of sales**\n   * The razorblade: **10% of the \\~$200 / session fee comes from the use of consumables** (serums, applicator tips, boosters) that Hydrafacial sells to estheticians. This recurring revenue currently represents **51% of sales and will grow bigger as a % of sales as the install base of delivery equipment expands**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cqjlw3wrhg961.png?width=902&amp;format=png&amp;auto=webp&amp;s=7c432dc3e74a9d9d66b8325d53e11b6f6d68c7c4\n\n* While the upfront cost of a Hydrafacial delivery machine and training time is fairly high, **the economics garnered by the esthetician are highly compelling**\n   * A standard Hydrafacial $200 treatment yields a **90% gross margin / $180 gross profit to the esthetician**\n   * **Adding a booster**, like a SkinCeutical antioxidant treatment can increase the Hydrafacial treatment to **$325 with minimal increased cost ($3.39) resulting in a 93% gross margin / $301.61 gross profit**\n   * Assuming **60 treatments per month at $200 / session, that’s $144,000 of revenue or $129,600 of gross profit a year** for the esthetician\n\nhttps://preview.redd.it/etaarg7whg961.png?width=670&amp;format=png&amp;auto=webp&amp;s=4b5d16744c3bc4d5cd393a2639bcf7d93492df3d\n\n* These compelling economics for estheticians along with customer satisfaction and loyalty have driven **increased adoption across 87 countries** and expanded the **installed base of Hydrafacial machines to over +15,000 delivery systems**\n* Historically, the company enjoyed a healthy **+50% CAGR, reaching $167M in revenue and $41M in EBITDA in 2019 (25% EBITDA margin).** \n* However when the COVID pandemic arrived, sales of delivery machines and consumables took a big hit in Q1 and Q2 of 2020 as many estheticians closed their businesses during the lockdowns.  Sales quickly **recovered in Q3 2020 back to levels comparable in Q3 2019.**\n   * Delivery machine installed base grew significantly despite COVID**, up 18% YoY in Q3 2020 compared to Q3 2019**\n* As world economies are fully reopened in 2021, Hydrafacial expects revenues to rebound to **$181M in 2021E and $250M in 2022E, +47% CAGR from 2020**\n   * While it projects **gross margins will expand back to 76% in 2022E**, the Company plans to reinvest in the business to drive topline growth resulting in a near-term EBITDA margin of 14-16% vs. likely steady state of 25% \n   * 2022E projections are realistic: with 18K installed base, 3K new units ($30K each), and $8.5K consumable revenue per unit, **Hydrafacial will reach $250M revenue** just by **keeping up with its past performance** \n* Given Hydrafacial’s established brand and leading market position, it has **unique value creation levers it can pull**:\n   * Implement **annual price increases on consumables** it sells to estheticians given the low cost relative to cost per treatment ($20 of consumables vs. $200 treatment cost)\n   * Expand US and international delivery machine install base by **using IPO proceeds to aggressively buildout salesforce** \n   * Establish Hydrafacial as **delivery platform of choice by partnering with leading cosmetic companies to develop co-branded serum treatments**\n* While there are very few direct competitors to Hydrafacial, Chinese knockoffs known as HydraPeel (or AquaPeel) exist. However, these competitors have failed to gain any meaningful traction outside of the Greater China market. Likewise, alternative procedures such as microdermabrasion have not mounted a serious challenge. Most importantly, **branding power matters A LOT in the beauty industry (think Hermes or Louis Vuitton) with high price inelasticity, and Hydrafacial is the undisputed leader.**\n\n**Management and M&amp;A - the X Factor**\n\n* **Brent Saunders,** who founded Vesper Health and led the Hydrafacial acquisition, is a **legend in the beauty care and specialty pharma industry**. \n* As former CEO of Allergan (+$60B company), Saunders **led the commercial expansion of dozens of healthcare products, most notably Botox**. \n* Saunders has an **exceptional track record of driving shareholder value through accretive M&amp;A** for the companies that he’s led (Bausch &amp; Lomb, Forest Labs, Actavis, Allergan).  \n   * Each of these companies **traded at significant premium valuations to peer companies**, due to the market’s expectation that Saunders would do more accretive M&amp;A or ultimately sell in a strategic exit \n   * Saunders executed **+80 strategic M&amp;A transactions over his career**\n* It’s likely that **Saunders has grand ambitions to use Hydrafacial as an M&amp;A platform** to bring additional products and services to its customers.\n   * Vesper has set aside a **$75M of the $1.1B purchase price in the form of an earnout for Hydrafacial payable upon the completion of certain identified acquisitions within 12 months of the merger closing**\n   * The Merger Agreement specifies that the earnout will be paid based on **2.5x LTM revenues of the target.** So if Hydrafacial buys a target with $30M of LTM revenue, Hydrafacial shareholders will receive the full $75M earnout.\n      * **$30M would be a HUGE inorganic boost to 2021E revenue of $181M**\n\nhttps://preview.redd.it/mhl7j7gxbk961.png?width=915&amp;format=png&amp;auto=webp&amp;s=8aa50f47f5c8e7ae5e2517b0457744a94bc437d6\n\n* While Hydrafacial is a single product company for the time being, it’s clear that **Saunders wants to create broader ecosystem of beauty products and services to sell to estheticians**\n* **Saunders also has a very close relationship with Jim Cramer** of Mad Money on CNBC. He has been invited to the show on a quarterly basis as the CEO of Allergan, and still talks to Cramer regularly via Twitter. I would not be surprised to see **Cramer hosting Saunders on Mad Money to discuss Hydrafacial** at some point ahead of the merger consummation in Feb/Mar 2021.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/22bif7h4ig961.png?width=583&amp;format=png&amp;auto=webp&amp;s=c99cb280b321312ebd3b7351f1580a9db5145fb5\n\n* Saunders has built a loyal investor following in beauty care and specialty pharma as demonstrated by Vesper’s largest shareholder **Seth Klarman of Baupost, who owns 10% of the float.**  The $350M PIPE is being anchored by high quality long-term shareholders including **Fidelity, Redmile Group, Principal Global, Camber Capital and Woodline Partners.** \n\n**Financials and Valuation**\n\n* Management expects **2022E revenue of $250M, a 47.4% CAGR** from depressed 2020E levels that were impacted by COVID\n* **Gross margins are expected to reach 76% in 2022E while EBITDA margins will reach 16%** as the company reinvests in the business for continued topline growth.  \n   * **Longer-term, it’s likely Hydrafacial’s steady state EBITDA margins will return to the 25-27% levels it attained in 2018 and 2019, similar to other beauty companies**\n\nhttps://preview.redd.it/oa9cwgw4ck961.png?width=899&amp;format=png&amp;auto=webp&amp;s=bb22e2a5e1185191cfababdd522aa896e2a2a2bb\n\n* Hydrafacial currently trades at **$11.31 or 5.2x 2022E revenue, which is inline with low growth Traditional Beauty companies.**\n* Given Hydrafacial’s strong growth prospects in the coming years, it should trade at a premium to High Growth Medical Aesthetic and Traditional Beauty companies \n   * For example, **InMode projects 2020E to 2022E CAGR of 22.7% and trades at 6x 2022E revenues while Hydrafacial projects 2020E to 2022E CAGR of 47.4%, which could justify trading at 12x 2022E revenue or $22.50 per share.**  The market should start **pricing in M&amp;A upside for Hydrafacial as well.** \n\nhttps://preview.redd.it/twtxe6la0l961.png?width=569&amp;format=png&amp;auto=webp&amp;s=94d60be46e7e2158316f4c43efffce30be81a0ae\n\n* **The setup: at $11.45, you’re basically risking $1.45 ($10 hard floor of $VSPR SPAC) to make potentially $8-11** if the market starts to value Hydrafacial’s growth and M&amp;A potential as it progresses towards the **merger closing in late February or early March 2021**\n\n**Risks**\n\n* *Single product company*: While we briefly discussed potential M&amp;A prospects earlier, Hydrafacial is still a one-product company for the time being. The execution of inorganic growth plans to create an ecosystem will depend on management’s ability going forward.\n* *Alternative products*: As Hydrafacial expands its international footprint, it will meet some resistance from the cheaper Chinese serums and alternative procedures like microdermabrasion, especially in the developing world. Continued esthetician and favorable media coverage will be essential to keeping the brand premium in international expansion. \n* *COVID uncertainties*: If the current COVID environment continues well beyond Q3 2021 (e.g., due to vaccination delays), the future growth prospects of the company for 2022 will inevitably be affected.\n* *Merger transaction between Hydrafacial and Vesper may not close:* While most SPAC mergers do close, there’s always a small but real risk that a transaction may fail.\n\nDisclosure: Long 225k warrants and 48k commons",
        "subreddit": "SPACs",
        "title": "Invest in Hydrafacial ($VSPR), the Leading Beauty Care Services Platform Poised for Accretive M&amp;A Growth and Post-COVID Reopening Demand",
        "url": "https://www.reddit.com/r/SPACs/comments/kr8i8r/invest_in_hydrafacial_vspr_the_leading_beauty/",
        "created": 1609911552.0
    },
    {
        "author": "zachp004",
        "created_utc": 1612064369,
        "id": "l93lmf",
        "num_comments": 173,
        "num_crossposts": 0,
        "selftext": "The number of people I have seen saying this is small, but it still needs to be addressed as it is causing damage.\n\n&amp;#x200B;\n\nIn 2018, a not so small foreign exchange company called Interactive Brokers was fined $5.5 million for their involvement in the naked short selling of stocks *thousands* of times. They are a company with a market cap of $26.2 billion. **That is nothing for a company their size.**\n\n&amp;#x200B;\n\nOr, look at JPMorgan. They have a market cap of $392 billion. They were fined $920 million last year for price manipulation. **That is nothing for a company their size.**\n\n&amp;#x200B;\n\nSo far, Melvin and others have lost billions on their short positions, and could loose an ungodly amount more if/when the squeeze comes. \n\n&amp;#x200B;\n\nSo if you don't think that they would risk millions in fees to prevent **billions** in losses, then you must be joking.\n\n&amp;#x200B;\n\n**This is why it is so important that we HOLD and do not buy into their tactics.** \n\n&amp;#x200B;\n\n* No matter how far it falls, do not sell, as it is them manipulating the price.\n* Don't trust the media on this. They have just as much riding on this as Melvin. \n* Use Fidelity or Vanguard. Robinhood and others WILL screw you when things get rough for Melvin.\n\n&amp;#x200B;\n\n*Tl;Dr*\n\n*If you were Melvin, would you risk loosing billions to retail investors, or pay a few million dollars in fines and save your shorts?*",
        "subreddit": "wallstreetbets",
        "title": "To All The People Who Don't Think Melvin Would Engage In Illegal Practices Even With Everyone Watching, I Have Something For You To Consider.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l93lmf/to_all_the_people_who_dont_think_melvin_would/",
        "created": 1612093169.0
    },
    {
        "author": "JordanLeDoux",
        "created_utc": 1611877337,
        "id": "l7cqnq",
        "num_comments": 172,
        "num_crossposts": 0,
        "selftext": "So first, market markers are generally not part of these momentum moves. They generally don't have a stake in things either way.\n\nWhat MM's do with regards to options, for anyone unfamiliar, is they write brand new options contracts. Calls and puts. They are, generally, the ones who are setting the bids and asks on the strikes you look at.\n\nYes, individual investors can and do write options, but it's very rare for individual investors to write naked options, which are necessary for people to have long options positions. There has to be a counter-party to the contract that is taking the opposite side.\n\nHow they do this is by acquiring a combination of securities that offset the delta and gamma of the contract they have written. As the price goes up and the contract gains a higher delta, they must acquire more of these securities. \n\nThese securities can be some forms of insurance and derivatives, but the easiest and most common way for MM's to hedge their delta and gamma on a contract is to buy a portion of the underlying. As the price goes up, they must buy more to offset the greeks, as it goes down they sell. This allows them to remain price neutral.\n\nAt least a part of what happened today with Robinhood, WeBull, and IB is that the MM's those platforms use ran out of stock. Nobody was selling, the MM's ran out of stock, and thus the platforms could not fulfill buy requests. \n\nThe brokers that stayed open for business had access to more of the existing stock, such as Fidelity and to a lesser extent TDA.\n\nTomorrow though, we may run out of stock, and people may be unwilling to sell. In that situation, there is no reliable way for MM's to hedge delta and gamma against new contracts, and it's possible that *options* markets may see a liquidity problem on these tickers for new contracts. \n\nNearly 50% of all GME stock in existence expires tomorrow ITM if the stock is above $500, to give a scope of the issue.\n\nThis will probably happen at the same time that some of the short sellers are attempting to further cover their positions.\n\nPay attention to some of these tickers, we are likely to see some never-before-seen events in options markets tomorrow.\n\nNOTE: BB has a much larger float and less total activity, so it's unlikely to run into this issue, but there could be spill over because of how correlated some of these trades have become among retain investors.",
        "subreddit": "options",
        "title": "MM's may be unable to write new contracts tomorrow.",
        "url": "https://www.reddit.com/r/options/comments/l7cqnq/mms_may_be_unable_to_write_new_contracts_tomorrow/",
        "created": 1611906137.0
    },
    {
        "author": "wellidliketotellyou",
        "created_utc": 1611854969,
        "id": "l735xf",
        "num_comments": 168,
        "num_crossposts": 0,
        "selftext": "With RH, WeBull, TD, Trading 212, and Ally (please let me know if I’ve missed some) not allowing the purchase of shares, where will the buy volume come from? I understand that Fidelity and other brokers are still allowing buys, but what happens if they capitulate? I’d literally only selling is allowed, can’t the price just fall indefinitely as hedge funds sell at a low price to their other hedge fund buddies? If this continues into tomorrow and next week, what is our recourse?\n\n\n\nEdit: I’m not tryna spread fear, I’m holding to $10,000 or $0. 💎🙌 but realistically, when will buys be allowed again? How long can they suppress us?",
        "subreddit": "wallstreetbets",
        "title": "Where is the buy volume coming from?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l735xf/where_is_the_buy_volume_coming_from/",
        "created": 1611883769.0
    },
    {
        "author": "Renwoz",
        "created_utc": 1612080121,
        "id": "l97u9d",
        "num_comments": 167,
        "num_crossposts": 0,
        "selftext": "I need some opinions from fellow retards and autists.  \n\nI got into GME early @ $17.50 a share and have set limit sells.  First one is at $1000.  This morning RH canceled my $5000 limit sells, but I was able to put them back in later in the day.  What are the chances when $GME reaches $1000 and my limit sells do not get exercised?  I have a Fidelity account, but I don't want to move my portfolio over and freeze my stonks.  Should I just be watching the stock price and manually try to sell?  I'm hoping there's no fuckery going on with RH when the shit hit the fan (I plan to bounce  out of RH after the $GME saga is over).\n\n🚀🚀🚀🚀🚀🌙",
        "subreddit": "wallstreetbets",
        "title": "$GME Squeeze and RH holders",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l97u9d/gme_squeeze_and_rh_holders/",
        "created": 1612108921.0
    },
    {
        "author": "NlNJANEER",
        "created_utc": 1611999947,
        "id": "l8ibqo",
        "num_comments": 166,
        "num_crossposts": 0,
        "selftext": "Credit to u/Dessiato\n\nYOU FUCKIN WRONG CAUSE WE GOT SOME HOMIES ON DECK ROBINHOODS JUST A SMALL INDIE COMPANY COMPARED TO THEM\n\nA PREFACE: DO NOT XFER OUT OF RH. THIS ADVICE IS FOR NEW BUYERS ONLY OR FOR THOSE WHO HOLD MORE THAN 5 SHARES IN RH AND WANT TO BUY MORE. ANYONE BOUGHT ON RH, DISABLE STOP LIMIT. DISABLE MARGIN, AND HOLD ON CASH.\n\nLets get this shit out of the way right now. The reality of the situation is Robinhood does NOT have the liquidity or capital to support buys any further WE GOT TOO FUCKING BIG!. GOOD! due to their clearing house being in house and run by baling wire and dreams. Their owners have a vested interest in ensuring they don't make the collateral demanded by the DTC to move the cash required.\n\nSo here's the fucking rub. There are two CONFIRMED brokers that will do anything in their fucking power to ensure we trade as much as we fucking want. They are...\n\n🚀🚀Fidelity and Vanguard🚀🚀. You want to know why? They both own millions of shares in GME, do you think they won't do whatever they absolutely can to ensure collateral is covered on GME? They are profiting hardcore off of this. We NEED to be throwing their weight behind them, they are the ONLY future we have if we need to be backing this stock as retail.\n\nThis weekend, we need to push harder than we ever have before to educate people on this reality. Robinhood is bush league shit for processing this kind of demand, and it's time we take it to the big boys like Fidelity and Vanguard to handle the rest of this.\n\nTLDR: Robinhood CANNOT SUPPORT OUR VOLUME. The ONLY brokers right now are Vanguard and Fidelity because they OWN GME SHARES. This is PERFECT for us. They will flip fucking gravity to keep us trading. PUSH ON.\n\nTake this opportunity by the balls and never let go. 🚀🚀🚀🚀🚀🚀\n\nUSE YOUR 💎🙌\n\nTHIS POST IS COPYPASTA APPROVED. SPREAD IT",
        "subreddit": "wallstreetbets",
        "title": "Need to know information for anyone new or anyone considering changing brokers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8ibqo/need_to_know_information_for_anyone_new_or_anyone/",
        "created": 1612028747.0
    },
    {
        "author": "dirtymothafracka",
        "created_utc": 1611859651,
        "id": "l74z7w",
        "num_comments": 165,
        "num_crossposts": 0,
        "selftext": "Can we get a sticky notifying users which apps and brokerages are allowing for free trade?  Or the opposite one stating which apps/brokerages are restricting users?\n\nedit1\n\nLets keep posting here as we get info, and hopefully we can get the mods on board in this together TO THE MOON.\n\nedit2 - from u/[CPM17](https://www.reddit.com/user/CPM17/)\n\nAlso which ones are even accepting new accounts. I've tried and failed to sign up with TD, Fidelity, and Etrade.\n\nedit3 - from post by [u/Dgreenmile](https://www.reddit.com/user/Dgreenmile/)\n\nBrokers who have stopped trading. Robinhood, WeBull , 212, Etoro, Tasty works , Interactive brokers , Merrill edge , Ally invest, Cash app, E-Trade, sofi\n\nBrokers who have stopped but then resumed TD, thinkorswim\n\nBrokers who have not stopped trading. Fidelity, Vanguard, Revolut, Degiro, free trade, stake, schwab\n\nedit 4 - from comments (please let me or user know if situation has changed)\n\nu/[NGG\\_Dread](https://www.reddit.com/user/NGG_Dread/) \\- Wealthsimple works for Canadians BB to the moon\n\nu/[oldworldriches](https://www.reddit.com/user/oldworldriches/) \\- Cibc in Canada allowed my to buy this morning\n\nu/[JoseClimaco](https://www.reddit.com/user/JoseClimaco/) \\- Degiro (Europe)\n\nu/[aguyaguyaguy1234](https://www.reddit.com/user/aguyaguyaguy1234) - Stockpile app allows trading these stocks",
        "subreddit": "wallstreetbets",
        "title": "Sticky for Apps/Brokerages allowing for free trade of GME,BB,AMC, etc",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l74z7w/sticky_for_appsbrokerages_allowing_for_free_trade/",
        "created": 1611888451.0
    },
    {
        "author": "surf_train",
        "created_utc": 1611858863,
        "id": "l74mlb",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "Fidelity has provided me with the best customer service out of any company ever. I’m sure the other brokerages are great, but I can personally vouch for Fidelity. \n\nGreat service, no fees, low margin rates.\n\nFuck Robinhood and all those crooks. Protecting the rich mother fuckers at the expense of the common folk. I’m closing my RH acct ASAP. Totally unfair.\n\nGood luck everyone and thanks to the mods for all the hard work!!!! You guys are what keeps this ship afloat.\n\n[Fidelity](https://www.fidelity.com/trading/the-fidelity-account)",
        "subreddit": "wallstreetbets",
        "title": "Fidelity rocks, fuck Robinhood.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l74mlb/fidelity_rocks_fuck_robinhood/",
        "created": 1611887663.0
    },
    {
        "author": "omniron",
        "created_utc": 1611881325,
        "id": "l7ebug",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PSA: Fidelity has a page to request a full account transfer from Robinhood; choose “individual” account as the type. Requires an existing fidelity account",
        "url": "https://digital.fidelity.com/ftgw/digital/transfer-of-assets/",
        "created": 1611910125.0
    },
    {
        "author": "Boxofcookies1001",
        "created_utc": 1611880965,
        "id": "l7e6th",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "So, This isn't the first time I and many of you have been fucked by Robinhood, but this will be the last time we're going to be fucked.   \n\n\nRobinhood and some of your other brokerages that have restricted trading on our beloved GME is because they don't use their own clearing houses. Clearing houses are required to leverage themselves every time you purchase or sell stock they take the opposite position till they can match you with a buyer and seller. They also charge fees to the brokerage firm (RH, WB, etc) to make that happen. \n\nAs the stock price is rising and increasing  Robinhood, We-bull, etc. Don't have the on hand capital to pay these fees and the clearing house that they all use doesn't want to take the risk. You can see in the link below that largely the brokerages that restricted trading uses Apex clearing. Apex clearing has failed us and we have to make them pay.  \n[Broker Clearing Firms List (investorjunkie.com)](https://investorjunkie.com/stock-brokers/broker-clearing-firms/) \n\nHow do we make them pay. Move to a self clearing broker. Here's a list of self clearing brokers so you won't get fucked again as GME MOONS:\n\nVanguard \n\nTradeStation \n\nTD Ameritrade \n\nMerrill Edge \n\nFidelity\n\nE-Trade\n\nJP Morgan\n\nCharles Schwab \n\n&amp;#x200B;\n\nTLDR: Get off Robinhood/Cheap mobile trading apps and move to a broker that doesn't use 3rd party clearing. Link here: [Broker Clearing Firms List (investorjunkie.com)](https://investorjunkie.com/stock-brokers/broker-clearing-firms/)   \n\n\nGME TO THE MOON!!!",
        "subreddit": "wallstreetbets",
        "title": "Why we're seeing some brokers restrict trading and Why you need to move to a self clearing broker.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7e6th/why_were_seeing_some_brokers_restrict_trading_and/",
        "created": 1611909765.0
    },
    {
        "author": "soothaa",
        "created_utc": 1612114440,
        "id": "l9h6bv",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "If we allow users to continue posting their RH screenshots, we are complicate with helping to contribute to RH's popularity. If those screenshots cannot be shared here, it will help force users to other less manipulative platforms. We're at 7.5 million members now, this could help force them out of business further, because let's be honest, people are going to forget about their crimes and go back to using them.\n\n\nGo use Fidelity (what I use) or Vanguard! Maybe the influx of all of us idiots demanding a shiny usable mobile UI will help them get a move on that as well!",
        "subreddit": "wallstreetbets",
        "title": "Can we please ban/remove screenshots form RobinHood? WSB has undoubtedly contributed to their popularity!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9h6bv/can_we_please_banremove_screenshots_form/",
        "created": 1612143240.0
    },
    {
        "author": "__Snafu__",
        "created_utc": 1611958391,
        "id": "l85v6v",
        "num_comments": 158,
        "num_crossposts": 0,
        "selftext": "I know a lot of people here already know this,  but WSB has grown massively, thanks to the media trying to nuke it,  so I feel there's probably a lot of people here to learn. \n\nSo,  the first thing you need to know before you get started trading/investing is that not only are there other trading apps out there,  but robinhood is genuinely the worst. I'm not just saying this because of what's going on with them these past couple days,  robinhood just sucks. \n\nRobinhood doesn't let you trade OTC stocks (penny stocks)\n\nRobinhood has shitty hours. \n\nRobinhood has had server problems at the worst times they could have them. \n\nRobinhood is pulling this shit with limiting stocks, and mommying it's users.\n\nRobinhood customer service is terrible. \n\nYou can ask for opinions on other apps here,  most people use either TD Ameritrade, Webul, or Fidelity, and honestly none of them check all the boxes I'd like.... but one thing everyone agrees on is that Robinhood is legitimately the worst of all of them.  Robinhood looks nice,  but the others are just as easy to use. \n\nIf you're looking for a broker,  don't use Robinhood. If you're currently using Robinhood,  you should start the switch to another broker immediately,  right now. \n\nIt's really easy to leave robinhood and transfer your money to another broker. It takes minutes on your end,  then they handle the rest. Answer a couple questions,  hit send,  and the two brokers handle the rest. \n\nGodspeed",
        "subreddit": "wallstreetbets",
        "title": "You should know: there's other stock broker apps than Robinhood",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l85v6v/you_should_know_theres_other_stock_broker_apps/",
        "created": 1611987191.0
    },
    {
        "author": "ledxi",
        "created_utc": 1611906004,
        "id": "l7mo5c",
        "num_comments": 156,
        "num_crossposts": 0,
        "selftext": "Lets set a timeline:\n\nFebruary 13: I open Robinhood account and start investing into a variety of stocks\n\nFEBRUARY 20th: THE STOCK MARKET CRASHES\n\nApril 5th-8th: stock market surges and I decide to buy ABT calls. \n\n*Stock market GOES DOWN THE NEXT WEEK AND I LOSE EVERYTHING\n\nJune 8th: I finally get some money again and decide to buy Spy calls\n\nJUNE 10th: MARKET FUCKING CRASHES AGAIN AND I LOSE EVERYTHING\n\nAugust 31: Market has the biggest rally on tech earnings, I hold and hold and hold. I finally am up all-time with over 1,000% returns\n\nSeptember 3rd: TECH FUCKING CRASHES AND I LOSE EVERYTHING\n\nNovember 20th- November 30th: EV market rallies and I make 1,000% returns. I buy more calls on November 30th\n\nDecember 1st: EV MARKET FUCKING CRASHES AND I LOSE EVERYTHING\n\nI give up actively trading December 2nd - January 27th\nI just hold ARKK. The great retard market rallies over thousands of percentages and I decide to just watch. \n\nI FINALLY give in after and buy shares of AMC on January 28th at 6:50am\n\nJANUARY 28TH 7:00am: RETARD MARKET CRASHES OVER FUCKING 50%\n\nI SELL MY 500 SHARES OF AMC AT A LOSS THINKING EVERYTHING WILL CONTINUE TO GO DOWN AND THEN EVERYTHING RALLIES BACK UP AGAIN. \n\nI’m never buying anything again. Everything I touch turns into dust. Good thing Fidelity didn’t give me access to options or I would’ve lost everything again",
        "subreddit": "wallstreetbets",
        "title": "I am the top caller.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7mo5c/i_am_the_top_caller/",
        "created": 1611934804.0
    },
    {
        "author": "Dgreenmile",
        "created_utc": 1611859773,
        "id": "l75171",
        "num_comments": 153,
        "num_crossposts": 0,
        "selftext": "Me and I'm sure a lot of others are going to be searching for a new broker after today's shenanigans. I would like to put together a comprehensive list of brokers that stopped the ability to buy and ones that have not.  This will allow the community to make an informed decision on where you will put your money in the future. I will edit as more information comes to light.\n\nBrokers who have stopped trading.\nRobinhood,\nWeBull ,\n212,\nEtoro,\nTasty works ,\nInteractive brokers ,\nMerrill edge ,\nAlly invest,\nCash app, E-Trade, sofi\n\nBrokers who have stopped but then resumed\nTD, thinkorswim\n\n\nBrokers who have not stopped trading.\nFidelity,\nVanguard,\nRevolut,\nDegiro, free trade, stake, schwab, stash\n\nNot sure \nTrade station \n\nIf any of these are incorrect or some are missing please feel to free to let me know in comments or DM.  Hopefully this helps people make the right decision.",
        "subreddit": "wallstreetbets",
        "title": "Comprehensive List of brokers that stopped the ability to buy any stocks today.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l75171/comprehensive_list_of_brokers_that_stopped_the/",
        "created": 1611888573.0
    },
    {
        "author": "Guinness511",
        "created_utc": 1612010948,
        "id": "l8l0xy",
        "num_comments": 152,
        "num_crossposts": 0,
        "selftext": "Robinhood has become the worst trading platform. Blocking shares you can buy, starting with the ones that everyone wanted to buy to save their own skin. Now throwing up a smokescreen and blocking multiple other stocks to make it seem like they are doing this for a bigger reason but we all really know what’s happening. \n\nLook at Fidelity, I switched from Robinhood to them last year and they’ve been awesome. Accounts are free to open, $0 commissions, they haven’t blocked any stocks throughout this whole saga. It may take signing a couple extra forms to verify your identity with them but you also get a great customer service team to help answer any questions you have.\n\nAny platform that gets to choose what stocks its retail investors can buy is completely bullshit, IF WE LIKE THE STOCK LET US BUY THE STOCK.",
        "subreddit": "wallstreetbets",
        "title": "FUCK ROBINHOOD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8l0xy/fuck_robinhood/",
        "created": 1612039748.0
    },
    {
        "author": "SillyRabbit2121",
        "created_utc": 1611873468,
        "id": "l7b5uk",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "The following brokers shut down trading of certain securities that they hand-picked in a blatant display of market manipulation:   \n\n**Robinhood  \nInteractive Brokers**   \n\nThe following brokers shut down trading of certain securities that they hand-picked in a blatant display of market manipulation, however after massive backlash, decided to resume trading very late in the day:   \n\n**WeBull   \nE-Trade**    \n\nThe following brokers did not shut down trading on any securities today:   \n\n**Fidelity   \nVanguard**    \n\nPlease post your broker, and whether they shut down trading today and whether they lifted it at some point and I will add it to the list in the OP.   \n\nPlease comment on other people's posts to confirm whether they are accurate or not (there are definitely shills from every broker lurking here).   \n\nList of brokers we need info on:   \n\nTD Ameritrade   \nWells Fargo  \nSchwab  \neToro   \nAny other broker that you guys are using",
        "subreddit": "wallstreetbets",
        "title": "Let's create a list of brokers and whether they shut down trading today and for how long",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7b5uk/lets_create_a_list_of_brokers_and_whether_they/",
        "created": 1611902268.0
    },
    {
        "author": "Xanixz",
        "created_utc": 1612041887,
        "id": "l8w42x",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "After all the fiasco with some of the big brokers like robinhood, TD, ETrade, Webull,  last week; I have made the decision to turn to these two brokers (Fidelity Invest and SoFi Invest) for my future investing platforms since they didn’t stop and or limit purchases on certain stocks. Has you used either of these before? If you have, what is your experience with either of these two companies? Everything from ease of use or UI to their customer service. Also do they come with fees or anything like that? All input is appreciated and it’s a shame that so many big brokers did dirty on their customers but it’s good that it shed light on who the real brokers should be.",
        "subreddit": "wallstreetbets",
        "title": "Fidelity or SoFi since RH are cheats?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8w42x/fidelity_or_sofi_since_rh_are_cheats/",
        "created": 1612070687.0
    },
    {
        "author": "DutchBookOptions",
        "created_utc": 1611962988,
        "id": "l87rwj",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "Brokerages must use a custodian to clear all trades. Many brokerages use Apex Clearing Corp., which informed their clients this week that trades in GME and AMC (among others) would be restricted to closing-only. Brokerages that use Apex were forced to restrict their clients to closing-only, and had no voice in the matter. (Robinhood, TDAmeritrade, and Interactive Brokers do not use Apex Clearing and were dicks just because they're dicks).\n\n&amp;#x200B;\n\nFirms that use Apex Clearing Corp., and therefore were forced to restrict the purchase of securities this week (and therefore may be forced to do so again in the future) include:\n\n* WeBull\n* SoFi\n* Tasty Works\n* Ally Invest\n* M1 Finance\n* Betterment\n* Firstrade\n\n&amp;#x200B;\n\nSome brokerages have their own clearing companies in-house, including Fidelity and ETrade. By the way, Robinhood makes all of its money by selling its order feed to Companies like Citadel (mainly Citadel). Fidelity is one of the  few brokerages out there which doesn't sell its orders to anyone, ever.\n\nTasty Works has worked well for me, but since they use Apex, they were forced to restrict the purchase of GME this week and I decided to move to a new brokerage. I created an account with both Fidelity and ETrade to give both of them a shot and this was my experience:\n\nFidelity:\n\n \\- I filled out the application, but half way through the process I got a server timeout error (presumably because of lots of people doing the same thing as me). I tried again and it worked fine. I also had a question so I called their customer service number. I was on hold for about 3 minutes, then spoke with a real person who was nice and answered my question.\n\nETrade:\n\n \\- I filled out an application, then got a screen saying that my account creation could not be completed until I called and spoke with a customer service representative. Ok. I called the number on the screen, and waited on hold for 43 minutes (at 8am). I called back later and waited on hold for about an hour and 15 minutes before giving up.\n\n&amp;#x200B;\n\nExtra tidbit regarding Apex:\n\nI tried to submit a Wiki entry for Apex Clearing Corp. last year, but was rejected 3 times because I couldn't provide any acceptable sources. Why couldn't I provide sources for the info? Because you won't find shit about them online which wikipedia considers to be a reliable source, other than on their own site (which was why I was trying to create the wiki page in the first place).",
        "subreddit": "wallstreetbets",
        "title": "PSA: Moving from Robinhood? Consider avoiding firms that use Apex Clearing Corp.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l87rwj/psa_moving_from_robinhood_consider_avoiding_firms/",
        "created": 1611991788.0
    }
]