[
    {
        "author": "Ironleg01",
        "created_utc": 1617615806,
        "id": "mkgvvq",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "This is great article from Seeking Alpha but since it's against the rules to link SA articles here I'll just copy/paste.\n\n**Vertical Software.** Analyst Jason Celino thinks the plan would \"accelerate digitization opportunities across the architecture and construction industry.\"\n\n1. **Bentley Systems** (NASDAQ:BSY) gets 60% of total revenue from infrastructure, so the plan could lead to \"meaningful multiyear tailwinds.\"\n2. **Autodesk** (NASDAQ:ADSK) exposure to infrastructure of 15-20% of revenue and the \"completion of its Innoyze acquisition, providing solutions for water infrastructure assets, gives us incremental confidence.\"\n3. **Trimble** (NASDAQ:TRMB) has 25-30% of revenue from infrastructure \"geospatial, construction, and civil engineering offerings are well positioned.\"\n\n**Communication Services.** Analyst Brandon Nispel says the bill \"is positive for infrastructure providers (tower operators) and neutral to negative for network providers (wireless carriers and cable operators).\"\n\n1. **American Tower** (NYSE:AMT), **Crown Castle** (NYSE:CCI), **SBA Communications** (NASDAQ:SBAC) are picks in towers, which will be helped by improving investment in wireless networks.\n2. **Altice USA** (NYSE:ATUS), **Cable One** (NYSE:CABO), **Charter Communications** (NASDAQ:CHTR), **Comcast** (NASDAQ:CMCSA), **WildOpenWest** (NYSE:WOW) may see a hit to discretionary cash flow due to a higher corporate tax rate.\n3. **AT&amp;T*\" (NYSE:T), **T-Mobile U.S.** (NASDAQ:TMUS) and **Verizon** (NYSE:VZ) are the most at risk of a corporate tax rate hike, with T and VZ seeing incremental taxes of $1.5B to $2B.\n\n**Entertainment and Video Games.** Analyst Tyler Parker says the plan for bringing high-speed broadband to every American will help domestic online vide games\n\n1. **Activision** (NASDAQ:ATVI), **Electronic Arts** (NASDAQ:EA), **Take-Two Interactive** (NASDAQ:TTWO) and **Ubisoft** (UBISFY) could see tailwinds.\n\n**Semiconductors.** Analysts John Vinh and Wes Twigg say \"expansion incentives would likely be a tailwind for semiconductor equipment demand while easing the capex burden on manufacturers.\"\n\n1. **Applied Materials** (NASDAQ:AMAT), **ASML** (NASDAQ:ASML), **Advanced Energy Industries** (NASDAQ:AEIS), KLA (NASDAQ:KLAC), **Lam Research** (NASDAQ:LRCX) and **Teradyne** (NASDAQ:TER) would benefit in equipment names.\n2. **Analog Devices** (NASDAQ:ADI), **Intel** (NASDAQ:INTC), **Micron** (NASDAQ:MU), **ON Semiconductor** (NASDAQ:ON) and **Texas Instruments** (NASDAQ:TXN) are picks among those with domestic manufacturing footprints.\n\n**Utilities.** Analyst Sophie Karp notes the majority of the impact on the sector would not come from direct spending, but from fiscal incentives.\n\n1. **American Electric Power** (NASDAQ:AEP), **Southern** (NYSE:SO), **Duke Energy** (NYSE:DUK), **Dominion Energy** (NYSE:D), **Entergy** (NYSE:ETR) and **Edison International** (NYSE:EIX) can benefit from incremental grid investment initiatives and electrifications trends from an EV tide that will \"lift all boats.\"\n2. **Eversource Energy** (NYSE:ES), **Avangrid** (NYSE:AGR), **Public Service Enterprise Group** (NYSE:PEG), **NextEra Energy** (NYSE:NEE), **Xcel Energy** (NASDAQ:XEL), **AEP**, **Sunrun** (NASDAQ:RUN), **Sunova Energy** (NYSE:NOVA) will be helped by the extension of the investment tax credit and the production tax credit further boosting commercial solar and wind.\n3. **Public Service Enterprise Group*\" (PEG), **Excelon** (NASDAQ:EXC) and **Energy Harbor** (OTCPK:ENGH) would benefit from any concrete federal program to support nuclear energy.\n4. **First Solar** (NASDAQ:FSLR) may get a boost if solar installers can bypass Chinese tariffs.\n\n**Oil and Gas Exploration and Production.** Analyst Leo Mariani says the plan \"is likely to have a bit of a long-term negative for traditional U.S. oil E&amp;Ps if it accelerates the transition away from fossil fuels for transportation purposes, but we generally think that other variables that normally impact the price of oil over the next few years are much more likely to affect energy stocks as opposed to the impacts of this bill, which will take a healthy part of this decade and into the next to make a material impact.\"\n\n**Life Science Tools.** Analyst Paul Knight says \"a specific call-out of 'biotechnology' as a key technology investment is positive.\"",
        "subreddit": "stocks",
        "title": "Best stocks for Biden's infrastructure plan",
        "url": "https://www.reddit.com/r/stocks/comments/mkgvvq/best_stocks_for_bidens_infrastructure_plan/",
        "created": 1617644606.0
    },
    {
        "author": "ScarletHark",
        "created_utc": 1617325574,
        "id": "mi9kxb",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "I wanted to repost a reply I had made in another posting here, because I think it has general applicability for anyone thinking about how to play the current semiconductor shortage.\n\nIMO the way to play the corporate and government money flowing into addressing the shortage and \"reshoring\" of semiconductor manufacturing capacity is to follow the steps involved in resolving these issues.\n\nTSMC, Samsung and Intel have near-term headwinds in terms of earnings based on semiconductor demand simply because it takes so long to expand capacity. The front-end winners in current semi production efforts are going to be those who supply the tools, products and services that go into these fabs that are planned for construction: AMAT, ASML, TER, LRCX, to name a few (disclosure: I've been in and out of bullish positions on AMAT the past couple of months). Secondary effects on earnings from this expansion will come 1-2-3 years down the line for the semi manufacturers themselves, depending on whether or not they are expanding/upgrading an existing facility, or building one from the ground up.\n\nThe end-users of these semiconductor products (GM, F, NVDA, AMD, etc.) will be the last ones to benefit from expanded chipmaking capacity, as easing the demand crunch allows them to resume normal sales levels. Note that for auto mfrs, this has a ripple effect on rental car companies, who sold all of their fleets in fire sales last year and now can't replace them because the auto mfrs can't make cars.\n\nAdditionally, TSMC is booked up for the foreseeable future; these bookings have prices agreed well in advance, and are almost certainly not subject to TSMC's recent statements that they plan to increase prices; that will happen with new bookings down the line.",
        "subreddit": "options",
        "title": "Playing the semiconductor shortage",
        "url": "https://www.reddit.com/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/",
        "created": 1617354374.0
    }
]