[
    {
        "author": "Kuentai",
        "created_utc": 1619979678,
        "id": "n3cfag",
        "num_comments": 454,
        "num_crossposts": 0,
        "selftext": "tldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow\n\n&amp;#x200B;\n\nThe issues with the livestock and fishing industries have been blowing up lately, we are running out of fish and livestock is one of the leading causes of climate change. The question remains, how do we solve the problem. Some say 'do less, eat less' but I'd argue that this is anathema to humanity and obviously isn't going to work fast enough. We can solve this problem, like everything, with technology. Make something better and cheaper and the majority will follow. \n\n&amp;#x200B;\n\nThis technology exists (lab grown/clean meat) and has been hitting the front page of reddit and international press almost daily at this point. Particularly because of the recent Netflix fishing documentary and Bill Gates letter. There is currently only one way to get in on the ride as a dirty retail investor. If this interests you, get ready for a deep dive.\n\n&amp;#x200B;\n\nI've been keeping an eye on and researching the lab grown meat industry for the last few years waiting for them to solve a technical and moral problem that was holding it back (FBS). Luckily this problem has largely been solved by each lab grown meat company individually, who have each finished developing their own solutions. Making Lab Grown Meat officially (and rebranded as) 'Clean Meat' and 'Cruelty Free.'\n\n&amp;#x200B;\n\nMany of these companies are building factories and aiming for product release **by the end of the year**. Basically a metric ton of [funding](https://agronomics.im/) was handed out in 2020 once these companies solved the FBS problem, massively accelerating their progress to the market.\n\n&amp;#x200B;\n\n\n**Important Points:**\n\n[Global meat, poultry and seafood market is growing to $7.3 trillion.](https://www.grandviewresearch.com/press-release/global-meat-poultry-seafood-market)\n\n**That's a lot of money.**\n\n&amp;#x200B;\n\n[Up to 99% of meat farming in America is factory farming.](https://www.sentienceinstitute.org/us-factory-farming-estimates)\n\n**Vast majority of consumers do not care about quality, just price.**\n\n&amp;#x200B;\n\n[According to American Human's survey nearly 95% of participants are \"very concerned\" about the welfare of farm animals.](https://awionline.org/sites/default/files/uploads/documents/fa-consumer_perceptionsoffarmwelfare_-112511.pdf)\n\n**People feel guilty about it.**\n\n&amp;#x200B;\n\n[84% of vegetarians return to eating meat.](https://www.thehealthy.com/food/vegetarians-vegans-go-back-meat/)\n\n**Buuuut people want/need meat.**\n\n&amp;#x200B;\n\n[\"If 1955 beef production practices were used today, we’d need 165 million more acres of land to produce the same output.\"](https://washingtoncitypaper.com/article/200456/could-we-survive-without-factory-farming-the-low-price-of/)\n\n**Producing meat at todays consumption level ethically is impossible.**\n\n&amp;#x200B;\n\n[Animal Husbandry is the second largest contributer to human made greenhouse gas emissions and the leading cause of deforestation, water and air pollution.](https://climatenexus.org/climate-issues/food/animal-agricultures-impact-on-climate-change/)\n\n**Legislation incoming.**\n\n&amp;#x200B;\n\n[Future Meat Technologies](https://www.future-meat.com/) says [its cultured products will take up 99% less land, 96% less freshwater and emit 80% less greenhouse gases than traditional meat production](https://www.cnbc.com/2019/10/19/lab-grown-meat-could-exacerbate-climate-change-scientists-say.html)\n\n**Self reported but reasonable when taking into account future economies of scale.**\n\n&amp;#x200B;\n\nSo, what to do.\n\nPeople don't like doing less, people don't like feeling bad, solve the problem as ever with technology.\n\nWe simply skip the cow and grow the burger.\n\n&amp;#x200B;\n\n**Is there competition from Big Meat?**\n\nAs of yet, no, in fact, the opposite. Everyone knows the story of how the auto industry has been trying to crush or minimise electric cars for the last hundred years and are only recently and extremely reluctantly developing their own.\n\nNot so with the meat industry, big players have instead invested directly into the growing new industry, could there be a greater approval than multi million investment, green lit by analysts and board, from the industry you intend to displace?\n\n[https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697](https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697)\n\nBig Players supporting the tech\n\nBill Gates, Richard Branson, Founder of Google, Richard Reed (innocent drinks)\n\n&amp;#x200B;\n\n**Optimistic speculation**\n\nCurrently the tech is in infancy and producing simple produce, however there is little perceivable upper limit for the technology, want a perfect Wagyu steak for half the price of a real cheap offcut? Achievable. Exotic blends of Quail and Puffin? Why not. A Woodpecker steak the size of a small child? Let me get the extra large vat ready. As with most technologies the upper ceiling is a considerable distance away, but with the number of competitors and roughly 250 million of funding in 2020 alone, the rate of progress is blistering. It's just a matter of time.\n\n&amp;#x200B;\n\n**Problems**\n\nIck factor.\n\nSolution = Used to be 'Lab Grown Meat.' Now it's being labelled as 'Clean Meat.' Currently 99.99% of budget is spent on R&amp;D and funding as it should be. As they begin to come to market more will be spent on marketing, outreach etc...\n\nPersonally everyone I've talked to starts with the ick reaction, then shortly after admits they'd try it, then after debating the 'important points' believes in it's inevitability.\n\nCriticism of carbon footprint = solved by intentionally linking up with renewable energy sources. Vast majority of companies are in it to solve the environmental problem and will make these moves.\n\n&amp;#x200B;\n\n**The Stock**\n\n**Agronomics - ANIC**\n\nhttps://agronomics.im/\n\nAs of this post bouncing to around 28,50GBX on the London Stock Exchange.\nThis is the only method a retail investor can get into the scene, will provide shareholders with exposure to a concentrated portfolio of companies in this area. In laymans it is like a lab grown meat etf. \n\n&amp;#x200B;\n\n**Current Weighting**\n\nLinks to each company here:\nhttps://agronomics.im/portfolio/\n\n**22.67% BlueNalu**, Inc, '**Cellular Aquaculture**' Fish stocks are dwindling and riddled with mercury and various extra toxins, not to mention the huge press and documentary situation lately on overfishing etc...  Solves all of these problems. BlueNalu is currently one of the most promising of the bunch, aiming to release cultured fish to the market by the end of the year.\n\n11.55% Meatable BV, focusing on cultivated beef and pork\n\n10.53% Other alternative protein investments \n\nShiok Meats, developing cultured seafood with a focus on shrimp.\n\nOritain, data science to prevent fraud in food supply chains.\n\nLegenDairy Foods, creating real, non cruelty dairy using fermentation techniques\n\nGALY, producing cotton grown in a lab\n\nBond Pet Foods, Plant based and Cultured pet food\n\n9.71% Solar Foods Oy, growing protein using a similar method to yeast to create protein powder, ultra low cost\n\n8.70% Cash balances\t\n \n7.92% Foods United, rebranded as LiveKindly, focusing on plant-based chicken\n\n7.92% Tropic Biosciences UK Limited, Using CRISPR and other techniques to produce high performing varieties of tropical crops \n\n6.60% Vitrolabs Inc, Lab grown leather.\n\n5.67% Mosa Meats B.V., working on cultured beef burgers\n\n5.28% Supermeat the Essence of Meat, cultured chicken, available in a restauraunt in Tel Aviv\n\n3.45% Legacy portfolio\t \n\n&amp;#x200B;\n\n**Big Players in Agronomics**\n\nRichard Reed - Chairman = Might know him as the founder of Innocent Drinks, Europes largest and most environmentally sustainable juice company, sold for $600m, now focuses on VC, finding and helping early stage consumer goods companies. Working on Graze, Deliveroo and Tails.\n\t- Taking consumer goods companies and turning them into global successes is like breathing to this guy.\n\nJim Mellon - Non Executive Director = Oxford grad billionaire investor, a true believer.\n\t- Truly believes in the tech and direction, huge resources to push these companies forwards and make it a reality. Has been consistently right for decades. One of the first to see the potential of SIlicon Valley.\n \"You can play with the samples in the lab, it will be a very short amount of time till we see these products dispersed.\"\n\n&amp;#x200B;\n\n**End Notes**\n\nIf that wasn't enough, here's a quote from Winston 'fucking' Churchill\n\n“\\[w\\]e shall escape the absurdity of growing a whole chicken in order to eat the breast or wing, by growing these parts separately under a suitable medium”.\n\n[https://www.nationalchurchillmuseum.org/fifty-years-hence.html](https://www.nationalchurchillmuseum.org/fifty-years-hence.html)\n\n&amp;#x200B;\n\nWhat does it taste like?\nThe chicken tastes like Chicken apparently. The beef tastes like beef. I'm done with links, google it you lazy apes.\n\n&amp;#x200B;\n\nFinal note: This is a long term speculative tech play that if you agree with the above is the equivalent to being able to buy a piece of almost all silicon valley companies back in 2001\n\n&amp;#x200B;\n\ntldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow",
        "subreddit": "wallstreetbets",
        "title": "Clean Meat is at the brink of revolutionising the livestock and fishing industries, expected to hit the market this year. How to get in as a dirty retailer.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3cfag/clean_meat_is_at_the_brink_of_revolutionising_the/",
        "created": 1620008478.0
    },
    {
        "author": "Radish-Perfect",
        "created_utc": 1619894655,
        "id": "n2ojmq",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "What if I told you that Qualcomm, Intel, Skyworks, Texas Instruments, Samsung, and Analog devices all had something in common in their supply chain? They all buy their testing capital equipment from Cohu. \n\nCohu offers a few different products. All of them are within the market of testing computer chips. Why is this market important? Well on the customer end, imagine if you spent 2500$ on a laptop and the intel chip inside didn't work. You'd return it to BestBuy, who would return it to HP, who would return it to Intel. A long and expensive chain of returns for a nonfunctional product. This issue can also be more than just an inconvenience. What if you bought a self driving tesla and one of the chips in the sensors didn't work? What if a Boeing airbus had some faulty chips in the navigation system? In short, it's very important that the semi manufacturers know that their product is working when they send it out. \n\n**Bullish trends**\n\n1. Semiconductor volume is increasing in the following industries, **mobile phones** (5g needs 2x the chips), **Computing**, **Automotive** (electric and self driving need exponentially more chips than cars of the past), **Cloud computing** (basically a warehouse of semiconductors) **AI** (not sure how this works, but it's going to need computer chips). Here's my main argument: ***Each of those markets is rapidly growing, and at the same time chip volume is rising in each of those markets***. This creates a sort of exponential effect for the semiconductor chain. Not only is there a strong catalyst from increasing volume in existing markets (phones, pcs), but we also see rapidly growing new markets that also have high density. (cloud, auto). This is very bullish for the entire semi supply chain.  But the key feature that benefits testing in particular, is increasing complexity of chips. A more complex chip requires more complex testing, which demands a higher premium. \n2. Semiconductor shortage. We all know demand for computer chips is very high. And supply has just about run out. This means that prices for semiconductors should increase due to scarcity. This is great news for Cohu, as it leaves more margin to charge for testing. If you were ford would you pay a premium on chips in order to produce your vehicles?\n3. Increasing chip complexity, on smaller wafers, demands a higher price for testing. AMAT recently noted on April 6th analyst day that capital intensity (% revenue spent on capital equipment) is returning to the 2000 highs of 16%. This increased capital intensity seems especially true when we consider the global chip shortage. Intel and Nvidia are opening new fabs in the last couple months. These factories are going to require a shit-ton of capital equipment. For example TSMC announced they'll be spending $100 billion over the next 3 years on capital equipment, as their fabs have been running at 100% for months and still can't keep up with demand.\n4. Trend of strong growth. Cohu has shown strong growth in the last year. In Q1 2020, revenue was $138.9 million, and gross margin was 41.7%. Q1 2021 revenue was just reported at $225.1 million, and gross margin was 45.6%. This is annual revenue growth of 62%, and margin growth of 9%. Business outlook in only getting better as the semiconductor shortage worsens, and demand continues to grow across sectors.\n5. Very high accounts receivable. Accounts receivable is up 30% annually to 197 million$. Recurring customers represent 48% of Cohu's revenue, so this is a very strong sign in my opinion. \n\n**Bearish trends**\n\n1. The company is on a huge downturn in the last few trading days due to announcing 42-45% gross margin for Q2 instead of 45%+, like Q1. This is on increased revenue of 234-250 million forecasted for Q2. A decrease in GM on growing revenue is never a great sign. The reason for this change is that much of the forecasted growth is in the automotive segment, which is lower margin than other segments I mentioned in the last section. Essentially the chips in cars aren't as complicated as the chips in PCs or phones, so they are less expensive, and therefore have a lower margin for testing. I will point out that the firm is likely to generate more gross margin dollars next quarter than this quarter, albeit on lower gm %. (.43x240=$103.2 gm, vs this last quarter 225x.456=$102.6gm). \n2. Recent stock offering. Cohu sold 4,950,000 shares at 41$ at the start of march. This diluted the shares available, but raised $202 million for the firm. They used this to pay off debt, and fund future growth. \n3. strong competition. Cohu's main competitors are advantest, and teradyne. These are two large global firms that have significantly more financial resources than Cohu. Cohu does have some advantages over these strong competitors, it's the global leader in Radio frequency power amplifier. RF amplifiers are a key component in mobile phones, and are increasing in volume with the 5g rollout. (more chips per phone, and more complexity) Essentially Cohu is in the dominant position in this growing market. Cohu is also the leader in automotive handling. (handling is a process where chips are moved into the testing device, then sorted based on results).\n\n**Fundamental analysis**\n\nI use a ratio similar to p/e. I use gross margin/market cap. (If I was buying the whole company, I'd want to know how much profit I'm purchasing, I don't like p/e because it can be manipulated by the # of shares issued).\n\nCohu annual gm=$316,000,000. Cohu market cap=$1,925,000,000\n\n$316 million/$1925 million=6.09\n\nThis is a very attractive price/gm ratio. Lets compare it to some other companies ratios. \n\nCohu-6.09\n\naapl-19.12\n\namzn-18\n\nter-11.3\n\nadvantest-7.19\n\nswks-17.9\n\nIf cohu were trading at the same multiplier as it's large cap competitor, Teradyne, the stock price would nearly double.\n\nTaking a look at the balance sheet, Cohu is in a much better position today than 1 year ago. They have $290 million of cash, almost double from a year ago. They also have significantly lower long term debt. \\~$200 million today versus \\~$300 million a year ago. \n\n&amp;#x200B;\n\n**Technical analysis**\n\n[Cohu 1 year chart](https://preview.redd.it/pav84wurgjw61.png?width=1504&amp;format=png&amp;auto=webp&amp;s=3d65ce5a266334b6f1c8a9cd3fb344509441451e)\n\nAs we can see from the 1 year chart above, Cohu seems to find support around the $40 mark for the past 6 months. Currently it's chillin out on the support line, so this indicates to me that it's a good time to purchase cohu, as I love buying dips. We can also see it's found resistance at around $50, having tested that line 3-4 times since the start of the year. I cannot say with certainty that it will break this resistance line, but I do expect it to at least check this number again some time in the next 2-3 months. My expected range for this stock in the next 3 months is between $50 and $65, which leaves room for some nice profit if one were to buy at $40. \n\nIn conclusion, cohu is a small cap in an extremely hot market. It's got some big competitors, but it holds certain key advantages over them. The financial position of the company is really good currently, and it's growth should continue for the foreseeable future. It's strongest catalyst is that semiconductor density is increasing in existing markets, and new markets are emerging with high density, which has the potential to create enormous growth. For this reason, I think COHU is a great choice. (Even if you disagree on Cohu, you will want to have some semiconductors in your portfolio for the next few years). \n\nDisclaimer: I'm holding call options on this company. \n\ncheers",
        "subreddit": "wallstreetbets",
        "title": "Cohu; the plug for your favorite semiconductor companies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/",
        "created": 1619923455.0
    }
]