[
    {
        "author": "NoirDeity",
        "created_utc": 1627485009,
        "id": "otbuh4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Purchase Tel!!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/otbuh4/purchase_tel/",
        "created": 1627513809.0
    },
    {
        "author": "TimeJoke",
        "created_utc": 1626089156,
        "id": "oipb8q",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\nTEL AVIV, Israel, July 12, 2021 /PRNewswire/ -- Cyberint has today launched next-generation Digital Risk Protection platform, Argos Edge, a fully SaaS based solution, to provide real-time responses to cyber threats coming from beyond the traditional security perimeters.  \n\nUnlike other solutions, Cyberint's holistic and integrated approach combines external Attack Surface Monitoring (ASM), advanced threat intelligence, extensive phishing detection as well as social media and brand abuse monitoring. The different modules work together to infuse and enrich the Argos Edge platform, identifying and remediating weaknesses that other solutions cannot detect seamlessly and continuously. This unique capability makes Argos Edge the most comprehensive and effective all-in-one digital-risk-protection (DRP) platform on the market to date.\n\nArgos Edge redefines the digital risk protection space by constantly collecting, analysing, and classifying threat intelligence from the widest variety of sources, tracking cybercriminals in the dark and deep web, criminal forums, market places, social media platforms, instant messaging, file sharing repositories and more. Pin-pointed targeted alerts such as those provided by Argos Edge are known to reduce false positives by 99%, providing the optimum combination of External Attack Surface Mapping of Digital assets, including cloud assets and Threat Intelligence.\n\nArgos Edge focuses on generating proactive and targeted alerts allowing organizations to take immediate steps to mitigate those incoming threats which pose the greatest potential risk whilst also receiving up-to-date proactive information about global, regional, and vertical threats that may cause a potential breach.\n\nArgos Edge includes one of the most extensive leaked credentials databases, which is comprised of: fusing breached databases, analysis of phishing kits and highly effective InfoStealers malwares C&amp;C, helping to reduce the risk from this most common attack vector. The leaked credentials database is also highly effective to B2C organizations helping to reduce account takeover of their customers.\n\nThe new platform also enables users, via a state-of-the-art user interface, to immediately use the pin-pointed alerts as well as integrate them into SIEM, SOAR and ticketing systems like IBM QRadar and Palo Alto's Cortex XSoar and others for swift dissemination and remediation.\n\nArgos Edge's unique built-in investigation tool, Forensic Canvas can uncover the relationships between disparate data points, pivot on any IoC and leverage the massive data lake that Cyberint collects 24/7 to build a quick and up-to-date picture of any threat.\n\n\"Only by constant analysis of hundreds of millions of data points of threat intelligence and an ongoing monitoring of their external attack surface can organizations counter the threat actors' constantly evolving threat landscape.\" says Cyberint CEO Yochai Corem.\n\nThe Argos Edge platform also comprises numerous additional features that enable users to extend their security perimeters to include phishing, social media and fake application takedown support, external source code monitoring and fraud detection capabilities.\n\nWith this launch, organizations now have the capabilities to protect themselves from more than seventy-five different business risks lurking beyond the perimeter, such as fraud, phishing, malware, data leakage, vulnerabilities, brand, social media risks and more. Users now also have modular options allowing for full flexibility in licensing the platform. Organizations can benefit from Cyberint's deep expertise in specialised services such as Virtual Humint, deep cyber investigations and interaction with threat actors to identify possible weaknesses.\n\n\"With Argos Edge, \"I have a level of assurance and trust that they are always there for me. The feeling that they always have my back is invaluable has given me the confidence that we have enough visibility and can be proactive in dealing with different cyberthreats.\" -Mark Frogoso, CISO at GCash.\n\n&amp;#x200B;\n\n**About Cyberint:**\n\nCyberint provides Digital Risk Protection and Threat Intelligence. We believe in making the digital world a safer place to conduct business, by protecting our customers from cyber threats beyond the perimeter.\n\nCyberint provides targeted insights into threat actor activity, brand protection, phishing attacks, data leakage, and exploitable attack surfaces.\n\nCyberint serves leading brands worldwide including Fortune 500 companies across industries such as finance, retail, ecommerce, gaming, media, and more, with proprietary Argos Edge™ technology enriched by dedicated cyber and intelligence analysts.\n\n**Source** [https://ceo.ca/@newswire/argos-edge-offers-first-fully-comprehensive-one-stop](https://ceo.ca/@newswire/argos-edge-offers-first-fully-comprehensive-one-stop)",
        "subreddit": "pennystocks",
        "title": "Argos Edge offers first fully comprehensive one-stop DRP solution",
        "url": "https://www.reddit.com/r/pennystocks/comments/oipb8q/argos_edge_offers_first_fully_comprehensive/",
        "created": 1626117956.0
    },
    {
        "author": "myTMike123",
        "created_utc": 1625514526,
        "id": "oeeulp",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "TEL But with a 136.65 stop looks good.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oeeulp/tel_but_with_a_13665_stop_looks_good/",
        "created": 1625543326.0
    },
    {
        "author": "WSB_ThAw",
        "created_utc": 1626898660,
        "id": "ooy2vp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "DISCLAIMER: LONG TERM INVESTMENT. YOU MAY NOT WANT TO READ THIS IF YOU NEED TO RECOUP YOUR LOSSES BY THE END OF THE MONTH. Also English is not my first language, apologies in advance for any language mistakes.\n\n&amp;#x200B;\n\n**Ticker:**\n\nStrauss Group, Ticker is STRS at the Tel Aviv Stock Exchange\n\n&amp;#x200B;\n\n**Overview:**\n\nStrauss Group is an Israeli company which is active in various areas of food development, production and distribution.\n\nThe group has a mcap of $3.3 billion and 57% are owned by the Strauss family. Although one of Israel's biggest food companies it generally isn't being discussed much because of its structure, lack of international exchange listings and probably also due to its rather boring price developments over the past years.\n\n&amp;#x200B;\n\n**The Numbers (in ILS):**\n\nRather unexciting. Revenue is increasing slowly but steadily; recently below expectations but made up by a profit surprise from succesful investments.\n\n&amp;#x200B;\n\n[some numbers](https://preview.redd.it/rpvejh94jmc71.jpg?width=689&amp;format=pjpg&amp;auto=webp&amp;s=670a616531c82de158c12f7292c0ceb7eb9ff51a)\n\n&amp;#x200B;\n\nThe balance sheet is similarly boring; all quite healthy and acceptable.\n\n&amp;#x200B;\n\n[a balance sheet](https://preview.redd.it/4rfr4z55jmc71.jpg?width=1232&amp;format=pjpg&amp;auto=webp&amp;s=d4b4666c65c4c731bb5bc95d0caf457c15451f88)\n\n&amp;#x200B;\n\nPeople in the US are eating less hummus, instead the home water purifier business in China is increasing thanks to the local partner Haier. The coffee unit is suffering from the weak Brazilian currency. bla bla bla.\n\n&amp;#x200B;\n\n[as if anyone is still reading at this point](https://preview.redd.it/hq7lrv88jmc71.jpg?width=1465&amp;format=pjpg&amp;auto=webp&amp;s=ca98cc62bda48219952ca963b5d5ce1b01523593)\n\n**Stock valuation:**\n\nWith a PE of \\~19 the stock is neither cheap nor expensive. Kinda average to its peers and the industry and fair considering business, outlook and balance sheet.\n\n&amp;#x200B;\n\nSo why tf should I look for a way to trade on the TASE just for this boring ass company?\n\n...\n\n&amp;#x200B;\n\n# THE KITCHEN\n\n&amp;#x200B;\n\nFor several years Strauss Group is running [a FoodTech incubator](https://www.thekitchenhub.com/) for start-ups with promising business concepts. So far this has been very successful - multiple projects completed the incubator as autonomous companies.\n\n&amp;#x200B;\n\nThe usual process is that Strauss provides the production equipment and labs, along with a budget for reseach while bringing together experienced industry veterans, university researchers and sponsors.\n\nThe final products can then be connected to global partners (Pepse, Mitsubishi, Haier, Danone, to nam a few...) for distribution and potentially local mass production. Symbiosis  with internal projects would also be logical and sensible - however in most cases this is not a primary goal.\n\nIn some cases Strauss will also be funding later rounds if a project requires further capital. Unfortunately there is no overview available over current investments. It is also uncertain what general strategy Strauss is following with these investments; IR only mentions that this is decided on a case-to-case basis.\n\n&amp;#x200B;\n\nPrjects currently on-going:\n\n&amp;#x200B;\n\n[lab-grown meat, vegan eggs, sugar reduces juice, etc...](https://preview.redd.it/g93sz8lajmc71.png?width=1172&amp;format=png&amp;auto=webp&amp;s=27cbfa410ea7a32b52a32c17b00e60533fcf5ea4)\n\n&amp;#x200B;\n\nEspecially Aleph Farms is some hot stuff in my opinion. They just completed round B of funding and collected $118 million in total now. A bio 3D printing process allows production of Ribeye steaks but can also be used for chicken, pork, lamb, etc. in all sorts of structures, while the competition often can only produce faux mince. As it's typical for in-vitro-meat, only a small cell sample the size of a sesame seed is required to manufacture many thousand steaks.\n\n&amp;#x200B;\n\nThe development is advanced to a late stage currently the start-up is busy scaling for mass production. And while they are doing that, they casually grilled [a steak in space](https://www.aleph-farms.com/aleph-zero). The expected time to market is planned for next year.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Investmentthesis:**\n\n My positions: 214 shares @ 8958 (ILS)\n\nOnce I have more cash available I will most likely increase my position. With the solid core business I see the downside limited while the potential upside is quite sexy due to the incubator with its investments in many interesting start-ups. This is a longterm investment, unless the fundamentals change along the way.\n\n&amp;#x200B;\n\n[pls no ban](https://preview.redd.it/4eb7kyddjmc71.jpg?width=395&amp;format=pjpg&amp;auto=webp&amp;s=fc42307813749cc0f8ccf75e210af908a7d3cf67)\n\n&amp;#x200B;\n\n**Bearcases:**\n\n* Some Rabbi decides the Aleph meat is not kosher or the Imams say it's not halal. This applies to other modern food technologies in research.\n* The competition finds better or cheaper methods to manufacture the products the start-ups are developing.\n* Technial issues at some of the primary start-ups\n* Strauss Groups stake in the start-ups are to small to move the stock price in a relevant manner - the exact holdings are unknown at this point.\n* Strauss Group paperhands their stakes in promising projects and sell them early on... the exact strategy for each project is currently not publicly known.\n\n&amp;#x200B;\n\nFrom researching I know some more bits and bobs, I just cba writing more. If you have questions, ask and I'll try and answer them.",
        "subreddit": "wallstreetbets",
        "title": "Schalom אחים, here is my Strauss Group $STRS.TA DD for you Gois",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ooy2vp/schalom_אחים_here_is_my_strauss_group_strsta_dd/",
        "created": 1626927460.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625146568,
        "id": "oblzj8",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "Posting here to offer a little perspective on what some apes saw as a quick hype play.\n\nIt was evident that PSFE had finally found bottom last week after months of daily short attacks.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE long-term.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for the diamond handed apes who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\nhttps://preview.redd.it/1axvo1n3sl871.png?width=475&amp;format=png&amp;auto=webp&amp;s=ca4bb0678156d9737029ff6a3075728bd54e8940\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n&amp;#x200B;\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) see fintel or other source for institutional ownership. (bot mods won't allow link)\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)   [https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi](https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi)\n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "wallstreetbets",
        "title": "My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oblzj8/my_highconviction_bet_on_paysafe_psfe/",
        "created": 1625175368.0
    },
    {
        "author": "Coldchilln",
        "created_utc": 1625172949,
        "id": "obv0zo",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "Forgive my newbie question, but why not invest in 5-10  large companies such as Microsoft, apple, visa as opposed to index funds or ETFs? \n\nMost ETFs have these in their top 10 holdings anyways, so the risk profile to may increase due to less diversification but these companies are at low risk of failure to begin with in the long run anyways. Wouldn't this portfolio outperform most ETFs/index funds?",
        "subreddit": "stocks",
        "title": "Investing in large well established corporations vs index funds",
        "url": "https://www.reddit.com/r/stocks/comments/obv0zo/investing_in_large_well_established_corporations/",
        "created": 1625201749.0
    },
    {
        "author": "Remarkable-Winter348",
        "created_utc": 1625185785,
        "id": "obyzvi",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "The \"bounce\" area projected for [$WISH](https://twitter.com/search?q=%24WISH&amp;src=cashtag_click) based on Elliott Wave Theory was tested during Thurs trading. Friday we should see a reversal confirmation if this area holds. Our chart below and this video from another analyst is for you.  [(1) Elliot Wave Theory $WISH 7-1-21 - YouTube](https://www.youtube.com/watch?v=ZTwHSd4F-6w&amp;t=33s) \n\nTwitter Follow link:   [https://twitter.com/AcceleronR/status/1410754829316624386?s=20](https://twitter.com/AcceleronR/status/1410754829316624386?s=20) \n\nhttps://preview.redd.it/j82z2ubw1p871.png?width=1627&amp;format=png&amp;auto=webp&amp;s=b8043f91dfad47cf85b15b39f854395385866772",
        "subreddit": "StockMarket",
        "title": "$WISH may see strong bullish reversal based on Elliott Wave Theory",
        "url": "https://www.reddit.com/r/StockMarket/comments/obyzvi/wish_may_see_strong_bullish_reversal_based_on/",
        "created": 1625214585.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625147803,
        "id": "obmdbu",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "It was evident that PSFE had finally found bottom last week.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE for a long time.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for investors with a longer view who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) [https://fintel.io/so/us/psfe](https://fintel.io/so/us/psfe).\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)  Global Capital link removed due to forbidden word in the url. \n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "stocks",
        "title": "Connecting the Dots: My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/stocks/comments/obmdbu/connecting_the_dots_my_highconviction_bet_on/",
        "created": 1625176603.0
    },
    {
        "author": "robinXw",
        "created_utc": 1625132280,
        "id": "obi98z",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I have seen ppl complaining about anything related to such ticker posts are immediately deleted or banned, and ppl saying it’s a distraction from HF. \n\nI want to know if there is a solid evidence or DD that I can read? If the reason is solely about concentrate limited retails power on GME and AMC, then we should automatically delete any other tickers posts right?\n\nI do agree if retails focus buying power on certain stock will make it stronger, but it’s not possible to unite everyone in this sub to just buy one stock, that would be manipulation. \n\nPersonally holding all three of them. Love to learn and open discussion.",
        "subreddit": "wallstreetbets",
        "title": "Can anyone explain why $C L O V is banned here? Personally holding GME and AMC and it. Would love to learn",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obi98z/can_anyone_explain_why_c_l_o_v_is_banned_here/",
        "created": 1625161080.0
    },
    {
        "author": "wetdirtkurt",
        "created_utc": 1625153958,
        "id": "oboelf",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[https://www.youtube.com/watch?v=w6BxUH9tZAE&amp;t=66s&amp;ab\\_channel=WetDirtKurt](https://www.youtube.com/watch?v=w6BxUH9tZAE&amp;t=66s&amp;ab_channel=WetDirtKurt)\n\n&amp;#x200B;\n\nConoco Phillips had their annual meeting yesterday and hinted that they are aware of nearby prospects and leads that they may be interested in. The video connects some dots together between the two companies.",
        "subreddit": "pennystocks",
        "title": "Wondering what is going on with $EEENF - 88 Energy? Watch this 4-minute video.",
        "url": "https://www.reddit.com/r/pennystocks/comments/oboelf/wondering_what_is_going_on_with_eeenf_88_energy/",
        "created": 1625182758.0
    },
    {
        "author": "sschmidt17",
        "created_utc": 1625172296,
        "id": "obust6",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I was looking at the recent IPO of Sentinel One ($S) and wondered how such a new IPO got a single letter ticker.  I started looking at every letter in the alphabet and noticed most of them have had pretty good years so far in 2021.  If you've ever wondered how an equally weighted portfolio in each single letter stock ticker would perform, I did the work for you:\n\n&amp;#x200B;\n\n|Ticker|Company|2021 YTD Performance|\n|:-|:-|:-|\n|A|Agilent Technologies|25.90%|\n|B|Barnes Group|2.60%|\n|C|Citi Group|16.51%|\n|D|Dominion Energy|0%|\n|E|Eni SpA|18.50%|\n|F|Ford|68.23%|\n|G|Genpact|10.80%|\n|H|Hyatt Hotels|7.01%|\n|I|N/A||\n|J|Jacobs Engineering|24.92%|\n|K|Kellogg|\\-7.70%|\n|L|Loews|24.40%|\n|M|Macy's Inc.|56.19%|\n|N|N/A||\n|O|Realty Income Corp|9.40%|\n|P|N/A||\n|Q|N/A||\n|R|Ryder System Inc.|52.37%|\n|S|Sentinel One|\\-5.20%|\n|T|AT&amp;T |2.20%|\n|U|Unity Software|\\-31.65%|\n|V|Visa |7.60%|\n|W|Wayfair |33.30%|\n|X|U.S. Steel |10.44%|\n|Y|Alleghany Corp|12.90%|\n|Z|Zillow |7.55%|\n||Average|15.05%|\n\n&amp;#x200B;\n\nFor comparison, SPY is up 15.70% this year.",
        "subreddit": "stocks",
        "title": "The ABC's Portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/obust6/the_abcs_portfolio/",
        "created": 1625201096.0
    },
    {
        "author": "Fancy_Wolverine_5759",
        "created_utc": 1625137397,
        "id": "objg2x",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[https://www.youtube.com/watch?v=cMfEKIZyv0A&amp;t=4s](https://www.youtube.com/watch?v=cMfEKIZyv0A&amp;t=4s)\n\nHad a shaky week, but seems to be on track?",
        "subreddit": "Wallstreetbetsnew",
        "title": "Any ideas on how high TILRY will climb?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/objg2x/any_ideas_on_how_high_tilry_will_climb/",
        "created": 1625166197.0
    },
    {
        "author": "MPHdoge",
        "created_utc": 1625133820,
        "id": "obilzk",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "\"Who gets the $12.6M in restitution from the Robinhood settlement\" https://finance-yahoo-com.cdn.ampproject.org/v/s/finance.yahoo.com/amphtml/news/who-gets-the-126-m-in-restitution-from-the-robinhood-settlement-170712587.html?amp_gsa=1&amp;amp_js_v=a6&amp;usqp=mq331AQIKAGwASCAAgM%3D#amp_tf=From%20%251%24s&amp;aoh=16251334818883&amp;csi=0&amp;referrer=https%3A%2F%2Fwww.google.com&amp;ampshare=https%3A%2F%2Ffinance.yahoo.com%2Fnews%2Fwho-gets-the-126-m-in-restitution-from-the-robinhood-settlement-170712587.html",
        "subreddit": "wallstreetbets",
        "title": "\"Who gets the $12.6M in restitution from the Robinhood settlement\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obilzk/who_gets_the_126m_in_restitution_from_the/",
        "created": 1625162620.0
    },
    {
        "author": "MisterInvicta",
        "created_utc": 1625146045,
        "id": "obltwg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "TLDR[:](https://www.canoo.com/canoo/) Shorts have spent at least $100M adding 10.1M million shares worth of SI over the past 19 days while trying to drive the stock price down, but it's not fucking working. \n\nCanoo keeps releasing [good news](https://www.reuters.com/business/autos-transportation/canoo-picks-oklahoma-site-plant-it-intends-build-ceo-2021-06-17/), shorts keep digging themselves into a deeper hole, calls keep printing intraday and I'm more confident than ever that I'm gonna git rich.\n\n\\---------\n\nFirst, the Ortex data speaks for itself:\n\n* FLOAT: 99.3M\n* SI: 39.4M shares 👀🚨 || \\[+10.1M since 6/11\\] 😳🤯\n* DTC: 8.3 ||  \\[+3 since 6/11\\]\n* UTIL: 98.9% 😱🚨\n* EST COST BASIS: $10.30 || \\[**-**.25 since 6/11\\]\n* CLOSING PRICE YESTERDAY: $9.94\n\nCheck out the chart below for raw data. Didn't include May's data but SI hovered around 26M-27M shares the entire month, then, all the sudden, on or about June 11th it started sky-rocketing -- from 29.3M shares sold short to 38.7M ... in less than three weeks 👀🚨\n\n[THEY SPENT AT LEAST $100M IN THE PAST 19 DAYS ... TO DIG THEMSELVES DEEPER 👀](https://preview.redd.it/ctarecabrl871.png?width=992&amp;format=png&amp;auto=webp&amp;s=5aad57a9802442cf3446657ea8da8e5a750ac33b)\n\nSecond, the price action between June 11th and now has been remarkably consistent, giving wrinkle brains who've been playing calls remarkably consistent returns during that time. Don't you want to be a wrinkle brain?\n\n[CALLS PRINTED ON 6\\/15, 6\\/16 AND 6\\/17, BUT SMART APES MAKE MONEY ALL MONTH](https://preview.redd.it/bbbxy40u3j871.png?width=712&amp;format=png&amp;auto=webp&amp;s=2a3771328fedbd3752474d205523bf3f4fe76713)\n\n[AVG OPEN OF $9.64 IN JUNE -- INTRADAY POPS HAVE TREATED CALL HOLDERS WELL](https://preview.redd.it/0x04m9nz0j871.png?width=2391&amp;format=png&amp;auto=webp&amp;s=8aa57c8e82f775f858f663b1d500a8f8511c6833)\n\n\\---------\n\n**Previous GOEV Posts**\n\n[$GOEV up 31% over the past five days, up 20% today and another 9.6% AH ... looking real squeezy 👀📈🚀](https://www.reddit.com/r/wallstreetbets/comments/nvj5m8/goev_up_31_over_the_past_five_days_up_20_today/)\n\n[Will June, July and August be GOEV’s springboard back to the promised land? Here's a list of catalysts on the horizon.](https://www.reddit.com/r/goev/comments/nt2rul/will_june_july_and_august_be_goevs_springboard/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\n\\---------\n\n**If you want info on why GOEV is actually a really attractive long-term play**\n\n[VIDEO: INVESTOR DAY HIGHLIGHTS | ELECTRIC VEHICLES | CANOO](https://www.youtube.com/watch?v=LYGPOqhH9P8)\n\n[Car Wars Episode EV - A CANOO Hope - Why $GOEV can be a tremendous play for both long and short term gains.](https://www.reddit.com/r/wallstreetbets/comments/o0k89j/car_wars_episode_ev_a_canoo_hope_why_goev_can_be/)\n\n[Look: GOEV's Oklahoma facility is massive. Hard not to get excited about the future.](https://www.reddit.com/r/canoo/comments/oajk36/look_goevs_oklahoma_facility_is_massive_hard_not/)\n\n[GOEV (Canoo) - The misunderstood ticker and why you should watch it](https://www.reddit.com/r/stocks/comments/o4l227/goev_canoo_the_misunderstood_ticker_and_why_you/)\n\n[Canoo ($GOEV) – The EV Manufacturer that’s ready to take shorts for a ride (healthy balance sheet, 30% short interest, 0.15% float left available to borrow at 24.5% fee, up to 11 days to cover - upcoming investor conference and Russel 3000 inclusion catalysts could send this flying)](https://www.reddit.com/r/wallstreetbets/comments/o0bhqk/canoo_goev_the_ev_manufacturer_thats_ready_to/)\n\n[BONUS IMAGE: STUPID SEXY SEDAN OTW 👀😍🚀 \\[h\\/t u\\/lsjsl\\]](https://preview.redd.it/b6pxduxpjl871.jpg?width=624&amp;format=pjpg&amp;auto=webp&amp;s=a2495ba1a5d5ea2d78e3310252076cc00b603d67)",
        "subreddit": "wallstreetbets",
        "title": "$GOEV UPDATE: Shorts R Fuk Pt2, Calls Have Been Printing, Still Looking Real Squeezy 👀📈🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obltwg/goev_update_shorts_r_fuk_pt2_calls_have_been/",
        "created": 1625174845.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625145621,
        "id": "oblp63",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Posting here to offer a little perspective on what some apes saw as a quick hype play.\n\nIt was evident that PSFE had finally found bottom last week after months of daily short attacks.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE long-term.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for the diamond handed apes who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\nhttps://preview.redd.it/2tce80abpl871.png?width=475&amp;format=png&amp;auto=webp&amp;s=32e78dde014d5edf387cd4f9f603fceb6ab6c4c7\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n&amp;#x200B;\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) [https://fintel.io/so/us/psfe](https://fintel.io/so/us/psfe).\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)   [https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi](https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi)\n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "wallstreetbets",
        "title": "My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oblp63/my_highconviction_bet_on_paysafe_psfe/",
        "created": 1625174421.0
    },
    {
        "author": "robinXw",
        "created_utc": 1625131616,
        "id": "obi41n",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I have seen ppl complaining about anything related to such ticker posts are immediately deleted or banned, and ppl saying it’s a distraction from HF. Is there a solid evidence or DD that I can read? If the reason is solely about concentrate limited retails power on GME and AMC, then we should automatically delete any other tickers posts right?\n\nPersonally holding all three of them.",
        "subreddit": "wallstreetbets",
        "title": "Can someone explain to me why $C L O V got banned in this sub? Personally holding AMC and GME at same time",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obi41n/can_someone_explain_to_me_why_c_l_o_v_got_banned/",
        "created": 1625160416.0
    },
    {
        "author": "Ameritraiden",
        "created_utc": 1625177593,
        "id": "obwkgj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "https://preview.redd.it/qhiay5vyco871.jpg?width=507&amp;format=pjpg&amp;auto=webp&amp;s=79d9025b323d94e8d83be49354d49f4083dce2e7\n\nBaby investor v poor here - I'm not rich enough to be eligible to trade on margin yet so I sold my Apple stock and reinvested it ALL in discount CIDM. \n\nI come on here excited to see what other geniuses are buying discount CIDM - no posts for 5 months? Y'all sleeping on my bb CIDM.\n\nSEXY FACTS\n\n* Just named a COO for India - huge market there for streaming, \n* They're on fucking Roku\n* They have a Bob Ross channel\n* Just launched The Country Network to take the 51-market OTT channel to streaming \n* Just launched The Elvis Presley Channel \n* They have fucking Yu-Gi-Oh - in English AND Spanish - through Pluto TV - also launched a streaming only new season, so they're clearly getting into content making\n\nThe future is personalized and CIDM is buying up all the loyal fan favorites \n\nAlso fuck Netflix",
        "subreddit": "wallstreetbets",
        "title": "Sold my $AAPL to buy more $CIDM today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obwkgj/sold_my_aapl_to_buy_more_cidm_today/",
        "created": 1625206393.0
    },
    {
        "author": "daxzetina",
        "created_utc": 1625164910,
        "id": "obs99u",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "TLDR: Popular Inc. is a regional bank based out of Puerto Rico, they have great financials, I expect good earnings caused by the rise in prices of the housing market and the influx of wealth to the island within the last 14 months.\n\n# Basics\n\n Company Name: Popular, Inc. \n\nTicker Symbol: BPOP \n\nExchange: Nasdaq \n\nSector: Financial Services \n\nIndustry: Regional Banks \n\nStock Price\\*: $76.36\n\n USD Consensus Fair Value Estimate: $129.31 \n\n Headquarters: San Juan, Puerto Rico \n\nMarket Cap: $6.6 Billion (“Large Core” with both growth and value characteristics) \n\n Company Description: Popular, Inc. is the leading financial institution by both assets and deposits in Puerto Rico and ranks among the top 50 U.S. bank holding companies by assets. Founded in 1893, Banco Popular de Puerto Rico, Popular’s principal subsidiary, provides retail, mortgage, and commercial banking services in Puerto Rico and the U.S. Virgin Islands. Popular also offers in Puerto Rico auto and equipment leasing and financing, investment banking, broker-dealer, and insurance services through specialized subsidiaries. In the mainland United States, Popular provides retail, mortgage and commercial banking services through its New York-chartered banking subsidiary, Popular Bank, with branches located in New York, New Jersey, and Florida. \n\n&amp;#x200B;\n\n#  Industry Overview &amp; Competitive Positioning \n\nBPOP Returns v. Industry Return: BPOP exceeded the US Banking industry, which returned 68.9% over the past year. BPOP returned 108.3% during the same timeframe. \n\nBPOP Returns v. Market Returns: BPOP exceeded the US Market which returned 45.5% over the past year. BPOP returned 108.3% during the same timeframe. \n\nVolatility: Over the past 5 years, BPOP (1.25 Beta) has been more volatile than the average market (1.0 Beta), and less volatile than the US Banking industry (1.38 Beta). \n\nCompetitors: Compared to competitors including OFG Bancorp (OFG), First Bancorp North Carolina (FBNC), Community Bank System Inc (CBU), and US Bancorp (USB), Popular, Inc. has a lower price to earnings ratio (P/E), indicating that BPOP may be underpriced in the short-term \n\n&amp;#x200B;\n\n#  Valuation &amp; Financial Analysis \n\nShare Price v. Fair Value: Considering BPOP’s current stock price of $76.36, BPOP may be undervalued based on the cashflows the company is expected to generate in the future. Trading below fair value indicates possible upside potential.\n\n Price to Earnings Ratio: Measuring the current share price relative to BPOP’s earnings per share, the company’s PE of approximately 8.61 is lower than the Industry (12) and Market (19.7), indicating BPOP is possibly undervalued. While not a measure of future performance, BPOP’s earnings growth has exceeded both the overall industry and market over the past year. Factoring BPOP’s forecasted annual earnings growth and forecasted annual revenue growth, both metrics may lag the overall industry and market over the next 3 years. \n\nDebt to Equity Analysis: With a Debt/Equity Ratio of 22.7% (as of March 30, 2021), there have been significant improvements since July 29, 2014 when BPOP had a Debt/Equity Ratio of 105.4%, indicating increased assets and reduced liabilities during that timeframe. Additionally, with an Assets to Equity Ratio of 11.3, BPOP is financing its operations through a moderate level of debt versus wholly-owned funds.\n\n Dividends: With an annual dividend amount of $1.80 per share and a dividend yield of 2.29%, BPOP’s dividend yield is in line with the market median of 2.26%. While dividend payments have been stable and increased for 5 years in a row, BPOP has only  paid a dividend for 6 consecutive years. With a low payout ratio of approximately 18.4%, BPOP’s dividend payments are well covered by earnings and future payouts to shareholders are forecasted to be well covered in the next 3 years. \n\n&amp;#x200B;\n\nPositions:\n\n4 10/15/2021 100 C\n\n10 10/15/2021 110 C\n\n5 10/15/2021 120 C\n\n5 1/21/2022 125 C\n\n2 7/16/2021 85 C\n\n5 7/16/2021 90C\n\n&amp;#x200B;\n\nAny additional thoughts are appreciated, hope this helps someone out",
        "subreddit": "stocks",
        "title": "Popular Inc. (BPOP) Undervalued Regional Bank",
        "url": "https://www.reddit.com/r/stocks/comments/obs99u/popular_inc_bpop_undervalued_regional_bank/",
        "created": 1625193710.0
    },
    {
        "author": "unfonfortable",
        "created_utc": 1625173604,
        "id": "obv972",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Many investors incorporate analysts' ratings into their due diligence process. However, they can be a huge conflicts of interest, as the investment banks are allowed to give recommendations on investments they own. It's very easy for them to buy a position and then later go on news shows, like CNBC and Cramer, to tell the public that they should be buying the stock, too. The analysts' recommendations hold sway with the public since they are the \"experts\" who work at big, prestigious firms, like Bank of America, Wells Fargo, and Goldman Sachs.\n\n[Here is a clip from a Frontline documentary on the 2000 dot-com crash,](https://www.youtube.com/watch?v=V5iE-4JsUms&amp;t=1675s) where analysts admitted to going on the news to pump up and be \"cheerleaders\" for companies that paid their firm to handle their IPO's. As you recall, the dot-com crash was largely caused by people being euphoric about any company going IPO. This clip illustrates the investment banks' role in the euphoria and how they do not have your best interests in mind.\n\nPersonally, it shocks me that investment banks are able to provide recommendations and price targets without any kind of oversight or regulations, as they can easily just issue positive opinions to pump and dump their own investments.",
        "subreddit": "stocks",
        "title": "Reminder: Don't blindly trust analysts' ratings. They can issue positive recommendations to pump their own investments.",
        "url": "https://www.reddit.com/r/stocks/comments/obv972/reminder_dont_blindly_trust_analysts_ratings_they/",
        "created": 1625202404.0
    }
]