[
    {
        "author": "Shandowarden",
        "created_utc": 1628071211,
        "id": "oxpems",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "As title suggests, looking into CS sector and wrapping my thoughts around NET, Fortinet, Crowdstrike, companies like that. But I already own some of NET, sadly it is the only CS sector stock and takes only 5% of my portfolio. Looking to increase to around 10%-12,5% as I heavily believe in long-term vitality.\nHowever, all of these already seem to have ran up so high past these 6 months - any alternatives?\nAlso looking at Palo Alto N.",
        "subreddit": "stocks",
        "title": "Any Cybersecurity stocks that are yet to breakout and did not explode?",
        "url": "https://www.reddit.com/r/stocks/comments/oxpems/any_cybersecurity_stocks_that_are_yet_to_breakout/",
        "created": 1628100011.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1630043782,
        "id": "pchc8j",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "As the title said: Give me your top cybersecurity stocks that 6 months from now will outperform the rest, and in 6 months I will revisit this post and make a comparison photo saying the befor and after results. \n\nThe two stocks I am currently in are Crowdstrike and FTNT. But for those of us not well versed in \"cyber\" terminology, it is very difficult to disect between the others which is necessarily the best one.\n\nI'm not necessarily looking for the cyber terminology, but more on a fundamental level in terms of debt, profit and well run CEO's who would be the safest stock picks to pick from. In terms of : ZS, S, PANW, NLOK, etc",
        "subreddit": "stocks",
        "title": "Ok folks: Give me your top cybersecurity stocks that 6 months from now will outperform the rest.",
        "url": "https://www.reddit.com/r/stocks/comments/pchc8j/ok_folks_give_me_your_top_cybersecurity_stocks/",
        "created": 1630072582.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1630355927,
        "id": "peqn8g",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, August 30, 2021**\n\nStocks traded mixed, with the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) extending gains from last week to reach new intraday record highs. On the other hand, the Dow Jones (DIA) was driven slightly lower due to weakness in financial and energy stocks while the Russell 2000 (IWM), which tracks the performance of small-caps, broke its winning streak to close 0.41% lower. Market participants continue to digest the Federal Reserve’s annual Jackson Hole Symposium and a key speech by Chairman Jerome Powell on Friday. Looking ahead, market participants await a busy week for new economic data, with the August Jobs Report due out on Thursday.\n\nDespite hawkish statements by other Federal Reserve members in the July meeting minus, in his speech Powell remained highly accommodative, suggesting he was more inclined to wait to see further progress in the economy before tapering QE, especially in light of surging infections due to the Delta variant. Powell said, “At the FOMC's recent July meeting, I was of the view, as were most participants, that if the economy evolved broadly as anticipated, it could be appropriate to start reducing the pace of asset purchases this year. The intervening month has brought more progress in the form of a strong employment report for July, but also the further spread of the Delta variant. We will be carefully assessing incoming data and the evolving risks. Even after our asset purchases end, our elevated holdings of longer-term securities will continue.”\n\nPowell once again urged caution since the economic recovery in the market is still undergoing, saying effects from an ill-timed policy shift would “arrive after the need has passed” and “could be particularly harmful. Here is the full quote, “The main influence of monetary policy on inflation can come after a lag of a year or more. If a central bank tightens policy in response to factors that turn out to be temporary, the main policy effects are likely to arrive after the need has passed. The ill-timed policy move unnecessarily slows hiring and other economic activity and pushes inflation lower than desired. Today, with substantial slack remaining in the labor market and the pandemic continuing, such a mistake could be particularly harmful. We know that extended periods of unemployment can mean lasting harm to workers and to the productive capacity of the economy.”\n\nRegarding inflation, Powell once again reiterated the need for caution but suggested he was prepared to act if incoming data deems it appropriate. He said, “Central banks have always faced the problem of distinguishing transitory inflation spikes from more troublesome developments, and it is sometimes difficult to do so with confidence in real time. At such times, there is no substitute for a careful focus on incoming data and evolving risks. If sustained higher inflation were to become a serious concern, the Federal Open Market Committee (FOMC) would certainly respond and use our tools to assure that inflation runs at levels that are consistent with our goal. Incoming data should provide more evidence that some of the supply–demand imbalances are improving, and more evidence of a continued moderation in inflation, particularly in goods and services prices that have been most affected by the pandemic. We also expect to see continued strong job creation. And we will be learning more about the Delta variant's effects.”\n\nHere is the full transcript from the speech, I encourage everyone to read it fully. It’s not very long and is extremely insightful to see exactly what the main monetary policy maker thinks of the current state of the economy\n\n[https://www.federalreserve.gov/newsevents/speech/powell20210827a.htm](https://www.federalreserve.gov/newsevents/speech/powell20210827a.htm)\n\nRegarding Powell’s speech, BTIG Chief Equity and Derivatives Strategist Julian Emanuel said, “Powell \"did three things very, very right, and obviously the markets are celebrating that. First was keeping the speech succinct. Second thing he did risht is, he sent the rest of the Fed governors out over the prior four weeks to basically tell us all that the taper was coming. He merely had to reiterate, and reiterate softly, that message, which he did very effectively. The third thing is he really tackled inflation head on. He knew that’s been the preoccupation of the markets for these last couple of months. While he didn’t give any new real evidence as to why he views inflation as transitory, he did cite the ongoing moderation in commodity prices and the view that past history would indicate that inflation is likely to be temporary.” \n\nLooking ahead, market participants are set to receive more data on the strength of the labor market recovery this week, with the Labor Department's August jobs report due out on Friday. Consensus economists are looking to see that 750,000 payrolls came back during the month, representing an eighth straight month of gains but a slight pullback from July's 943,000.\n\n**Highlights**\n\n* Shares of buy-now-pay-later company Affirm (AFRM) gapped up more than 40% after announcing partnership with Amazon (AMZN) that will let customers buy items of $50 or more in installments. \n* Shares of travel and leisure stocks slid after the European Union issued a new recommendation to restrict nonessential travel from the US due to surging coronavirus Delta cases. Here is the recommendation: [https://www.consilium.europa.eu/en/press/press-releases/2021/08/30/covid-19-council-removes-5-countries-and-one-entity-territorial-authority-from-the-list-of-countries-for-which-travel-restrictions-should-be-lifted/](https://www.consilium.europa.eu/en/press/press-releases/2021/08/30/covid-19-council-removes-5-countries-and-one-entity-territorial-authority-from-the-list-of-countries-for-which-travel-restrictions-should-be-lifted/)\n* July pending home sales unexpectedly dropped, according to data from the National Association of Realtors, likely due to high housing prices. Sales dipped 1.8% in July compared to June, nearly matching June’s 2% decline. Economists were looking for a gain of 0.3%\n* McDonald’s (MCD) sent a notice to instruct franchisees on steps they should take to re-close indoor dining in areas where the Delta variant is rapidly spreading. Originally, barring any COVID resurgence, McDonald’s planned to fully reopen indoor dining by Labor Day (Sept 6)\n* Apple (AAPL) announced changes to its App Store regulations that will allow software developers to tell customers how to pay for services outside of Apple’s ecosystem, part of a proposed settlement of a class-action lawsuit. The shift will make it easier for some apps to steer customers toward other forms of payment, rather than using the App Store, where Apple charges a commission of up to 30%.\n* ESPN, which is owned by Disney (DIS), is reportedly seeking to license its brand to major sports-betting companies for at least $3 billions over several years, according to sources familiar with the matter as reported by the Wall Street Journal. On offer is the right for a suitor to use the ESPN name for branding purposes and potentially rename its sportsbook after ESPN. The sports-media giant has held talks with players that own major sportsbooks, including casino operator Caesars Entertainment (CZR)[ ](https://www.wsj.com/market-data/quotes/CZR?mod=chiclets)and DraftKings (DKNG) the sources said. ESPN has existing marketing partnerships with both companies already. This is huge for the sports-betting industry, will be closely following this story.\n* Amazon-backed (AMZN) electric vehicle maker Rivian is reportedly seeking a $70-$80 billion valuation in its upcoming IPO. The company has an agreement to produce electric vans for Amazon and a pickup truck for consumers. In my humble opinion, even being backed by Amazon, this valuation is insane.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Affirm (AFRM) with a host of target raises following the Amazon news. Average price target $120 at Buy. Stock currently around $99\n* Albemarle (ALB) target raised by Cowen from $180 to $260 at Outperform. Stock currently around $237\n* Asana (ASAN) target raised by Jefferies from $65 to $90 at Buy. Stock currently around $78\n* Crowdstrike (CRWD) with a host of target raises. Average price target $320 at Outperform. Stock currently around $286\n* DocuSign (DOCU) target raised by Wedbush from $290 to $340 at Outperform. Stock currently around $303\n* Fortinet (FTNT) target raised by Wedbush from $310 to $350 at Outperform. Stock currently around $319\n* Eli Lilly (LLY) target raised by Cowen from $250 to $300 at Outperform. Stock currently around $262\n* Workday (WDAY) with two target raises. Stock currently around $270\n   * Wolfe Research from $270 to $300 at Outperform\n   * Loop Capital from $320 to $340 at Buy\n* Zscaler (ZS) target raised by Wedbush from $240 to $320 at Outperform. Stock currently around $278\n\n“Without labor nothing prospers.” - Sophocles",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, August 30, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/peqn8g/here_is_a_market_recap_for_today_monday_august_30/",
        "created": 1630384727.0
    },
    {
        "author": "Preyansh91",
        "created_utc": 1628548814,
        "id": "p1cbnr",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Sometimes I dont understand how analysts work. It is pretty hard to believe that some cybersecurity stocks like ZS and FTNT just go up on hype and leader stocks like PANW are still in the undervalued range even after crushing earnings and showing a solid growth every year. Does wallstreetbets even think about such amazing stocks like Palo Alto Networks and why they remain undervalued and dont get the attention and hype needed?\n\nPANW has been consistently showing &gt; 20% profits since last 6 quarters with growing sales in cloud security space and also been steadily adding big customers in its portfolio. What are some of the reasons that such stocks do not get the kind of hype that other growth stocks like Zscaler, Fortinet and Crowdstrike have been getting since last couple of years? The company has accelerated its growth during the pandemic as well and still has failed to show any real gains during 2021. Any thoughts on this?",
        "subreddit": "wallstreetbets",
        "title": "Why do solid stocks like PANW remain undervalued and other shitty stocks go up in the cybersecurity space?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1cbnr/why_do_solid_stocks_like_panw_remain_undervalued/",
        "created": 1628577614.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1630043797,
        "id": "pchcc8",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "As the title said: Give me your top cybersecurity stocks that 6 months from now will outperform the rest, and in 6 months I will revisit this post and make a comparison photo saying the befor and after results. \n\nThe two stocks I am currently in are Crowdstrike and FTNT. But for those of us not well versed in \"cyber\" terminology, it is very difficult to disect between the others which is necessarily the best one.\n\nI'm not necessarily looking for the cyber terminology, but more on a fundamental level in terms of debt, profit and well run CEO's who would be the safest stock picks to pick from. In terms of : ZS, S, PANW, NLOK, etc",
        "subreddit": "investing",
        "title": "Ok folks: Give me your top cybersecurity stocks that 6 months from now will outperform the rest.",
        "url": "https://www.reddit.com/r/investing/comments/pchcc8/ok_folks_give_me_your_top_cybersecurity_stocks/",
        "created": 1630072597.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628887632,
        "id": "p3tt0f",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, August 13, 2021**\n\nStocks rose modestly in another very choppy session, with the S&amp;P 500 (SPY) and Dow Jones (DIA) narrowly eking out fresh intraday record highs. The Nasdaq (QQQ) remain just a tick below its previous all-time high. Market participants continue to digest corporate earnings data and new economic reports.\n\nYesterday’s Weekly Unemployment report showed a third straight drop in filings, an encouraging sign that the recovery in the labor market continues. The report showed new unemployment claims coming in at 375,000, in-line with analyst estimates. Continuing claims came in at 2.866 million, better than the 2.9 million expected and 2.980 million the week prior. \n\nThe Labor Department reported Wednesday that its consumer price index (CPI) rose 5.4% in July from a year earlier, in line with June’s figure and matching the largest jump since August 2008. The government said CPI increased 0.5% on a month-over-month basis, matching a consensus forecast from economists surveyed by Dow Jones.\n\nCore CPI which excludes energy and food, rose by 0.3% last month, shy of a forecasted 0.4% increase and well below June’s rise of 0.9%. The core figure is up 4.3% over the last year, a slight deceleration from June’s 4.5%. Economists often consider core CPI to be a more reliable indicator since it’s insulated from the frequent swings in petroleum and food prices. It’s encouraging to see prices slowly moderate as the economic recovery continues to mature and pent-up consumer demand is increasingly released. \n\nOn the other hand, the producer price index (PPI) came in higher than expected. The producer price index for final demand increased at a 7.8% pace for the 12 months ended July, according to the Labor Department. The July print was faster than the 7.3% pace recorded in June and ahead of the 7.3% rate expected. Prices rose 1% in July, matching the increase in June and higher than the 0.6% increase expected. \n\nEarlier in the week, the US Senate passed the $1 trillion infrastructure deal in a surprisingly bipartisan manner. The bill appropriates money to rebuild the nation’s roads and bridges, fund climate initiatives, and bolster the nation’s broadband infrastrucutre. The vote, 69-30, was uncommonly bipartisan given the seeming contention the Republicans had for the initial drafts of the infrastructure bill. President Biden said, “This historic investment in infrastructure is what I believe you, the American people, want, what you’ve been asking for for a long, long time.” Mitch McConnell, who earlier in the year publicly declared “100% of my focus is on stopping this new administration” said of the deal, “I was proud to support today’s historic  bipartisan infrastructure and prove that both sides of the political aisle can still come together around common-sense solutions.” The bill appropriates money to rebuild the nation’s roads and bridges, bolster public transportation, fund climate initiatives, and bolster the nation’s broadband and 5G infrastrucutre. Here is a full list of what is included: [https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/](https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/)\n\n**Highlights**\n\n* Facebook Inc and Amazon.com Inc have asked the U.S. government for approval to operate a new undersea data cable between the Philippines and California after China Mobile agreed to exit the plan, a government agency said Friday. The companies told the Federal Communications Commission they intend to start commercial operation by late 2022 and said the new data connection will \"provide significant new capacity on routes where capacity demand continues to increase substantially each year.\"\n* Shares of Disney (DIS) gapped up 5% premarket before losing steam throughout the session to close roughly 1% higher\n* Tesla (TSLA) battery supplier CATL said it plans to sell $9 billion in stock to help boost manufacturing capacity. \n* So far, 91% of S&amp;P 500 components have reported actual second-quarter earnings, with 87% of these having topped Wall Street's estimates, according to data from FactSet. Assuming this proportion holds through the end of earnings season, it would mark the greatest share of earnings beats ever recorded in FactSet data spanning back to 2008. \n* Shares of Virgin Galactic (SPCE) fell once again after founder Sir Richard Branson disclosed that he sold more than 10 million shares for about $300 million. His remaining stake is 46 million shares, roughly $1.2 billion.\n* Prices for [U.S. imports increased](https://finance.yahoo.com/news/u-import-price-increases-slow-125204156.html) at a slower than expected rate in July, signaling that supply chain constraints may have begun to ease as the economic recovery continued. \n* Import prices rose 0.3% in July compared to June, Commerce Department data showed on Friday. This was well below the 0.6% rise expected, and slowed notably from June's 1.0% monthly increase. \n* \\*\\***Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Airbnb (ABNB) with four price target increases following earnings. Stock currently around $153\n   * JMP Securities from $180 to $190 at Outperform\n   * Wells Fargo from $200 to $210 at Overweight\n   * Needham &amp; Co from $194 to $200 at Buy\n   * HSBC from $210 to $219 at Buy\n* Analog Devices (ADI) target raised by Oppenheimer from $175 to $200 at Outperform. Stock currently around $170\n* Brookfield Asset Management (BAM) target raised by Royal Bank of Canada from $59 to $65 at Outperform. Stock currently around $55.50.\n* Walt Disney (DIS) with a host of target raises. Consensus price target $210 at Outperform. Stock currently around $180\n* Fortinet (FTNT) target raised by BTIG Research from $305 to $345 at Buy. Stock currently around $309\n* Simon Property Group (SPG) target raised by Morgan Stanley from $150 to $161 at Overweight. Stock currently around $134\n* Target (TGT) target raised by Tesley Advisory from $265 to $305 at Outperform. Stock currently around $261\n* Walmart (WMT) target raised by Stephens from $160 to $170 at Overweight. Stock currently around $150\n\n“It is the mark of an educated mind to be able to entertain a thought without accepting it.” - Aristotle",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, August 13, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p3tt0f/here_is_a_market_recap_for_today_friday_august_13/",
        "created": 1628916432.0
    },
    {
        "author": "Preyansh91",
        "created_utc": 1628548516,
        "id": "p1c8ek",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Sometimes I dont understand how analysts work. It is pretty hard to believe that some cybersecurity stocks like ZS and FTNT just go up on hype and leader stocks like PANW are still in the undervalued range even after crushing earnings and showing a solid growth every year. Does wallstreetbets even think about such amazing stocks like Palo Alto Networks and why they remain undervalued and dont get the attention and hype needed?",
        "subreddit": "wallstreetbets",
        "title": "Why do solid stocks like PANW remain undervalued and other shitty stocks go up in cybersecurity space?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1c8ek/why_do_solid_stocks_like_panw_remain_undervalued/",
        "created": 1628577316.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1630355947,
        "id": "peqngw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, August 30, 2021**\n\nStocks traded mixed, with the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) extending gains from last week to reach new intraday record highs. On the other hand, the Dow Jones (DIA) was driven slightly lower due to weakness in financial and energy stocks while the Russell 2000 (IWM), which tracks the performance of small-caps, broke its winning streak to close 0.41% lower. Market participants continue to digest the Federal Reserve’s annual Jackson Hole Symposium and a key speech by Chairman Jerome Powell on Friday. Looking ahead, market participants await a busy week for new economic data, with the August Jobs Report due out on Thursday.\n\nDespite hawkish statements by other Federal Reserve members in the July meeting minus, in his speech Powell remained highly accommodative, suggesting he was more inclined to wait to see further progress in the economy before tapering QE, especially in light of surging infections due to the Delta variant. Powell said, “At the FOMC's recent July meeting, I was of the view, as were most participants, that if the economy evolved broadly as anticipated, it could be appropriate to start reducing the pace of asset purchases this year. The intervening month has brought more progress in the form of a strong employment report for July, but also the further spread of the Delta variant. We will be carefully assessing incoming data and the evolving risks. Even after our asset purchases end, our elevated holdings of longer-term securities will continue.”\n\nPowell once again urged caution since the economic recovery in the market is still undergoing, saying effects from an ill-timed policy shift would “arrive after the need has passed” and “could be particularly harmful. Here is the full quote, “The main influence of monetary policy on inflation can come after a lag of a year or more. If a central bank tightens policy in response to factors that turn out to be temporary, the main policy effects are likely to arrive after the need has passed. The ill-timed policy move unnecessarily slows hiring and other economic activity and pushes inflation lower than desired. Today, with substantial slack remaining in the labor market and the pandemic continuing, such a mistake could be particularly harmful. We know that extended periods of unemployment can mean lasting harm to workers and to the productive capacity of the economy.”\n\nRegarding inflation, Powell once again reiterated the need for caution but suggested he was prepared to act if incoming data deems it appropriate. He said, “Central banks have always faced the problem of distinguishing transitory inflation spikes from more troublesome developments, and it is sometimes difficult to do so with confidence in real time. At such times, there is no substitute for a careful focus on incoming data and evolving risks. If sustained higher inflation were to become a serious concern, the Federal Open Market Committee (FOMC) would certainly respond and use our tools to assure that inflation runs at levels that are consistent with our goal. Incoming data should provide more evidence that some of the supply–demand imbalances are improving, and more evidence of a continued moderation in inflation, particularly in goods and services prices that have been most affected by the pandemic. We also expect to see continued strong job creation. And we will be learning more about the Delta variant's effects.”\n\nHere is the full transcript from the speech, I encourage everyone to read it fully. It’s not very long and is extremely insightful to see exactly what the main monetary policy maker thinks of the current state of the economy\n\n[https://www.federalreserve.gov/newsevents/speech/powell20210827a.htm](https://www.federalreserve.gov/newsevents/speech/powell20210827a.htm)\n\nRegarding Powell’s speech, BTIG Chief Equity and Derivatives Strategist Julian Emanuel said, “Powell \"did three things very, very right, and obviously the markets are celebrating that. First was keeping the speech succinct. Second thing he did risht is, he sent the rest of the Fed governors out over the prior four weeks to basically tell us all that the taper was coming. He merely had to reiterate, and reiterate softly, that message, which he did very effectively. The third thing is he really tackled inflation head on. He knew that’s been the preoccupation of the markets for these last couple of months. While he didn’t give any new real evidence as to why he views inflation as transitory, he did cite the ongoing moderation in commodity prices and the view that past history would indicate that inflation is likely to be temporary.” \n\nLooking ahead, market participants are set to receive more data on the strength of the labor market recovery this week, with the Labor Department's August jobs report due out on Friday. Consensus economists are looking to see that 750,000 payrolls came back during the month, representing an eighth straight month of gains but a slight pullback from July's 943,000.\n\n**Highlights**\n\n* Shares of buy-now-pay-later company Affirm (AFRM) gapped up more than 40% after announcing partnership with Amazon (AMZN) that will let customers buy items of $50 or more in installments. \n* Shares of travel and leisure stocks slid after the European Union issued a new recommendation to restrict nonessential travel from the US due to surging coronavirus Delta cases. Here is the recommendation: [https://www.consilium.europa.eu/en/press/press-releases/2021/08/30/covid-19-council-removes-5-countries-and-one-entity-territorial-authority-from-the-list-of-countries-for-which-travel-restrictions-should-be-lifted/](https://www.consilium.europa.eu/en/press/press-releases/2021/08/30/covid-19-council-removes-5-countries-and-one-entity-territorial-authority-from-the-list-of-countries-for-which-travel-restrictions-should-be-lifted/)\n* July pending home sales unexpectedly dropped, according to data from the National Association of Realtors, likely due to high housing prices. Sales dipped 1.8% in July compared to June, nearly matching June’s 2% decline. Economists were looking for a gain of 0.3%\n* McDonald’s (MCD) sent a notice to instruct franchisees on steps they should take to re-close indoor dining in areas where the Delta variant is rapidly spreading. Originally, barring any COVID resurgence, McDonald’s planned to fully reopen indoor dining by Labor Day (Sept 6)\n* Apple (AAPL) announced changes to its App Store regulations that will allow software developers to tell customers how to pay for services outside of Apple’s ecosystem, part of a proposed settlement of a class-action lawsuit. The shift will make it easier for some apps to steer customers toward other forms of payment, rather than using the App Store, where Apple charges a commission of up to 30%.\n* ESPN, which is owned by Disney (DIS), is reportedly seeking to license its brand to major sports-betting companies for at least $3 billions over several years, according to sources familiar with the matter as reported by the Wall Street Journal. On offer is the right for a suitor to use the ESPN name for branding purposes and potentially rename its sportsbook after ESPN. The sports-media giant has held talks with players that own major sportsbooks, including casino operator Caesars Entertainment (CZR)[ ](https://www.wsj.com/market-data/quotes/CZR?mod=chiclets)and DraftKings (DKNG) the sources said. ESPN has existing marketing partnerships with both companies already. This is huge for the sports-betting industry, will be closely following this story.\n* Amazon-backed (AMZN) electric vehicle maker Rivian is reportedly seeking a $70-$80 billion valuation in its upcoming IPO. The company has an agreement to produce electric vans for Amazon and a pickup truck for consumers. In my humble opinion, even being backed by Amazon, this valuation is insane.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Affirm (AFRM) with a host of target raises following the Amazon news. Average price target $120 at Buy. Stock currently around $99\n* Albemarle (ALB) target raised by Cowen from $180 to $260 at Outperform. Stock currently around $237\n* Asana (ASAN) target raised by Jefferies from $65 to $90 at Buy. Stock currently around $78\n* Crowdstrike (CRWD) with a host of target raises. Average price target $320 at Outperform. Stock currently around $286\n* DocuSign (DOCU) target raised by Wedbush from $290 to $340 at Outperform. Stock currently around $303\n* Fortinet (FTNT) target raised by Wedbush from $310 to $350 at Outperform. Stock currently around $319\n* Eli Lilly (LLY) target raised by Cowen from $250 to $300 at Outperform. Stock currently around $262\n* Workday (WDAY) with two target raises. Stock currently around $270\n   * Wolfe Research from $270 to $300 at Outperform\n   * Loop Capital from $320 to $340 at Buy\n* Zscaler (ZS) target raised by Wedbush from $240 to $320 at Outperform. Stock currently around $278\n\n“Without labor nothing prospers.” - Sophocles",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, August 30, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/peqngw/here_is_a_market_recap_for_today_monday_august_30/",
        "created": 1630384747.0
    }
]