[
    {
        "author": "bigdigdoug",
        "created_utc": 1617840022,
        "id": "mmfdw0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " I posted this on Monday in a couple other subs but unfortunately I didnt get in - was asked to post it here but it will probably get removed and/or downvoted. \n\nI'm currently watching from the sidelines as it has pulled back pretty good today. I'm keeping an eye for it to either drop back below the 200MA and possibly fizzle out or get back above the 50MA and hold. Its OTC which has been getting hammered as of late so definitely proceed with caution. \n\n \n\n[$RKFL](https://finance.yahoo.com/quote/RKFL?p=RKFL&amp;.tsrc=fin-srch)\n\nSource: [Here](https://www.goldmanresearch.com/202104011316/Opportunity-Research/blockchain-crypto-payments-pioneer-to-transform-ecommerce.html)\n\n**COMPANY SNAPSHOT**\n\nRocketFuel Blockchain, Inc. is global payments processing company offering highly efficient 1-click check-out solutions to eCommerce merchants and their customers. RocketFuel’s solution focuses on enhanced customer privacy protection eliminating the risk of data breach while improving speed, security and ease of use. RocketFuel users are able to enjoy seamless check-out using their favorite cryptocurrencies or direct bank transfers and forget the clunky cart and card paradigm of the past. RocketFuel merchants are able to implement new impulse buying schemes and generate new sales channels unavailable in current eCommerce solutions.\n\n**INVESTMENT HIGHLIGHTS**\n\n**RKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies.** Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience.\n\n**The market is huge and growing at an enviable rate.** According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\n**Current eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience.** Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\n**Management has a proven track record of developing new technologies, bringing them to market, and generating value for the investors.** The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate.\n\n**Our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS.** Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\n**Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 sales estimate of $40M and roughly 28x our $0.22 EPS forecast.** This target could prove to be conservative if adoption accelerates.\n\n* Price as of 3/31/21$1.32\n* 52 Wk High - Low$3.25 - $0.50\n* Est. Shares Outstanding24.2M\n* Market Capitalization$31.9M\n* Average Volume17,008\n* Exchange:OTCQB\n\n**COMPANY INFORMATION**\n\n**RocketFuel** **Blockchain, Inc.**  \n**201 Spear Street, Suite 1100**  \n**San Francisco CA 94105**\n\nWeb:     [www.RocketFuelBlockchain.com](http://www.rocketfuelblockchain.com/)\n\nEmail:   [info@rocketfuelblockchain.com](mailto:info@rocketfuelblockchain.com%0d)  \nPhone : 424.256.8560\n\n***The View from 30,000 Feet***\n\nBlockchain payments innovator **RocketFuel** **Blockchain, Inc. (OTCQB – RKFL)** is poised to transform the global eCommerce industry, in our view. The Company is an early mover as a global provider of one-click online payment options using Bitcoin and dozens of other cryptocurrencies. Moreover, RocketFuel is the first cryptocurrency payment service to provide a seamless and elegant one-click checkout experience that today's digital and mobile-centric consumers have come to expect from eCommerce marketplaces, such as **Amazon (NASDAQ – AMZN)**. \n\nThe RocketFuel platform, based on patent-pending technology, enables merchants and consumers to easily complete payment for goods and services using 43 different cryptocurrencies or direct bank transfer in a completely secure environment. A significant benefit of the Company’s approach is that the entire shopping cart checkout process can be executed via a distributed ledger or blockchain. Thus, merchant websites will no longer required to operate complex, and costly payment and check-out infrastructures. With the one-click checkout used on RocketFuel-partnered sites, consumers will enjoy unrivalled convenience .\n\nAs is typically the case with new technologies and applications with a broad scope, we expect early adopters to dominate usage during 2021 as online merchants shopping cart and payment solutions providers implement the crypto acceptance functionality, with mass market utilization occurring in 2022. With estimates suggesting that the number of (non-Facebook) crypto wallet holders will grow to 250M+ in the next 2-3 years, up from 68M today, substantial adoption lies ahead.   \n\n***The Problem***\n\neCommerce has enjoyed wide, mainstream adoption and in many cases has emerged as the shopping method of choice for consumers during the COVID-19 pandemic. Unfortunately, for merchants and consumers alike, many of the payment system setups and associated technologies in place today have underlying issues, which in turn have a deleterious effect on merchant/consumer transaction execution.\n\nFor consumers, payment systems and shopping cart utilization can be awkward and clunky, require multiple steps and redirects to 3rd parties, and may not be secure, resulting in a less than stellar customer experience. For merchants, the current eCommerce payment infrastructure is even more problematic. In most cases, merchants are required to use an intermediary, costing billions in excess expenses annually. Roughly 1 in 5 carts leave without completing a transaction because consumers do not trust the merchant’s system. Plus, in most cases, fees are high, payments are delayed, and exorbitant fees due to fraud, fraud prevention, and chargebacks related to the inefficient back-end operations can be excessive, reducing profits.\n\n***The Solution*** \n\nIn contrast, by leveraging modern blockchain technology and its proprietary platform, RocketFuel offers consumers a single-click pay solution, pay with crypto or direct bank transfer option with no redirects or filling out forms as the information is stored at once. The process is seamless-simple, efficient, secure, and convenient. Merchants generate higher shopping cart conversion, pay lower fees, have greater security, transparency, less fraud, and improved cash flow. With a better experience for both sides of the transaction, and improved order and shipping fulfillment, merchants can foster loyalty and generate recurring business. \n\n***Today and Tomorrow***\n\nThe Company launched its first product in a live environment in March 2021 and with two travel merchant customers and a tax auditing firm in hand, management intends to continue to develop the check-out technology with several larger U.S. eCommerce merchants, social media and blogsites. With connections to several larger eCommerce merchants, near term sales and marketing efforts will focus on a few “big fish” rather than many smaller merchants and will scale up initiatives as funding permits. We believe that the Company will also target specific verticals that may be a source of early adopters and crypto wallet holders in verticals such as online gambling, gaming, and with merchants selling high ticket items. In conjunction with this targeted approach, RocketFuel may utilize social media to generate awareness and attract consumer influencers. Given that the phase from early adoption to mass market adoption can take 12-18 months, we believe that the Company could enjoy exponential merchant sign-ups going forward, along with consumer utilization, from 2021-2022, with the greatest recurring platform utilization by consumers beginning in 2023. \n\n***Financial Forecasts and Valuation***\n\nIt is difficult to accurately project the deployment and adoption success of a new technology and application such as the unique RocketFuel blockchain and crypto payment service.  However, given the underlying growth rates in blockchain ledger utilization for financial and payment transactions, as well as the proliferation of crypto wallet adoption, it is clear that major upside exists. Widespread adoption and growth are further affirmed by the Company’s underlying offering which solves major unmet needs in eCommerce for merchants and consumers alike. As with many young companies, it comes down to efficient execution. The management has a strong, proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies.\n\nWe should note that our forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to firmly estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) and revenue of $12M in FY23E with net profit of $650K, or $0.02. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.\n\n**INDUSTRY PRIMER: BLOCKCHAIN**\n\n📷\n\nAccording to a recent report by Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nA blockchain, also known as a “distributed ledger technology,” is a sequential, ever-growing, time-stamped set of records used to secure transactions across multiple devices that are grouped in blocks and maintained by disparate participants. Each block is interdependent, making alterations of records economically difficult if not outright impossible.\n\nTransactions in money, equities, bonds, titles, deeds, contracts, and virtually all other kinds of assets can be implemented and stored securely, privately, and from peer to peer, because trust is established by network consensus, cryptography, collaboration, and sophisticated code---without intermediaries. Given the opportunities associated with such a disruptive technology, many firms in varied industries are actively operating in the space to transact business, agreements and financial transactions more efficiently.\n\nCommercial and central banks across the world are now using blockchain technology for payment processing and issuing of their digital currencies. The technology enables cross-border payments that are less expensive and faster as compared to traditional systems. The remittance cost within the blockchain is 2% to 3% of the total amount as compared to other third parties as blockchain does not require third-party authentication. Even governments are introducing CBDCs (Central Bank Digital Currency) to replace cash and traditional fiat-currencies. Plus, they are putting social media behemoths such as Facebook and Google under scrutiny for their lack of privacy protection and data security.\n\nOne of the most popular applications of blockchain is cryptocurrency. Trading in cryptocurrency is relatively easy compared to other assets. You can begin trading just by signing up for various wallets on the market. Furthermore, there are different types of wallet apps, each with its own advantages, such as levels of security, accessibility, and more. The most popular and well-known wallet is Coinbase with 639,885 daily active users (DAUs). If Facebook’s Libra initiative to its 2B users is successful, this figure will be dwarfed in short order.\n\nThe payments segment dominated the market in 2020 and accounted for more than 44.0% share of the global revenue. Blockchain technology improves payment system efficiency, minimizes operating costs, and offers transparency. These benefits provided by blockchain technology are increasing its use in payment solutions, thus, driving the segment growth. At the same time, blockchain reduces the need for middlemen in payment processing, which is also a major factor driving the segment growth.\n\nBitcoin (the largest cryptocurrency) is the most popular application of blockchain, but increasingly this innovative technology can be used in various business and commercial purposes. The elimination of the middleman in various transactions and processes promises a much more efficient workflow using blockchain. Additionally, increasing concerns about privacy and security make blockchain an ideal technological pipeline for modern processes.\n\nEnter the eCommerce application.\n\n**ROCKETFUEL: THE GAME-CHANGER**\n\nWhen validating a new market or technology, it is instructive to review history as it tends to repeat itself. Most major technology breakthroughs and disruptions had a few things in common:\n\n* A large, inefficient market, usually based on old technologies and processes, generating problems and unnecessary cost for all stakeholders.\n* A new technology allowing new companies to invent new solutions that address these problems.\n\nSome examples include improved internet technology which enabled Amazon to evolve our commerce habits from brick and mortar to digital and mobile technology innovations and evolutions that have led to Uber and Lyft transforming transportation.  The payments industry is no different. Its architecture and operations are still based on a 40-year-old physical card with a chip and limited fraud prevention capabilities. In contrast, digital technologies such as blockchain and cryptocurrencies are prompting the replacement of the old architecture with a new efficient, lower cost approach. y changes the way payments are made.\n\nThere is a huge inefficient market (the payment market) causing problems for all stakeholders. There is a technology that has the potential to fix it. Enter RocketFuel Blockchain.\n\nRocketFuel is a new frictionless blockchain based payment solution for eCommerce merchants to accept payments in crypto or cash via bank transfer and receive payment and shipping information in one one-click transaction without the need for payment intermediaries. In anticipation of a major proliferation in crypto utilization for payments and business, large eCommerce and retail merchants now accept crypto as a payment method. In fact, over one-third of all small and medium-sized U.S. companies already accept Bitcoin as a B2B payment source.\n\nThe eCommerce space is estimated to be $3.5T, yet it represents less than 15% of total commerce. PayPal, a significant player in the online payments arena with over 350M users, allowed users to buy and sell crypto and just announced its “Checkout for Crypto” feature. This function, allows users to instantly convert their Bitcoin, Ethereum, Litecoin, or Bitcoin Cash to US dollars (with no additional transaction fees) that PayPal then uses to complete the transaction. In our view, this is a validation of the RocketFuel approach and will likely capture its share of this function. Still, since it lacks the 1-click convenience and appears to still be clunky and expensive relative to our forecast of the RocketFuel pricing, RocketFuel remains in the driver’s seat.\n\nAs mentioned above, existing solutions are costly, impact conversion, not secure, leads to fraud, and will eventually go the way of the milkman. Merchants and consumers alike crave security, convenience, transparency, low cost and trust.  \n\n***The*** ***RocketFuel*** ***Approach***\n\nThe Company provides check-out and payment systems directly on the check-out page that securely automate and simplify the way online payment and shipping information is received by merchants from their customers. The check-out systems are designed to enhance customers’ data protection, enabling consumers to pay for goods and services using cryptocurrencies or by direct transfers from their bank accounts without exposing spending credentials such as credit card data. At the same time, the check-out systems are designed to increase the speed, security and ease of use for both customers and merchants and include a merchant portal that provides detailed transactions and metrics about payments received by the merchant.\n\nThey also include a customer portal where shoppers are able to track their payments, configure payment defaults and connect with various cryptocurrency exchanges and banks to facilitate payment to merchants. Merchants are able to integrate a unique pop-up user interface that allows customers to pay directly from their ecommerce checkout page with no need to redirect to another website or web page.\n\nData is key and the merchant portal is updated instantly when a payment transaction is made on the merchant website. The merchant is notified of the transaction and can see the transaction details, including the customer that made the transaction, the transaction amount and the transaction items. This information is added to the merchant dashboard where various metrics are tracked and displayed to the merchant, including information about the various cryptocurrencies that are used for payments to that merchant and the funds received by the merchant from the different currencies.\n\nCustomers of merchants that use the RocketFuel payment solution are able to track their payments in their online portal. They are also able to track payments they made to all the merchants that are integrated with the RocketFuel payment technology within one consolidated user portal. They are able to connect to multiple exchanges including Coinbase, Binance, Kraken, Gemini and others to pay directly from them. They can also pay from any cryptocurrency wallet. Customers are able to connect with multiple bank accounts to pay from as well.\n\n📷The “single-click” RocketFuel check-out solution is based on a streamlined check-out process for eCommerce purchases. The payment user interface is displayed as a stand-alone popup that allows the creation of new accounts as well as payment directly from crypto exchanges, crypto wallets, and bank accounts, with no redirects to browser tabs or pages. This can be integrated as a plugin on the merchant checkout page or as a browser extension. The plugin comes integrated with popular ecommerce platforms including WooCommerce, Shopify, Prestashop and others. The payment interface is designed for both web and mobile checkout experiences. Merchants are able to integrate the RocketFuel payment interface to their checkout page with software development kits (SDKs) that are available via the merchant portal. Application programming interfaces (APIs) are also available to the merchant for deeper integration into backend systems, ERP platforms, and other third-party platforms.\n\nCryptocurrencies are stored in different types of cryptocurrency wallets. These wallets can include mobile wallets, web wallets, desktop wallets, hardware wallets, and exchange wallets. Currently, it can be a difficult, confusing and multi-step process to use these wallets to make cryptocurrency payments. With RocketFuel’s blockchain solution, cryptocurrency holders can use any of the above digital wallets to make payment for products or services to any RocketFuel merchant with 1, 2, or 3 steps.\n\nUsing the “single-click” RocketFuel check-out technology and check-out button, consumers will no longer be re-directed to a third-party  With the RocketFuel solution, eCommerce merchants will need no contact or other information exchange with the consumer in order to receive their payment or shipping details. Instead, they will have immediate visibility of payments from customers via the RocketFuel payment system, which may be integrated into merchants’ fulfillment centers.\n\nLooking ahead, the technology will also be used for different scenarios, including paying for services, paying invoices, and other payment strategies. In addition, under a future version of the payment system, advertisements in which the entire check-out process is embedded will be able to be placed on third party websites and sales may be completely finalized there. Thus, the platform will enable eCommerce strategies that can include advertisements with a fully integrated check-out process. This prospective feature is unlike any other currently in use today and could eventually be a significant driver of revenue, once completed. Such advertisements will provide significant new sales channels to retailers that are simply not possible with legacy check-out solutions.\n\nIn addition to potential competition from PayPal, the primary competitor remains Bitpay, which is already well established as the leading crypto payment technology in the market, having been founded in 2011. Given that RocketFuel offers a better user experience for crypto payments, allows payment from dozens of other cryptocurrencies, and other wallets, and exchanges, RocketFuel’s diversity is a major strength.  RocketFuel also offers services that Bitpay currently does not, such as providing merchants immediate visibility of payment transactions, real time metrics of transactions and customers, easy integration to ecommerce checkout as well as deep integration to backend platforms. Furthermore, with an average of 72,000 transactions per month, it will not take significant merchant penetration for RocketFuel to surpass Bitpay, in our view.\n\n***Target Markets*** \n\nThe Company’s initial target market is the travel industry and RockeFuel already has signed up two sizable customers: Sky Tours and Military Fares. It should be noted that worldwide sales of flight tickets sold online in 2019 was $540B and the 2 largest reservations systems generate more than $10B in yearly revenue, making this vertical a hot commodity. Management plans to target travel merchant and web platforms. Given the complexity of the intermediaries and reservation systems, high costs and notoriously delayed payments, the RocketFuel solution can simplify the payment process and customers no longer have to provide sensitive information. We believe other verticals such as online gambling, the procurement of gift cards, and high-ticket items could prove to be lucrative for the Company. As a result, we expect sales and marketing headcount to rise over the next 12-18 months, in conjunction with rapid deployment and implementation of existing and future solutions.\n\n**ROCKETFUEL BLOCKCHAIN LEADERSHIP TEAM**\n\n**Gert Funk, Chairman, Founder, Chief Product Officer**\n\nGert Funk has over 15 years as a payment service provider for international eCommerce merchants. A serial entrepreneur since 1990, he is the founder of RocketFuel Blockchain, Inc. Gert has been an expert in blockchain technology and applications for eCommerce since 2015.\n\n**Peter Jensen, Chief Executive Officer**\n\nPeter Jensen is an experienced executive with extensive global experience within enterprise software. After holding sales and marketing positions within Oracle, Symantec, and VMware in Europe and the US, Peter has been focusing on building and growing start-ups in Silicon Valley as CEO and VP of Sales. Examples include Thinstall (acquired  by VMware), StopTheHacker (acquired by Cloudflare), ParStream (acquired by CISCO), SPanugo (acquired by IBM), and others. He is currently the CEO of RocketFuel Blockchain, a fintech software company providing a payment solution that allows eCommerce merchants to receive Crypto payments.\n\n**Bennett** **Yankowitz, Chief Financial Officer**\n\nBennett Yankowitz is an expert in ICO law with more than 30 years of experience as a corporate attorney with leading law firms. Ben specializes in securities, financial and merger and acquisition transactions. He holds law degrees from the University of Southern California and the University of Cambridge.\n\n**Rohan Hall, Chief Technology Officer**\n\nRohan Hall has over 30 years of experience in the technology sector, Rohan is a noted and published author and Fintech company founder. A serial entrepreneur and Blockchain expert, Rohan has had successful blockchain exits.\n\n**FINANCIAL FORECASTS**\n\n*(Analyst’s Note: These forecasts are our own and we did not receive guidance or projections from RKFL management.)*\n\nOur forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be in the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for FY22E or Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) as management begins meaningful sales and marketing expenses to build awareness and execute merchant signups in key verticals such as the travel industry and online gambling. \n\nIn FY23E, we forecast significant revenue growth with top line reaching the $12M mark. Total operating expenses are estimated to reach $8.25M with expanded sales and marketing expenses, along with R&amp;D, reflecting upgrades to the core functionality. Based on this model, net profit is slated to reach $650K, or $0.02, with a slight rise in shares outstanding to reflect a modest fundraise in conjunction with a prospective up-list to NASDAQ. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nIt should be noted that while there are not material direct COGS, we have allocated some indirect expenses to arrive at a gross margin of around 72-73% for all years. We believe that this is conservative and may have to be adjusted higher, thereby raising profitability and our price target.\n\n**RISK FACTORS**\n\nIn our view, the Company’s biggest risks are straightforward: the timing and magnitude of broad adoption of its core technology and applications by both merchants and consumers. Secondary risks include changes in the regulatory environment affecting utilization along with marketing effectiveness. Competitive risks include lower pricing, more effective sales/marketing, greater functionality and features. The aforementioned risks could come from larger competitors, existing firms, or new entrants. Still, these future concerns are consistent with firms of RocketFuel’s size and early mover standing. Moreover, we believe that the Company’s seasoned management team is prepared to overcome these hurdles and generate significant top-line growth, deployment and  implementations.\n\nVolatility and liquidity are typical concerns for microcap stocks that trade on the over the counter (OTC) stock market. In addition to a recent funding access announcement regarding Triton Funds, management may seek to raise additional capital next year in conjunction with an up-list to NASDAQ, to fund corporate expansion and potential M&amp;A. An overriding financial benefit as a public company is the favorable access to and the availability of capital to fund product launches, consistent marketing campaigns and other initiatives. Since the proceeds of any future funding would be used in large part to advance major business development and sales, we believe that any dilutive effect from such a funding could be offset by related increases in market value.\n\n**VALUATION AND CONCLUSION**\n\nRKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies. Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience. The market is huge and growing at an enviable rate. According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nCurrent eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience. Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\nManagement has a proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate. At present, our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS. Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.",
        "subreddit": "pennystocks",
        "title": "Blockchain, Crypto Payments Pioneer to Transform eCommerce",
        "url": "https://www.reddit.com/r/pennystocks/comments/mmfdw0/blockchain_crypto_payments_pioneer_to_transform/",
        "created": 1617868822.0
    },
    {
        "author": "SammyboyWinterfox",
        "created_utc": 1617976931,
        "id": "mnhvcd",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I guess I will be buying my diamond blades from Norton from now on... that image speaks to me.",
        "url": "https://i.redd.it/4tylto1lm5s61.jpg",
        "created": 1618005731.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617370884,
        "id": "mikm42",
        "num_comments": 378,
        "num_crossposts": 0,
        "selftext": "**Preamble:** One of the main questions that I had and I see recurring on this sub is how to identify and invest in emerging stocks before it becomes mainstream news. I did not have the time to actively track social media and decided to build a program that does it for me.\n\n**How it works:** The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth. I added sentiment analysis to the findings so as to check the general sentiment (whether what is being talked about the stock is positive or negative).\n\nHere is the stock picked by the program and my DD\n\n**Stock:**   **Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n&amp;#x200B;\n\n[TSMC absolutely dominates the advanced chip market ](https://preview.redd.it/qx1btw29krq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=61ce94bf883480c99f5e74a43bdea79bbf9d4d9f)\n\nAs you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w6mw9ehakrq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=a70944796b31b7b971e743f497854c29d9b797d1\n\nTSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "wallstreetbets",
        "title": "I built a program that tracks mentions and sentiment of stocks across Reddit and Twitter to find rising stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/",
        "created": 1617399684.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1617615806,
        "id": "mkgvvq",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "This is great article from Seeking Alpha but since it's against the rules to link SA articles here I'll just copy/paste.\n\n**Vertical Software.** Analyst Jason Celino thinks the plan would \"accelerate digitization opportunities across the architecture and construction industry.\"\n\n1. **Bentley Systems** (NASDAQ:BSY) gets 60% of total revenue from infrastructure, so the plan could lead to \"meaningful multiyear tailwinds.\"\n2. **Autodesk** (NASDAQ:ADSK) exposure to infrastructure of 15-20% of revenue and the \"completion of its Innoyze acquisition, providing solutions for water infrastructure assets, gives us incremental confidence.\"\n3. **Trimble** (NASDAQ:TRMB) has 25-30% of revenue from infrastructure \"geospatial, construction, and civil engineering offerings are well positioned.\"\n\n**Communication Services.** Analyst Brandon Nispel says the bill \"is positive for infrastructure providers (tower operators) and neutral to negative for network providers (wireless carriers and cable operators).\"\n\n1. **American Tower** (NYSE:AMT), **Crown Castle** (NYSE:CCI), **SBA Communications** (NASDAQ:SBAC) are picks in towers, which will be helped by improving investment in wireless networks.\n2. **Altice USA** (NYSE:ATUS), **Cable One** (NYSE:CABO), **Charter Communications** (NASDAQ:CHTR), **Comcast** (NASDAQ:CMCSA), **WildOpenWest** (NYSE:WOW) may see a hit to discretionary cash flow due to a higher corporate tax rate.\n3. **AT&amp;T*\" (NYSE:T), **T-Mobile U.S.** (NASDAQ:TMUS) and **Verizon** (NYSE:VZ) are the most at risk of a corporate tax rate hike, with T and VZ seeing incremental taxes of $1.5B to $2B.\n\n**Entertainment and Video Games.** Analyst Tyler Parker says the plan for bringing high-speed broadband to every American will help domestic online vide games\n\n1. **Activision** (NASDAQ:ATVI), **Electronic Arts** (NASDAQ:EA), **Take-Two Interactive** (NASDAQ:TTWO) and **Ubisoft** (UBISFY) could see tailwinds.\n\n**Semiconductors.** Analysts John Vinh and Wes Twigg say \"expansion incentives would likely be a tailwind for semiconductor equipment demand while easing the capex burden on manufacturers.\"\n\n1. **Applied Materials** (NASDAQ:AMAT), **ASML** (NASDAQ:ASML), **Advanced Energy Industries** (NASDAQ:AEIS), KLA (NASDAQ:KLAC), **Lam Research** (NASDAQ:LRCX) and **Teradyne** (NASDAQ:TER) would benefit in equipment names.\n2. **Analog Devices** (NASDAQ:ADI), **Intel** (NASDAQ:INTC), **Micron** (NASDAQ:MU), **ON Semiconductor** (NASDAQ:ON) and **Texas Instruments** (NASDAQ:TXN) are picks among those with domestic manufacturing footprints.\n\n**Utilities.** Analyst Sophie Karp notes the majority of the impact on the sector would not come from direct spending, but from fiscal incentives.\n\n1. **American Electric Power** (NASDAQ:AEP), **Southern** (NYSE:SO), **Duke Energy** (NYSE:DUK), **Dominion Energy** (NYSE:D), **Entergy** (NYSE:ETR) and **Edison International** (NYSE:EIX) can benefit from incremental grid investment initiatives and electrifications trends from an EV tide that will \"lift all boats.\"\n2. **Eversource Energy** (NYSE:ES), **Avangrid** (NYSE:AGR), **Public Service Enterprise Group** (NYSE:PEG), **NextEra Energy** (NYSE:NEE), **Xcel Energy** (NASDAQ:XEL), **AEP**, **Sunrun** (NASDAQ:RUN), **Sunova Energy** (NYSE:NOVA) will be helped by the extension of the investment tax credit and the production tax credit further boosting commercial solar and wind.\n3. **Public Service Enterprise Group*\" (PEG), **Excelon** (NASDAQ:EXC) and **Energy Harbor** (OTCPK:ENGH) would benefit from any concrete federal program to support nuclear energy.\n4. **First Solar** (NASDAQ:FSLR) may get a boost if solar installers can bypass Chinese tariffs.\n\n**Oil and Gas Exploration and Production.** Analyst Leo Mariani says the plan \"is likely to have a bit of a long-term negative for traditional U.S. oil E&amp;Ps if it accelerates the transition away from fossil fuels for transportation purposes, but we generally think that other variables that normally impact the price of oil over the next few years are much more likely to affect energy stocks as opposed to the impacts of this bill, which will take a healthy part of this decade and into the next to make a material impact.\"\n\n**Life Science Tools.** Analyst Paul Knight says \"a specific call-out of 'biotechnology' as a key technology investment is positive.\"",
        "subreddit": "stocks",
        "title": "Best stocks for Biden's infrastructure plan",
        "url": "https://www.reddit.com/r/stocks/comments/mkgvvq/best_stocks_for_bidens_infrastructure_plan/",
        "created": 1617644606.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617629862,
        "id": "mkkw54",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and have made the program public.\n\nHow it works: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth and increasing chatter.\n\nHere is the stock picked by the program and my DD\n\n**Stock:** **Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n[TSM Dominates in the advanced chip market](https://imgur.com/YImkCdg)\n\n As you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n[Current status of foundry roadmap!](https://imgur.com/q7NKNgA)\n\n TSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "stocks",
        "title": "I analyze mentions and sentiment of stocks across social media to find stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/stocks/comments/mkkw54/i_analyze_mentions_and_sentiment_of_stocks_across/",
        "created": 1617658662.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617371010,
        "id": "miknjx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and have made the program public.\n\nHow it works: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth and increasing chatter.\n\n**Stock: Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n[link](https://imgur.com/a/xjIQeh4) for pure-play foundry revenue split (2020)\n\nAs you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n[link](https://imgur.com/a/UCg09sC) for current standings of different companies in the foundry process roadmaps\n\nTSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "stocks",
        "title": "I analyze mentions and sentiment across social media to find rising stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/stocks/comments/miknjx/i_analyze_mentions_and_sentiment_across_social/",
        "created": 1617399810.0
    },
    {
        "author": "AlternativeWind1888",
        "created_utc": 1617703601,
        "id": "ml89q5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Whales are everywhere. They can crush the exchanges or can raise theme. So the whales can make someone bankrupt or make themselves profits. For example: TXN's (a random coin) price is $1 and there is only twenty one million TXN coins. A whale can buy nineteen million of theme and can make the price higher then when he sell every TXN that he owned the price will again $1!\n\n   We have to change it. We have enough power to change it. But how? Let's discus at the comment place right down.",
        "subreddit": "wallstreetbets",
        "title": "We Can Crush The Wall Street Again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ml89q5/we_can_crush_the_wall_street_again/",
        "created": 1617732401.0
    },
    {
        "author": "FearlessRelease1",
        "created_utc": 1617802336,
        "id": "mm25ha",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "TXN Earnings",
        "url": "https://www.reddit.com/r/stocks/comments/mm25ha/txn_earnings/",
        "created": 1617831136.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617370884,
        "id": "mikm42",
        "num_comments": 378,
        "num_crossposts": 0,
        "selftext": "**Preamble:** One of the main questions that I had and I see recurring on this sub is how to identify and invest in emerging stocks before it becomes mainstream news. I did not have the time to actively track social media and decided to build a program that does it for me.\n\n**How it works:** The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth. I added sentiment analysis to the findings so as to check the general sentiment (whether what is being talked about the stock is positive or negative).\n\nHere is the stock picked by the program and my DD\n\n**Stock:**   **Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n&amp;#x200B;\n\n[TSMC absolutely dominates the advanced chip market ](https://preview.redd.it/qx1btw29krq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=61ce94bf883480c99f5e74a43bdea79bbf9d4d9f)\n\nAs you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w6mw9ehakrq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=a70944796b31b7b971e743f497854c29d9b797d1\n\nTSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "wallstreetbets",
        "title": "I built a program that tracks mentions and sentiment of stocks across Reddit and Twitter to find rising stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/",
        "created": 1617399684.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1617615806,
        "id": "mkgvvq",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "This is great article from Seeking Alpha but since it's against the rules to link SA articles here I'll just copy/paste.\n\n**Vertical Software.** Analyst Jason Celino thinks the plan would \"accelerate digitization opportunities across the architecture and construction industry.\"\n\n1. **Bentley Systems** (NASDAQ:BSY) gets 60% of total revenue from infrastructure, so the plan could lead to \"meaningful multiyear tailwinds.\"\n2. **Autodesk** (NASDAQ:ADSK) exposure to infrastructure of 15-20% of revenue and the \"completion of its Innoyze acquisition, providing solutions for water infrastructure assets, gives us incremental confidence.\"\n3. **Trimble** (NASDAQ:TRMB) has 25-30% of revenue from infrastructure \"geospatial, construction, and civil engineering offerings are well positioned.\"\n\n**Communication Services.** Analyst Brandon Nispel says the bill \"is positive for infrastructure providers (tower operators) and neutral to negative for network providers (wireless carriers and cable operators).\"\n\n1. **American Tower** (NYSE:AMT), **Crown Castle** (NYSE:CCI), **SBA Communications** (NASDAQ:SBAC) are picks in towers, which will be helped by improving investment in wireless networks.\n2. **Altice USA** (NYSE:ATUS), **Cable One** (NYSE:CABO), **Charter Communications** (NASDAQ:CHTR), **Comcast** (NASDAQ:CMCSA), **WildOpenWest** (NYSE:WOW) may see a hit to discretionary cash flow due to a higher corporate tax rate.\n3. **AT&amp;T*\" (NYSE:T), **T-Mobile U.S.** (NASDAQ:TMUS) and **Verizon** (NYSE:VZ) are the most at risk of a corporate tax rate hike, with T and VZ seeing incremental taxes of $1.5B to $2B.\n\n**Entertainment and Video Games.** Analyst Tyler Parker says the plan for bringing high-speed broadband to every American will help domestic online vide games\n\n1. **Activision** (NASDAQ:ATVI), **Electronic Arts** (NASDAQ:EA), **Take-Two Interactive** (NASDAQ:TTWO) and **Ubisoft** (UBISFY) could see tailwinds.\n\n**Semiconductors.** Analysts John Vinh and Wes Twigg say \"expansion incentives would likely be a tailwind for semiconductor equipment demand while easing the capex burden on manufacturers.\"\n\n1. **Applied Materials** (NASDAQ:AMAT), **ASML** (NASDAQ:ASML), **Advanced Energy Industries** (NASDAQ:AEIS), KLA (NASDAQ:KLAC), **Lam Research** (NASDAQ:LRCX) and **Teradyne** (NASDAQ:TER) would benefit in equipment names.\n2. **Analog Devices** (NASDAQ:ADI), **Intel** (NASDAQ:INTC), **Micron** (NASDAQ:MU), **ON Semiconductor** (NASDAQ:ON) and **Texas Instruments** (NASDAQ:TXN) are picks among those with domestic manufacturing footprints.\n\n**Utilities.** Analyst Sophie Karp notes the majority of the impact on the sector would not come from direct spending, but from fiscal incentives.\n\n1. **American Electric Power** (NASDAQ:AEP), **Southern** (NYSE:SO), **Duke Energy** (NYSE:DUK), **Dominion Energy** (NYSE:D), **Entergy** (NYSE:ETR) and **Edison International** (NYSE:EIX) can benefit from incremental grid investment initiatives and electrifications trends from an EV tide that will \"lift all boats.\"\n2. **Eversource Energy** (NYSE:ES), **Avangrid** (NYSE:AGR), **Public Service Enterprise Group** (NYSE:PEG), **NextEra Energy** (NYSE:NEE), **Xcel Energy** (NASDAQ:XEL), **AEP**, **Sunrun** (NASDAQ:RUN), **Sunova Energy** (NYSE:NOVA) will be helped by the extension of the investment tax credit and the production tax credit further boosting commercial solar and wind.\n3. **Public Service Enterprise Group*\" (PEG), **Excelon** (NASDAQ:EXC) and **Energy Harbor** (OTCPK:ENGH) would benefit from any concrete federal program to support nuclear energy.\n4. **First Solar** (NASDAQ:FSLR) may get a boost if solar installers can bypass Chinese tariffs.\n\n**Oil and Gas Exploration and Production.** Analyst Leo Mariani says the plan \"is likely to have a bit of a long-term negative for traditional U.S. oil E&amp;Ps if it accelerates the transition away from fossil fuels for transportation purposes, but we generally think that other variables that normally impact the price of oil over the next few years are much more likely to affect energy stocks as opposed to the impacts of this bill, which will take a healthy part of this decade and into the next to make a material impact.\"\n\n**Life Science Tools.** Analyst Paul Knight says \"a specific call-out of 'biotechnology' as a key technology investment is positive.\"",
        "subreddit": "stocks",
        "title": "Best stocks for Biden's infrastructure plan",
        "url": "https://www.reddit.com/r/stocks/comments/mkgvvq/best_stocks_for_bidens_infrastructure_plan/",
        "created": 1617644606.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617629862,
        "id": "mkkw54",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and have made the program public.\n\nHow it works: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth and increasing chatter.\n\nHere is the stock picked by the program and my DD\n\n**Stock:** **Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n[TSM Dominates in the advanced chip market](https://imgur.com/YImkCdg)\n\n As you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n[Current status of foundry roadmap!](https://imgur.com/q7NKNgA)\n\n TSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "stocks",
        "title": "I analyze mentions and sentiment of stocks across social media to find stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/stocks/comments/mkkw54/i_analyze_mentions_and_sentiment_of_stocks_across/",
        "created": 1617658662.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617371010,
        "id": "miknjx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and have made the program public.\n\nHow it works: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth and increasing chatter.\n\n**Stock: Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n[link](https://imgur.com/a/xjIQeh4) for pure-play foundry revenue split (2020)\n\nAs you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n[link](https://imgur.com/a/UCg09sC) for current standings of different companies in the foundry process roadmaps\n\nTSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "stocks",
        "title": "I analyze mentions and sentiment across social media to find rising stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/stocks/comments/miknjx/i_analyze_mentions_and_sentiment_across_social/",
        "created": 1617399810.0
    },
    {
        "author": "AlternativeWind1888",
        "created_utc": 1617703601,
        "id": "ml89q5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Whales are everywhere. They can crush the exchanges or can raise theme. So the whales can make someone bankrupt or make themselves profits. For example: TXN's (a random coin) price is $1 and there is only twenty one million TXN coins. A whale can buy nineteen million of theme and can make the price higher then when he sell every TXN that he owned the price will again $1!\n\n   We have to change it. We have enough power to change it. But how? Let's discus at the comment place right down.",
        "subreddit": "wallstreetbets",
        "title": "We Can Crush The Wall Street Again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ml89q5/we_can_crush_the_wall_street_again/",
        "created": 1617732401.0
    }
]