[
    {
        "author": "BlueWhaleValue",
        "created_utc": 1635529783,
        "id": "qiid53",
        "num_comments": 1450,
        "num_crossposts": 0,
        "selftext": "How I plan to **Short Tesla ($TSLA)** with a max of **$1,000,000.** Then, walk away with roughly +$300K-$500K in profits. Or, I will walk away with lower profits if Tesla crashes before any of the next steps shared below.\n\nHere is my current short position: **Step 1:**  \n\n\nhttps://preview.redd.it/i1z93h9xffw71.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=47b828402fbf3b681459a963182519ea7729ae87\n\n✅ **Step 1/Position Started:**   \nCurrent Average: $1,070.14  \nCurrent Cost Basis: -$200,117.03\n\n✅ **Step 2**  \nShort at: $1,200\\~  \nAmount: $200K\\~   \nShares to buy: 166\\~  \nNew Cost Basis: $400,117.03\\~  \nNew Average: $1,131.20\\~\n\n✅ **Step 3:**  \nShort at: $1,500\\~  \nAmount: $400K\\~  \nShares to buy: 266\\~  \nNew Cost Basis: $800,117.03\\~  \nNew Average: $1,289.68\\~\n\n✅ **Step 4/Optional:**  \nShort at: $1,700\\~  \nAmount: $200K\\~  \nShares to buy: 117\\~  \nNew Cost Basis: $1,000,117.03\\~  \nNew Average: $1,354.91\\~\n\nI plan to cash out after a -30% drop, maybe ill aim for a 50% drop which means Tesla would be either at $949.44 for a -30%. Or, $677.45 for the -50%. This leaves Tesla with room to run from its current position of $1,100 a 23% gain to the final breakeven point or, 54% to the final optional step.   \n\n\n**Worst Case:**   \nTesla runs up from my even price of $1,354.91 to $2,100 a $2.1 Trillion Market Cap. I'll take a half a million dollar loss which I can afford all day, any day. Won't kill me. (-50%).  \n\n\n✍️**Note:**  \nIf Tesla doubles from its current price, it will be worth more than Apple and Microsoft by $1 Trillion Dollars.  I strongly believe the ROI for new buyers is dramatically decreasing. In other words, the Greater Fool is running low/near the end. There is too much risk, too many emotions, and greed flowing around. Be fearful when others are greedy. In this case, ill profit from their beyond delusional greed. Or, Tesla is currently at peak levels and I don't even get to the next steps. Still a win.   \n\n\n\\- Charlie",
        "subreddit": "wallstreetbets",
        "title": "💸 $1 Million Dollar Tesla Short ($TSLA) 📉",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qiid53/1_million_dollar_tesla_short_tsla/",
        "created": 1635558583.0
    },
    {
        "author": "Swingtrader79",
        "created_utc": 1635500383,
        "id": "qi92fg",
        "num_comments": 749,
        "num_crossposts": 0,
        "selftext": "I failed a lot while trading before, during, and after succeeding. I haven’t counted it up, but it’s likely I encountered losses in excess of $150,000 from making mistakes that were easily avoided, rash decisions, and not giving myself enough time to test out strategies. Net net, I’m up $500,000, but I was asked to share some of what worked for me over IM quite a bit after my last post and figured I’d lay it for others who may not want to waste money learning the hard way, as I did. \n\nThese are tactics and strategies that worked for me and my situation - someone trying to increase net worth, not increase income - and they may not be suitable for everyone.\n\n**Understand the Trading Environment**\n\nOne mistake I made more than a few times was not understanding or paying attention to the trading environment I was in before picking out a strategy. What do I mean? I need to know where things are in the year, in relation to earnings season, and in relation to sector rotations. I need to pay attention to the macroeconomic indicators and I need to watch the VIX.\n\n**Mind the Gap Between Earnings Seasons**. I can’t stress this enough. When earnings are strong and earnings data is coming in, investors watch those like hawks. Good earnings reports bring confidence to the market which yields a rising market. \n\nIn between earnings seasons, there is less data from companies to review and investors pay closer attention to macroeconomic indicators like inflation, 10-year bond yields, and what the Fed is doing. This makes for a much jumpier market that’s more likely to pull back.  It’s also a time when the large asset managers rebalance their portfolios. They manage billions, so this can cause large movements to stocks and indexes as they shift to be overweight in one asset class (e.g. value stocks, energy) and underweight in other asset classes (e.g. growth stocks, technology).\n\nI try not to get caught by these patterns. I anticipate they are coming and invest accordingly. Simply put, I buy the pullback after the rotations have occurred and before earnings seasons begin as a general rule. Of course, I don’t do this if I expect a terrible earnings season. \n\n**Take Advantage of Sector Rotations**\n\nThe sector rotations are pretty predictable if you track the performance of the different sectors over the year. I do this by plotting sector ETFs on a graph and noting when one begins to gain that was flat while others that were up a lot begin to flatten or pull back. Professional investors tend to sell off sectors that have been hot the last quarter or two and replace them with underperforming sectors that represent a better value or opportunity for upside. If I run the P/E ratios for the sector ETFs, I can get a quick sense of the sectors that have had a hot run up over 30 P/E vs other sectors that are more modestly valued. Just keep in mind that certain sectors, like Tech, will always be valued more richly given their growth. So looking at P/E ratios is not apples to apples - it’s just a way to note if historically that sector is at the high end of its own typical valuation range.\n\nLast year’s worst performing sector tends to be one of the best performing sectors the following year. This is because investors prefer to buy low and sell high. I don’t bet against this trend, it’s been around longer than I have and will continue to be around long after I’m dirt. \n\nLast year you couldn’t give away a barrel of oil. Last week, oil reached $80 a barrel. \n\nOne of my favorite options strategies is to buy long dated calls at the money for sector ETFs that underperformed the previous year. I buy calls with expirations in 6-9 months, knowing that I will sell at my exit point which for me is a 100% gain. Sometimes this happens 6 weeks into the year; other times it takes 9 months. So long as I don’t overpay for the options, it works. I don’t like to pay more than the average price return of the sector. For example, if the sector ETF averages a 10% annual return and the ETF price is $100, I’m not going to buy a call for more than $10. That way, if the sector only moves 5%, I can still make money provided the price increase moves quickly enough.\n\n**Make The VIX Your Friend**\n\nThe VIX is an easy way to gauge fear in the marketplace and is a hedge used widely against market pullbacks. If the VIX goes up, the market is worried. If it goes down, the market is getting bullish. If it stays up, everyone is on edge. It’s hard to make good trades in an environment where everyone is on edge and ready to hit the sell button. So be careful buying during times when the VIX is high. On the flip side, if the market has pulled back and the VIX starts to retreat away from its highs, that makes for a good entry point. \n\nAnother interesting phenomenon is when the VIX is higher than normal, there tends to be a selloff the Friday before a long weekend. This happens because investors don’t want to sit through a long weekend that might hold worse news out of fear they will start their Tuesday with losses piling up. I’ve found this is a nice time to get some discounts at the end of the day Friday, or to run some weekly puts on Thursday afternoon before the dips. \n\n**Selecting Trades &amp; Investments**\n\n**Have an Allocation Plan**\n\nThe first thing I recommend is determining, in advance, the amount of money you want to invest longer term vs the amount you want to invest short term vs the amount of money you might actually need to have available for life emergencies. Anything shorter term is higher risk, higher reward. I break my portfolio in the following buckets:\n\n* 25% long-term market investment using equity ETFs that largely track the SPX or do a breakdown between bonds and the market. I use Vanguard funds and a small cap value fund called CALF. I will not touch this money for 15+ years.\n* 25% cash. I like to be ready to buy the dips and have enough to spare. This way if a black swan event happens, I not only have money to invest, I have money to live on should things go bad for a while. This philosophy enabled me to buy options when COVID hit in 2020 without worrying if I could continue paying a mortgage for a year without a job. It’s also very useful if I have to roll covered calls to offset taxes and buy back expensive positions. I took this from Buffet FWIW.\n* 30% options, mostly in tax advantaged accounts (IRAs). I aim for a 50% annual return overall with this portfolio, though it fluctuates a lot year to year.\n* 10% long term blue chips stocks like Visa, Apple, MSFT, etc. I defend these positions when the stocks get overheated by selling calls on them and/or buying puts out of the money that expire after a typical sector rotation would occur. That can generate some additional income or help lessen the sting if the stock falls. \n* 6% long-term bets in a Roth IRA. These are equities I think all have a chance at a 10X return but that will take 5-10 years. It’s a lot of IPOs, small tech companies, and biotechs. I have to stomach pullbacks in this portfolio of 40-50% on the belief that a few of the 30 in here will more than compensate for it. This is a new strategy for me so I’ll let you know in 10 years if it works.\n* 3% leveraged hedges.These are puts on my own positions, stocks, or the market at large. Generally I use VIX calls, buy puts, occasionally buy calls on the SPXS, and run strangles on investments (betting both up and down on the same stock using calls and puts).  \n* 1% in other things I can’t mention due to the bots in here but they rhyme with tiptoe.\n\n**Use Technologies to Find Ideas**\n\nUnless you want to spend 8 hours a day reading news or are OK getting all your ideas from meme stocks and friends, you need to use tools to help you locate investment/trade ideas and be willing to pay for them. I value my time and am willing to pay .5% of my portfolio a year if it saves me time, and more if it generates higher returns. \n\nI’ve tried about a dozen or so services, including stock picking services like Fool and Investorsplace. Ultimately I decided the stock picking sites were not working for me because I did not want to wait 5 years to find out if they were the right recommendations and lost a lot of money learning that lesson on their pump and dumps. So I switched to analytics tools and my Fidelity platform. \n\nMy favorite tools to use are Zack’s VGM score, Levelfields, and Fidelity. The Zack’s VGM measures a stock’s value, growth rate, and momentum. It’s an easy screen I can run off the basic level subscription to get a list of companies to look at. The caveat is that you need to run this screen often because sometimes the companies on the list get stale and have already moved 99% of the way they are going to move. So you need to keep an eye on what’s new to the list to avoid losing money. That part is crucial. \n\nThe list usually represents companies that are well valued and poised to move up over the next 6-9 months. Warning: they can move very slowly so be patient and set your target exit to automatically exit. I use Fidelity to do my own due diligence on the stocks from there, examining their actual growth and earnings rates and ensuring there is no negative news against them which could drive down the price.\n\nA friend recently turned me on to an AI tool called Levelfields. They have a lot of news alerts but only for the types of events that matter and are organized thematically. It helps me find trades on news events with high returns or get in early on the small to mid-cap companies you don’t usually hear about which fall between the cracks in the penny stock discussions and cnbc favorites. They often send alerts on company events before there’s any news out, which is really helpful. The interface shows you how stocks perform when these events happen, so it’s easy to figure out my entry and exit points and statistical likelihood of success.   \nI use it a lot for pinpointing entry/exit points from options trades and have bought stock in a few companies I hadn’t ever heard of before that were absolutely crushing it on revenue and earnings. Not sure why, but they never came up in any of my Fidelity stock screens. I suspect it’s because there’s a lag in the data Fidelity is getting from S&amp;P but haven’t confirmed this. They send a lot of high quality alerts and my only wish is that they’d have a better way to rank the stocks in the alerts so I didn’t have to look up the stocks on Fidelity.\n\nI use Fidelity for basic news reading, running stock screens for high growth stocks at decent valuations, looking deeply at the history of earnings results, actually trading options, and for their options scanner which tracks abnormal option activity.  I sell puts when I see abnormal call volume and run strangles if the stock is at a mid-point in its 52-week price range in case it shoots up and then down. I always set an automated exit.\n\nFidelity also has a cool probability calculator for options I use when selling puts. It tells you the probability of a stock falling below a certain range. I use that number to determine where to sell puts without a lot of risk. I do two standard deviations out and still buy a put with a lower strike price as insurance and sell weekly puts on high vol companies like GME and TSLA. My typical goal is to make 800 a week from these plays which I use to fund new call positions.\n\n**Be Wary of Analyst Opinions**\n\nIf you’ve invested actively for a while, you’ve likely noticed a peculiar trend: as a stock is cratering, analysts are increasing their target purchase price on it. This is not for your benefit. Brokerages often make investment recommendations based on the research provided by their analysts, so there is inherent bias in the system. \n\nI’ve also found that few analysts recommend sell ratings. They are much more likely to issue calls to buy stocks. One study found less than 1% issued sell recommendations. What’s more, the track records of these analysts are usually about the same as coin flipping. CNBC has gotten very into pushing analyst views from big name firms (e.g. “Goldman Sachs says these 3 stocks are ready to explode”), but if you look at the actual analyst behind the headline, they are often inexperienced or wrong more than right. \n\nI am embarrassed to say I lost a lot of money listening to analyst opinions and believing their price targets were rooted in reality. It’s easy to get caught up in the excitement of an upgrade and if 4 analysts are all touting the stock at the same time it can create a bit of a ponzi effect, which is tradable. But it boils down to needing to do your own research.\n\n**Good Things Come in Pairs**\n\nJust about every stock has a peer or competitor. Most have several. I stopped trying to pick the winner and now place bets on multiple leaders. I’ve owned Visa and Mastercard. I own OLO and TOST. I have a handful of, um, herbal medicine providers. I like ETSY and AMZN. If you bet on a small group of competitors, it’s likely one will pull ahead and your odds of success will increase substantially. \n\nSimilarly, it enables you to monitor the news of competitors which many investors use as a proxy. What do I mean? If Mastercard reports low cross border transactions, it’s highly probable Visa will be experiencing the same thing. So you can use the information from Mastercard to alter your position on Visa.\n\n**Exercise Financial Discipline**\n\nEven when I’ve been successful picking investments, I’ve run into problems with how to handle my successes. We’ve all experienced the thrill of being up huge and wondering how much higher it will go. That’s usually the moment I’ve learned I should be taking some gains. A few rules I try hard to follow but still screw up:\n\n1. Take Profits Often.   \nWhen an option or stock hits 100% return, I look to take some profit. It may not seem possible if you only bought 1 call, but it is. Just roll the call to a higher strike price and ensure the credit to your account equals your original investment plus substantial return. You can let the new call ride in case the stock gets going up. This ensures you cannot lose money. My rationale here is simple: at a 100% gain, I now have more to lose than I have to gain. You will be surprised how much this adds up when you trade often and how often you can be up 150% then down to -50% on the same positions, which makes me want to break things.  \nIf you find yourself up huge on an equity investment, switch to options. I did this for my BABA position and it saved me. When it hit 300, I was up 200%. I sold all the stock and bought options for the same number of shares. I had about 60K in stock and switched to something like 6K in options. When BABA crashed down to 150 I really didn’t care much. I was only down 4.5K instead of 30K. I had my profit of 40K locked in, so being down 4.5K was no big deal.  \n\n2. Fail Fast.   \nIf the option price sinks to -50% in value, it’s likely time to call it quits unless you have a solid reason not to (praying is not a strategy). The other half of the value left can easily be eaten up by the time decay in the value of the option as I wait for the turnaround and it gets closer to the expiration date. If there’s negative news driving this, I’m out. I want to fail quickly. That allows me time to take the remaining 50% and generate gains with it on a better investment. I think this is the hardest rule for me to stick to as I tend to be an optimist.  \n\n3. Profit Both Ways.   \nIf a stock I hold hits an all-time high in price or valuation, I look for a way to profit from the downside by selling covered calls or buying cheap puts. This enables you to stash some cash while riding the volatility wave. I hold Visa and when it hit 235 headed into earnings, I sold 3 calls and bought 10 puts. This offset a paper loss for me of \\~20K yesterday alone by 7.5K in gains, which I secured as real profits. Assuming Visa will recover, that 7K adds 9% to this year’s returns for Visa.  \n\n4. Be Patient but Not Greedy.   \nI have learned the hard way from selling positions days before they pop that it can take a while before the market catches on to my investment idea, especially if using good tools. Asset managers, wealth managers, and passive investors are usually looking for new investments every 3 months, not daily, so stocks can stay stuck in a channel for some time before the world catches on to its awesomeness. Example, I held Upstart from April to August this year and sold it because it was running flat. A couple weeks later the stock tripled. FML were the only words I could think of at the time. The second thought I had was that I should’ve bought just one call option to replace the stock I sold.  \nOn the flip side, once a stock does move a lot higher, don’t be greedy. What goes up fast can come down just as fast. I feel a lot worse watching a stock/option go up 200% then come down all the way or more than I do exiting with a 100% gain watching the stock go up more. Don’t chase the perfect trade. It’s a white whale. Just make money.  \n\n5. Everyone Has a Plan Until You Get Punched in the Mouth.   \nThis is as true in boxing (thanks Mike) as it is investing. That’s why it’s essential to have a plan A and a plan B should plan A not work out as you thought. Waiting through it can work, but it isn’t a very effective strategy for navigating a changing environment.   \nSo if my thesis is that the stock will do well with rising COVID rates and COVID rates stop rising, I try to have plan B ready. I keep a lot of notes. I track every trade. I review what went wrong with trades quarterly. I learn. I avoid the pity party as much as possible and drink vodka for the rest. I try not to fall in love with any stock. And I know that even if I lose 100K, there’s more money to be made in the coming years and decades if I stick it out.",
        "subreddit": "stocks",
        "title": "I made $500,000 trading stocks and options in 18 months. These are the 15 things I did that worked best.",
        "url": "https://www.reddit.com/r/stocks/comments/qi92fg/i_made_500000_trading_stocks_and_options_in_18/",
        "created": 1635529183.0
    },
    {
        "author": "cookingboy",
        "created_utc": 1635198320,
        "id": "qfr8l1",
        "num_comments": 697,
        "num_crossposts": 0,
        "selftext": "https://www.reuters.com/business/autos-transportation/hertz-orders-100000-tesla-cars-bloomberg-news-2021-10-25/\n\n&gt;Oct 25 (Reuters) - Tesla Inc (TSLA.O) surpassed $1 trillion in market value on Monday after landing its biggest-ever order from rental car company Hertz, a deal that reinforced the electric car leader's ambitions to top the entire auto industry in sales over the next decade.\n\n&gt;Tesla shares surged as much as 14.9% to $1,045.02, making it the world's most valuable automaker according to Reuters calculations based on its latest filing.\n\n&gt;Even Tesla Chief Executive Elon Musk expressed surprise at the velocity of the surge. \"Strange that moved valuation, as Tesla is very much a production ramp problem, not a demand problem,\" Musk tweeted in reply to a comment by Ross Gerber, co-founder of the investment fund Gerber Kawasaki and a Tesla shareholder.\n\n&gt;\"Wild $T1mes!\" Musk wrote in a separate tweet.\n\n&gt;Tesla is the first carmaker to join the elite club of trillion-dollar companies that includes Apple Inc (AAPL.O), Amazon.com Inc (AMZN.O), Microsoft Corp (MSFT.O) and Alphabet Inc (GOOGL.O).\n\n&gt;Most automakers do not boast about sales to rental car companies, often made at discounts to unload slow-selling models. But for Tesla and its investors, Hertz's decision to order 100,000 Tesla vehicles by the end of 2022 showed electric vehicles are no longer a niche product, but will dominate the mass car market in the near future.\n\n&gt;\"Electric vehicles are now mainstream, and we've only just begun to see rising global demand and interest,\" Hertz interim Chief Executive Officer Mark Fields told Reuters.\n\n&gt;Tesla Chief Executive Elon Musk has set an annual sales growth target of 50%, on average, eventually reaching 20 million vehicles a year. That would be more than twice the volume of current sales leaders Volkswagen AG and Toyota Motor Corp (7203.T).\n\n&gt;Consumer demand for electric vehicles is turning a corner in some major markets. The Tesla Model 3 was the best-selling vehicle of any kind in Europe last month, consulting firm JATO Dynamics reported Monday. read more\n\n&gt;Tesla also appeared on Monday to be making progress resolving regulatory problems that threatened its business in China. The company said it had opened a new data and research center in Shanghai to comply with government requirements that data collected from vehicles in China stay in the country. read more\n\n&gt;However, Tesla faced new U.S. regulatory pressure on Monday. The National Transportation Safety Board's new chief sent Musk a letter questioning why Tesla was rolling out its \"Full Self Driving\" software even though the company has not officially responded to the NTSB's questions about the automated driving system's safety.\n\n&gt;\"It (the Hertz order) puts an exclamation point under guidance for 50%+ growth in deliveries,\" Roth Capital analyst Craig Irwin said. \"Another solid piece of evidence EVs are going mainstream.\"\n\n&gt;Tesla now faces the daunting day-to-day challenge of becoming a high-volume automaker growing at a rate not seen since the early 1900s when demand exploded for Henry Ford's Model T.\n\n&gt;Tesla is coping with an order backlog for its vehicles and extended supply chain disruptions. Tesla Chief Financial Officer Zachary Kirkhorn cautioned investors during a call last week that Tesla's near-term production goals will hinge on resolving those disruptions and ramping up two new, huge assembly and battery plants in Austin and Berlin. read more\n\n&gt;\"There is quite an execution journey ahead of us,\" Kirkhorn said.\n\n&gt;Rivals are not sitting still. Daimler AG's (DAIGn.DE) Mercedes-Benz brand, General Motors Co (GM.N), Ford Motor Co (F.N), and startups such as Lucid (LCID.O) and China's Xpeng (9868.HK) are all battling Tesla with new electric cars or trucks.\n\n&gt;Investors and analysts, for now, are looking past the near-term challenges. Morgan Stanley boosted its Tesla price target by 33% to $1,200 as the brokerage expects the electric carmaker to surpass 8 million deliveries in 2030.\n\n&gt;The Hertz deal also underscored the power of the Tesla brand, as the rental car company emerges from bankruptcy and aims to revive its once-dominant brand. Hertz's rescue is led by a group of investors including Knighthead Capital Management, Certares Opportunities and Apollo Capital Management.\n\n&gt;\"We absolutely believe that this is going to be competitive advantage for us,\" interim Hertz CEO Mark Fields said of the Tesla order, due to be delivered by the end of 2022.\n\n&gt;\"We want to be a leader in mobility. ... Getting customers experience with electrified vehicles is an absolute priority for us.\"\n\n&gt;Tesla's cheapest Model 3 sedan starts at about $44,000, making this order worth about $4.4 billion, if the entire order were for its mass-market sedan.\n\n&gt;Fields declined to say how much Hertz was paying for the order. Tesla was not immediately available for comment.\n\n&gt;With the current order, Hertz said EVs will make up more than 20% of its global fleet. Fields cited the rising number of EVs for sale and consumer interest in electrified vehicles.\n\n&gt;Hertz also said it was installing thousands of chargers throughout its network. Customers who rent a Tesla Model 3 will have access to 3,000 Tesla supercharging stations throughout the United States and Europe.\n\n&gt;Tesla shares closed up 12.7% at $1,024.86.",
        "subreddit": "investing",
        "title": "Tesla passes $1T valuation on news of Hertz ordering 100,000 cars.",
        "url": "https://www.reddit.com/r/investing/comments/qfr8l1/tesla_passes_1t_valuation_on_news_of_hertz/",
        "created": 1635227120.0
    },
    {
        "author": "gorays21",
        "created_utc": 1635113459,
        "id": "qf2hml",
        "num_comments": 557,
        "num_crossposts": 0,
        "selftext": "This week will be crazy because some of reddit's favorite companies will have earnings and they include:\n\n* AMD\n* Amazon\n* Apple\n* Microsoft\n* Enphase\n* Alphabet(google)\n* Robinhood\n* Enphase energy\n* Teladoc\n* Shopify\n\nOther companies with earnings include: Boeing, GM, Coco cola, Visa, Texas Instruments, etc.\n\n Either way, this week is gonna be interesting cause lot of companies expected to post positive earnings. ",
        "subreddit": "stocks",
        "title": "This week will be insane!",
        "url": "https://www.reddit.com/r/stocks/comments/qf2hml/this_week_will_be_insane/",
        "created": 1635142259.0
    },
    {
        "author": "gunsoverbutter",
        "created_utc": 1635557302,
        "id": "qir3da",
        "num_comments": 536,
        "num_crossposts": 0,
        "selftext": "What would be your 5 growth stock picks for 2022? About 50% of my portfolio will be made up of VOO and VOOG for steadiness and diversification. But I like to add in some single stocks to give a little more growth. We can look back at this post in 1 year and see how our picks played out. My picks are MSFT, ODFL, TSLA, INTU, GOOG. And my wildcard would be ABNB. I think tech is still going to reign supreme, it’s just hard to beat the profit margins and scalability.",
        "subreddit": "investing",
        "title": "Pick your 5 growth stocks for 2022",
        "url": "https://www.reddit.com/r/investing/comments/qir3da/pick_your_5_growth_stocks_for_2022/",
        "created": 1635586102.0
    },
    {
        "author": "gunsoverbutter",
        "created_utc": 1634949818,
        "id": "qdua1s",
        "num_comments": 482,
        "num_crossposts": 0,
        "selftext": "What stocks or funds are you loading up on going into 2022? I’m still heavy in tech, but I’m wondering how inflation will impact that sector. We also have supply chain issues, looming crypto regulation, and an increasingly aggressive China. I’ve had some interesting winners so far in 2021, like GNRC, ODFL, and good old VOO. Like many of you, I was clobbered by my early 2021 losses in green energy and have finally clawed my way back into the green. I made some changes around July to load up on AAPL, MSFT, and GOOG. And TSLA is finally making me some money again. Just curious to hear what you all are doing.",
        "subreddit": "investing",
        "title": "How are you preparing for 2022?",
        "url": "https://www.reddit.com/r/investing/comments/qdua1s/how_are_you_preparing_for_2022/",
        "created": 1634978618.0
    },
    {
        "author": "luker_5874",
        "created_utc": 1635547147,
        "id": "qio71m",
        "num_comments": 398,
        "num_crossposts": 0,
        "selftext": "I have about 10k invested in a tech-centered mutual fund. It's don't okay, but it isn't beating Nasdaq, and the fees are considerably higher. \nI'm not really interested in day trading, just want to stash it in another fund or maybe split it between 5-10 companies. I've been eyeing MSFT like a hawk, yet I always think it's too high. Then it jumps again!",
        "subreddit": "stocks",
        "title": "Where would you put 10k today to set it and forget it?",
        "url": "https://www.reddit.com/r/stocks/comments/qio71m/where_would_you_put_10k_today_to_set_it_and/",
        "created": 1635575947.0
    },
    {
        "author": "chriizzl",
        "created_utc": 1634577257,
        "id": "qar6j5",
        "num_comments": 392,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nI did put a lot of research into the current situation for quite some time and finally build a portfolio I am 100% behind long-term. However, the more I learned, the more sure I am that we will experience a market crash rather soon, than late.\n\nI am not here to debate whether or not you think this is true, but the situation for this thought game is that we might see a crash similar in numbers, not principle like 2008' all over again.In general, during times of high inflation, most businesses will not come out well. The earnings will go up, but they need to put more money into their own business to even stay in the same place. A hedge for this are companies that can easily scale their business without needed money flow. I am looking at you Facebook, who can place 10% more ads, Adobe who can increase their product price without fear of losing customers, Apple, Microsoft...\n\nThe theory behind this discussion would assume that GameStop is a good hedge and to some degree AMC as well, I even heard that from the high ups in a very big, german bank, which is incredibly weird since they were against it months ago and did not even want to talk about it in the first place. This assumes that the crash is happening because of said theory I explained below in short in an edit. It does not mean that a high percentage of the entire portfolio should persist of them, but a chunk just in case might be a very good idea. The market is more complex than many think.\n\nAnother hedge and long term hold can not be mentioned in this sub, but you might guess what it is. Sadly, we cant debate this here. Has to do with weird blocks and tokens, latter of which might change the whole gaming industry and I am thankfully in the position where I can take constant profits from it in percentages that sound absolutely insane.\n\nSo, in case of this **theoretical** scenario, I would like to get everyone's opinion on this. I want to be clear, I value every single opinion and would love the most input possible. In case of no crash, my investments should grow steadily, but in case of a crash due to named circumstance, they would skyrocket. Again, this is purely theoretical, I do not want to discuss whether or not it is happening, but what you would do in case it will happen in the near future.\n\n&amp;#x200B;\n\n**TLDR: How would you hedge against a potential market crash ala 2008 due to Evergrande + GameStop and the overall situation?**\n\n*Since I got downvoted to hell on a different subreddit for even mentioning GME and spreading the word, I will add the theory behind GameStop again, even though most of you might know this already.*\n\n*The theory: The most part of the stock is traded in Dark Pools and all the shorting Hedge Funds are telling us that they closed their position, which is mathematically impossible. Do the research yourself. So, what I think is happening, is that all the shorts are actually synthetic and not real shares. There is tons and tons of proof of it, too much to even deny at this point. They exercise and sell deep ITM calls in order to get the FTDs. So basically, they are passing them from one to another, to another.*\n\n*Think of it like this, a good analogy I found: You get a credit card with 10.000$ on it, max it out and have to repay next month. However, you have endless credit cards, so you can get another credit card and \"pay\" the 10.000$ with that. The debt is still there, its just getting passed. You can do that forever. Now you need more money, so you do this all over again and keep digging the grave deeper and deeper. In this theory, multiple times the float and continuing. In order to stop that, you have to lock the float entirely, which is why everyone is currently directly registering their shares. IF this is true, I do not have to explain the potential outcome. There is simply too much proof as that I can deny that at all.*\n\n*Computershare confirmed this:Quote from their Twitter: \"Shares held directly on the books of US companies through a transfer agent are not held at DTCC. As such, shares are not available to be loaned for any means within the security markets. Computershare is a registered transfer agent &amp; therefore does not lend shares in any capacity\"*\n\n*I need to admit I am a bit disappointed by the negative response from a lot of people, but I would like to keep this open and come back one year later, I will simply take all the downvotes from here. I will still read everything and appreciate any opinion on the topic.*\n\n*Cheers, have a nice week everyone!*",
        "subreddit": "wallstreetbets",
        "title": "Hedging against a Market Crash, 2008' all over again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qar6j5/hedging_against_a_market_crash_2008_all_over_again/",
        "created": 1634606057.0
    },
    {
        "author": "AutisticDravenMain",
        "created_utc": 1634663967,
        "id": "qbg773",
        "num_comments": 372,
        "num_crossposts": 0,
        "selftext": "College Student, been working my ass off during the summer at an appliances store, 11hrs a day, 6 days a week, moving condensers and refrigerators around. Been thinking about treat myself something nice after my first paycheck, but heard about all the great things of delayed gratification and compound interest. So, I saved every penny I possibly could and invested in stocks. After school started, I continued to work there part-time.\n\nFast forward to 3 weeks ago, I broke with my girlfriend and went on a shopping spread. Bought a nice PC, pair of sneakers, and some fancy outfit for the fall/winter. I don't really regret the purchases, as impulsive as it may sound, I can actually manage to pay it off in  3 months. But just during my class this morning, my manager texted me and laid me off. Mostly because as the weather gets colder, fewer people will need A/C and fewer things to do in the store. So now my plan is in scrumble.\n\nI have about 7K in stocks, and 3K in credit card debts. \n\n1st option, borrow from friends and pay them off after I got another job.\n\n2nd option, apply for a balance transfer card, get the debts to 0% APR, and pay the minimum off until I got a job.\n\n3rd option, and my least favorite, sold half of my position, and just get the debts out of the way right now.\n\nMy current position:\n\n$SOFI 140\n\n$MSFT 5\n\n$AGNC 50\n\n$AXP 4\n\n$JPM 4\n\n$GS 1\n\n$AAPL 1\n\nand some fractional shares of TSLA, ISRG about 500.\n\n&amp;#x200B;\n\nIf I do go with 3rd option, which stocks should I let go first?\n\nAny helps are greatly appreciated.",
        "subreddit": "stocks",
        "title": "Should I liquidate my stocks to pay for credit card debts?",
        "url": "https://www.reddit.com/r/stocks/comments/qbg773/should_i_liquidate_my_stocks_to_pay_for_credit/",
        "created": 1634692767.0
    },
    {
        "author": "Global_Chaos",
        "created_utc": 1635350737,
        "id": "qh02ab",
        "num_comments": 342,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft going MARCOHARD",
        "url": "https://i.redd.it/asj4o18un0w71.jpg",
        "created": 1635379537.0
    },
    {
        "author": "raviman8",
        "created_utc": 1635448489,
        "id": "qhuawy",
        "num_comments": 304,
        "num_crossposts": 0,
        "selftext": "I am about to receive $10,000 and want to invest it in one of the companies below. I may pull the money out in the next 6 months but hopefully not. Giving that I'm looking to invest and make a decent return. I understand there is no guarantee and I could theoretically lose it all so please don't respond with negativity. I have a good chunk of money already invested in index funds such as, VFV and VEQT. I am considering investing in one of the companies below what would you do?\n\nAAPL\nTSLA\nTSM\nAMD\nMSFT\n\nI and personal leading towards Tesla just because the growth can be insane at times...",
        "subreddit": "stocks",
        "title": "What would you do with $10,000?",
        "url": "https://www.reddit.com/r/stocks/comments/qhuawy/what_would_you_do_with_10000/",
        "created": 1635477289.0
    },
    {
        "author": "anarchy_pizza",
        "created_utc": 1635017165,
        "id": "qebmzx",
        "num_comments": 266,
        "num_crossposts": 0,
        "selftext": "If you could buy 100 shares of \n\nVisa\nMsft\nWaste management \nWalmart\n\nWhich would you and why? My plan is to sell out of the money covered calls to just to collect an extra $500 a year. \n\nI’ve done my basic DD on them and would be happy with any but am having trouble with a final decision. Any thoughts would be appreciated.",
        "subreddit": "stocks",
        "title": "Buying 100 shares of 1 blue chip, but which?",
        "url": "https://www.reddit.com/r/stocks/comments/qebmzx/buying_100_shares_of_1_blue_chip_but_which/",
        "created": 1635045965.0
    },
    {
        "author": "nsomani",
        "created_utc": 1635133732,
        "id": "qf8cyv",
        "num_comments": 243,
        "num_crossposts": 0,
        "selftext": "I was inspired by this legendary post where a user predicted the Amazon-Affirm partnership: [https://www.reddit.com/r/wallstreetbets/comments/p50n5p/amzn\\_is\\_up\\_to\\_something\\_with\\_afrm\\_obsessive\\_dd/](https://www.reddit.com/r/wallstreetbets/comments/p50n5p/amzn_is_up_to_something_with_afrm_obsessive_dd/)\n\nI wrote a scraper to hit URLs like [amazon.com/affirm](https://amazon.com/affirm) for thousands of companies in the NASDAQ. Over the last few weeks, I've noticed a handful of pages newly popping up on Teladoc's website:\n\n[https://www.teladoc.com/google/](https://www.teladoc.com/google/)\n\n[https://www.teladoc.com/apple/](https://www.teladoc.com/apple/)\n\n[https://www.teladoc.com/microsoft/](https://www.teladoc.com/microsoft/)\n\nYou can see that none of these pages existed before on Wayback Machine: [https://web.archive.org/web/20210901000000\\*/teladoc.com/google](https://web.archive.org/web/20210901000000*/teladoc.com/google)\n\nI'm not sure what it means but it looks like they are actively growing their Expert Medical Opinion service, but nothing has been written about it online yet.\n\nNext I made this post on Blind, an anonymous forum for employees at different companies to ask questions. It looks like none of the companies offer Teladoc to their employees yet (though Google offers LiveHealth): [https://www.teamblind.com/post/Do-Apple-Google-or-Microsoft-offer-telemedicine-as-a-benefit-zFHf0sdG](https://www.teamblind.com/post/Do-Apple-Google-or-Microsoft-offer-telemedicine-as-a-benefit-zFHf0sdG) so I'm imagining the partnerships are still underway.\n\nThey're reporting earnings on Oct. 27th. I could see these partnerships being announced either around then or in the following weeks if that's what's going on. In the meantime I've bought $TDOC 155c 1/21.",
        "subreddit": "wallstreetbets",
        "title": "It looks like $TDOC has been quietly attracting big customers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qf8cyv/it_looks_like_tdoc_has_been_quietly_attracting/",
        "created": 1635162532.0
    },
    {
        "author": "AbuSaho",
        "created_utc": 1634475260,
        "id": "q9y54z",
        "num_comments": 223,
        "num_crossposts": 0,
        "selftext": "This probably happens often, but I rarely see any posts about it. You rarely hear from the losers. Since those people probably just stop posting on forums when it happens. So I'm swallowing the pride and posting about my losses. \n\nI started invested January 5 this year as a New Year's resolution. I got Rich Dad Poor dad youtube video recommended to me and didnt realize I had been spending my money on liabilities all this time. I went heavy into SPACs, Cathie Wood stocks, biotech, and I got into AMC due to the \"recovery\" stock trade that was all over CNBC. I somehow didnt have a red day with those stocks for 15 straight days and the turning point was WSB looking at short interest and pumping several stocks late January. And Robinhood shutting off the buy option. I had just started investing and didn't realize at the time that turning off buying pressure meant the stocks would tank. And that was my first blow up. My portfolio dropped 35% in a day. That day was January 28th.\n\nI started following WSB since while my account blew up it seemed their stocks were getting massive gains. So I went all in on weed stocks. And I recovered my losses. But I didnt take profits and I had another blow up on February 10th. My account had another 35% drop. As I was in options and the entire weed sector crashed in premarket. So by the time I could sell it was too late.\n\nWith what I now know I should have had trailing stop losses if I was in momentum stocks but I decided after the weed stock crash to go all in on tech stocks to name some of them CRWD, AAPL, MSFT, CRWD, NET, and SE. It worked for 2 months I had somehow recovered my losses for the third time. Then around the week of 4/20 there started to be inflation panic and those stocks tanked. Stock subs and CNBC were calling tech stocks terrible at the time and after three weeks of constant losses and my account blew up for the third time I sold all my stocks around May 10-13. Which in retrospect was a bottom.\n\n\n\nSo I got back into stocks the following week May 17th. And I stopped following WSB stock picks, did my own DD, and have a diversified portfolio and a Roth IRA with index funds. But Im sick to my stomach since im down still down 40% overall 5 months later. When I gave up on WSB stocks that meant I sold AMC in February which if I had I held that would have recovered all my losses from the May panic sell at the bottom. Now once a month there is FUD that the market is overvalued and there is gonna be a crash on stock subs and CNBC. And im like wtf I already dealt with three crashes that just gets swept under the rug with SPACs, weed stocks, and several small cap stocks losing like 70% of their value since Febuary. It just feels like it is a different market from my first two months and I messed up not taking profits on three occasions. My portfolio would have been up 500% instead im down 60%.",
        "subreddit": "stocks",
        "title": "I blew up my account three times this year and I feel sick to the stomach since im not sure if I will recover from the third anytime soon.",
        "url": "https://www.reddit.com/r/stocks/comments/q9y54z/i_blew_up_my_account_three_times_this_year_and_i/",
        "created": 1634504060.0
    },
    {
        "author": "mpoozd",
        "created_utc": 1634222631,
        "id": "q815wk",
        "num_comments": 199,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft to shut down LinkedIn in China - The last US social network in China",
        "url": "https://www.cnbc.com/2021/10/14/microsoft-to-shut-down-linkedin-in-china.html",
        "created": 1634251431.0
    },
    {
        "author": "CptIskarJarak",
        "created_utc": 1635522421,
        "id": "qifrol",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "Microsoft has overtaken Apple to become the most valuable company in the world. At the time of posting Microsoft has a market cap of 2.46 trillion whole Apple has a market cap of 2.45 trillion. Not sure how long this will last but with Apple price movement very sluggish and Microsoft roaring this could be the new ranking for a while.",
        "subreddit": "stocks",
        "title": "Microsoft becomes most valuable company in the world",
        "url": "https://www.reddit.com/r/stocks/comments/qifrol/microsoft_becomes_most_valuable_company_in_the/",
        "created": 1635551221.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1635266535,
        "id": "qgaib2",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "Well my NVDA had grown 108% to 6.5% of my portfolio and I woke up debating whether I should trim a little.  \n\nNVDA has been on a great run and I bet in another few months it'll be getting closer to $300, but I felt like I was getting a little greedy and 6.4% was a little much although I love Nvidia and believe its a long term winner.\n\nSo I feel a little bad and a little better now that it's around 5.1% portfolio.  Probably didnt make much of a difference in the long run either way, but to me approaching 7% portfolio seemed a little risky.\n\nThe gains were long so little tax.  I guess we have to take profits once in a while right?\n\nAnyways I feel the market is so stretched right now so I don't feel bad adding to my cash for if we have a correction!\n\nJust wanted to say Nvidia is one of my favorite investments and companies besides MSFT AAPL and stuff.\n\nI'm still officially up 101%.  Should I trim to 4.5% or just leave it be now?\n\nThanks.  Long NVDA!!",
        "subreddit": "stocks",
        "title": "Took my first profit and feel a little bad about it NVDA",
        "url": "https://www.reddit.com/r/stocks/comments/qgaib2/took_my_first_profit_and_feel_a_little_bad_about/",
        "created": 1635295335.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1633214683,
        "id": "q056if",
        "num_comments": 182,
        "num_crossposts": 0,
        "selftext": "I realize there will be a lot of pressure on faang and tech coming up but I'm long term.  However I'm wondering if being long those (faang) I shouldn't make some short term moves to lighten my tech exposure.\n\nThe shares would be long that I'm exiting so taxes aren't much for me, although I'll feel like I'm cheating on my tech names lol.\n\nI do have things like VTI, HD, UNH, medical devices mutual fund (FSMEX), COST, ODFL, TMO, but am about 50% tech names like MSFT GOOGL NVDA AAPL ASML PYPL CRWD SQ etc.\n\nI also am 20% or a little more cash right now.  I was planning on deploying the cash into faangs if we get a significant pull back in those names which I don't feel we have had yet.\n\nI'm mainly wondering if that's a good strategy (buying significant dips in tech mega cap) or if some cash should be deployed into \"reopening\" (although I'm kind of tired of hearing about that! Lol) stocks,\n\nOr deployed into industrials or whatever. \n\nI realize being 50% tech I'm gonna get hit, but I always think of tech rebounding eventually so it doesn't worry me.  I know that long term MSFT AAPL GOOGL NVDA will go up imo.\n\nMy portfolio is already down about 4% for September, but I'm not panicking yet!",
        "subreddit": "stocks",
        "title": "Tech heavy, 20% cash. What to do.",
        "url": "https://www.reddit.com/r/stocks/comments/q056if/tech_heavy_20_cash_what_to_do/",
        "created": 1633243483.0
    },
    {
        "author": "HoneyMoney76",
        "created_utc": 1634419416,
        "id": "q9kxjf",
        "num_comments": 179,
        "num_crossposts": 0,
        "selftext": "There is a stock that closed on Friday at $9.29, that has every chance of being just as big an opportunity. \n\nIt has a CEO that has said you need to be a trillion dollar company to get off the mat. I think that is his goal! They are at the top of their game in a number of product areas. They have suffered in the past from having their hands tied by NDA’s but things are changing and they can now take credit for their own work.\n\nThey have gone from having 1 US office to signing a 10 year lease on a second US office and opening a sales office in Nuremberg in Germany. \n\nTheir board of directors includes a number of staff who have worked at Google and Ford amongst other places. \n\nThey have no debt. At the last earnings call they had $145 million in the bank. \n\nThey have had Microsoft as a customer since 2017 because Microsoft couldn’t make the Hololens without this company’s tech. They have also been crucial in Microsoft winning a $22 billion contract with the US army, and there are likely to be other orders in due course from other armed forces.\n\nThey also have Sharp Foxconn as a customer (you know, the massive company who make iPhones for Apple).\n\nThey have invented tech that is heavily patented that should mean they are a part of any smart glasses that ever become available to buy.\n\nTalking of patents, they have nearly 500 patents.\n\nThey have also created picop projectors that knock spots off the Amazon glow product, and will hopefully get its moment of glory in the near future.\n\nThen we get to the biggest cherry on the biggest cake of all.\n\nThey have spent at least 10 years perfecting best in class automotive LIDAR. They have been working with tier 1/OEM’s and mobility as a service companies for at least a couple of years. They built their product to exceed the spec that manufacturers gave to them. They can double its capability if needed and although it is a very slim profile and only the size of a VHS cassette, the CEO has said they can halve the size if needed! It can be fitted discreetly where your rear view mirror is positioned. It doesn’t negate the stylish appearance of your car, and does not affect its aerodynamics. It means it can even be fitted to convertibles and cars with sun roofs. Initially they planned to produce one luxury LIDAR model, but due to high demand from the prospective customers they have launched 4 versions, the premium model plus a short range, a medium range and a long range ( which can all be used to complement any other systems installed under prior agreements). Their premium version and the long range one have a range of 250 metres. Their LIDAR does not suffer any issues in bright sunshine, it works the same in any weather day or night. It has also been designed to suffer zero interference from any other nearby LiDAR units. It has the highest resolution of any existing LIDAR. The CEO has said they are aiming at a cost under the $1000 mark and that the profit manager is 50%. So that’s a maximum profit of $500 per unit. They have said they envisage maybe 4 units per vehicle. So that’s scope for up to $2000 profit per vehicle. Now we know they have multiple interested companies and it is only a matter of time before orders are placed as they have said the first units can be shipped in this quarter! Let’s take VAG in Germany as an example. They produce 200,000 electric cars per month. Never mind however many petrol or diesel cars. 200,000 at $2000 profit per vehicle is $400,000,000 potential profit per month!!!! That is $4.8 billion per year. For just electric cars in Europe from just one manufacturer!\n\nNow consider how much profit there could be from other manufacturers - Ford, BMW, Bugatti, Renault, Peugeot, Fiat, Ferrari, and then US and Canada and Asian countries.it’s mind blowing how much potential there is for the LIDAR market.\n\nDr Luce recently left a CEO position at Optoflux to become head of sales for Europe and Asia. Ask yourself why someone would take a step down in title. His comment was that he believes this company will take a significant share of the market. \n\nThey showcased their LIDAR at the IAA show in Germany, leaving no doubt they are best in class. Better than any other LIDAR that exists or that is in development.\n\nThey own the patents, they own the hardware and they own the software. They can sell to any company that wants to include this tech in their vehicles.\n\nSo - \n\n*Better than any other LIDAR with highest resolution \n*works in sunlight and nighttime \n*zero interference \n*slim profile and can be even smaller if needed and fitted discretely inside the windscreen\n*cheaper than others\n*Scaleable\n*4 versions to suit all needs\n*units available this quarter\n*made by a team who have proved their pedigree through having Microsoft as their customer for 4 1/2 years.\n\nThe company, in case you haven’t already guessed is Microvision. \n\nFor anyone who is thinking, oh but that was a pump and dump in April. Yes there was hype, as when the A sample was confirmed as being complete rumours did the rounds that Microvision might be bought out. But they weren’t and I don’t think they will be for sale. They are in the strongest place they have ever been and this is finally their time. The world has finally caught up with their tech and is ready to embrace their genius. \n\nNow there will be some who will post negative stuff on this post, I get it. I don’t care. I have enough shares that I and my family will be set for life when this plays out. To anyone who knew what they held, this was never a short term trade, it’s a chance to be in from the start of their success. We don’t know precisely when. But we know it is inevitable that this will soar in the very near future and surpass any pump and dump. But cheers to you all for April as that just led to it being even more shorted than it was before, which will only serve to enhance our profits when those sales orders get announced. There is a very good reason (well millions actually!) why Jeffries included MIcrovision on a list with GameStop and AMC of stocks that they wouldn’t allow people to short. It’s recently taken someone on here over 6 weeks to transfer his 205000 Microvision shares because he suspects his broker hadn’t actually bought his shares and couldn’t quickly buy them. \n\nNow, back to my opening question. If you could turn back time would you want to buy into Google or Amazon or Apple for under $10?\n\nIf so then this is likely to be the closest opportunity like that you will ever get.  Can you afford to not be a part of it? Or will you kick yourself forever, wishing if only….we can’t turn back the clock for Google or Amazon or Apple, but now is the time to get in on Microvision, and have a tale for your kids or grandkids.\n\nI will happily say I told you so to anyone who doesn’t act on this, when they are dominating the market, which they will.",
        "subreddit": "wallstreetbets",
        "title": "If you could turn back time, would you buy into Google or Amazon or Apple when they were under $10?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q9kxjf/if_you_could_turn_back_time_would_you_buy_into/",
        "created": 1634448216.0
    },
    {
        "author": "StopTheBan420",
        "created_utc": 1634055885,
        "id": "q6px7o",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "MSFT YOLO",
        "url": "https://i.redd.it/32vv3btkp1t71.jpg",
        "created": 1634084685.0
    },
    {
        "author": "channelchek",
        "created_utc": 1635269605,
        "id": "qgblya",
        "num_comments": 142,
        "num_crossposts": 0,
        "selftext": "Going by P/E ratio for valuations is essentially boomer lingo in this market environment. It does seem concerning how far ahead these valuation are getting though, as far as the big tech names go.   \n\n\n \"Elon Musk was surprised at the price increase of Tesla stock as his personal worth rose by $36 billion yesterday (October 25). Shares of Tesla ([TSLA](https://www.channelchek.com/news-channel/Raw_Materials_and_the_Scalability_of_Tesla%E2%80%99s__Vision)) jumped by 12.7% to $1,024.86. This equated to a market capitalization of $1.01 trillion.\"  \n\n\n\"**Risk to Index Investors**\n\nTesla now has a price-earnings (P/E) ratio of 332. The automotive industry P/E ratios generally fall between 10 to 30 depending on expected results. In the broader market, there are very few trillion-dollar companies.  They are the top five companies by market cap in the S&amp;P 500, Apple, Microsoft, Google parent Alphabet, Amazon, and Tesla. In the aggregate, they are worth $9.3 trillion. That's almost 23% of the benchmark S&amp;P 500 [US stock index's](https://www.channelchek.com/news-channel/Why_Index_Funds_Could_be_a_Mistake_in_2020) total value. Add in Facebook, which is a bit short of a trillion and these six stocks have a 25% influence over the S&amp;P 500 movement.\"  \n\n\n[full read](https://www.channelchek.com/news-channel/Tesla%E2%80%99s_Strange_Influence_on_the_Markets)",
        "subreddit": "StockMarket",
        "title": "TSLA at a 332x P/E ratio.... At what point are these tech valuations ridiculous, does it even matter?",
        "url": "https://www.reddit.com/r/StockMarket/comments/qgblya/tsla_at_a_332x_pe_ratio_at_what_point_are_these/",
        "created": 1635298405.0
    },
    {
        "author": "BoomShakaLaka9",
        "created_utc": 1633362049,
        "id": "q17xof",
        "num_comments": 135,
        "num_crossposts": 0,
        "selftext": " The **Semiconductor Sector** has generated more than just solid gains so far this year, chip shortage has helped accelerate sales of semiconductors, sending the stock prices of companies that design and sell chips skyrocketing.  \nIn the last couple of weeks, I thought about adding a Semiconductor company to my portfolio, I decided to focus on AMD, NVIDIA, and INTEL, but because it might be a long post I decided to post in parts, the next post will be bot AMD so stay tuned.\n\n**If you think there is a company in this sector more worthwhile looking into, I'd be happy to hear some suggestions.**\n\n[ IMAGE SOURCE: youtube - cha cha video](https://preview.redd.it/avit8vg2dgr71.png?width=1280&amp;format=png&amp;auto=webp&amp;s=8a7f6bd2f815eaffa877381a845b1f0061e66ccb)\n\n#  Nvidia ~ $NVDA\n\n&gt;\"Nvidia is a platform story. We think there are many tentacles of future growth opportunity for Nvidia inclusive of the data center momentum that they are seeing today\" - Wells Fargo analyst\n\nNvidia is a big winner of many of the big tech events of the past year, including the global chip shortage, cryptocurrency volatility, and mining, the relentless fight by PC gamers to find RTX 30 series graphics cards in stock, and rising demand across segments-from work-from-home laptops to data centers. During it all, NVDA stock has continued its relentless climb, adding over 60% to its value so far in 2021.\n\n# Q2 Earnings\n\nAlmost all the company's business segments registered eye-popping growth in the 2nd quarter of fiscal 2022. The company reported a record Q2 revenue of $6.51 billion. This was up 68% year-over-year, which handily beat forecasts. Gaming revenue — all those RTX 30 series graphics cards — hit $3.06 billion, up 85% YoY. Datacenter revenue also set a record at $2.37 billion. Adjusted earnings of $1.04 per share (compared to 55 cents a year ago) also beat estimates.\n\n# Crypto Market dependence\n\nWhen of the negative points in NVDA Q2 earnings is that CMP sales came in well under the company’s estimates. CMP is a graphics card that was designed specifically for the cryptocurrency market. When the price of cryptocurrencies like Bitcoin fall, crypto mining rigs power down. Miners stop buying GPUs.\n\nFor Nvidia, this was felt in Q2. The company had projected it would sell **$400 million** worth of CMPs in the quarter. Instead, it sold just **$266 million.**\n\n# Future Growth In the Gaming Segment\n\nNVIDIA's 80%-plus market share of gaming graphics cards will be a big tailwind for the company. Its video gaming revenue more than doubled last quarter to $2.76 billion. Jon Peddie Research estimates that the market for discrete gaming GPUs could jump from $23.6 billion last year to more than $54 billion by 2025. NVIDIA's dominant market share means that it could win big from the additional revenue opportunity. \n\n# Arm Deal\n\nNvidia is in the process of acquiring ARM Holdings from SoftBank for approximately $40 billion, which would be a game-changer in its data center segment. The acquisition is currently held up in the approval process, but Nvidia told investors on their recent earnings call that the deal should get done. Denial is certainly a risk for Nvidia's stock price, so it's something to be aware of. recently Chinese and British regulators have had serious concerns about the acquisition and could block it.\n\n# Advanced Micro Devices ~ $AMD\n\nAMD has been making a comeback for years with a fast-improving lineup of chips addressing the laptop and PC markets, as well as hardware for data centers and the cloud computing services built on them. AMD is on track to record 50% revenue growth in 2021. The company's market share gains in the client and server CPU (central processing unit) markets, as well as the growing demand for graphics cards, have helped it to raise the guidance.\n\n[ IMAGE SOURCE: wccftech](https://preview.redd.it/faswa7u5dgr71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=99fdf6382da174aa1c34fff4ffb72dab7abaa7f2)\n\n#  Q2 Earnings And Growth\n\nOn July 27, AMD recorded 99% YOY revenue growth, to $3.85 billion, operating income of $831m (380% change YOY), and Net income of $710m - 352% YOY growth. The company consistently winning market share from Intel. Video game platform \"Steam\" reports that AMD's share of the client CPU market has now exceeded 30%, a massive improvement from three years ago when it held just over 16% of the market.\n\n[ AMD website - q2 Financial results](https://preview.redd.it/jjeh28b8dgr71.png?width=1041&amp;format=png&amp;auto=webp&amp;s=1194ec52ebd44ff97c9ae9686ff69f63d4787d4b)\n\n#  Video Games Potential Growth\n\nVideo game consoles have been in hot demand since last year, Sony could end 2021 with sales of 17.9 million PS5 consoles, up from last year's 4.5 million units. The PS5's sales momentum could remain strong with Sony expected to ship over 33 million units in 2022, 50 million units in 2023, and 67 million units in 2024. Meanwhile, sales of Microsoft's Xbox Series X are expected to jump from an estimated 3.3 million units in 2020 to 12 million units in 2021, and 37 million units in 2024.\n\n**AMD** supplies semi-custom chips to both Sony and Microsoft for their latest consoles. Nvidia, on the other hand, supplies chips for **Nintendo**'s Switch consoles. The Japanese video gaming company estimates that it could sell 25.5 million units of the Switch in the current fiscal year that ends in March 2022.\n\n# Xilinx Acquisition\n\nAMD's $35 billion merger with Xilinx is expected to be completed by the end of this year.the merger will allow AMD to expand the chips it offers the customers and it will take on Intel. The merger could make AMD one of the biggest tech companies and could expand its market share significantly.\n\n# Intel ~ $INTC\n\nIntel’s stock has underperformed the market in recent years, It’s struggled with R&amp;D, manufacturing, and management issues. the stock gained 15% in the past 3 years while the PHLX Semiconductor Index's gain of approximately 130%.\n\nIntel fell behind **TSMC** in the race to create smaller and more advanced chips. and lost market share to **AMD** in PC and data center CPU markets.\n\n[ IMAGE SOURCE: INTEL](https://preview.redd.it/sxqjttladgr71.png?width=1000&amp;format=png&amp;auto=webp&amp;s=b541cb7bc838e7c7ddb580196ebc1e085bedce22)\n\n#  New CEO = New Future?\n\nIntel’s new CEO, Pat Gelsinger, set his eyes on reclaiming the process lead by 2025. Gelsinger plans to achieve that goal by spending tens of billions of dollars on new foundries, upgrading the company's plants, expanding its third-party foundry services to pull orders away from TSMC, and attracting government subsidies in the U.S. and Europe to resolve the ongoing chip shortage and eliminate the industry's production bottlenecks in Asia.\n\nIf Intel achieves all those goals, its growth could accelerate over the next few years and make it a compelling long-term investment again.\n\n# GPUs War\n\nIntel generates most of its revenue from PC and data center CPUs and abandoned the high-end GPU market amid fierce competition from **Nvidia** and **AMD**, but it's now trying to bundle its new GPUs with its CPUs. Intel could challenge Nvidia and AMD in the laptop market with its DG1 mobile GPUs, pursue the desktop market with its DG2 GPUs, and enter the data center GPU market with its top-tier Ponte Vecchio GPUs.\n\n# Financial Comparisons\n\n[Market Size](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Market%20Cap?ref=nvdastonkssubreddit)\n\n1. INTC: $217.009B\n2. NVDA : $511.284B\n3. AMD : $121.722B\n\n[ when NVDA surpassed Intel's size this year - jika.io](https://preview.redd.it/9eho4lgddgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=edf57bcdd0bb2180a81cf108ed7e915083c40e14)\n\n [Gross Profit](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Gross%20Profit?ref=nvdastonkssubreddit) \\- After Q2\n\n1. INTC: $11.21B\n2. NVDA : $4.21B\n3. AMD : $1.83B\n\n[ Intel is still the most profit from the 3 - jika.io](https://preview.redd.it/o22mslredgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=1af2393607bca2cf54c50dec08a431b9a1072917)\n\n  [Return On Equity](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Return%20On%20Equity?ref=nvdastonkssubreddit) \\- After Q2\n\n1. NVDA : 11.23%\n2. AMD : 10.05%\n3. INTC : 5.94%\n\n[ ROE Comparison - jika.io](https://preview.redd.it/rke5xokgdgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=731149f0f5ffd48f43fd507caef9ceb7f3d2b710)\n\n  [Gross Profit Margin](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Gross%20Profit%20Margin?ref=nvdastonkssubreddit)\n\n1. NVDA: 64.78%\n2. INTC : 57.07%\n3. AMD : 47.53%\n\n[ Gross Profit Margin - JIKA.IO](https://preview.redd.it/pvsephuidgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=5a3338bce9df16268b6d4d0daa7664bca647c6c6)\n\n [Net Profit Margin](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Net%20Profit%20Margin?ref=nvdastonkssubreddit)\n\n1. NVDA : 36.48%\n2. INTC : 25.78%\n3. AMD : 18.44%\n\n[ Net Profit Margin - JIKA.IO](https://preview.redd.it/s7kcpl7ldgr71.png?width=1638&amp;format=png&amp;auto=webp&amp;s=83614a344ab55c1d8686da128e837c21c3dd1e3c)\n\n#  My Conclusion\n\nIn my opinion, Intel is pretty much out of the race, even if the new CEO will shake things up, Intel will take a long time until climbing back up.\n\nI think that the better choice is between the fast-growing semiconductor stocks, **NVIDIA** or **AMD**. Given that AMD's growth pace was better than NVIDIA's in Q1 and Q2 and is likely to keep up that momentum for the remainder of the year, it looks like the better option right now. AMD also looks like a better buy for those looking for a growth stock at a reasonable valuation.\n\n&amp;#x200B;\n\n&gt;***Personal note:*** *Feel free to diagree and express your opinion about the post.*\n\n**Sources:**  \n[Jika.io](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Revenue?ref=nvdastonkssubreddit) \\- Companies comparisons  \n[Motleyfool.com](https://motleyfool.com/) \\- stocks news  \n[nasdaq.com](https://nasdaq.com/) \\- news and information  \n[amd.com](https://amd.com/) \\- investor relations  \n[investor.nvidia.com](https://investor.nvidia.com/) \\- investor relations",
        "subreddit": "StockMarket",
        "title": "INTEL vs AMD vs NVIDIA - Looking for a Chip Stock.. which one should I buy?",
        "url": "https://www.reddit.com/r/StockMarket/comments/q17xof/intel_vs_amd_vs_nvidia_looking_for_a_chip_stock/",
        "created": 1633390849.0
    },
    {
        "author": "BrownGaze",
        "created_utc": 1634677116,
        "id": "qbkt1t",
        "num_comments": 132,
        "num_crossposts": 0,
        "selftext": "Do you see MSFT becoming overvalued soon, it seem like a safe haven for a lot of people with a lot of money. I firmly believe in Microsoft- but I can't shake the feeling it will become overbought in the near future. What do yall think?",
        "subreddit": "stocks",
        "title": "Is MSFT becoming overvalued?",
        "url": "https://www.reddit.com/r/stocks/comments/qbkt1t/is_msft_becoming_overvalued/",
        "created": 1634705916.0
    },
    {
        "author": "FanfareTaboo",
        "created_utc": 1633362124,
        "id": "q17yls",
        "num_comments": 125,
        "num_crossposts": 0,
        "selftext": "So I've been getting pretty risky with my money recently, I've bought about 6.6K in stocks in the past handful of months, which I can't afford. I've lost over $500 so far. At first things were good, my stocks were all steadily rising, but I didn't sell at a good time and now they've all crashed down in value. \n\nI currently have Apple, Microsoft, Nividia and Shopify stocks. \n\nIs it worth just giving up and selling these off outright just to save the rest of the money, or do you think these might bounce back? Another thing I'm debating on is if I should sell the stocks and instead use that money to invest in Amazon. If I sold everything I should have enough for one share. \n\nThanks, I really shouldn't have been so stupid with my money.",
        "subreddit": "stocks",
        "title": "I'm losing pretty heavily on my investments, are they worth holding onto and hoping they will go up again?",
        "url": "https://www.reddit.com/r/stocks/comments/q17yls/im_losing_pretty_heavily_on_my_investments_are/",
        "created": 1633390924.0
    },
    {
        "author": "juaggo_",
        "created_utc": 1635278728,
        "id": "qgexke",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Microsoft reported earnings after the bell. Here are the results.\n\nEarnings: $2.27 per share .\nRevenue: $45.32 billion vs $43.97 billion, according to Refinitiv.\nIt is not immediately clear if the reported earnings per share are comparable to analyst estimates.\n\nMicrosoft earnings are out – here are the numbers https://www.cnbc.com/2021/10/26/microsoft-msft-earnings-q1-2022.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
        "subreddit": "stocks",
        "title": "Microsoft earnings are out – here are the numbers",
        "url": "https://www.reddit.com/r/stocks/comments/qgexke/microsoft_earnings_are_out_here_are_the_numbers/",
        "created": 1635307528.0
    },
    {
        "author": "chriizzl",
        "created_utc": 1634566312,
        "id": "qanhac",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nI did put a lot of research into the current situation for quite some time and finally build a portfolio I am 100% behind long-term. However, the more I learned, the more sure I am that we will experience a market crash rather soon, than late.\n\n&amp;#x200B;\n\nHere is the issue: If I pull out all of my cash right now, potential Hyperinflation, which I think will be upcoming, will burn through my cash. If not, the market might crash and a good chunk of certificates might be of no value anymore. I currently have 5x leveraged K.O. Long certificates on Apple, MSFT, Biontech and Alibaba with a small amount of money (in total around 15% of my entire portfolio are derivatives), the rest are pure shares. I expected all of them to perform decent in times of hyperinflation, since they can easily adjust their prices to counteract high inflation and institutions will stick to them anyways. Ofcourse, more reasons than that. However, my biggest asset is the Vanguard FTSE All World ETF with around 25% of my total portfolio. How can I expect this ETF to move if the USA and China collapse? If those collapse, Europe might be next.  \n\n\nNow, the catch. I did so much research, learned constantly and came to the conclusion, which I am not here to debate whether or not you think is true, that we might see something like 2008 all over again. The theory behind it would assume that GameStop is the current best hedge and to some degree AMC as well, even heard that from the highs up from a bank when I talked to my bank guy, which is incredibly weird. I should mention, I am from Germany, so things are not as heated here.\n\nAnother hedge and long term hold can not be mentioned in this sub, but you might guess what it is. Sadly, we cant debate this here.\n\n&amp;#x200B;\n\nSo, in case of this scenario, I would like to get everyone's opinion on this. I want to be clear, I value every single opinion and would love the most input possible. In order to get knocked out, the stocks mentioned above would need to fall 20% in total. In case of no crash, they would be my go to investments, ontop of a few other non mentioned with the same principal. Again, this is purely theoretical, I do not want to discuss whether or not it is happening, but what you would do in case it is.\n\n&amp;#x200B;\n\nTLDR: How would you hedge against a potential market crash ala 2008 due to Evergrande and Gamestop, or just generally if you are not familiar with the topics.",
        "subreddit": "stocks",
        "title": "Hedging against a Market Crash, 2008' all over again",
        "url": "https://www.reddit.com/r/stocks/comments/qanhac/hedging_against_a_market_crash_2008_all_over_again/",
        "created": 1634595112.0
    },
    {
        "author": "ZhangtheGreat",
        "created_utc": 1633196423,
        "id": "pzzq5j",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "On The Tonight Show, Jimmy Fallon occasionally has a segment where he asks his Twitter followers to #DescribeA____Badly (e.g. movie, TV show, etc.). You can find examples on YouTube.\n\nLet’s kill some time by doing the same with stocks/companies: pick one or a few and describe them badly. Note that this is for humor and not seriousness. I’ll start…\n\nAAPL - You’ll continue buying the same crap we put out, so why innovate?\n\nADBE - Let your creativity out. Just pay us a subscription price to do so.\n\nAMZN - We’re not satisfied with world domination. Space is next.\n\nBRK.B - Because you’re too poor to afford BRK.A.\n\nFB - We know all your secrets.\n\nGOOG - We know even more of your secrets than FB.\n\nMSFT - Milking the same OS for almost four decades.\n\nLooking forward to reading yours.",
        "subreddit": "wallstreetbets",
        "title": "Describe a stock/company badly (humor post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pzzq5j/describe_a_stockcompany_badly_humor_post/",
        "created": 1633225223.0
    },
    {
        "author": "napale",
        "created_utc": 1633152143,
        "id": "pzp1zt",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "Hello,\nI own shares in a company that went public earlier this year, about 5x the average daily volume. I earned the shares as an early employee of the company through a warrant program, and I’m now up +12.000%. I am no longer employed at the company, and don’t need the money right away, but the company and its stock price aren’t doing great.\n\nI’m not very experienced in the stock market, only have a few diverse index funds and some AAPL/MSFT shares.\n\nHow can I turn this situation to my advantage?\n\nThanks!",
        "subreddit": "stocks",
        "title": "Up 12.000% on a low volume stock, now what?",
        "url": "https://www.reddit.com/r/stocks/comments/pzp1zt/up_12000_on_a_low_volume_stock_now_what/",
        "created": 1633180943.0
    },
    {
        "author": "slinkyminks",
        "created_utc": 1634578111,
        "id": "qarhhe",
        "num_comments": 99,
        "num_crossposts": 0,
        "selftext": "\"Cloudflare, Inc. (NYSE: NET), the security, performance, and reliability company helping to build a better Internet, announced it will work with Microsoft, Yandex, and other leading search engines to help businesses get the most timely and relevant search results to their customers. By participating in the IndexNow.org initiative, Cloudflare will allow websites to automatically notify search engines whenever content is created, updated, or deleted so they can be more efficiently crawled. Now, all Cloudflare customers can ensure users see the most up-to-date version of their content, all with a single click.\"\n\nSource: BusinessWire",
        "subreddit": "stocks",
        "title": "Cloudflare (NET) Collaborates with Microsoft and Major Search Engines to Help Improve Websites’ Search Results",
        "url": "https://www.reddit.com/r/stocks/comments/qarhhe/cloudflare_net_collaborates_with_microsoft_and/",
        "created": 1634606911.0
    },
    {
        "author": "Doxy-Cycling",
        "created_utc": 1635596015,
        "id": "qj094s",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "Currently holding appl at 50% gains but I’m wondering if my returns would be better if I start moving my apple shares to Microsoft. I’m young so I have time to hold and I’m OK with a more aggressive plrtfolio. \n\nI don’t have enough to hold both so I appreciate any input",
        "subreddit": "stocks",
        "title": "Apple for Microsoft?",
        "url": "https://www.reddit.com/r/stocks/comments/qj094s/apple_for_microsoft/",
        "created": 1635624815.0
    },
    {
        "author": "FumyLikes",
        "created_utc": 1634792967,
        "id": "qck70c",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "To begin, I found out about stocks in January of this year when a friend of mine sent a post about something called GME from WallStreetBets. I never knew anything about stocks at the time and in less than one month in the market, my portfolio was already up 100% from the GME squeeze. But little did I know this would be a huge mistake for me because my mentality entering the stock market wasn't actually trading stocks, instead, it was gambling.\n\nFast forward a couple of months later my portfolio is doing alright until I discover something called options. You can already see where this is starting to go. Even though I read so many times \"if you don't know what you're doing, avoid options\", \"don't put in what you're not willing to lose\" etc. I still dove right in. I knew absolutely nothing about them other than I can either make a ton of money, or I could lose a ton of money. I've made some insane returns on some of my calls, but I've lost a lot more. It's been a cycle of trying to win back the money I lost over and over and over again. I tell myself I will only put in what I'm willing to lose, see it go up x percent, add more, and then lose more than I was willing to lose. I also had issues with taking profits. I could be up 100% and still want to see more returns until I lost almost all of it. \n\nIt wasn't with just options either. I would FOMO things like penny stocks, panic sell at the bottom, see it rise up again, enter with a new position, use all my day trades, and then lose even more money. The problem I had was impatience. I tried holding stocks such as Apple, Microsoft, S&amp;P 500 etc. but I wanted to see instant returns. \n\nNow, I am currently down 85% from when I first began trading, and the money I've lost could have definitely gone towards my college tuition which I am barely paying off. Luckily, my living situation is fine but it would still be nice to have that money. I know I've paid a hefty price for the \"stock market tuition\" but I am really wondering where to go from here. Should I just pull out of all my positions? Take a break? Invest long term? Take the time to learn how the market works? Or is there a deeper issue here that I am not understanding? \n\nI hope someone else can also read this post and know what not to do in the stock market.",
        "subreddit": "stocks",
        "title": "Lost 85% of my portfolio, where do I go from here?",
        "url": "https://www.reddit.com/r/stocks/comments/qck70c/lost_85_of_my_portfolio_where_do_i_go_from_here/",
        "created": 1634821767.0
    },
    {
        "author": "sidward35",
        "created_utc": 1635368818,
        "id": "qh6mct",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Rough day... but GOOGL and MSFT got you covered",
        "url": "https://i.redd.it/u6arub9852w71.png",
        "created": 1635397618.0
    },
    {
        "author": "KarnivoreKoala",
        "created_utc": 1635115040,
        "id": "qf2z9b",
        "num_comments": 93,
        "num_crossposts": 0,
        "selftext": "I believe that the climate surrounding the discussion of Intel stock has caused it to enter the realm of hyperbolic discounting.  One claim I hear over and over again is that it is a \"value trap\" such as AT&amp;T or IBM.  Luckily, we retail investors have data and the internet to be able to fact check such claims.\n\nTo do this, I used data from gurufocus and macrotrends. I plotted two graphs, one representing the PE at the end of each year, the other was the ROIC-WACC.  I chose ROIC-WACC (%),  because ROIC is one of the most important determinations of whether a company is doing better than an average index.  The results were surprising.  First, there is no similar comparison to be made of AT&amp;T vs Intel nor IBM.  AT&amp;T has an average ROIC-WACC of 1.2, IBM 6.9, Intel 10.7, Apple 17.4, and Microsoft 18.4.  A company with an average ROIC-WACC of 1.2 is not a value play.  \n\nThe average 10 year ROICs were AT&amp;T 5.4, IBM 13, Intel 17.8, Apple 25.6, and Microsoft 26.1. Intel's ROIC is well above the S&amp;P average of 7.2 and yet the average PE is 27.6 vs Intel at a PE of 11.  I chose Microsoft and Apple for a comparison, because these two stocks were also thought to be a dying stock in the past.  However, often times there is a difference between a narrative being told and the data. ROIC-WACC was strong for these companies, and naturally they have done quite well, despite the news surrounding their demise.  Note that Intel now has a PE less than IBM and AT&amp;T now.  While future ROIC is difficult to predict, Intel still has a good running ROIC, and with current interest rates, now is the best time for more capital investment because it allows WACC to be kept lower.\n\nhttps://preview.redd.it/dpq7mfes5hv71.png?width=638&amp;format=png&amp;auto=webp&amp;s=157108dc0c5af79f8c89882a77c1dac3e577a4c6\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gfqqgv3t5hv71.png?width=659&amp;format=png&amp;auto=webp&amp;s=0aac75381d57329840726dde08d1ec7138960423",
        "subreddit": "wallstreetbets",
        "title": "Intel is not comparable to so-called \"value traps\"",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qf2z9b/intel_is_not_comparable_to_socalled_value_traps/",
        "created": 1635143840.0
    },
    {
        "author": "X-2357",
        "created_utc": 1634179296,
        "id": "q7qmwn",
        "num_comments": 86,
        "num_crossposts": 0,
        "selftext": "IONq is the first of many world changing quantum computer companies. Rigetti uses traditional superconducting quantum arrays that translate a little easier to conventional computers. The huge downside is the need for extreme cooling. Rigetti uses multi layers where the innermost layer is 100x colder than outerspace. Xanadu uses photonic systems that are great, and run at room temp but they need lots of additional hardware to work and will be difficult to scale down. Microsoft is working on topological arrays which would provide utility benefits but it hasn't been proven yet and they had to retract one of their papers on it. The point is that there are various methods to how you can create and manipulate qubits, the foundation for quantum computing.\n\nIONq uses trapped ions, from a single atom of ytterbium. Technically a rare metal but it's not rare. Then they manipulate the ions using lasers to create the qubits on the array. Sh*t is bleeding edge and I understand .005% of it but I read everything I can find. It can run at room temp and be easily scaled. Basically IONq doesn't need all the extra resources to create and manipulate their qubits, so the cost and energy requirements are down. This also allows for upscaling arrays on existing hardware. Like they can turn a 16 qubit system into a 64 qubit system eventually using the same stuff  they just have to reduce the expected errors that come with quantum computing.\n\nIONq got starting investment money from Amazon, Bill Gates, Samsung, Lockheed Martin, Hyundai, goldman sachs and more. They used that money to prove the tech works and are currently operating with Amazon Braket as their most powerful hardware supplier. Currently IONq has the most powerful quantum computer in business operation at 32 qubits. The next closest comp is 16 qubits. And you can have 9 qubit, 11 qubits computers, it doesn't need to be doubled evenly like ram for instance.\n\nRemember when you see qubit numbers in the future and from other companies, what that really means.\n\nQuantum computing is based on \"physical qubits\" and \"digital\" simulated qubits. Conventional computers use bits.\n\nNo matter what method you use, ions, photonic, superconducting, etc, You can't have a fully isolated qubit because then you couldn't interact with it to manipulate and tell it what to do. To get around this, modern quantum computing is based on running \"leaking\" environments with varying fidelity and trackable errors. We use the say 93% that is still functional to simulate more isolated qubits, and use those to simulate even more isolated qubits, in deeper layers until we have a fully isolated qubit we can error correct. \n\nEventually we need 1 million qubit machines to simulate 10k error corrected machines. IONq just demonstrated how they can scale up to a million at a recent presentation. Eventually a QPU could really lead to some radically advancements in financial predictions, cybersecurity and encryption, biotech discovery, simulation modeling and on and on.\n\nThey merged with $600m , $350m of which is pipe investment that is locked up for 6 months from now. Ran to $12 before merger, tanked to $10 at merger, tanked to $7.30 during spy correction and tech sell off. It was mostly shorts based on volume. They have tiny revenue because they are just getting started but that doesn't matter imo. They had that white house presentation to show off and IONq is the only pure quantum computer company on the market so far, with rigetti ipo'ing in a few months.\n\nThe pipe investment unlocks in 5 1/2 months and that could be the only negative event coming up. I'll decide what I do with my shares, closer to the date, either hold or sell then compound my gains to hold, maybe for life. It's bleeding edge tech and to try to simplify it more, instead of linear binary data, 1s and 0s. The data can be 1 and 0 at the same time in any ratio, in any direction. It's a bigger technological leap than people understand.\n\nThanks for your time!\n\n\nhttps://aws.amazon.com/braket/hardware-providers/ionq/\n\nhttps://www.businesswire.com/news/home/20211011005114/en/IonQ-and-University-of-Maryland-Researchers-Demonstrate-Fault-Tolerant-Error-Correction-Critical-for-Unlocking-the-Full-Potential-of-Quantum-Computers\n\nhttps://money.usnews.com/investing/news/articles/2021-10-05/amazon-and-google-set-to-attend-white-house-forum-on-quantum-technology\n\nhttps://www.businesswire.com/news/home/20210927005262/en/IonQ-Expected-to-Go-Public-With-in-Excess-of-600-Million-in-Expected-Gross-Proceeds\n\nhttps://ionq.com/posts/december-09-2020-scaling-quantum-computer-roadmap",
        "subreddit": "wallstreetbets",
        "title": "IONq &amp; Quantum Computers are already here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q7qmwn/ionq_quantum_computers_are_already_here/",
        "created": 1634208096.0
    },
    {
        "author": "Boss1010",
        "created_utc": 1633628179,
        "id": "q3e9zm",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": "Ok, retards, I know you hate reading so imma keep this short and sweet.\n\n\nLooking for an undervalued company which doesn’t have 0% year-over-year revenue growth or is drowning in debt? \nLooking for dirt cheap premiums and low IV on calls? \nLooking for a stock that isn’t up 100% in the past week? \nWell, AVPT is your answer. \n\n\n**Background:**\n\nAvepoint is a SaaS solutions vendor which provides data management solutions for Office365. Avepoint is debt-free and has shown +15% revenue growth in each of it's past two quarters and strong year-over-year growth as well.  \n\nAdditionally, Avepoint is a Microsoft Gold Certified Partner and is a **five-time Microsoft Global Partner of the Year.** \n\n\n**Price Targets:**\n\nNow, you may be saying, /u/Boss1010, you’re retarded, why should we listen to you?\n\nWell, you’re right. Therefore, you should look at what the big boys at Wall Street have to say about this stock:\n\n\nGoldman Sachs: $17\nEvercore: $15\nCitigroup: $13\nWilliam Blair: $11.45\nNorthland Securities: $15\nCowen: $14.50\n\n**Average: $14.33**\n**Current Price: $8.65**\n\nPosition: 750 warrants",
        "subreddit": "wallstreetbets",
        "title": "Avepoint (AVPT) : An Undervalued Play Which Literally Can't Go Tits Up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q3e9zm/avepoint_avpt_an_undervalued_play_which_literally/",
        "created": 1633656979.0
    },
    {
        "author": "buddyboh12",
        "created_utc": 1635116001,
        "id": "qf3abj",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation AND Analysis (Q3 Week 3) - $AAPL, $FB, $AMD, $MSFT, $SHOP, $AMZN, $GOOG and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, hope you’re all doing well! Our free money glitch remained unpatched for another update, allowing many of us to pull clean double baggers across the board. God bless $SNAP. With all of big tech set to report this week, it could prove to be more lucrative than the last. We’ve got a large variety of trades we can make this week ranging from educated gambles, to good old fashioned theta plays. We’ve even have a couple of opportunities to sprinkle in some collateral plays if we wish! Let’s get into it!\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1nw-EaMcOUIY52zJtre6tYAYTw5YLKswl97Nkez_WQBA/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to [this link](https://docs.google.com/spreadsheets/d/1nw-EaMcOUIY52zJtre6tYAYTw5YLKswl97Nkez_WQBA/edit?usp=sharing) instead!\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Jetblue is inefficiently priced.** Historically Jetblue moves roughly **4%** post earnings (inline with all the other American airlines),  yet this quarter, the options are pricing in a move of roughly **10%**. If we sell straddles or strangles, we can collect this extremely inflated premium with very little risk on our end. I looked into the entire sector as a whole since I planned on trading it last week, and I came across nothing that would’ve fundamentally caused this spike in volatility in airlines, or Jetblue specifically. The odds are awesome on this trade, and I plan or robbing some gamblers next week. For more information on earnings pricing inefficiencies, refer to [this article.](https://www.hungrybotalerts.com/blog/pricing-inefficiencies-around-earnings)\n\n&amp;nbsp;\n\n- **Twitter is inefficiently priced. Avoid it.** Historical move of **6.5%**, priced move of **11%** - on paper, this trade gives us insane edge, but I’m still not touching it, as we saw what happened with $SNAP on Thursday. Although Twitter dropped 5% as the market tried to price $AAPL’s privacy policy in, I don’t feel like taking on additional risk because the fundamentals have shifted right before its’ earnings. Normally I would take this trade 10/10 times simply from a pure numbers standpoint, but I’m not as confident anymore because of the added volatility created by $SNAP. \n\n&amp;nbsp;\n\n- **Oil stocks tend to experience Post Earnings Announcement Drift (PEAD).** PEAD is the phenomenon where a stocks price will drift in the direction of an earnings surprise for several weeks following an earnings announcement. If a stock beats, it will continue to grind up for weeks following the ER report, and vice versa if it misses. This is especially true among oil stocks - check the charts if you don’t believe me. The best way to play oil this quarter would be to capitalize on this effect, and do **monthly** call or put debit spreads based on the results that come out Friday. To those curious, standard weekly options provide no edge at the time of writing, so it’s best not to gamble this time round.\n\n&amp;nbsp;\n\n- **Collateral Plays are your friend!** If you’re bullish on big tech, look to long $QQQ this week to alter your risk exposure and bag some safer gains. If you’re bearish on oil, look to short $XLE instead of any of the individual companies for an added safety net. If you think $AMD is gonna knock it out of the park, look to play $NVDA or $SOXL instead. There’s lot’s of opportunities for collateral plays this week, and I’ve just barely scratched the surface. If you wish to learn more about collateral plays, refer to [this article.](https://www.hungrybotalerts.com/blog/collateral-plays)\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nWe've got ourselves an awesome week of earnings this time round! There's many trades that have a great risk-reward ratio on them, which is extremely odd considering that playing earnings is usually a crapshoot. Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1nw-EaMcOUIY52zJtre6tYAYTw5YLKswl97Nkez_WQBA/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly!  If the sheet has helped you out in any way, please consider dropping an upvote or a comment, it would mean a lot to me! If you want access to more trading tools, have any specific questions or observations you’d like to share with the community, feel free to check out the community links in the spreadsheet. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation AND Analysis (Q3 Week 3) - $AAPL, $FB, $AMD, $MSFT, $SHOP, $AMZN, $GOOG and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qf3abj/historical_post_earnings_moves_mega_compilation/",
        "created": 1635144801.0
    },
    {
        "author": "mikeyrocksin2021",
        "created_utc": 1633456891,
        "id": "q21xph",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "Tech stocks seem to be falling off the rails of late, with the Nasdaq Composite COMP, 1.69% slumping Monday to take the benchmark index 7% below its record high. To closely followed tech analyst Dan Ives of Wedbush Securities, this is just a “white knuckle moment” that will soon pass. Ives says the worries around rising yields and growth stock valuations will give way to a year-end rally of at least 10% in the tech space. \n\n“While the long standing bears will continue to yell fire into a crowded theater on a 20 bps move in the 10-year TMUBMUSD10Y, 1.521%, we instead focus on the $2 trillion digital transformation opportunity across the enterprise and consumer ecosystem over the coming years that is on tech’s doorstep,” he said in a note to clients.\n\n“While the valuation debate will continue to be front and center in a rising rate environment, we fundamentally believe the Street is massively underestimating what the tech growth picture looks like into 2022 and thus remain a core tenet of our unwavering tech bull thesis with this another pound the table moment to own tech stocks.”\n\nIves concedes that the pandemic led to “a massive pull forward” in demand for cloud, e-commerce, cyber security and other tech companies. But he said it’s way too early to throw in the white towel and said investors should double down.\n\nApple AAPL, 2.07% is Wedbush’s favorite of the FAANG stocks, as he cited Microsoft MSFT, 2.51%, DocuSign DOCU, 3.88%, Matterport MTTR, 1.75% and Pegasystems PEGA, 1.51% as favorite cloud stocks. In cybersecurity, Wedbush favorites are Varonis Systems VRNS, 1.75%, Zscaler ZS, 2.97%, Telos TLS, -0.44%, SailPoint Technologies SAIL, 3.41%, Tenable Holdings TENB, 3.06%, Palo Alto Networks PANW, 1.79% and Fortinet FTNT, 3.52%.\n\n[https://www.marketwatch.com/story/rate-fears-just-another-white-knuckle-moment-for-tech-stocks-says-this-analyst-whos-forecasting-rebound-of-at-least-10-11633427803?mod=home-page](https://www.marketwatch.com/story/rate-fears-just-another-white-knuckle-moment-for-tech-stocks-says-this-analyst-whos-forecasting-rebound-of-at-least-10-11633427803?mod=home-page)",
        "subreddit": "stocks",
        "title": "Analyst forecasts tech stock rebound of at least 10% and says rate fears will soon pass",
        "url": "https://www.reddit.com/r/stocks/comments/q21xph/analyst_forecasts_tech_stock_rebound_of_at_least/",
        "created": 1633485691.0
    },
    {
        "author": "aitchison50",
        "created_utc": 1635517568,
        "id": "qie0ur",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "CanadianInvestor",
        "title": "Microsoft Becomes World’s Most Valuable Stock as Apple Slumps",
        "url": "https://ca.finance.yahoo.com/news/microsoft-set-world-most-valuable-111921662.html",
        "created": 1635546368.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1635705230,
        "id": "qjvo1l",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "I've got about 5.5% AAPL and 11.1% MSFT.  I'm thinking of adding some CRM since I dont have any and don't see much appreciation in AAPL at least short term.\n\nMy AAPL shares in question are in my ROTH so no taxes.  Should I cut AAPL to 4% or so and diversify into CRM?\n\nI notice CRM at the top if many growth funds and indexes, below AAPL and MSFT of course.",
        "subreddit": "stocks",
        "title": "Sell a few AAPL shares and buy CRM?",
        "url": "https://www.reddit.com/r/stocks/comments/qjvo1l/sell_a_few_aapl_shares_and_buy_crm/",
        "created": 1635734030.0
    },
    {
        "author": "mcqua007",
        "created_utc": 1634249993,
        "id": "q8a0yt",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "I looked at the financials an dI think gitlab is way over valued. Im surprised they went up to $94 and then ended the day at $103.\n\nThey only have about 13k paying customers. With their main competitor (Github) has the backing of Microsoft and is able to offer better free tiers. With more than double the amount of users and a lot more paying customers. Github is the *defacto* loud hosting platform with most open source software hosted there.\n\nForbes article [here](https://www.forbes.com/sites/greatspeculations/2021/10/12/gitlab-another-overpriced-tech-company/)",
        "subreddit": "stocks",
        "title": "Gitlab IPO, what are your thoughts, worth buying or overvalued ?",
        "url": "https://www.reddit.com/r/stocks/comments/q8a0yt/gitlab_ipo_what_are_your_thoughts_worth_buying_or/",
        "created": 1634278793.0
    },
    {
        "author": "ThePeoplesMVP",
        "created_utc": 1633399104,
        "id": "q1kv7x",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "Looking to take a modest swing at these tech giants. Any reasoning you have to back either ones? I’m thinking long term &gt; 1 year play. \n\nIs now a good time to dig in or suggest waiting for more on sale?\n\nCheers",
        "subreddit": "stocks",
        "title": "AAPL or MSFT?",
        "url": "https://www.reddit.com/r/stocks/comments/q1kv7x/aapl_or_msft/",
        "created": 1633427904.0
    },
    {
        "author": "This_Royal7800",
        "created_utc": 1635518490,
        "id": "qiecgr",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft Overtakes Apple and is now the most valuable company",
        "url": "https://www.macrumors.com/2021/10/29/microsoft-worlds-most-valuable-company/",
        "created": 1635547290.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1634701689,
        "id": "qbs8pi",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": " Social media giant Facebook Inc (FB.O) is planning to rebrand itself with a new name next week, the Verge reported on Tuesday, citing a source with direct knowledge of the matter.\n\nThe rebranding would position Facebook's social media app as one of many products under a parent company, which will also oversee groups like Instagram, WhatsApp, Oculus and more, the Verge report added.\n\nThe move to rebrand will also reflect Facebook's focus on building the so-called metaverse, an online world where people can use different devices to move and communicate in a virtual environment, according to the report.\n\n\nFacebook has invested heavily in virtual reality (VR) and augmented reality (AR) and intends to connect its nearly three billion users through several devices and apps.\n\nZuckerberg has been talking up metaverse since July and the buzzy word, first coined in a dystopian novel three decades earlier, has been referenced by other tech firms such as Microsoft.\n\nhttps://www.reuters.com/technology/facebook-plans-change-its-name-verge-2021-10-20/",
        "subreddit": "stocks",
        "title": "Facebook plans to change it's name",
        "url": "https://www.reddit.com/r/stocks/comments/qbs8pi/facebook_plans_to_change_its_name/",
        "created": 1634730489.0
    },
    {
        "author": "stockist420",
        "created_utc": 1635330075,
        "id": "qgtgwe",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "The Moat for MSFT is getting deeper and deeper",
        "url": "https://www.reddit.com/r/stocks/comments/qgtgwe/the_moat_for_msft_is_getting_deeper_and_deeper/",
        "created": 1635358875.0
    },
    {
        "author": "Okmanl",
        "created_utc": 1635643213,
        "id": "qjf35m",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "“Microsoft, US$2.2T market cap, annualised revenue $185B, up 21% over the year, annualised profits $66B, up 47% over the year.\n\nI.e. Microsoft shareholders are getting a 3% yield ($66B/$2.2T) - with ~21% (and arguably 47%) growth. So if Microsoft just continues to grow as it's doing - and has been doing in recent years - we're talking a ~24% (3%+21%) net return. Sure, I'm simplifying, but fundamentally this makes sense.\n\nThis is INSANELY good especially when considering nearly half of Microsoft's revenue is recurring. I mean, if you were buying real estate with a 4% rental return, that'd end up around 2.5% net, you'd be very lucky to be getting 5% capital growth. That's a 7.5% (2.5% + 5%) net return at best. A 20% annualised return is what Warren Buffett, the world's best investor, used to consistently achieve in his heyday.\n\n__Microsoft is no-brainer cheap, you should go ahead and buy. But it's not just Microsoft - all of GAFAM - Google, Apple, Facebook, Amazon, Microsoft - which have a total market cap of $9T and up more than 10x over the last decade - do similarly well with the same basic analysis.__\n\nHow can this possibly be?\n\nOk, let's step back a bit, GAFAM, just 5 stocks, represent nearly 20% of the value of ALL listed companies in the US, up from 3% a decade ago. Think about that. Add other tech stocks to that and you have a monumental shift in the composition of US stocks. That needs a monumental shift in capital which needs investors to change their way of thinking. I mean, we're going through a real paradigm shift.\n\nNow, sure, that shift is happening, we're all living it, but the world of finance, much of it controlled by older people fairly uncomfortable with technology, is going to lag - and this lag is the core reason why far from being some bubble, tech stocks in general are, despite their soaring valuations, still massively undervalued.”\n\n\n- Asim Qureshi, ex-Morgan Stanley VP",
        "subreddit": "investing",
        "title": "Why tech stocks are still undervalued despite the 20 year bull-run.",
        "url": "https://www.reddit.com/r/investing/comments/qjf35m/why_tech_stocks_are_still_undervalued_despite_the/",
        "created": 1635672013.0
    },
    {
        "author": "AutisticDravenMain",
        "created_utc": 1635565157,
        "id": "qit65u",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "I'm aware metaverse as a concept has been around for a while, but Facebook announcing it will be their priority forward gave me a lot of confidence.\n\n**The Applications**\n\nThe real-world implication of metaverse (MV for short) is boundless, including entertainment, social networking, work, education, gaming, etc. The Covid isn't going anyway (in the foreseeable future), and WFH has become the new norm. \n\nMV is going to provide a more productive working environment, I can see this being implanted at a cooperate level. If FB can make contracts with businesses, it may be on par with Microsoft Office/Google Suite, which became the next behemoth in the working space. \n\nThe next big part is education. There are many institutions already adapting VR as a tool for education. But none of them has economical resources like FB. Remember all the sponsorships about skillshares, well, FB is going to do it, but on a way greater scale.\n\nThe most profitable area for this is probably going to be gaming. Valve's Half-Life Alyx already presented what VR games are capable of, the immersive gaming experience is what gamers long for (at least from my perspective). Albeit, many games are designed for controller/mouse/keyboard, there are going to be games that can best utilize the features of VR.\n\n**Why Facebook Is Going To Be The One**\n\nAll the points I touched above were not in-depth, you may think \"hey, Microsoft is going to do better in the productive aspect, or Valve is going to dominate the VR gaming industry.\" The thing is, none of them have a user base like Facebook. Tbh, I never used or signed up for Facebook, it's such a \"boomer\" platform as one may describe it. But it is still the most used social platform, let's not count out Instagram and WhatsApp. This brought up my next point, the social implication of metaverse, the communication purpose. It's very likely going to be the next IM app, it allows you to talk to your friends without typing or going out. Many IM apps have tried and failed, mostly because there are many users, if your friends aren't using the app, what's the point of using this instant message if no one to message to. However, that won't be the case for Facebook, they already have a solid user base. If what's shown in the presentation is actually true, I don't see any difficulties in retaining users.\n\n**The Business Model**\n\nI'm going to say this, there's no way Zuck expends into metaverse just to sell his VR hardware, not even his old ad selling business. If what I listed above became true, this could be profitable in many ways. Games with IAPs, contracts for corporations, education institutions, commissions on contents presented in the universe, etc. Furthermore, this is going to create a positive loop, content creators get paid for great content, consumers lured into the platform, more creators, more consumers... Think of it as Apple's ecosystem, the seamless experiences between Mac/iPhone/Watch is a driving force why people buy Apple products. Imagine if you could share your game progress instantly, playing with your friends side by side even you are far apart, professors giving you insights without needing to go to campus, coordinating with colleagues overseas, doctors giving operations with machinery that minimize human errors, the list continues. Sure, AAPL, ZM, MSFT, ISRG can do it better in their perspective areas, but if Meta actually delivers what they show, and do it in a perfectly integrated way, the potential is limitless.\n\n**The Crazy Bull Theory**\n\nOk, the rest may sound nonsense, way more nonsense. Just read it as someone who is watching Sci-Fi mumbling. As others point out in this sub, Meta is trying to create a second life. If that ever became true, then this thing is going to be the next \"smartphone\", no one can live without it. Heck, why don't we just get rid of the smartphone, the VR can do everything smartphones can do, but in a way more presentable way and way more effective. You no longer have to read through your miserable 6in displace, you no longer have to play games on your 32in screen, you can enjoy squid games as if they were killed next to you, heck you can even put yourself in a hedge fund manager's office, and watch him laugh as your account trends to zero. The best part? Porn! but let's not get into that. Anyways, in the extreme bull case, it could have the potential of replacing both phones and PC, and the valuation is left for you to imagine.\n\n**Conclusion**\n\nAs great as it sounds, I seriously doubt what I said will come true in the next decade, hopefully, my grandchildren get to enjoy it. Many competitions are going to emerge, but since Meta already has a head start (better infrastructure, more contents, more users), others will find it hard to catch up.\n\nAnyways, I hope what I said became true, as that's what I hoped to see in the future.\n\nFrom a finical standpoint, I'm going to buy FB as much as I can on Monday, paycheck comes on Sunday (sadly).\n\nDon't take my word for anything, as anything is super speculative about this metaverse.\n\nAnyways, thanks for reading, and best of luck on your future investing journey.",
        "subreddit": "stocks",
        "title": "I think metaverse has enormous potential, and Fb has the best chance of executing it",
        "url": "https://www.reddit.com/r/stocks/comments/qit65u/i_think_metaverse_has_enormous_potential_and_fb/",
        "created": 1635593957.0
    },
    {
        "author": "Infiten",
        "created_utc": 1635615450,
        "id": "qj6evs",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "As an average r/investing user, It's concerning that more  retards on WSB aren't talking about the stock market's inevitable, impending meltdown. In fact, I have seen zero posts which address the major macroeconomic problems we are seeing right now. The markets are acting irrationally, and nothing is being priced in in a way that benefits me. \n\nHere's why you should be worried about the markets:\n\nThere is a growing disconnect between the fundamental value of companies and their prices (the S&amp;P 500's average p/e ratio is at 234038),\nInflation will fuck everybody's wifes in the ass,\nThe 1966 Buffet bubblegum index is at all time highs, \nThe cocaine/weed ratio is at all time highs,\nFAANG is changing into MAGMA - Microsoft, Amazon, Google, Meta, Apple (big companies literally saying market will have meltdown),\nMichael Burry is a doctor and he says to short,\nMy stock portfolio is green this year (very weird, NASDAQ software must be glitching)\n\nTLDR : everyone will die, markets to 0 by next friday\n\nPosition: \nShort 83882 shares in tsla @ $1\nLong 6382 shares of wish @ $32.5\n\nEdit: my broker just gave me a margin call, is an option  I can exercise to get more margin?",
        "subreddit": "wallstreetbets",
        "title": "A massive meltdown is inevitable and coming soon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qj6evs/a_massive_meltdown_is_inevitable_and_coming_soon/",
        "created": 1635644250.0
    },
    {
        "author": "jesperbj",
        "created_utc": 1635661518,
        "id": "qjjnio",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "There has been a lot of talk about the metaverse in investment communities as of late – The latest buzzword deemed the next big thing. And now with the Zuckerbergs announcement of Facebook (FB) rebranding to [Meta](https://www.google.com/amp/s/about.fb.com/news/2021/10/facebook-company-is-now-meta/amp/) (MVRS) it seems now it is finally out in the open with the general public. So what exactly is it and does it matter at all?\n\n\\##What is the metaverse?\n\nThe metaverse is thought of as a next generation iteration of the internet. A way for social media to become more immersive and interactive using technologies like virtual reality and augmented reality. In the metaverse you will have virtual spaces that will allow you to communicate, collaborate, work and play across distances in a more engaging way than what we are used to today. In place of a simple graphical element on the GUI of your screen, the people you interact with may instead be represented by virtual avatars, capable of carrying expressive facial motions and hand gestures. Much like the most immersive MMORPG video games of today allows for friends to gather up to collaborate on tasks or trades using voice chat and text, the metaverse will let you do just that, while also reflecting your real-life self inside adaptable virtual worlds built entirely optimized for the occasion or task at hand.\n\nThe best examples of metaverse-like experiences we have today, may be in virtual reality social experiences like VRChat or well established online video games like World of Warcraft or Runescape where communities have spent decades building out their characters while engaging with the virtual world’s economies and activities. We also see elements of the metaverse in certain AR experiences like the virtual work spaces offered through Microsoft’s HoloLens for enterprise and similar concepts. World building simulators like Minecraft and Roblox may also offer insight into how virtual spaces can be created. Though I would argue all of these examples fall short of a true realization of the metaverse. However a thought up combination of all these categories might serve as an easy way to grasp the concept.\n\n\\##Why I think Facebook’s rebranding might work\n\nNow, I think we can all agree that Facebook has more than one reason for rebranding. The company has a terrible reputation following privacy scandals like those of the Cambridge Analytica scandal with millions of users data being collected, stored and eventually breached to be leaked without their consent. Most recently former Facebook employee and product manager Frances Haugen turned whistleblower and disclosed vast amounts of internal documents. These documents along with her statements to the court and press serve to prove that the company has prioritized profiting from spreading hate, misinformation and self harming destructive behaviour among its userbase rather than try prevent it. Last but not least, Facebooks founder and CEO Mark Zuckerberg is known and mocked internet-wide for his unfortunate akward personality and stature, resulting in the damaging image of him as a ‘humanoid android AI machine’ or supposed ‘alien lizard overlord’ pretenting to fit in and copy our human traits while he feeds on our personal data.\n\nBut on the bright site, there is hope that the rebranding of the company might actually work. In sheer scale, the closest example would be when its Big Tech brother Google reorganized and became a subsidary of parent company Alphabet (GOOGL) in 2015. Yet the corporation is still known today by the general public as Google, named after their most popular service (i.e. Google Search) and even on the investors side of things not many call them by their true name. This may partly be attributed to the fact that they have kept their ticker names (GOOG and GOOGL) unlike Facebook who with their rebranding are changing theirs from FB to MVRS (MetaVeRSe – funny, huh?). But Facebook are looking to rebrand themselves to change public perspective. Their former name will instantly lead you to thinking of them entirely as Facebook, where as they with the new name hope to keep their virtual reality business from Oculus in mind among other. That is in spite of the company also commanding other massively popular services like Instagram, WhatsApp and Messenger too. I believe the new name will ease their way into being thought of more generally as a social media provider and virtual communications provider.  \n\n\nWhat is more interesting are the actions the company are taking to change along with the rebranding. Along with the announcement they also shared that they are working towards lifting the requirement of logging into a private Facebook account to use the Oculus platform. That requirement has long been widely criticized and have made it more difficult for developers and professionals to use the platform than it should be. The company also recently allowed owners of the Oculus Go headset to unlock the device as it reaches end-of-life. A great move that avoids an abandoned product like this one just turning into more e-waste. The move can likely be attributed to the legendary developer and now consulting CTO at Oculus John Carmack. \n\n\\##Facebook is now a more attractive stock with the metaverse\n\nBut is the metaverse just another crazy sillicon valley dream? Is it just another path to occupying our mindspace with blatant product placement and brand deals like showcased in ‘Ready Player One’? Yeah, maybe… It remains to be seen. But to the kind of investor I am, it also makes the Facebook/Meta stock a much more interesting investment oppotunity for someone like me. It solidifies the new direction of the company to me and makes me think of them as more than just a play on social media. It introduces new risk to be sure, tens of billions of dollars to be poured into investing in the metaverse for the company over the next several years. The company expects to spend upwards of $50 billion on this endeavor over just the next three years – with no possible way of knowing yet if it will pan out. It is one of the most significant bets I have seen any big tech company take in a long time and truly sets an entirely new focus for its investors. While their bread and butter, Facebook, Messenger, Instagram &amp; WhatsApp all remain the same for now in both name and purpose, they are no longer the core focus of the company.\n\nI suspect many more conservative Facebook/Meta stockholders might not entirely be on board with this move, but Zuckerberg has such huge leverage and control of this company that this does not matter. They may eventually pull out or might already have, but at the same time, the stock just became much more interesting to investors like me. I like to say that I invest in the future. I work hard to try and understand and grasp new concepts in technology and science at the cutting edge. It gives me an advantage in predicting what might end up as the next big thing. For my biggest conviction stocks like Tesla (TSLA) , Microsoft (MSFT) and TSMC (TSM) I planned to hold for a decade before entering the stock in the first place. As risk decreases and concepts become more clear, if succesful, these type of stocks will rise as they build closer to that future I saw them to be a part of. The metaverse is such a concept, one that I believe in and that I think in some way is inevitable – Not in the way pop culture has laid it out to be, nor exactly how Facebook/Meta envisions it now, but I am certain we will see some version of it play a big part in the future of collaboration, entertainment and social.\n\nThis takes the Facebook/Meta stock to the next level for me. No longer are they just a technology company valued at a rare and fairly low P/E for a tech company of around 20. They are now aspiring to become something more – within a field that I understand and have worked with directly. I worked hands-on for 2 years with virtual and augmented reality in my company and know its potential and capabilities right alongside its limitations and downsides. I definitely would have bought shares of the company in the weeks up to this announcement that we all knew was coming, had I not already spent every last dime I have on other ventures like Xiaomi (HK1810) and Tattooed Chef (TTCF) this year. Meta is likely to go into my portfolio at some time in the future and I advocate it a strong buy at current levels if you are interested in the space at all. So no, I unfortunately do not own any stock of the company just yet.  \n\n\n\\#Critique and misconceptions of the metaverse\n\nLastly I would like touch on the misconceptions and critiques of the metaverse. I have already seen critique of this move by Facebook saying it will fail. Many can just not see it happen or find the appeal in being someone else or somewhere else virtually. They think it unattractive and clunky in the day to day: And to that I agree. With today’s technology the metaverse is not ready. Very few would carry a VR headset with them on their daily commute etc. Popular media and even the companies trying to enter the space have created a skewed perception of what it will end up being. I cannot tell you exactly how just yet but ultimately the metaverse will integrate into our daily life in a much more seemless way than we can even demostrate right now. Just think of all the ermerging technologies that could all eventual tie into this concept. There is no telling what it might end up being like.\n\nCryptocurrencies like Ethereum (ETH) could provide a base for the virtual economies of the metaverse and NFTs could allow for cross-platform trading and transfer of in-world collectables like skins and cosmetics that are already lucidiously popular and profitable in the gaming space – especially on mobile. Real time graphics like those provided by Unreal engine &amp; Unity (U) today are ripe for utilization across a broad sector of industries and entertainment beyond just gaming like we see it with Matterport (MTTR) and Snapchat (SNAP). The same can be said for innovative and engaging new ways of driving e-commerce sales through platforms like Sea (SE) are doing with Shopee and Bytedance are with TikTok. The foundations for the metaverse are already being laid.\n\nDisclaimer: I am not a financial advisor, the opinions expressed in this post are entirely my own – always invest at your own risk. I just like to write about stuff like this on my [site](http://www.jesbaek.com/).",
        "subreddit": "StockMarket",
        "title": "Do you believe in the Metaverse? ($FB) ($MVRS)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qjjnio/do_you_believe_in_the_metaverse_fb_mvrs/",
        "created": 1635690318.0
    },
    {
        "author": "AbuSaho",
        "created_utc": 1634616303,
        "id": "qb3jb8",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Chinese e-commerce giant Alibaba launched a new server chip on Tuesday, as it looks to boost its cloud computing business and compete against U.S. rivals like Amazon. The processor, called Yitian 710, will go into new servers called Panjiu. The chip and servers will not be directly sold to customers. Instead, Alibaba’s cloud computing clients will buy services based on these latest technology. These servers are designed for artificial intelligence applications and storage. Alibaba will not be manufacturing the semiconductor but will be designing it instead. That’s a trend among Chinese companies. Huawei designed its own smartphone chips and Baidu raised money this year for a standalone semiconductor business. U.S cloud computing rivals including Google and Amazon have also done the same.\n\nAlibaba sees cloud computing as a key part of its future growth but it currently accounts for 8% of the company’s total revenue. The e-commerce giant’s cloud computing business saw slower growth in the June quarter after it lost a major customer that was using its cloud services overseas. However, Alibaba is China’s largest cloud computing player, according to market analyst firm Canalys, but rivals are investing heavily to catch up. As U.S. sanctions continue to hit Huawei’s smartphone business, the company is also looking to boost its revenue from cloud. Alibaba has been trying to expand its cloud business internationally but still trails the likes of Amazon and Microsoft in terms of global market share.\n\nCompanies are investing in their own chips as a way to have custom-designed silicon that can power specific applications as a way to differentiate from the competition. “Customizing our own server chips is consistent with our ongoing efforts toward boosting our computing capabilities with better performance and improved energy efficiency,” Jeff Zhang, president of Alibaba Cloud Intelligence, said in a press release.\n\nhttps://www.cnbc.com/2021/10/19/alibaba-launches-new-server-chip-to-boost-its-cloud-business.html",
        "subreddit": "stocks",
        "title": "Alibaba launches new server chip to boost its cloud business in challenge to Amazon and Microsoft",
        "url": "https://www.reddit.com/r/stocks/comments/qb3jb8/alibaba_launches_new_server_chip_to_boost_its/",
        "created": 1634645103.0
    },
    {
        "author": "ConcreteCity",
        "created_utc": 1634912982,
        "id": "qdi4rx",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Hey guys, sort of a cross post. This got deleted on wsb so maybe this is a better place for this stuff. Here's my take on IBM, and why I think it needs way more love and attention. I'll try and post my positions in the comments as it doesn't wanna let me do it here...\n\nHey, so I've been riding the wave after GME trying to find a few places to store cash that could help diversify my portfolio and help to keep my gains from riding that rocket. One of those is IBM. Theres an insane amount of reasons I've decided to go with this company, and at first it was as a nest egg option to help grow my account at a consistent rate (dividends are @ 4.56% right now). It also has HUGE upside potential, it is in basically the same industry as Microsoft but only has a market cap of 117 billion vs Microsofts HUGE 2.3T. Doing the math there is goddamn simple and if you were in the market for mad gains why would you not look at this as a huge growth investment.\n\nNow there has been a huge crash on IBM, take it from me this is a sale. Big Blue missed their quarterly revenue by .06 billion, but they met their expected eps. Some short seller went on tv a couple days ago before their report and basically bashed them saying they were a prime short selling target [Jim Chanos, betting against IBM, accuses firm of 'financial engineering' (cnbc.com)](https://www.cnbc.com/2021/10/18/short-seller-jim-chanos-reveals-bet-against-ibm-ahead-of-earnings-this-week.html) .\n\nThe reason this crash is so enticing is because of a spinoff company named Kyndryl. IBM will be splitting off its managed infrastructure services portion and making it into a tradable company. sometime in November. WHICH BY THE WAY IS ALSO FREE MONEY, for every 5 shares of IBM you get 1 share of Kyndryl. Besides the free Kyndryl stock, IBM is now free to pave the way with a lighter and more streamlined company, and their focus is basically the same mark et as microsoft. Not financial advice, but goddamn if it were me I'd take it :).",
        "subreddit": "stocks",
        "title": "Great pricing to jump in on IBM",
        "url": "https://www.reddit.com/r/stocks/comments/qdi4rx/great_pricing_to_jump_in_on_ibm/",
        "created": 1634941782.0
    },
    {
        "author": "Swiftnice",
        "created_utc": 1635694006,
        "id": "qjrtq1",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The only things that are certain in life are death, taxes and $MSFT",
        "url": "https://i.redd.it/zoocspec0tw71.jpg",
        "created": 1635722806.0
    },
    {
        "author": "Arcite1",
        "created_utc": 1633524865,
        "id": "q2jult",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "If you use either of those two words, I'd be interested in hearing from you.\n\nI understand that \"expiry\" is a valid word; it's the British equivalent of \"expiration,\" which is American English.  And I'm aware that the internet is an international thing.  It's just that, with Reddit being an America-based website, and with the US market being the largest options market, I wouldn't expect Briticisms to be that common.  Do we really have that many Canadian/Australian/New Zealander posters, or posters from other Commonwealth countries, or other countries where British English is taught as a second language?  Or are there a lot of Americans who just like it because they think British English sounds cooler?  Or is it one of these situations (like \"ascribe\" being used in place of \"subscribe\") where people saw the word and thought it must be the more \"correct\" version of the word they thought they knew?  Or is there some other reason (e.g., Robinhood using it?)\n\nThe \"stocks\" thing is just plain wrong.  \"Stocks\" in the plural is used to refer to multiple companies in which you can own stock.  If I own stock in AAPL, MSFT, and WMT, I own three stocks.  If I own three shares of AAPL, I own three *shares*, not three \"stocks.\"  Where does this one come from?  I had never seen this in my life before becoming active on r/options.  Is it by chance a translation issue from another language?",
        "subreddit": "options",
        "title": "Why do so many of our posters use \"expiry\" instead of \"expiration\" and \"stocks\" instead of \"shares?\"",
        "url": "https://www.reddit.com/r/options/comments/q2jult/why_do_so_many_of_our_posters_use_expiry_instead/",
        "created": 1633553665.0
    },
    {
        "author": "canadaisaniceplace",
        "created_utc": 1635351204,
        "id": "qh08bh",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "My FA had me investing in IBM these past few years rather than my suggestion of MSFT. I am not sure the reasoning behind that. I am in my 40s, so have a rather long term investment horizon still.",
        "subreddit": "CanadianInvestor",
        "title": "Baffled why IBM over MSFT",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qh08bh/baffled_why_ibm_over_msft/",
        "created": 1635380004.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1635462166,
        "id": "qhyvub",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "- Amazon underperforming all year\n\n- Facebook dealing with some very bizarre transformations with VR. Very odd rebranding and timetable seems like very far off.\n\n- Apple horrible earnings, missed by over 1 billion! A stock that was trading sideways off amazing earnings in previous quarters.\n\n- Netflix is fine for now.\n\n- Google same.\n\n----\n\nIf you look at year to year the top performing stocks it changes nearly yearly in every which way. FAANG had a fantastic run, but everyone has now realized it is and most all of the stocks are at their peak. What exactly in earnings is going to take ANY of them to the next level? Apple? Amazon? \n\nOther than Microsoft and Google (sorta Netflix), I'm looking towards other sectors for the next quarter till I see change otherwise. I'd rather invest my money in something that won't be down 10-15% the next 3 months and wait for another opportunity back in.",
        "subreddit": "stocks",
        "title": "FAANG is going to be in some trouble for at least the next 3 months",
        "url": "https://www.reddit.com/r/stocks/comments/qhyvub/faang_is_going_to_be_in_some_trouble_for_at_least/",
        "created": 1635490966.0
    },
    {
        "author": "treehuggercole",
        "created_utc": 1635353435,
        "id": "qh11l4",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Can anyone explain why someone should chose an index fund for every single dollar over some high performing individual stocks? I know about diversification and risk and all the other mumbo jumbo but when is it okay to start buying up some individual stocks of solid companies like MSFT, GOOG, etc…? Google itself seems like it will break 6% today, while on an index fund it may get 7% all year. I’m currently invested 95% in index but would like to explore more high reward stocks. I’m 22 and have no expenses so risk isn’t too much of a burden to bear for me. I would like to get more actively involved in the market. Is it suitable for me to invest in companies that I believe to be solid and growing?",
        "subreddit": "stocks",
        "title": "Individual stocks vs Indexing",
        "url": "https://www.reddit.com/r/stocks/comments/qh11l4/individual_stocks_vs_indexing/",
        "created": 1635382235.0
    },
    {
        "author": "gorays21",
        "created_utc": 1633321615,
        "id": "q0y9fz",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Windows 11 will have a sleeker layout, more detailed widgets, an updated Microsoft Store, and support for Android apps.\n\nThe rollout of Windows 11 will occur in phases, just like previous Windows 10 feature updates. After October 5, Windows users can check for the device's update to Windows 11 by heading to Settings &gt; Windows Update and select Check for updates.\n\nWindows 10 will join Windows 7 in the graveyard of Microsoft operating systems past. With Microsoft making Windows 11 a free upgrade, the tech juggernaut will pull the plug on Windows 10 support on Oct. 14, 2025. That gives you years to prepare as Microsoft slowly moves its billion-plus Windows users to Windows 11. The company's new OS will gradually roll out to compatible Windows devices between Oct. 5 and mid-2022.  \n\n [Microsoft will stop Windows 10 support in 2025. Here's what to know before Windows 11 rolls out - CNET](https://www.cnet.com/tech/computing/microsoft-will-stop-windows-10-support-in-2025-heres-what-to-know-before-windows-11-rolls-out/)",
        "subreddit": "stocks",
        "title": "Microsoft set to release Windows 11 tomorrow!",
        "url": "https://www.reddit.com/r/stocks/comments/q0y9fz/microsoft_set_to_release_windows_11_tomorrow/",
        "created": 1633350415.0
    },
    {
        "author": "mojolakota",
        "created_utc": 1635549916,
        "id": "qip0by",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I bought ATM in 2020 and now I am multi millionaire.\n\nNone of my friends listened to my investment advice and they still don't.\n\nThey think Microsoft and Google are just 2x stocks and Tesla is way overvalued.\n\nThey bought companies like FB(just dying app with no monopoly through device/os), Amazon (labor management company in most part) and Netflix (just another streaming app) mainly because it's run by fear driven culture while Microsoft and Google are companies where people go to retire (wrong)\n\nDo yourself favor and buy an ATM. You're welcome!",
        "subreddit": "wallstreetbets",
        "title": "Secret hiding in plain sight: ATM (Alphabet, Tesla, Microsoft)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qip0by/secret_hiding_in_plain_sight_atm_alphabet_tesla/",
        "created": 1635578716.0
    },
    {
        "author": "msnf",
        "created_utc": 1635468080,
        "id": "qi0pwr",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "To be clear, these are 5 of the most dominant companies of all time - none of them are about to go away anytime soon. That said, each of these companies have beat the market during the extended post-2008 bull run. Historically, companies of this size (e.g. IBM, T, XOM, GM, GE) get to the point where their growth stops outpacing the market and they ease into a gradual sunset with value-tier growth and multiples. \n\nTwo of these five - GOOGL and MSFT still reported double beats. It's probably no coincidence that these two are the only FAAMG stocks beating the market YTD. Then there's also TSLA, NVDA, NFLX and AMD each of which have had monster years so far. So, is FAAMG over, up for a reshuffle, or still going strong after a brief hiatus?",
        "subreddit": "stocks",
        "title": "AAPL, AMZN and FB all reported misses on revenue. Just a hiccup or is the FAAMG gravy train over?",
        "url": "https://www.reddit.com/r/stocks/comments/qi0pwr/aapl_amzn_and_fb_all_reported_misses_on_revenue/",
        "created": 1635496880.0
    },
    {
        "author": "not_wall03",
        "created_utc": 1635541213,
        "id": "qim9rn",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft overtakes Apple to become the world’s most valuable company",
        "url": "https://www.theverge.com/2021/10/29/22753251/microsoft-apple-market-cap-business-valuable-company",
        "created": 1635570013.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1633476711,
        "id": "q28db1",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, October 5, 2021**\n\nVolatility in the stock market continues, with the three major indexes, particularly the Nasdaq (QQQ), reversing hard after suffering one of its worst days all year, with Apple (AAPL) and Microsoft (MSFT) leading the charge. Market participants continue to closely monitor developments out of Washington and wait for upcoming economic and earnings data to gauge concerns over supply chain disruptions and inflation. Tech stocks once again came under pressure as the benchmark 10-year Treasury yield continues to rise. The S&amp;P 500 (SPY) closed 1.04% higher, the Nasdaq closed 1.35% higher and the Dow Jones (DIA) closing 0.92% higher. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed, closing just 0.35% higher.\n\nWe’ve seen previous episodes of rising rates, both earlier this year as well as when the Fed first announced intentions to begin tapering quantitative easing in the not too distant future. Each of these episodes caused a hiccup but didn’t derail the broader bull market. According to Edward Jones, yields went from below 1% to 1.75% during the first three months of this year, a period that included pullbacks in the S&amp;P 500 of 3.7% for four days and 4.2% for 12 days. However, during that entire three-month stretch in which rates were rising, the stock market rose more than 7%.  In this current spate, 10-year rates have jumped from 1.30% on September 15 to as high as 1.54% last week, reflecting a renewed concern over inflation pressures and reduced Fed stimulus expectations\n\nStocks are struggling to regain their footing after the September selloff, given that many of the concerns that sparked last month’s drop remain. Congressional lawmakers have yet to come to an agreement on a solution to raise the debt limit to prevent a potential government default sometime mid-October. Failure to do so would be catastrophic for the US economy.  As a reminder, Congress successfully averted a government shutdown last week. The House approved a bill late on Wednesday suspending the debt limit through December 2022. The Senate could vote on it as early as this week Senate Majority Leader Chuck Schumer said, but Republicans are expected to block it again as they have twice before. This is an evolving situation. In my humble opinion, I think the Republicans are playing political games with the debt ceiling and will pass it last minute, similar to the spending bill to avoid the government shutdown.\n\nLooking ahead, the September Jobs Report will be released later this week. Market participants are hoping to see payroll gains accelerate after a shockingly disappointing August report, which shoed just 235,000 new payrolls gains versus more than 700,000 expected. Consensus economists anticipate that 475,000 payrolls returned in September, and that the unemployment rate fell to 5.1% or the lowest since March 2020.\n\n**Highlights**\n\n* According to Facebook (FB), yesterday’s nearly six-hour outage was caused by a mistake during a routine maintenance on how internet data routed through its network. Here is a blog by the company [https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/](https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/)\n* Despite broad weakness in tech in recent weeks, shares of Netflix (NFLX) have been on fire, with the company breaking previous ATH twice in the last five days. Perhaps, could be attributed to the immense popularity of “Squid Game”, which has become the company’s most popular show in less than a month. I watched it, it lives up to the hype.\n* Microsoft (MSFT) unveiled a new version of its flagship operating system today, with the company debuting Windows 11. Here is a WSJ article about the features [https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj\\_RHF](https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj_RHF)\n* Today, Facebook whistleblower Frances Haugen gave testimony before the Senate exposing FB’s business practices and calling for more stringent regulation of the company.\n* The price of ... topped $50k again and up 25% this week\n* Three top US hedge funds, Man Group, Elliot Management, Marshall Wace, and Soros Fund Management, who combined manage roughly $200b in assets, have warned that Chinese businesses have become “uninvestable” amid the anti-monopoly scandal, power shortages and Evergrande situation. I agree and personally divested all my holdings in Chinese stocks months ago, some at a loss. Just my opinion.\n* National Union of Metalworkers of South Africa (NUMSA), South Africa’s largest metalworkers union with over 155,000 members, said it was launching an indefinite strike to press for wage increases. This action could block critical supplies for car manufacturing, threatening to further strain a supply chain already stretched thin.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Chipotle (CMG) target raised by Stephens from $1850 to $2000 at Overweight. Stock currently around $1680\n* Capital One (COF) target raised by Piper Sandler from $177 to $188 at Overweight. Stock currently around $168\n* General Motors (GM) target raised by Wells Fargo from $63 to $64 at Overweight. Stock currently around $54\n* International Business Machines (IBM) target raised by Credit Suisse from $167 to $176 at Outperform. Stock currently around $143\n* NVIDIA (NVDA) target raised by KeyCorp from $245 to $260 at Overweight. Stock currently around $204. My favorite stock :)\n* Texas Instruments (TXN) target raised by KeyCorp from $240 to $250 at Overweight. Stock currently around $240\n\n“More money has been lost trying to anticipate and protect from corrections than actually in them” - Peter Lynch",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, October 5, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/q28db1/here_is_a_market_recap_for_today_tuesday_october/",
        "created": 1633505511.0
    },
    {
        "author": "pooiemcmooie",
        "created_utc": 1635703544,
        "id": "qjv2zm",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "I've been playing around with the idea of building a portfolio for my son, in which I would give it to him once he hits a certain age. I love the idea of building \"generational wealth\". Wealthy people do it, so why not us average joes? I'm only putting in $10 a week right now, and I know that's not a lot, but I hope that my son will be able to take what I give him and build on it, and eventually start a portfolio for his children etc. My goal is to have a small portfolio with both safe and speculative picks. \n\nI'm interested to hear if anyone else has been doing something similar? Right now I have an account set up in m1 finance for my son with VTI being the largest position, then some blue chip stocks (MSFT,AAPL, GOOG, TSLA, AMZN, FB) and more speculative (ASTS, SOFI, PLTR). \n\nI'm back and forth on whether to just put it all in one fund, or keep the individual picks. Also wondering if m1 finance will even be around forever, and whether I should switch it into say td ameritrade to be safe.\n\nAlso I know some people go the route of the 501 savings plan. I like the idea but I want my son to choose what the cash will be for (ideally for him to keep it and add to it as he ages).\n\nJust wanted to get peoples perspectives on this and maybe some discussion",
        "subreddit": "stocks",
        "title": "Stock Portfolio for Children and Generational Wealth",
        "url": "https://www.reddit.com/r/stocks/comments/qjv2zm/stock_portfolio_for_children_and_generational/",
        "created": 1635732344.0
    },
    {
        "author": "RefinedStrategist",
        "created_utc": 1635200568,
        "id": "qfs0au",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": " \n\n[https://www.cnbc.com/2021/10/25/tesla-stock-passes-1-trillion-market-cap-traders-bet-on-more-gains.html](https://www.cnbc.com/2021/10/25/tesla-stock-passes-1-trillion-market-cap-traders-bet-on-more-gains.html)  \nThe automaker exceeded $1,000 a share for the first time and entered the $1 trillion club, the handful of stocks such as Apple and Microsoft with market caps above that threshold.  \nThe stock rallied nearly 13% after rental car company Hertz said it would buy 100,000 models to beef up its electric-vehicle fleet, an order to be completely fulfilled by the end of 2022.  \n“It’s one of those typical tickers that generally will trade around a key psychological value, and in the options market it tends to stick at those levels,” Danielle Shay, director of options at Simpler Trading, told CNBC’s “Trading Nation” on Monday.  \nAfter Tesla’s latest milestone, Shay is targeting a level even higher.  \n“I’d look at a $1,200 price point. We’re within that range for a November series expiration, and I like to trade it with \\[butterfly spreads\\]. They’re cheap, low risk, high reward, and they make for some great momentum trades,” she said.  \nShay suggests trading a longer-dated butterfly spread for Tesla — for example, buying the 1,050 call, selling the 1,200 call and buying a second call at 1,350, expiring either November or December.",
        "subreddit": "stocks",
        "title": "As Tesla joins the elite $1 trillion stock club, two traders see another potential milestone ahead",
        "url": "https://www.reddit.com/r/stocks/comments/qfs0au/as_tesla_joins_the_elite_1_trillion_stock_club/",
        "created": 1635229368.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1633130600,
        "id": "pzjml0",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning October 4th, 2021.\n\n# **October may have a bad reputation, but stocks are entering a normally positive period - [(Source)](https://www.cnbc.com/2021/10/01/october-may-have-a-bad-reputation-but-stocks-are-entering-a-normally-positive-period.html)**\n*****\n&gt; October may have a bad reputation, but the fourth quarter has mostly been a positive time for stocks.\n*****\n&gt; Despite worries about central bank tightening, the debt ceiling, Chinese developer Evergrande and Covid-19, many strategists expect stocks to eclipse recent highs after a rocky period in October.\n*****\n&gt; The S&amp;P 500 has averaged outsized gains of 3.9% in the fourth quarter and was up four out of every five years since World War II, according to CFRA. The next best quarter is the first, with an average gain of 2.3%. The worst is the third, up just 0.6%.\n*****\n&gt; “Q4 2021 will likely record a higher-than-average return. However, investors will need to hang on tight during the typically tumultuous ride in October, which saw 36% higher volatility when compared with the average for the other 11 months,” notes CFRA chief investment strategist Sam Stovall.\n*****\n&gt; The S&amp;P 500 eked out a small gain for the third quarter, but was down nearly 5% for the month of September, with a bad ending as the S&amp;P 500 dropped 1.2% on Thursday.\n*****\n&gt; The indexes kicked off the first trading session in October on a positive note, however. With the S&amp;P 500 adding 1.1% and the Nasdaq closing 0.8% higher on Friday. The Dow Jones Industrial Average added 482.54 points.\n*****\n&gt; https://i.imgur.com/FEg9jmU.png\n*****\n&gt; Bespoke Investment Group analyzed the behavior of the S&amp;P 500 in years when it was up solidly year-to-date heading into the fourth quarter. In those years, the market typically gained in the quarter, but there were weaker than normal returns in October and the quarter itself, when September was a negative month.\n*****\n&gt; “The S&amp;P 500 has been down in September 50 times since 1928, and in those years, it has actually averaged a decline of 0.41% in October and a gain of just 0.75% in Q4,” Bespoke noted. When September’s performance was positive, the S&amp;P gained a much stronger 1.6% average in October and an average 5% in the fourth quarter, according to the firm.\n*****\n&gt; Bespoke found that while October is remembered for stock market crashes, like those in 1929 and 1987, the market is usually positive. The Dow, for instance, gained 60% of the time in October over the past 50 years, averaging an increase of 0.5%. It was negative most of the time in September, with an average loss of 0.9%.\n*****\n&gt; # Jobs, jobs, jobs\n&gt; One of the first hurdles markets face in the new quarter is Friday’s employment report, potentially one of the final triggers for the Federal Reserve’s decision on when to taper its $120 billion-a-month bond buying program.\n*****\n&gt; Economists expect about 475,000 jobs were added in September, according to an early consensus figure from FactSet. Just 235,000 payrolls were added in August, about 500,000 less than expected.\n*****\n&gt; “The only way I could see them delaying the tapering is if we get a very weak number, something closer to zero,” said Ethan Harris, head of global economic research at Bank of America. “Anything that looks like 100,000, 200,000, they just go ahead” with the taper.\n*****\n&gt; Harris said the biggest concern for the economy remains Covid, though new cases are slowing.\n*****\n&gt; “The big question is when does the Covid story start to fade a bit, allowing activity to come back,” he said. He expects the pandemic will continue to be a big factor in the labor market in September.\n*****\n&gt; “We think fear of getting Covid on the job was a big factor in August and will be a factor in September as well,” he said. “By October, the early hints are people are starting to feel more comfortable and you should get some beginnings of a reacceleration of job growth.”\n*****\n&gt; The market got some positive news on that front on Friday with Merck’s promising data for its Covid antiviral pill.\n*****\n&gt; # Central banks tightening\n&gt; A big event in the fourth quarter could be the beginning of the unwind of the Federal Reserve’s easy policies.\n*****\n&gt; The central bank last week signaled it is nearly ready to take that first step away from the policies used during the pandemic to maintain financial market liquidity and help the economy.\n*****\n&gt; The Fed is widely expected to announce in November that it will start to slow its bond purchases, and Fed Chairman Jerome Powell said he expects it to finish by the middle of next year.\n*****\n&gt; Other central banks around the world are also making the same noises or actually moving to raise interest rates. Bond market pros now expect a trend toward higher interest rates.\n*****\n&gt; Just in the past week, rates shot higher, with the 10-year Treasury yield rising from about 1.31% while the Fed was meeting Sept. 22 to as high as 1.56% just a week later. On Friday, the yield eased back a bit to just under 1.50%.\n*****\n&gt; https://i.imgur.com/9dO7jZc.png\n*****\n&gt; The move toward tapering so far has not had much impact on markets, though strategists say it could if yields shoot higher. The bond buying program, or quantitative easing, was also credited with providing market liquidity, which has been fuel for stock market gains.\n*****\n&gt; “The Fed is trying very hard to telegraph what they are doing well in advance and take the shock out of what they’re doing. Bond yields have gone up a bit but not in a way that’s troubling for the economy,” said Harris. “The real risk from the Fed comes when they start talking about hiking interest rates. ... That’s a story for next year.”\n*****\n&gt; Rising yields would become more risky for stocks if they were to continue to move up rapidly. Tony Crescenzi, PIMCO executive vice president, said he expects the benchmark 10-year Treasury yield to trade in a range of 1.50% to 2% this year.\n*****\n&gt; Crescenzi said the move higher in yields has to do with more persistent inflation expectations and the Fed’s persistent move toward less easy policy. “It’s still marching forward with its plan to taper and eventually tighten,” he said. “The taper doesn’t set a date for tightening, but the clock starts ticking once the taper begins.”\n*****\n&gt; The jump in rates rattled stocks in the past week, particularly tech stocks. The S&amp;P 500 was lower by 2.2% for the week and the Nasdaq shed 3.2%.\n*****\n&gt; # Surprising earnings\nEarnings have been a big catalyst for the stock market, with huge upside surprises boosting sentiment this year. But some strategists warn that if companies sound too cautious when they report third-quarter profits in the next couple of weeks, that could be a forewarning for the market.\n*****\n&gt; Julian Emanuel, head of equity and derivative strategy at BTIG, said rising earnings estimates for this year and next year have been a tailwind. “Those in our view have now plateaued and potentially peaked,” he said. “If the market perceived they peaked rather than plateaued on a near to medium-term basis, then we have a problem for the stock market.”\n*****\n&gt; Investors are also watching the supply chain issues that are disrupting many companies’ ability to get parts and even products. They are already impacting earnings and pressuring margins. Some have already warned about the problem, and more are expected to detail the issues during earnings calls.\n*****\n&gt; Congress averted a government shutdown, but political feuding is likely to hang over the markets in the fourth quarter. The bigger task facing lawmakers will be to raise the debt ceiling, which could become worrisome for markets if the government reaches the limit before action is taken.\n*****\n&gt; As the fourth quarter moves ahead, the fate of the proposed $3.5 trillion infrastructure plan, which is opposed by Republicans and some Democrats, remains up in the air. Bank of America’s Harris said he expects it to be cut back to about $1.5 trillion.\n*****\n&gt; # Other issues\nChinese property developer Evergrande’s failure to make its debt payments temporarily spooked the market in September. Its problems are not solved even as investors expect that a financial meltdown will be averted.\n*****\n&gt; Evergrande’s progress will remain an important story for the markets in the fourth quarter, as the company struggles under its $300 billion debt burden.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/DxoNJCE.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/nz0naN5.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/uWt4LHK.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/JSLq6e1.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/RtabSpV.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/tJmePd2.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/6HSoEdC.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ScqSlq1.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/e0S19DA.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JWcdTjl.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/JeByjl1.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/4dO1a3g.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/vOWwHAb.png))**\n\n*****\n\n&gt; # Mega Caps Underperforming as Energy Explodes\n\n&gt; In November of last year, we took a look at the performance spread between the equal and market cap weighted versions of the S&amp;P 500. The chart below provides an update through the end of September where positive readings indicate outperformance of the equal-weight S&amp;P 500 and negative readings indicate outperformance of the market cap weighted index. In March 2020, as the market was plunging from the February peak and bottoming towards the end of the month, mega-caps such as Apple (APPL), Microsoft (MSFT), Alphabet (GOOGL), Amazon (AMZN), and Facebook (FB) significantly outperformed the broader market, resulting in a 5.68 percentage point spread between the return of the equally weighted and market cap weighted S&amp;P 500. Whereas the equal-weighted index declined 18.19% in March 2020, the market cap weighted index dropped 'just' 12.51%. In a reversal of these trends, the equal-weighted index outperformed between the months of September 2020 and March 2021, rallying 30.84% while its market cap weighted counterpart gained 18.14%. Over these months, there was a maximum monthly spread of 3.37 percentage points in favor of the equal-weighted index, which occurred last December. In recent months, mega-caps briefly took back the reins before the trend reversed in September when the equal-weighted index outperformed by 0.82 percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/10121-Spread.png))**\n\n&gt; With the month of September behind us, the table below lists the 18 stocks in the S&amp;P 500 that finished the month up over 10%, and less than a quarter of the stocks in the index (22%) finished the month higher. Overall, the average performance of stocks in the index was a decline of 3.7 percentage points. While short-term performance has been weak, on a YTD basis, 81.42% of S&amp;P 500 stocks are up on the year, and the overall average gain is 18.90%. Of the stocks that have rallied 10%+ in September, more than half are from the Energy sector and another three come from the Financials sector.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/over-ten-percent-updates.png))**\n\n*****\n\n&gt; # Q3 Asset Class Performance\n\n&gt; Q3 and the month of September are now in the books, and it was not a great period for US equities. As shown in our asset class performance matrix below, the sole portion of the US equity market that was higher in September was Energy stocks. Every other sector, theme, and major index was lower on the month. As for global equities, performance was more mixed with declines ranging from 11.73% for Brazil (EWZ) to a 3.55% gain for Russia, though, most country ETFs were lower on the month.\n\n&gt; Commodities had a good month particularly in the energy space with crude oil (USO) gaining 9.41% and Natural Gas (UNG) rising an astounding 31.59%. That lifted the total gain in Q3 to 54.13% while it has returned almost 120% year to date; the best performer for both time periods. Precious metals, namely silver (SLV), on the other hand, was hit particularly hard. As for c ryptos, E thereum (ETHE) was another top performer YTD and in Q3, but September pared those gains. ETHE fell 13.62% in September while B itcoin (GBTC) also fell by double-digit percentages.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/acpm093021.png))**\n\n*****\n\n&gt; # Could There Be An October Crash?\n\n&gt; “October: This is one of the peculiarly dangerous months to speculate in stocks. The others are July, January, September, April, November, May, March, June, December, August and February.” Mark Twain\n\n&gt; Well, it was bound to end eventually, but the S&amp;P 500 Index will finish September in the red, ending an incredible seven month win streak. As we noted last month, these long win streaks actually tend to be quite bullish for future returns, with the S&amp;P 500 higher six months later 13 out of 14 times. Yes, stocks were down some in September, but this still bodes well for the near-term.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; Speaking of the near term, here comes October. As Marc Twain explained many years ago, October has long been a source of anxiety for stock investors. “October is known for some spectacular crashes and many expect bad things to happen again this year. 1929, 1987, and 2008 all come to mind when we think about this month,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But the truth is this month is simply misunderstood, as historically it is about an average month.”\n\n&gt; As the LPL Chart of the Day shows, since 1950, October ranks as the 7th best month, while the past 10 and 20 years it ranks as the 4th best month. In a post-election year it comes in 5th. So October clearly isn’t one of the best months of the year, but by no means is it the worst either.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-1-v2.png?ssl=1))**\n\n&gt; Now, let’s be very clear though, October is known for volatility. No month has seen more 1% moves (up or down) than October, with some of the largest 1-day moves (both up and down) taking place this month. Heck, the S&amp;P 500 hasn’t had a 5% pullback all year (the average year sees about three) and the last one was nearly a full year ago, one of the longest such streaks ever. Not to mention the S&amp;P 500 has now gone an incredible 317 trading days in a row above its 200-day moving average, one of the longest streaks ever. What we are getting at is a 5-7% pullback could potentially come at any time given we haven’t had one in so long.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-3.png?ssl=1))**\n\n&gt; Here are some other interesting statistics to think about regarding the S&amp;P 500 in October.\n&gt; * It has been 21 years (2000) since October didn’t close at least up or down 1%. Several percent moves up or down are quite common for this month in other words.\n&gt; * For six years in a row October has alternated between higher and lower. Given 2020 it was in the red, it could be time for a bounce in 2021. (More on this below)\n&gt; * The last two times the S&amp;P 500 was up more than 15% year-to-date heading into October, stocks gained each time (2013 and 2019).\n&gt; * The author’s birthday is on October 28, one of the historically most bullish days of the year. Coincidence?\n&gt; It turns out stocks don’t like politics much. The S&amp;P 500 performs much better in odd numbered years than even years. Remember, even numbered years have elections and midterms in November. Some pre-election jitters makes sense to us, which could bode well for 2021.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-4.png?ssl=1))**\n\n&gt; Don’t forget the fourth quarter is historically the best for stocks, with the third quarter the worst. Stocks rise 3.8% on average during the fourth quarter, but the past seven times the S&amp;P 500 was up 15% year-to-date heading into the home stretch of the year, the fourth quarter was higher every single time, up a very impressive 5.8%. In other words, should there be any October scares, investors may want to use the weakness as an opportunity to add to core positions.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.30.21-Blog-Chart-5.png?ssl=1))**\n\n*****\n\n&gt; # Four Charts That Signal the Reopening Trade May Be Back\n\n&gt; Stocks have come a long way since the S&amp;P 500 bear market low way back on March 23, 2020, but despite the general strength of the bull market we’ve seen two very different types of trades leading markets at different times. They include a “work-from-home” trade characterized by strength among large caps and growth-style oriented stocks, strong performance by U.S. stocks in particular, and well contained interest rates. At other times, we’ve seen a “reopening trade,” where mid- and small-cap stocks have performed well, cyclically-oriented value-style stocks have led, interest rates have pressed higher, and performance across geographical regions has been more even. For most of the last six months the work-from-home trade has dominated, but we’re seeing some signs of potential rotation toward a reopening theme once again.\n\n&gt; “It’s increasingly looking like the Delta-related surge in COVID-19 cases, while still dangerous, has passed its peak, and there are signals that markets may be anticipating the next stage of economic reopening,” said LPL Chief Market Strategist Ryan Detrick. “After a mid-summer head fake, we’re seeing signs that this time the rotation might stick.”\n\n&gt; It all starts with interest rates. The 10-year Treasury yield started to stabilize in early August, and since then we’ve seen steady movement higher as elevated inflation looks increasingly sticky in the near term, and markets start to anticipate global central bankers slowly winding down extraordinarily supportive monetary policy. The full transition to neutral policy will likely take years, and central banks will remain supportive for some time, but the change in direction does matter. Seeing the 10-year yield move higher despite stock losses on Tuesday may be a telling sign.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; A higher 10-year Treasury yield has supported financial sector stocks, which are the largest sector in the Russell 1000 Value Index. The breakout in relative strength compared to the August peak may signal a more sustainable change in direction this time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-3.png?ssl=1))**\n\n&gt; It’s still too early to call a reversal by value-style stocks overall, but financial sector strength helps. Rising interest rates also tend to increase the value of near-term earnings over less visible long-term earnings growth, which may also give value stocks an edge. While there are some signs of a reversal higher in the value trade, what we’ve seen so far isn’t persuasive in isolation. But added to the broader market signals, we see potential for further relative strength, particularly for cyclical value sectors.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; The relative strength of small caps looks more robust, breaking out to the upside after treading water for several months. Small caps went through a stretch of extraordinarily strong performance between September 2020 and March 2021, and it’s not completely surprising that they gave back a good share of those gains after coming so far so fast, but we still think the economic environment is likely to be supportive for small- and mid-caps compared to large.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.29.21-Blog-Chart-4.png?ssl=1))**\n\n&gt; We’ve been anticipating a rotation back to the reopening trade for some time. If you look at the charts there’s really been relative stability between the two themes since mid-July, but the last few weeks have provided solid signals of a potential reversal. With the latest surge in COVID-19 cases likely past peak, vaccination rates slowly rising, and economic surprises starting to come back into balance after a series of disappointments, it’s no surprise to see the shift toward the reopening theme.\n\n&gt; But there are some potential economic negatives that support this trade as well, such as high commodity prices, higher interest rates, and growing risk of stickier inflation. Nevertheless, we think the fundamental backdrop for equities remains positive on the whole, and we continue to recommend modest overweights to equities while leaning into cyclically-oriented value sectors and tilting away from large caps.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 1st, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.3.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**T.B.A. THIS WEEKEND.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 10.4.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 10.4.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cF0CbQE.png))\n\n*****\n\n&gt; # ***Tuesday  10.5.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/D4dB9sd.png))\n\n&gt; # ***Tuesday 10.5.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jDBI2Dv.png))\n\n*****\n\n&gt; # ***Wednesday 10.6.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/qVRtzZv.png))\n\n&gt; # ***Wednesday 10.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/V7gDj4f.png))\n\n*****\n\n&gt; # ***Thursday 10.7.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hZ42eSL.png))\n\n&gt; # ***Thursday 10.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/HNdhjgf.png))\n\n*****\n\n&gt; # ***Friday 10.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/I2ihrfy.png))\n\n*****\n\n&gt; # ***Friday 10.8.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n**T.B.A. THIS WEEKEND.)** T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets. :)",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning October 4th, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pzjml0/wall_street_week_ahead_for_the_trading_week/",
        "created": 1633159400.0
    },
    {
        "author": "gabugabuchan",
        "created_utc": 1635143665,
        "id": "qfapw5",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "[Response to Market Rumors of Discussions Between PayPal and Pinterest](https://investor.pypl.com/news-and-events/news-details/2021/Response-to-Market-Rumors-of-Discussions-Between-PayPal-and-Pinterest/default.aspx):\n\n&gt; In response to market rumors regarding a potential acquisition of Pinterest by PayPal, PayPal stated that it is not pursuing an acquisition of Pinterest at this time.\n\nPayPal has officially posted in their Investor's Relations website that they're not acquiring Pinterest for now, so the rumor is now dispelled. \n\nNow:\n* What is your price target for Pinterest now since PayPal is not buying them up?\n* What is your price target for PayPal now that you don't have to adjust for the balance sheet regarding the acquisition?\n* It was clearly a leak to sink and pump both stock respectively at the same time, do you think that the intention behind it is for people with vested interests to swing trade it?\n* How much do you think Pinterest is worth for acquisition? Microsoft wanted to buy it at ~$86/share but got rejected.",
        "subreddit": "stocks",
        "title": "PayPal is not buying up Pinterest",
        "url": "https://www.reddit.com/r/stocks/comments/qfapw5/paypal_is_not_buying_up_pinterest/",
        "created": 1635172465.0
    },
    {
        "author": "lanceeeeeeeee",
        "created_utc": 1633208822,
        "id": "q03gp8",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Im a high school student looking to buy some safer stocks in order to save money to buy a car this spring. I’m going to put in around $2000 initially this monday and add on 7-800 per month until April-May when I would buy the car. I’m hoping to make around 10% and I’ve mainly looked at MSFT and NVDA so far. Any recommendations or advice would be greatly appreciated.",
        "subreddit": "stocks",
        "title": "Conservative picks for the next 7-8 months",
        "url": "https://www.reddit.com/r/stocks/comments/q03gp8/conservative_picks_for_the_next_78_months/",
        "created": 1633237622.0
    },
    {
        "author": "HopefulIvyAdmit",
        "created_utc": 1635610658,
        "id": "qj4sdb",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Im 19yo and still relatively new to investing in stocks. I’ve been buying and reinvesting my earnings back into index funds for a year and now that I feel more comfortable with the market, I want go get into stocks. I was hoping if you all could guide me into sorting out my portfolio with short term, mid term, long term stock picks. \n\nAlso, as you will see the majority of my stock picks are from the tech industry. Any suggestions on how I could diversify?\n\n\nShort term: Don’t really know any good short term stocks. Really need help here on the time intervals of buying and selling short term stocks.\n\n\nMid/long term: Please advise,\n\nBuying soon:\n- AMD: With their TSMC and hopefully soon Xilinx buy, I hope AMD kills the chip market now that Tesla, Microsoft, Sony, and Google are starting to use their chips for cloud computing, gaming, self driving/AI etc. Elon also states that the chip shortage is a short term issue.\n\n- Apple: Killing the consumer technology.  MacOS with ARM and the whole Apple ecosystem is slowly going to kill Windows. As a college student, everyone has a MacBook, iPhone, AirPods. And a lot of people wear Apple Watches and are using iPads over notebooks for note taking. I highly doubt all of these people will switch over to Windows after graduating.\n\n- FB: FB knows about the amount of hate they have. They are taking steps to mitigate this, seen primarily by its rebrand. The Metaverse concept is very interesting and I’m excited to see how it will pan out, especially with collaboration on work, etc. FB has all of the tools it needs for creating the Metaverse: VR, Users, and the cash flow.\n\nOn the fence:\n- PLTR: Idk if this company is a meme or not, but the governments been liking them a lot. Curious to see how they will grow with Foundry and targeting corporations.\n\n- TSMC: Again, these people are killing it and have tech giants contracting with them, yet the stock has been sideways this entire year… can anyone explain this?\n\n- ASML: Lots of room to grow, especially with their monopoly on chip production processes. Yet lots of analysts are saying that this stock is overvalued, how?\n\n- Google: Waiting on dip to buy — strong earnings and good future with cloud computing.\n\n- Costco: Need to do more research, but I love Kirkland products (sometimes more than the brand name)😂\n\n- Amazon: Terrible earnings report, not good Q4 expectations. Supply chain and labor issues. Sideways this whole year as the pandemic slowly dies off. Not really feeling amazon.",
        "subreddit": "stocks",
        "title": "Short term and mid/long term stock picks?",
        "url": "https://www.reddit.com/r/stocks/comments/qj4sdb/short_term_and_midlong_term_stock_picks/",
        "created": 1635639458.0
    },
    {
        "author": "small_comrade",
        "created_utc": 1633607270,
        "id": "q37c6c",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Currently the Top 3 companies by market cap are:\n\n1) Apple, $2.35T\n2) Microsoft, $2.20T\n3) Saudi Aramco, 1.98T\n\nI wonder if the first company to hit a 10T market cap will be a tech giant... Or it could be from an emerging industry like space exploration or life extension. \n\nPersonally, I think the first company to reach 10T will be something related to Crispr and genetic editing. I think this will happen in the mid 2030s. I think there is a huge market for eliminating diseases and enhancing existing human features that could be made possible through Crispr.",
        "subreddit": "StockMarket",
        "title": "What Company Will Hit A 10 Trillion Dollar Market Cap First and When?",
        "url": "https://www.reddit.com/r/StockMarket/comments/q37c6c/what_company_will_hit_a_10_trillion_dollar_market/",
        "created": 1633636070.0
    },
    {
        "author": "OwningTheWorld",
        "created_utc": 1635371175,
        "id": "qh7gnn",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I have a small position left in PINS. Sitting at 50 shares, which I purchased at around $71. Obviously it's taken a massive hit lately. Especially with the news of the Paypal deal not happening. I can also no longer determine whether or not I like the company, or I'm trying to irrationally talk myself into continue holding, in hopes that I will somehow recoup my original investment. \n\nIf I were to sell, at a loss, right now, I'd probably reallocate the money to something like Microsoft, Disney or AMD, as I'm done attempting to play games with companies that I don't have 100% faith in. What does everyone think?",
        "subreddit": "stocks",
        "title": "What to do with PINS?",
        "url": "https://www.reddit.com/r/stocks/comments/qh7gnn/what_to_do_with_pins/",
        "created": 1635399975.0
    },
    {
        "author": "ArnoldisKing",
        "created_utc": 1633399437,
        "id": "q1kz2r",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "you have money to invest...what are you putting it into assuming current prices?\n\nWould you just throw it into apple, msft, and a little amazon given the recent drops or do you think a bigger correction is coming and so would you put it in non-tech stuff? thoughts on chewy at current price? otly, bmbl?\n\nwhat would you do? curious.\n\nthanks.",
        "subreddit": "stocks",
        "title": "you have some money to invest...what are you putting it into assuming current prices?",
        "url": "https://www.reddit.com/r/stocks/comments/q1kz2r/you_have_some_money_to_investwhat_are_you_putting/",
        "created": 1633428237.0
    },
    {
        "author": "DavidNguyen2354",
        "created_utc": 1634138965,
        "id": "q7dmot",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "College student here, recently received my refund check which was about 2,100. I am going to stash 300 away and put the remaining 1,800 into stocks. I am 29% into MSFT, 12% in MRNA, 11% in APPL, 34% in GOOGL, and the rest is other random companies. Anyone have any ideas where to allocate the 1,800?",
        "subreddit": "stocks",
        "title": "Which stocks should I spend my refund check on?",
        "url": "https://www.reddit.com/r/stocks/comments/q7dmot/which_stocks_should_i_spend_my_refund_check_on/",
        "created": 1634167765.0
    },
    {
        "author": "life_is_just_peachy",
        "created_utc": 1634230861,
        "id": "q83x2m",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft (MSFT) yolo",
        "url": "https://i.redd.it/krubffhv5gt71.jpg",
        "created": 1634259661.0
    },
    {
        "author": "X-2357",
        "created_utc": 1634178578,
        "id": "q7qfpt",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "IONq is the first of many world changing quantum computer companies. Rigetti uses traditional superconducting quantum arrays that translate a little easier to conventional computers. The huge downside is the need for extreme cooling. Rigetti uses multi layers where the innermost layer is 100x colder than outerspace. Xanadu uses photonic systems that are great, and run at room temp but they need lots of additional hardware to work and will be difficult to scale down. Microsoft is working on topological arrays which would provide utility benefits but it hasn't been proven yet and they had to retract one of their papers on it. The point is that there are various methods to how you can create and manipulate qubits, the foundation for quantum computing.\n\nIONq uses trapped ions, from a single atom of ytterbium. Technically a rare metal but it's not rare. Then they manipulate the ions using lasers to create the qubits on the array. Sh*t is bleeding edge and I understand .005% of it but I read everything I can find. It can run at room temp and be easily scaled. Basically IONq doesn't need all the extra resources to create and manipulate their qubits, so the cost and energy requirements are down. This also allows for upscaling arrays on existing hardware. Like they can turn a 16 qubit system into a 64 qubit system eventually using the same stuff  they just have to reduce the expected errors that come with quantum computing.\n\nIONq got starting investment money from Amazon, Bill Gates, Samsung, Lockheed Martin, Hyundai, goldman sachs and more. They used that money to prove the tech works and are currently operating with Amazon Braket as their most powerful hardware supplier. Currently IONq has the most powerful quantum computer in business operation at 32 qubits. The next closest comp is 16 qubits. And you can have 9 qubit, 11 qubits computers, it doesn't need to be doubled evenly like ram for instance.\n\nRemember when you see qubit numbers in the future and from other companies, what that really means.\n\nQuantum computing is based on \"physical qubits\" and \"digital\" simulated qubits. Conventional computers use bits.\n\nNo matter what method you use, ions, photonic, superconducting, etc, You can't have a fully isolated qubit because then you couldn't interact with it to manipulate and tell it what to do. To get around this, modern quantum computing is based on running \"leaking\" environments with varying fidelity and trackable errors. We use the say 93% that is still functional to simulate more isolated qubits, and use those to simulate even more isolated qubits, in deeper layers until we have a fully isolated qubit we can error correct. \n\nEventually we need 1 million qubit machines to simulate 10k error corrected machines. IONq just demonstrated how they can scale up to a million at a recent presentation. Eventually a QPU could really lead to some radically advancements in financial predictions, cybersecurity and encryption, biotech discovery, simulation modeling and on and on.\n\nThey SPAC merged with DMYI with $600m , $350m of which is pipe investment that is locked up for 6 months from now. Ran to $12 before merger, tanked to $10 at merger, tanked to $7.30 during spy correction and tech sell off. It was mostly shorts based on volume. They have tiny revenue because they are just getting started but that doesn't matter imo. They had that white house presentation to show off and IONq is the only pure quantum computer company on the market so far, with rigetti spac io'ing in a few months.\n\nThe pipe investment unlocks in 5 1/2 months and that could be the only negative event coming up. I'll decide what I do with my shares, closer to the date, either hold or sell then compound my gains to hold, maybe for life. It's bleeding edge tech and to try to simplify it more, instead of linear binary data, 1s and 0s. The data can be 1 and 0 at the same time in any ratio, in any direction. It's a bigger technological leap than people understand.\n\nhttps://aws.amazon.com/braket/hardware-providers/ionq/\n\nhttps://www.businesswire.com/news/home/20211011005114/en/IonQ-and-University-of-Maryland-Researchers-Demonstrate-Fault-Tolerant-Error-Correction-Critical-for-Unlocking-the-Full-Potential-of-Quantum-Computers\n\nhttps://money.usnews.com/investing/news/articles/2021-10-05/amazon-and-google-set-to-attend-white-house-forum-on-quantum-technology\n\nhttps://www.businesswire.com/news/home/20210927005262/en/IonQ-Expected-to-Go-Public-With-in-Excess-of-600-Million-in-Expected-Gross-Proceeds\n\nhttps://ionq.com/posts/december-09-2020-scaling-quantum-computer-roadmap",
        "subreddit": "SPACs",
        "title": "IONq &amp; Quantum Computers are already here",
        "url": "https://www.reddit.com/r/SPACs/comments/q7qfpt/ionq_quantum_computers_are_already_here/",
        "created": 1634207378.0
    },
    {
        "author": "guanciallee",
        "created_utc": 1633342941,
        "id": "q12nl9",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "There are a lot of disclaimers for this post that are extremely important. As a result, I have included them at the end indicated like so ^**1**. Additionally, I walk through the math so that everyone can understand the process and for people wanting to critique/question. There is a TL;DR at the end but without context, it's pretty unbelievable. \n\n### Sourcing Data\nEvery list of American Mutual funds has slight errors (even this [one](https://investexcel.net/complete-list-of-mutual-funds-across-all-international-exchanges/)). So I created a list with [Market Watch](https://www.marketwatch.com/tools/mutual-fund/list?firstLetter=A) of around 25,000 mutual fund tickers. Most mutual funds have multiple different tickers because of different shares/classes. Each class contains the same investments it's just variations on your fee structure ^**1**. So I counted only one example from each mutual fund ^**2**. This is controversial but I believe it will give the most accurate results. [This](https://imgur.com/a/BI4vCvB) example I would have kept two because there are only two mutual funds here. You shouldn't include every share/class because it will have an overrepresentation of certain mutual funds.\n\nI used the stock history function in Excel to find the price of each ticker on the 1st of every year since 1990^**3**. If it didn't have a price I got rid of it for that particular year. For context at the beginning of 2021, I have around 6700 unique mutual funds in my list^**4**. \n\n###The Math\nI did the following calculations for every American Mutual Fund since 1990 ^(**5** Big disclaimer). First I calculated the percent change from each first day of the year to the next first day of the year (2020 Jan 2/2019 Jan 2)-1. Many people calculate change inside of a year but I did the math for gains of a year gap instead. As long as I use the same timeframe every time the math is sound. The percent amounts might be slightly different than what is commonly publicized. Secondly, I calculated the percent change from the beginning of every year from 1990 until now ^**6** (1990-Now, 1991-Now, 1992-Now Etc.). \n\nI chose these two calculations because one is a very common attribute (year difference) and since most people buy and hold mutual funds for many years I wanted to see what the result would be holding for many years until now. I then calculated averages for these two distinct calculations for each year. As well as trimming 2.5% Top+Bottom and 10% Top+Bottom of mutual funds to exclude outliers and calculating a new percentage with that (keeping all 3 results for each calculation/year). \n\n###Index Funds\nI chose S&amp;P500 (.INX) Dow Jones Industrial Average (.DJI) and Nasdaq Composite (.IXIC) and found their historical prices via Google Sheets. The same math calculations were done for the same timeframe gaps (i.e single year gaps and each year until now gaps). \n\n###Analysis\nI started by comparing the 'each year till now' percentages for mutual funds to the three indexes. I can also calculate what percentage of mutual funds each index is higher than in each specific calculation. Here are the results from [1990-Now](https://imgur.com/a/Ga3pSNq). It becomes quite apparent that the order of best returns goes Nasdaq, S&amp;P then Dow Jones. Each Index normally beats out  90%+ of Mutual funds for each timeframe (sometimes 98%+). Even if you bought at the peak of the dot-com bubble (2000) or before the 2008 crash, each index would still beat the overwhelming majority of Mutual funds from that same time frame. If you knew to buy any index in the '90s it's a slaughter. \n\n\nLooking at only this data doesn't take into account a random great year for an index fund. As well there is a common notion that Mutual funds might not gain much but they shield you from losses. Let's address that by diving into the other calculation I did with the percent change from a year to the next year. \n\n\nHere is [1990-Now](https://imgur.com/a/wSEychd). Red cells indicate when an index is lower than the average mutual fund from that year. The results are when the indexes are down the average mutual fund is also very much down (Out of the 8 times S&amp;P closed negative since 1990 4 times it still outperformed the average mutual fund). There has never been a year where any index was negative yet the average mutual fund was positive. The indexes are usually beating 55-90% of mutual funds every year (With them beating 90%+ many times). Dow has beaten the average yearly mutual fund return 66% of the time in the past 30 years, S&amp;P &amp; Nasdaq being 80%. The dot-com bubble is the exception to the stellar performance where a difference between index funds and mutual funds is notable.\n\n###Conclusion\n\nPicking a mutual fund that somehow outperforms any index is a massive uphill battle because the indexes usually beat 55-90% of mutual funds every year (with them beating 90%+ many times). Normally you hold mutual funds for many years, so even if you succeed in choosing a winner one particular year you will still eventually lag behind the index funds. The longer timeframe the more likely (Index funds beating 92%+ of mutual funds over time is the norm)\n\nYou can make a lot of observations from this data and that's what I am going for. Make your own conclusions but keep in mind most statistics relating to the mutual fund world are not primary sources. Most of the time people are trying to convince you to buy Mutual Fund XYZ. This post is primary research where you could easily replicate my findings. \n\nThe biggest flaw to this data is the fact that we've been in a record bull market which means aggressive investments look better in hindsight. That's why looking at both calculations I did is important, so you can see a clearer picture. You could easily do much more math to find patterns before the current record bull market. For example, calculate percent changes from various timeframes such as 1990-2018, 1991-2018 or 1990-1995, 1991-1996 or 1990-1992, 1990-1993, etc. I can calculate and post some of them if people request them. This is not financial advice.\n\n\n### TLDR\nThe overwhelming majority of mutual funds can't compete with either Dow, Nasdaq, or S&amp;P any way you slice the data. They don't come close to competing in terms of gains and still perform badly in years when the index funds perform badly (they sometimes perform even worse during these years, the dot-com bubble is the exception). You get roughly the same amount of losses but with only a slight portion of the gains. Even if you choose a mutual fund winner one year your multi-year investment will eventually lag behind the index funds by quite a lot. \n\n\n###Disclaimers\n\n\n^(**1** Some load the fees in the entry, some in the exit, some on a yearly percent basis, and some in other forms)\n\n^(**2** Choosing just one was difficult but I tried to choose Class A if possible. If not possible then B, if not then C, then D, etc.)\n\n\n^(**3** Occasionally Excel would give a unique error on the first trading day of the year to some mutual fund tickers. So I would alter the queried data to the next historical trading day.)\n\n^(**4** There could still be mutual funds that Market Watch doesn't document and/or Microsoft cant query. This is a dilemma that I decided to ignore. There is just no real way to get around this.)\n\n^(**5** Flaw in my data here is that I can't find old historical lists of mutual funds while also finding the historical prices of said mutual funds. I can only find a current list of mutual funds and historical prices of whatever is currently listed. This is an example of survivorship bias because I won't have the data for any mutual funds that were available but delisted before 2021. As I move further back in time my original list of 6700 mutual funds shrinks every year. If I had to guess this influences my results in my post to be slightly higher returns than the truth. This is because any mutual funds that performed horribly and delisted before 2021 wouldn't be included in my math above.)\n\n\n^(**6** When I say 'Now' I mean September 24th specifically.)",
        "subreddit": "investing",
        "title": "A returns analysis comparing all American Mutual Funds to the top 3 American Index funds from 1990-Now",
        "url": "https://www.reddit.com/r/investing/comments/q12nl9/a_returns_analysis_comparing_all_american_mutual/",
        "created": 1633371741.0
    },
    {
        "author": "switchitup_lets",
        "created_utc": 1634769946,
        "id": "qcd3k9",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I just realized next week is going to be circus... amazon, apple, microsoft, google, facebook, AMD, shopify, plus more tech companies are going to report earnings.\n\nSo, as a little fun thought, what do you think will happen before earnings date, and after earnings report?\n\namazon - before: sideways, after: drop\n\naapl - before: down, after: drop (as with tradition lol)\n\nmicrosoft - before: sideways, after: drop\n\ngoogle - before: up, after: up\n\nfacebook - before: up, after: down\n\nAMD - before: down, after: sideways\n\nshopify - before: down, after: up\n\n&amp;#x200B;\n\nWhat is everyone's thoughts? You can provide reasons or not, up to you. Please feel free to list any other company if you have a good feeling about it.",
        "subreddit": "stocks",
        "title": "Upcoming tech earnings",
        "url": "https://www.reddit.com/r/stocks/comments/qcd3k9/upcoming_tech_earnings/",
        "created": 1634798746.0
    },
    {
        "author": "masteroflich",
        "created_utc": 1634294027,
        "id": "q8lo3j",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Shopifys PE ratio has come down substantially over the past few quarters sitting on around 72 right now. For a company thats often labeled as the definition of overvaluation this doesnt seem very high.\n\nFor reference, other cloud businesses:\n\nAdobe has 48 and isnt growing half as fast. \n\nMsft is sitting at 36 and is arguably much more saturated that SHOP.\n\nsame with Amazon at 57\n\n&amp;#x200B;\n\nIt helps the company is a slight amount off its ATH, but im acutally considering doubling my initial investment. Thoughts?",
        "subreddit": "stocks",
        "title": "Why is $SHOP still considered heavily overvalued?",
        "url": "https://www.reddit.com/r/stocks/comments/q8lo3j/why_is_shop_still_considered_heavily_overvalued/",
        "created": 1634322827.0
    },
    {
        "author": "MustNotFapBruh",
        "created_utc": 1633969759,
        "id": "q5zotx",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "As described in title, I’d love to have some thoughts on which of NASDAQ or S&amp;P 500 you all will be better in the next 10 years? (Yes, no one knows the answer but I’d love to have some discussion and analysis from you all)\n\nQqq has significantly outperformed SPY/VOO in the last 10 years with around 22% each year while the latter returns with around 16%. \n\nSome believe tech will be still be dominant as they are the future of the world as usual, yet they have too much gains already that some claimed it might slow down in the next 10 years, esp with “overvalued valuation”. While 16% is excellent each year by S&amp;P 500 but didnt perform as well as nasdaq.\n\nYet some believe we will be seeing taper and higher fed rate soon where the cost of borrowing will be higher, thus less creative or world changing companies might appear, which might hit Nasdaq more than us think. Since S&amp;P track more companies than Nasdaq, will it be a better invesment than qqq in the next 10 year? Especially with higher interest rates benefiting financial sectors like banks. And mid-small cap might be more explosive and game changing since companies like Apple or Microsoft are already too big so we expect the growth will be slowing down?\n\nI’m trying to pick one of them to DCA into. Any thoughts? Thanks guys I will appreciate all of you!",
        "subreddit": "stocks",
        "title": "Nasdaq or S&amp;P 500 next 10 years?",
        "url": "https://www.reddit.com/r/stocks/comments/q5zotx/nasdaq_or_sp_500_next_10_years/",
        "created": 1633998559.0
    },
    {
        "author": "trickintown",
        "created_utc": 1635221917,
        "id": "qfyfib",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "We typically talk a lot about FAANG + MSFT as solid investments. I am looking at salesforce right now and that looks like a behemoth. \n\nThe P/E is high but their growth is also unprecedented. \n\nSalesforce is much more than a CRM, they are going to be at the forefront of the low code platform and that is going to be the growth for this decade.. \n\nProfitable company, growth numbers are solid, beautiful acquisitions (slack, tableau, mulesoft)\n\nAnyone thinking to hold this for a 10 yr and see this 25x?",
        "subreddit": "stocks",
        "title": "Salesforce for a long term investment.",
        "url": "https://www.reddit.com/r/stocks/comments/qfyfib/salesforce_for_a_long_term_investment/",
        "created": 1635250717.0
    },
    {
        "author": "reactbooter",
        "created_utc": 1635280931,
        "id": "qgfqbv",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Am 29. Lost 90k gambling on stocks (mostly shit SPACs) in the market. In dire straits now.\n\nNew allocation after I decided to stop destroying my life:\n\nVXUS: 15%  \nVTI: 50%  \nQQQM: 5%  \nVGT: 20%  \nIYR: 5%  \nIndividually selected blue chips: 5%  \n\n\nI’m planning allocate that 5% for blue chips like this:\n\n1% AMZN  \n1% MSFT  \n1% LMT  \n1% BRKB  \n1% GOOG\n\nCurrent net worth: 200k USD. Can I recover financially from my current position and still retire at a good age?",
        "subreddit": "investing",
        "title": "Can I recover financially",
        "url": "https://www.reddit.com/r/investing/comments/qgfqbv/can_i_recover_financially/",
        "created": 1635309731.0
    },
    {
        "author": "Itay-shap",
        "created_utc": 1634246660,
        "id": "q88wss",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "In recent years there has been a paradigm shift in the workforce domain.\n\nThis was extremely accelerated during the COVID pandemic.\n\nI’m talking about the freelance industry or the so called Gig sector.\n\nA 2019 study by Mastercard estimated that the global gig economy generates $204 billion in gross volume. In the United States, it has been predicted that by 2027, the country may have more “giggers” than non-gig workers.\n\nAccording to a 2020 report from Intuit, 25-30 percent of the U.S. workforce is uncertain, and more than 80 percent of large corporations plan to substantially increase their use of a flexible workforce in the coming years.\n\nFurthermore, according to a survey published on Bloomberg, more than 1,000 hiring managers implies that 40.7 million Americans expect to be working remotely by 2026. That’s 4.5 million more than in a previous poll in the third quarter of 2020 -- and about 21 million above pre-pandemic levels!\n\nStudy from Wharton conducted during this ‘work from home’ huge experiment forced by the pandemic, showed that across the economy, productivity has actually remained stable during the pandemic, with productivity even increasing in many companies.\n\n# People simply don’t want to return to work, the reasons are:\n\n1. The federal government added $600 more per week to unemployment benefits already provided by the states. Even as states have worked to cut benefits, the wages received are still comparable to ones at a regular job.\n2. Inflation rate is higher than the Wages growth rate – reduced motivation to return to work\n3. People are worried about returning to a more rigid work schedule.\n4. Some people have truly thrived with the newfound flexibility of working remotely.\n5. People are worried that microaggressions at work will worsen your mental health.\n6. People are simply still worried about getting exposed to COVID-19.\n\n**For many, the pandemic has been a wake-up call that revealed how much we actually neglected our self-care before now. Now, many of us have gotten a taste of better balance and aren’t ready to give it up. We want our freedom – we want to be freelancers.**\n\n# Currently there are two public traded Gig companies: Upwork (UPWK) and Fivver (FVRR).\n\nHere are a comparison table between the two:\n\n|**Company**|**market cap**|**P/S**|**EV/S**|**Revenue**|**Revenue Grow**|\n|:-|:-|:-|:-|:-|:-|\n|**Upwork**|6.89|15.5|15.63|440.7|41.90%|\n|**Fivver**|6.35|23.51|24.97|251.81|59.70%|\n\nIt’s true that Fivver is growing at faster rate than Upwork, but it just can’t justify the financial ratios difference between them. **Fivver, simply put, is much more expensive than Upwork**.\n\nDon’t get me wrong, Fivver is a great company but it still mainly focuses on End user / small projects, while Upwork is primarily about mid/large scale projects, which is what this paradigm shift is all about.\n\n**Upwork** has collaborations with major Fortune 500 companies including Microsoft, Samsung and Zoom, as more commercial giants turning to online freelancing platforms to find knowledge workers.\n\nSo what do you think? Upwork to the moon and beyond?",
        "subreddit": "wallstreetbets",
        "title": "$UPWK - The Gig Sector is booming and it's not going to change",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q88wss/upwk_the_gig_sector_is_booming_and_its_not_going/",
        "created": 1634275460.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1634760228,
        "id": "qc9lxh",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Wednesday, October 20, 2021**\n\n***Quick rant:*** *It’s remarkable how quickly market sentiment changes. It seems two weeks ago, everyone was predicting an imminent market crash and, in many occasions, going as far as insulting my intelligence for presenting a different viewpoint and remaining bullish even during the height of the Evergrande situation and a looming US debt default. Now it seems the doomsaying posts and articles have all but disappeared. The market has dipped significantly roughly 5-6 times this year and every time it happens I see the same upswell of doomsaying articles and market crash predictors. Not to go on a rant, but it amazes me how willing people are to fight against the trend. Like I’ve said, it is important to acknowledge risks present in the market and be prepared to react to the unforeseen, but I don’t get why people decide to consciously decide to fight market trends, it is much easier and more profitable to just ride them until you can’t anymore. There’s a saying that goes, pessimists sound smart, optimists make money. I have found this saying to be true.* \n\nThe incredible rally in the stock market continued, with the S&amp;P 500 (SPY) climbing seven straight days to claw back the losses suffered in September when the index dipped -5% from highs for the first time all year. While the tech-heavy Nasdaq (QQQ) fell modestly today, the index has rocketed more than 6% higher from the lows on October 4, a stunning comeback. The Dow Jones (DIA) reached a new intraday all-time high, carried by continued strength in financial stocks. The Russell 2000 (IWM), which tracks the performance of small-caps, traded modestly higher today. Market participants remain encouraged by stronger-than-expected corporate profits amid ongoing supply-chain pressures.\n\nVery strong corporate earnings reports from bellwethers like big banks, Johnson and Johnson (JNJ), and Procter and Gamble (PG) have assuaged fears that corporate profits would slow down dramatically amid supply chain constraints. As the earnings season kicked off, market participants were nervous that ongoing inflationary pressures, labor market imbalances, and congestions issues at ports would greatly weigh on corporate profits. So far, that has not proven to be the case. \n\nJon Adams, Senior Investment Strategist at BMO Capital Markets said, “We think investorshave been too pessimistic on earnings expectations. It does look like Q2 was likely the peak, but Q3 is going to be strong, probably above 30% year-over-year growth. We think the strength will continue into the fourth quarter, we’re not overly concerned about profit margins. We are closely monitoring supply chain issues and increasing wage pressures but still think that profit margins are at healthy levels, and that there's more upside to come.\"\n\n**Highlights**\n\n* The price of … reached new all-time highs, breaking $65k for the first time after the first-ever ETF was launched in the market yesterday.\n* Sharers of Pinterest (PINS) rocketed higher after Bloomberg reported that PayPal (PYPL) was considering acquiring the company for $70 a share (roughly $39 billion). Shares of PINS were up more than 10% while shares of PYPL fell after the report was released.\n* Adobe (ADBE) says it expects holiday-period online sales to reach an all-time high of $207 billion from November 1 to December 31 in the US. That would represent a jump of 10% YoY. The company says it expects global online sales to reach $910 billion, also a record.\n* The 30-year fixed mortgage rate increased to 3.23% for the week ended Oct. 15, according to a weekly update from the Mortgage Bankers Association. This is the highest level in six months and higher than the 3.18% during the prior week. \n* Facebook (FB) will change its name in order to reflect itself as a “metaverse” company. As a reminder, the metaverse is a shared, 3D virtual space in which people can interact with the environment and other via online avatars accessed using virtual reality technology.\n* Jack MA, founder of Alibaba (BABA) was seen traveling in Europe, specifically Spain, in the first overseas trip since the government began cracking down on his companies over a year ago. \n* DraftKings (DKNG) is launching online betting operations in Connecticut\n* Ford Motors (F) to invest $300 million in building an electric vehicle car parts factory in the UK\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Amazon (AMZN) target set at $4,100 by Mizuho. Stock currently around $3416\n* Apollo Global Management (APO) target raised by BMO Capital Markets from $80 to $93 at Outperform. Stock currently around $75\n* Chevron (CVX) target raised by Raymond James from $125 to $134 at Outperform. Stock currently around $113\n* Caesars Entertainmnet (CZR) target raised by Morgan Stanley from $127 to $138 at Overweight\n* Generac (GNRC) target raised by KeyCorp from $500 to $520 at Overweight. Stock currently around $461\n* Halliburton (HAL) with a host of target raises. Average price target $30 at Overweight. Stock currently around $26\n* Microsoft (MSFT) with two target raises. Stock currently around $307\n   * Jefferies Financial from $345 to $365 at Buy\n   * Wedbush from $350 to $375 at Outperform. S\n* Netflix (NFLX) with a host of target raises after posting positive earnings. Average price target $725 at Buy. Stock currently around $625\n* ServiceNow (NOW) target raised by Bank of America from $700 to $800 at Buy. Stock currently around $680\n* O’Reilly Automotive (ORLY) target raised by Wells Fargo from $670 to $700 at Overweight. Stock currently around $644\n* Signature Bank (SBNY) with three target raises. Stock currently around $310\n   * Maxim Group from $330 to $375 at Buy\n   * Wedbush from $320 to $340 at Outperform\n   * Raymond James from $337 to $360 at Strong-Buy\n\n“Don't judge each day by the harvest you reap but by the seeds that you plant.” - Robert Louis Stevenson",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, October 20, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/qc9lxh/here_is_a_market_recap_for_today_wednesday/",
        "created": 1634789028.0
    },
    {
        "author": "mamoiselle",
        "created_utc": 1633355541,
        "id": "q15v22",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I got my first full time job after uni at end of 2019, didn’t know what to do with all the excess cash so I started learning about personal finance and investing. I’ve made a decent return since I started — nothing to do with me doing due diligence, just bought some stocks during March crash. It was exciting and fun learning about this world, but now I realized I don’t have the time or the desire to do any due diligence. I currently have Questrade Margin, WS TFSA Trade, WS Margin Trade, with about 15 stocks in each. I know it’s bad and a lot to manage, probably why they no longer spark joy. **My end goal is to have most if not all my money in Wealthsimple auto-invest or XEFT, but confused on the smartest way to make that transition.**\n\n* Option 1: Don’t overthink it or be greedy by playing the waiting game. Sell everything immediately, the good and the bad, and move on to only XEFT or WS Invest. *Main concern: I’m in no rush, option feels a bit rash &amp; stupid.*\n\n* Option 2: Lock in your gains and wait the losses out. Sell off all the stocks that I’ve made any gain on, but hold on to the stocks that are in the red. If the stocks ever turns green, then sell it. If not, hold it for life - I’m very patient. *Main concern: opportunity cost of my money that’s locked in with red stocks.*\n\n* Option 3: Sell off all the losses and most of the gain stocks. Only hold on to a few strong gain stocks that I believe in long-term (e.g Aritzia, Microsoft, Telus, BNS, Apple). They have a higher return than XEFT/Wealthsimple auto-invest - They would allow me to have the thrill of the stock market but with ‘safe’ stocks I believe will always bounce back. Leaning towards this option. *Main concern: I have a bad habit of hoarding stocks. I always buy (without proper diligence) and have never sold a stock. Afraid if I pick even a few stocks, I’ll be right back where I started.*\n\nY’all were a great resource when I started my personal finance journey, and would love to hear your thoughts as I move into a more passive investing strategy.",
        "subreddit": "CanadianInvestor",
        "title": "How to best transition out of stock market?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/q15v22/how_to_best_transition_out_of_stock_market/",
        "created": 1633384341.0
    },
    {
        "author": "infuriatedworshipwa",
        "created_utc": 1634576575,
        "id": "qaqxtd",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": " \n\n**TORONTO, October 18, 2021**\\--(BUSINESS WIRE)--Tokens.com Corp. (NEO Exchange Canada: COIN)(Frankfurt Stock Exchange: 76M) (OTCQB US: SMURF) (\"Tokens.com\" or the \"Company\"), a publicly traded company that invests in revenue-generating crypto and blockchain assets linked to Decentralized Finance (\"DeFi\"), Non-Fungible Tokens (\"NFT\") and metaverse real estate, is pleased to announce that the Company has closed its purchase of a 50% stake in Metaverse Group.\n\nTokens.com issued two million common shares at an issue price of CAD$0.84, valuing the acquisition at CAD$1,680,000, making it one of the highest value equity investments ever in a specialized Metaverse real estate company. Tokens.com received twenty-five million shares of Metaverse Group for its 50% ownership position.\n\nMetaverse Group is one of the world’s first virtual NFT based real estate companies and owns an extensive portfolio of [virtual NFT real estate properties](https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fmetaverse.properties%2F&amp;esheet=52510168&amp;newsitemid=20211018005069&amp;lan=en-US&amp;anchor=virtual+NFT+real+estate+properties&amp;index=5&amp;md5=01b066878a6ac8d4718820baa48b8fa8) in major blockchain-based Metaverses including Decentraland, Somnium Space, The Sandbox, Cryptovoxels and Upland. Metaverse Group operates additional services including virtual property development, property management, and assisting companies with marketing and advertising in the Metaverse.\n\n\"The Metaverse is a game-changer for how advertisers and brands market their products. Physical and virtual real estate are extremely similar. As more people congregate in these virtual cities, the land becomes more sought after for its ability to reach a new global demographic. Brands like Adidas1 and Gucci2 are discovering this, as are artists like Snoop Dogg3 and Ariana Grande4,\" commented CEO, Andrew Kiguel of [Tokens.com](https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Ftokens.com%2F&amp;esheet=52510168&amp;newsitemid=20211018005069&amp;lan=en-US&amp;anchor=Tokens.com&amp;index=6&amp;md5=cd13d0a1bb4220ca05dd93d8f4965b3f). \"Metaverse Group has the potential to be a major landlord and developer by using the same strategies used by physical real estate managers.\"\n\nA metaverse is a 3D online city where people can work, play games and communicate in a virtual environment. Tech firms have implemented metaverse elements in popular games including Animal Crossing, Fortnite and Roblox. Other technology companies such as Microsoft have also embraced the metaverse as the convergence of the virtual and physical world which has only been accelerated with the pandemic. Facebook CEO, Mark Zuckerburg made headlines recently when he said the world’s most popular social network will become a metaverse company5. These elements include planning live events such as concerts, conferences, pitch competitions and tournaments where millions of players can interact from around the globe.\n\n**About Tokens.com**\n\nTokens.com Corp is a publicly traded company that owns an inventory of DeFi and NFT based cryptocurrencies. Through a process called staking, Tokens.com’s inventory of cryptocurrencies is used to earn additional tokens. In addition, Tokens.com co-owns Metaverse Group, one of the world’s first NFT based, virtual real estate blockchain companies. Through its growing digital asset inventory, Tokens.com provides public market investors with a simple and secure way to gain exposure to cryptocurrencies linked to DeFi and NFTs.\n\n**Source** [https://ca.finance.yahoo.com/news/tokens-com-announces-closing-acquisition-113000069.html](https://ca.finance.yahoo.com/news/tokens-com-announces-closing-acquisition-113000069.html)",
        "subreddit": "pennystocks",
        "title": "Tokens.com Announces the Closing of its Acquisition of 50% of Metaverse Group, One of the World's First Virtual Real Estate Companies",
        "url": "https://www.reddit.com/r/pennystocks/comments/qaqxtd/tokenscom_announces_the_closing_of_its/",
        "created": 1634605375.0
    },
    {
        "author": "learn-and-earn-",
        "created_utc": 1634162283,
        "id": "q7lo4c",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Hi r/options! I was thinking of buying [**LEAP**](https://www.investopedia.com/terms/l/leaps.asp) call options on some top tech stocks that I'm generally bullish on (**MSFT, FB, NVDA, AMD, FB, SNAP** etc.) but wasn't sure if the macroeconomic factors at this point would support this investment. More specifically:\n\n&amp;#x200B;\n\n1. **Fed taper**: News reports suggest that the Fed taper will begin sometime [before the end of 2021 ](https://www.reuters.com/world/us/feds-clarida-employment-test-begin-bond-taper-all-met-2021-10-12/) and conclude sometime in the [middle of 2022](https://www.cnbc.com/2021/09/22/federal-reserve-holds-interest-rates-steady-says-tapering-of-bond-buying-coming-soon.html). Some articles do however suggest that the [impact of this on the market won't be too high](https://www.thebalance.com/fed-tapering-impact-on-markets-416859) and that the \"[tantrum](https://www.investopedia.com/terms/t/taper-tantrum.asp)\" from 2013 was more fear than actual impact on the market.   \n\n2. **Fed interest rate hikes**: News report suggest that with inflation and/or stagflation, interest rates would have to be [hiked either in 2022 or early 2023](https://www.cnbc.com/2021/10/13/federal-reserve-releases-minutes-from-its-september-policy-meeting.html)  \n\"*In the “dot plot” of individual members’ expectations for interest rates, the committee indicated it could begin raising interest rates as soon as 2022. Markets currently are pricing in the first rate hike for next September, according to the CME FedWatch tool. Following the release of the minutes, traders increased the likelihood of a September hike to 65% from 62%.\"*  \n\n\nWhat would the impact of these factors be on tech stocks like the ones I mentioned above? Is it still a prudent decision for me to buy LEAPs on these stocks that expire in say Jan 2023 / June 2023?",
        "subreddit": "options",
        "title": "Is now a good time to invest in LEAPs?",
        "url": "https://www.reddit.com/r/options/comments/q7lo4c/is_now_a_good_time_to_invest_in_leaps/",
        "created": 1634191083.0
    },
    {
        "author": "Electronic-Trash-501",
        "created_utc": 1635165198,
        "id": "qffp7u",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "It really does seem like people FOMO into TSLA now quite a lot. I am surprised to see that to be the case. I am really new to investing, have been reading for only a few months, but the first time I bought anything I bought TSLA. I can't understand why having TSLA isn't a given and I would appreciate it if you guys could give me potential reasons other than the 'it's an overpriced stock'. Seeing how TSLA dominates EV and knowing what EVs are and how electric is the keystone of our entire transport not very long from now, as well as the AI bit, I am honestly not sure... I started out copying people, but I realized that I'd much rather invest in just a few companies that I truly believe in, with most of my portfolio being SPY or VTI because I don't know what I'm doing. I'd planned to have something along the lines of 85% SPY 5% MSFT 5% AAPL 5% TSLA, but I ended up having 50% TSLA since the September dip. Back at 720 people were saying that I should wait until it hits 500-600, but now that it's over 900 I feel like an investing god because I was 100000% sure this would happen. I don't know if there is another company that screams \"I am going to become a titan in the next 10 years\" more than Tesla does. But then again, I don't know anything. As soon as SpaceX goes public I am going to dump massive amounts into it as well. Looking at investing for the next 20-30 years, and having these companies at the forefront of the advancement of our transport, I can't see why that would be a mistake. What other companies are like this? Meaning inevitable success?\n\nI realize there must be many people who are like me as some of the people I talked to about investing who have no idea about it said \"Why not just invest in Apple, Tesla, Google?\" and I think a discussion like this would fit this sub nicely.",
        "subreddit": "stocks",
        "title": "I am surprised that people start mentioning TSLA here and only now.",
        "url": "https://www.reddit.com/r/stocks/comments/qffp7u/i_am_surprised_that_people_start_mentioning_tsla/",
        "created": 1635193998.0
    },
    {
        "author": "Ok-Lie-4596",
        "created_utc": 1634006941,
        "id": "q6cchj",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Kind of irrelevant but what's everyone's favorite logo. Logos are really the first thing you see when you think about a company and a really good logo can leave a great first impression on consumers. Ill start, my top 3 favorites are Microsoft, BP and Tesla. I think BP has a really clean logo that looks very sharp, Microsoft has a very iconic logo with the 4 different colored squares and Tesla's logo just looks very clean and high tech, and it looks great on vehicles.",
        "subreddit": "stocks",
        "title": "What's everyone's favorite logo?",
        "url": "https://www.reddit.com/r/stocks/comments/q6cchj/whats_everyones_favorite_logo/",
        "created": 1634035741.0
    },
    {
        "author": "Phx-Jay",
        "created_utc": 1634561756,
        "id": "qam52g",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "I’m just putting in someone else’s research on here.  I’m not a huge fan of all of Motley Fool picks but they have some decent analysts that have made me money over the years.  I got into Upstart, Nvidia, Hubspot, and Axon because of their recommendations.  I happen to agree this one so I’m sharing their info.\n\n“The case for Paysafe\n\nOnline gambling is a growing industry in the U.S. as more states continue to legalize the practice. Paysafe is a key facilitator for online casinos and bookmakers, providing secure payment processing services and digital wallets.\n\nThe company's flagship brands, Skrill and Neteller, are in high demand from some of the largest online gambling providers in the world. Paysafe has a decade-long relationship with European giant Flutter Entertainment, which owns popular platform Pokerstars, and the two companies are now working together in the U.S. through Flutter's Fox Bet sportsbook subsidiary. \n\nPaysafe is active in 15 of the 17 U.S. states where online gambling is legal, and with seven more states set to open up in late 2021 and 2022, the company's market opportunity continues to expand. In Canada, it's No. 1 in the online gambling industry, processing almost 100% of payments across the country. That's only a $2.5 billion market right now, so there's big upside as laws are slowly easing there, too.\n\nThe company's North American iGaming (online gambling) segment grew payment volumes by 72% in the most recent second quarter, far outpacing the rest of its business at 41%. But that's not to say the rest of the business isn't worth talking about.\n\nIn addition to gambling, Paysafe has a growing presence in the online gaming industry. Its partnership with Microsoft now spans 22 countries where it processes payments for in-game purchases made through the Xbox platform. And of course, no payments powerhouse is complete without a cryptocurrency segment -- Paysafe's Skrill digital wallet is used with 30 cryptocurrency exchanges, and offers 37 different tokens for trading.\n\nThe result is $1.54 billion in estimated revenue for fiscal 2021, and with a recent market capitalization of $5.7 billion, Paysafe stock trades at a price-to-sales multiple of 3.7 times.\n\nPaysafe's public listing was met with enthusiasm as it was caught up in the special purpose acquisition company craze of early 2021. Its recent stock price around $8 is a hefty discount to its $19.20 all-time high, and with the company operating in all the right growth areas, this might be a great long-term opportunity. “\n\nI’m really curious what you all think of this one.  They do have some debt but not an unmanageable amount.  I own shares and options.  I’m up over 100% on the options so already sold enough to cover my costs and playing with house money now but I can see this in the $10-$12 range by the end of the year.",
        "subreddit": "stocks",
        "title": "Update on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/stocks/comments/qam52g/update_on_paysafe_psfe/",
        "created": 1634590556.0
    },
    {
        "author": "hehehaha24",
        "created_utc": 1635514785,
        "id": "qid1ql",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "I just got my first Grown Up job and I'm in my mid-20s. My job offers a 401k after a year of being with the company. In the meantime, I opened up a roth and I've been contributing monthly. I'm new to investing and was wondering if I should focus on Etf's like VOO and QQQ over mutual funds. I'm currently a bit all over the place with my Roth investments, having invested in some Etf's and a few individual stocks like MSFT and AMD. \n\nInterested to hear your takes, as they will guide me with my own research.",
        "subreddit": "stocks",
        "title": "Should I invest in Etf's or Mutual Funds in my Roth Ira?",
        "url": "https://www.reddit.com/r/stocks/comments/qid1ql/should_i_invest_in_etfs_or_mutual_funds_in_my/",
        "created": 1635543585.0
    },
    {
        "author": "Just_Doin_It-",
        "created_utc": 1634668782,
        "id": "qbhvgm",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hello, felow investors! I'm an amateur investor. While I'm invested in a few of the better-known stocks (Alibaba, Microsoft, and Galactic Space to name a few) I have recently become very intrigued with the idea of investing in younger companies. While risky, it seems like a great growth opportunity. Two I found that seem promising are Romeo Power and Lordstown Motors. \nHas anyone else come across any companies that have recently gone public whose stock values are relatively low? \n\nThanks! Best of luck to you all!",
        "subreddit": "investing",
        "title": "Companies that recently went public",
        "url": "https://www.reddit.com/r/investing/comments/qbhvgm/companies_that_recently_went_public/",
        "created": 1634697582.0
    },
    {
        "author": "Maxcorsa",
        "created_utc": 1634751683,
        "id": "qc6fji",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "tl;dr -&gt; I'm quite anxious with my money but don't want to resign to having the minimum expected returns\n\nHi everyone,\n\nThanks in advance for any insights/advice you have to offer. So I (24M) became interested in investing in late 2019 and have learned over time that I really don't have the disposition right now to pursue volatile stocks (by my definition, things that typically move &gt;2% in a day). I have intellectually known for a while that companies like NET and F have good reasons to appreciate, but whenever I make a position in one of them, I become totally preoccupied with checking my portfolio and I really don't need the stress.\n\nWhat I'm working with right now is being consolidated, but in stocks that are tried and true. Thus, my holdings are simply:\n\n50% MSFT\n\n25% VGT\n\n25% QQQ\n\nThis is clearly very tech-heavy, but as I contribute over the coming months/years, I want to build a position in COST and other large-cap stocks in different sectors. I've chosen what I have to start because I really don't see tech underperforming the general market over a 20-year period barring anti-trust break-ups.\n\nShould I swap VGT for VTI? Are these tickers I can likely sit in and contribute to without looking at my portfolio every day?\n\nThanks again to those who read,\n\nCheers!",
        "subreddit": "stocks",
        "title": "Is my portfolio sufficiently \"set and forget\"?",
        "url": "https://www.reddit.com/r/stocks/comments/qc6fji/is_my_portfolio_sufficiently_set_and_forget/",
        "created": 1634780483.0
    },
    {
        "author": "TeenageDirtbagBaby",
        "created_utc": 1635191135,
        "id": "qfopi1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Cramer’s charitable trust, Action Alerts Plus, has invested more than $2.5 million in 30 stocks. [Cramer says his charitable portfolio would perform better under Biden (cnbc.com)](https://www.cnbc.com/2020/10/14/cramer-says-his-charitable-portfolio-would-perform-better-under-biden.html#:~:text=Disclosure%3A%20Cramer%E2%80%99s%20charitable%20trust%20owns%20shares%20of%20Apple%2C,to%20take%20a%20deep%20dive%20into%20Cramer%E2%80%99s%20world%3F)\n\nCNBC recently started a daily email newsletter that discusses what the trust is selling or buying in the portfolio. [Investing Club (cnbc.com)](https://www.cnbc.com/investingclub/)\n\nI was wondering if we could figure out what is in the portfolio? \n\nAccording to their last email \"the Charitable Trust will own 10,000 of Ford, representing 4.03% of the portfolio, 400 shares of Disney, representing 1.71% of the portfolio, and 250 shares of Eli Lilly, representing 1.53% of the portfolio. \" \n\nAn earlier email states \"Charitable Trust will own 725 shares of UPS (United Parcel Service), representing 3.67% of the portfolio\" and another email states \"charitable trust will own 450 shares of UNP (Union Pacific Corp), representing 2.6% of the Charitable Trust.\"\n\nFrom what I have gathered from the other investment club emails the portfolio also holds Honeywell, Facebook, PayPal, Google, Microsoft, AMD, Boeing, Linde, Mastercard, Amazon, Apple, AbbVie, Abbott, Nucor, Estee Lauder, and recently sold off all of their Crown Castle International.\n\nA Google search shows that the portfolio is holding (or did hold) PepsiCo, Salesforce, and CVS Health. \n\nWhich stocks am I missing?",
        "subreddit": "investing",
        "title": "Which 30 or so stocks are in Jim Kramer's charitable trust portfolio Action Alerts Plus?",
        "url": "https://www.reddit.com/r/investing/comments/qfopi1/which_30_or_so_stocks_are_in_jim_kramers/",
        "created": 1635219935.0
    },
    {
        "author": "mycoolredditname99",
        "created_utc": 1635564377,
        "id": "qisyuh",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hello! \n\nI'm trying to buy more equity which can go long term. I think everyone should own some index ETFs equivalent to spy and qqq. For stocks, I always like TD and MSFT. Any other stocks you would just close your eyes, ignore the current price and click Buy?",
        "subreddit": "CanadianInvestor",
        "title": "What are your staple stocks?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qisyuh/what_are_your_staple_stocks/",
        "created": 1635593177.0
    },
    {
        "author": "ihavestupidanixiety",
        "created_utc": 1635216431,
        "id": "qfwvu1",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "This post might be out of the ordinary, but I gotta give it a try. \nMy school is running a stock market game, where we all got around 10k and had to buy stocks, whoever makes e most money and whoever has the hugest percent of their stocks go up at the end wins, we can only switch stocks once a week and that day is tmrw. The profits go from how much the stocks was worth from the previous Week, \n\nRn I have:\n\n5 TSLA, 867. It’s at 1024 rn \n\n4 Netflix, 639. It’s at 671 now. \n\n5 NVDA at 223. it’s at 231 \n\n5 CVS at 85. it’s at 87 \n\n2 LYB at 99 it’s at 97 \n\n4 MSFT at 308 it’s at 308 rn. \n\nI can only take out profits. And all trades are tmrw. \nPls help me",
        "subreddit": "wallstreetbets",
        "title": "My school is doing a stock challenge and I need your help",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qfwvu1/my_school_is_doing_a_stock_challenge_and_i_need/",
        "created": 1635245231.0
    },
    {
        "author": "creationofthebigugly",
        "created_utc": 1635279355,
        "id": "qgf5qh",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft smashes earnings expectations with strong cloud performance",
        "url": "https://finance.yahoo.com/news/microsoft-q1-earnings-2022-162719993.html",
        "created": 1635308155.0
    },
    {
        "author": "DDistrict",
        "created_utc": 1633464342,
        "id": "q24dvm",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi All, \n\nCIBC Added 5 new CDR's today (PayPal, Facebook, Disney, Microsoft, Visa). \n\nDoes anyone know how the following situations would impact a CDR? \n\nIf you are holding Facebook CDRs for example and the company gets broken up, how would that affect the CDR price? Would a CDR holder reap any of the benefits (eg. X amount of shares of Instagram)? \n\nWhat about stock splits? Would the CDR split at the same rate as the under laying security? \n\nTIA",
        "subreddit": "CanadianInvestor",
        "title": "CIBC CDR's 5 Newly Added US Stocks + Questions",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/q24dvm/cibc_cdrs_5_newly_added_us_stocks_questions/",
        "created": 1633493142.0
    },
    {
        "author": "ToLaLune",
        "created_utc": 1635309682,
        "id": "qgoo9o",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hello Canadian Investors,\n\nHypothetical question for y’all.  If you could only invest in 4 of these 7 tech stocks, which would you choose and why?  For context, I’m a Canadian investing in my Questrade RSP which I won’t be touching for around 20 years.\n\n\n-Amazon\n\n-Apple\n\n-Google\n\n-Shopify\n\n-Microsoft\n\n-Alibaba\n\n-Facebook\n\n\n\nAny recos appreciated, thanks!",
        "subreddit": "CanadianInvestor",
        "title": "Tech Stocks in RSP",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qgoo9o/tech_stocks_in_rsp/",
        "created": 1635338482.0
    },
    {
        "author": "Ok_Performer2244",
        "created_utc": 1633879652,
        "id": "q5a6gk",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I'm a Microsoft employee and believe the company is going to do extremely well in the coming years. Azure is growing nearly 50% YoY and the company is diversified enough (Office, Windows, Xbox, Teams) to ensure stability in the coming years. I \ndo own 150k of stock and 80k not vested, also I'm buying all I can via the employee purchase program. Having said that, what is your forecast for the stock in 5 years? I know its hard but I believe the stock will be around 1k, am I crazy? Should I keep buying as much as I can within this high price point? (Today the stock is ~296)",
        "subreddit": "stocks",
        "title": "$MSFT Long term forecast. Will it get to 1000 in 5 years?",
        "url": "https://www.reddit.com/r/stocks/comments/q5a6gk/msft_long_term_forecast_will_it_get_to_1000_in_5/",
        "created": 1633908452.0
    },
    {
        "author": "False_Celebration923",
        "created_utc": 1634691490,
        "id": "qbpclc",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "If an option (MSFT 10/22 170 call) has an IV of 216%, does this mean i'm overpaying for the premium if i were to be buying it? simple question, one among many but i wanted to ask.\n\nAn ITM option has an IV of 17%. I don't need a complete explanation here but can someone point me to a good Youtube video that explains this?",
        "subreddit": "options",
        "title": "Implied Volatility, 3 years later, I don't completely understand it...",
        "url": "https://www.reddit.com/r/options/comments/qbpclc/implied_volatility_3_years_later_i_dont/",
        "created": 1634720290.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1635433839,
        "id": "qhp6kz",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n|Ticker|Company|# Mentions (24H)|\n|:-|:-|:-|\n|IBM|International Business Machines Corporation|[58](https://www.memebergterminal.com/stock/International%20Business%20Machines%20Corporation/IBM?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/International%20Business%20Machines%20Corporation/IBM?utm_source=rsmb)\n|AMD|Advanced Micro Devices Inc|[45](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb)\n|TSLA|Tesla Inc|[34](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb)\n|MA|Mastercard Incorporated|[28](https://www.memebergterminal.com/stock/Mastercard%20Incorporated/MA?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Mastercard%20Incorporated/MA?utm_source=rsmb)\n|MSFT|Microsoft Corporation|[27](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb)\n|SPY|SPDR S&amp;P 500 ETF Trust|[26](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb)\n|FB|Facebook Inc|[25](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb)\n|PYPL|PayPal Holdings Inc|[16](https://www.memebergterminal.com/stock/PayPal%20Holdings%20Inc/PYPL?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/PayPal%20Holdings%20Inc/PYPL?utm_source=rsmb)\n|GME|GameStop Corp|[15](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb)\n|AAPL|Apple Inc|[14](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb)\n|VTI|Vanguard Index Funds - Vanguard Total Stock Market ETF|[13](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb)\n|INTC|Intel Corporation|[13](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb)\n|AMZN|Amazon.com Inc|[13](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb)\n|VOO|Vanguard S&amp;P 500 ETF|[13](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb)\n|BABA|Alibaba Group Holding Limited|[11](https://www.memebergterminal.com/stock/Alibaba%20Group%20Holding%20Limited/BABA?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Alibaba%20Group%20Holding%20Limited/BABA?utm_source=rsmb)\n|AI|C3.ai Inc|[11](https://www.memebergterminal.com/stock/C3.ai%20Inc/AI?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/C3.ai%20Inc/AI?utm_source=rsmb)\n|QQQ|Invesco QQQ Trust Series 1|[11](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb)\n|CRSR|Corsair Gaming Inc|[11](https://www.memebergterminal.com/stock/Corsair%20Gaming%20Inc/CRSR?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Corsair%20Gaming%20Inc/CRSR?utm_source=rsmb)\n|PINS|Pinterest Inc|[11](https://www.memebergterminal.com/stock/Pinterest%20Inc/PINS?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/Pinterest%20Inc/PINS?utm_source=rsmb)\n|NVDA|NVIDIA Corporation|[10](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb)\n|GM|General Motors Company|[8](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb)|[See Specific Mentions](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb)",
        "subreddit": "stocks",
        "title": "I scraped r/stocks for the top ticker mentions in the last 24H. Here are the results (Thursday October 28, 2021)",
        "url": "https://www.reddit.com/r/stocks/comments/qhp6kz/i_scraped_rstocks_for_the_top_ticker_mentions_in/",
        "created": 1635462639.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1635285309,
        "id": "qgh9n1",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "AMD - monster year, they said they are increasing chips to account for XBOX and PS5's for the holiday season. I feel they have by far the highest potential growth for rest of year.\n\nVisa - Did not give expected earnings for Q4 bc of Covid which I'm not a huge fan of.. having said that similar to banks the closer we are to getting out of COVID/vaccines, the better stocks like this will perform. For the first \"normal\" Holiday season since the pandemic, I feel confident as well this will do strongly.\n\nGOOGL - they expected ad spending and holiday spending to increase for Q4, they had another fantastic beat and frankly I don't see any issues. Bizarre AH trading though \n\nMSFT - Will benefit from AMD's chip increase for the XBOX, the stock is a winner but I wonder the growth rate it will have for another quarter without any major announcements. Having said that, it could easily perform like a Costco and with another strong earnings just continue to power through.\n\n\nOverall I like all 4, but if I had to pick, I am probably going to invest more capital into AMD out of the 4.",
        "subreddit": "stocks",
        "title": "The earnings winners: AMD, Visa, GOOGL, MSFT... how do you see them closing out the year in Q4?",
        "url": "https://www.reddit.com/r/stocks/comments/qgh9n1/the_earnings_winners_amd_visa_googl_msft_how_do/",
        "created": 1635314109.0
    },
    {
        "author": "makaros622",
        "created_utc": 1634492959,
        "id": "qa3qfr",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I am a 29yo long term investor. My goals is capital for retirement or FIRE. \n\nI have been building a portfolio over the last 1.5 years.\n\nMy portfolio consists of 3 main ETFs (SP500, all world, small caps).\n\nAdditionally, to boost returns, I have invested in the following stocks:\n\nAAPL\nFB\nPINS\nMA\nIDXX\nSQ\nLMND\nFSS\nADSK\nXPEL\nMSFT\nPYPL\nNET\nTDOC\nFVRR\nETSY\nCRWD\nAMD\nTSLA\nSE\nPLTR\nAPPS\nCHPT\nSOFI\nMU\nCRSR\nU\nV\nNVDA\nAMAT\nTTD\nGRWG\nOPEN\nDMTK\n\nSome like DMTK are really speculative.\n\nFrom now on, I am thinking to only invest into my 3 ETFs (every month) and only to the following stocks (only when they dip at least 5%). So my ETFs remain my core.\n\nTTD, SQ, PYPL, FB, FVRR, AAPL, MSFT, ETSY, MU, SOFI, AMD, NVDA, PINS, CRSR, SE,  APPS , U, TSLA, MA, V, TDOC,  CRWD, FSS, NET, PLTR, AXON, ROKU, UPST, DDOG, DOCU, LMND, ADSK, ADBE, AMAT\n\nWhat do you think?",
        "subreddit": "stocks",
        "title": "Advice/discussion about my portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/qa3qfr/advicediscussion_about_my_portfolio/",
        "created": 1634521759.0
    }
]