[
    {
        "author": "Lancerevo012",
        "created_utc": 1617767271,
        "id": "mltjdf",
        "num_comments": 201,
        "num_crossposts": 0,
        "selftext": "•••Not financial advice, do your own DD, invest at your own risk!•••\n\nI’ll keep it short and sweet. Paysafe just went public through a reverse merger SPAC, and has been trading on the NYSE for less than a week. This is like getting in bed with Square at $15/share.\n\nHere are 8 reasons to believe🙌:\n\n1. Bill Foley is behind the merger. The man is a legend in Financial Services and has a strong history of value creation, having led five separate multibillion-dollar public market platforms that completed over 100 acquisitions. Think Fidelity National Financial, Fidelity Information Services, Black Knight Financial, Dun &amp;amp; Bradstreet, Ceridian. You know, small companies. 🤪📈💰\n\n2. Founded in 1996, Paysafe is a leading global payments provider focused on digital commerce and iGaming transactions. The global online gambling market size was valued at USD 53.7 billion in 2019 and is expected to grow at a compound annual growth rate (CAGR) of 11.5% from 2020 to 2027. 📈\n\n3. Paysafe holds the No. 2 market share position in the global digital wallet market. The company’s digital wallet is in over 120 markets and has customers like DraftKings Inc (NASDAQ: DKNG) and William Hill. The company has 3.8 million active users for its digital wallet segment.\n\n4. Paysafe is No. 1 in the iGaming eCash network segment. Customers for this segment include Fortnite, Twitch and Spotify Technologies (NYSE: SPOT).\n\n5. The company estimates that its 2021 payment volume will hit $103 billion. 💰💰💰Billion with a B! Revenue of $1.5 billion is estimated for fiscal 2021. Paysafe said revenue will grow at a compounded annual growth rate of 11% from 2020 to 2023.\n\n6. The digital wallet segment is expected to have $441 million in revenue for 2021 with a 1.9% take on transactions. This represents 29% of the company’s 2021 revenue.\n\n7. The eCash segment has 12 million active users and $5 billion in payment volume. This segment has a take of 6.8% and is expected to have 2021 revenue of $318 million.\n\n8. The integrated processing segment has over $75 billion in payment volume and a 1% take. This segment is expected to have revenue of $764 million in fiscal 2021, representing 50% of the company’s total.\n\nMind you THIS IS NOT A STARTUP! It’s a profitable company with a proven track record, robust sales and a lucrative Total Addressable Market within reach. It’s a long term hold for sure, but with the core drivers outlined above I’m confident we’ll see this as a 10x bagger in less than 5 years. 💎🚀💰🙌📈\n\nPositions: 600 shares @ $16.45  \n\nSources:\n\nhttps://www.grandviewresearch.com/industry-analysis/online-gambling-market\n\n[Investor Deck](https://www.paysafe.com/fileadmin/user_upload/Foley-Trasimene-Acquisition-Corp-II-and-Paysafe-investor-presentation.",
        "subreddit": "wallstreetbets",
        "title": "Paysafe: The biggest FinTech you’ve never heard of! Why one day this could de-throne even SQ and PYPL.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mltjdf/paysafe_the_biggest_fintech_youve_never_heard_of/",
        "created": 1617796071.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1619111523,
        "id": "mw9loa",
        "num_comments": 200,
        "num_crossposts": 0,
        "selftext": "Paysafe reports a substantial $362 million in free cash flow, projects healthy double digit revenue growth, strong and growing EBITDA margins to support its M&amp;A plans but the stock's recent pounding has brought the bears out in force, with some dubious arguments. Sorry for the length here, but I thought I'd address them all in one post:\n\nFirst, here’s Paysafe's Q1 minimum guidance to meet or beat on May 11 ER:\n\n\t$360 million revenue\n\n\t$220 million gross profit\n\n\t$105 million EBITDA\n\n&amp;#x200B;\n\nCommon arguments addressed here:\n\n\\#1 Too much debt, they are going to borrow more.\n\n\\#2 Complex regulatory landscape / no MOAT\n\n\\#3 Blackstone made 3X and will sell\n\n\\#4 Growth by acquisition is risky and difficult\n\n\\#5 No growth\n\n\\#6 Slow growth\n\n\\#7 Not profitable\n\n\\#8 Old business\n\n\\#9 It’s a SPAC\n\n&amp;#x200B;\n\n\\#1) Too much debt.  Paysafe just paid down $1.1 billion in debt. Why would they turn around and borrow again?  Their path to EBITDA margin growth (21% CAGR) is what will pay for M&amp;A expansion. Their 3.6X Debt/EBITDA ratio is better than most fintech peers.  Debt/EBITDA measures a company's ability to service debt.  Most fintech competitors have negative EBITDA putting them at higher risk (Higher ratio is worse.) :\n\nSquare: 77.8X\n\nRepay : 8.7X\n\nFiserv : $21.2B / $4.7B : 4.5 X\n\nGPN : $10.27B / $2.8B : 3.67X\n\nShift4 : $1.8B / -$8M : negative EBITDA\n\nAffirm : $1.67B / -77.6M negative EBITDA\n\nPaysign : $4.3M / -$5.79M : negative EBITDA \n\nBill : $947M / -43.85M : negative EBITDA\n\nDepending on whether you include SQ and AFRM, the combined multiples of these competitors, whether by EV/EBITDA, EV/free cash flow or EV/revenue, puts Paysafe’s share price in the $45 to $90 range.\n\n&amp;#x200B;\n\n\\#2) Complex regulatory landscape / no MOAT.  Bill Foley has repeatedly said that Paysafe's “unrivaled regulatory risk and technical expertise,” is a major pillar of Paysafe’s MOAT. This is the reason they are able to dominate globally in sports betting/iGaming and are expanding to serve the underbanked and unbanked, spaces where competing fintechs are hesitant to enter due to risk and complexity.  As they lean into their regulatory lead, PayPal's former CRO has joined Paysafe and a multi-jurisdictional regulatory expert has recently joined their Board of Directors.\n\nFrom SEC filed transcript (1) - Paysafe CEO, Philip McHugh:  “To be a true global player in the iGaming space, the level of payments regulation, of gaming regulation and certification is very, very complex. When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“To be a winner in this space, you’re catering to some incredibly demanding clients. They want to be global, they want multiple APMs, but they want you to understand payment regulation in hundreds of countries in gaming and gambling regulation in hundreds of countries. That’s something that Paysafe has developed very, very successfully in every market we’ve entered.” \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#3) Blackstone made 3X and will sell.  The common myth is that Blackstone/CVC made 300% by paying $3 billion and receiving $9 billion.  The reality, as reported by the Wall Street Journal (2), is that Blackstone/CVC took Paysafe private in 2017 for $3.9 Billion and they received about $5.6 billion in cash and shares on the deal. Adjusted for inflation, they paid $4.2 billion so it’s basically a 33% return on a 4 year hold. \n\nImportantly, this came AFTER they grew revenue 65% ($864B to $1.426B), stewarded a billion in investments to grow the business, and the deal included paying down over $1.1 billion in debt. This suggests Foley cut a great deal for shareholders. It also explains why private equity has signaled that they'll stay on long term to reap much bigger gains through Foley’s time-tested M&amp;A playbook. \n\nBlackstone itself says (3), “The term of private equity funds can be upwards of 7-10 years.” With so much runway and comps pointing to a 3-4X valuation, why would Blackstone leave so much money on the table?\n\nBlackstone Senior Managing Director Eli Nagler signals an ongoing interest in staying on: “We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.” \n\nIn a recent interview Foley said, private equity’s plan to stay on was part of what encouraged PIPE to invest $2 billion: “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table…All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.”\n\nThis trust was reiterated in the SEC filed FTAC’s Board of Directors’ Reasons for the Approval of the Business Combination: “Commitment of Paysafe’s Owners. The FTAC Board believes that the CVC Investors, the Blackstone Investors and other current indirect stockholders of PGHL continuing to own a substantial percentage of the post-combination company on a pro forma basis reflects such stockholders’ belief in and commitment to the continued growth prospects of Paysafe going forward.”\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#4) Growth by acquisition is hard. Bill  Foley's proven track record in quickly generating synergistic inorganic growth through M&amp;A, speaks for itself. Over the last five years  Foley has grow Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X  ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS  from $2.5 billion to over $91 billion (36.4X). The majority of that growth was inorganic value creation through M&amp;A. Foley says, “Those  characteristics of FIS are right in line with what we plan on doing with  Paysafe.” (1, 4)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#5) No growth. It’s true that Paysafe’s revenue stagnated in 2020 due to Covid, but prior to that growth they reported a strong 27% CAGR (4,5): \n\n2017: $864 million rev\n\n2018 : $1.14 billion rev  (+32%)\n\n2019 : $1.418 billion rev  (+24%).\n\n2020 : $1.426 billion. (+0.5%)\n\nUnlike most fintechs, Paysafe is very diversified with heavy exposure to brick-and-mortar retail and live sporting events, both of which were absolutely crushed by 2020 closures due to Covid.  During this market dislocation, they pivoted, “exited low value referral channels” and made up revenue by expanding in the digital wallets and ecommmerce spaces, positioning themselves better going forward.  \n\nLooking at other hard-hit brick-and-mortar payment processors like Visa and Mastercard, Paysafe performed very well by comparison:\n\n—Visa: negative y-o-y revenue growth (-8.7%) and negative EBITDA growth (-10.2%)\n\n— Mastercard: negative y-o-y revenue growth (-9.4%) and negative EBITDA growth (-14.20%)\n\nThe averaged EV/EBITDA multiples of these two payment processors would put Paysafe’s share price at $25\n\nTheir averaged EV/Revenue multiples would put Paysafe at $46\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#6) Slow growth. Going forward, Paysafe conservatively projects $10%+ annual growth over the next two years but they are careful so say that those growth projections exclude M&amp;A plans and expansion in iGaming expected to grow at 55% CAGR over the next several years.  iGaming accounts for over a third of Paysafe’s revenue so this growth is a significant exclusion. \n\nAnalyst Michael Del Grosso, who  recently initiated coverage with a $19 price target (6) said, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” \n\nSince he wrote that, here are some of the headlines indicating an upgrade to his price target:\n\n\t1.\t\"New York State Legalizes Online Sports Wagering\"\n\n\t2.\t\"Maryland Online Sports Betting Bill Passes Legislature\"\n\n\t3.\tNew Hampshire: \"Sports betting deal approved overwhelmingly; Hogan likely to sign\"\n\n\t4.\t\"Arizona governor signs bill legalizing sports betting\"\n\n\t5.\t\"Wyoming Legalizes Sports Betting\"\n\n\t6.\t\"Wyoming Legalizes Crypto Use for Online Sports Betting\"\n\n\t7.\t”Delaware igaming revenue up 74.3% year-on-year in March\"\n\n\t8.\t\"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n\n\t9.\t“Caesars Entertainment \\[Paysafe partner\\] announced Official Sports Betting Partner of NFL\"\n\n\t10.\t“Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n\n\t11.\t“Ohio legislators doubling down on legalized sports gambling”\n\n\t12.\t“Louisiana Begins The Process of Legalized Sports Betting”\n\n\t13.\t“Path to legalized Texas sports betting becomes more clear”\n\n\t14.\t“NC lawmakers make push to legalize sports gambling to generate funding for schools”\n\n&amp;#x200B;\n\nLooking at a larger basket of comps with a collective growth rate of \\~12.5% (not far from Paysafe’s 10.6% projection) here are valuations based on PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, bill, GPN, and Paysign:\n\n&amp;#x200B;\n\nPaysafe’s share price with average of sector peer multiples:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nAfter eliminating outliers with highest multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\nNotes:\n\n1. Unlike Paysafe, around half of these competitors report negative EBITDA growth and do not have positive free cash flow.\n\n2. Using low end of Paysafe's projections and factors in debt and potential dilution.\n\n3. As noted Paysafe’s 10.6% rev growth projection excludes planned inorganic M&amp;A growth and projected 55% CAGR iGaming growth.\n\n4. The above comps were taken during a market pull back and do not reflect fintech gains since Jamie Dimon’s comments about them posing \"enormous competitive threats\" to banks. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#7) Not profitable. Paysafe expects $900 million in gross profit with a healthy $500-560 million EBITDA (30% margin). These fintech competitors are trading at much higher multiples but have worse EPS than Paysafe: \n\nRepay: -0.67, \n\nAffirm : -2.18, \n\nNuvei : -1.08, \n\nPaysign : -0.19. \n\nBill : -0.62, \n\nShift4 : -0.43 \n\nAverage EV/EBITDA multiples of the above companies would put Paysafe's SP at $69\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#8) Old business. In this space, having many years of multi-jurisdictional regulatory expertise is a plus. This is why Paysafe is the global leader in iGaming payment processing, a rapidly moving space that is expected to grow 10X. “At Paysafe, the iGaming market  volume was estimated to be $3.4 billion in 2019, and is now projected  to reach $47 billion in 2025.” \n\nOn its face, it may not be sexy to the average person but Paysafe is consdered to be at the forefront in its field: Winner “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method” and they are rapidly  expanding in US with new partnerships (just last 3 months: Coinbase,  Microsoft, Luckbox, Amelco, Pointsbet, Virginia Lotto)\n\nTrustpilot (7) in Europe, where Paysafe is more known and used, rates Paysafe as “Excellent”  (4.7/5 stars) with over 25,000 reviews, and Skrill as “great” (4.2/5  stars) with over 17,000 reviews, while PayPal is rated \"bad\" (1.2/5  stars) with over 17,000 reviews.\n\nPaysafe has the No. 2 global digital wallet with presence in 120 countries. They’ve just integrated their digital wallet platforms, recently voted  “Best Digital Wallet” for “best consumer take up”,  “most innovative technology” with “greatest potential to disrupt current  ecosystems” and they’ve enabled crypto-to-crypto trading (Bitcoin &amp; 26 other crypto-currencies).\n\nAside from Coinbase, Luckbox and Microsoft, they are partnered with Roblox, Draftkings, Spotify, Fortnight, Amazon, Twitch, bet365, ApplePay, Youtube, Visa, Betfair, PayLease, ESL Gaming, BetMGM, among many others. They are currently moving quickly to integrate their services to offer easier migration of eCash,  integration of payment methods, cross-border payments and expansion into global banking as a service to the 1.7 billion ”unbanked.”  This doesn't sound like an old company resting on its laurels.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#9) It’s a SPAC. Maybe the best argument.  \n\nPaysafe has been tarred and feathered as a SPAC: guilty until proven innocent.  Even after ticker change, Cramer called it a SPAC in the same breath that he said, “There is something about Paysafe that may be the ultimate stock for this moment.”(8) \n\nIt’s a hard moniker to drop. Literally every bear article written on Paysafe has relied on saying it was suspect because it was a SPAC, saying things like because Chamath sold Virgin Galactic, Paysafe can't be trusted. By contrast the bull articles that bothered to explore the fundamentals generally came up with $24-25 price targets. \n\n&amp;#x200B;\n\nDisclosure: I hold $600K in commons and warrants\n\nDisclaimer: I am not a financial advisor. All users should complete their own due diligence.\n\n&amp;#x200B;\n\nSources: \n\n(1) Transcript: [https://www.sec.gov/Archives/edgar/data/0001818355/000119312520311318/d91054d425.htm](https://www.sec.gov/Archives/edgar/data/0001818355/000119312520311318/d91054d425.htm)\n\n(2) WSJ: [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(3) Blackstone: [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(4) Investor Presentation: [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(5) Analyst Presentation:  [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(6) Analyst $19 [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(7) Trustpilot [https://uk.trustpilot.com/review/www.paysafecard.com](https://uk.trustpilot.com/review/www.paysafecard.com)\n\n(8) CNBC, Cramer  [https://www.youtube.com/watch?v=xBi9JyR5HyA](https://www.youtube.com/watch?v=xBi9JyR5HyA)\n\n(9) Q1 earnings call: [https://ir.paysafe.com/news-events/events/detail/9758/first-quarter-2021-earnings-call](https://ir.paysafe.com/news-events/events/detail/9758/first-quarter-2021-earnings-call)",
        "subreddit": "SPACs",
        "title": "Reviewing the Bear Case on Paysafe (PSFE):",
        "url": "https://www.reddit.com/r/SPACs/comments/mw9loa/reviewing_the_bear_case_on_paysafe_psfe/",
        "created": 1619140323.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1618417918,
        "id": "mquayi",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Paysafe  offers a unique combination of fintech, crypto, iGaming, sports betting  and banking all rolled into one stock.  This is why NBC’s Cramer  recently said, “There is something about Paysafe that may be the  ultimate stock for this moment.” Veteran market analyst Steve Grasso  calls for $45-50 saying, “It’s the most excited I’ve been about a stock  in a long time.” So why is that?\n\nUpdated DD:\n\nPartnered  with Coinbase, Roblox, Draftkings, Spotify, Fortnight, Amazon, Twitch,  Xbox, bet365, ApplePay, Youtube, Visa, Betfair, PayLease, ESL Gaming,  etc.\n\nGlobal electronic payment  platform with integrated cloud technology offering migration of eCash,  integration of payment methods, cross-border payments and expansion into  global banking as a service (with proprietary risk management enabling  mobile e-commerce for the 1.7 billion ”unbanked.”)\n\n$58  trillion TAM.  Fund manager Cathie Wood: “Fintechs are going to gut  banks.” Jackie Reses, board member of the SF Federal Reserve predicts a  “$16 trillion market cap wholesale transition” of fintechs “taking over  and revolutionizing banking”\n\nNo. 1  global leader in iGaming eCash network. “At Paysafe, the iGaming market  volume was estimated to be $3.4 billion in 2019, and is now projected  to reach $47 billion in 2025.”\n\nNo.  2 global digital wallet with presence in 120 countries. Owns Neteller  and Skrill, winner “Best Digital Wallet” for “best consumer take up”,  “most innovative technology” with “greatest potential to disrupt current  ecosystems.”\n\nNo. 4 globally in integrated merchant processing\n\nEnabled for crypto-to-crypto trading (Bitcoin &amp; 26 other crypto-currencies)\n\nWinner “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method”\n\nRapidly  expanding in US with new partnerships (last 3 months: Coinbase,  Microsoft, Luckbox, Amelco, Pointsbet, Virginia Lotto) &amp; new  legalized sports betting (this month: NY, WY, NH)\n\nTrustpilot  in Europe (where more commonly used) rates Paysafe as “Excellent”  (4.7/5 stars) with over 24,000 reviews, and Skrill as “great” (4.2/5  stars) with over 17,000 reviews, while PayPal is rated \"poor\" (1.2/5  stars) with over 17,000 reviews.\n\nBill  Foley, Paysafe's Chairman of the Board, has a proven track record in  generating rapid synergistic inorganic growth. Over the last five years  Foley has grow Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X  ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS  from $2.5 billion to over $91 billion (36.4X). He says, “Those  characteristics of FIS are right in line with what we plan on doing with  Paysafe.”\n\nFoley on Paysafe: “It’s  a fortress. It’s got a moat…We have a proven strategy of winning as new  global markets open. And most importantly, we have unrivaled regulatory  risk and technical expertise…It’s going to be a land grab…I have a  vision that we should be THE digital wallet… It’s our job to be there  first and to make sure we dominate. We’re focusing on gaming,  particularly sportsbetting, in the United States as it becomes legal and  we’ve got a wide landscape we can attack. It’s pretty exciting.”\n\nAnalyst  coverage: “We believe PSFE represents a relatively scarce asset within  the payments industry given its unique business strategy, geographical  footprint, and focus on the iGaming industry. Our forecasts imply  revenue growth at the high-end of management's guidance and we believe  there is upside to our forecasts in the event of state-level  legalization of iGaming. PSFE operates in high-growth verticals, has a  unique advantage in its consumer and merchant facing solutions, and  offers exposure to a secular growth opportunity in the potential  legalization of iGaming in the United States.\"\n\nProjected $1.5 billion revenue, $362 million free cash flow, 30-35% margins, $105 billion transactional volume\n\nPaysafe’s share price with average of sector peer multiples:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nAfter eliminating outliers with highest multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n&amp;#x200B;\n\nValuation notes:\n\n1. Based on low end of Paysafe's projections\n2. From  published data on PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm,  bill, GPN, Paysign with a collective revenue growth rate of \\~12.5%.  Paysafe’s 10.6% rev growth projection (conservatively pegged to  fintech/online commerce) excludes planned inorganic growth and projected  10X iGaming growth (55% CAGR)\n3. Around half of these competitors report negative free cash flow and negative EBITDA growth, unlike Paysafe\n\nRecent signals of Blackstone/CVC’s long-term hold:\n\nLast  week, Blackstone Senior Managing Director Eli Nagler said “We believe  Paysafe has a long runway for further growth and look forward to  remaining part of the team and seeing their continued success as a  public company.”\n\nFTAC’s Board of  Directors’ Reasons for the Approval of the Business Combination:  “Commitment of Paysafe’s Owners. The FTAC Board believes that the CVC  Investors, the Blackstone Investors and other current indirect  stockholders of PGHL continuing to own a substantial percentage of the  post-combination company on a pro forma basis reflects such  stockholders’ belief in and commitment to the continued growth prospects  of Paysafe going forward.”",
        "subreddit": "investing",
        "title": "Updated Paysafe DD: Medium to long term hold.",
        "url": "https://www.reddit.com/r/investing/comments/mquayi/updated_paysafe_dd_medium_to_long_term_hold/",
        "created": 1618446718.0
    },
    {
        "author": "bigdigdoug",
        "created_utc": 1617840022,
        "id": "mmfdw0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " I posted this on Monday in a couple other subs but unfortunately I didnt get in - was asked to post it here but it will probably get removed and/or downvoted. \n\nI'm currently watching from the sidelines as it has pulled back pretty good today. I'm keeping an eye for it to either drop back below the 200MA and possibly fizzle out or get back above the 50MA and hold. Its OTC which has been getting hammered as of late so definitely proceed with caution. \n\n \n\n[$RKFL](https://finance.yahoo.com/quote/RKFL?p=RKFL&amp;.tsrc=fin-srch)\n\nSource: [Here](https://www.goldmanresearch.com/202104011316/Opportunity-Research/blockchain-crypto-payments-pioneer-to-transform-ecommerce.html)\n\n**COMPANY SNAPSHOT**\n\nRocketFuel Blockchain, Inc. is global payments processing company offering highly efficient 1-click check-out solutions to eCommerce merchants and their customers. RocketFuel’s solution focuses on enhanced customer privacy protection eliminating the risk of data breach while improving speed, security and ease of use. RocketFuel users are able to enjoy seamless check-out using their favorite cryptocurrencies or direct bank transfers and forget the clunky cart and card paradigm of the past. RocketFuel merchants are able to implement new impulse buying schemes and generate new sales channels unavailable in current eCommerce solutions.\n\n**INVESTMENT HIGHLIGHTS**\n\n**RKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies.** Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience.\n\n**The market is huge and growing at an enviable rate.** According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\n**Current eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience.** Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\n**Management has a proven track record of developing new technologies, bringing them to market, and generating value for the investors.** The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate.\n\n**Our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS.** Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\n**Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 sales estimate of $40M and roughly 28x our $0.22 EPS forecast.** This target could prove to be conservative if adoption accelerates.\n\n* Price as of 3/31/21$1.32\n* 52 Wk High - Low$3.25 - $0.50\n* Est. Shares Outstanding24.2M\n* Market Capitalization$31.9M\n* Average Volume17,008\n* Exchange:OTCQB\n\n**COMPANY INFORMATION**\n\n**RocketFuel** **Blockchain, Inc.**  \n**201 Spear Street, Suite 1100**  \n**San Francisco CA 94105**\n\nWeb:     [www.RocketFuelBlockchain.com](http://www.rocketfuelblockchain.com/)\n\nEmail:   [info@rocketfuelblockchain.com](mailto:info@rocketfuelblockchain.com%0d)  \nPhone : 424.256.8560\n\n***The View from 30,000 Feet***\n\nBlockchain payments innovator **RocketFuel** **Blockchain, Inc. (OTCQB – RKFL)** is poised to transform the global eCommerce industry, in our view. The Company is an early mover as a global provider of one-click online payment options using Bitcoin and dozens of other cryptocurrencies. Moreover, RocketFuel is the first cryptocurrency payment service to provide a seamless and elegant one-click checkout experience that today's digital and mobile-centric consumers have come to expect from eCommerce marketplaces, such as **Amazon (NASDAQ – AMZN)**. \n\nThe RocketFuel platform, based on patent-pending technology, enables merchants and consumers to easily complete payment for goods and services using 43 different cryptocurrencies or direct bank transfer in a completely secure environment. A significant benefit of the Company’s approach is that the entire shopping cart checkout process can be executed via a distributed ledger or blockchain. Thus, merchant websites will no longer required to operate complex, and costly payment and check-out infrastructures. With the one-click checkout used on RocketFuel-partnered sites, consumers will enjoy unrivalled convenience .\n\nAs is typically the case with new technologies and applications with a broad scope, we expect early adopters to dominate usage during 2021 as online merchants shopping cart and payment solutions providers implement the crypto acceptance functionality, with mass market utilization occurring in 2022. With estimates suggesting that the number of (non-Facebook) crypto wallet holders will grow to 250M+ in the next 2-3 years, up from 68M today, substantial adoption lies ahead.   \n\n***The Problem***\n\neCommerce has enjoyed wide, mainstream adoption and in many cases has emerged as the shopping method of choice for consumers during the COVID-19 pandemic. Unfortunately, for merchants and consumers alike, many of the payment system setups and associated technologies in place today have underlying issues, which in turn have a deleterious effect on merchant/consumer transaction execution.\n\nFor consumers, payment systems and shopping cart utilization can be awkward and clunky, require multiple steps and redirects to 3rd parties, and may not be secure, resulting in a less than stellar customer experience. For merchants, the current eCommerce payment infrastructure is even more problematic. In most cases, merchants are required to use an intermediary, costing billions in excess expenses annually. Roughly 1 in 5 carts leave without completing a transaction because consumers do not trust the merchant’s system. Plus, in most cases, fees are high, payments are delayed, and exorbitant fees due to fraud, fraud prevention, and chargebacks related to the inefficient back-end operations can be excessive, reducing profits.\n\n***The Solution*** \n\nIn contrast, by leveraging modern blockchain technology and its proprietary platform, RocketFuel offers consumers a single-click pay solution, pay with crypto or direct bank transfer option with no redirects or filling out forms as the information is stored at once. The process is seamless-simple, efficient, secure, and convenient. Merchants generate higher shopping cart conversion, pay lower fees, have greater security, transparency, less fraud, and improved cash flow. With a better experience for both sides of the transaction, and improved order and shipping fulfillment, merchants can foster loyalty and generate recurring business. \n\n***Today and Tomorrow***\n\nThe Company launched its first product in a live environment in March 2021 and with two travel merchant customers and a tax auditing firm in hand, management intends to continue to develop the check-out technology with several larger U.S. eCommerce merchants, social media and blogsites. With connections to several larger eCommerce merchants, near term sales and marketing efforts will focus on a few “big fish” rather than many smaller merchants and will scale up initiatives as funding permits. We believe that the Company will also target specific verticals that may be a source of early adopters and crypto wallet holders in verticals such as online gambling, gaming, and with merchants selling high ticket items. In conjunction with this targeted approach, RocketFuel may utilize social media to generate awareness and attract consumer influencers. Given that the phase from early adoption to mass market adoption can take 12-18 months, we believe that the Company could enjoy exponential merchant sign-ups going forward, along with consumer utilization, from 2021-2022, with the greatest recurring platform utilization by consumers beginning in 2023. \n\n***Financial Forecasts and Valuation***\n\nIt is difficult to accurately project the deployment and adoption success of a new technology and application such as the unique RocketFuel blockchain and crypto payment service.  However, given the underlying growth rates in blockchain ledger utilization for financial and payment transactions, as well as the proliferation of crypto wallet adoption, it is clear that major upside exists. Widespread adoption and growth are further affirmed by the Company’s underlying offering which solves major unmet needs in eCommerce for merchants and consumers alike. As with many young companies, it comes down to efficient execution. The management has a strong, proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies.\n\nWe should note that our forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to firmly estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) and revenue of $12M in FY23E with net profit of $650K, or $0.02. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.\n\n**INDUSTRY PRIMER: BLOCKCHAIN**\n\n📷\n\nAccording to a recent report by Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nA blockchain, also known as a “distributed ledger technology,” is a sequential, ever-growing, time-stamped set of records used to secure transactions across multiple devices that are grouped in blocks and maintained by disparate participants. Each block is interdependent, making alterations of records economically difficult if not outright impossible.\n\nTransactions in money, equities, bonds, titles, deeds, contracts, and virtually all other kinds of assets can be implemented and stored securely, privately, and from peer to peer, because trust is established by network consensus, cryptography, collaboration, and sophisticated code---without intermediaries. Given the opportunities associated with such a disruptive technology, many firms in varied industries are actively operating in the space to transact business, agreements and financial transactions more efficiently.\n\nCommercial and central banks across the world are now using blockchain technology for payment processing and issuing of their digital currencies. The technology enables cross-border payments that are less expensive and faster as compared to traditional systems. The remittance cost within the blockchain is 2% to 3% of the total amount as compared to other third parties as blockchain does not require third-party authentication. Even governments are introducing CBDCs (Central Bank Digital Currency) to replace cash and traditional fiat-currencies. Plus, they are putting social media behemoths such as Facebook and Google under scrutiny for their lack of privacy protection and data security.\n\nOne of the most popular applications of blockchain is cryptocurrency. Trading in cryptocurrency is relatively easy compared to other assets. You can begin trading just by signing up for various wallets on the market. Furthermore, there are different types of wallet apps, each with its own advantages, such as levels of security, accessibility, and more. The most popular and well-known wallet is Coinbase with 639,885 daily active users (DAUs). If Facebook’s Libra initiative to its 2B users is successful, this figure will be dwarfed in short order.\n\nThe payments segment dominated the market in 2020 and accounted for more than 44.0% share of the global revenue. Blockchain technology improves payment system efficiency, minimizes operating costs, and offers transparency. These benefits provided by blockchain technology are increasing its use in payment solutions, thus, driving the segment growth. At the same time, blockchain reduces the need for middlemen in payment processing, which is also a major factor driving the segment growth.\n\nBitcoin (the largest cryptocurrency) is the most popular application of blockchain, but increasingly this innovative technology can be used in various business and commercial purposes. The elimination of the middleman in various transactions and processes promises a much more efficient workflow using blockchain. Additionally, increasing concerns about privacy and security make blockchain an ideal technological pipeline for modern processes.\n\nEnter the eCommerce application.\n\n**ROCKETFUEL: THE GAME-CHANGER**\n\nWhen validating a new market or technology, it is instructive to review history as it tends to repeat itself. Most major technology breakthroughs and disruptions had a few things in common:\n\n* A large, inefficient market, usually based on old technologies and processes, generating problems and unnecessary cost for all stakeholders.\n* A new technology allowing new companies to invent new solutions that address these problems.\n\nSome examples include improved internet technology which enabled Amazon to evolve our commerce habits from brick and mortar to digital and mobile technology innovations and evolutions that have led to Uber and Lyft transforming transportation.  The payments industry is no different. Its architecture and operations are still based on a 40-year-old physical card with a chip and limited fraud prevention capabilities. In contrast, digital technologies such as blockchain and cryptocurrencies are prompting the replacement of the old architecture with a new efficient, lower cost approach. y changes the way payments are made.\n\nThere is a huge inefficient market (the payment market) causing problems for all stakeholders. There is a technology that has the potential to fix it. Enter RocketFuel Blockchain.\n\nRocketFuel is a new frictionless blockchain based payment solution for eCommerce merchants to accept payments in crypto or cash via bank transfer and receive payment and shipping information in one one-click transaction without the need for payment intermediaries. In anticipation of a major proliferation in crypto utilization for payments and business, large eCommerce and retail merchants now accept crypto as a payment method. In fact, over one-third of all small and medium-sized U.S. companies already accept Bitcoin as a B2B payment source.\n\nThe eCommerce space is estimated to be $3.5T, yet it represents less than 15% of total commerce. PayPal, a significant player in the online payments arena with over 350M users, allowed users to buy and sell crypto and just announced its “Checkout for Crypto” feature. This function, allows users to instantly convert their Bitcoin, Ethereum, Litecoin, or Bitcoin Cash to US dollars (with no additional transaction fees) that PayPal then uses to complete the transaction. In our view, this is a validation of the RocketFuel approach and will likely capture its share of this function. Still, since it lacks the 1-click convenience and appears to still be clunky and expensive relative to our forecast of the RocketFuel pricing, RocketFuel remains in the driver’s seat.\n\nAs mentioned above, existing solutions are costly, impact conversion, not secure, leads to fraud, and will eventually go the way of the milkman. Merchants and consumers alike crave security, convenience, transparency, low cost and trust.  \n\n***The*** ***RocketFuel*** ***Approach***\n\nThe Company provides check-out and payment systems directly on the check-out page that securely automate and simplify the way online payment and shipping information is received by merchants from their customers. The check-out systems are designed to enhance customers’ data protection, enabling consumers to pay for goods and services using cryptocurrencies or by direct transfers from their bank accounts without exposing spending credentials such as credit card data. At the same time, the check-out systems are designed to increase the speed, security and ease of use for both customers and merchants and include a merchant portal that provides detailed transactions and metrics about payments received by the merchant.\n\nThey also include a customer portal where shoppers are able to track their payments, configure payment defaults and connect with various cryptocurrency exchanges and banks to facilitate payment to merchants. Merchants are able to integrate a unique pop-up user interface that allows customers to pay directly from their ecommerce checkout page with no need to redirect to another website or web page.\n\nData is key and the merchant portal is updated instantly when a payment transaction is made on the merchant website. The merchant is notified of the transaction and can see the transaction details, including the customer that made the transaction, the transaction amount and the transaction items. This information is added to the merchant dashboard where various metrics are tracked and displayed to the merchant, including information about the various cryptocurrencies that are used for payments to that merchant and the funds received by the merchant from the different currencies.\n\nCustomers of merchants that use the RocketFuel payment solution are able to track their payments in their online portal. They are also able to track payments they made to all the merchants that are integrated with the RocketFuel payment technology within one consolidated user portal. They are able to connect to multiple exchanges including Coinbase, Binance, Kraken, Gemini and others to pay directly from them. They can also pay from any cryptocurrency wallet. Customers are able to connect with multiple bank accounts to pay from as well.\n\n📷The “single-click” RocketFuel check-out solution is based on a streamlined check-out process for eCommerce purchases. The payment user interface is displayed as a stand-alone popup that allows the creation of new accounts as well as payment directly from crypto exchanges, crypto wallets, and bank accounts, with no redirects to browser tabs or pages. This can be integrated as a plugin on the merchant checkout page or as a browser extension. The plugin comes integrated with popular ecommerce platforms including WooCommerce, Shopify, Prestashop and others. The payment interface is designed for both web and mobile checkout experiences. Merchants are able to integrate the RocketFuel payment interface to their checkout page with software development kits (SDKs) that are available via the merchant portal. Application programming interfaces (APIs) are also available to the merchant for deeper integration into backend systems, ERP platforms, and other third-party platforms.\n\nCryptocurrencies are stored in different types of cryptocurrency wallets. These wallets can include mobile wallets, web wallets, desktop wallets, hardware wallets, and exchange wallets. Currently, it can be a difficult, confusing and multi-step process to use these wallets to make cryptocurrency payments. With RocketFuel’s blockchain solution, cryptocurrency holders can use any of the above digital wallets to make payment for products or services to any RocketFuel merchant with 1, 2, or 3 steps.\n\nUsing the “single-click” RocketFuel check-out technology and check-out button, consumers will no longer be re-directed to a third-party  With the RocketFuel solution, eCommerce merchants will need no contact or other information exchange with the consumer in order to receive their payment or shipping details. Instead, they will have immediate visibility of payments from customers via the RocketFuel payment system, which may be integrated into merchants’ fulfillment centers.\n\nLooking ahead, the technology will also be used for different scenarios, including paying for services, paying invoices, and other payment strategies. In addition, under a future version of the payment system, advertisements in which the entire check-out process is embedded will be able to be placed on third party websites and sales may be completely finalized there. Thus, the platform will enable eCommerce strategies that can include advertisements with a fully integrated check-out process. This prospective feature is unlike any other currently in use today and could eventually be a significant driver of revenue, once completed. Such advertisements will provide significant new sales channels to retailers that are simply not possible with legacy check-out solutions.\n\nIn addition to potential competition from PayPal, the primary competitor remains Bitpay, which is already well established as the leading crypto payment technology in the market, having been founded in 2011. Given that RocketFuel offers a better user experience for crypto payments, allows payment from dozens of other cryptocurrencies, and other wallets, and exchanges, RocketFuel’s diversity is a major strength.  RocketFuel also offers services that Bitpay currently does not, such as providing merchants immediate visibility of payment transactions, real time metrics of transactions and customers, easy integration to ecommerce checkout as well as deep integration to backend platforms. Furthermore, with an average of 72,000 transactions per month, it will not take significant merchant penetration for RocketFuel to surpass Bitpay, in our view.\n\n***Target Markets*** \n\nThe Company’s initial target market is the travel industry and RockeFuel already has signed up two sizable customers: Sky Tours and Military Fares. It should be noted that worldwide sales of flight tickets sold online in 2019 was $540B and the 2 largest reservations systems generate more than $10B in yearly revenue, making this vertical a hot commodity. Management plans to target travel merchant and web platforms. Given the complexity of the intermediaries and reservation systems, high costs and notoriously delayed payments, the RocketFuel solution can simplify the payment process and customers no longer have to provide sensitive information. We believe other verticals such as online gambling, the procurement of gift cards, and high-ticket items could prove to be lucrative for the Company. As a result, we expect sales and marketing headcount to rise over the next 12-18 months, in conjunction with rapid deployment and implementation of existing and future solutions.\n\n**ROCKETFUEL BLOCKCHAIN LEADERSHIP TEAM**\n\n**Gert Funk, Chairman, Founder, Chief Product Officer**\n\nGert Funk has over 15 years as a payment service provider for international eCommerce merchants. A serial entrepreneur since 1990, he is the founder of RocketFuel Blockchain, Inc. Gert has been an expert in blockchain technology and applications for eCommerce since 2015.\n\n**Peter Jensen, Chief Executive Officer**\n\nPeter Jensen is an experienced executive with extensive global experience within enterprise software. After holding sales and marketing positions within Oracle, Symantec, and VMware in Europe and the US, Peter has been focusing on building and growing start-ups in Silicon Valley as CEO and VP of Sales. Examples include Thinstall (acquired  by VMware), StopTheHacker (acquired by Cloudflare), ParStream (acquired by CISCO), SPanugo (acquired by IBM), and others. He is currently the CEO of RocketFuel Blockchain, a fintech software company providing a payment solution that allows eCommerce merchants to receive Crypto payments.\n\n**Bennett** **Yankowitz, Chief Financial Officer**\n\nBennett Yankowitz is an expert in ICO law with more than 30 years of experience as a corporate attorney with leading law firms. Ben specializes in securities, financial and merger and acquisition transactions. He holds law degrees from the University of Southern California and the University of Cambridge.\n\n**Rohan Hall, Chief Technology Officer**\n\nRohan Hall has over 30 years of experience in the technology sector, Rohan is a noted and published author and Fintech company founder. A serial entrepreneur and Blockchain expert, Rohan has had successful blockchain exits.\n\n**FINANCIAL FORECASTS**\n\n*(Analyst’s Note: These forecasts are our own and we did not receive guidance or projections from RKFL management.)*\n\nOur forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be in the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for FY22E or Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) as management begins meaningful sales and marketing expenses to build awareness and execute merchant signups in key verticals such as the travel industry and online gambling. \n\nIn FY23E, we forecast significant revenue growth with top line reaching the $12M mark. Total operating expenses are estimated to reach $8.25M with expanded sales and marketing expenses, along with R&amp;D, reflecting upgrades to the core functionality. Based on this model, net profit is slated to reach $650K, or $0.02, with a slight rise in shares outstanding to reflect a modest fundraise in conjunction with a prospective up-list to NASDAQ. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nIt should be noted that while there are not material direct COGS, we have allocated some indirect expenses to arrive at a gross margin of around 72-73% for all years. We believe that this is conservative and may have to be adjusted higher, thereby raising profitability and our price target.\n\n**RISK FACTORS**\n\nIn our view, the Company’s biggest risks are straightforward: the timing and magnitude of broad adoption of its core technology and applications by both merchants and consumers. Secondary risks include changes in the regulatory environment affecting utilization along with marketing effectiveness. Competitive risks include lower pricing, more effective sales/marketing, greater functionality and features. The aforementioned risks could come from larger competitors, existing firms, or new entrants. Still, these future concerns are consistent with firms of RocketFuel’s size and early mover standing. Moreover, we believe that the Company’s seasoned management team is prepared to overcome these hurdles and generate significant top-line growth, deployment and  implementations.\n\nVolatility and liquidity are typical concerns for microcap stocks that trade on the over the counter (OTC) stock market. In addition to a recent funding access announcement regarding Triton Funds, management may seek to raise additional capital next year in conjunction with an up-list to NASDAQ, to fund corporate expansion and potential M&amp;A. An overriding financial benefit as a public company is the favorable access to and the availability of capital to fund product launches, consistent marketing campaigns and other initiatives. Since the proceeds of any future funding would be used in large part to advance major business development and sales, we believe that any dilutive effect from such a funding could be offset by related increases in market value.\n\n**VALUATION AND CONCLUSION**\n\nRKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies. Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience. The market is huge and growing at an enviable rate. According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nCurrent eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience. Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\nManagement has a proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate. At present, our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS. Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.",
        "subreddit": "pennystocks",
        "title": "Blockchain, Crypto Payments Pioneer to Transform eCommerce",
        "url": "https://www.reddit.com/r/pennystocks/comments/mmfdw0/blockchain_crypto_payments_pioneer_to_transform/",
        "created": 1617868822.0
    },
    {
        "author": "Superfly_Sean",
        "created_utc": 1619032722,
        "id": "mvn5r1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "To anyone who can buy OTC, you better load up on HMBL now! Just launched their mobile and global app. They’re going after the entire global payments and transactions market. Also huge short interest if you’re into that.\n\n1755 shares @ .083\n\nLet’s go!!!!!!! 🚀🚀🚀🚀🚀🚀👐🏻💎",
        "subreddit": "Wallstreetbetsnew",
        "title": "HMBL is prepping for take off! 🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mvn5r1/hmbl_is_prepping_for_take_off/",
        "created": 1619061522.0
    },
    {
        "author": "Lancerevo012",
        "created_utc": 1617679915,
        "id": "ml2iyl",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "•••Not financial advice, do your own DD, invest at your own risk!•••\n\nI’ll keep it short and sweet. Paysafe just went public through a reverse merger SPAC, and has been trading on the NYSE for less than a week. This is like getting in bed with Square at $15/share.\n\nHere are 8 reasons to believe🙌:\n\n1. Bill Foley is behind the merger. The man is a legend in Financial Services and has a strong history of value creation, having led five separate multibillion-dollar public market platforms that completed over 100 acquisitions. Think Fidelity National Financial, Fidelity Information Services, Black Knight Financial, Dun &amp; Bradstreet, Ceridian. You know, small companies. 🤪📈💰\n\n2. Founded in 1996, Paysafe is a leading global payments provider focused on digital commerce and iGaming transactions. The global online gambling market size was valued at USD 53.7 billion in 2019 and is expected to grow at a compound annual growth rate (CAGR) of 11.5% from 2020 to 2027. 📈\n\n3. Paysafe holds the No. 2 market share position in the global digital wallet market. The company’s digital wallet is in over 120 markets and has customers like DraftKings Inc (NASDAQ: DKNG) and William Hill. The company has 3.8 million active users for its digital wallet segment.\n\n4. Paysafe is No. 1 in the iGaming eCash network segment. Customers for this segment include Fortnite, Twitch and Spotify Technologies (NYSE: SPOT).\n\n5. The company estimates that its 2021 payment volume will hit $103 billion. 💰💰💰Billion with a B! Revenue of $1.5 billion is estimated for fiscal 2021. Paysafe said revenue will grow at a compounded annual growth rate of 11% from 2020 to 2023.\n\n6. The digital wallet segment is expected to have $441 million in revenue for 2021 with a 1.9% take on transactions. This represents 29% of the company’s 2021 revenue.\n\n7. The eCash segment has 12 million active users and $5 billion in payment volume. This segment has a take of 6.8% and is expected to have 2021 revenue of $318 million.\n\n8. The integrated processing segment has over $75 billion in payment volume and a 1% take. This segment is expected to have revenue of $764 million in fiscal 2021, representing 50% of the company’s total.\n\nMind you THIS IS NOT A STARTUP! It’s a profitable company with a proven track record, robust sales and a lucrative Total Addressable Market within reach. It’s a long term hold for sure, but with the core drivers outlined above I’m confident we’ll see this as a 10x bagger in less than 5 years. 💎🚀💰🙌📈\n\nPositions: 600 shares @ $16.45  \n\nSources:\n\nhttps://www.grandviewresearch.com/industry-analysis/online-gambling-market\n\n[Investor Deck](https://www.paysafe.com/fileadmin/user_upload/Foley-Trasimene-Acquisition-Corp-II-and-Paysafe-investor-presentation.pdf)\n\nhttps://m.benzinga.com/article/18678982",
        "subreddit": "wallstreetbets",
        "title": "Paysafe: The biggest FinTech you’ve never heard of! Why one day this could de-throne even SQ and PYPL.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ml2iyl/paysafe_the_biggest_fintech_youve_never_heard_of/",
        "created": 1617708715.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1618853291,
        "id": "mu5ql0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Mastercard Inc said on Monday it had agreed to buy digital identity verification company Ekata in a deal valued at $850 million, as the global payments processor bets on a boom in demand for companies in the digital security space.\n\nEkata's products allow businesses to separate fraudsters from legitimate customers during digital interactions like opening an online account or making digital payments. It operates in three industries: e-commerce, payments and financial services, according to its website.\n\n\"The acceleration of online transactions has thrust global digital identity verification to the forefront as one of the biggest opportunities to build digital trust and combat global fraud,\" said Rob Eleveld, chief executive officer of Ekata, in a statement.\n\nSeattle-headquartered Ekata counts more than 2,000 companies as its partners, including credit reporting company Equifax Inc and software firm Intuit Inc, its website showed.\n\nIts products, which include Ekata Identity Graph and Ekata Identity Network, allow companies to combat online fraud, it said.\n\nIn February, Ekata said its revenue had surged in 2020, as the COVID-19 pandemic accelerated the adoption of e-commerce, boosting demand for services to safeguard against cyber fraud.\n\nEkata added 300 new customers last year, including food and grocery-delivery startup Postmates, which was acquired by Uber Technologies last year. (https://bwnews.pr/32qaUG7)\n\nThe payments processor said the deal is expected to close in the next six months, adding that it does not expect the deal to be a drag on its business for more than two years.\n\n[Source](https://finance.yahoo.com/news/mastercard-buy-digital-id-verification-134157685.html)",
        "subreddit": "stocks",
        "title": "Mastercard to buy digital ID verification firm Ekata in $850 million deal",
        "url": "https://www.reddit.com/r/stocks/comments/mu5ql0/mastercard_to_buy_digital_id_verification_firm/",
        "created": 1618882091.0
    }
]