[
    {
        "author": "TayahuaJ",
        "created_utc": 1614874457,
        "id": "lxo7om",
        "num_comments": 943,
        "num_crossposts": 3,
        "selftext": "Over the last couple of weeks, there have been dozens of posts deliberating whether or not to sell growth/tech stocks that have been dropping recently and switch over to \"re-opening\" or value plays. The key take away here has to be this:\n\nIf a 10% drop in a stock makes you wonder whether or not you should sell that stock, you should have never bought that stock in the first place.\n\nContrary to popular belief, stocks do not always go up. In fact, most stocks fail to beat the market in the long-term, with few exceptions. Buffet makes this clear. A good stock is not considered good just because it may do well in the next year, or because it has shown growth in the past. It is only a good buy if it has value beyond a short-term horizon, and most importantly, IF YOU BUY AT THE RIGHT PRICE. If you had bought GE at its peak, a company that is invested in all aspects of life and won't ever disappear, you would be down nearly 75%. Why is this? Is GE a bad company, with bad products, or a shrinking customer base? No, you would have just bought in at a price that was unjustifiable. \n\nThink of this scenario, you are the owner of a snack shop. Summer is coming up, so you decide to invest in significant inventory of ice cream. After all, people will purchase frozen desserts in the hot summer days, right? This can't possibly bad investment. So you go to your supplier, and he offers you a price of $100 per pint of ice-cream. What would you do? Would you buy just because ice-cream is guaranteed to sell in the future? No, not unless customers were willing to pay more than $100 per pint.\n\nConversely, your next-door competitor decides to invest in inventory of hot chocolate. This is ridiculous to you, who would buy hot chocolate in the summer? However, your neighbor buys in at $0.10 per cup of hot chocolate for his supply. Once summer is over, you sell out of your inventory, but at a loss because no one is willing to buy ice cream at more than $10 a pint. Then winter comes, and guess who profits more?\n\nThe point here is that being right about a trend is not enough if the price you buy in at is not the right one. If your belief in a stock is rattled because it drops a little bit, you did not believe in the price in the first place. If this scares you enough, you are better off sticking to index funds and filtering out the noise. There is nothing wrong with that, picking stocks is hard, and there is no guarantee that you will come out on top. \n\nMy two cents is this: lumping tech into one single asset class is absurd, and calling companies like Amazon and Microsoft \"growth\" stocks is disingenuous if you lump in Palantir and Tesla in that same category. The market right now is doing just that, however, in the sense that high-PE growth stocks like Tesla are dropping alongside with Apple. In my opinion, all this is doing in the long-run is that you are buying tried-and-true blue chips at a discount. \n\nKohl's is not going to be larger in 10 years than it is now, and its price now does not make it a good buy.  Conversely, just because Tesla will be huge in the future does not mean that buying it at a PE of 1000+ is a wise investment. Re-opening plays are just market chatter. Cruise lines have tremendous debt, banks are tied to risky-credit loans and government regulation, and oil companies are at the mercy of an overseas oil cartel. Just because they are outperforming now, does not mean they will be a good buy if the current price does not reflect their value in the long-term.\n\nBuy into valuable companies (future growth, good price) at a discount, ignore short-term market sentiment, and invest in index funds if you do not feel strong enough convictions in your stock picks.",
        "subreddit": "stocks",
        "title": "Warren Buffet's stock strategy is more relevant now than ever.",
        "url": "https://www.reddit.com/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/",
        "created": 1614903257.0
    },
    {
        "author": "pinkmedmug",
        "created_utc": 1614743630,
        "id": "lwkitg",
        "num_comments": 280,
        "num_crossposts": 0,
        "selftext": "Hi fellow WSB,\n\n$GM has some real potential to bring me some generational wealth. $500 PT. Yes, you heard that right. \n\n1.\tGM is insanely undervalued, trading at only 12.5 P/E currently and $75bn market cap. GM is the largest automaker in the USA selling over 8,000,000 cars per year. In comparison, Tesla is trading at over 1,500 P/E and $750bn+ MC. Tesla only sells 500,000 cars a year. They make tons of money on their existing ICE lineup through popular brands like Chevy, GMC, Cadillac, Corvette and reinvesting it into Autonomous Vehicles, Electric Vehicles and Flying Vehicles. \n\n2.\tGM currently has many government contracts and will continue to win more contracts. Government agencies use Chevy's SUVs and President Biden's limo is a modified Cadillac Limo. Biden has committed to turning the entire government fleet of 650,000+ vehicles (light trucks, SUVs, semi-trucks, etc...) into fully electric. and built in America, I expect an announcement soon and GM to be awarded some, if not a majority of the contract. Other startup EV companies simply do not have the scale to produce the government contract. Ford has EV production in Germany which is not made in America. Tesla recently purchased $1.5bn in cryptocurrency which the Treasury Secretary Yellen is against. I think $GM is the best bet to win a majority of the government's work.\n\n3.\tGM has committed to selling 30 new EV by 2025, selling ONLY EV by 2035, and being fully carbon neutral by 2040.\n\n4.\tGM owns Cruise Automation. Initially, bought the startup for only $1bn and most recent funding round of $2bn by Microsoft/ Honda has valued the startup at $30bn. Currently in the lead of Autonomous vehicle technology and continuing to grow massively in the technology hub of the world, SF Bay Area. This technology is being massively discounted.\n\n5.\tGM has Utium Battery technology and a $2.3bn factory in Lordstown, Ohio churning out their proprietary battery technology. 50-200kWh battery packs that will push the cost per Kwh under $100 (current cost for Tesla is over $230) in the next few years. These batteries will power the new Cadillac Lyriq and Hummer EV coming out later this year. The  cars are not weak, truly cutting edge! \n\n6.\tApple has rejected Hyundai, Kia, Tesla, Nissan in their bid to find a manufacturer for building an EV. $GM is still in the running and could be a nice surprise. They are cutting edge, mature with manufacturing capability, and made in America.\n\n7.\tFamous investors like Warren Buffett, Leon Cooperman, Joel Greenblatt all piling into $GM in the billions.\n\n8.\tPresident Joe Biden will likely renew the EV tax credit in his upcoming stimulus bills which will cut the price of $GMs EVs by $7,500 and spur sales significantly.\n\n9.\tChip Shortage Fear will be over soon and is only temporary. $TSMC has is in the process of building a huge factory in Arizona which will keep chip manufacturing in the US. Biden will sign executive orders to ease this issue through defense production act.\n\n10.\tNewly released Chevy Bolt and Bolt EUV is the hands down most affordable and best value EV on the market today. Bolt starts at $31,995 - Bolt EUV starts at $33,995. Both more range than Tesla Model Y and EUV has $GM's version of Tesla Autopilot, SuperCruise already installed (versus Musk's $10,000 for this upgrade).\n\nMegabullish on this to double or triple once the media/ mainstream investors discover what $GM can really do! Position below. Cheers guys.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kw0hi639kqk61.png?width=595&amp;format=png&amp;auto=webp&amp;s=220549adeb676f1397f61406fd6566b7720cffcd",
        "subreddit": "wallstreetbets",
        "title": "General Motors $GM - PT $500 coming soon, DD inside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwkitg/general_motors_gm_pt_500_coming_soon_dd_inside/",
        "created": 1614772430.0
    },
    {
        "author": "Longjumping_College",
        "created_utc": 1614780541,
        "id": "lwuqb6",
        "num_comments": 209,
        "num_crossposts": 1,
        "selftext": "Since people say they find it useful, I thought I might try post form and see if it gets enough interest to continue doing semi-regularly, round 4. I'm planning to post my portfolio and gains soon since making the account in December it's up ~250%.\n\nI added recent PRs for this week, lets see how it goes.\n\n*newest additions:*\n\n$RYPPF - Ryu apparel, hired a guy from burton/DC shoes and another from Red bull/Lulu Lemon recently. Up to something big with hiring a marketing firm to get investors. Long term play\n\nThe Vertical Duo ($ZAAG, $GMEV) - these guys are teaming up together to combine solutions for vertical and [indoor farming solutions.](https://sports.yahoo.com/foundation-farms-corp-joins-forces-123000167.html) This industry has a big future for whoever perfects it.\n\n$AFPW - [an interesting play this one is](https://finance.yahoo.com/news/dinatrum-signs-letter-intent-140900873.html)\n\n$ASTI - after [this news](https://www.globenewswire.com/news-release/2021/03/01/2184008/0/en/NASA-s-Marshall-Space-Flight-Center-Selects-Ascent-Solar-Technologies-CIGS-Modules-for-Their-LISA-T-and-Solar-Cruiser-Flight-Experiments.html) i'm gonna keep long term\n\n$CWGYF - wave prediction tech to utilize for power farming from ocean currents/waves [backed by Microsoft and others](https://www.carnegiece.com/microsoft-ai-for-earth-grant-awarded-to-carnegies-wave-predictor-project/)\n\n*My list of pennies holdings (most anyways) with quick notes:*\n\n$AITX - AI and Robots, [business is accelerating for them.](https://www.businesswire.com/news/home/20210302005458/en/Artificial-Intelligence-Technology-Solutions-Announces-Executive-Team-Expansion)\n\n$ALKM - $2m annual sales in CBD water, expanding with partnership into a CBD infused liquid sugar, a CBD infused pet food supplement and a CBD sexual wellness flavored lubricant. Also hand sanitizers that is now selling in Canada. [They also just announced new water treatment patents](https://www.accesswire.com/632903/Alkame-Holdings-Inc-Advances-Water-Treatment-Technology-with-Game-Changing-New-Patents)\n\n$ALYI - EV ecosystem to help EV tech, and then EV vehicles exist globally. Starting with the Retro ReVolt made by MODUS and supporting tech by $ALYI and $IQST. Also announced $20 million of EV motorcycles (2000) to be shipped to Kenya by July. [ICO is Tomorrow, the train starts now](https://finance.yahoo.com/news/alyi-announces-march-4th-revolttoken-144200758.html)\n\n$ASRT - assertio has all the hype, let's see what they tell us at their quarterly. *If you browse this sub you know this one.*\n\n$BETR/BETRF - [psychedelics](https://www.globenewswire.com/news-release/2021/03/03/2186186/0/en/BetterLife-Engages-Eurofins-CDMO-for-Next-Generation-Psychedelic-TD-0148A-Manufacturing.html)\n\n$COOL/CLABF - Nasdaq bound, [psychedelics with patents](https://finance.yahoo.com/news/core-one-labs-prepares-first-210500496.html)\n\n$EVIO - THC/CBD testing, [had problems but is recovering.](https://www.businesswire.com/news/home/20200915005498/en/EVIO-Inc.-Provides-Shareholder-Update)\n\n$EXROF - more pricey but high power EV solutions, think construction, garbage trucks, things that need lots of direct power. That short report is laughable, might average down some.\n\n$GABLF - Gaby Inc, THC/CBD CPG company, just bought a dispensary (I posted a DD, it's currently halted due to the merger) [(currently halted on merger)](https://finance.yahoo.com/news/gaby-inc-announces-execution-definitive-121000976.html)\n\n$GBHPF - [hemp play, picking up speed](https://www.mmjreporter.com/global-hemp-group-inc-otcmktsgbhpf-inks-a-pact-to-takeover-western-sierra-resource-corp-otcmktswsrc-becomes-a-member-of-ushba-41380)\n\n$HPQFF - Nano silicon breakthroughs, very promising\n\n$IQST - partnered with $ALYI to make hemp batteries and hemp body frames for upcoming ecosystem. Owns IoT tech and is making a lab for physical screen devices for the ecosystem too. [Vonage partnership.](https://finance.yahoo.com/news/iqst-iqstel-signs-contract-telecom-160900454.html)\n\n$MSRT - MassRoots, [buying Herbfluence](https://finance.yahoo.com/news/massroots-announces-letter-intent-purchase-130000704.html) (tech to connect THC/CBD products to influencers for marketing campaigns)\n\n$OZSC - yep I'm back in it, locked in gains and I came back. Missed you buddy. [New alliances are looking promising](https://www.globenewswire.com/news-release/2021/02/22/2179747/0/en/Ozop-Energy-OZSC-Forms-Strategic-Alliance-with-Grid-Energy-Masterplanning-LLC.html)\n\n$PAOG - where KALY extract tech ended up(RespRx for COPD), moved to Texas to partner with PURA for their 70 acre farm [and new projects.](https://finance.yahoo.com/news/paog-announces-cbd-nutraceuticals-expansion-135800886.html)\n\n$PURA - relocating to Texas, [new 70 acre grow property breaks ground later this year.](https://www.prnewswire.com/news-releases/pura-plans-to-break-ground-by-july-on-new-hemp-brand-lifestyle-facilities-301222602.html) Partners with ALKM for CBD infused liquid sugar, a CBD infused pet food supplement and a CBD sexual wellness flavored lubricant. \n\n$RVVTF - psychedelics, THC/CBD medicine and much more. A good DD was just posted about it, check it out. [Plus a huge COVID medicinal play](https://www.globenewswire.com/news-release/2021/02/26/2183438/0/en/Revive-Therapeutics-Provides-Update-on-FDA-Phase-3-Clinical-Trial-for-Bucillamine-in-COVID-19-with-Planned-Completion-and-Emergency-Use-Authorization-Request.html)\n\n$SGSI - owns AW solutions/ADEX Corp, [is merging with High Wire Solutions](https://www.investorwire.com/newsarticle/?qmstory=5976044494641101)\n\n$STHC - [AMECA mining merger](https://microcapdaily.com/ameca-mining-rm-the-rise-of-southcorp-capital-inc-otcmkts-sthc/128906/)(Gold, Paladium and high grade graphite miner)\n\n$TBPMF - targeting first THC prescription approved by FDA, [trails were approved.](https://seekingalpha.com/news/3656232-tetra-bio-pharma-gets-fda-greenlight-for-qixleef-reborn1-trial)\n\n$TGIFF - Vegas cannabis play, [$2m quarterlys cheap but catching on.](https://www.benzinga.com/markets/cannabis/21/02/19468852/1933-hits-sales-milestone-in-january)\n\n$USMJ - ecommerce and distribution logistics partnered with PURA/POAG/ALKM\n\n$WSGF - [Vaycaychella app,](https://finance.yahoo.com/news/wsgf-commences-p2p-alternative-real-145100696.html) Airbnb competitor launching this year, will accept crypto for rental payments. *This is time shares for millennials that includes crypto purchasing.*",
        "subreddit": "pennystocks",
        "title": "Pennies list 3/3",
        "url": "https://www.reddit.com/r/pennystocks/comments/lwuqb6/pennies_list_33/",
        "created": 1614809341.0
    },
    {
        "author": "double_a_mtl",
        "created_utc": 1614796907,
        "id": "lx13kf",
        "num_comments": 203,
        "num_crossposts": 0,
        "selftext": "I got a lot of support for my last DD post [https://www.reddit.com/r/wallstreetbets/comments/liez6h/my\\_50k\\_yolo\\_on\\_trvg\\_and\\_why\\_itll\\_to\\_the/](https://www.reddit.com/r/wallstreetbets/comments/liez6h/my_50k_yolo_on_trvg_and_why_itll_to_the/)\n\nBut when I tried to post an update, it kept getting automodded.\n\nAs an update: I took profits on my last play and am now re-allocating them. This is my 1st new play.\n\n&amp;#x200B;\n\n$NOK got a LOT of love when the first $GME spike happened. It got so much love that it popped to nearly 10$/share before RH blocked trading.\n\nSince then, volume's come down, attention has gone away from the stock, this has made options quite appealing.\n\nIV's down significantly and calls are REALLY cheap.\n\nMy DD:\n\n* They delivered SOLID Q4 and 2020 earnings, even though it was a tough year in general.\n* The company owns the **most** pattents in the 5G space of all it's peers.\n* Huauei is being blacklisted in most of the western world, there are only 2 players remaining in the space, Ericcson and Nokia.\n* The company is sitting on nearly $8 billion in cash and generates over a billion a year in free cash flow.\n* The stock is trading at only 1.5x book value\n* They have been increasing the profit margins significantly for the last 3 years and are working towards improving them even more.\n* Nokia has announced several solid deals over the past few weeks.\n\n&amp;#x200B;\n\n* **The company is small enough that it could be an M&amp;A target** \n   * The US Attorney General William Barr [said](https://www.justice.gov/opa/speech/attorney-general-william-p-barr-delivers-keynote-address-department-justices-china) the US -- either directly or through a consortium of private American and allied companies -- should purchase a controlling stake in either Nokia or Ericsson for access to secure 5G equipment. He said such a move could blunt the rise of China and Huawei in the space. \n   * AT&amp;T / Tmobile / another carrier could buy them to lower their own costs of updating to 5/6G.\n   * Intel and Microsoft are both focusing heavily on the space and Microsoft already bought part of Nokia in the past.\n\n&amp;#x200B;\n\n* There's also the potential for them to reinstate their dividend payment policy.\n\n&amp;#x200B;\n\n* Average analyst price target is 5.75$\n* Over the last 10 years, it's been rangebound between 4 and 8$, it's pretty much at the bottom of the range.\n* I'm confident it'll be back to 5 or 6$ by the summer, especially if they keep announcing these solid deals.\n\nPositions: 20 000 shares and 100x 6$ calls sold against them for april 16th.\n\nTLDR: Nokia's a great medium-long term play, IV's down significantly, shares and calls are cheap. This will probably bounce from 4$ back towards 6-8$ over the medium term, or be bought out as a strategic play, likely for over 6$.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/prfjxg55xuk61.png?width=1076&amp;format=png&amp;auto=webp&amp;s=65485e5de2245bf858bd2da9dcfd36f7d428c5c5",
        "subreddit": "wallstreetbets",
        "title": "80K Yolo + update on my last one that made pretty much everyone some money.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx13kf/80k_yolo_update_on_my_last_one_that_made_pretty/",
        "created": 1614825707.0
    },
    {
        "author": "pabloseason",
        "created_utc": 1615130583,
        "id": "lzspkk",
        "num_comments": 183,
        "num_crossposts": 0,
        "selftext": "Young investor, looking to park some money away in safe place for a few years with some decent returns. My strictly stock portfolio possesses below holdings:\n\nCostco (25%)\n\nApple (25%)\n\nAmazon (15%)\n\nP&amp;G (10%)\n\nMcDonalds (7.5%)\n\nGoogle (5%)\n\nAlibaba (5%)\n\nPaypal (2.5%)\n\nMicrosoft (2.5%)\n\nBoeing (2.5%)",
        "subreddit": "stocks",
        "title": "Long term investor",
        "url": "https://www.reddit.com/r/stocks/comments/lzspkk/long_term_investor/",
        "created": 1615159383.0
    },
    {
        "author": "AdvancedLong",
        "created_utc": 1614752937,
        "id": "lwn6cr",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "I've bought the falling knife. I enjoy high risk. Let me run you down some fundamentals on why this is an advanced long. Pun intended. (My screen name.)\n\nLet's get to the meaty part first. \n\nLesson #1 Fraud is the most bullish word on Wall street, but even better is Monopoly, and Antitrust. Which is why retail weak fingers are getting walked down. (Regulation is the most feared btw.) If it wasnt for Clover health pulling some strings behind the scenes I dont think they would exist. Clov was caught running a red light, so take the fine, and get back in your Tesla. If not for fraud they wouldn't last a year. United health, and Blue cross would've destroyed them right outta the gate.  Look at the most fraudulent companies in the world. They're sporting the highest market caps. Ask Tesla bear scrubs Einhorn, and Gordon Johnson about how Tesla is a fraud. Apple, Msft, Amzn,  seen fraud litigations. Bring in Vivek, and Chamath. Accused of fraud. Get the point? Fraud is bank as long as your the fraud.\n\nWho cares about Last year? You've heard this right?\n\n\"**Past performance** is **no guarantee** of future **results**\"\n\nA. Grew membership by 36.3%\n\nB. Increased revenue by 45.6%\n\nC. Gross profit increased to 12.2% of revenue\n\nThis means absolutely nothing. Again. **\"Past performance is never an indicator of Future results.\"**\n\n**4 F's  - Future Fun Facts &amp; fundamentals. Speculative Statistics.**\n\nA.  The number of Americans ages 65 and older will more than double over the  next 40 years, reaching 80 million in 2040. The number of adults ages  85 and older, the group most often needing help with basic personal  care, will nearly quadruple between 2000 and 2040.  👈  (Try search engine)\n\n***Those statistics come true. Minimum +200% customers***\n\nB. Government Medicare spending is set to increase from 15% to 19% 👈  (Try search engine)\n\n***More revenues from the budget.***\n\nC. Medicare for all. 👈  (Try search engine)\n\n***\"Medicare for all\" would push our potential customer base to the moon. (Full Population)***\n\nD.. Clover health's competitors have over a trillion dollars in market cap to swipe.\n\n***Always good to have healthy competition. UNH, ANTM, HUM, CI, plus private ones like Aetna***\n\nE,F,G Highly Speculative. It's a healthcare insurer that's only medicare, and not yet in the workplace.\n\n***If Clover health enters the entire health insurance market whole different valuation is coming.***\n\n&amp;#x200B;\n\nTLDR; For those that are patient. This could be a really great long term growth investment. Clover health currently has less than 1% of available participants in healthcare marketplace.\n\nAside from the celebrity status of certain board members I'm going to tuck this one under the mattress, set a recurring investment, and probably have fun losing everything if tit's go up.",
        "subreddit": "wallstreetbets",
        "title": "Clov Fundamentally sound outlook. Why Clover Health is retarded.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwn6cr/clov_fundamentally_sound_outlook_why_clover/",
        "created": 1614781737.0
    },
    {
        "author": "DrixlRey",
        "created_utc": 1614878588,
        "id": "lxpxli",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": "So all you new traders talked about how these companies do not have enough \"gains.\" Look at it now. It's barely dipped, much less volatile. That is what will happen when we actually crash too. You're going to see 80% crashes in the future, but that's not going to be these companies. Yes you'll see it go down too, but not as dramatically.",
        "subreddit": "stocks",
        "title": "The boring stocks, Amazon, Microsoft, Google, all barely dipping",
        "url": "https://www.reddit.com/r/stocks/comments/lxpxli/the_boring_stocks_amazon_microsoft_google_all/",
        "created": 1614907388.0
    },
    {
        "author": "Tradergurue",
        "created_utc": 1614899916,
        "id": "lxy8rd",
        "num_comments": 106,
        "num_crossposts": 3,
        "selftext": "*This is not financial advice.*\n\nA lot of you BB bulls are worried about the future of BlackBerry, the price goes down and down. But fear not BlackBerry has a very bright future ahead.\n\nToday we had a conference with Morgan Stanley about BlackBerry technology, here are some of the insights from the conference:\n\n1. ⁠Drones confirmed by the Chief technology officer (this is big news) as big application for QNX\n2. ⁠Body-language wise didn't seem like the Chief technology officer was worried about semi-conductors\n3. ⁠Said that automotive slowed down b/c of covid but made reference to the fact that they were \"coming out of it\" - Feels bullish for next earnings or two\n4. ⁠Adhoc (messaging solution) straight up benefitted from COVID. zero hesitation from the Chief technology officer answering that question. This is pretty bullish.\n\nThe most important thing about BlackBerry in my opinion is IVY, it is going to be the Microsoft of car. We also have confirmation about how IVY will generate revenue, this will be on a subscription level, almost like Netflix. Instead, it is the car manufacturer who will be paying this subscription fee. So you could almost say IVY is a fusion between Microsoft and Netflix.\n\n**So what is IVY?** Well, a picture describes more than a thousand words:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/if9vl0gsg3l61.jpg?width=2117&amp;format=pjpg&amp;auto=webp&amp;s=eec7bebf7ba6c214876ebcdde853c268dbb6abf3\n\n**How big is IVY going to be?**\n\nAs many of you know QNX is already in 175m cars, what would 175m cars with IVY be worth to BlackBerry? Well, I have created a chart below:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9swvq7ktg3l61.png?width=1278&amp;format=png&amp;auto=webp&amp;s=f32d9ff10eb1bb1f06ef5519c2f1b1b5c85ad772\n\nThis right here would be the case if all cars with QNX had IVY installed, and if the subscription fee is $1 a month. It is very hard to say what the service would cost for the car manufacturer, but my estimate is somewhere around $1-5 a month.\n\nBlackBerry currently has a 61% market share of the EV OEM market, and in 10 years most cars on the road would be EV. In 2019 92m AV and EV cars were produced, that would be around 56m cars installed with IVY if all were EV cars. In 2040 at least 750-1000m cars would have IVY installed if it goes as planned.\n\nThis looks very very promising, especially for a company only valued at 6x their current revenue and an MC of $5.5b.\n\n**Price prediction** (my opinion)\n\nAs of the stock price, we are currently trading below $10, the latest analyst rating BB received was that a fair valuation is $10 from Canaccord which would make BB a buy at the moment. However, I feel like a fair valuation would be much higher around $50-75 if you take into account the bright future.\n\n**Has BlackBerry caught your attention?**\n\nI have collected some of the best DD's made on $BB\n\n* [BlackBerry Bull and Bear case](https://www.reddit.com/r/wallstreetbets/comments/l4ehan/blackberry_dd/)\n* [Why BlackBerry isn't a meme stock](https://www.reddit.com/r/wallstreetbets/comments/liixji/blackberry_is_not_a_meme_stock/)\n* [A full detailed description of BlackBerry](https://new.reddit.com/r/wallstreetbets/comments/le53ol/comprehensive_guide_about_bb_and_how_it_shall/)",
        "subreddit": "wallstreetbets",
        "title": "Why $BB is a good long term hold",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxy8rd/why_bb_is_a_good_long_term_hold/",
        "created": 1614928716.0
    },
    {
        "author": "jostrons",
        "created_utc": 1614785789,
        "id": "lwwoc4",
        "num_comments": 93,
        "num_crossposts": 0,
        "selftext": "I don't know if I am an Ape, Autist or Retard. \n\nI've been on this sub off and on for about 5 years. My first exposure was when people were hyping AMD, and by the time I finished my own DD, stock was up 30% and I decided not to buy. To clarify that was when the price was low single digits and I'd still have made 35x. I've been lurking for a while, MSFT 200 wasn't a winner, nor all those SPY puts. But GME is legit.  \n\nI didn't get into GME in Jan, but I did buy in Feb. This stock isn't about intrinsic value, it's about the short squeeze. Every analyst has it as a short term buy, they see it happening too. \n\nI am notoriously paper handed, but I can't see myself selling anything below $420.69 a share here. We are going to hit it. I might have my expectations short of the moon, but it doesn't take a genius to see this stock as a buy and hold right now.",
        "subreddit": "wallstreetbets",
        "title": "Old School Mentality... still holding GME. Why aren't you?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwwoc4/old_school_mentality_still_holding_gme_why_arent/",
        "created": 1614814589.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1614802171,
        "id": "lx340w",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/03/02/stock-futures-flat-in-overnight-trading-after-tuesdays-losses.html\n\nThe weakness came as the 10-year Treasury yield extended its gains. The benchmark rate climbed more than 8 basis points to 1.49% Wednesday after surging to a high of 1.6% last week in a move that some described as a \"flash\" spike. The continuous rise in bond yields is raising concerns about equity valuations and a pickup in inflation.\n\nPeople should be expected there will be red days like today. It is always better to set aside some cash and buy stocks in these red days. Msft, aapl, amzn and many other big techs are some of the long term holding stocks that are trading at the attractive level.",
        "subreddit": "stocks",
        "title": "S&amp;P 500 falls as bond yields jump once again",
        "url": "https://www.reddit.com/r/stocks/comments/lx340w/sp_500_falls_as_bond_yields_jump_once_again/",
        "created": 1614830971.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1614830720,
        "id": "lxc7hs",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "I have AAPL and MSFT as 17% of my portfolio combined right now.  AAPL basis is $89 and 45 shares.  \n\nI think of my AAPL MSFT as pretty worry free investments with maybe modest growth in the future\nOf course no one knows what's going to happen. I realize they've both returned very well over last decade.\n\nAlthough they've done very well over the last decade,  I'm not sure how much they'll grow in the future.  I hope at least 10% a year.\n\nAnyways when people say buy the dip what do they mean exactly?  How much do you let it dip and how much do you buy in that case?\n\nAlso, should I be buying dips in these 2 if they're already 17% of my portfolio?\n\nOr should I rather be buying dips in my SQ and PYPL since they MAY grow more in the future?\n\nOr is deciding that stuff the \"fun\" 😆 of investing?",
        "subreddit": "stocks",
        "title": "What does buy on dips mean exactly?",
        "url": "https://www.reddit.com/r/stocks/comments/lxc7hs/what_does_buy_on_dips_mean_exactly/",
        "created": 1614859520.0
    },
    {
        "author": "YandleSimp",
        "created_utc": 1614805356,
        "id": "lx49pz",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "I’m getting $5000 to invest with in a few days, and I’m wondering what are some good stocks I should buy for a long term hold.\n\nCurrently I’m planning on splitting it between Apple, Microsoft, Corsair, and ARKX when it comes out.\n\nCan you guys give me some advice and tell me if these stocks are good buys right now, and what other companies I should be looking at?",
        "subreddit": "stocks",
        "title": "What to buy with $5k?",
        "url": "https://www.reddit.com/r/stocks/comments/lx49pz/what_to_buy_with_5k/",
        "created": 1614834156.0
    },
    {
        "author": "ClumsyMedic",
        "created_utc": 1614864098,
        "id": "lxkct3",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "Hey all. I’m a very new trader, since September of 2019. I’ve been lurking a while around and have been investing heavily into tech/ev/clean energy. About half my portfolio are ETFs (some VOO, ARK funds, ICLN, TAN) and the remainder in the the more common MSFT, AMD, NVIDIA, TSLA, NIO, ev charging. I’m getting pretty disheartened about the last couple of weeks. I’m still up 6% from when I started but my ATH was a 32% gain. I trimmed a handful of positions the other day, especially the more volatile stocks and ate the 30%-40% losses. \n\nI’ve been through some of the corrections with I’ll placed deposits, namely in September immediately after I put in 15k just before the dip. And my last deposit was another 15k just before this dip. \n\nI guess I have another question about the outlook of these stocks longer term.  Would an “established” stock that’s overvalued that corrects bounce back to the previous ath levels\n\nSorry for the stressed out post, I know there a lot of them now of days, I just don’t think I could take these extra red days where I’m down 5k a day.\n\nEdit:  thanks for all the replies. It’s keeping my anxiety somewhat at bay. I’ll be holding what I currently have and to clarify, I’ve sold off about 4K work of stock from my 55k invested. I’ve just never experienced this much red before and I’ve been kicking myself as to why I didn’t sell off more earlier. But hindsight is 2020 and I’ve learned some lessons along the way",
        "subreddit": "stocks",
        "title": "Debating just selling everything and going VOO",
        "url": "https://www.reddit.com/r/stocks/comments/lxkct3/debating_just_selling_everything_and_going_voo/",
        "created": 1614892898.0
    },
    {
        "author": "AmenophisCat",
        "created_utc": 1614900202,
        "id": "lxyc98",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": "What do you think will be SNOW's growth and trajectory in the next months, and next year?  \nI saw a few posting buying puts pre-earnings, some positive talk but overall little hype except about the lockup end happening on 3/6. So far SNOW is victim of its success with cautious bullishness from analysts, preventing  the market from pushing the stock up like ZM... maybe its growth is a bit more predictable.  \n\n\n* Quarter results are in, good as expected:  \nQ4'20:  \nrevenue $190M (+117% YoY, beats $178.5M consensus)  \nlosses -70c/share (vs $-1.67 a year ago, but consensus was an optimistic -17c/share)  \nnet loss $199M (vs $83M a year ago)  \nQ1'21 guidance:  \nrevenue of $195\\~$200M (+92% YoY)  \n2021 guidance:  \nrevenue of $1B\\~1.02B (+82% YoY) - is that really too bearish?\n\nhttps://preview.redd.it/osfm6yvr63l61.png?width=1362&amp;format=png&amp;auto=webp&amp;s=4df483eda886911de0ef5a0b0e7c617fc4813202\n\nAnalysts are cautiously optimistic, because the valuation is high but the prospects also very high so it's hard to put a price tag, just like buying a house when the market's hot:  \n[https://www.thestreet.com/investing/snowflake-gets-cautious-support-from-analysts](https://www.thestreet.com/investing/snowflake-gets-cautious-support-from-analysts)  \nAt $71B market cap/$250 share, and a nearly 2X growth prospect, that's 70X 2021 earnings 35X 2022, 20X 2023... Maybe we can assume growth slows around 5B to 10B aka 10% of TAM.\n\n&amp;#x200B;\n\n* Does the employee lock up really matter ?\n\nLockup ends this week. The vast majority of the shares are held by VCs, the CEO &amp; founders, etc. the hands of a very few. Those shares will likely never see the market, as they're controlling shares. Original B shares had also 10 voting rights, and needed to be converted to single voting right A shares to trade, but it looks like they're disolving this structure. Will these billionaires sell lots of shares? no. And if they do they'll have to disclose. Snowflake has few employees and they don't hold that many shares so would they really influence the market selling? Also would they sell at $250 lows? Is this deadline just FUD fuel?  \n\n\n* I like the stock.\n\nI'm personally very bullish on the company's future. I like its culture  and the product, I  trust the founders who've worked hand in hand with the angel investor VCs along the way, and I believe they're passionate about the company and product. IDK about the CEO who was brought in later - because of his track record. There's tons of ex Oracle employees working there who understand the business and the customers (it's a customer centric company).  \nFor me their product is this : it's a classic SQL OLAP database in the cloud that's elastic, with easy management, which has many plugins to do data mining and AI, and fine controls for sharing securely parts of tables (that's big for security inside a company AND for selling data). It is secure enough to be certified to hold medical (HIPAA) and banking data (CapitalOne!). It's also an \"ACID\" transactional database, and its SQL language superset is rich enough to facilitate migration from other vendors like Terradata, Redshift, Oracle, etc. That'll be key to migrate customers from legacy on-prem solutions to cloud.  \nUnfortunately it is not an OLTP database so it can't tap customers sensitive to query latency. It's also likely not the fastest to store and manipulate text like logs, though it can handle large JSON and XML data fine, it shines in columnar data.  \nWhy it's hot I think is it bring old school SQL to the next century as a compatibility story, where other map-reduce cloud solutions failed to become ubiquitous because it was too hard to migrate.  \nThe big 3 (AMZ, GOOG, MSFT) provide similar offerings BUT AFAIK, they do so packaging old school on-prem databases into cloud servers, so it's a kludge to make it work and the customer ends up dealing with it when they try to use the scalable \"elastic\" part, aka hiring very skilled DBA engineers. There's a reason SNOW customers like the product, stick there and buy more. It's not just because it's cheaper, it's also easier.  \nDatabases are the foundations to build on top of, and all businesses need to buy strong foundations, SNOW is such an offering with a few years of lead time vs competition in terms of tech. I believe the addressable market (TAM) is like many 10's or 100's of billions estimated with a handful of big players. \"Big data\" and \"cloud\" have been buzz words since Y2K, but that revolution happening now.  \nI have a feeling Snow was at the sweet spot: not too early that it needs to justify why you want to buy the product, and not too late to justify why to use them vs other established vendors. I feel it will be one of the mammoths. :)  \n\n\n* Why I care?\n\nI am overweight on those shares and I need to decide when to sell &amp; diversify my savings. I still feel Snow might be the next CRM or ORCL growth story, but did it just start too hot? Will it go back to $420 within a few month? How good do the news have to be? I certainly don't feel I want to sell at $250, it feels I could be on a rocket's passenger seat waiting for liftoff and I don't want to miss that... At $350? Hmmm... maybe I'm willing to miss some of the liftoff, and diversify to protect myself if SNOW actually trips :P At $420? I definitely would diversify.  \n\n\n* Palantir\n\nIDK why there's way more hype on Palantir than snowflake on reddit, and why they're compared so much. Maybe it's PLTR's valuation? What's Palantir's addressable market and its competition? Palantir I feel is more of an end user product to do analytics with custom plumbing behind, but I don't really understand their business  value add and how it's different from say Looker or Tableau, and if Palantir's value add is relevant if the data is in a database format compatible with standard tools, which should be the case for most non-gov customers.",
        "subreddit": "wallstreetbets",
        "title": "Where is SNOW heading?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxyc98/where_is_snow_heading/",
        "created": 1614929002.0
    },
    {
        "author": "Lilpl1234",
        "created_utc": 1614824430,
        "id": "lxacrk",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "  \n\nThe year is 2025. Manhattan is doomed. New York City is literally a wasteland where monkeys have developed a civil society and repurposed our old infrastructure into a massive banana farm. Employees working for the suits never leave their homes – they work from home on their computers, order Uber Eats for every meal, ride their Pelotons to workout, and stream games from GameStop for entertainment. Office buildings have been literally crumbling after sitting unused for years.\n\nDoesn’t sound very realistic, does it? \n\nThe work-from-home trend is way overdone. While a handful of progressive tech companies have announced they will offer WFH flexibility post-COVID, almost all are still some sort of hybrid model. On top of that, I just don’t buy that people will want to stay cooped up in their houses after being stuck in them for 18+ months. People will be back in the office as soon as it is safe to do so. A) they want to, and B), corporations know that their workers are more productive in workplaces and not their basements where they watch CNBC and refresh Robinhood all day. Similarly, I don’t buy that people are leaving cities. While obviously there is going to be some degree of emigration out of cities during a GLOBAL PANDEMIC where your risk of contraction is at least somewhat directly linked to the population density of your area, people still want to live in cities. Cities are vibrant, oftentimes have the best jobs, and urbanization is a 200-year trend that will not stop because of some spiky virus. The localization and urbanization economies of scale are simply too strong for that to be the case.\n\nSo, you ask, lilpl, what the hell are you telling us all this for?\n\nEnter SLG.\n\nSL Green Realty Corp is the largest owner and operator of Class-A commercial office buildings in Manhattan. Before I explain any of the growth justifications, I just want to make it clear how big of a value play this is. SLG has raised its dividend for the last eight years straight, and currently has a dividend yield of 5.16% while exhibiting relatively low volatility with a beta of just 1.03 from March 2016 until just before the market crash of 2020. Yes, 5 as in five. In addition to this, the management team recently issued a special dividend of $1.7462, indicating that they believe the stock is severely undervalued.\n\nSLG holds interests in 93 commercial and mixed-use properties diversified across Midtown, Downtown, and Midtown South NYC, and elsewhere encompassing over 40.6 million square feet. Today, Biden announced that the vaccine would be available to every American by May. $1.9t of stimulus is about to hit the economy. New York City’s tech sector is growing and accounted for 25% of all new Manhattan leasing – this is not just finance anymore. Behemoths like Amazon, Microsoft, and Google have been signing decade-long leases. Other tailwinds are too numerous to list here.\n\nSLG’s stock was hammered after COVID, but it still has room to run. It was trading around $97 in February 2020, and dropped all the way down to $38 in May. Since October, people are catching on and the stock is on a tear. People are realizing that SLG can run all the way back up to $100 and beyond as NYC reopens. SLG beat earnings estimates by 169% in 2020. Its 5-year annualized growth rate is 13.1%, rare for a dividend REIT. Speaking of which, real estate is a great diversification play given the news in the bond markets. Don’t just take it from me. CFRA says that despite a high concentration in Manhattan (in my opinion, this will be a good thing when WFH is over), SLG has attractive NYC real estate holdings, a liquid balance sheet, and a manageable debt maturity schedule. \n\nThis is WSB, so this is still a bet. But, would you ever bet against NYC, which rebounded after the 2008 Financial Crisis, which happened in their own city? After 9/11 shook the city to its core? Me neither. I am LONG SLG and do not plan to sell. This is not financial advice. I just like the stock.",
        "subreddit": "wallstreetbets",
        "title": "Cities will return. WFH will end. This is my play.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxacrk/cities_will_return_wfh_will_end_this_is_my_play/",
        "created": 1614853230.0
    },
    {
        "author": "ReflectAA",
        "created_utc": 1614878963,
        "id": "lxq2mp",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "I don't fuck around. You can check my post history. Last year in June my picks were Apple, GM, BA, Disney, and Pinterest. If you bought all 5 you made a lot of money. I don't know how much. Someone else can do that math cause math is work and I don't get paid for this. I posted about Moderna shortly after at around $65 a share. Again same deal. Lots of money, don't know how much, fuck math.\n\n\\*\\*1. $AMRS - Amyris\\*\\*\n\nAmyris is one of the most complex companies on the market. I won't even bother trying to explain everything myself. But here is a quick summary. The company uses  machine learning to guide their biotechnology, and they use biotechnology to manufacture molecules very easily and cheaply, where the alternative is extracting it from nature or convoluted \"legacy\" manufacturing processes. For example, there are only two ways to get the chemicals squalene and squalane. A) Kill a shark or B) go to Amyris. And that is just one ingredient, where Amyris is manufacturing dozens of ingredients, and each of those ingredients are being leveraged in dozens of products. The most notable is Biossance, one of the fastest growing beauty brands.\n\nThey have so many other segments it would take a novel, so just trust me or read the link. Anyway, over the past year they have cut their debt by 60%, grown revenues by over 50%, and finished the year with $170M in revenues. They project $400 M for next year, and are now self funding, something not true for any other non-pharmaceutical biotech on earth (ie: all biotechs other than the ones making drugs). This is an enormous growth opportunity as they will easily dominate several manufacturing markets for years to come. There are some good articles out there on the internet that dissect this company further.\n\n&amp;#x200B;\n\n\\*\\*2. $KLR - Kaleyra\\*\\*\n\nThis one is easy. It’s literally just a smaller Italian Twilio. I call them Pizza-Twilio.\n\nCommunication+analysis services is becoming a huge business in the B2B segment.\n\nBoth Twilio and Pizza-Twilio do the same thing. Twilios current price is x45 their current sales. Pizza-Twilio’s current price is only approx x3 sales. Now valuations are assigned for a reason and KLR hasn’t earned a x45 multiple until they start growing faster, but still. There’s a whole lot of numbers between x3 and x45. Even x10 is a pretty conservative multiple that would give you huge profits at this price.\n\nCommunication as a Service is an incredibly crowded industry and it will be a grind forever. I have no illusions that Kaleyra will ever end up comfortably on top all by itself. However, the industry is still so undeveloped. It is very much a race to capture new markets. One company can't possibly capture every market, since it is a sales-based industry. That means Twilio has to actually send their sales dudes out to places or set up zooms, meaning only so many customers can be gained at once. Which is all to say that Kaleyra will be just fine even if they don't beat Twilio or other competitors. They are very well positioned to dominate a few markets, namely India and the spicy parts of Europe (Italy, France, etc...). So far, they are doing exactly that. Q4 2020 India revenues are up 36% from the prior year. Q4 2020 USA revenues are up 100% from the prior year. Overall, 24% revenue growth.\n\nAnd all of this was true before 2 weeks ago when they acquired mGage, a wireless company that will allow KLR to sell its mass-text and calling services at much better margins since it will now have direct access to several major wireless networks in the US and Europe.\n\n&amp;#x200B;\n\n\\*\\*3. $DIS - Disney\\*\\*\n\nI don't need to explain Disney's business to you. The bull case here is very simple. The market has always given an enormous premium to companies with recurring service revenues. That's why companies like Microsoft trade more richly than companies like IBM or Intel. I predicted this phenomena 2 years ago with Apple, that's why I heavily advocated buying Apple (again, check my history). Now the same thing is about to unfold here. Netflix has a Price/Sales ratio of 9.5 and a PE of 86. Disney has a price/sales of 5.6. Their PE is a little bonkers due to park closures but when the dust settles in a year or so, PE would be around 40-50 if the market cap is unchanged. If Disney+ becomes Netflix, then the upside is double.  If Disney+ becomes even half as successful as Netflix, then that means a third of Disney would be streaming. .33 \\* 9.5 + .66 \\* 5.5 = 6.5 price/sales, or 16% upside \\*on top\\* of their regular growth from parks, media, etc... That is crude and oversimplified math but the point remains. Their multiple \\*is\\* going to change.\n\nWhat's more is that Disney has one enormous advantage over Netflix and other competitors, in that it already owns the media it is displaying. For Disney, content creation is a sunk cost because they were doing that anyway. While Netflix has to spend billions every year on original content JUST for streaming, Disney is already creating that content regardless. Basically, Disney is profiting 3 times off the same content expenses: in parks, in theaters, and on streaming services. Netflix doesn't have that economic efficiency and never will. I don't know if theaters will still be as relevant in 2 years. But either theaters rebound or the streaming market triples, because all that entertainment viewing demand has to go \\*somewhere\\*, and those are the only two media options that are viable right now. Either way, a win for Disney.\n\nPlus they have a dividend. If you are risk averse then Disney is my top pick on the \"stable side\" of stocks.\n\n&amp;#x200B;\n\nHonorable Mentions:\n\n\\- Renalytix They make a kidney diagnostic that works way earlier than anything else that currently exists. No one else makes this. They are working on finishing their clinical testing and already have been in talks with insurers on price agreements.\n\n\\- Pinterest. I called Pinterest last year and they are still a solid buy. However, they probably grew too much, and now have to deal with re-opening pressures. So expect some volatility in the short term.\n\n\\- Drive Shack. They do golf stuff like Top Golf. COVID destroyed this company but if they can survive they have enormous upside. They have made some good decisions and are executing well on a plan to make Golf fun while still covid-friendly.\n\n\\- Bloom Energy. Green energy is not the best place to be in the first half of 2021, but they are by far the cheapest, and they have some great energy-storing technology that leverages hydrogen. There are so many green energy competitors but this is by far my favorite.",
        "subreddit": "stocks",
        "title": "My top stock picks for the next 12 months",
        "url": "https://www.reddit.com/r/stocks/comments/lxq2mp/my_top_stock_picks_for_the_next_12_months/",
        "created": 1614907763.0
    },
    {
        "author": "investingdegenerate",
        "created_utc": 1615168658,
        "id": "m055mx",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "In 10 years we have experienced the rise in tech, ridesharing, ecommerce, AI, EV's and more. Now as one might not know what the next 10 years would hold im curious to know what some of the communities thoughts are. If you were to build a portfolio today, with the goal of growing it over the next 10 years, what would you put in it and how would you subdivide it. \n\n&amp;#x200B;\n\nMy ideas\n\n**Tech-20%**\n\nFAANG\n\nCRM\n\nTQQQ etf\n\nMSFT\n\nPaypal\n\nTwilio\n\nWorkday\n\nARKK\n\n&amp;#x200B;\n\n**Consumer oriented- 15%**\n\nTarget\n\nWalmart\n\nPENN\n\nWYNN\n\nVerizon\n\nAt&amp;t\n\n**Automotive-15%**\n\nFord\n\nGM\n\nTesla\n\n**Finance/Banking- 20%**\n\nGS\n\nCiti\n\nJPM\n\nAXP\n\nVisa\n\nSQ\n\nMA\n\nARKF\n\n**AI-20%**\n\n**Nvidia**\n\n**AMD**\n\nTSM\n\nQcom\n\nCrwd\n\nPLTR\n\nIntel\n\n**The Classics-10%**\n\nCoca-cola\n\nPepisco\n\nAnheuser bush\n\nBA\n\nJohnson and Johnson\n\nPFE\n\nDIS\n\nExon\n\nCVX\n\nBP\n\n&amp;#x200B;\n\nPlease let me know how you would do it or what you would change",
        "subreddit": "investing",
        "title": "Designing a profile from scratch for the long haul",
        "url": "https://www.reddit.com/r/investing/comments/m055mx/designing_a_profile_from_scratch_for_the_long_haul/",
        "created": 1615197458.0
    },
    {
        "author": "Hani95",
        "created_utc": 1614804044,
        "id": "lx3sbz",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "So, i want to talk about Big Tech's unloved little brother (other than Facebook (aha!)), and that's obviously Salesforce.\n\nLet's talk fundamentals, because fundamentals are what we should speak about and I am more of a fundamental player than a technical one. And fundamentally, Marc Benioff has kept to and maintained his 20% YoY revenue growth. The last three quarters, especially, have been gigantic in terms of earnings, as Salesforce has significantly beat Earnings due to the pandemic boost.\n\nFurthermore, margin expansion also beat expectations. Furthermore, what that means is that when revenue growth inevitably dips below twenty percent sometime in the next few years, margin growth should keep earnings growth above 20 percent well in the future. Margin expansion should be helped by WFH after the pandemic, as Salesforce reduces workspace to accommodate (something it has mentioned it will be doing).\n\nThe acquisitions that Salesforce has made, while perhaps too generous, ensure that there is retention of top executives because they buy in. It also allows for upselling, and that's huge for us because like, like Microsoft, it can keep you within its ecosystem. As customer retention is above -90  percent-, this allows for sticky customers... And this will likely continue to grind higher.\n\nFurthermore, Salesforce dominates the SFA space but only has 30 percent of the market in a highly fragmented and still growing space.\n\nSalesforce's projected acquisition of Slack was a very large drag, and the general selloff of the tech sector has provided a huge downward push unto Salesforce. I think that critics have been proven wrong about Benioff's prior acquisitions, and that acquiring companies always suffer a short term drag to their stock before gaining upward momentum because of it. Slack's earnings are tomorrow, and should definitely beat last quarter's EPS which was positive. I expect that Slack will have an amazing quarter, much as other WFH companies have had, and that will prove to be a positive catalyst on Salesforce Stock.\n\nAnalysts have a consensus price target of 270.75. Morningstar has one at 265. The price right now is a touch under 206. That's huge upside, and a positive catalyst could cause an upward explosion in the stock. It doesn't even have to be micro, but macro, with passage of the stimulus bill which congress says it will pass mid march. Heck, even a  more micro focused easing of tension regarding interest rates would cause a significant upward momentum. Salesforce is oversold.\n\nI bought 3 March 19 calls to allow them to print, and I also have 14 shares. \n\nMy positions are:\n\n[CRM - $205.70 | Robinhood and 18 more pages - Personal - Microsoft​ Edge (gyazo.com)](https://gyazo.com/e695d1f42ecc13d8789be0a00966e894)\n\n[Merrill Edge - Account and 21 more pages - Personal - Microsoft​ Edge (gyazo.com)](https://gyazo.com/7782af3825e3f513fb0efa9286ed77ef)",
        "subreddit": "wallstreetbets",
        "title": "[DD] Salesforce Due Diligence",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx3sbz/dd_salesforce_due_diligence/",
        "created": 1614832844.0
    },
    {
        "author": "almargahi",
        "created_utc": 1614744367,
        "id": "lwkqxa",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Hey guys, new here and please feel free to remove post if not allowed to post such questions. \n\nSo, I am pretty new to trading, and some friends recommended to invest in big companies like Apple, Microsoft, Tesla, Walmart, etc. and speaking of TSLA specifically, a close friend recommended to buy the stock and hold, and when I bought my first few shares, price was at $880-ish, but ever since it’s been dropping in price. I know that stock market is kind of unknown / unpredicted but I was hoping to hear some of you out and to share your experiment in the stock market. \n\nLet me know if you have any questions. \n\nThanks!",
        "subreddit": "StockMarket",
        "title": "So is Tesla Stock really overvalued?",
        "url": "https://www.reddit.com/r/StockMarket/comments/lwkqxa/so_is_tesla_stock_really_overvalued/",
        "created": 1614773167.0
    },
    {
        "author": "Puzzleheaded_Web_551",
        "created_utc": 1614806345,
        "id": "lx4mu4",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": " \n\nI imported SIMM (Single Inline Memory Modules), between 1994 and 2006, for my branded computers.\n\nIn that time period, I watched the \"chip\" market more than I did the precious metals market - they moved daily and prices for each type of module was set by noon, each day.\n\nMy companies imported tens of thousands of SIMMs from Singapore, Taiwan, China, Spain, and a few other countries. The paperwork required at customs, in Anchorage, was due to an \"Anti Dumping Tax\". This was to prevent North Korean manufactured chips to be imported (as it should be). At the time, Goldstar became a producer of IC (Integrated Circuitry), chips as it could not keep up with the television innovations. BUT... Goldstar was a SOUTH Korean company, with no embargo, yet monitored closely. Thy produced a great product, however, they were also counterfeited easier and therefore, \"a radioactive\" product.\n\n&gt;***Side Note:***\n\nLG Semicon LLC, was a producer, specializing in IC chips. One company bought the other and both Goldstar and LG Semicon became what we now know as LG.\n\nBack in those days tracking the manufacturing of chips was crucial (no pun intended), because of the daily swing of the prices. The determining factors (which I looked at), were :\n\n* Production capacity of each factory.\n* Daily production numbers of computers.\n* Intel ($INTC), AMD, ($AMD), Microsoft ($MSFT), Compaq, HP ($HP - Hewlett Packard, at one time, \"absorbed\" Packard Bell Computers), and other mass consumers/assemblers of IC chips for PCBs (Printed Circuit Board), including details of motherboard designs and IC requirements.\n* Mother Nature and her wrath \"overseas\".\n\nThe computer makers, DELL ($DELL), Gateway, and Compaq always had first choice of available chips, due to their deep pockets and demand.\n\nA few companies in Asian countries figured out that by closing a factory, for a day or a week, they could, effectively, increase their profits quickly. This effected the entire \"Technology Sector\", although it did not exist yet.\n\n&gt;**Points:**\n\n* Always ask \"Why\".\n* \"Due Diligence\" is not just 2 levels deep. Sometimes you have to find out who is selling the sand/silica, first.\n* In this market, \"What goes down, usually comes up\". Write that down.\n* VIVA LA #REDDIT AND FREE TRADE !!",
        "subreddit": "wallstreetbets",
        "title": "CHIP SHORTTAGE - REAL OR MEMOREX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx4mu4/chip_shorttage_real_or_memorex/",
        "created": 1614835145.0
    },
    {
        "author": "akoc_",
        "created_utc": 1614874137,
        "id": "lxo2ia",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Hello Fellows,\n\nI started investing in January 2020 just a few weeks before WHO declared the corona pandemic. So I have just little experience probably. My biggest concern is that there will be no significant growth in stocks for the next decade compared to the last bull-market. Lots of people are talking that we can't go back to the old normal economic model sience it is based on growth. How shall we interpret this? I mean when I look at the valuation of some stocks for example Apple, Amazon, Microsoft or others... Their valuation is crazy!! Can they still grow and expand? Or is this the start of the end of growth stocks?\n\nLooking forward for your opinions!!",
        "subreddit": "StockMarket",
        "title": "How will the stock market look like after Corona &amp; the Great Reset? (no conspiracy)",
        "url": "https://www.reddit.com/r/StockMarket/comments/lxo2ia/how_will_the_stock_market_look_like_after_corona/",
        "created": 1614902937.0
    },
    {
        "author": "_ii_",
        "created_utc": 1614706933,
        "id": "lw7vlh",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "  \n\n# Microsoft should acquire BlackBerry\n\nTLDR: MSFT wants what GOOL and AAPL have – Android and iOS. Windows is shit. Buying BB makes MSFT instant dominant car OS vender.\n\n# Software defined vehicle\n\nMuch like the evolution of cell phones. You used to buy new flip phones in order to get new features, now hardware and software on smart phones are updated separately. Vehicles are the next app platform. Vehicle software will be the next frontier for innovation. Every major player will want to sell you apps, services, and show you ads in your car. Unlike smart phones, Microsoft has not lost the battle in software defined vehicle space yet. The time for Microsoft to do something about it is now, and the fastest way to get a foot in the door is by acquiring BB. \n\nHow much is each smart connected car worth to social media, ad platforms, cloud service platforms, etc.? A quick web search “social network value per user” says Facebook will generate $226 per user in the U.S. in 2021. Let’s say each U.S. driver is worth additional $50 to Facebook per year, $150 to all other social media and ad platforms combined. I’m being extremely conservative here; car users are captive audiences while phone users often are not. Users should worth more to social media companies when they’re in the car. The U.S. alone has over 270 million vehicles. That’s half a trillion total addressable market. That is just social media in the U.S., how about services and other apps we don’t know we need yet? All in, this can easily be a multi-trillion-dollar market. We haven’t even touched commercial vehicles and taxis yet.\n\n# Microsoft needs a secure real-time OS that’s not Windows.\n\nMicrosoft and Ford’s Sync is an embarrassment to both Ford and Microsoft – source I bought my first and last Ford about 10 years ago. Ford kicked Microsoft to the curb in favor of QNX sometime ago. Ford is replacing QNX with Android from Google. Microsoft needs to redeem itself with Azure Cloud connected infotainment system running on a secure real-time OS. A proven secure platform is going to pitch well against Android and Linux based systems.\n\nApple has CarPlay and Google has Android Auto, and Microsoft is practically absent in infotainment space. CarPlay and most instances of Android Auto runs on QNX based systems. More specifically they rely on QNX’s Projection system. Basically, the apps run on your phone, and “project” the display via QNX and QNX sends control signals (touch screen, button press, etc.) to the phone app. If you’re huge company who wants a piece of the car software pie, but no one uses your Windows phone, what can you do? You can bundle your software with the car! Build it into the car’s OS, for free! \n\nMicrosoft would love to pull another Internet Explorer vs Netscape Navigator if they can control the car OS. Only in this case Apple and Google are not the underdog Netscape was. Apple and Tesla will do their own thing, but for the majority of auto makers who already use QNX, the easy thing to do is keep using QNX if it is good enough and backed by MSFT’s engineering power. A MSFT own QNX can even be free or less than free.\n\n# Monolithic Kernel vs Micro Kernel\n\nMicrosoft Windows is not suitable for cars, and it can’t be fixed. BlackBarry’s QNX Neutrino RTOS, based on microkernel architecture, is inherently more secure than monolithic kernel such as Linux. Microsoft Windows has hybrid kernel and by some measures has worse security track record. When your email, IM, and text can be shown on your car’s screen or read aloud via your car’s audio system. Security will be a major concern for consumers and government agencies. Microsoft owned QNX has a real chance of dominating Android and upcoming Apple Car OS.\n\n# Conclusion\n\nI see increasing chatter about MSFT may benefit from a BB acquisition so I did some DD before start buying BB stock. I believe after MSFT lost the smart phone battle, car software and OS are MSFT’s once in a generation second chance. BB enterprise value is about 6 billion. I can see MSFT spend 20+ billion in stock and cash to buy BB. I write code for a living and thinks he understands markets he has little to no knowledge of. I’m not a financial advisor. I spent a lot of my time on GitHub and various programming chatrooms. I may have read something on the web that give me this idea, or it may be all in my head. I honestly can’t tell. I do not have any direct or indirect knowledges pertinent to MSFT and BB’s technical or management decisions. Invest at your own risk.\n\nDisclosure: 500 shares at 13.80 and some calls spread over 17 to 20 range.",
        "subreddit": "stocks",
        "title": "MSFT + BB = Dominant Car OS vender",
        "url": "https://www.reddit.com/r/stocks/comments/lw7vlh/msft_bb_dominant_car_os_vender/",
        "created": 1614735733.0
    },
    {
        "author": "el-retardo-59",
        "created_utc": 1614866459,
        "id": "lxl5ef",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "AMD has taken a hit past few weeks but I think it’s reached pretty attractive levels to start a position. It is said to grow even more this year, just recently released a new GPU and addressed shortages.  AMD also moved into cloud computing so with the tech giants like Microsoft and google expanding their cloud, AMD would benefit. Plus with the amount of PS5s that will be sold this year, I don’t see AMD staying at $80. What do y’all think? Is growth this year not happening or is it not a bad bet?",
        "subreddit": "wallstreetbets",
        "title": "Recent dips in semi-conductors an opening?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxl5ef/recent_dips_in_semiconductors_an_opening/",
        "created": 1614895259.0
    },
    {
        "author": "rareliquid",
        "created_utc": 1614702278,
        "id": "lw5xoa",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Hello! Below is some diligence on Fastly, one of the innovators of the CDN / edge computing space. TDLR and resources used at the bottom.\n\n**What are CDNs and Edge Computing?**\n\n* Before I get into Fastly, I first need to set the stage by defining CDNs and Edge Computing (or else the rest of the post is confusing)\n* **CDNs are defined as a group of servers that help deliver Internet content,** so even this Reddit post you’re reading right now is delivered to you through a CDN\n   * To put it simply, all else being equal, a good CDN will help something like a web page load really fast while a bad CDN will be slow and cause noticeable lag\n* **Edge Computing is a relatively new term born out of CDNs** and is a field in which Fastly is one of the primary innovators\n   * For the average person, it may seem like digital data can be transmitted instantaneously, but in actuality, the farther away servers are to a user, the more time it takes for digital data to travel, compute, and be stored\n   * **Edge computing brings computation and data storage as close to the user as possible through small, distributed data centers placed all over the world**\n      * It also allows for a lot of the data processing to happen on edge devices, like smartphones\n   * To really hammer this home, imagine having to travel to Texas every time your car needed gas instead of just traveling to your nearest gas station\n      * That’s the difference between how data used to be processed (traveling to Texas = data traveling to a few, faraway data centers) to what edge computing now provides (nearest gas station = closest edge server or devise)\n   * [Here’s a visual representation I find helpful](https://cbi-research-portal-uploads.s3.amazonaws.com/2019/01/08144511/Edge-Computing-Graphic-768x432.png)\n\n**The History of Fastly**\n\n* Fastly was founded by Artur Bergman in 2011. He was previously the CTO at Wikia. Artur became frustrated with the capabilities of CDNs around 2010 due to the long wait times it took for updates and the constant reliance on slow technical support.\n   * Artur believed he could create a better solution and thus founded Fastly and the company branded itself around CDNs until about 2017, when references to CDNs were replaced with moving computing to the edge\n* What’s important to know is that from its early beginnings, **Fastly’s team had a fundamentally different mindset and a custom-built approach** that know gave the company an edge\n* Here are 3 notable differentiators:\n   * **1) Silverton - Fastly’s customized distributed routing agent**\n      * In its beginnings, the Fastly team first examined approaches to handling networking traffic into and out of their Points of Presence, or POPs, which are a collection of devices that store data that CDNs can pull from to quickly deliver content\n      * Instead of using standard, off-the-shelf equipment, Fastly purchased Arista switches that allowed them to run their own software aka Silverton which gave Fastly more control over traffic routing and thus leading to better content delivery\n      * This also saved the company hundreds of thousands of dollars for each POP deployed\n      * But more importantly, software can be changed while hardware cannot, which means that over time, Silverton becomes better and a stronger competitive edge\n   * **2) Less but more powerful POPs**\n      * Most legacy CDN companies like Akamai have invested into hundreds or thousands of small POPs across the world and continue to tout this as a strength, but **the problem with smaller POPs is that the amount of content that can be stored is limited**\n      * This means that if a data request is sent to a small POP that’s full, the request will have to travel all the way to an origin server, which could increase the time by a factor of 10x or more\n   * Legacy CDNs (like Akamai) built their architectures based on the old Internet backbone aka dial-up which required these smaller POPs that are now nearly impossible to upgrade\n   * Fastly examined all this and took a different approach\n      * If legacy POPs are local convenience stores in which you have to visit multiple to buy all your groceries, Fastly’s POPs are Costco-style supermarkets where you can buy everything at once\n      * Fastly’s POPs have much more storage space which significant reduces the need for requests to go back to origin servers\n      * In addition to that, Fastly utilized SSDs to store cached data which is more expensive but offer much faster retrieval times (in a [blog post](https://www.fastly.com/blog/why-having-more-pops-isnt-always-better), Fastly compares this to “having all of your items waiting for you at the supermarket checkout stand instead of having to walk around the supermarket with a huge cart hunting for each item on your list”). The SSDs Fastly uses are orders of magnitudes faster than standard hard drives\n      * The punchline is just that Fastly created a super modern internet architecture through powerful POPs that result in much faster average content delivery times for their customers\n   * **3) Developer customization**\n      * Fastly’s founder Artur was frustrated by the lack of control from the CDNs he worked with and as a result, Fastly since its early days has been focused on serving developers and engineers\n      * While legacy providers required technical support to roll out changes, Fastly added programmability to content control through Varnish, an open-source web accelerator\n      * [Varnish](https://www.fastly.com/blog/benefits-using-varnish) allows for powerful features, such as instant purge of content, reverse proxies, and real-time data monitoring and management\n      * Perhaps most importantly, Varnish allows developers to adjust caching policies based on their unique needs, giving developers much more flexibility and control and resulting in happier customers\n* So to sum up, from the very start, Fastly took a **different approach to its content delivery and customized nearly every step of the process** which is ultimately what helped the company disrupt the legacy CDN industry\n\n**Fastly’s Products**\n\n* I won’t cover too much of Fastly’s CDN products because I’ve basically mentioned what Fastly does there (deliver content to users real fast)\n   * One thing to note, however, is that even with Fastly’s unique positioning, **the overall sentiment is that CDN is a commoditized industry** and so there will be significant competition on pricing moving forward\n* That’s why Fastly’s future areas of growth is not in CDN but in its **Edge Compute Technology and Cloud Security**\n* **Compute@Edge**\n   * Starting with Edge Compute Technology, in November 2019, Fastly announced the launch of the beta testing for Compute@Edge\n   * **Compute@Edge is a platform that allows developers to build applications at the edge rather than in centralized data centers,** and this provides the benefits of better security, performance, and scalability in a severless compute environment. This goes MUCH MORE beyond a traditional CDN.\n   * Traditionally, cloud-based applications **centralize logic in a data center (imagine a really big office space full of servers)** that eventually hops over to a user’s device regardless of where that user is geographically located\n      * The problem with this is that computation costs money and it becomes more expensive the further out from the origin that you get\n   * Lucet\n      * In response to the 4 aforementioned requirements, just like in its early days when it was developing its CDN, Fastly took on a customized approach by building Lucet\n   * In the latest Q4 2020 earnings call, management highlighted that Compute@Edge has seen considerable progress, naming multiple use cases in the gaming, machine learning, language, and ad-tech industries\n   * With all this said, while Fastly is a pioneer in the edge compute space and Compute@Edge could be a source for a lot of growth, it’s also likely that other competitors will quickly copy the company's approach and there are no guarantees in the eventual size of the market\n   * As a result, this product is something **investors need to keep a close eye on in 2021** to see how the product develops and how competitors react\n* **Secure@Edge**\n   * The second product to highlight is Fastly’s Cloud Security services, which is known as Secure@Edge\n   * While Fastly's previous security offerings were comparable to its competitors, Fastly notably bolstered its competitive position with its acquisition of **Signal Sciences** in August 2020\n   * To give a bit of background, Signal Sciences was founded by 3 former Etsy employees who were frustrated by the limits of existing security solutions to protect web apps\n      * Just like Fastly, these founders designed a new Web Application Firewall or WAF that was both **modern and developer friendly (similar to Fastly’s story)**\n      * From these beginning, the team built a WAF with 3 key advantages including **higher accuracy, increased automation, and flexibility**\n   * And since then, Signal Sciences became one of the world’s hottest startups and was selected by Forbes in May 2020 as one of the top 25 fastest growing startups likely to reach a $1BN valuation\n      * In February 2020, Gartner compiled reviews from customers of WAF products and Signal Sciences was the most highly rated amongst all competition with a 4.9 out of 5 rating\n   * Through the combined company, Fastly is offering what’s known as Secure@Edge and is arguably a leader in the web app security space\n   * **Secure@Edge will be built on top of the Compute@Edge platform,** which means cloud applications won’t require a separate security layer in front of them which is a gamechanger and results in lower costs and higher effectiveness\n   * Perhaps most importantly, what this does is help accelerate **edge computing adoption,** which again is the big bet Fastly is making on its future growth\n   * The last thing I want to highlight are just a few of the metrics of the deal\n      * Signal Sciences was acquired for $775 million of which $575 million was Fastly stock, which is good because that means the Signal Science’s team are Fastly shareholders and incentivized to help the company succeed\n      * Signal Sciences also about 42 additional enterprise customers to Fastly which the company can now more easily cross-sell other products to\n      * The company generated annual recurring revenue of $28 million as of June 2020 and was growing at 62% vs. Fastly which typically grows in the 30s and 40s\n      * Gross margins are above 85%, which is much higher than Fastly’s which is usually in the 50s\n      * And lastly, gross retention of 96% shows that the stickiness of Signal Science’s product which is a great sign\n* **To recap, hopefully by now you see that Fastly is much more than a CDN company. Through Compute@Edge and Secure@Edge, Fastly is building the next generation’s edge computing platform**\n\n**Competitive Positioning**\n\n* Fastly [markets itself well](https://www.fastly.com/why-fastly) as a company with a developer-first mentality, which is a very modern marketing approach versus in the past where legacy CDN companies used to target C-suite executives\n   * The 3 key strengths Fastly touts are lower costs, more control, and better security - all 3 of which are things we covered\n* The key competitor names in edge computing that you should know are Amazon’s Lambda@Edge, Microsoft’s Intelligent Edge, Akamai’s Intelligent Edge Platform, and Cloudflare’s Workers platform\n   * I’m not going to go into Fastly’s competitors too much because I’ll be making another post later about Cloudflare which is Fastly’s main competition\n* When looking at all these competitors, Fastly boasts the fastest cold start time at 35 microseconds, which far beats out any of the legacy competitors and its biggest competitor Cloudflare\n* The last important thing I want to mention in regards to Fastly’s competitive positioning is its management team\n   * Fastly has assembled a world-class team both organically and through acquisitions and this is one of those intangible strengths that’s hard to measure but very important for a company that’s trying to disrupt an industry\n   * This [blog](https://softwarestackinvesting.com/fastly-and-signal-sciences/) has a really great description of the company’s management team (search the term “brain trust” and you can read a bunch of management bios there\n\n**Customers**\n\n* Fastly focuses on large enterprise customers, which the company defines as a customer that spends **more than $100K annually**\n   * This is a primary distinguishing factor from Cloudflare, which is another leading CDN company that focuses on small businesses\n* According to their Q4 2020 earnings report, Fastly has a total number of customers of 2084, of which 324 are enterprise customers\n* Fastly serves some of the most highly innovative digital companies in the world who which really validates the company’s services (Microsoft, Slack, Shopify, etc.)\n\n**Financial Overview**\n\n* Highlights from Q4 2020 results:\n   * **2019-2020 full-year revenue growth of 45%** (a bit inflated due to Signal Sciences acquisition, but nevertheless, very solid)\n   * **Non-GAAP gross margin of 60.9%** (up from 56.6% and this should trend upwards due to Signal Science’s high gross margin\n* The key revenue-related metrics (besides growth rate) you need to keep track of each quarter (which are also provided in the quarterly earnings report) are the following: \n   * **DBNER** \\- 143% this past quarter which is really high, and means that if a customer was spending $100 last year, they spend $143 today (but declined slightly from 147% from Q3 2020)\n   * **Net retention rate** \\- 115% which is also high but declined from 122% from Q3 2020\n      * DBNER excludes customer churn while the net retention rate does take into account customer churn (i.e. customers lost)\n   * **Annual revenue retention rate -** 99%, meaning Fastly lost just 1% of customers (obviously very good)\n* In its latest quarter, Fastly’s DBNER and NRRs showed to be on a slight decline due to the company’s own incredibly high standards, but still this is a bit worrisome to investors\n* Valuation\n   * At its share price around $73-$74, Fastly is currently trading at a \\~23X 2022 sales multiple, which at a \\~40% growth rate is very attractive given the current environment\n   * Company has been hit hard recently because of potential loss of TikTok as a customer (this is something still looming over the company’s head and in the latest call, management didn’t really confirm or deny anything) and relatively soft guidance of $375mm-$385mm for 2021, which represents a 30% growth rate ($291mm for 2020 revenue)\n      * In my view, I think management is doing a good job being conservative and in the long-run, investors will be pleasantly surprised with Fastly’s growth as long as the company can execute on its Compute@Edge and Secure@Edge products\n\n**Resources Used**\n\n* [Software Stack Investing](https://softwarestackinvesting.com/tag/fsly/) **-** This blog is a godsend. SO much great information for a lot of top tech companies. Pretty dense to read through but this was a source for a lot of my DD post\n* [Q4 2020 results](https://investors.fastly.com/files/doc_financials/2020/q4/4Q20-Shareholder-Letter.pdf)\n* [Earnings transcript](https://investors.fastly.com/files/doc_financials/2020/q4/Fastly-q4-2020-earnings-call-transcript.pdf)\n\n**TLDR:** Fastly is a leader in the CDN and edge computing space with 2 innovative products (Compute@Edge and Secure@Edge) that could be strong growth drivers for years to come (given strong execution). The company is boasting strong growth and has been a victim of its own success but is trading at relatively reasonably multiples for a leading software company. ",
        "subreddit": "stocks",
        "title": "Fastly (FSLY) Full Due Diligence Post - Promising Company at Relatively Fair Valuation",
        "url": "https://www.reddit.com/r/stocks/comments/lw5xoa/fastly_fsly_full_due_diligence_post_promising/",
        "created": 1614731078.0
    },
    {
        "author": "whereismynut",
        "created_utc": 1614715571,
        "id": "lwb7id",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " You may be seeing that this company is down today but I believe that because the hype from the recent boom is blowing over. I have some updated comments from users below so give them credit.  \n\n**PLEASE BE AWARE OF FEES FROM FIDELITY AND OTHER BROKERAGES.** ETrade currently has a 5 dollar fee. (fair imo) (just trying to be transparent from what I read up on recently.)\n\n&amp;#x200B;\n\nbasically, copy and paste of  recently published end of Quarter Highlights and my previous post from last week.\n\n&gt;• \t $1.6m Mooring Tensioner project led by Carnegie awarded funding by  Blue  Economy Cooperative Research Centre and formally commences with  project  partner  \n•\tHewlett Packard  Enterprise Company  (HPE) and Carnegie sign Collaboration Agreement to  develop reinforcement  learning-based controller for CETO and commence  work  \n•\tMicrosoft awards Carnegie  with an AI for Earth grant providing  computational resources and  support for a project to enhance Carnegie’s  Wave Predictor   \n• \tOceantera, a southeast Asian  project developer, and Carnegie sign  Collaboration Agreement to explore  potential projects in SE Asia and  share knowledge and expertise  \n•\t Hydrogen opportunities explored and further knowledge developed  through  ongoing internal investigations and via industry relationships  \n• \tGarden Island Microgrid resumes operation following temporary   disconnection required for Department of Defence’s own electrical   upgrades  \n•\tEuropean Commission  releases new EU  Strategy on Offshore Renewable Energy supporting a  vision of at least  1000 MW of ocean energy by 2030 and 60 GW by 2050\n\nI encourage you guys to read their quarterly report.\n\n[https://www.carnegiece.com/portfolio/quarterly-activities-report-4/](https://www.carnegiece.com/portfolio/quarterly-activities-report-4/)\n\nthey're  investing to integrate their technology, reduce costs on their own  tech, and on creating energy. (that's my own understanding.) for  example,\n\n&gt;Hydrogen  opportunities were investigated during the quarter and continue with a  growing interest in the space from industry and government. The  synergies between wave energy and hydrogen production strengthen  productionstrengthen the case and Carnegie has been particularly focused  on opportunities that encompass existing target markets such as  islands,  remote areas, and marine energy consumers including fish  farming. In parallel, enabling technologies are being developed by a  variety of companies that are complementary to Carnegie’s activities.   For example, electrolyzers,  the  devices  that  produce  hydrogen  from   water and  electricity,  are being developed can now use seawater as  their hydrogen source rather than freshwater  \nHydrogen   is most likely to play a  role as long/medium-term storage or as a   fuel source for vessels and generators. Carnegie’s role in the Blue  Economy CRCis providing good insight into the topic of hydrogen in the  marine space and opportunities will continue to be identified.\n\nthis  is basically a long-term play and they will specify it in there as  well. Imo I see the demand for renewable energy. I feel like there will  be heavy reform on how Companies and consumers use energy in the  following 50 years. they specify that in the report.\n\n&gt;Carnegie  continues to seegrowing vision and support for offshore renewables  around the world as demonstrated by actions such as the European  Commission publishing a dedicated EU strategy on offshore renewable  energyin November 2020(An EU Strategy to harness thepotential  of   offshore  renewable  energy  for  a  climate  neutral  future). The EU’s  strategysupports an objective of achievingat least1 GW of ocean energy  by 2030 and 60 GW of oceanenergy  by  2050.  It  alsoproposes  a   strategyto  make  offshore  renewable  energy  a  corecomponent of  Europe’s energy system by 2050.In  the  US,the  new  President  has   significantly  elevated  the  issue  of  climate  change  withrenewed   commitment  to  the  Paris  Agreement.  Carnegie  sees  this  as  highly   positive  andexpects support measures for marine renewables to  increaseas a result\n\nThey  basically go on about all the collab theyre making with the companies  listed above and the fundings they're getting and how the tech works.  Check it out. This isn't financial advice.\n\ntdlr long play at a good price. long term potential.\n\nEdits: add info and fix errors. Price updates\n\n2/26/21-  0.0069+0.0023 (+50.00%)\n\n3/1/21- 0.0072 0.0002 (+2.86%)\n\nuser feed back.\n\n u/[Art-of-Intuition](https://www.reddit.com/user/Art-of-Intuition/) \\-   \n\nFocusing on the technical resource  within the U.S. exclusive economic zone that can be harnessed for  large-scale (megawatt- to gigawatt-scale) energy generation, the report  found that the total marine energy resource in the 50 states amounts to  2,300 TWh/yr – equivalent to approximately 57% of U.S. generation in  2019.\n\n[https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/](https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/)\n\nWave  energy potential is massive! With all the millions of EVs coming online  in the next several years the world will need to quickly generate more  energy and marine energy will have to be a big part of that plan.\n\nCarnegie  has hundreds of patents the reason HPE, Microsoft, and Enel Energy are  partnering with them is for the intellectual property. Carnegie’s long  term plan is to license their wave technology to a larger company ( i.e.  Siemens, GE etc.) this is a long play 2-3 years from now. Buy and hold!\n\n u/[GoingRamboMCAT](https://www.reddit.com/user/GoingRamboMCAT/) \\-  In 100k shares here, incredible partnerships w/ Hewlett-Packard and  Microsoft. Defense contracts, government support, and licensure deals in  play. Ton of potential here! In for the long-haul. \n\n u/[leavemealone559](https://www.reddit.com/user/leavemealone559/) \\-  Bought 3k shares for 10 dollars yesterday thru Fidelity and after I  bought I check my positions and I’m like wtf how am I negative $50  already !? Foreign stock transfer fees :( now It has to hit .02 before I  can break even lmao \n\n u/[Fourfourfourfour44](https://www.reddit.com/user/Fourfourfourfour44/) \\-  12 billion shares outstanding :(",
        "subreddit": "pennystocks",
        "title": "CARNEGIE CLEAN ENERGY LTD SHS 0.0055 -0.0006 (-10.06%) - Why now you should buy and hold for a long-term investment.",
        "url": "https://www.reddit.com/r/pennystocks/comments/lwb7id/carnegie_clean_energy_ltd_shs_00055_00006_1006/",
        "created": 1614744371.0
    },
    {
        "author": "DuckCedarPotato",
        "created_utc": 1614810857,
        "id": "lx66zq",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Discovery is up over 100% in the past few months and I see hardly anything about it online (except for things like \\[this \"thinkpiece\"\\]([https://www.theverge.com/2021/3/1/22307034/discovery-plus-ambient-tv-hgtv-food-tlc-house-hunters-90-day-fiance-diners-driveins-dives](https://www.theverge.com/2021/3/1/22307034/discovery-plus-ambient-tv-hgtv-food-tlc-house-hunters-90-day-fiance-diners-driveins-dives)). There're like three posts on this sub with &gt;50 upvotes, but otherwise its just crazy to me that a company can have this massive of a change in stock price with basically nobody talking about it online (I could be blind but it's nowhere I've looked). Maybe its on CNBC?? I avoid that channel like the plague so I wouldn't know. It was up another 4% today. Any reason? Nope. Just another day on the Discovery Channel.\n\nIt could be that \"HURR DURR STREAMING MARKET SATURATED,\" but Discovery's shows are super cheap to produce, plus it has a huge catalog of content people fuckin love to watch. They don't need to break the bank making prestige stuff or pay expensive licensing fees, they just keep cranking out awesome garbage. The company still has a low PE ratio compared to anything else nowadays too. Oh also it has some random Burry stuff going on and that seems like it works out alot.\n\n&amp;#x200B;\n\nTL:DR: I bought in at the peak and I'm up 20% but I'm gonna hold until HGTV prints me a house. I wrote this so I could tell a Wendy's about my gambling problem.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zzkyfurd4wk61.png?width=851&amp;format=png&amp;auto=webp&amp;s=28e1aa6fca4e9603a7e629145f3e9336f536a32c\n\nPositions: ING; DIS; MSFT; DISCA",
        "subreddit": "wallstreetbets",
        "title": "Discovery+ gonna get me a home makeover",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx66zq/discovery_gonna_get_me_a_home_makeover/",
        "created": 1614839657.0
    },
    {
        "author": "JavveTBDer",
        "created_utc": 1614856287,
        "id": "lxi6c0",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "CD Projekt has lost about 50% from the top because of the terrible launch of Cyberpunk 2077 and a hack. But let’s look at what has actually happened. \n\n**You will find a TL DR at the bottom.**\n\n &amp;nbsp;\n\n**Sales of Cyberpunk 2077**\n\nSure the game was buggy as hell on release and Sony is yet to put it back on its stores (you can still buy the physical copy) but the PC + Xbox version sold well even after refunds and it’s still selling on Xbox store. Also if you look at the independent PC reviews (not count the outlets that always give AAA games 10/10) it was still very well received so if they manage to fix the console version we could very well see the sales pick up for consoles.\n\nThe facts are that 12 days after launch they had sold over 13m copies of which 10.8m (80% coming from PC sales) was estimated to be digital, which would make it the largest digital launch ever. This is a big deal because digital sales earn them a much higher margin, for example steam takes 20%(+50m$ sales) while physical stores take 40-50%. These numbers include the first 8 days of refunds which arguably would be the lion’s share of total refunds.\n\nCurrently on Steam its still #20 of bestselling games (removing free to play and special offers), if you only look at games costing +30€ then its #7, #5 for +40€, in fact it was the bestselling game for 7 weeks in a row on Steam and it’s still selling for full price. On GOG.com its currently #2 and still full price. On Epic Store its #6 and full price, in other words the game is still selling well on PC and still going for full price. So the sales have not been bad in any way, its possible that’s it could have been even better than good, of course it could have been fucking stellar record breaking shit had they not released a buggy mess but still not bad sales in any way.\n\nSo let’s run some simple numbers and lets be very conservative, lest say they only sold standard editions and no €250 collectors editions. Let’s also say that as of today with refunds they only sold 12m digital and 3m physical copies. For retail let’s say the revenue split was 50% and for digital 25% (Steam 20%, GOG 0%, Epic 12%, Xbox 30%, PS 30%). This gives us €690m in revenue and that’s more than all revenues from 2012-2019 combined and that’s just for 3 months of Cyberpunk sales. This gives us a PE of roughly 7 as a worst case scenario.\n\nhttps://www.eurogamer.net/articles/2021-01-24-cyberpunk-2077-is-now-the-biggest-digital-game-launch-of-all-time\n\nhttps://www.cdprojekt.com/en/investors/regulatory-announcements/current-report-no-67-2020/\n\nhttps://www.pcgamesn.com/cyberpunk-2077/steam-top-seller-player-count\n\n &amp;nbsp;\n\n**The hack**\n\nSource code was stolen but that’s not a financial loss because a Witcher or Cyberpunk knockoff is not a substitute in any way. The hack has pushed back the second patch about 2 weeks so that’s 2 weeks of lost dev time, make that 2 months and its still not a big issue financially. Add another 4, 5 or 6 months of extra dev time for patches (due to buggy release) and we are still talking peanuts. Also remember it won’t be the full dev team working on patches, just a parts of the original team.\n\nLost trust and reputation loss has a minimal affect of future sales in this business. EA, Zenimax, UbiSoft, Activision to name a few have been shitting on gamers for a long time now with unfinished games riddled with micro transactions and gamers still come back every time for their fix. FOMO is too great.\n\n &amp;nbsp;\n\n**The hidden gem**\n\nNow let’s look at what’s actually in front of us and that is something I believe many have missed. I’m sure most that follow the stock knows about the Witcher Netflix series and the Witcher mobile game, by them self’s they are alright but together they could be explosive.\n\nThe Witcher Netflix series was a fucking successes and the next season is almost done and will be released this year. The first season also boosted sales of the PC games. Its production is independent of the game studio so it won’t be affected by it. \n\nThe Witcher mobile game being developed by a separate studio from the one working on PC/Console so once again not affected by Cyberpunk problems. The game is basically a Pokemon Go copy and it has been in open beta for 6 months. The reviews on app store are very good, 4.5 and version 0.9 was released a month ago. They released the beta on version 0.6 and they got to 0.9 in 5 months so I think the game is basically done and they are just waiting for the right timing to release it.\n\nhttps://apps.apple.com/nz/app/the-witcher-monster-slayer/id1509704647\n\nI believe their strategy is for a simultaneous launch or maybe a week or two apart, hoping that the series popularity will bring tons of players to the mobile game and mobile games like that make filthy amounts  money, it won’t make Pokemon Go money  but even a small amount of that would be filthy amounts. \n\nOne could however look at another AR game connected to a popular franchise, namely Harry Potter and say that it wasn’t popular why should this one be? Well to start of that game missed its timing as it was released far after the franchises popularity peak. Secondly I would argue that a larger base of the Witcher fans are gamers compared to Harry Potter fans. Thirdly that game was aggressively monetized and CD Projekt are known to take it easy on monetization which is more profitable in the long run.\n\n &amp;nbsp;\n\n**M&amp;A**\n\nA third thing worth mentioning is the increasing amounts of M&amp;A happening in this segment and CD Projekt is juicy target, it is almost the only large studio left that has not been acquired as a whole or in part by any of the large players, almost all other large studios have either been acquired or have large shareholder like for example Tencent. Possible buyers could be Amazon or Google, they have both been trying to get into the gaming industry and failed with their in-house efforts. Other buyers are any of the large Chinese players and even Sony after Microsoft bought Zenimax to protect Playstation from Xbox, but this one is a bit of a long shot now that Sony is a bit pissed of at CD Projekt.\n\n &amp;nbsp;\n\n**So whats the price target?** \n\nWell the top was not fair value but this bottom sure as hell is not. I feel based on the known revenue from Cyberpunk and the estimated sales based on bestseller ranking we can assume that it is bringing in good money and will continue to do so for the coming years also we must account for some delays for upcoming projects. But all in all I feel a drop of 20-30% would have been fair not the 50% we have seen. So yesterday it closed at 228 down from a top of roughly 450 and my target is somewhere between 300-350.\n\n &amp;nbsp;\n\n**TL DR**\n\nBased on available data, sales are not a fail, more than all the revenue combined from 2012-2019 on very conservative estimates, it gives us a PE of roughly 7 for just 3 months worth of Cyberpunk sales.\n\nThe Hack has limited financial impact, a month of dev time.\n\nLost dev time for fixing Cyberpunk is also of limited financial impact even if its 9 months as it will not be the entire dev team for all that time.\n\nThe combination of Netflix The Witcher Season 2 and the mobile game The Wither Monster Hunt has the possibility to be a fat cash cow.\n\nAn increased chance as of late to be acquired in part or as a whole by large conglomerates.\n\nPrice target of 300-350, now trading at 230",
        "subreddit": "wallstreetbets",
        "title": "Fellow Apes, Retards and other Degenerates may I have your attention please! OTGLY/CDR",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxi6c0/fellow_apes_retards_and_other_degenerates_may_i/",
        "created": 1614885087.0
    },
    {
        "author": "ticklemypicklesir",
        "created_utc": 1615216628,
        "id": "m0hty5",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SPACs",
        "title": "Microsoft will be supporting Paysafe’s strategic move to cloud-based transaction services! $BFT",
        "url": "https://i.redd.it/a2h2lvgsmtl61.jpg",
        "created": 1615245428.0
    },
    {
        "author": "gooserayos",
        "created_utc": 1614817474,
        "id": "lx8dm5",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I know I'm late to the party but I want to add my 2 cents. Also, I know this isn't GME, AMC, RKT but f\\*\\*k it.\n\n\\### Introduction:\n\nTanger Factory Outlet Centers is a leading operator of open-air upscale outlet shopping centers that owns, or has an ownership interest in, a portfolio of 38 centers. Tanger's operating properties are located in 20 states and in Canada, totaling approximately 14.1 million square feet, leased to over 2,700 stores operated by more than 500 different brand name companies. The Company has more than 39 years of experience in the outlet industry and is a publicly-traded REIT. Tanger is furnishing a Form 8-K with the Securities and Exchange Commission (\"SEC\") that includes a supplemental information package for the quarter ended September 30, 2020.\n\n\\### Why is it an amazing opportunity?\n\nI believe there are several catalysts that make SKT great.\n\n1)Texas and others are starting to re-open. Covid has affected business for SKT in 2020, but Texas has just announced they are reopening and lifting the mask requirement. Other states and cities are following. This is great for business for Tanger.\n\n[https://www.nytimes.com/2021/03/02/us/coronavirus-reopening-texas.html](https://www.nytimes.com/2021/03/02/us/coronavirus-reopening-texas.html)\n\n2) SKT is heavily shorted. There is data from multiple sources showing various amounts of short interest, but one thing is for certain; SKT is heavily shorted. Short sellers think they have dodged a bullet for now, but if we work together we can make this squeeze.\n\n[https://seekingalpha.com/article/4401937-reits-getting-short-squeezed](https://seekingalpha.com/article/4401937-reits-getting-short-squeezed)\n\n[https://www.fool.com/investing/2021/02/25/1-real-estate-stock-with-even-higher-short-interes/](https://www.fool.com/investing/2021/02/25/1-real-estate-stock-with-even-higher-short-interes/)\n\n3) Positive news in latest earnings report. Under the operational updates section, they stated that over 99% of total occupied stores are open as of January 31, 2021. The trend followed throughout the year goes as followed.\n\nApril = 1% --&gt; May =18% --&gt; June = 56% --&gt; July 95% --&gt; January 2021 = &gt;99%\n\nAs you can see, SKT is back to fully operational as mandates were lifted throughout the year.\n\nIn addition to being fully operational now, they also managed to beat estimates for Q3 and Q4 of 2020 even with the Covid pandemic happening. This is an amazing feat and shows the company is resilient and is run properly.\n\n[https://s25.q4cdn.com/152538475/files/Earnings\\_Upload/Q42020/Q4-2020-PRESENTATION-FINAL.pdf](https://s25.q4cdn.com/152538475/files/Earnings_Upload/Q42020/Q4-2020-PRESENTATION-FINAL.pdf)\n\n4) Small market cap. SKT's market cap is 1.5B. In terms of \"moving the needle\" for a potential squeeze this is great news! I like the stock, but I also hope that you like it too.\n\n5) Excellent dividend returns. $SKT pays an excellent dividend per share. Currently it's paying .71 a share which is 4.41% returns at it's current price just for holding shares! For comparison, Qualcomm and Microsoft are known to be good dividend stocks, but they only pay out 1.9% and .96% per share respectively.\n\nConclusion:\n\nI bought in late today. We'll see how it goes, but I do truly believe this can be a great play. If RKT can do what it did with a 50B dollar market cap, I would love to see what a \"squeeze\" would look like with a company at 1.5B.",
        "subreddit": "Wallstreetbetsnew",
        "title": "$SKT (Tanger Outlet Malls) DD - Amazing Opportunity",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lx8dm5/skt_tanger_outlet_malls_dd_amazing_opportunity/",
        "created": 1614846274.0
    },
    {
        "author": "preciouscode96",
        "created_utc": 1614938337,
        "id": "ly8nz0",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "In these last few days or weeks we've seen a big decline in stocks especially tech stocks. I've also noticed most renewable energy stocks went down quite a lot (I know they're still up in the year though). \n\nWith the world needing sustainable/renewable energy to survive it would be a great buy right now for the long term wouldn't it?\n\nThat's where my question is. I'm reading a lot about Apple, Microsoft and other tech companies and I know they also benefit from working or producing environmental friendly but I barely hear anyone about the energy stocks or ETF's. Why is this? Am I missing something? You'd think they have great potential for the future as this is the future, wether it's nuclear power, solar energy, wind energy or something else. \n\nI'd love a discussion about this topic since I kinda miss it on this sub, seen some discussions about it but not many.\n\nPardon my English by the way, just a curious redditor :).",
        "subreddit": "stocks",
        "title": "Let's talk about sustainable energy and why it feels like not many people are considering it.",
        "url": "https://www.reddit.com/r/stocks/comments/ly8nz0/lets_talk_about_sustainable_energy_and_why_it/",
        "created": 1614967137.0
    },
    {
        "author": "rampantiguana",
        "created_utc": 1614883340,
        "id": "lxrvkl",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Perhaps this “correction” is applicable to much of the green energy sector, speculative tech, EVs, meme stocks, etc, but a lot of blue chip retail/tech stocks have departed a pretty long ways from their all time highs. Amazon is under 3k and analysts consensus indicates at least a 10% upside in the next 12 months, the same can be said for Costco, Microsoft, Target etc. \nDo you guys think these price targets still hold? Is now actually a good time to “buy the dip” or will their be significantly more downside (akin to last March) before we see a rebound in tech?\nOr, did COVID-style investing also put these blue chip stocks into a kind of mini-bubble, and should we not touch them until they return to pre covid prices?",
        "subreddit": "stocks",
        "title": "Large Cap, Blue Chip Stocks on sale?",
        "url": "https://www.reddit.com/r/stocks/comments/lxrvkl/large_cap_blue_chip_stocks_on_sale/",
        "created": 1614912140.0
    },
    {
        "author": "preciouscode96",
        "created_utc": 1614938247,
        "id": "ly8nc1",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "In these last few days or weeks we've seen a big decline in stocks especially tech stocks. I've also noticed most renewable energy stocks went down quite a lot (I know they're still up in the year though). \n\nWith the world needing sustainable/renewable energy to survive it would be a great buy right now for the long term wouldn't it?\n\nThat's where my question is. I'm reading a lot about Apple, Microsoft and other tech companies and I know they also benefit from working or producing environmental friendly but I barely hear anyone about the energy stocks or ETF's. Why is this? Am I missing something? You'd think they have great potential for the future as this is the future, wether it's nuclear power, solar energy, wind energy or something else. \n\nPardon my English by the way, just a curious redditor :).",
        "subreddit": "StockMarket",
        "title": "Why does it feel like nobody is buying sustainable energy stocks/ETF's?",
        "url": "https://www.reddit.com/r/StockMarket/comments/ly8nc1/why_does_it_feel_like_nobody_is_buying/",
        "created": 1614967047.0
    },
    {
        "author": "RagingHomo_Sapiens",
        "created_utc": 1614904169,
        "id": "lxzmr2",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I get it, we're going through some down period and everything will be back up, eventually.\n\nMany posts and comments here said \"Buy the dip, now it's the time.\"\n\n\nBut what about 401k investments. \n\nI use TransAmerica, and I cannot see any \"cost basis\". All I see is money in the funds I choose.\n\nDoes this mean when my contribution is being invested in the funds at whatever current price of the underlying securities?\n\n\nExample one of the funds I chose is Vanguard Total Stock Market Index Ret Acct and I can see the top holdings are Apple, MSFT etc.. \n\n\nHow do I know that money is being invested at current market value (SPY now @376 and not SaPY 2 weeks ago @391)\n\nEdit: I'm not asking about the return amount. I'm asking if I invest in spy-like account. how do i know they're using current market account NOW and not from 2-3 weeks ago",
        "subreddit": "stocks",
        "title": "How is the recent dipping affecting 401k investments",
        "url": "https://www.reddit.com/r/stocks/comments/lxzmr2/how_is_the_recent_dipping_affecting_401k/",
        "created": 1614932969.0
    },
    {
        "author": "youngbudding",
        "created_utc": 1614906192,
        "id": "ly09iy",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "They would branch into the real tech with microsoft and put together an inclusive interface for online currencies (ocs) to serve as both a wallet and a market. The  world is obviously lacking user friendly and secure software to facilitate the transition from fiat to ocs and that (I believe) is exactly why ocs are more of a commodity than a currency right now. The minute it all can be accessed through a secure network, the ocs that stand the test of time will have the potential to turn into the all inclusive tool we know they can be. \nI posted this to hopefully plant a seed in them or anyone else with the ability to create such an interface. I am not a professional. I may be late to the idea. This is not financial advice. I shit whatever colors I had for dinner. (It's always the red ones.)\n\nTL;DR: Gamestop, make a wallet. And I'm retarded.",
        "subreddit": "wallstreetbets",
        "title": "If Gamestop wanted to actually be worth what it's going for",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ly09iy/if_gamestop_wanted_to_actually_be_worth_what_its/",
        "created": 1614934992.0
    },
    {
        "author": "donluc007",
        "created_utc": 1615222276,
        "id": "m0jzs4",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Hi traders and investors,\n\n&amp;#x200B;\n\nI guess I'm gone start with disclosure, I hold NIO, TSLA, sold CRSR, AAPL, API, MSFT; majority in NIO and TSLA, holding &gt;12400 stocks of NIO, having majority bought in the range of 10-20$/share.\n\nI got here since I was super close to monitoring what people say on social media about stocks, next to adding my own DD on it.\n\nMyself and u/Superman701 have build this app which allows us all to spot hype in discussed stocks. Here you go. These are top 15 stocks being discussed on r/stocks in last 24 hours. \n\nI am now even more encouraged to see NIO rising back to 66.99! Haha\n\n    Rank\tMarket\tTicker\tChange  Total   Posts   Upvotes Comments\n                            Hype\tHype\t\t\t\t\n    1\tNASDAQ\tTSLA \t38%\t1018\t2\t450\t110\n    2\tNYSE\tNIO\t66%\t915\t4\t209\t481\n    3\tNASDAQ\tCRSR\t65%\t850\t2\t196\t450\n    4\tNASDAQ\tCRWD\t64%\t819\t1\t188\t439\n    4\tNYSE\tPINS\t64%\t819\t1\t188\t439\n    4\tNYSE\tLMND\t64%\t819\t1\t188\t439\n    7\tNYSE\tGME\t87%\t497\t8\t138\t189\n    8\tNASDAQ\tAAPL\t69%\t200\t3\t32\t124\n    9\tNASDAQ\tAPI\t90%\t178\t2\t74\t22\n    10\tNYSE\tFICO\t100%\t161\t1\t72\t13\n    11\tNASDAQ\tMSFT\t69%\t158\t2\t27\t96\n    12\tNASDAQ\tTTD\t100%\t155\t1\t61\t29\n    13\tNYSE\tAMC\t51%\t124\t2\t32\t52\n    14\tNASDAQ\tENPH\t54%\t118\t1\t43\t28\n    15\tNYSE\tHOME\t100%\t109\t1\t14\t77",
        "subreddit": "stocks",
        "title": "Top stocks in discussion in r/stocks subreddit in last 24 hrs.",
        "url": "https://www.reddit.com/r/stocks/comments/m0jzs4/top_stocks_in_discussion_in_rstocks_subreddit_in/",
        "created": 1615251076.0
    },
    {
        "author": "JustCantGoTitsUp",
        "created_utc": 1614714263,
        "id": "lwaq49",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I’m 21 and I’m very enthusiastic with MSFT currently it’s the biggest holding in my portfolio and honestly I love the management. \n\nMy only question is, with my age in consideration, around how many years (do you estimate) will MSFT be on top of the/it’s game? \n\nI don’t want to butcher an attempt on spelling his name but for me, as long at the current CEO is running it, I’m in",
        "subreddit": "stocks",
        "title": "How long of a hold is MSFT?",
        "url": "https://www.reddit.com/r/stocks/comments/lwaq49/how_long_of_a_hold_is_msft/",
        "created": 1614743063.0
    },
    {
        "author": "Wuby123",
        "created_utc": 1614825594,
        "id": "lxaoyz",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "If a stock, Microsoft ($MSFT) for example, goes down in price. Lets say from 225 to 160 over the next year. But the company increases their profits over the year. Are they likely to increase their dividend? I basically want to know, if stocks go down, but profits increase, will dividends go up as a result?",
        "subreddit": "stocks",
        "title": "Question about Dividends, Share Price, and Profits",
        "url": "https://www.reddit.com/r/stocks/comments/lxaoyz/question_about_dividends_share_price_and_profits/",
        "created": 1614854394.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1614793616,
        "id": "lwzt2s",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "i have a heavy tech weighted portfolio and while I'm not overly worried I'm wondering if I should be adding JPM and BAC and more industrials to my portfolio or maybe even just adding to my Total Market index.\n\nI realize people are running scared from tech now due to various reasons and the rising 10 yr.\n\nI'm in it though for at least 10 years or more.  Should I be worried about tech and chasing recent market rotations?  I thought that wasn't the thing to do? I feel like I'd be betraying my tech 😆!!  Just joking.\n\nI also see that on average banks and industrials have been rather bad performers for over a decade.\n\nI realize they're \"beat up\", but why would people be moving their money into banks if they don't return much??\n\nIs it that they \"have no where else to put their money\" when rotating from tech?\n\nI realize also it's mostly the big money or smart money that moves the market and not small timers like me.\n\nSo should I just hold my tech?\n\nI'm not just tech though, I'm diversified.\n\nHere are some holdings for example.\n\nIndexes about 18% of portfolio combined\n\n FSKAX AARK VTWG FDIS FSPTX\n\n\nStocks. About up to 5% each\n\nAAPL MSFT make up 18% combined.\n\nUp to 5% each. \n\nCRWD HON NEE NVDA SQ PYPL TSLA UNP AVGO ASML LRCX TMO UNH TSM DG WMT",
        "subreddit": "stocks",
        "title": "Should you chase financials and industrials, etc?",
        "url": "https://www.reddit.com/r/stocks/comments/lwzt2s/should_you_chase_financials_and_industrials_etc/",
        "created": 1614822416.0
    },
    {
        "author": "CryptoKn1ght007",
        "created_utc": 1614711382,
        "id": "lw9mt3",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Ford:\nFord’s plan to invest in EVs and self-driving cars rose to $29 billion, including $22 billion for EVs through 2025. \n\nFord and Alphabet (NASDAQ: GOOGL are entering a six-year deal that will make the tech giant responsible for much of Ford’s growing in-vehicle connectivity. This partnership is designed to streamline Ford’s operations and accelerate an ongoing $11 billion restructuring plan. \n\nGeneral Motors:\n\nGeneral Motors announced that it plans to invest $27 billion in EV and autonomous vehicles through 2025. The company also mentioned that it plans to release 30 EV models globally by 2025.\n\nThe company has partnered with Microsoft (NASDAQ: MSFT in leading a $2 billion investment round in self-driving car startup Cruise LLC.\n\nDifference:\nFord is going with Google and General Motors is going with Microsoft. \n\nGoogle has 14 Automotive startup investments and Acquisitions.\n\nMicrosoft only has investments in 4 automotive startups.\n\nThis will help Ford and General Motors in the following areas:\n\n- Autonomous driving technology.\n- Connected car tech &amp; fleet management.\n- Electric vehicle technology.\n- Automotive retail.\n- Mobility-as-a-service &amp; shared mobility.\n\nWho wins?\nIn this situation Ford has the better outlook, Google with 14 different Automotive startups to do its project development for Ford, also Google has access to Android and will give Ford the ability to integrate mobile connectivity to their cars.\n\nI will keep buying Ford, because of the potential technology integration. Also I really like the stock.\n\nDisclaimer: I am not a financial advisor and none of the above should be construed as financial advice.",
        "subreddit": "wallstreetbets",
        "title": "Electric Vehicles: Ford Vs. General Motors",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw9mt3/electric_vehicles_ford_vs_general_motors/",
        "created": 1614740182.0
    },
    {
        "author": "Graham-Dodder",
        "created_utc": 1614826934,
        "id": "lxb39r",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "\n\nQuoteMedia Inc. provides financial data, news feeds, market research information and financial software solutions to online brokerages, clearing firms, banks, financial service companies, media portals and public corporations. \n\nQuoteMedia's software is used by companies like Blackberry, Microsoft, Nasdaq, and the Toronto Stock exchange. Check out this [link](https://www.quotemedia.com/corp/testimonials/) to see client testimonials on how much companies like using QuoteMedia's services. \n\nThey are also currently expanding and improving their business. In 2020 they launched a new QuoteMedia marketplace, a new options and stock trading analytics platform, and a new wealth management module. They also signed new contracts with companies such as Comtex and [Stockmarket.com](https://Stockmarket.com)\n\nThe current share structure is insane. \n\n* 90.48 Million shares outstanding, one of the lowest I've ever seen on an OTC stock\n* Float of only 48.05 Million\n* Insiders own over 40%\n\nI am extremely bullish on this stock and will probably hold it for a few years because I think they have the opportunity to experience huge growth. Also, last time DD got posted on QMCI it went from around .19 to .45 in around 20 minutes and has since settled down to around .23 so if you're looking for a short term flip this is probably a good option, although personally I will be holding this for the long haul.",
        "subreddit": "pennystocks",
        "title": "Low Float $QMCI about to pop off. Cash flow positive, Microsoft, BB, and more. Repost of a great u/punishedmedlock post",
        "url": "https://www.reddit.com/r/pennystocks/comments/lxb39r/low_float_qmci_about_to_pop_off_cash_flow/",
        "created": 1614855734.0
    },
    {
        "author": "hollenb1",
        "created_utc": 1614895321,
        "id": "lxwmwp",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "The leader in Haptic Feedback technology. Too much in the works to ignore. 5 partnerships in recent months are not reflected in this earnings report (Faurecia, Woory Industrial, Abtivan, SenseArena, StrikerVR). There are still big things coming. Not to mention being named a Top Global Innovator two years in a row by Clarivate. Potential further partnership with Sony coming on the newly patented PS5VR controller as well as discussions with Microsoft regarding a licensing deal.\n\nEdit: As always, do your own DD but I believe this to be a great longterm investment and you can still get in before it takes off. It's currently $10.25/share",
        "subreddit": "stocks",
        "title": "$IMMR announces a $.15 beat on EPS and a beat on revenue",
        "url": "https://www.reddit.com/r/stocks/comments/lxwmwp/immr_announces_a_15_beat_on_eps_and_a_beat_on/",
        "created": 1614924121.0
    },
    {
        "author": "XC-RANCH",
        "created_utc": 1614812563,
        "id": "lx6rok",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$MSFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx6rok/msft/",
        "created": 1614841363.0
    },
    {
        "author": "TheMarketBuzz",
        "created_utc": 1615226010,
        "id": "m0lhgl",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "The last week has been eventful for the stock market. Stocks recovered from the initial bond scare and Monday saw the S&amp;P 500 have its best day since June.\n\nThe US continues to roll out its vaccine, but with Canada lagging in comparison, experts predict that the delay will take its toll on our economy. That said, Canadian stocks continue to outperform US stocks in 2021.\n\nSo what are the hot stocks to invest in at the moment? The following companies have some of the most promising prospects—to buy for this week and hold for the future.\n\n&amp;#x200B;\n\nMicrosoft\n\nAlthough software OG Microsoft needs no introduction as a company, it does have some interesting new developments on the horizon. The third-largest cloud provider has announced its making its way into the electric vehicle (EV) market, recently signing a deal with Bosch to develop cloud-based software for vehicles.\n\nThe last year saw Microsoft impressively pivot to more cloud-based offerings, and since has seen its shares soar by 40%. As the software giant continues to gain market share of the cloud-based world, it has solid growth prospects for the future.\n\n&amp;#x200B;\n\nCharter Communications\n\nStocks of US broadband connectivity company Charter Communications have been up 22% over the past 12 months and it’s not hard to see why when you think about the amount of time everyone has spent online the past year.\n\nThe company, which is the second-largest cable operator in the US, provides video, internet, and voice services to approximately 31.1 million customers across the country. Last year, its customer base of internet users rose 8.5% year-over-year.\n\n&amp;#x200B;\n\nKirkland Lake Gold\n\nRumors have been speculating that the stock market is due for a correction or even crash this year. But if you’re worried about preserving capital over high-risk stocks, Kirkland Lake Gold is a great option.\n\nReasons to be bullish on the gold producer, which has operations in Canada and Australia, include the facts that it currently holds $850 million in cash, has a valuation that is 11 times its earnings, and a market cap of only $11 billion.\n\n&amp;#x200B;\n\nConstellation Software\n\nToronto-based software company Constellation Software was founded in 1996 by former venture capitalist Mark Leonard. The successful company acquires, manages, and builds industry-specific software businesses.\n\nConstellation’s acquisition-centric business model gives it a more diversified edge over its competitors, making stocks of the company popular with investors. Additionally, its track record of acquiring promising software companies at good prices continues to set the company up for high growth.\n\n&amp;#x200B;\n\nEnbridge\n\nAnother great pick for your portfolio at the moment is energy infrastructure giant, Enbridge. The company’s diversified business model makes it a key differentiator from competitors, being involved in both the high-growth renewable energy sector and pipeline industry.\n\nNeed more convincing? Enbridge’s pipeline is responsible for a massive 65% of all Canadian production and its sector is protected from volatility from oil prices. The company also has an alluring 7.56% dividend yield.",
        "subreddit": "Wallstreetbetsnew",
        "title": "While We All Hold GME To The Moon, Here Are A Few Stock That You Should Do DD On While The Tendies Print",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/m0lhgl/while_we_all_hold_gme_to_the_moon_here_are_a_few/",
        "created": 1615254810.0
    },
    {
        "author": "vaultboy1963",
        "created_utc": 1614796739,
        "id": "lx1177",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "First, I'm long on MSFT, with a cost basis of $51.53.  I'm trading in my smallish IRA that I use mostly for option trading...in fact, my MSFT holding are my sole stock holdings in that account as of now...that should change Friday as I am ITM on some stocks I want to start a wheel on.  \n\nI started the day holding a CC for 5Mar @ 237.50.  Early in the day, I was at almost 70% profit, so I rolled down to try to take advantage of collapse of MSFT today.  I rolled down into another 5Mar, this time at 235.  Since my original goal was to roll tomorrow to a 12Mar position, as soon as I hit 20% profit, I rolled out and down to 12Mar @ 232.50.  A position that already has gains.  \n\nSo far, I am up $400 on the day on the MSFT covered calls, and if it keeps dropping, maybe even more.  I probably could have made a little more had I been patient, but I'm happy with the day so far.",
        "subreddit": "options",
        "title": "A good day to roll MSFT down",
        "url": "https://www.reddit.com/r/options/comments/lx1177/a_good_day_to_roll_msft_down/",
        "created": 1614825539.0
    },
    {
        "author": "Graham-Dodder",
        "created_utc": 1614826784,
        "id": "lxb1kj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Low Float $QMCI about to pop off. Cash flow positive, Microsoft, BB, and more",
        "url": "https://www.reddit.com/r/investing/comments/lxb1kj/low_float_qmci_about_to_pop_off_cash_flow/",
        "created": 1614855584.0
    },
    {
        "author": "pabloseason",
        "created_utc": 1615132641,
        "id": "lztdxw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Young investor, looking to park some money away in safe place for a few years with some decent returns. My strictly stock portfolio possesses below holdings:\n\nCostco (25%)\n\nApple (25%)\n\nAmazon (15%)\n\nP&amp;G (10%)\n\nMcDonalds (7.5%)\n\nGoogle (5%)\n\nAlibaba (5%)\n\nPaypal (2.5%)\n\nMicrosoft (2.5%)\n\nBoeing (2.5%)\n\nWhich sectors does everyone think will outperform in the next 10 years? Many industry ETFs are at hot discounts right now\n\nI’ve allocated my ETF portfolio to below:\n\nHMCH: China ETF - 25%\n\nINRG: Clean Energy - 15%\n\nVUSA: S P 500 - 10%\n\nSKYY: Cloud Computing - 10%\n\nFLWR: Medical Cannabis - 10%\n\nISPY: Cyber Security - 10%\n\nRBOD: Automation and Robotics - 5%\n\nISWD: World Islamic - 5%\n\nDGIT: Digitalisation - 5%\n\nECAR: Electric Vehicles - 5%",
        "subreddit": "ValueInvesting",
        "title": "Long term investor",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/lztdxw/long_term_investor/",
        "created": 1615161441.0
    },
    {
        "author": "emoguynyc",
        "created_utc": 1615223792,
        "id": "m0klq5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "DAL - 8 \nNCHL- 347 \nSAVE - 209\nWMT - 15.1 (div stock)\nAPPL - 13.01 \nMSFT- 10\nT - 50\nmain - 32\nDKNG - 15\nSPG - 3  (div stock)\nDX - 52 shares \n\nBeen trading for 1 year, up 60 percent because of covid...what are your thoughts",
        "subreddit": "stocks",
        "title": "Thoughts? My portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/m0klq5/thoughts_my_portfolio/",
        "created": 1615252592.0
    },
    {
        "author": "Boogyman422",
        "created_utc": 1614917361,
        "id": "ly3n0e",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft, Chevron, Schlumberger😛😛😛",
        "url": "https://mobile.reuters.com/article/amp/idUSKBN2AW1UB",
        "created": 1614946161.0
    },
    {
        "author": "boringoldminer",
        "created_utc": 1614784814,
        "id": "lwwb0w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hopefully everyone continues to benefit from my last call on $TVE, $BTE, and $NVA. I continue to hold each and expect more upside.\n\nFor today, I want to share that **$QUIS** is extremely undervalued, I continue buying shares. The stock price has performed very well over the past number of months and I still think it can double again by spring.\n\n**Today's catalyst** is announcing a further Microsoft achievement, that Quisitive has gained access to Microsoft's sales team for its LedgerPay product: \n\n[http://www.globenewswire.com/news-release/2021/03/03/2186181/0/en/Quisitive-Achieves-Microsoft-Co-sell-Ready-Status-for-LedgerPay.html](http://www.globenewswire.com/news-release/2021/03/03/2186181/0/en/Quisitive-Achieves-Microsoft-Co-sell-Ready-Status-for-LedgerPay.html)\n\n**Quisitive (TSXV: QUIS)** is a premier Microsoft solutions provider that helps enterprises move, operate, and innovate in the Microsoft cloud: Microsoft Azure, Microsoft Dynamics, and Microsoft 365. \n\nQuisitive also provides proprietary SaaS solutions such as emPerformTM and LedgerPay that complement the Microsoft platform.\n\n**The next catalyst for Quisitive is announcing the name of the bank sponsorship for direct payments for LedgerPay.**\n\nQuisitive Technology Solutions Inc. (\"Quisitive\" or the \"Company\") (TSXV: QUIS), a premier Microsoft Solutions Provider, is pleased to announce that its LedgerPay unit has entered into a letter of intent (\"LOI\") with a major merchant acquiring bank as a sponsor for direct payment processing for Visa, Mastercard, and other major credit and debit card brands.\n\nAs the only payment processing platform solution that leverages the Microsoft Azure cloud, Quisitive's LedgerPay solution lets merchants securely process payments online and in-stores and provides unique insights into consumer behavior for brick-and-mortar retailers. The technology behind LedgerPay was developed internally by the Company and incorporates data collection and analysis with each payment transaction, ultimately enabling retailers to drive revenue while creating personalized loyalty at scale.\n\n[https://www.newswire.ca/news-releases/quisitive-s-ledgerpay-executes-loi-with-bank-sponsor-to-enable-payment-processing-846920703.html](https://www.newswire.ca/news-releases/quisitive-s-ledgerpay-executes-loi-with-bank-sponsor-to-enable-payment-processing-846920703.html)\n\nYou can learn all about the company and their incredible potential here:\n\n[https://www.quisitive.com/investor-relations/investor-resources/](https://www.quisitive.com/investor-relations/investor-resources/)",
        "subreddit": "StockMarket",
        "title": "$QUIS gains access to Microsoft’s sales team! $3 by spring likely",
        "url": "https://www.reddit.com/r/StockMarket/comments/lwwb0w/quis_gains_access_to_microsofts_sales_team_3_by/",
        "created": 1614813614.0
    },
    {
        "author": "RalphJamesCapital",
        "created_utc": 1614834346,
        "id": "lxd6mj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "BB the next MSFT?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxd6mj/bb_the_next_msft/",
        "created": 1614863146.0
    },
    {
        "author": "TheMarketBuzz",
        "created_utc": 1615227071,
        "id": "m0lwx9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " The last week has been eventful for the stock market. Stocks recovered from the initial bond scare and Monday saw the S&amp;P 500 have its best day since June.\n\nThe US continues to roll out its vaccine, but with Canada lagging in comparison, experts predict that the delay will take its toll on our economy. That said, Canadian stocks continue to outperform US stocks in 2021.\n\nSo what are the hot stocks to invest in at the moment? The following companies have some of the most promising prospects—to buy for this week and hold for the future.\n\nMicrosoft\n\nAlthough software OG Microsoft needs no introduction as a company, it does have some interesting new developments on the horizon. The third-largest cloud provider has announced its making its way into the electric vehicle (EV) market, recently signing a deal with Bosch to develop cloud-based software for vehicles.\n\nThe last year saw Microsoft impressively pivot to more cloud-based offerings, and since has seen its shares soar by 40%. As the software giant continues to gain market share of the cloud-based world, it has solid growth prospects for the future.\n\nCharter Communications\n\nStocks of US broadband connectivity company Charter Communications have been up 22% over the past 12 months and it’s not hard to see why when you think about the amount of time everyone has spent online the past year.\n\nThe company, which is the second-largest cable operator in the US, provides video, internet, and voice services to approximately 31.1 million customers across the country. Last year, its customer base of internet users rose 8.5% year-over-year.\n\nKirkland Lake Gold\n\nRumors have been speculating that the stock market is due for a correction or even crash this year. But if you’re worried about preserving capital over high-risk stocks, Kirkland Lake Gold is a great option.\n\nReasons to be bullish on the gold producer, which has operations in Canada and Australia, include the facts that it currently holds $850 million in cash, has a valuation that is 11 times its earnings, and a market cap of only $11 billion.\n\nConstellation Software\n\nToronto-based software company Constellation Software was founded in 1996 by former venture capitalist Mark Leonard. The successful company acquires, manages, and builds industry-specific software businesses.\n\nConstellation’s acquisition-centric business model gives it a more diversified edge over its competitors, making stocks of the company popular with investors. Additionally, its track record of acquiring promising software companies at good prices continues to set the company up for high growth.\n\nEnbridge\n\nAnother great pick for your portfolio at the moment is energy infrastructure giant, Enbridge. The company’s diversified business model makes it a key differentiator from competitors, being involved in both the high-growth renewable energy sector and pipeline industry.\n\nNeed more convincing? Enbridge’s pipeline is responsible for a massive 65% of all Canadian production and its sector is protected from volatility from oil prices. The company also has an alluring 7.56% dividend yield.",
        "subreddit": "StockMarket",
        "title": "Do Some DD On These Companies While Your GME Money Printer Goes BBRRRR",
        "url": "https://www.reddit.com/r/StockMarket/comments/m0lwx9/do_some_dd_on_these_companies_while_your_gme/",
        "created": 1615255871.0
    },
    {
        "author": "TheMarketBuzz",
        "created_utc": 1615226598,
        "id": "m0lq7c",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " The last week has been eventful for the stock market. Stocks recovered from the initial bond scare and Monday saw the S&amp;P 500 have its best day since June.\n\nThe US continues to roll out its vaccine, but with Canada lagging in comparison, experts predict that the delay will take its toll on our economy. That said, Canadian stocks continue to outperform US stocks in 2021.\n\nSo what are the hot stocks to invest in at the moment? The following companies have some of the most promising prospects—to buy for this week and hold for the future.\n\nMicrosoft\n\nAlthough software OG Microsoft needs no introduction as a company, it does have some interesting new developments on the horizon. The third-largest cloud provider has announced its making its way into the electric vehicle (EV) market, recently signing a deal with Bosch to develop cloud-based software for vehicles.\n\nThe last year saw Microsoft impressively pivot to more cloud-based offerings, and since has seen its shares soar by 40%. As the software giant continues to gain market share of the cloud-based world, it has solid growth prospects for the future.\n\nCharter Communications\n\nStocks of US broadband connectivity company Charter Communications have been up 22% over the past 12 months and it’s not hard to see why when you think about the amount of time everyone has spent online the past year.\n\nThe company, which is the second-largest cable operator in the US, provides video, internet, and voice services to approximately 31.1 million customers across the country. Last year, its customer base of internet users rose 8.5% year-over-year.\n\nKirkland Lake Gold\n\nRumors have been speculating that the stock market is due for a correction or even crash this year. But if you’re worried about preserving capital over high-risk stocks, Kirkland Lake Gold is a great option.\n\nReasons to be bullish on the gold producer, which has operations in Canada and Australia, include the facts that it currently holds $850 million in cash, has a valuation that is 11 times its earnings, and a market cap of only $11 billion.\n\nConstellation Software\n\nToronto-based software company Constellation Software was founded in 1996 by former venture capitalist Mark Leonard. The successful company acquires, manages, and builds industry-specific software businesses.\n\nConstellation’s acquisition-centric business model gives it a more diversified edge over its competitors, making stocks of the company popular with investors. Additionally, its track record of acquiring promising software companies at good prices continues to set the company up for high growth.\n\nEnbridge\n\nAnother great pick for your portfolio at the moment is energy infrastructure giant, Enbridge. The company’s diversified business model makes it a key differentiator from competitors, being involved in both the high-growth renewable energy sector and pipeline industry.\n\nNeed more convincing? Enbridge’s pipeline is responsible for a massive 65% of all Canadian production and its sector is protected from volatility from oil prices. The company also has an alluring 7.56% dividend yield.",
        "subreddit": "investing_discussion",
        "title": "Some Stocks To Do Research On (While You Hold GME And Pray For A Moon Landing)",
        "url": "https://www.reddit.com/r/investing_discussion/comments/m0lq7c/some_stocks_to_do_research_on_while_you_hold_gme/",
        "created": 1615255398.0
    },
    {
        "author": "tylrr343434",
        "created_utc": 1614706123,
        "id": "lw7jrk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "This is my portfolio. Does anyone have any suggestions or advice? \n\nMSFT - 15%\nSQ - 15% \nV - 12% \nSE - 12%\nApple - 12% \nCloudfare - 10%\nCostco - 10%\nNIO - 8% \nGE - 6%",
        "subreddit": "investing_discussion",
        "title": "Suggestions or advice?",
        "url": "https://www.reddit.com/r/investing_discussion/comments/lw7jrk/suggestions_or_advice/",
        "created": 1614734923.0
    },
    {
        "author": "_ii_",
        "created_utc": 1614706702,
        "id": "lw7s62",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "MSFT + BB = 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀",
        "url": "https://www.reddit.com/r/stocks/comments/lw7s62/msft_bb/",
        "created": 1614735502.0
    },
    {
        "author": "Sure-Ad7730",
        "created_utc": 1614878086,
        "id": "lxpqf5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Buy this dip in Apple, Microsoft and these other tech stocks before they’re out of reach, says analyst",
        "url": "https://www.marketwatch.com/story/buy-the-dip-with-apple-microsoft-and-these-other-tech-stocks-before-they-fly-way-higher-says-analyst-11614860585",
        "created": 1614906886.0
    },
    {
        "author": "CanadianInvestor98",
        "created_utc": 1614871899,
        "id": "lxn4f6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "GlobeX Data Ltd. (OTCQB:SWISF) (CSE:SWIS) (FRA:GDT), the leader in Swiss hosted secure communications and secure data management, is pleased announce that it is on track to launch a multi-currency platform for its Sekur secure communications solution in anticipation of a global mass market launch in April 2021. The launch caters to mass markets comprising of privacy enthusiasts and businesses looking for security and privacy not offered by other applications.\n\nGlobeX Data is on track to launch several new features on its [Sekur.com](https://sekur.com/)\n\nwebsite in order to launch its Sekur solution globally. The first launch, to be made in the US mass market, is on track to be completed before the end of this month. Additionally, the Company has decided to accelerate its global mass market roll out and is working on deploying multi-currency capabilities on its Sekur website, in addition to launching new plans such as SekurMessenger and SekurPro. Sekur will offer Messaging only, whereas Sekur offers secure messaging and secure email and SekurPro will offer voice and video conferencing in addition to secure email and messaging.\n\nIn order to satisfy local market requirements, GlobeX will launch plan offerings in the following currencies: USD, CAD, AUD, NZD, CHF, EUR and GBP. The global launch will start in April and in addition to marketing the Sekur solution in the USA, it will be launched in Canada, Australia, Switzerland, the EU market, the United Kingdom and New Zealand. Other markets will be launched in Asia and will be priced in USD. A plan to launch in japan sometime in late 2021 is also in the works, with full Japanese language and JPY currency plans.\n\nThe Company is targeting several million consumers and business executives globally, in search of a secure and private application for all their communications needs. GlobeX plans to first perform several small digital marketing tests and increase the scope of the marketing program once it has fine-tuned the message, in order to maximize its return on investment in the advertising budget.\n\nSekur, which includes SekurMessenger as part of a bundle of email, messaging and file transfer into one app solutions, includes the Company's latest SekurMail technology, which includes proprietary anti-phishing and privacy feature called SekurSend®. SekurSend® lets a user send an email to any other recipient, whether they have Sekur or not, in full privacy and security as the email never leaves Sekur's encrypted email servers based in Switzerland. The recipient can then click on the notification and reply in the same manner using SekurReply®, without the recipient having to register for a Sekur account. The sender can also decide to protect any email sent by adding a password to open it, a read-limit and a self-destruct timer as well. Sending an email with the SekurSend® feature allows the senders and recipients to add limitless size attachments to the emails without crowding the recipients' email box. This also eliminates BEC attacks for businesses and email phishing attacks. Additionally, SekurMail includes full control of email delivery, automatic data export for large Enterprises and an automatic Data Loss Prevention technology (\"DLP\") with real time continuous archiving.\n\nRecent data breaches in messaging applications and in particular in the WhatsApp application have created a certain urgency for businesses and data privacy advocates to protect their communications form cyber-attacks and identity theft via mobile and desktop devices.\n\nSekurMessenger eliminates many of the privacy and security risks by not only not requiring a phone number, which would divulge a user's phone device ID, but also by not social engineering a user's phone or computer contact list and infecting the contacts by default as well, eliminating a huge loophole in security and privacy. SekurMessenger issues each user a username and a SM number. The SM number is the contact ID a user would disclose in order for other SM users to be added. The service comes with a self-destruct timer and other features as well, including GlobeX's proprietary VirtualVaults and HeliX technologies with all data stored in Swiss hosted encrypted servers.\n\nAlain Ghiai, CEO of GlobeX Data said: \"We are very excited to get our direct to market launch in the USA this month and globally in Q2 2021. We plan to launch in a methodical and organized manner, as there is a myriad of details involved in launching a global platform for mass markets, among them being the language and currency a market converses and trades in. We already have our platform in English and Spanish, and we plan to add French, German and Portuguese in the coming months. There is a vast market for consumers, privacy enthusiasts and businesses globally and we intend to capture a large part of this market. We are putting the final touches and tutorial videos on the [Sekur.com](https://sekur.com/)\n\nsite and plan to add more to these in the other languages. As we are not connected, and never have been connected, to AWS, Microsoft Azure or Google Cloud platforms, commonly referred to as \"Big Tech\", we can offer a truly independent, private and secure means of communications through secure messaging, secure voice record transfer, secure voice and video conferencing, and secure email through our proprietary technology and our secure servers based in Switzerland. With security and privacy becoming a global concern, and the new WhatsApp rules to share all users' data with Facebook, we have seen an increase in demand and inquiries for our secure and private communications solutions in particular, and we plan on capitalizing on this demand as much as possible.\"\n\nGlobeX's Data privacy solutions are all hosted in Switzerland, protecting users' data from any outside data intrusion requests. In Switzerland, the right to privacy is guaranteed in article 13 of the Swiss Federal Constitution. The Federal Act on Data Protection (\"FADP\") of 19 June 1992 (in force since 1993) has set up a strict protection of privacy by prohibiting virtually any processing of personal data which is not expressly authorized by the data subjects. The protection is subject to the authority of the Federal Data Protection and Information Commissioner.\n\nUnder Swiss federal law, it is a crime to publish information based on leaked \"secret official discussions.\" In 2010 the Federal Supreme Court of Switzerland found that IP addresses are personal information and that under Swiss privacy laws they may not be used to track Internet usage without the knowledge of the individuals involved.\n\nDisclaimer: This is not investment advice, please do your own research!",
        "subreddit": "investing_discussion",
        "title": "GlobeX Data - $SWIS is Preparing Their Multi-Currency Platform for Global Launch of its Swiss Hosted Sekur.com Secure Email and Messaging Security and Privacy Application!",
        "url": "https://www.reddit.com/r/investing_discussion/comments/lxn4f6/globex_data_swis_is_preparing_their_multicurrency/",
        "created": 1614900699.0
    },
    {
        "author": "Boogyman422",
        "created_utc": 1614888306,
        "id": "lxttmy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "SLB Calls, Microsoft and Chevron partnership",
        "url": "https://i.redd.it/tlnh9cyii2l61.jpg",
        "created": 1614917106.0
    },
    {
        "author": "Up-UpAway",
        "created_utc": 1614723766,
        "id": "lwe6lh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Picking up more RNWK on momentum. Low float. Facial recognition/computer vision (AI &amp; Machine learning) software that’s unchallenged. Seasoned management, CEO billionaire Rob Glaser(former Microsoft executive). 6 consecutive quarters of improving EBITDA, cash flow positive next quarter, major partnerships with US military, Japan and Korea (currently in exploratory phases) 77% margins. POTENTIAL MULTI BAGGER!",
        "subreddit": "wallstreetbets",
        "title": "microcap MULTIBAGGER unfolding",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwe6lh/microcap_multibagger_unfolding/",
        "created": 1614752566.0
    },
    {
        "author": "pennant1993",
        "created_utc": 1615174043,
        "id": "m06pvn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "AR With the development of this technology, we will be in more life scenes in the future $MSFT $WIMI $GOOG",
        "url": "https://www.reddit.com/r/WIMI/comments/m04ihh/microsofts_new_mesh_software_platform_helps/?utm_medium=android_app&amp;utm_source=share",
        "created": 1615202843.0
    }
]