[
    {
        "author": "Govanator12",
        "created_utc": 1613142453,
        "id": "licv27",
        "num_comments": 257,
        "num_crossposts": 0,
        "selftext": "I'm already bought in in small amounts to $AMD $LRCX $TSM $NVDA and $SWKS.\n\nAssuming Biden goes forward with semiconductor benefits for American companies (which is looking more and more likely) what are the plays here?\n\nI assume AMD, Lam, NVIDIA, and Skyworks will shoot up as they're all American and $TSM will take a little dive but stay strong long term. What other bets can I make on this? Ford? GE? GM?",
        "subreddit": "wallstreetbets",
        "title": "Semiconductor Plays",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/licv27/semiconductor_plays/",
        "created": 1613171253.0
    },
    {
        "author": "xAshraxx",
        "created_utc": 1613443897,
        "id": "lktzoi",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "$TSM - I am in with a cost average at $102. I first invested in it at  $50 but since sold that position was able to re-enter and stayed with my positions at $76 and $103. With 36 shares total I am excited and hopeful this TSM with continue to rally. It even pays a 1.59% Annual Dividend but comes with a small foreign tax fee, my latest tax fee was $.19.\n\nThey have purchased land in Arizona for $89 million to manufacture 5nm chips and they expect production can start in 2024 and the project will continue to 2029 with an estimated cost at $12 billion dollars. With expectations of 4nm and 3nm being manufactured by 2022. The P/E is slightly higher than the average with earnings just shy of the average. So your paying a premium but for the largest semiconductor manufacture with a market cap at $715B you also get an advantage in the market with a respectable stock price history, market exposure and a positive future with increasing ability to manufacture more chips in the upcoming years.\n\nI don't think TSM is far away from hitting the $150 and beyond. [Stockinvest.us](https://Stockinvest.us) has price projections near $200 in the next 3 months. I am not too concerned with the timeline but honestly I wouldn't be surprised if it hit $150 next week. I tend to be a bit bullish on TSM and I see this chip shortage being the catalyst that can give us a strong first quarter. With the chip shortage being fueled by the high demand in the auto industry among all the new smart technology devices.\n\nI don't believe investing in TSM or into any position for just 1 reason or even for somebody else's reasons is wise. It's easy to pull up the graph and see the upward trend but I am trying to focus on need for TSM products and the ways they plan on increasing production.\n\nHow and if you choose to invest in TSM is up to you. I am long TSM and I am interested in the following as well. \n\nON,MU,ASML,AMAT,LRCX \n\nI hope this was helpful to someone. I think it would be a good idea to at least give it a second look for those looking for Semiconductor exposure.",
        "subreddit": "wallstreetbets",
        "title": "TSM - Is it a BUY at $138 ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lktzoi/tsm_is_it_a_buy_at_138/",
        "created": 1613472697.0
    },
    {
        "author": "xAshraxx",
        "created_utc": 1613444469,
        "id": "lku5wj",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": " \n\n$TSM - I am in with a cost average at $102. I first invested in it at $50 but since sold that position was able to re-enter and stayed with my positions at $76 and $103. With 36 shares total I am excited and hopeful this TSM with continue to rally. It even pays a 1.59% Annual Dividend but comes with a small foreign tax fee, my latest tax fee was $.19.\n\nThey have purchased land in Arizona for $89 million to manufacture 5nm chips and they expect production can start in 2024 and the project will continue to 2029 with an estimated cost at $12 billion dollars. With expectations of 4nm and 3nm being manufactured by 2022. The P/E is slightly higher than the average with earnings just shy of the average. So your paying a premium but for the largest semiconductor manufacture with a market cap at $715B you also get an advantage in the market with a respectable stock price history, market exposure and a positive future with increasing ability to manufacture more chips in the upcoming years.\n\nI don't think TSM is far away from hitting the $150 and beyond. [Stockinvest.us](https://stockinvest.us/) has price projections near $200 in the next 3 months. I am not too concerned with the timeline but honestly I wouldn't be surprised if it hit $150 next week. I tend to be a bit bullish on TSM and I see this chip shortage being the catalyst that can give us a strong first quarter. With the chip shortage being fueled by the high demand in the auto industry among all the new smart technology devices.\n\nI don't believe investing in TSM or into any position for just 1 reason or even for somebody else's reasons is wise. It's easy to pull up the graph and see the upward trend but I am trying to focus on need for TSM products and the ways they plan on increasing production.\n\nHow and if you choose to invest in TSM is up to you. I am long TSM and I am interested in the following as well.\n\nON,MU,ASML,AMAT,LRCX\n\nI hope this was helpful to someone. I think it would be a good idea to at least give it a second look for those looking for Semiconductor exposure.",
        "subreddit": "stocks",
        "title": "TSM - Is it a Buy at $138?",
        "url": "https://www.reddit.com/r/stocks/comments/lku5wj/tsm_is_it_a_buy_at_138/",
        "created": 1613473269.0
    },
    {
        "author": "Govanator12",
        "created_utc": 1613142505,
        "id": "licvpp",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I'm already bought in in small amounts to $AMD $LRCX $TSM $NVDA and $SWKS.\n\nAssuming Biden goes forward with semiconductor benefits for American companies (which is looking more and more likely) what are the plays here?\n\nI assume AMD, Lam, NVIDIA, and Skyworks will shoot up as they're all American and $TSM will take a little dive but stay strong long term. What other bets can I make on this? Ford? GE? GM?",
        "subreddit": "stocks",
        "title": "Semiconductor Plays",
        "url": "https://www.reddit.com/r/stocks/comments/licvpp/semiconductor_plays/",
        "created": 1613171305.0
    },
    {
        "author": "GravyMaster",
        "created_utc": 1612451559,
        "id": "lchq1y",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I work in a company in the semi industry that is not public. Based on my experiences, that industry is going to continue growing rapidly for the indefinite future. Until we stop using phones, computers, anything with a PCB in it, that industry will grow.\n\nAnyone have good long plays in there? I think the top companies would be chip makers, chemical companies, and then the real secret area, all the companies that make automation for the semiconductor process (Applied Materials, TEL, LAM Research, etc). I'm also interested in analytical chemistry related companies. That science will be critical in developing better chips. The chip makers are really limited by chemical cleanliness. Last I will also mention laser ablation.\n\nWho's got anything?",
        "subreddit": "wallstreetbets",
        "title": "Looking for value in the Semiconductor Industry. Who has some long plays?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lchq1y/looking_for_value_in_the_semiconductor_industry/",
        "created": 1612480359.0
    },
    {
        "author": "KillerAc1",
        "created_utc": 1613368082,
        "id": "lk6y63",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Hi! I've been getting into investing a lot recently, and I'm doing this mainly for my own experience. I'll take any feedback or comments y'all have. Let me know what you think of my first list!\n\nTo start off, I want to disclose how I picked this list. I used Morgan Stanley's stock screener to find tickers with their \"overweight\" rating and a price below their given price target (if applicable). Next, I would cross-reference that with RH and Zack's stock analysis. Finally, I would search for each ticker on Reddit in order to see what the sentiment towards the stock was. After compiling the list, I went through each stock individually again and assigned it a ranking of 1-5 (1 being safe, 5 being more speculative/risky), as well as providing a hypothetical dollar amount that I would invest in at the current price.\n\nThe goal of this list was to pick a balanced portfolio between aggressive growth and long term consistency. I have a huge bias towards semiconductors, biomedical, tech, and industrial/material.\n\nI'll start with the stocks I gave a 1 rating\n\n1. MSFT, GOOGL, AMZN, FB, AAPL ($8k in each)\n\nI believe these will be here for a loooong time as well as continue to grow. These seem pretty safe to me and make up the foundation of this portfolio\n\nNow we get to stocks with a 2 rating. These are my favorites, as I see them having high growth potential and staying power (still riskier than 1s, however)\n\n2. NVDA, AMD, TXG, AMAT, MT, VALE, RTX, TDG, QRVO, NIO, TSLA ($5k in each)\n\n Now we get on to the 3s! These will follow a similar pattern of higher risk, less amount invested.\n\n3. TER, LRCX, ON, MCHP, FSLY, CRSR, RDSB, DOCU ($3k in each)\n\nNow we get to the 4s. These are mostly speculative\n\n4. SPCE, ANTM, NET, ACAD, ABCL ($2k in each)\n\nThat list was pretty short. The 5s will be the most risky/most speculative. They will have the lowest amount invested in them.\n\n5. TGH, SEDG, HUM, AMKR.\n\nOh and positions: 20 VOO, 62 QQQ, 28 LIT, and 54 PLTR. If you made it to the end of this post, thank you!",
        "subreddit": "stocks",
        "title": "My first attempt at a stocks to watch list/DD",
        "url": "https://www.reddit.com/r/stocks/comments/lk6y63/my_first_attempt_at_a_stocks_to_watch_listdd/",
        "created": 1613396882.0
    },
    {
        "author": "itsgoggles",
        "created_utc": 1612874731,
        "id": "lg2lju",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/nwv5bs876gg61.png?width=1500&amp;format=png&amp;auto=webp&amp;s=39ab525e8eaeacb18d0be1fcdebd54ab1ea5fc3e\n\nDisclaimer: The Russel 2000 $IWM continues to push all time highs along with the overall markets. It is incredibly difficult to find long entries at current price levels, not to mention social media is trying to get EVERY  stock below a buck over one dollar. Tread lightly out there, as I still feel a correction coming on. My first three pics are small cap companies, BUT they are between $8-$12 which is above r/pennystocks definition of a penny stock. I would rather give you a setup I believe in then shove a cheap stock down your throat. Hoping my OTC plays recently (VEPR and ENZC) have benefitted you greatly.   \n\n\n***$COTY:***\n\nShares of  Coty Inc.  (COTY) rose 2.9% in premarket trading Tuesday, after the beauty products company reported fiscal second-quarter adjusted profit that declined less than expected, while sales fell a bit shy. The net loss for the quarter to  Dec. 31  widened to  $275.4 million , or  36 cents  a share, from from  $21.1 million , or  3 cents  a share, in the year-ago period. Excluding nonrecurring items, adjusted earnings per share fell to  17 cents  from  27 cents , but was above the FactSet consensus of  7 cents . Revenue declined 15.9% to  $1.415 billion , just below the FactSet consensus of  $1.433 billion , as sales in the  Americas  and EMEA ( Europe ,  Middle East  and  Africa ) regions missed expectations while  Asia Pacific  beat. The company said despite continued disruptions to sales and short-term orders related to the COVID-19 pandemic, it will start raising commercial investments ahead of fiscal 2022, while the company raised its full-year cost cutting target to  $300 million . The stock has soared 78.4% over the past three months through Monday, while the S&amp;P 500 has gained 10.3%.\n\nLackluster earnings BUT the chart speaks for itself. Will be looking for an entry after the stock falls back down to previous resistance turned support, which tends to happen on a lot of these flags. Stock is still trading well under pre-pandemic levels.\n\n*Processing img lf6y7m3p6gg61...*\n\n***$LLIT: (Update)***\n\nLLIT merging with Newegg, presented us with a dip into the 20ma for an entry in the 6.20's, and has since been silently chugging in the background. Holy grail setup with more room to move.\n\nhttps://preview.redd.it/f6ed3ivr6gg61.png?width=2252&amp;format=png&amp;auto=webp&amp;s=c2673432de3986b664ea1096f41fd0ea09ecacb2\n\n***$LUMN: (Update)***\n\nEarnings scheduled for the tenth with this one, but they are definitely beginning a pre-anticipatory run. We had unusual option volume with this one, so I am curious to see what happens after the tenth.\n\nHoly grail setup as well, dipped into the 10-20ma cloud and has since bounced and i continuing its upward trend.\n\nhttps://preview.redd.it/d2qarrtu6gg61.png?width=2252&amp;format=png&amp;auto=webp&amp;s=9a6b99cf1b781e815f2ab8d6318f2826e6da9a21\n\n***🔵Blue Chip Chart Setups of the Day🔵***  \n\n\n***$U:***\n\nhttps://preview.redd.it/x8xrxfpy6gg61.png?width=2252&amp;format=png&amp;auto=webp&amp;s=74394d51e2f336cf03c82350e604f827cead06ff\n\n***$LRCX:***\n\nhttps://preview.redd.it/pd2keck07gg61.png?width=2252&amp;format=png&amp;auto=webp&amp;s=da738762e21b9c74c964a480c782d5e83bfa4562\n\n***$EDIT:***\n\nhttps://preview.redd.it/vqcx04r17gg61.png?width=2252&amp;format=png&amp;auto=webp&amp;s=85cdd1086679b36ce0a4404c13ad11aac6d9f3ff\n\n***Never forget to do your own DD; remember: For all you know, all the stocks that I mention here will dip 90% tomorrow; Do your own DD, I'm not some magic fairy. Trading will never come this easy to you. If all the stocks on here went up, I'd be chilling on my own Island.***  \n\n\n*This is a watchlist, not a buy list. I am not a financial advisor.*",
        "subreddit": "pennystocks",
        "title": "February 9th | Templar Trading Watchlist",
        "url": "https://www.reddit.com/r/pennystocks/comments/lg2lju/february_9th_templar_trading_watchlist/",
        "created": 1612903531.0
    },
    {
        "author": "Similar_Avocado6159",
        "created_utc": 1613061445,
        "id": "lhojlq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "LRCX TO THE MOON!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lhojlq/lrcx_to_the_moon/",
        "created": 1613090245.0
    },
    {
        "author": "TheRealShmoo1",
        "created_utc": 1612267567,
        "id": "lau2xg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Why did Lam Research (LRCX) stock drop?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lau2xg/why_did_lam_research_lrcx_stock_drop/",
        "created": 1612296367.0
    },
    {
        "author": "stockking777",
        "created_utc": 1612807164,
        "id": "lfhk0b",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "LRCX float too small for current Re-Valuation -- 700 can be realized FAST -- 1100 long term fundamental intrinsic target",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lfhk0b/lrcx_float_too_small_for_current_revaluation_700/",
        "created": 1612835964.0
    },
    {
        "author": "Estri_Grobbulus",
        "created_utc": 1612197578,
        "id": "la7g07",
        "num_comments": 372,
        "num_crossposts": 0,
        "selftext": "Edit 1: More ARKQ buying today (~50k shares). Thank you everyone for the positive feedback and discussion! \n\nBottom Line Up Front (BLUF) or TL;DR for the non-military types:\n\nLMT is a good target if you want to literally go to the moon, and my PT is $690.26 in two years (more than 2x from current levels). Justification and some possible trade ideas are listed below, just CTRL-F “Trade Ideas”. I hope you guys enjoy this work and would appreciate any discussion or feedback. I hope to catch you in the comments.\n\nTeam,\n\nWe interrupt today’s regularly scheduled short squeeze coverage to discuss a traditionally boring stock, LMT (Lockheed Martin), with significant upside potential. To be clear, this is NOT a short squeeze target like many reddit posts are keying on. I hope that this piece sparks discussion, but if you are just looking for short squeeze content, all I have to say is BUY, HOLD, and GODSPEED.\n\nThe source of inspiration for me writing this piece is threefold; first, retail investors are winning, and I believe that we will continue to win if we continue to identify opportunities in the market. In my view, the stock market has always been a place for the public to shine a light on areas of innovation that real Americans are excited about and proud to be a part of. Online communities have stolen the loudspeaker from hedge fund managers and returned it to decentralized online democracies that quickly and proudly shift their weight behind ideas they believe in. In GME’s case, it was a blatant smear campaign to destroy a struggling business. I think that we should continue this campaign by identifying opportunities in the market and running with them. It may sound overly idealistic, but if reddit can take on the hedge funds, I non-ironically believe that we can quite literally take good companies researching space technology to the moon. I think LMT may be one of several stocks to help get us there.\n\nSecond, a video where the Secretary of State of Massachusetts argues that internet boards are full of a bunch of unsophisticated, thoughtless traders really ticked me off. This piece is designed to show that ‘the little guy’ is ready to get into the weeds, understand business plans, and outpace analysts that think companies like Tesla are overvalued by comparing them to Toyota. That is a big reason that I settled on an old, large, slow growth company to do a deep-dive on, and try my best to show some of the abysmal predictive analysis major ‘research firms’ do on even some of the most heavily covered stocks. LMT is making moves, and the suits on wall street are 10 steps behind. At the time of writing this piece, Analyst Estimates range from 330-460 (what an insane range).\n\nThird, and most importantly, I am in the US military, and I think that it is fun to go deep into the financials of the defense sector. I think that it helps me understand the long-term growth plans of the DoD, and I think that I attack these deep-dives with a perspective that a lot of these finance-from-day-one cats do not understand. Even if no one ever looks at this work, I think that taking the time to write pieces like this makes me a better Soldier, and I will continue to do it in my spare time when I am feeling inspired. I wrote a piece on Raytheon Technologies (Ticker: RTX) 6 months ago, and I think it was well-received. I was most convicted about RTX in the defense sector, but I have since shifted to believing LMT is the leader in the defense space. I am long both, though. If this inspires anyone else to do similar research on other companies, or sparks discussion in the community, that is just a bonus. Special shout-out to the folks that read more than just the TL;DR, but if you do just read the TL;DR, I love you too!\n\nNow let us get into it:\n\n**Leadership**\n\nI generally like to invest in companies that are led by people that seem to have integrity. Jim Taiclet took the reins at LMT in June of last year. While on active duty, he served as a C-141B Starlifter pilot (a retired LMT Aircraft). After getting out he went to work for the American Tower Corporation (Ticker: AMT). His first day at American Tower was September 10, 2001. The following day, AMT lost 13 employees in the World Trade Center attack. He stayed with the company, despite it being decimated by market uncertainty in the wake of 9/11. He was appointed CEO of the very same company in 2004. Over a 16 year tenure as CEO of AMT the company market cap 20x’d. He left his position as CEO of AMT in March of last year, and the stock stagnated since his departure, currently trading at roughly the same market cap as to when he left.\n\nJim Taiclet was also appointed to be the chairman of the board this week, replacing the previous CEO. Why is it relevant that the CEO came from a massive telecommunications company?\n\nRightfully, Taiclet’s focus for LMT is bringing military technology into the modern era. He wants LMT to be a first mover in the military 5G space, military application of AI space, the… space space, and the hypersonic glide vehicle (HGV) space. These areas are revolutionary for the boomer defense sector. We will discuss this in more detail later when we cover the company’s P/E multiple and why it is absolute nonsense.\n\nIt is not a surprise to me that they brought Taiclet on during the pandemic. He led AMT through adversity before, and LMT’s positioning during the pandemic is tremendous relative to the rest of the sector, thanks in large part to some strong strategic moves and good investments by current and past leadership. I think that Taiclet is the right CEO for the job.\n\nIn addition to the new CEO, the new Secretary of Defense, Secretary Lloyd Austin, has strong ties to the defense sector. He was formerly a board member for RTX. He is absolutely above reproach, and a true leader of character, but I bring this up not to suggest that he will inappropriately serve in the best interest of defense contractors, but to suggest that he speaks the language of these companies effectively. I do not anticipate that the current administration poses as significant of a risk to the defense sector as many analysts seem to believe. This will be expanded in the headwinds section below.\n\n**SPACE**\n\nCathie Wood and the ARK Invest team brought a lot of attention to the space sector when the ARKX, The ARK Space Exploration ETF, Form N-1A was officially filed through the SEC. More recently, ARK Invest published their Big Ideas 2021 Annual Report and dedicated an entire 7-page chapter to Orbital Aerospace, a new disruptive innovation platform that the ARK Team is investigating. This may have helped energize wall street to re-look their portfolios and their investments in space technology, but it was certainly not the first catalyst that pushed the defense industry in the direction of winning the *new* space race.\n\nIn June 2018, then President Trump announced at the annual National Space Council that “it is not enough to merely have an American presence in space, we must have American dominance in space. So important. Therefore, I am hereby directing the Department of Defense (DoD) and Pentagon to immediately begin the process necessary to establish a Space Force as the sixth branch of the Armed Forces\". Historically, Department of Defense space assets were under the control of the Air Force. By creating a separate branch of service for the United States Space Force (USSF), the DoD would allocate a Chairman of Space Operations on the Joint Chiefs of Staff and clearly define the budget for space operations dedicated directly to the USSF. At present, this budget is funneled from the USAF’s budget. The process was formalized in December of 2019, and the DoD has appropriated \\~$15B to the USSF in their first full year of existence according to the FY21 budget.\n\nAmong the 77 spacecraft that are controlled by the USSF, 29 of them are Lockheed Martin GPS satellites, 6 of them are Lockheed Martin Space-Based Infrared Systems (SBIRS), and LMT had a hand in creating and/or manufacturing for several of the other USSF efforts. The Next Generation Overhead Persistent Infrared Missile Warning Satellites (also known as Next-Gen OPIR) were contracted out to both Northrup Grumman (Ticker: NOC) and LMT. LMT’s contract is currently set at $4.9B, NOC’s contract is set at $2.37B.\n\nTangentially related to the discussion of space is the discussion of hypersonic glide vehicles (HGVs). HGVs have exoatmospheric and atmospheric implications, but I think that their technology is extremely important to driving margins down for both space exploration and terrestrial point-to-point travel. LMT is leading the charge for military HGV research. They hold contracts with the Navy, Air Force, and Army to develop HGVs and hypersonic precision fires. The priority for HGV technology accelerated significantly when Russia launched their Avangard HGV in December of 2019. Improving the technology for HGVs is a critical next-step in maintaining US hegemony, but also maintaining leadership in both terrestrial and exoatmospheric travel.\n\n**LARGE SCALE COMBAT OPERATIONS (LSCO)**\n\nThe DoD transitioning to Large-Scale Combat Operations (LSCO) as the military’s strategic focus. This is a move away from an emphasis on Counter-Insurgency operations. LSCO requires effective multi-domain operations (MDO), which means effective and integrated strategies regarding land, sea, air, space, and cyberspace. To have effective MDO, the DoD is seeking systems that both expand capabilities against peer threats and increase the ability to track enemy units and communicate internally. This requires a modernizing military strategy that relies heavily on air, missile, and sensor modernization. Put simply, the DoD has decided to start preparing for peer or near-peer adversaries (China, Russia, Iran, North Korea) rather than insurgencies. For this reason, I believe that increased Chinese and Russian tensions are, unfortunate as it may be, a boon to the defense industry. This is particularly true in the missiles/fires and space industry, as peer-to-peer conflicts are won by leveraging technological advantages.\n\nThere are too many projects to cover in detail, but some important military technologies that LMT is focusing on to support LSCO include directed energy weapons (lasers) to address enemy drone technology, machine learning / artificial intelligence (most applications fall under LMT’s classified budget, but it is easy to imagine the applications of AI in a military context), and 5G to increase battlefield connectivity. These projects are all nested within the DoD’s LSCO strategy, and position LMT as the leader in emergent military tech. NOC is the other major contractor making a heavy push in the modernization direction, but winners win, and I think a better CEO, balance sheet, and larger market cap make LMT the clear winner for aiding the DoD in a transition toward LSCO.\n\n**SECTOR COMPARISON (BACKLOG)**\n\nThe discussion of LSCO transitions well into the discussion of defense contractor backlogs. Massive defense contracts are not filled overnight, so examining order backlogs is a relatively reliable way to gauge the interest of the DoD in a defense contractor’s existing or emerging products. For my sector comparison, I am using the top 6 holdings of the iShares U.S. Aerospace &amp; Defense ETF (Ticker: ITA). I hate this ETF, and ETFs like it (DFEN) because of their massively outsized exposure to aerospace, and undersized allocation to companies like LMT. LMT is only 18% smaller than Boeing (Ticker: BA) but is only 30.4% of the exposure of BA (18.46% of the fund is BA, only 5.62% of the fund is LMT). Funds of this category are just BA / RTX hacks. I suggest building your own pie on a site like M1 Finance (although they are implicated in the trade restriction BS… please be advised of that… hoping other brokerages that are above board will offer similar UIs like the pie design… just wanted to be clear there) if you are interested in the defense sector.\n\nThe top 6 holdings of ITA are:\n\nBoeing Company (Ticker: BA, MKT CAP $110B) at 18.46%\n\nRaytheon Technologies (Ticker: RTX, MKT CAP $101B) at 17.84%\n\nLockheed Martin (Ticker: LMT, MKT CAP $90B) at 5.62%\n\nGeneral Dynamics Corporation (Ticker: GD, MKT CAP $42B) 4.78%\n\nTeledyne Technologies Incorporated (Ticker: TDY, MKT CAP $13B) at 4.74%\n\nNorthrop Grumman Corporation (Ticker: NOC, MKT CAP $48B) at 4.64%\n\nAs a brief aside, please look at the breakdowns of ETFs before buying them. The fact that ITA has more exposure to TDY than NOC and L3Harris is wild. Make sector ETFs balanced how you want them to be balanced and it will be more engaging, and you will likely outperform. I digress.\n\nBacklogs for defense companies can easily be pulled from their quarterly reports. Here are the current backlogs in the same order as before, followed by a percentage of their backlog to their current market cap. All numbers are pulled from January earning reports unless otherwise noted with an \\* because they are still pending.\n\n**Boeing Company** backlog (Commercial: $282B, Defense: $61B, Foreign Military Sales (FMS, categorized by BA as ‘Global’): 21B, Total Backlog 364B): BA’s backlog to market cap is a ratio of 3.32, which is strong, but most of that backlog comes from the commercial, not the defense side. Airlines have been getting decimated, I am personally not interested in having much of my backlog exposed to commercial pressures when trying to invest in a defense play. Without commercial exposure, their defense only backlog ratio is .748. This is extremely low. I understand that this does not do BA justice, but I am keying in on defense exposure, and I am left thoroughly unsatisfied by that ratio. Also, we have seen several canceled contracts already on the commercial side.\n\n**Raytheon Technologies** backlog (Defense backlog for all 4 subdivisions: 67.3B): Raytheon only published a defense backlog in this quarter’s report. That is further evidence to me that the commercial aerospace side of the house is getting hammered. They have a relatively week backlog to market cap as well, putting them at a ratio of .664, worse off than the BA defense backlog.\n\n**Lockheed Martin** backlog (Total Backlog: $147B): This backlog blows our first two defense backlogs out of the water with a current market cap to backlog ratio of 1.63.\n\n**General Dynamics Corporation** backlog (Total Backlog: $89.5B, $11.6B is primarily business jets, but it is difficult to determine how much of their aerospace business is commercial): Solid 2.13 ratio, still great 1.85 if you do not consider their aerospace business. The curveball here for me is that GD published a consolidated operating profit of $4.1B including commercial aerospace, whereas LMT published a consolidated operating profit of $9.1B. This makes the LMT ratio of profit/market cap slightly in favor of LMT without accounting for the GD commercial aerospace exposure. This research surprised me; I may like GD more than I originally assumed I would. Still prefer LMT.\n\n**Teledyne Technologies Incorporated** backlog (Found in the earnings transcript, $1.7B): This stock is not quite in the same league as the other major contractors. This is an odd curveball that a lot of the defense ETFs seem to have too much exposure to. They have a weak backlog, but they are a smaller growing company. I am not interested in this at all. It has a backlog ratio of .129.\n\n**Northrop Grumman Corporation** backlog ($81B): Strong numbers here. I see NOC and LMT as the two front-runners in the defense sector. I like LMT more because I like their exposure to AI, 5G, and HGVs more than NOC, but I think this is a great alternative to LMT if you like the defense sector. Has a ratio of 1.69, slightly edging out LMT on this metric. LMT edges out NOC on margins by \\~.9%, though, which has significant implications when considering the depth of the LMT backlog.\n\nThe winners here are LMT, GD, and NOC. BA is attractive if you think anyone will have enough money to buy new planes. BA and RTX are both getting hammered by commercial aerospace exposure right now and are much more positioned as recovery plays. That said, LMT and NOC both make money now, and will regardless of the impact of the pandemic. LMT is growing at a slightly faster rate than NOC. Both are profit machines, but I like LMT’s product portfolio and leadership a lot more.\n\n**FREE CASH FLOW**\n\nDespite the pandemic, LMT had the free cash flow to be able to pay a $2.60 per share dividend. This maintains their \\~3% yearly dividend rate. They had a free cash flow of $6.4B. They spent $3.9 of that in share repurchases and dividend payouts. That leaves 40% of that cash to continue to strengthen one of the most stalwart balance sheets outside of big tech on the street. Having this free cash flow allowed them to purchase Aerojet Rocketdyne for $4.4B in December. They seem flexible and willing to expand and take advantage of their relative position during the pandemic. This is a stock that has little downside risk and significant upside potential. It is always reassuring to me to know that at the end of the day, a company is using its profit to continue to grow.\n\n**HEADWINDS**\n\n**New Administration** – This is more of an unknown than a headwind. The Obama Administration was not light on military spending, and the newly appointed SecDef is unlikely to shy away from modernizing the force. Military defense budgets may get lost in the political shuffle, but nothing right now suggests that defense budgets are on the chopping block.\n\n**Macroeconomic pressure** – The markets are tumultuous in the wake of GME. Hedgies are shaking in their boots, and scared money weighed on markets the past week. If scared money continues to exert pressure on the broader equity markets, all boomer stocks are likely weighed down by slumping markets.\n\n**Non-meme Status** – The stocks that are impervious to macroeconomic pressures in the above paragraph are the stonks that we, the people, have decided to support. From GME to IPOE, there is a slew of stonks that are watching and laughing from the green zone as the broader markets slip deeper into the red zone. Unless sentiment about LMT changes, I see no evidence that LMT will remain unaffected by a broader economic downturn (despite showing growth YoY during a pandemic).\n\n**TAILWINDS**\n\n**Aerojet Rocketdyne to the Moon** – Cathie Wood opened up a $39mil position in LMT a few weeks ago, and this was near the announcement of ARKX. The big ideas 2021 article focuses heavily on satellite technology, deep learning, and HGVs. I think that the AR acquisition suggests that vertical integration is a priority for LMT. They even fielded a question in their earnings call about whether they were concerned about being perceived as a monopoly. Their answer was spot on—the USFG and DoD have a vested interest in the success of defense companies. Why would they discourage a defense contractor from vertical integration to optimize margins?\n\n**International Tensions** – SolarWinds has escalated US-Russia tensions. President Biden wants to look tough on China. LSCO is a DoD-wide priority.\n\n**5G.Mil** – We still do not have a lot of fidelity on what this looks like, but the military would benefit in a lot of ways if we had world-wide access to the rapid transfer of encrypted data. Many units still rely on Vietnam-era technology signal technology with abysmal data rates. There are a lot of implications if the code can be cracked to win a DoD 5G contract.\n\n**TRADE IDEAS**\n\n**Price Target:** LMT is currently at a P/E of \\~14. Verizon has roughly the same. LMT’s 5-year P/E ratio average is \\~17. NOC is currently at a P/E of \\~20. TSLA has a P/E Ratio of 1339 (disappointingly not 1337). P/E is a useless metric because no one seems to care about it. My point is that LMT makes a lot of money, and other companies that are valued at much higher multiples do not make any money at all. LMT’s P/E ratio is that of a boomer stock that has no growth potential. LMT’s P/E is exactly in line with the Aerospace and Defense Industry P/E ratio standard. LMT’s new CEO is pushing the industry in a new direction. I will arbitrarily choose a P/E ratio of 30, because it is half of the software industry average, and it is a nice round number. Plus, stock values are speculative and nonsense anyway.\n\nShare price today: $321.82\n\nShare price based on LMT average 5-year P/E: $384.08 (I see this as a short term PT, reversion to the mean)\n\nShare price with a P/E of 30: $690.26\n\n**Buy and Hold:** Simple. Doesn’t take much thought. Come back in a year or two and be happy with your tendies (and a few dividends to boot).\n\n**LEAPS Call Debit Spread (Based on last trade prices):** Buy $375 C 20 JAN 23 for $26.5, Sell $450 C 20 JAN 23 for $12. Total Cost $14.5 for a spread width of $75. Max gain 517% per spread. Higher risk strategy.\n\n**LEAPS**: Buy $500 C 20 JAN 23 for $7.20. Very high-risk strat. If the price target is hit within two years, these would be in the money $183 per contract for a gain of 2500%. This is the casino strat.\n\n**SOURCES**\n\n[https://www.lockheedmartin.com/en-us/news/features/2020/james-taiclet-from-military-pilot-to-successful-ceo.html](https://www.lockheedmartin.com/en-us/news/features/2020/james-taiclet-from-military-pilot-to-successful-ceo.html)\n\n[https://www.warren.senate.gov/newsroom/press-releases/in-response-to-senator-warrens-questions-secretary-of-defense-nominee-general-lloyd-austin-commits-to-recusing-himself-from-raytheon-decisions-for-four-years](https://www.warren.senate.gov/newsroom/press-releases/in-response-to-senator-warrens-questions-secretary-of-defense-nominee-general-lloyd-austin-commits-to-recusing-himself-from-raytheon-decisions-for-four-years)\n\n[https://news.lockheedmartin.com/2019-08-30-Lockheed-Martins-Expertise-in-Hypersonic-Flight-Wins-New-Army-Work](https://news.lockheedmartin.com/2019-08-30-Lockheed-Martins-Expertise-in-Hypersonic-Flight-Wins-New-Army-Work)\n\n[https://www.lockheedmartin.com/en-us/capabilities/hypersonics.html](https://www.lockheedmartin.com/en-us/capabilities/hypersonics.html)\n\n[https://research.ark-invest.com/hubfs/1\\_Download\\_Files\\_ARK-Invest/White\\_Papers/ARK%E2%80%93Invest\\_BigIdeas\\_2021.pdf?hsCtaTracking=4e1a031b-7ed7-4fb2-929c-072267eda5fc%7Cee55057a-bc7b-441e-8b96-452ec1efe34c](https://research.ark-invest.com/hubfs/1_Download_Files_ARK-Invest/White_Papers/ARK%E2%80%93Invest_BigIdeas_2021.pdf?hsCtaTracking=4e1a031b-7ed7-4fb2-929c-072267eda5fc%7Cee55057a-bc7b-441e-8b96-452ec1efe34c)\n\n[https://www.deseret.com/2018/6/19/20647309/twitter-reacts-to-trump-s-call-for-a-space-force](https://www.deseret.com/2018/6/19/20647309/twitter-reacts-to-trump-s-call-for-a-space-force)\n\n[https://comptroller.defense.gov/Portals/45/Documents/defbudget/fy2021/fy2021\\_Budget\\_Request\\_Overview\\_Book.pdf](https://comptroller.defense.gov/Portals/45/Documents/defbudget/fy2021/fy2021_Budget_Request_Overview_Book.pdf)\n\n[https://www.airforcemag.com/lockheed-receives-up-to-4-9-billion-for-next-gen-opir-satellites/](https://www.airforcemag.com/lockheed-receives-up-to-4-9-billion-for-next-gen-opir-satellites/)\n\n[https://spacenews.com/northrop-grumman-gets-2-3-billion-space-force-contract-to-develop-missile-warning-satellites/](https://spacenews.com/northrop-grumman-gets-2-3-billion-space-force-contract-to-develop-missile-warning-satellites/)\n\n[https://www.lockheedmartin.com/en-us/capabilities/directed-energy/laser-weapon-systems.html](https://www.lockheedmartin.com/en-us/capabilities/directed-energy/laser-weapon-systems.html)\n\n[https://emerj.com/ai-sector-overviews/lockheed-martins-ai-applications-for-the-military/](https://emerj.com/ai-sector-overviews/lockheed-martins-ai-applications-for-the-military/)\n\n[https://www.defenseone.com/business/2020/07/new-ceo-wants-lockheed-become-5g-player/167072/](https://www.defenseone.com/business/2020/07/new-ceo-wants-lockheed-become-5g-player/167072/)\n\n[https://www.wsj.com/articles/defense-firms-expect-higher-spending-11548783988](https://www.wsj.com/articles/defense-firms-expect-higher-spending-11548783988)\n\n[https://www.etf.com/ITA#efficiency](https://www.etf.com/ITA#efficiency)\n\n[https://s2.q4cdn.com/661678649/files/doc\\_financials/2020/q4/4Q20-Presentation.pdf](https://s2.q4cdn.com/661678649/files/doc_financials/2020/q4/4Q20-Presentation.pdf)\n\n[https://investors.rtx.com/static-files/dfd94ff7-4cca-4540-bc4b-4e3ba92fc646](https://investors.rtx.com/static-files/dfd94ff7-4cca-4540-bc4b-4e3ba92fc646)\n\n[https://investors.lockheedmartin.com/static-files/64e5aa03-9023-423a-8908-2aae8c7015ac](https://investors.lockheedmartin.com/static-files/64e5aa03-9023-423a-8908-2aae8c7015ac)\n\n[https://s22.q4cdn.com/891946778/files/doc\\_financials/2020/q4/GD\\_4Q20\\_Earnings\\_Highlights-Outlook-Final.pdf](https://s22.q4cdn.com/891946778/files/doc_financials/2020/q4/GD_4Q20_Earnings_Highlights-Outlook-Final.pdf)\n\n[https://www.fool.com/earnings/call-transcripts/2021/01/27/teledyne-technologies-inc-tdy-q4-2020-earnings-cal/](https://www.fool.com/earnings/call-transcripts/2021/01/27/teledyne-technologies-inc-tdy-q4-2020-earnings-cal/)\n\n[https://investor.northropgrumman.com/static-files/6e6e117f-f656-4c68-ba7f-3dc53c2dd13a](https://investor.northropgrumman.com/static-files/6e6e117f-f656-4c68-ba7f-3dc53c2dd13a)",
        "subreddit": "investing",
        "title": "LMT: A Deep Dive",
        "url": "https://www.reddit.com/r/investing/comments/la7g07/lmt_a_deep_dive/",
        "created": 1612226378.0
    }
]