[
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1613047537,
        "id": "lhjy1m",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "**Hello everyone! This isn’t my usual kind of post, but man, I can’t stand to see how people just follow every freaking YouTuber out there blindly!** In this post, we are going to talk about why I believe Tom Nash may be a **fraud**, so please do have some patience and read the full post, as I will go through an in-depth research of his past and his claims.\n\n**\\~Very Long Post\\~**\n\nLet’s start by talking about who Tom Nash is &amp; says he is. He is a new &amp; trendy “finance &amp; stock market” YouTuber which has recently passed 150K subscribers after exploding during this retail investor boom, but here is a short [video](https://imgur.com/yuNMUlv) from his YouTube describing himself.\n\nIn the video he is claiming he is a former “senior financial analyst” which is very hard to believe in my opinion after doing a lot of research about him.\n\nSo let’s go through the **5 reasons** I believe he is lying about his past &amp; why you should never take anything any YouTuber out there says for granted and you should do your own research as well:\n\n**1)  Let’s start with the biggest one, his valuation methods are flawed**\n\nEven though he has posted some videos that have panned out, it’s very hard to differentiate good analysis from pure luck in this recent bull market, even monkeys could throw darts at stocks in the past 11 months and be right after the March sell-off.\n\nI was pretty curious of his valuation methods so I joined his channel membership and asked him a direct question, about his DCF valuation, to which he [responded](https://imgur.com/Zdtm2dI) bluntly that I am doing things wrong. I also sent him a direct link to a well-known financial institute, where we can see that the most common cash flow used for financial [modeling](https://imgur.com/MSJgiSk), which is the unlevered free cash flow, implies that you subtract any capital expenditures of the company, which contradicts the way he sees it and is plain wrong, it’s like he uses 2nd grade math, if you subtract a negative number then your cash flow actually increases, which doesn’t even make sense. How can something that costs you money be a positive on the free cash flow?\n\nI’ll let you digest this as I will next show you some of his DCF valuations &amp; how he uses absurd numbers and changes the formulas as he pleases just to reach some insane valuations for companies just to be catchy.\n\nHere are a couple of short extracts from his Salesforce DCF calculations,\n\n[**Exibit A**](https://streamable.com/vu2agx) \\- everything seems legit until here, now he starts with the biggest mistake in this DCF\n\n[**Exibit B**](https://imgur.com/BWeAZw8) \\- I’ll be blunt you can never, ever add the Capex number to a DCF valuation, that literally throws the hole calculations off, but let’s continue…\n\n[**Exibit C**](https://imgur.com/LgHKupD) \\- So, using a discount rate of 6% is also insane, even with the current low interest rates, you should at least discount the average [SP500](https://imgur.com/YTxt90T) return, or use the WACC or any other type of metric, which is much safer than picking out a single company, as the SP500 has proven over long-stretches to be a great performer.\n\nBut yeah guys, this isn’t the first time he has done these kind of errors, you can see he is using most of these methods in many stock picks which are then spread out to thousands of new investors, who don’t really have the knowledge to test what he is saying. I’m just showing you here a couple of stocks like [Dynatrace](https://imgur.com/hAO37u8), [Opendoor](https://imgur.com/66rMYZe), [Alibaba](https://imgur.com/ikLetLL), [Peloton](https://imgur.com/WRoLdIL), [Salesforce](https://imgur.com/D9Ky3gl) as I showed in the previous video and even [Apple](https://imgur.com/g8k7ZxA) that have been analyzed and spread to the public this way.\n\nThe other big issue with his valuations is that he is using insane long-term growth rates, as he used a 5% growth rate for [Peloton](https://imgur.com/EV2WB9Y) to reach a higher valuation, so can you imagine? If Peloton grows at a 5% rate in perpetuity it means they should more than double the inflation [rate](https://imgur.com/xaN3Dxw) every year and is way higher than any GDP [growth](https://imgur.com/Jkk01c9) the US has seen since 1984.\n\nHe is also [implying](https://imgur.com/Wkd2AV8) that Peloton has no debt on it’s balance sheet, which is 100% false, as you can see [HERE](https://imgur.com/rsB0fJg), he used the cash, cash equivalents &amp; marketable securities to calculate the short term assets while completely ignoring the over $700M in accounts payable no to mention the other current liabilities which would add up to almost exactly the $1.4B in assets he added to his calculations.\n\nBut who knows guys? Maybe he is the real deal, as he has made some [correct](https://imgur.com/v3ZYhSU) DCF implications for some stocks like [Fortinet](https://imgur.com/kCTo7jC) and [FuboTV](https://imgur.com/vojljFt), by actually subtracting the Capex finally, though he doesn’t do this in every analysis, not even in the most recent ones while also keeping that big long-term growth rate at 5%, when I myself never use a bigger one than 4%.\n\nJust for an [example](https://imgur.com/tnWSWVa) I took his CRM numbers and popped them up in my spreadsheets, and even given his methods I couldn’t quite get to the same results without manually editing numbers, as those implications resulted in a 7% undervaluation for the stock, while only adjusting the Capex to be a negative on the cashflows and not touching anything else that might be wrong in this DCF, [resulted](https://imgur.com/5vxgKqI) in a 10% overvaluation for the stock.\n\nSo, I think if he really was a 10+ years wall street analyst I don’t think he could have made these obvious mistakes.\n\n**2) So, Is Tom Nash whom he says he is or is he lying about his past?**\n\n[HERE](https://imgur.com/wbJ8Csh) is the channel intro for his YouTube (Which I can't even see anymore, but i was lucky to download it a couple of days ago)\n\nAs you Can see, I don’t doubt that he actually went to Michigan or that he got and MBA, but I do doubt that all of his Successful “Senior” Financial analyst &amp; consulting Career can be described with only a couple of weak-ass photos of him at an NBA game, or him casually at some kind of a course program as that is exactly what it looks like with the other guys in the back-left of the photo.\n\nAlso, are we to believe all of this great financial career ended with him just taking out his fake plant from his office, while also smiling as he threw away at least a decent salary for a gamble on YouTube, which is very hard to do, especially when you are starting, as YouTube doesn’t really help the small guys.\n\nHis YouTube journey seemed to have [started](https://imgur.com/ECzNGcE) on the path of exposing guru’s and not financial advice, as he also says in the video, so how did he turn to do financial analysis on YouTube? Seems pretty convenient that he just became an expert in stock analysis as YouTube videos on such things were booming.\n\nYou can see [HERE](https://imgur.com/Vq4ov7x), he didn’t make a single stock analysis for the most part of 2020, which seems pretty off, as now most of his videos are on stock analysis, and while his channel was created in 2017, he conveniently deleted all the previous videos, which is another weird move to do.\n\nI also went on a deep internet dive and did a lot of searching about him and I found this video [podcast](https://imgur.com/09mBKRU) of him.\n\nHis main intro in this podcast is that he works as a consultant indeed, from Israel, and also the consultancy job isn’t for a financial company, it’s rather to help people on YouTube grow, so let's look at some extracts from the video:\n\n[**Exibit I**](https://streamable.com/xrbv3o) \\- We can see the main part of the talk is nothing about anything related to his financial past, let’s continue\n\n[**Exibit II**](https://imgur.com/Ziftnpi) \\- It seems he started with a gaming channel, not even a fake guru channel, and I also found something about that FB [GROUP](https://imgur.com/Xdt4H1i) which isn’t active anymore and all of the videos he made for that have also been deleted as you can see in this [post](https://imgur.com/FyKSrIq) from way back in 2018 as he was [teaching](https://imgur.com/T5lbbH2) how to make money on YouTube well through 2019, and was even giving out free workshop [experiences](https://imgur.com/K89Yk3S)  as he was pumping out creator [content](https://imgur.com/z196rMB) which is miles apart from financial analysis (BTW, he is using the same freaking photo in his old banner &amp; logo as his current one, just changing the green screen background), just look at [his](https://imgur.com/JUnuYDE) old YouTube banner (YouTube tips &amp; tutorials)\n\n[**Exibit III**](https://imgur.com/kZddAl3) \\- Yeah, it seems he also did some video on how to promote on Reddit, and what comes next guys is literally mind blowing, how much more can this dude lie &amp; hide?\n\n[**Exibit IV**](https://streamable.com/ji6ne2) \\-  Well… Nothing to hide then… He even had a Fiverr account which was called tomernash you can see clearly [HERE](https://imgur.com/topDW52), that is his username, and when I went out to check it out right now, he is [using](https://imgur.com/HVqNkwv) a fake picture &amp; and still might live in Israel, not the US, and on top of this he might not actually even be from Russia, which he has been saying over &amp; over again on his channel. You can [SEE](https://imgur.com/18Yiimf) he reiterates he is a certified YouTube consultant with no mention of his financial skills or certifications.\n\nAnd even more, you see what picture he uses as a logo yeah? Well, I did a reverse google search and found the other guy also has a YouTube [channel](https://imgur.com/DWpofDb) about kinetic cycling.\n\nMaybe he was one of his clients that he reached a deal to use his picture, wtf, the more I dig in the more I am amazed of the lengths this man has gone to reach fame on YouTube.\n\n[**Exibit V**](https://streamable.com/sdtd7d) \\- So… A financial analyst with no sheets, no paper, no nothing, great stuff for a senior financial analyst, I literally can’t take more of this so let’s move to the next reasons\n\n**3) Getting in front of the lie?**\n\nI believe that’s what he was trying to do to, by making a [VIDEO](https://imgur.com/CeH7ePh) on this very subject in mid-2020 and popping up higher in the search rankings before his channel boomed.\n\nIn the video he clarifies that Tom Nash isn’t his real name, but he also restated that he was working for a big consultancy firm as recent as this summer, and that he does shit tons of stuff which is very hard to believe, as usually this big consultancy firms have different departments for different things that he mentioned in the video. You can still find that video on his channel if you are interested\n\nBut, by the way, how was he working on that job while also doing hundreds of Fiverr jobs as a YouTube consultant?\n\nHe also claims to not offering any courses, e-books or other stuff like this, which is false as i showed in the previous reasons with his past YouTube courses &amp; other stuff, and as you will see in the next reasons, something smells really bad out here.\n\n**4) Claims about his past**\n\nI also took a deeper dive into more of his past, as you can see in [his](https://imgur.com/ECzNGcE) previous channel cover and info, he had only about 4K subscribers as he was doing guru video reviews on YouTube, but all of a sudden, he [became](https://imgur.com/r6X2yHg) a senior financial analyst from wall street that was living in Israel &amp; doing Fiverr gigs, I don’t know what to say but it seems pretty fishy to me.\n\nI also checked his LinkedIn [page](https://imgur.com/Xpbq7Im), and all of his skills &amp; endorsements seem to be related to his YouTube skills and nothing about finance or the stock market.\n\nBut I also found his [profile](https://imgur.com/9FxHnCb) on Quora, where he wasn’t that active but still, well back in [2017](https://imgur.com/EUPer8h) he was posting things about gaming &amp; YouTube while supposedly still working on Wall Street as a financial analyst, and it’s interesting that there is no [mention](https://imgur.com/kcpxh2X) of him following anything related to stocks, finance, economy, accounting, statistics or anything other related to the stock market.\n\nSo yeah guys, I guess when you make a new type of video and it boosts your channel from just [10K](https://imgur.com/GEvQ7yB) subscribers all the way up to [150K](https://imgur.com/3F0D4rI) subscribers, you are willing to push the limits and lie about your past just to keep everything going, as YouTube is a really good way to make money right now.\n\n**5) The Transformation**\n\nHe has had even more channels in the past not only this one, which he has transformed overnight from a YouTube Channel [Reviewer](https://imgur.com/JUnuYDE) to a Guru [Reviewer](https://imgur.com/ECzNGcE) and finally to a financial [analyst](https://imgur.com/oCIBljZ) , as He created a second &amp; third YouTube account called [GearlyReviews](https://imgur.com/9vAPlu3) where he reviews electronics and [EuroBall](https://imgur.com/G130Wgr) where he only posted 2 videos.\n\nI also searched him through his Reddit [posts](https://imgur.com/zmsRhbB) and only could find things related to marketing &amp; social media, nothing about finance yet again.\n\n# So, my personal opinion which I doubt to be wrong guys, if there is a case of a dubious &amp; fishy person out there, he is one of them.\n\nI believe that he has never worked as a senior financial analyst and especially not a stock market, asset or any other type of equity analyst.\n\nMost of his stock [picks](https://imgur.com/uOgFNkQ) are small-caps that are highly volatile or a couple of recent high flyers which are very catchy to any YouTube audience.\n\nThere are many things wrong about the picture he has painted about himself even though he has gone through a lot to try and erase his past. The fact that there are no mentions of things from the wall street or consulting firm, bad stock analysis and methods, fishy and dubious moves of his YouTube channels and especially fishy things about him being a consultant &amp; analyst in early 2020 while he was already doing YouTube and other stuff back in 2017-2018 really makes me not want to buy his story.\n\nFolks, be careful out there, you can find a lot of YouTubers out there who make more money from their advice giving on YouTube, Patreon or other kind of subscriptions and courses, compared to the actual money they are making or have ever made in the stock market.\n\nSo yeah guys, I don’t want to make a final judgment on this guy, but you should consider everything I have showed about him and all the problems with his past &amp; his financial methods &amp; just remember as always **in a bull market everyone is an expert &amp; genius**, while in a bear market you can’t find any of these people as they all flee.\n\nThank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion! Have a great day and see you next time❗",
        "subreddit": "stocks",
        "title": "Never Blindly Follow All \"Stock Market\" YouTubers | Possible Exposed Fraud [Tom Nash] &amp; The 5 Reasons Why I Believe Tom Nash Is Lying",
        "url": "https://www.reddit.com/r/stocks/comments/lhjy1m/never_blindly_follow_all_stock_market_youtubers/",
        "created": 1613076337.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1613047533,
        "id": "lhjy0l",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "**Hello everyone! This isn’t my usual kind of post, but man, I can’t stand to see how people just follow every freaking YouTuber out there blindly!** In this post, we are going to talk about why I believe Tom Nash may be a **fraud**, so please do have some patience and read the full post, as I will go through an in-depth research of his past and his claims.\n\n**\\~Very Long Post\\~**\n\nLet’s start by talking about who Tom Nash is &amp; says he is. He is a new &amp; trendy “finance &amp; stock market” YouTuber which has recently passed 150K subscribers after exploding during this retail investor boom, but here is a short [video](https://imgur.com/yuNMUlv) from his YouTube describing himself.\n\nIn the video he is claiming he is a former “senior financial analyst” which is very hard to believe in my opinion after doing a lot of research about him.\n\nSo let’s go through the **5 reasons**💩 I believe he is lying about his past &amp; why you should never take anything any YouTuber out there says for granted and you should do your own research as well:\n\n**1)  Let’s start with the biggest one, his valuation methods are flawed ❌**\n\nEven though he has posted some videos that have panned out, it’s very hard to differentiate good analysis from pure luck in this recent bull market, even monkeys could throw darts at stocks in the past 11 months and be right after the March sell-off.\n\nI was pretty curious of his valuation methods so I joined his channel membership and asked him a direct question, about his DCF valuation, to which he [responded](https://imgur.com/Zdtm2dI) bluntly that I am doing things wrong. I also sent him a direct link to a well-known financial institute, where we can see that the most common cash flow used for financial [modeling](https://imgur.com/MSJgiSk), which is the unlevered free cash flow, implies that you subtract any capital expenditures of the company, which contradicts the way he sees it and is plain wrong, it’s like he uses 2nd grade math, if you subtract a negative number then your cash flow actually increases, which doesn’t even make sense. How can something that costs you money be a positive on the free cash flow?\n\nI’ll let you digest this as I will next show you some of his DCF valuations &amp; how he uses absurd numbers and changes the formulas as he pleases just to reach some insane valuations for companies just to be catchy.\n\nHere are a couple of short extracts from his Salesforce DCF calculations,\n\n[**Exibit A**](https://streamable.com/vu2agx) \\- everything seems legit until here, now he starts with the biggest mistake in this DCF\n\n[**Exibit B**](https://imgur.com/BWeAZw8) \\- I’ll be blunt you can never, ever add the Capex number to a DCF valuation, that literally throws the hole calculations off, but let’s continue…\n\n[**Exibit C**](https://imgur.com/LgHKupD) \\- So, using a discount rate of 6% is also insane, even with the current low interest rates, you should at least discount the average [SP500](https://imgur.com/YTxt90T) return, or use the WACC or any other type of metric, which is much safer than picking out a single company, as the SP500 has proven over long-stretches to be a great performer.\n\nBut yeah guys, this isn’t the first time he has done these kind of errors, you can see he is using most of these methods in many stock picks which are then spread out to thousands of new investors, who don’t really have the knowledge to test what he is saying. I’m just showing you here a couple of stocks like [Dynatrace](https://imgur.com/hAO37u8), [Opendoor](https://imgur.com/66rMYZe), [Alibaba](https://imgur.com/ikLetLL), [Peloton](https://imgur.com/WRoLdIL), [Salesforce](https://imgur.com/D9Ky3gl) as I showed in the previous video and even [Apple](https://imgur.com/g8k7ZxA) that have been analyzed and spread to the public this way.\n\nThe other big issue with his valuations is that he is using insane long-term growth rates, as he used a 5% growth rate for [Peloton](https://imgur.com/EV2WB9Y) to reach a higher valuation, so can you imagine? If Peloton grows at a 5% rate in perpetuity it means they should more than double the inflation [rate](https://imgur.com/xaN3Dxw) every year and is way higher than any GDP [growth](https://imgur.com/Jkk01c9) the US has seen since 1984.\n\nHe is also [implying](https://imgur.com/Wkd2AV8) that Peloton has no debt on it’s balance sheet, which is 100% false, as you can see [HERE](https://imgur.com/rsB0fJg), he used the cash, cash equivalents &amp; marketable securities to calculate the short term assets while completely ignoring the over $700M in accounts payable no to mention the other current liabilities which would add up to almost exactly the $1.4B in assets he added to his calculations.\n\nBut who knows guys? Maybe he is the real deal, as he has made some [correct](https://imgur.com/v3ZYhSU) DCF implications for some stocks like [Fortinet](https://imgur.com/kCTo7jC) and [FuboTV](https://imgur.com/vojljFt), by actually subtracting the Capex finally, though he doesn’t do this in every analysis, not even in the most recent ones while also keeping that big long-term growth rate at 5%, when I myself never use a bigger one than 4%.\n\nJust for an [example](https://imgur.com/tnWSWVa) I took his CRM numbers and popped them up in my spreadsheets, and even given his methods I couldn’t quite get to the same results without manually editing numbers, as those implications resulted in a 7% undervaluation for the stock, while only adjusting the Capex to be a negative on the cashflows and not touching anything else that might be wrong in this DCF, [resulted](https://imgur.com/5vxgKqI) in a 10% overvaluation for the stock.\n\nSo, I think if he really was a 10+ years wall street analyst I don’t think he could have made these obvious mistakes.\n\n**2) So, Is Tom Nash whom he says he is or is he lying about his past? ❌**\n\n[HERE](https://imgur.com/wbJ8Csh) is the channel intro for his YouTube (Which I can't even see anymore, but i was lucky to download it a couple of days ago)\n\nAs you Can see, I don’t doubt that he actually went to Michigan or that he got and MBA, but I do doubt that all of his Successful “Senior” Financial analyst &amp; consulting Career can be described with only a couple of weak-ass photos of him at an NBA game, or him casually at some kind of a course program as that is exactly what it looks like with the other guys in the back-left of the photo.\n\nAlso, are we to believe all of this great financial career ended with him just taking out his fake plant from his office, while also smiling as he threw away at least a decent salary for a gamble on YouTube, which is very hard to do, especially when you are starting, as YouTube doesn’t really help the small guys.\n\nHis YouTube journey seemed to have [started](https://imgur.com/ECzNGcE) on the path of exposing guru’s and not financial advice, as he also says in the video, so how did he turn to do financial analysis on YouTube? Seems pretty convenient that he just became an expert in stock analysis as YouTube videos on such things were booming.\n\nYou can see [HERE](https://imgur.com/Vq4ov7x), he didn’t make a single stock analysis for the most part of 2020, which seems pretty off, as now most of his videos are on stock analysis, and while his channel was created in 2017, he conveniently deleted all the previous videos, which is another weird move to do.\n\nI also went on a deep internet dive and did a lot of searching about him and I found this video [podcast](https://imgur.com/09mBKRU) of him.\n\nHis main intro in this podcast is that he works as a consultant indeed, from Israel, and also the consultancy job isn’t for a financial company, it’s rather to help people on YouTube grow, so let's look at some extracts from the video:\n\n[**Exibit I**](https://streamable.com/xrbv3o) \\- We can see the main part of the talk is nothing about anything related to his financial past, let’s continue\n\n[**Exibit II**](https://imgur.com/Ziftnpi) \\- It seems he started with a gaming channel, not even a fake guru channel, and I also found something about that FB [GROUP](https://imgur.com/Xdt4H1i) which isn’t active anymore and all of the videos he made for that have also been deleted as you can see in this [post](https://imgur.com/FyKSrIq) from way back in 2018 as he was [teaching](https://imgur.com/T5lbbH2) how to make money on YouTube well through 2019, and was even giving out free workshop [experiences](https://imgur.com/K89Yk3S)  as he was pumping out creator [content](https://imgur.com/z196rMB) which is miles apart from financial analysis (BTW, he is using the same freaking photo in his old banner &amp; logo as his current one, just changing the green screen background), just look at [his](https://imgur.com/JUnuYDE) old YouTube banner (YouTube tips &amp; tutorials)\n\n[**Exibit III**](https://imgur.com/kZddAl3) \\- Yeah, it seems he also did some video on how to promote on Reddit, and what comes next guys is literally mind blowing, how much more can this dude lie &amp; hide?\n\n[**Exibit IV**](https://streamable.com/ji6ne2) \\-  Well… Nothing to hide then… He even had a Fiverr account which was called tomernash you can see clearly [HERE](https://imgur.com/topDW52), that is his username, and when I went out to check it out right now, he is [using](https://imgur.com/HVqNkwv) a fake picture &amp; and still might live in Israel, not the US, and on top of this he might not actually even be from Russia, which he has been saying over &amp; over again on his channel. You can [SEE](https://imgur.com/18Yiimf) he reiterates he is a certified YouTube consultant with no mention of his financial skills or certifications.\n\nAnd even more, you see what picture he uses as a logo yeah? Well, I did a reverse google search and found the other guy also has a YouTube [channel](https://imgur.com/DWpofDb) about kinetic cycling.\n\nMaybe he was one of his clients that he reached a deal to use his picture, wtf, the more I dig in the more I am amazed of the lengths this man has gone to reach fame on YouTube.\n\n[**Exibit V**](https://streamable.com/sdtd7d) \\- So… A financial analyst with no sheets, no paper, no nothing, great stuff for a senior financial analyst, I literally can’t take more of this so let’s move to the next reasons\n\n**3) Getting in front of the lie? ❌**\n\nI believe that’s what he was trying to do to, by making a [VIDEO](https://imgur.com/CeH7ePh) on this very subject in mid-2020 and popping up higher in the search rankings before his channel boomed.\n\nIn the video he clarifies that Tom Nash isn’t his real name, but he also restated that he was working for a big consultancy firm as recent as this summer, and that he does shit tons of stuff which is very hard to believe, as usually this big consultancy firms have different departments for different things that he mentioned in the video. You can still find that video on his channel if you are interested\n\nBut, by the way, how was he working on that job while also doing hundreds of Fiverr jobs as a YouTube consultant?\n\nHe also claims to not offering any courses, e-books or other stuff like this, which is false as i showed in the previous reasons with his past YouTube courses &amp; other stuff, and as you will see in the next reasons, something smells really bad out here.\n\n**4) Claims about his past ❌**\n\nI also took a deeper dive into more of his past, as you can see in [his](https://imgur.com/ECzNGcE) previous channel cover and info, he had only about 4K subscribers as he was doing guru video reviews on YouTube, but all of a sudden, he [became](https://imgur.com/r6X2yHg) a senior financial analyst from wall street that was living in Israel &amp; doing Fiverr gigs, I don’t know what to say but it seems pretty fishy to me.\n\nI also checked his LinkedIn [page](https://imgur.com/Xpbq7Im), and all of his skills &amp; endorsements seem to be related to his YouTube skills and nothing about finance or the stock market.\n\nBut I also found his [profile](https://imgur.com/9FxHnCb) on Quora, where he wasn’t that active but still, well back in [2017](https://imgur.com/EUPer8h) he was posting things about gaming &amp; YouTube while supposedly still working on Wall Street as a financial analyst, and it’s interesting that there is no [mention](https://imgur.com/kcpxh2X) of him following anything related to stocks, finance, economy, accounting, statistics or anything other related to the stock market.\n\nSo yeah guys, I guess when you make a new type of video and it boosts your channel from just [10K](https://imgur.com/GEvQ7yB) subscribers all the way up to [150K](https://imgur.com/3F0D4rI) subscribers, you are willing to push the limits and lie about your past just to keep everything going, as YouTube is a really good way to make money right now.\n\n**5) The Transformation ❌**\n\nHe has had even more channels in the past not only this one, which he has transformed overnight from a YouTube Channel [Reviewer](https://imgur.com/JUnuYDE) to a Guru [Reviewer](https://imgur.com/ECzNGcE) and finally to a financial [analyst](https://imgur.com/oCIBljZ) , as He created a second &amp; third YouTube account called [GearlyReviews](https://imgur.com/9vAPlu3) where he reviews electronics and [EuroBall](https://imgur.com/G130Wgr) where he only posted 2 videos.\n\nI also searched him through his Reddit [posts](https://imgur.com/zmsRhbB) and only could find things related to marketing &amp; social media, nothing about finance yet again.\n\n# So, my personal opinion which I doubt to be wrong guys, if there is a case of a dubious &amp; fishy person out there, he is one of them!\n\nI believe that he has never worked as a senior financial analyst and especially not a stock market, asset or any other type of equity analyst.\n\nMost of his stock [picks](https://imgur.com/uOgFNkQ) are small-caps that are highly volatile or a couple of recent high flyers which are very catchy to any YouTube audience.\n\nThere are many things wrong about the picture he has painted about himself even though he has gone through a lot to try and erase his past. The fact that there are no mentions of things from the wall street or consulting firm, bad stock analysis and methods, fishy and dubious moves of his YouTube channels and especially fishy things about him being a consultant &amp; analyst in early 2020 while he was already doing YouTube and other stuff back in 2017-2018 really makes me not want to buy his story.\n\nFolks, be careful out there, you can find a lot of YouTubers out there who make more money from their advice giving on YouTube, Patreon or other kind of subscriptions and courses, compared to the actual money they are making or have ever made in the stock market.\n\nSo yeah guys, I don’t want to make a final judgment on this guy, but you should consider everything I have showed about him and all the problems with his past &amp; his financial methods &amp; just remember as always **in a bull market everyone is an expert &amp; genius**, while in a bear market you can’t find any of these people as they all flee.\n\nThank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion! Have a great day and see you next time❗",
        "subreddit": "wallstreetbets",
        "title": "Never Blindly Follow All \"Stock Market\" YouTubers | Possible Exposed Fraud [Tom Nash 💩] &amp; The 5 Reasons Why I Believe Tom Nash Is Lying",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lhjy0l/never_blindly_follow_all_stock_market_youtubers/",
        "created": 1613076333.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "SnooObjections2665",
        "created_utc": 1613548185,
        "id": "llp5ds",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I think that cybersecurity will be this years winner (yes, maybe even more than semi-conductors). I want to pick 3 stocks to hold for the next 5+ years. I have a brief description (from yahoo finance I know...) what they do, my suggestions are: \n\n  \n**CRWD - Crowdstrike Holdings.** provides a broad spectrum of solutions with their main aim being intrusion and breach prevention, such as some of the breaches they helped investigate – high-profile cases such as Sony Pictures and the DNC.\n\n**FTNT** \\- **Fortinet**  is one of the dominant players in the Unified Threat Management (UTM) space, which is one of the fastest-evolving segments in the network security space.\n\nThe company’s ability to meld next-generation, cloud-based firewalls with SD-WAN allows it to grab an early lead in the SASE market. Its Opaq Networks buyout in July will act like a catalyst. Also, this company has been gaining from heightening cyber-attack risks that are propelling demand for its FortiMail platform.\n\n**PANW - Palo Alto Networks** is a giant when it comes to providing firewalls and various cloud-based services to extend the functionalities of these firewalls. They have a multinational market, outperforming even Cisco in this year’s second quarter.\n\nEqually, when it comes to trading, the number of bullish hedge fund positions moved up by 8 in recent months. The company was in 59 hedge funds’ portfolios at the end of the third quarter of 2020. The all time high for this statistics is 52. This means the bullish number of hedge fund positions in this stock **currently sits at its all time high**.\n\n**OKTA: Okta** provides identity authentication services. This means building a way to verify and enforce who accesses what at any given time, from your run-of-the-mill passwords to biometrics. Okta has been a strong up-and-comer since last year it almost doubled its revenue and beat analysts’ predictions by some $11 million.\n\nStarting with a mainly SMB-oriented client pool, Okta has since leveled up to serving **over 1400 enterprises** with **revenue over $100 000** out of 8000 reported clients. This number continues to grow rapidly.\n\n**NET** \\- **Cloudflare**: is a leader in edge computing. It handles a good part of the traffic the average consumer goes through online today. With services such as DDoS mitigation and internet security, it acts like a reverse proxy between you and the websites you visit.\n\nAside from establishing itself as an internet power, Cloudflare had its IPO on the New York Stock Exchange just last year. This year it has been one of the best-performing US stocks, currently **being found on 44 hedge fund portfolios**, way above its all time high of 33.\n\n&amp;#x200B;\n\nwhich 3 should I choose? Or any other suggestions? All of them had insane growth in the last year, some with very high p/e ratios.",
        "subreddit": "stocks",
        "title": "Best CyberSecurity stocks 2021",
        "url": "https://www.reddit.com/r/stocks/comments/llp5ds/best_cybersecurity_stocks_2021/",
        "created": 1613576985.0
    },
    {
        "author": "FikerGaming",
        "created_utc": 1613766331,
        "id": "lnplr1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " So hedge funds use alot time and money to find what stocks are trending on WSB sub pages. so here are some to help them out. They need our help, you are welcome hedge funds.\n\nfeel free to copy this and spread it.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The hedge funds need our Help.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lnplr1/the_hedge_funds_need_our_help/",
        "created": 1613795131.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "JaytotheEnny",
        "created_utc": 1613762830,
        "id": "lno8kc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I heard about all of the hedge funds working really, really hard on building these trackers that crawl through all of our posts looking for the next big hit. I feel so bad for those little-widdle hedgie funds and wanted to put together a great list for them. \n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JAP, JAP, JAP JAP, JAP JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TATE, TATE, TATE, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Here are some stocks that I like- for all those trackers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lno8kc/here_are_some_stocks_that_i_like_for_all_those/",
        "created": 1613791630.0
    },
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "DannyUpper90",
        "created_utc": 1613002719,
        "id": "lh85fw",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "Cramer said tonight Biden needs to focus on US manufacturing of chips. Last Friday, Biden officials had Dow Corning in to discuss chip shortage. They are a leading US manufacturer of silicone under Hemlock Semiconductors who they own. Anybody know anything about GLW?\n\nLink to article saying senior Biden officials met with Dow Corning:\n\nhttps://finance.yahoo.com/news/chip-shortage-spirals-beyond-cars-200059989.html\n\nThis seem like a good play? Anybody done DD on GLW?",
        "subreddit": "wallstreetbets",
        "title": "GLW - semiconductor chip shortage",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lh85fw/glw_semiconductor_chip_shortage/",
        "created": 1613031519.0
    },
    {
        "author": "goldensn1per3",
        "created_utc": 1613240002,
        "id": "lj5s7e",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "I am a young investor in my early 20s. I feel like I have some solid stocks in my portfolio consisting of dividends and capital growth. Feel like i should cut down on the amount of stocks i have and just stick to a select few which I can ride for the long term. My portfolio consists of:\n\n1. MSFT - 25 shares\n2. ENB - 102\n3. TRP.TO - 93\n4. BNS.TO - 92\n5. CNR.TO - 35\n6. PLTR - 60\n7. CAE.TO - 25\n8. CARR - 34\n9. GLW - 80\n10. WELL.TO - 105\n11. MMED - 322\n12. MTRX.V - 440\n13. GRN.V - 1043\n14. NIO - 27\n\nAny socks that I should keep adding to? Which ones should I trim or drop? Any new ones to consider?",
        "subreddit": "CanadianInvestor",
        "title": "Which stocks to concentrate on?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/lj5s7e/which_stocks_to_concentrate_on/",
        "created": 1613268802.0
    },
    {
        "author": "DivineIntent",
        "created_utc": 1613295038,
        "id": "ljlfe8",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "first DD, hope I do ok! this is not financial advice, I am a dunce mostly. Do your own research! With that said, Tuesday I am buying $38 and $42 calls for next month  and buying every dip when I get my last check from McDonald’s this week.\r\n\r\n$GLW corning incorporated \r\nmarket cap; 28.18 Billion\r\nP/E ratio 55.61\r\ndividend yield %2.6\r\nInstitutional ownership 77%\r\n\r\n\r\n\r\nWhy should a company that has been in business for 170 years with a solid track record of innovation and diversity only be worth $36 a share? 170 years of proven business accumen and multiple industries. Now I will step off my soapbox and lay out the argument for why this stock is undervalued right now.\r\n\r\nThis company is in 7 major industries and poised to break ahead in at least 2. I will take them one at a time and provide examples. browse their expansive list of patents and products, i will highlight a few with more links and comparison to other industry related companies below. \r\n\r\n\toptical communications (5g, Optical fiber, etc etc)\r\nmultiple patents and competitive pricing \r\n\r\nsimilar company Lumentum holdings $LITE\r\nmarket cap 5.91B\r\nprice per share- $93\r\nP/E ratio $39.15\r\nDividend Yield X\r\nInstitutional ownership 91%\r\n\r\nhttps://investorplace.com/2020/03/3-5g-fiber-optic-stocks-to-buy/\r\n\r\n\tmobile consumer electronics\r\n\r\nthis market is poised for a breakout on their part, due to a shortage of semiconductor chips due to increased demand.\r\n\r\nhttps://www.cnbc.com/2021/02/10/whats-causing-the-chip-shortage-affecting-ps5-cars-and-more.html\r\n\r\nsimilar company taiwan semiconductors $TSM\r\nprice per share- $138\r\nmarket cap 581B\r\nP/E ratio $38.70\r\ndividend yield 1.56\r\ninstitutional ownership 20%\r\n\r\n\tlife science glassware\r\nThis industry has been hit hard by supply chain issues and corning is gaining traction due to not experiencing the same issues, to top it off they have a superior product at competitive pricing. Oh and then they just received a grant from the goverment to make these vials for the covid vaccine. Once they hit the market that hard, they wont go away.\r\n\r\nsimilar company Danaher corporation\r\nmarket cap 174B\r\nprice per share- $245\r\nP/E ratio 50.29\r\nDividend yield .26%\r\ninstitutional ownership 80%\r\n\r\nhttps://www.ismworld.org/supply-management-news-and-reports/news-publications/inside-supply-management-magazine/blog/2020-09/when-bottles-as-in-medical-vials-become-the-bottleneck/\r\n\r\nhttps://www.reuters.com/article/us-health-coronavirus-corning/corning-wins-u-s-funding-to-boost-vial-output-for-covid-19-vaccines-idUSKBN23G1YY",
        "subreddit": "wallstreetbets",
        "title": "$GLW versatile and underpriced! Autists unite",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ljlfe8/glw_versatile_and_underpriced_autists_unite/",
        "created": 1613323838.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "jakobebryant",
        "created_utc": 1613164077,
        "id": "liksp0",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Per recent automotive (Ford, GM, Toyota, VW, + more) vehicle production and computer chip delays/shortages (Intel, Apple, Qualcomm, NVIDIA, AMD, Microsoft, Sony, + more), the Biden administration is taking steps to address the semiconductor chip issues.\n\nRight now a big chunk of the semiconductor business is dependent on international-based manufacturers:\n\n\"The missing chips are mostly manufactured in countries such as Taiwan and Korea, which have come to dominate the industry. The letter, sent by the Semiconductor Industry Association, said that the U.S. share of semiconductor manufacturing dropped from 37% in 1990 to 12% today.\"\n\n(Source: [https://www.reuters.com/article/us-usa-semiconductors/u-s-chip-industry-calls-on-biden-administration-to-fund-factories-idUSKBN2AB11H](https://www.reuters.com/article/us-usa-semiconductors/u-s-chip-industry-calls-on-biden-administration-to-fund-factories-idUSKBN2AB11H))\n\n“Our share of global semiconductor manufacturing has steadily declined from 37 percent in 1990 to 12 percent today,” the companies wrote. “This is largely because the governments of our global competitors offer significant incentives and subsidies to attract new semiconductor manufacturing facilities, while the U.S. does not.”\n\n(Source: [https://thehill.com/policy/technology/538474-biden-to-sign-executive-order-addressing-chip-supply-chain-shortage](https://thehill.com/policy/technology/538474-biden-to-sign-executive-order-addressing-chip-supply-chain-shortage))\n\n\"The Semiconductor Industry Association, which includes AMD, IBM, Intel, Nvidia, Qualcomm, and others, suggested one idea [in a letter to Biden](https://www.semiconductors.org/wp-content/uploads/2021/02/SIA-Letter-to-Pres-Biden-re-CHIPS-Act-Funding.pdf) on Thursday morning. The group urged the administration to include “substantial funding for incentives for semiconductor manufacturing, in the form of grants and / or tax credits, and for basic and applied semiconductor research,” in the upcoming stimulus package. But it’s unclear if the administration intends to do that.\"\n\n(Source: [https://www.theverge.com/2021/2/11/22278431/biden-administration-global-semiconductor-chip-shortage-executive-order](https://www.theverge.com/2021/2/11/22278431/biden-administration-global-semiconductor-chip-shortage-executive-order))\n\n\\*GSM enters the chat.\\*\n\nPre-2018, GSM was a $15-$20 stock and took a hit in 2018 partly due to:\n\nMarch 23, 2018\n\n\"Earlier this month the U.S. Department of Commerce determined that silicon metals sold in the U.S. by Australia, Brazil, and Kazakhstan were at less than fair value and subsidized by the governments of those countries at rates as high as 100%. However, the ITC determined that this isn't materially injuring the U.S. industry. As such, the ITC will not issue [anti-dumping](https://www.fool.com/investing/general/2015/07/31/does-canadas-anti-dumping-decision-mean-lights-out.aspx?&amp;utm_campaign=article&amp;utm_medium=feed&amp;referring_guid=e17a88f3-8d85-47f7-bbb9-c9fce5c9d3b5&amp;utm_source=nasdaq) or other duties on these goods.\"\n\n(Source: [https://www.nasdaq.com/articles/why-ferroglobe-plcs-stock-tumbling-today-2018-03-23](https://www.nasdaq.com/articles/why-ferroglobe-plcs-stock-tumbling-today-2018-03-23))\n\nAs of lately with discussions revolving around the shortage and delays, the stock's risen 500% within the last few months.\n\nSemiconductors' most common material is silicon crystals, and one of America's biggest silicon metal producers is GSM:\n\n\"Globe Specialty Metals, Inc., a subsidiary of Ferroglobe PLC (NASDAQ:[GSM](https://www.prnewswire.com/news-releases/us-silicon-metal-producers-itc-finds-harm-caused-by-imports-from-bosnia-and-herzegovina-iceland-malaysia-and-kazakhstan-301112181.html#financial-modal)) (\"GSM\"), and Mississippi Silicon LLC (\"MS\"), collectively representing the majority of American silicon metal production, today announced that the U.S. International Trade Commission (\"ITC\") will continue investigating the harm caused by imports of silicon metal into the United States. The announcement comes after Commissioners voted 5-0 that there is a \"reasonable indication\" that silicon metal imports from Bosnia and Herzegovina, Iceland, Malaysia and Kazakhstan are materially injuring the U.S. industry.\"\n\n(Source: [https://www.prnewswire.com/news-releases/us-silicon-metal-producers-itc-finds-harm-caused-by-imports-from-bosnia-and-herzegovina-iceland-malaysia-and-kazakhstan-301112181.html](https://www.prnewswire.com/news-releases/us-silicon-metal-producers-itc-finds-harm-caused-by-imports-from-bosnia-and-herzegovina-iceland-malaysia-and-kazakhstan-301112181.html))\n\nAnalysis of growing conductive silicon market: [https://ksusentinel.com/2021/02/10/conductive-silicone-market-by-manufacturers-regions-type-and-application-covid-19-impact-analysis-to-2027-major-giants-wacker-chemie-ag-dow-corning-corporation-momentive-performance/](https://ksusentinel.com/2021/02/10/conductive-silicone-market-by-manufacturers-regions-type-and-application-covid-19-impact-analysis-to-2027-major-giants-wacker-chemie-ag-dow-corning-corporation-momentive-performance/)\n\nThis move has the potential for everyone to win. The companies, the economy, us, and even the HFs. Altogether, 💎🙌.\n\nThis isn't financial advice, this is just looking to be a stock that we grow to love.",
        "subreddit": "stocks",
        "title": "$GSM - Biden Addressing Semiconductor Chip Shortage",
        "url": "https://www.reddit.com/r/stocks/comments/liksp0/gsm_biden_addressing_semiconductor_chip_shortage/",
        "created": 1613192877.0
    },
    {
        "author": "DivineIntent",
        "created_utc": 1613295138,
        "id": "ljlg0y",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "\nfirst Post here hope I do ok! this is not financial advice, I am a dunce mostly. Do your own research!\r\n\r\n$GLW corning incorporated \r\nmarket cap; 28.18 Billion\r\nP/E ratio 55.61\r\ndividend yield %2.6\r\nInstitutional ownership 77%\r\n\r\n\r\n\r\nWhy should a company that has been in business for 170 years with a solid track record of innovation and diversity only be worth $36 a share? 170 years of proven business accumen and multiple industries. Now I will step off my soapbox and lay out the argument for why this stock is undervalued right now.\r\n\r\nThis company is in 7 major industries and poised to break ahead in at least 2. I will take them one at a time and provide examples. browse their expansive list of patents and products, i will highlight a few with more links and comparison to other industry related companies below. \r\n\r\n\toptical communications (5g, Optical fiber, etc etc)\r\nmultiple patents and competitive pricing \r\n\r\nsimilar company Lumentum holdings $LITE\r\nmarket cap 5.91B\r\nprice per share- $93\r\nP/E ratio $39.15\r\nDividend Yield X\r\nInstitutional ownership 91%\r\n\r\nhttps://investorplace.com/2020/03/3-5g-fiber-optic-stocks-to-buy/\r\n\r\n\tmobile consumer electronics\r\n\r\nthis market is poised for a breakout on their part, due to a shortage of semiconductor chips due to increased demand.\r\n\r\nhttps://www.cnbc.com/2021/02/10/whats-causing-the-chip-shortage-affecting-ps5-cars-and-more.html\r\n\r\nsimilar company taiwan semiconductors $TSM\r\nprice per share- $138\r\nmarket cap 581B\r\nP/E ratio $38.70\r\ndividend yield 1.56\r\ninstitutional ownership 20%\r\n\r\n\tlife science glassware\r\nThis industry has been hit hard by supply chain issues and corning is gaining traction due to not experiencing the same issues, to top it off they have a superior product at competitive pricing. Oh and then they just received a grant from the goverment to make these vials for the covid vaccine. Once they hit the market that hard, they wont go away.\r\n\r\nsimilar company Danaher corporation\r\nmarket cap 174B\r\nprice per share- $245\r\nP/E ratio 50.29\r\nDividend yield .26%\r\ninstitutional ownership 80%\r\n\r\nhttps://www.ismworld.org/supply-management-news-and-reports/news-publications/inside-supply-management-magazine/blog/2020-09/when-bottles-as-in-medical-vials-become-the-bottleneck/\r\n\r\nhttps://www.reuters.com/article/us-health-coronavirus-corning/corning-wins-u-s-funding-to-boost-vial-output-for-covid-19-vaccines-idUSKBN23G1YY",
        "subreddit": "stocks",
        "title": "historically innovative and resilient company in multiple high demand industries due for a breakout? $GLW",
        "url": "https://www.reddit.com/r/stocks/comments/ljlg0y/historically_innovative_and_resilient_company_in/",
        "created": 1613323938.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "RomeWasBuiltin1Day",
        "created_utc": 1612973270,
        "id": "lgwvr0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "CanadianInvestor",
        "title": "Galway Gold Arbitration (GLW)",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/lgwvr0/galway_gold_arbitration_glw/",
        "created": 1613002070.0
    },
    {
        "author": "DannyUpper90",
        "created_utc": 1613144332,
        "id": "lidina",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GLW - Corning - Semiconductors play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lidina/glw_corning_semiconductors_play/",
        "created": 1613173132.0
    },
    {
        "author": "KelvinMakesBacon",
        "created_utc": 1613112588,
        "id": "li5pg7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Y’all have heard of GME but GLW has the strongest hold. Buy GLW, the strongest hold available!!! 🦍🧴",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/li5pg7/yall_have_heard_of_gme_but_glw_has_the_strongest/",
        "created": 1613141388.0
    },
    {
        "author": "CanadianInvestor98",
        "created_utc": 1613011605,
        "id": "lhb1p2",
        "num_comments": 0,
        "num_crossposts": 3,
        "selftext": "Who are they and what do they do?\n\nQMC Quantum Minerals Corp., is an exploration stage company, engages in the acquisition, exploration, development, and evaluation of resource properties in Canada. The company explores for lithium, copper, nickel, gold, silver, palladium, platinum, and zinc deposits. Its flagship project is the Irgon Lithium Mine, which consists of 22 mining claims totaling 11,325 acres located in Manitoba, Canada. QMC Quantum Minerals Corp. was incorporated in 2003 and is based in Vancouver, Canada.\n\nTowards the end of 2020 there was an announcement that $3.3B CDN in funding would be allocated to build Electric Vehicles (\"EV\") and batteries within Canada. That being said, QMC is ideally positioned to source the required metals.\n\nHIGHLIGHTS:\n\n1. $1.8 Billion Federal and Provincial Funding for Oakville EV plant\n\n2. $1.5 Billion Fiat Chrysler investment in Windsor EV plant\n\n3. Critical elements: lithium, copper, zinc, nickel\n\n4. Historical resource of 1.2M tons of 1.51% lithium oxide\n\n5. Extensive potential of copper, nickel, gold, and zinc with 41 deposit potential targets\n\nOverall, QMC is in an extremely favourable position to gain significantly through the announcement on October 8th by the Federal Government of Canada and the Province of Ontario that they would provide a total investment commitment of $590 million CDN into the $1.8-billion CDN retooling of Ford Motor's Oakville Ontario assembly plant making it the hub of EV production in Canada. This investment and retooling will make Ford Motor's Canadian production facility the largest electric vehicle assembly plant in North America. This project will build five new electric vehicle models and the batteries that will power these vehicles.\n\nFiat Chrysler followed up a week later announcing a $1.5-billion investment in their Windsor assembly plant. The investment would outfit the factory with the state-of-the-art equipment that will enable the assembly of plug-in hybrids and battery-powered vehicles with at least one new model in 2025. The plant will add up to 2,000 jobs to the Windsor plant.\n\nTo produce these vehicles specialized raw materials will be required. In addition to typical commodities required to manufacture vehicles, EVs require four additional critical elements: lithium, copper, zinc, and nickel which QMC is moving towards becoming a producer of ALL of these commodities (plus potentially gaining platinum, palladium, silver and gold credits) through the ongoing development of its Irgon Lithium (Spodumene) Mine Project and Namew Lake District (Volcanic Massive Sulphide (\"VMS\") Projects.\n\nNamew Lake District Project\n\nSituated in the renowned Flin Flon and Snow Lake districts of Manitoba known for its world-class VMS deposits, the company land package covers 55,000 acres. The project is contiguous to the western side of Hudbay Minerals' (HBM-TSX) Namew Lake Mine which has produced 2.57 million tons of nickel, copper, palladium, and platinum. The Namew Lake Project is also in the vicinity of the currently producing 777 and Lalor mines, in addition to being proximal to the past-producing Reed Lake Mine. In addition to being in close proximity to these other deposits, the company's district sized Namew Lake Project displays similar underlying geology to the aforementioned mines. The project hosts 41 deposit sized targets outlined in a versatile time domain electromagnetic (VTEM) system survey.\n\nThe Irgon Lithium Mine Project\n\nBetween 1953-1954, the Lithium Corporation of Canada Limited drilled 25 holes into the Irgon Dike and subsequently reported a historical resource estimate of 1.2 million tons grading 1.51% Li20 over a strike length of 365 meters and to a depth of 213 meters (Northern Miner, Vol. 41, no.19, Aug. 4, 1955, p.3). This historical resource is documented in a 1956 Assessment Report by B. B. Bannatyne for the Lithium Corporation of Canada Ltd. (Manitoba Assessment Report No. 94932). This historical estimate is believed to be based on reasonable assumptions, and neither the company nor the QP has any reason to contest the document's relevance and reliability. The detailed channel sampling and a subsequent drill program will be required to update this historical resource to current NI 43-101 standards. Historic metallurgical tests reported an 87% recovery from which a concentrate averaging 5.9% Li2O was obtained.\n\nDuring this historical 1950-era work program, a complete mining plant was installed onsite, designed to process 500 tons of ore per day, and a three-compartment shaft was sunk to a depth of 74 meters. On the 61-metre level, lateral development was extended off the shaft for a total of 366 meters of drifting, from which seven crosscuts transected the dike.\n\nThe Company has had recent discussions with Sinomine Group, Co., Ltd. (\"Sinomine\") to process spodumene material from the Irgon Lithium Mine Property at their TANCO plant. The TANCO plant is easily accessible, located approximately 20km directly south of the Irgon Lithium Mine Property via Highway 314. The TANCO management have provided the Company with an estimate to prepare samples (crushing and grinding), floatation testing, assaying and analysis for preliminary metallurgical evaluation. The testing will provide the Company with a lithium concentrate, in the past the TANCO circuitry was able to achieve lithium concentrate levels up 7.25% Li2O to Dow Corning. The Company expects to achieve at least 6% Li2O in this round of testing.",
        "subreddit": "investing_discussion",
        "title": "Quantum Minerals Corp. $QMC has a Strong Position to Benefit off a Rapidly Growing Industry!",
        "url": "https://www.reddit.com/r/investing_discussion/comments/lhb1p2/quantum_minerals_corp_qmc_has_a_strong_position/",
        "created": 1613040405.0
    },
    {
        "author": "_grafloewen_",
        "created_utc": 1612348263,
        "id": "lbks3r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Top Secret: no one has Corning on their radar. Everyone in the development of 5G focuses on the development of 5G telecommunications masts, but nobody thinks about the infrastructure that has to be created. Corning is the market leader in the manufacture and supply of fiber optic cable.",
        "url": "https://i.redd.it/c98huybop8f61.jpg",
        "created": 1612377063.0
    },
    {
        "author": "RomeWasBuiltin1Day",
        "created_utc": 1612973410,
        "id": "lgwxok",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Galway Gold in Canada (GLW- TSX) - Arbitration award upcoming? tiny mkt cap",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lgwxok/galway_gold_in_canada_glw_tsx_arbitration_award/",
        "created": 1613002210.0
    },
    {
        "author": "dombrogia",
        "created_utc": 1613007271,
        "id": "lh9mou",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi everyone. Have a general questions about some of my paper trades.\n\nThis is my second week paper trading. I have a system in place for selling credit spreads with a defined exit, R:R and probability of success. After being a long time lurking student for \\~3 years I'm dipping my toes in with some confidence. The majority of my trades have gone to plan, but there has been one trade last week and one trade this week that have abnormally high profits and I'm curious what is going on to make that happen. My usual trade is risk 800 to win 200, but on $GLW this week I show a (paper) profit of 1870 for the day. Last week it was UAA for a very similar situation.\n\n&amp;#x200B;\n\n[Open Position](https://preview.redd.it/i30iixeqzqg61.png?width=1019&amp;format=png&amp;auto=webp&amp;s=1dec66a40f6cd839d0c2fe034351a0576d191699)\n\nObviously since my max profit from the contracts at expiration is $200 I would love to take the $1870 profit but when i try and sell it I get an invalid price error and the combined mark price of the two legs (i hope i referred to this correctly) is negative (my understanding is this i where my error is derived from).\n\n&amp;#x200B;\n\n[Attempted Closing Order](https://preview.redd.it/iqkrex531rg61.png?width=1120&amp;format=png&amp;auto=webp&amp;s=acb6edd41373cdf4a161842d0c9e19fbfed182ea)\n\nIf I take the combined mark price of my two legs and place it at .00 it will be have a profit of $200 (my expected max profit). Is this because my legs are hedged against each other? Is there a way to get more than $200 before expiration?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fym9s97i2rg61.png?width=1118&amp;format=png&amp;auto=webp&amp;s=c11a898a7d2c27e309cadc9d6835619ceddcb3ca\n\nIs the expected play here to try and grab the $200 profit with a closing order asap or else just wait until expiration to collect my premiums?  I let UAA expire last week and my paper trading account accounted for the \\~2k worth of profit which just doesn't seem remotely possible given my max P/L. I would gladly take the profit, but it seems like I'm missing something here and I'd like to know what is going on so I can bail myself out as much as possible when it inevitably happens the other way on a 2k loss.\n\nI'll gladly take any pointers or *constructive* criticism, thank you for reading.",
        "subreddit": "options",
        "title": "Questions about Paper Trading results",
        "url": "https://www.reddit.com/r/options/comments/lh9mou/questions_about_paper_trading_results/",
        "created": 1613036071.0
    },
    {
        "author": "BlondedJare",
        "created_utc": 1612214479,
        "id": "laeil2",
        "num_comments": 47,
        "num_crossposts": 1,
        "selftext": "HPQ-Silicon Resources Inc: tickers (hpq.v - tsx and uragf - otc) has developed technology that reduces the cost of producing silicon-based spherical nanopowders &amp; nanowires, making this company an essential leader of the renewable energy revolution moving into the future.\n\nHPQ is currently being shorted by cynical wall street investors trying to leech off of the company’s value. These predatory tactics are limited, however, as HPQ has a growing legion of loyal supporters that will soon send shorters into oblivion.\n\nWhy is HPQ being targeted by shorters? HPQ has the backing of the Quebec government and is partnered with Pyrogenesis, an equally promising green-solutions company that has attracted the attention of the ARK investment portfolio. HPQ’s nano silicon powder will be instrumental in making silicon batteries, hydrogen fuel cells and solar panels to deliver on a promise for a greener future. HPQ has recently surpassed industry expectations by producing silicon nanopowder smaller than 100 nanometers, which is critical for these applications.\n\nThe HPQ/PYR dream team has the ability to produce economically viable Si-NPs (nano size of is totally customizable) using a process that is SCALABLE. This breakthrough is exclusive to HPQ Silicon and holds the key to renewable energy profits in the aforementioned sectors. As a result of this potential, HPQ has already secured NDA’s and orders for their product from electric vehicle manufacturers.\n\nHPQ’s ability to produce high-quality silicon powder at far cheaper rates than its competitors (with little to no environmental footprint) makes this company a highly strategic acquisition by TESLA and other EV companies. You owe it to yourself to do some due diligence in this company if you consider yourself a renewable/green investor, or wanting to join the movement of sending cynical shorts crying home to their mothers.\n\nThis is the year that HPQ reveals its partnerships that will bring the renewable energy revolution to reality; a disruptive innovation in silicon production using low-cost, green technology, creating a paradigm shift in energy storage &amp; generation.",
        "subreddit": "pennystocks",
        "title": "HPQ Silicon Resources: Disruptive Renewable Energy Tech",
        "url": "https://www.reddit.com/r/pennystocks/comments/laeil2/hpq_silicon_resources_disruptive_renewable_energy/",
        "created": 1612243279.0
    },
    {
        "author": "Mazer_Rac",
        "created_utc": 1612220588,
        "id": "lagxns",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "TL;DR: We're being defrauded! Register your certificates! Hold Wall St. accountable! There are links at the bottom on how to register your certificates in your name using DRS. There is also a SEC link that explains different forms of stock ownership and how brokers will commonly use \"street ownership\" where they just use a spreadsheet to track stocks internally, they're the only one who knows who owns what. They're making shares up out of thin air, depriving you of your voting and dividend rights and keeping it secret.\n\nI also recommend screenshotting how many shares you have in case they start deleting them like the did in Canada with CMKM.\n\n&amp;#x200B;\n\nRead this paper: [https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/](https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/)\n\n&amp;#x200B;\n\nNo, seriously, retard, read it. It's an article covering the research of a PhD in economics who has witnessed first hand what I'm about to tell you and is a big deal herself.\n\n&amp;#x200B;\n\nOur shares in $GME most likely don't exist. Wall St. has been perpetuating the biggest and most widespread fraud in human history. They were almost caught in 2008, but (to their relief) it only affected one sector of the economy and they were bailed out.\n\n&amp;#x200B;\n\nWhat is a fail to deliver? A fail to deliver is a concept used on Wall St. to denote when a lent share (for shorting or any other reason) isn't paid back. You would think that these companies would be mad that they're getting shafted for a share, but no, they're paid some hush money called an \"entitlement\" and they keep quiet. They keep quiet because it was never their money to begin with -- they tell the trader that they have the share and the broker pockets the entitlement.\n\n&amp;#x200B;\n\n&gt;Why naked short? When one broker can sell shares to your broker and simply fail to deliver at settlement, the broker does not have to bear the expense of stock borrowing. And the system lets them. Or they could avoid the expense of borrowing by short selling shares and marking them long. Sometimes, when the sellers really own the shares, their brokers may not transfer them to buyers. That and naked shorting both yield fails to deliver.  \n&gt;  \n&gt;If the shares ever arrive, the broker sends the money to the seller‘s broker. But once the trader knows that the broker agrees to fail to deliver his sell orders, he or she knows that all fails will persist and is free to naked short millions of shares for years to wait for the desired price drop.  \n&gt;  \n&gt;People who buy the undelivered shares get an “entitlement,” and the money they paid stays with their broker, who can use it, interest free. The dollar value of shares purchased but not received is a free loan from the investor to the broker. The investors don‘t know. The broker is not required to tell the client that he took the payment and did not receive any shares. \n\n&amp;#x200B;\n\nWe've been thinking that the big thing going on here is a naked short, but it's **so** much larger than that. My guess is that retail $GME holders on WSB alone hold over 100% of the available-to-trade shares and the brokers are losing their minds. Doesn't it seem odd that they're lying all over the news and putting articles out about \"losing interest\" and \"moving to silver\" and yelling and crying every day over the overleveraged short position of **ONE** hedge fund? It seemed odd to me, too. They're worried because they're on the verge of being found out as a system and causing a crash just like what happened in '29\n\n&amp;#x200B;\n\n&gt;But in a system wracked with fraud, traders engage in naked short selling, when they sell stock they don‘t own and never buy to deliver. So now there are two shares, the real one that was never delivered and a phantom “entitlement” given the unsuspecting buyer which is recorded as such by his broker. And which the buyer can now sell! Because the brokers pretend there are real shares there.  \n&gt;  \n&gt;Making two shares out of one is among the swindles that crashed the market in 1929. It was called “watering the stock.\n\n&amp;#x200B;\n\nThis has happened before, too. In Canada.\n\n&amp;#x200B;\n\n&gt;CMKM was a Canadian company with an interest in diamonds. The shareholders didn‘t know that mineral rights they were told about were owned by the founders, not the company. Criminal and civil complaints ensued. A reform management changed the company name to New Horizons Holdings, Inc with a plan to raise capital for the purchase of oil or gas assets. If successful, they would be able to return the shares to trading status with the hope of restoring value to shareholders.  \n&gt;  \n&gt;NHH directed all shareholders to obtain their stock certificates and exchange them for new shares. That‘s when the masses of phantom shares and corruption of some big brokers came into stark view. Many investors discovered that their brokers had taken their money and never bought or received CMKM shares.  \n&gt;  \n&gt;Trimbath, who worked investigating the scam, calls theses victims “UnShareholders,” investors who reported that their share positions were deleted by their brokers and/or where brokers refused to provide them with share certificates registered in the investors‘ names so they could meet the exchange requirements of a “bona fide shareholder.” She said, “Documents I saw suggested three brokerage firms probably took payments from investors for shares that were never received from the selling broker… Charles Schwab, Chase Bank and RBC Dain.”  \n&gt;  \n&gt;The investors had “phantom shares.” They were allocated a fail to receive on the broker‘s own books, but payment money was taken from their cash accounts, and they continued to receive statements showing share positions for CMKM.  \n&gt;  \n&gt;She said, “Investors submitted documentation showing that each of these brokers deleted their CMKM share positions at a time when we can demonstrate that the firms had no shares either in the depository or on the books of the issuer.” They deleted the evidence of the phantom shares.\\\\\n\n&amp;#x200B;\n\nThey're not obligated to tell us that they don't actually own the underlying stock certificate and they're paying \"unqualified\" dividends to us to make us think that we do -- oh, by the way, these dividends are taxed as income and aren't eligible for dividend tax rates. Another way they're ramming our ass.\n\n&amp;#x200B;\n\n&gt;When settlement failures happen, the shares you buy may not be in your brokerage account regardless of what your broker statement says.  \n&gt;  \n&gt;Let‘s say that your broker gets one of these fails to receive. First of all, they don‘t tell you that they got a fail to receive. If you were an institutional buyer or a high-value client, they will tell you that they failed to receive and they will give you some monetary compensation for the delay and inconvenience. They don‘t tell individual retail investors. If they did, they would have to share the revenue they earn on investors‘ money already paid them for the shares, since brokers don‘t have to transfer money for shares they fail to receive.  \n&gt;  \n&gt;The question then becomes, “Well, how did I get dividends?” You didn‘t really get dividends, you got “dividends in lieu.” That means the broker sent money (maybe part of *your* money) as dividends. You will know this if your 1099 from the broker says “unqualified dividends.” They are generally considered ordinary income and not eligible for dividend tax rates.  \n&gt;  \n&gt;Sometimes, a large broker with many clients seeking the same stock will receive only part of a particular share order. Some clients get real shares, others phantom entitlements. Trimbath said an investor might ask, “How did I get picked out for that?” She said, “The problem is, we don‘t know. And they won‘t tell us. If you were assigned the fail to receive, then the broker has many options, none of which they have to tell you.”\n\nOh, and they're fucking our voting rights! They're letting us vote and then throwing out the votes they don't like. Legally.\n\n&amp;#x200B;\n\n&gt;Before the 2008 crash, at an annual proxy meeting, Bank of America counted 130% of its shares voted, that is, they received 30% more votes than they had shares outstanding. That‘s just the number of people who actually voted their shares! Imagine how many shares were sold beyond what they actually authorized and issued. This violates the voting rights of shareholders and reduces effective corporate governance.  \n&gt;  \n&gt;Trimbath pointed out, Let‘s say it‘s the merger of Compaq and Hewlett Packard. Let‘s say that there are a lot of these extra shares around and they have more votes than shares coming in. And let‘s say that your broker/dealer is JP Morgan, who was actually one of the advisors on that merger deal. They stood to gain more in fees if the merger went through than if it was voted down. Do you think that they would be so careful about your vote that if you voted against something they were in favor of that they would not be tempted to only turn in the votes that they thought should be counted, those that were most favorable to their position, as opposed to trying to make sure that everything was done according to the rules. But, there are no rules! They just make them up as they go along.  \n&gt;  \n&gt;She said, They can, in fact, throw out your vote and just not count it. They can randomly assign your vote to some real proxy that wasn‘t voted. They can vote what shares they actually do have proportionally based on how many phantom votes come in. It‘s all done in secrecy. They don‘t have to tell you, they don‘t have to tell the NYSE, they don‘t have to tell anyone. They don‘t have to tell the company whose shares they voted.  \n&gt;  \n&gt;And the SEC isn‘t interested. To deal with over-voting, the SEC didn‘t say, Stop telling clients they have voting shares when they don‘t. It said, Don‘t submit more votes than shares you are holding. And brokers could choose which votes they wanted to submit!\n\n&amp;#x200B;\n\nThey even have cutsy little names for their fuckery and fraud.\n\n&amp;#x200B;\n\n&gt;Even a university economist who spent 2004 at the SEC studying fails acknowledged in so many words that the broker-dealers do it on purpose. Leslie Boni (now with a hedge fund in Southern California) attributed the extraordinary increase in settlement failures to investment decisions known as “**strategic failures**.”  \n&gt;  \n&gt;Trimbath noted that in 2007, “The Federal Reserve Bank of New York‘s Treasury Markets Practices Group (TMPG) describes several intentionally abusive practices such as **“slamming the wire**” (holding back deliveries until immediately before the close with the intention of causing settlement fails) and requests from traders for settlement operations to “**hold the box**” (a demand to delay settlement of an executed trade). The fact that these practices are colloquially named and described in such detail indicates that they are common causes of settlement failures.”\n\n&amp;#x200B;\n\nOh! Everyone saying it's illegal to naked short? Only sort of. Only for the stock of certain financial companies. That's right, they only made it illegal to drive down the valuation of their buddies. *(Edit: they did extend this rule to all companies later in the year after pressure from businesses)*\n\n&amp;#x200B;\n\n&gt;The SEC continued to declare that fails to deliver were not an indication of naked short selling. That changed when Goldman Sachs and other financial firms needed to be protected. Trimbath pointed out that not till the banks/broker-dealers began to see massive numbers of fails to deliver in their own shares did the SEC put a short-selling ban in place – but only for the shares of banks, insurance companies and securities firms, including the very culprits responsible for the dirty system.\n\n&amp;#x200B;\n\nAgain, it's a big problem.\n\n&amp;#x200B;\n\n&gt;Securities and Exchange Commission: In the first two weeks of July 2019, 914,261,864 shares valued at over $17 billion failed to deliver in settlement from the clearing house, an average of about $1.9 billion every settlement day.\n\n&amp;#x200B;\n\nAnd that's with all of the shady shit they can do to hide the numbers.\n\n&amp;#x200B;\n\n&gt;Trimbath blames the massive fails on the DTCC and its subsidiaries, DTC (Depository Trust Company), the vault that holds the shares, and NSCC (National Securities Clearing Corp), which clears and settles trades, that is, handles the exchange of money and shares which are registered in the accounts of its members, the big banks/broker-dealers.  \n&gt;  \n&gt;The Securities and Exchange Act of 1933 specifically gave the clearing house the right to require that shares and securities be delivered for settlement. It allows them to punish those who don‘t deliver by refusing to have them in the system.  \n&gt;  \n&gt;Trimbath said, “The DTCC has for years ignored that.  \n&gt;  \n&gt;She said, “The 2007 Reg SHO amendment says you cannot short again without borrowing: but only DTCC and SEC know who failed to deliver, so how is that functional?”  \n&gt;  \n&gt;Till 2013, in fact, the NSCC had a program to automatically borrow shares from DTC members to cover fails before settlement. DTC members can still lend shares from their accounts.  \n&gt;  \n&gt;She said the DTCC creates a mirage that there aren‘t any fails, or are many fewer than appears. Wall Street benefits from a service that automatically resubmits settlement failures, what the DTCC calls “fail transactions.” Many trades that fail to settle are required to be re-submitted, where they receive new settlement dates, in essence, erasing the fail to deliver by creating a new record. When this happens, the records show that the fail transactions are no longer outstanding; the next day begins with zero fails.\n\n&amp;#x200B;\n\nSome estimates put the number at 50,000% larger or **$400 billion in phantom trading per WEEK**.\n\n&amp;#x200B;\n\nThe DTCC, who is supposed to make sure that you actually have a physical stock certificate underneath what the broker tells you that you have is enabling this. They're a private corporation and they're in league with the brokers.\n\n&amp;#x200B;\n\n&gt;The answer is that the banks and brokers who use DTCC‘s services, who process trades there, who fail to deliver there, are insiders who sit on the DTCC Board of Directors. And the feeble SEC, dominated by the industry it is supposed to regulate, fails to require the DTCC to impose sanctions on errant members.\n\n&amp;#x200B;\n\nThe DTCC, the brokers, and fucking **CONGRESS** are blocking any efforts to fix this.\n\n&amp;#x200B;\n\n&gt;Harmer said in the film that the DTCC sabotaged their efforts. And that SEC chair William Donaldson also opposed them. Harmer said, To him, the whole business of trading securities belongs to the major brokers, they are the ones who are running this, and you folks down in Washington should not meddle in this or you‘re going to upset the apple cart.  \n&gt;  \n&gt;According to Harmer, They also got to Chairman Shelby.  And so, Shelby said to Bennett — I think we oughta wait and give the SEC a chance to come in and explain their position. And so, we were simply the victims of a very effectively executed strategy to make sure that there were no hearings on this, and even to make sure that Senator Bennett did not introduce the bill.  \n&gt;  \n&gt;A story in *The Washington Post* in 2012 helped explain the lack of enthusiasm in Congress for reforming the processes that lead to phantom shares. “In 2008, for instance, 17 lawmakers reported investing hundreds of thousands of dollars in short-selling funds,” including bets against U.S. Treasury bonds, the Dow Jones Industrial Average and the S&amp;P 500.  \n&gt;  \n&gt;The SEC‘s “reforms” had little effect. Compared to $6 billion in daily fails in 2003, the number was $7.4 billion for February 2020.\n\n&amp;#x200B;\n\nWe can uncover their fuckery! Demand that your broker register your certificates in your name! Show the world that we own more than 100% of $GME's float!\n\n&amp;#x200B;\n\nYou can use DRS to register your stocks in your name. Get in contact with your broker and ask them to register them in your name through the Direct Registration System.\n\n&amp;#x200B;\n\nSEC Info on DRS and how your stock is actually owned: [https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html](https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html)\n\nSEC FAQ on DRS: [https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html#faq](https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html#faq)\n\nWrite-up on how to use DRS: [https://the-international-investor.com/investment-faq/holding-shares-direct-registration](https://the-international-investor.com/investment-faq/holding-shares-direct-registration)\n\n&amp;#x200B;\n\nSource: [https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/](https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/)\n\nMore reading: [https://www.wsj.com/articles/SB943287246835296769](https://www.wsj.com/articles/SB943287246835296769)",
        "subreddit": "Wallstreetbetsnew",
        "title": "$GME Holders We are Being DEFRAUDED by the DTCC and our Broker/Lenders! What We Can Do!",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lagxns/gme_holders_we_are_being_defrauded_by_the_dtcc/",
        "created": 1612249388.0
    },
    {
        "author": "ItalianAAces",
        "created_utc": 1612216486,
        "id": "lafbid",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "HPQ Silicon Resources: Disruptive Renewable Energy Tech",
        "url": "/r/Baystreetbets/comments/l9sv9m/hpq_silicon_resources_disruptive_renewable_energy/",
        "created": 1612245286.0
    },
    {
        "author": "growthinvestor123",
        "created_utc": 1612237198,
        "id": "lamill",
        "num_comments": 172,
        "num_crossposts": 0,
        "selftext": "TOday I did research to calm myself down after pounding a redbull and getting triggered by all the misinformation and greedy nitwits that have flooded this site looking for a quick flip.\n\nImagine you’re John Chen. Sauntering down the hallway, with your 50 pound dick grazing the velveteen carpet with each step. You hear the guttural screams coming out of sales. You walk by the engineers, and gaze upon the latest widget as they kowtow before your bespecled grandeur. You hear about the customers who sing your praises, and the (much fewer) ones who tell you your product sucks donkey balls... But we (the retards @ WSB or frankly the dubmasses @ seeking alpha and even JP Morgan equity coverage) don’t know the details any of this, only dry ass reports that come out every quarter.\n\nSo, other than hacking into John’s brain (not recommended), what can we do? We can suckle at the teat of Twitter announcements, and sometimes that’s fun but usually it’s PR driven (unless it comes from Papa Chen’s account in which case suckle away).\n\nBut boy oh boy wouldn’t it be great if we could know the things P. Chiddy does. What new things are in development. Big new sales in the pipeline. Whether the company is hiring (or shrinking), and in what areas….Wait. For the last thing we actually can!\n\nthanks to the grotesquely fat (and very rich, no offense Gabe) founder of a soul-crushing professional network called LinkedIn. Linkedin, very kindly, takes employment related info from companies and displays it for all the world including competitors of those companies and bored autists like me. So let’s see - What Can headcount trends @ $BB tell us about the company?\n\nTo start, I took a look at Job Postings / Total Headcount. If you’re a shrinking company, this should be a low number. If you’re growing, it stands to reason this % would be higher. No company deliberately hires people they don’t think they need, and last time I checked $BB’s CFO wasn’t completely retarded. Now, it’s important not to read too much into this, but as a general matter companies that are growing have high stock prices (b/c they’re growing, duh) and vice versa.\n\nFANG isn’t a perfect comp (I’ll get to the others in a sec), but **serves as a good proxy of a “baseline growthy” tech.** No super saiyan rocketships at this point, but nobody is accusing $AAPL of shrinking. See below.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1g1ubpfxize61.png?width=600&amp;format=png&amp;auto=webp&amp;s=58d58b12644e9688e15e35e907386b910b9d938d\n\n# IMPLICATION NUMBER #1 - $$BB COMPARES FAVORABLY TO FANG IN TERMS OF HEADCOUNT-IMPLIED GROWTH. IF YOU SAID “$BB IS HIRING MORE RELATIVE TO ITS SIZE THAN THE AVERAGE FANG”, PEOPLE WOULD LAUGH AND THROW BANANAS AT YOU, BUT YOU’D BE RIGHT!!\n\n“But wait,” you say. “growthinvestor123 you fucking idiot, [didn’t you just compare $BB to CRWD, ZS, SAIL, and PANW](https://www.reddit.com/r/wallstreetbets/comments/lamg0y/bb_dd_no_meems_part_1/) to justify a **$60 / share** price target for $BB? I want to see the ratios for those.” Ok you, got me. See below, headcount-implied growth is higher for endpoint security comparables.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/eaz3begzize61.png?width=600&amp;format=png&amp;auto=webp&amp;s=d01221903b3c50a6838710f32daa173035eb9e92\n\n“Hah,” you say smugly. “Those other endpoint security businesses blow $BB out of the water, $BB sucks”.\n\nNo, you fucking idiot. If a simple headcount ratio without context was all it took I’d be rich instead of handsome like mommy tells me.\n\n$BB went through [**round**](https://channeldailynews.com/news/layoffs-hit-blackberry-in-waterloo/28015) after [**round**](https://duckduckgo.com/?q=blackberry+layoffs&amp;atb=v224-1&amp;ia=web&amp;iai=r1-3&amp;page=1&amp;sexp=%7B%22cdrexp%22%3A%22b%22%2C%22artexp%22%3A%22b%22%2C%22prodexp%22%3A%22b%22%2C%22prdsdexp%22%3A%22c%22%2C%22biaexp%22%3A%22b%22%2C%22msvrtexp%22%3A%22b%22%7D) of painful layoffs as it shifted from being a handset business to what it is today. Despite what the trust fund communists on this site would want you to think, firing people is never easy, and a lot harder than even hiring them. No manager wants to see his team shrunk,and no CEO wants to be painted as a chainsaw wielding asshole. $$ BB has a **history**, and that is a blessing and a curse.\n\n**Remember**, Daddy chen’s primary focus for the past almost-decade has been driving a turnaround. The handset team? Gone. Money-losing International operations? Gone. But the smart monkes and useful apes who might be able to do more than throw feces at each other??? And these smart monkes who were retained – Well, no need to make a job posting for that role anymore, right?\n\n# IMPLICATION #2 – BLACKBERRY HAD &gt; 20K EMPLOYEES. UNTIL RECENTLY THE COMPANY HAS BEEN CUTTING, NOT GROWING, AND ONE OF THE FEW BENEFITS OF ITS PAST SHITTY HISTORY IS THAT THE COMPANY CAN NOW GROW VS. HAVING TO FIND NEW EMPLOYEES QUICKLY LIKE CERTAIN COMPETITORS\n\nThis brings me to the final part of our headcount analysis. Let’s look at those endpoint security comparables again. Headcount is one thing, but of the quality of that headcount? Let’s look at two two non-retard quotes –\n\n***\"I have my own theory about why the decline happens at companies like IBM or Microsoft. The company does a great job, innovates and becomes a monopoly or close to it in some field, and then the quality of the product becomes less important. The product starts valuing the great salesmen, because they're the ones who can move the needle on revenues, not the product engineers and designers. So the salespeople end up running the company.\" Steve Jobs***\n\n***“If your product requires advertising or salespeople to sell it, it’s not good enough: technology is primarily about product development, not distribution.” Peter Thiel***\n\nI was curious and did comparison of the ratio of $BB’s Engineering / IT monkeys to its sales. See below\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6nog6m62jze61.png?width=524&amp;format=png&amp;auto=webp&amp;s=eb26266cbef428abb3152f1b9077c1a0daee07b0\n\nEven as a $BB bull, I didn’t expect the discrepancy to be so large.\n\n# IMPLICATION #3 – BLACKBERRY ACTUALLY IS MORE OF AN ENGINEERING / IT FOCUSED COMPANY RELATIVE TO ITS PEERS. IN MANY WAYS IT IS MORE OF A “START-UP”. EVEN WITH FINANCIAL PRESSURE, JOHNNY CHEN RETAINED TECHNICAL TALENT. WHAT DOES THAT SAY ABOUT THE COMPANY’S FUTURE, AND VALUATION ???\n\n**TLDR: BB IS NOT A ROCKET SHIP. IT IS A LONG RANGE SHUTTLE, CAPABLE OF BURSTS OF SPEED, PACKED TO THE GILLS WITH RETARDS AND TERRAFORMING EQUIPMENT AND HEADING TO MARS.**\n\n Add'l edit for those who can't read good - 🚀 🚀 🚀 🚀 🚀 🚀 ",
        "subreddit": "wallstreetbets",
        "title": "$BB DD - NO MEEMS - PART 2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lamill/bb_dd_no_meems_part_2/",
        "created": 1612265998.0
    },
    {
        "author": "ASoftEngStudent",
        "created_utc": 1612256395,
        "id": "larhlw",
        "num_comments": 129,
        "num_crossposts": 0,
        "selftext": "This will be a quick DDDD (Data-Driven DD) because it's late and pretty much every WSB post today has been about it. To catch up, [read this post that inspired by investigation](https://www.reddit.com/r/wallstreetbets/comments/lak773/why_were_still_winning_and_why_were_still_going/) and this post that I this does a very good job explaining [the theory](https://www.reddit.com/user/bcRIPster/comments/labq6u/follow_the_crumbs_gme_exposed_the_meta/). Basically, a lot of people here believe that institutions have been naked short selling GME, effectively creating fake or \"counterfeit\" GME stock, and it's there's some systematic fraud going on.\n\nMuch of the discussion has been centered around the [Failure to Deliver data released](https://www.sec.gov/data/foiadocsfailsdatahtm) by the SEC for the first half of Jan. A Failure to Deliver is reported when a broker is unable to deliver a share that they have sold to the clearing house by the settlement date (2 days after the transaction); [see my DDDD discussing what how this all works if you're curious](https://www.reddit.com/r/wallstreetbets/comments/l9sh9e/dddd_why_gme_might_next_week_and_how_it_could/). This can happen for many reason, and in the [examples given by the SEC](https://www.sec.gov/investor/pubs/regsho.htm) includes delays if people are physically delivering share certificates for some reason, and market makers (eg. Citadel) legally selling shares to a buyer without an actual seller (i.e. naked short sale) to provide liquidity; they just need to make sure they're able to later source that share quickly after it. Looks like the theory floating around r/wallstreetbets today is that non-market makers are illegally naked short selling GME, which is the topic of investigation for today.\n\nOne thing I've noticed that's been missing from many of these discussions is a proper analysis of the SEC-provided data on the Failure to Deliver numbers, so I decided to add this to help y'all make some informed decisions.\n\n*Disclaimer - This is not financial advice, and a lot of the content below is my personal opinion and for ENTERTAINMENT PURPOSES ONLY. In fact, the numbers, facts, or explanations presented below could be wrong and be made up and with some satire thrown in. Don't buy random options because some person on the internet says so. Do your own research and come to your own conclusions on what you should do with your own money, and how levered you want to be based on your personal risk tolerance.*\n\n**Methodology**\n\nI'm going to analyze this data using a script to look at a rough transactional value and approximate percentage of volume that the failure-to-deliver shares represent. Now, **these are all rough and kind of inaccurate especially for low-volume tickers** because the SEC data is based on the total number of outstanding failure-to-deliver shares for a particular settlement date. This means that\n\n1. Since you can have the same share being failed to deliver multiple days in a row, shares in these situations will be counted multiple times in all the data shown below.\n2. The earliest possible date shares in a trade can be counted as failed to be delivered is 3 trading days after the transaction occurred, so **literally none of the failure-to-deliver shares represents that day's volume**. However, I'm going to make an assumption that a day's volume will be in the same ball park as the volume from 3 days ago, so it should give a rough estimate. There are quite a few cases, especially with small-caps, where this is clearly not the case, and you will see many cases with a 100+% failure to deliver / volume results for this reason.\n3. The dollar value itself is wrong because it's using the price at settlement date, not the transaction date\n\nHowever, with these caveats, the purpose is to compare GME with other stocks to see if anything stands out using these metrics, using things like dollar value and volume rather than the raw number of shares to normalize the data.\n\n**The Code**\n\n    from collections import defaultdict\n    import time\n    import requests\n    POLYGON_API_KEY = '&lt;ADD YOUR API KEY HERE&gt;'\n    VOLUME_DATA_API_URL = 'https://api.polygon.io/v1/open-close/{}/2021-01-{}?unadjusted=true&amp;apiKey=' + POLYGON_API_KEY\n    \n    data\n    dates_to_stocks = defaultdict(lambda: defaultdict(float))\n    f = open('fail_to_delivers.txt', 'r') # https://www.sec.gov/data/foiadocsfailsdatahtm\n    for line in f:\n        parts = line.split('|');\n        date = parts[0]\n        ticker = parts[2]\n        try:\n            fails = int(parts[3])\n            price = float(parts[5])\n            value_of_fails = price * fails\n            dates_to_stocks[date][ticker] = (value_of_fails, fails)\n        except ValueError:\n            # fails or price was not a number; probably not traded (eg.'.')\n            pass\n    \n    for date, stocks in dates_to_stocks.items():\n        day = int(date[-2:])\n        print('Data for Jan {}'.format(day))\n        sorted_stocks = sorted(stocks.items(), key = lambda stock: stock[1][0])\n        sorted_stocks = filter(lambda stock: stock[1][0] &gt; 10000000, sorted_stocks)\n        for ticker, data in sorted_stocks:\n            val_of_fails = data[0]\n            num_fails = data[1]\n            req = requests.get(url=VOLUME_DATA_API_URL.format(ticker, str(day).zfill(2)))\n            res = req.json()\n            if res['status'] == 'NOT_FOUND':\n                print('No volume data for {}'.format(ticker))\n                continue\n            else:\n                try:\n                    volume = res['volume']\n                except KeyError:\n                    print(res)\n            val_of_fails_in_mill = int(val_of_fails / 1000000)\n            pct_vol = num_fails / volume * 100\n            print('{: &lt;6} ${: &lt;5} {: &lt;9} / {: &lt; 12} {:.2f}% of vol'.format(ticker, str(val_of_fails_in_mill) + 'M', num_fails, volume, pct_vol))\n\nHere's some code I hacked together myself. If anyone sees a bug please let me know and I'll re-calculate all this data, but otherwise you can try this yourself at home to crunch the data yourself after getting a Polygon API key, although you might need additional code to slow down the API requests since the free plan has a rate limit.\n\nIf everything above sounded gibberish to you, this code basically does all the calculations I mentioned above by reading the SEC data where the dollar value &gt; 10M and pulling volume for the day from a third party source.\n\n**The Results**\n\n    Data for Jan 4\n    RMO    $10M   455173    /  10652863    4.27% of vol\n    MP     $10M   338162    /  6012707     5.62% of vol\n    FTSL   $10M   229967    /  466929      49.25% of vol\n    TLT    $11M   73387     /  13491163    0.54% of vol\n    IFF    $11M   106670    /  5109099     2.09% of vol\n    WISH   $11M   651998    /  5947771     10.96% of vol\n    FXH    $12M   115701    /  145029      79.78% of vol\n    BIL    $13M   143387    /  1622120     8.84% of vol\n    BAR    $13M   704752    /  781989      90.12% of vol\n    SCHV   $17M   289146    /  569321      50.79% of vol\n    SFIX   $17M   301939    /  3246553     9.30% of vol\n    HEI    $18M   136300    /  431605      31.58% of vol\n    GP     $18M   632561    /  1922269     32.91% of vol\n    No volume data for IDEXY\n    SPY    $34M   92018     /  110471187   0.08% of vol\n    BABA   $34M   149800    /  25442439    0.59% of vol\n    BLNK   $54M   1271703   /  12417199    10.24% of vol\n    ZM     $55M   164629    /  8708714     1.89% of vol\n    LMND   $79M   650602    /  3774902     17.23% of vol\n    QS     $88M   1043660   /  85437068    1.22% of vol\n    FUBO   $179M  6405264   /  62558258    10.24% of vol\n    Data for Jan 5\n    SFIX   $10M   179535    /  3944760     4.55% of vol\n    ICLN   $10M   373174    /  10835646    3.44% of vol\n    SDC    $10M   934087    /  3951354     23.64% of vol\n    EEM    $10M   210387    /  53418852    0.39% of vol\n    BTAQ   $11M   1109124   /  859406      129.06% of vol\n    AAPL   $12M   95768     /  99232528    0.10% of vol\n    VV     $12M   73006     /  235701      30.97% of vol\n    IGV    $13M   40170     /  760975      5.28% of vol\n    XOP    $14M   240140    /  16129522    1.49% of vol\n    SMH    $14M   64946     /  2349313     2.76% of vol\n    PLTR   $15M   673714    /  29467572    2.29% of vol\n    FUBO   $15M   655567    /  76536531    0.86% of vol\n    IFF    $16M   160881    /  5671482     2.84% of vol\n    BAR    $17M   899469    /  715769      125.66% of vol\n    SNAP   $17M   352312    /  8937007     3.94% of vol\n    LAZR   $18M   575224    /  6835344     8.42% of vol\n    VXF    $18M   112351    /  441366      25.46% of vol\n    HYG    $18M   212911    /  33750660    0.63% of vol\n    SPY    $19M   52889     /  66529182    0.08% of vol\n    BYND   $22M   180249    /  2403615     7.50% of vol\n    ARKK   $22M   181939    /  5517279     3.30% of vol\n    BLNK   $22M   606253    /  8782149     6.90% of vol\n    No volume data for IDEXY\n    Z      $30M   235000    /  2779229     8.46% of vol\n    BILI   $31M   336874    /  9865956     3.41% of vol\n    BBIN   $42M   773948    /  35024       2209.76% of vol\n    SCHZ   $52M   934935    /  862549      108.39% of vol\n    TSLA   $56M   77616     /  32777673    0.24% of vol\n    QS     $140M  2805374   /  56417324    4.97% of vol\n    Data for Jan 6\n    GP     $10M   338197    /  1378176     24.54% of vol\n    Z      $10M   76860     /  2922684     2.63% of vol\n    JDST   $10M   1268335   /  6758651     18.77% of vol\n    SPIB   $10M   291358    /  2240443     13.00% of vol\n    ARKQ   $10M   138595    /  1477357     9.38% of vol\n    TFJL   $10M   448635    /  5522        8124.50% of vol\n    BNGO   $11M   2278342   /  172777252   1.32% of vol\n    QQQM   $11M   88033     /  471996      18.65% of vol\n    ESGV   $11M   166952    /  624422      26.74% of vol\n    GOLD   $12M   505715    /  30821265    1.64% of vol\n    SUSA   $12M   156306    /  132390      118.06% of vol\n    TAN    $13M   123734    /  7412302     1.67% of vol\n    SCZ    $13M   190487    /  2809791     6.78% of vol\n    GME    $13M   772112    /  6112481     12.63% of vol\n    MSTB   $13M   505730    /  36969       1367.98% of vol\n    TAL    $13M   197705    /  3872569     5.11% of vol\n    DFAE   $13M   495805    /  61403       807.46% of vol\n    PHYS   $14M   922154    /  3068779     30.05% of vol\n    IWB    $15M   71351     /  1149399     6.21% of vol\n    KRE    $15M   303042    /  17777218    1.70% of vol\n    IFF    $15M   147942    /  5645878     2.62% of vol\n    SIL    $17M   349238    /  960831      36.35% of vol\n    PFF    $17M   461767    /  10192667    4.53% of vol\n    UNH    $20M   58203     /  6637558     0.88% of vol\n    LMND   $20M   167974    /  2289234     7.34% of vol\n    XSD    $21M   125829    /  236857      53.12% of vol\n    LIT    $23M   324752    /  4054249     8.01% of vol\n    SHOP   $25M   22567     /  1292830     1.75% of vol\n    VXF    $26M   158266    /  1016028     15.58% of vol\n    No volume data for IDEXY\n    QQQ    $30M   97537     /  54595372    0.18% of vol\n    ANET   $31M   110454    /  745824      14.81% of vol\n    TWLO   $32M   96364     /  1878942     5.13% of vol\n    IWO    $35M   124303    /  758017      16.40% of vol\n    ARKG   $38M   411583    /  6510878     6.32% of vol\n    DIS    $39M   222604    /  7660902     2.91% of vol\n    FUBO   $45M   1655636   /  37542985    4.41% of vol\n    JPM    $54M   435864    /  25246578    1.73% of vol\n    AAL    $57M   3738894   /  65261546    5.73% of vol\n    MDY    $61M   146659    /  2313346     6.34% of vol\n    VOO    $69M   204517    /  4875363     4.19% of vol\n    CZA    $71M   949307    /  10055       9441.14% of vol\n    IGV    $87M   250001    /  1560021     16.03% of vol\n    XBI    $120M  860356    /  6578153     13.08% of vol\n    QS     $139M  2336878   /  69830456    3.35% of vol\n    IVV    $160M  431722    /  4380359     9.86% of vol\n    Data for Jan 7\n    FPXI   $10M   144300    /  277414      52.02% of vol\n    ABCL   $10M   257989    /  998242      25.84% of vol\n    Z      $10M   76860     /  3208891     2.40% of vol\n    TWLO   $10M   32612     /  2080639     1.57% of vol\n    ZNGA   $10M   1134696   /  12840024    8.84% of vol\n    CHEK   $11M   7154179   /  23512387    30.43% of vol\n    CEO    $11M   124581    /  544921      22.86% of vol\n    ARKG   $11M   122197    /  6784236     1.80% of vol\n    SFIX   $11M   199138    /  2078188     9.58% of vol\n    MOO    $13M   161780    /  438052      36.93% of vol\n    JPM    $14M   109199    /  22360722    0.49% of vol\n    GME    $14M   799328    /  6195565     12.90% of vol\n    ESGV   $15M   214750    /  323435      66.40% of vol\n    SUSA   $16M   194155    /  547800      35.44% of vol\n    WMT    $16M   111153    /  6984597     1.59% of vol\n    PFF    $16M   443734    /  8849961     5.01% of vol\n    FEM    $18M   687869    /  145383      473.14% of vol\n    VTV    $18M   153510    /  3890983     3.95% of vol\n    EMQQ   $18M   294485    /  351449      83.79% of vol\n    VIG    $18M   133579    /  1444204     9.25% of vol\n    UNH    $19M   54570     /  3413867     1.60% of vol\n    ABEV   $19M   6460712   /  29035247    22.25% of vol\n    JNK    $21M   200732    /  7589803     2.64% of vol\n    ZM     $22M   65852     /  5702045     1.15% of vol\n    No volume data for IDEXY\n    IWM    $25M   125200    /  24438036    0.51% of vol\n    TDOC   $27M   132485    /  5957242     2.22% of vol\n    XLV    $31M   273094    /  12449811    2.19% of vol\n    AMAT   $31M   347709    /  8900351     3.91% of vol\n    ANET   $32M   113141    /  897675      12.60% of vol\n    AAPL   $34M   272530    /  111251301   0.24% of vol\n    IBB    $35M   232435    /  2757909     8.43% of vol\n    SCZ    $35M   506453    /  2423106     20.90% of vol\n    TAL    $39M   588989    /  4953466     11.89% of vol\n    LIT    $39M   568200    /  2699742     21.05% of vol\n    SLYV   $42M   600000    /  784366      76.49% of vol\n    MDYG   $43M   600000    /  361719      165.87% of vol\n    MSFT   $44M   208844    /  27957876    0.75% of vol\n    XBI    $49M   341925    /  4368284     7.83% of vol\n    QS     $53M   855908    /  39043118    2.19% of vol\n    IGV    $65M   192848    /  1111927     17.34% of vol\n    IWO    $75M   256293    /  542558      47.24% of vol\n    SPY    $82M   221390    /  69043996    0.32% of vol\n    FUBO   $85M   3144764   /  26265288    11.97% of vol\n    MDY    $92M   210989    /  1059600     19.91% of vol\n    LMND   $131M  1100360   /  6843096     16.08% of vol\n    No volume data for CRUU\n    QQQ    $262M  853202    /  30946247    2.76% of vol\n    Data for Jan 8\n    GME    $10M   555658    /  6529206     8.51% of vol\n    SAM    $10M   10122     /  64727       15.64% of vol\n    HSBC   $10M   362391    /  2122407     17.07% of vol\n    TWLO   $10M   28519     /  2165649     1.32% of vol\n    ZNGA   $10M   1058523   /  18612307    5.69% of vol\n    XSOE   $10M   257305    /  1284354     20.03% of vol\n    Z      $10M   76094     /  2436382     3.12% of vol\n    FNF    $11M   284083    /  1685307     16.86% of vol\n    FXI    $11M   246994    /  25366481    0.97% of vol\n    DXCM   $11M   30698     /  1290952     2.38% of vol\n    IWO    $12M   40025     /  379305      10.55% of vol\n    BILL   $12M   90614     /  1670688     5.42% of vol\n    BNGO   $12M   2489241   /  140354760   1.77% of vol\n    IAI    $12M   148122    /  28095       527.22% of vol\n    MEDP   $12M   91875     /  189656      48.44% of vol\n    EDOC   $12M   642212    /  257984      248.93% of vol\n    DRIV   $13M   517797    /  2177619     23.78% of vol\n    MXIM   $14M   152763    /  3687022     4.14% of vol\n    ANGL   $14M   449592    /  1178388     38.15% of vol\n    FEMB   $14M   398368    /  177232      224.77% of vol\n    AAP    $15M   90683     /  867553      10.45% of vol\n    ORA    $17M   153279    /  1270618     12.06% of vol\n    SFIX   $17M   303687    /  3136663     9.68% of vol\n    ABEV   $17M   5994417   /  27822035    21.55% of vol\n    MJ     $18M   1079848   /  3922150     27.53% of vol\n    TBT    $19M   1082527   /  3509092     30.85% of vol\n    AKICU  $19M   1869585   /  159822      1169.79% of vol\n    BYND   $21M   181587    /  4508501     4.03% of vol\n    SUB    $21M   203087    /  221214      91.81% of vol\n    LQD    $22M   166506    /  13375076    1.24% of vol\n    No volume data for IDEXY\n    AMC    $23M   11547981  /  39954025    28.90% of vol\n    SNOW   $27M   90756     /  9197063     0.99% of vol\n    ANET   $29M   98754     /  1112848     8.87% of vol\n    XLB    $30M   395911    /  8495838     4.66% of vol\n    TAL    $30M   475832    /  4625189     10.29% of vol\n    VPL    $31M   383850    /  769567      49.88% of vol\n    CLOV   $33M   2063128   /  15605154    13.22% of vol\n    SCHE   $34M   1094305   /  6271011     17.45% of vol\n    IBB    $36M   233035    /  4464357     5.22% of vol\n    BHP    $38M   527450    /  2798855     18.85% of vol\n    QQQ    $42M   133818    /  34700266    0.39% of vol\n    HHC    $43M   541031    /  501246      107.94% of vol\n    AZN    $44M   881208    /  11243137    7.84% of vol\n    VTI    $45M   229492    /  7663316     2.99% of vol\n    QS     $51M   835859    /  26235605    3.19% of vol\n    FUBO   $52M   1852827   /  20886121    8.87% of vol\n    AMAT   $53M   560863    /  9177334     6.11% of vol\n    VXF    $66M   388894    /  363270      107.05% of vol\n    JNK    $126M  1164476   /  7798093     14.93% of vol\n    IGV    $126M  363012    /  590515      61.47% of vol\n    ACWI   $129M  1398754   /  3736768     37.43% of vol\n    GNR    $167M  3432554   /  191541      1792.07% of vol\n    TAN    $177M  1458720   /  3981915     36.63% of vol\n    LMND   $181M  1192325   /  7598825     15.69% of vol\n    MDY    $260M  592088    /  992982      59.63% of vol\n    DVN    $342M  18426493  /  14024601    131.39% of vol\n    Data for Jan 11\n    VXX    $10M   615868    /  41311500    1.49% of vol\n    LIT    $10M   146194    /  1960712     7.46% of vol\n    BNGO   $10M   2223632   /  145967474   1.52% of vol\n    ZNGA   $10M   1056500   /  27875624    3.79% of vol\n    VSS    $10M   84361     /  235578      35.81% of vol\n    Z      $11M   76527     /  1669983     4.58% of vol\n    CRSP   $11M   58363     /  2742944     2.13% of vol\n    SOXX   $11M   28921     /  546088      5.30% of vol\n    TM     $11M   75693     /  341885      22.14% of vol\n    EDIT   $11M   129779    /  5099744     2.54% of vol\n    XBI    $11M   79255     /  3296760     2.40% of vol\n    EDOC   $12M   597446    /  1407725     42.44% of vol\n    SCHP   $12M   200279    /  1427144     14.03% of vol\n    GME    $12M   703110    /  15188257    4.63% of vol\n    EZU    $13M   283987    /  7103235     4.00% of vol\n    TLT    $13M   87524     /  8517178     1.03% of vol\n    AZN    $13M   260777    /  11826267    2.21% of vol\n    XSOE   $13M   319355    /  1291316     24.73% of vol\n    MSTR   $13M   25707     /  1496929     1.72% of vol\n    IAI    $13M   159892    /  59452       268.94% of vol\n    BHP    $14M   193457    /  2427915     7.97% of vol\n    NVDA   $14M   26951     /  13129807    0.21% of vol\n    IGV    $14M   41420     /  575795      7.19% of vol\n    ABB    $14M   489684    /  2267141     21.60% of vol\n    VV     $15M   86043     /  239841      35.88% of vol\n    HYS    $15M   157848    /  218379      72.28% of vol\n    SJNK   $15M   575836    /  2432751     23.67% of vol\n    RPRX   $16M   312400    /  3483830     8.97% of vol\n    SPIP   $16M   519650    /  840202      61.85% of vol\n    MARA   $16M   611878    /  94267180    0.65% of vol\n    FTFT   $16M   2137024   /  28583008    7.48% of vol\n    PLUG   $16M   305936    /  46587009    0.66% of vol\n    PLTR   $17M   684687    /  33011079    2.07% of vol\n    TAN    $18M   152211    /  3487804     4.36% of vol\n    No volume data for SPXSZZZZ\n    FNX    $19M   225556    /  25522       883.77% of vol\n    SLAB   $19M   146585    /  453094      32.35% of vol\n    ARKG   $20M   195329    /  5248643     3.72% of vol\n    ICLN   $21M   657002    /  13666311    4.81% of vol\n    MJ     $22M   1333420   /  3852411     34.61% of vol\n    No volume data for IDEXY\n    FUBO   $24M   906355    /  13276816    6.83% of vol\n    ROKU   $25M   62953     /  5887016     1.07% of vol\n    DNL    $25M   324139    /  24767       1308.75% of vol\n    TAL    $25M   380482    /  1975338     19.26% of vol\n    VXUS   $27M   443558    /  3730976     11.89% of vol\n    SUB    $28M   265462    /  188896      140.53% of vol\n    ABEV   $29M   9769323   /  18941617    51.58% of vol\n    ANET   $30M   100395    /  529749      18.95% of vol\n    TMO    $31M   60583     /  1694125     3.58% of vol\n    DD     $31M   380089    /  15582944    2.44% of vol\n    XLK    $40M   307169    /  8969809     3.42% of vol\n    JNK    $43M   401204    /  9011848     4.45% of vol\n    SPIB   $44M   1199313   /  1777332     67.48% of vol\n    QS     $47M   836176    /  19469271    4.29% of vol\n    M      $55M   4505779   /  14361407    31.37% of vol\n    EEM    $56M   1035795   /  40965351    2.53% of vol\n    TSLA   $89M   102030    /  60262217    0.17% of vol\n    SPY    $99M   260673    /  51385646    0.51% of vol\n    DVN    $115M  6396708   /  11074952    57.76% of vol\n    TME    $159M  7597588   /  23335979    32.56% of vol\n    QQQ    $195M  611648    /  33526327    1.82% of vol\n    SNOW   $451M  1503729   /  4580562     32.83% of vol\n    Data for Jan 12\n    JHMM   $10M   216426    /  238965      90.57% of vol\n    SIVB   $10M   24577     /  546261      4.50% of vol\n    EEMA   $10M   118409    /  113040      104.75% of vol\n    TIP    $10M   86938     /  3522835     2.47% of vol\n    BYND   $11M   94389     /  3294350     2.87% of vol\n    ACIA   $11M   135144    /  4810813     2.81% of vol\n    CDC    $11M   203290    /  60438       336.36% of vol\n    RGNX   $11M   234259    /  442580      52.93% of vol\n    QS     $11M   213000    /  51908268    0.41% of vol\n    XLU    $11M   192507    /  12329318    1.56% of vol\n    ENB    $12M   368137    /  6759556     5.45% of vol\n    FTFT   $12M   2311209   /  15419147    14.99% of vol\n    GOVT   $12M   470217    /  9110172     5.16% of vol\n    SOCL   $13M   207702    /  39866       521.00% of vol\n    XSOE   $13M   321206    /  774516      41.47% of vol\n    No volume data for KBCSY\n    SFIX   $13M   239777    /  5489995     4.37% of vol\n    PXD    $13M   103193    /  27013469    0.38% of vol\n    DRIV   $13M   529616    /  1199349     44.16% of vol\n    PLUG   $14M   260722    /  110733629   0.24% of vol\n    No volume data for CHL\n    No volume data for AMADY\n    SWKS   $14M   89872     /  1821632     4.93% of vol\n    JNK    $14M   134848    /  8531417     1.58% of vol\n    FUBO   $14M   539301    /  157218493   0.34% of vol\n    HYG    $14M   170507    /  41774036    0.41% of vol\n    USMV   $14M   218346    /  4136809     5.28% of vol\n    DIA    $15M   49808     /  2300371     2.17% of vol\n    SUB    $15M   146245    /  293345      49.85% of vol\n    SJNK   $15M   588370    /  4179598     14.08% of vol\n    PLTR   $17M   659322    /  54968620    1.20% of vol\n    NFRA   $17M   317321    /  123815      256.29% of vol\n    TSLA   $18M   22211     /  46768359    0.05% of vol\n    VTEB   $18M   328242    /  1326346     24.75% of vol\n    EZU    $18M   409157    /  9724870     4.21% of vol\n    LSI    $19M   163476    /  942907      17.34% of vol\n    AJAX   $19M   1647672   /  2626688     62.73% of vol\n    EDC    $20M   193869    /  163829      118.34% of vol\n    BLI    $20M   232710    /  519080      44.83% of vol\n    DASH   $21M   129338    /  14198812    0.91% of vol\n    IEF    $22M   187689    /  6569902     2.86% of vol\n    ASHR   $22M   536685    /  3394356     15.81% of vol\n    SMH    $24M   103959    /  3226970     3.22% of vol\n    TAL    $24M   367792    /  5291590     6.95% of vol\n    DNL    $25M   325232    /  25152       1293.07% of vol\n    ACCD   $26M   569052    /  668698      85.10% of vol\n    MXIM   $26M   280268    /  1990545     14.08% of vol\n    CRM    $26M   122621    /  21713794    0.56% of vol\n    KRE    $27M   478683    /  9601888     4.99% of vol\n    ANET   $28M   92939     /  1870397     4.97% of vol\n    VNQ    $33M   405838    /  7925021     5.12% of vol\n    MRVL   $35M   711824    /  6457737     11.02% of vol\n    MBB    $36M   333534    /  10549726    3.16% of vol\n    XLP    $39M   591884    /  11062255    5.35% of vol\n    SPMB   $42M   1607008   /  541977      296.51% of vol\n    IPOE   $50M   2656436   /  14469222    18.36% of vol\n    TMKRU  $87M   8457409   /  770303      1097.93% of vol\n    TWLO   $103M  287038    /  2545738     11.28% of vol\n    VEA    $289M  5978670   /  8073208     74.06% of vol\n    SNOW   $357M  1220616   /  6575982     18.56% of vol\n    Data for Jan 13\n    JHMM   $10M   212907    /  102491      207.73% of vol\n    ALNY   $10M   61864     /  2453711     2.52% of vol\n    SCHE   $10M   319745    /  1476711     21.65% of vol\n    LSI    $10M   92053     /  2524023     3.65% of vol\n    ACTC   $10M   426995    /  10590305    4.03% of vol\n    PFF    $10M   287062    /  7555964     3.80% of vol\n    GOOGL  $10M   6275      /  1182889     0.53% of vol\n    PXD    $11M   85102     /  6736818     1.26% of vol\n    No volume data for AMADY\n    LYV    $11M   158908    /  4368171     3.64% of vol\n    QS     $11M   206723    /  24774402    0.83% of vol\n    XLU    $11M   192500    /  13354398    1.44% of vol\n    VSGX   $12M   201319    /  226385      88.93% of vol\n    CDC    $12M   222430    /  40763       545.67% of vol\n    HYG    $12M   148273    /  47749801    0.31% of vol\n    GME    $13M   662524    /  288667273   0.23% of vol\n    AAXJ   $13M   143098    /  645277      22.18% of vol\n    MIC    $13M   465475    /  3217373     14.47% of vol\n    AI     $13M   103081    /  6413417     1.61% of vol\n    EEMA   $14M   157698    /  124024      127.15% of vol\n    VCR    $14M   51164     /  123801      41.33% of vol\n    FNGU   $14M   53279     /  292296      18.23% of vol\n    VPL    $14M   181814    /  387790      46.88% of vol\n    CREE   $15M   124749    /  1224481     10.19% of vol\n    ICLN   $15M   463906    /  9817667     4.73% of vol\n    BPY    $16M   960472    /  3544070     27.10% of vol\n    EWH    $16M   634086    /  4209409     15.06% of vol\n    No volume data for HOKCY\n    Z      $16M   115078    /  1848380     6.23% of vol\n    GS     $16M   56023     /  4904304     1.14% of vol\n    VXF    $17M   99541     /  952044      10.46% of vol\n    EWU    $17M   579075    /  2283375     25.36% of vol\n    BBBY   $19M   899486    /  19195438    4.69% of vol\n    CNQ    $20M   758170    /  6620696     11.45% of vol\n    TSLA   $21M   25242     /  33637855    0.08% of vol\n    RETL   $22M   178031    /  54044       329.42% of vol\n    PLTR   $22M   852932    /  103565952   0.82% of vol\n    BNTX   $24M   229376    /  1823779     12.58% of vol\n    FMS    $25M   594469    /  996987      59.63% of vol\n    SPG    $25M   293022    /  8669323     3.38% of vol\n    DNL    $25M   329444    /  17950       1835.34% of vol\n    TER    $27M   197090    /  1461976     13.48% of vol\n    MDY    $27M   62265     /  885141      7.03% of vol\n    SPY    $29M   78981     /  45604510    0.17% of vol\n    TMKRU  $29M   2895006   /  602858      480.21% of vol\n    LMND   $44M   257874    /  9253096     2.79% of vol\n    NIO    $46M   751947    /  233834179   0.32% of vol\n    ASHR   $58M   1345934   /  1977253     68.07% of vol\n    CCIV   $72M   5142902   /  185613695   2.77% of vol\n    SCHF   $84M   2261962   /  2374397     95.26% of vol\n    QQQ    $100M  319499    /  23459898    1.36% of vol\n    IEMG   $106M  1636832   /  24605232    6.65% of vol\n    TWLO   $155M  414331    /  2983315     13.89% of vol\n    SNOW   $292M  997932    /  5770968     17.29% of vol\n    Data for Jan 14\n    FUTU   $10M   147467    /  8267876     1.78% of vol\n    GLD    $10M   58911     /  13580504    0.43% of vol\n    RKT    $10M   529482    /  6065737     8.73% of vol\n    GOOG   $10M   6178      /  1190697     0.52% of vol\n    JKS    $11M   174686    /  3299317     5.29% of vol\n    NIO    $11M   179015    /  100212842   0.18% of vol\n    BBY    $11M   98786     /  2010214     4.91% of vol\n    ACWI   $11M   123023    /  4486363     2.74% of vol\n    IWM    $11M   54832     /  34126749    0.16% of vol\n    NARI   $11M   120313    /  727912      16.53% of vol\n    VIS    $11M   66167     /  156674      42.23% of vol\n    No volume data for CCIVU\n    BNDX   $12M   207005    /  2944006     7.03% of vol\n    ACTCW  $12M   1746528   /  1251451     139.56% of vol\n    ESGU   $12M   138711    /  18958336    0.73% of vol\n    TFI    $12M   234004    /  281979      82.99% of vol\n    ACI    $12M   718057    /  2853713     25.16% of vol\n    ESGV   $12M   178184    /  305336      58.36% of vol\n    VONV   $12M   104521    /  210425      49.67% of vol\n    QS     $13M   230667    /  13774941    1.67% of vol\n    BUG    $13M   477973    /  443386      107.80% of vol\n    TSJA   $13M   529310    /  10438       5070.99% of vol\n    EWU    $13M   446834    /  3298766     13.55% of vol\n    AAXJ   $13M   146519    /  1052459     13.92% of vol\n    ALLK   $14M   114451    /  239036      47.88% of vol\n    PLTR   $14M   549219    /  33345821    1.65% of vol\n    XBI    $14M   96793     /  6175075     1.57% of vol\n    IBM    $14M   118000    /  7620404     1.55% of vol\n    SPCE   $15M   566065    /  58849108    0.96% of vol\n    BNTX   $15M   152319    /  1928180     7.90% of vol\n    EWQ    $15M   460861    /  930296      49.54% of vol\n    INTC   $15M   275319    /  76137919    0.36% of vol\n    MUB    $15M   136460    /  1872076     7.29% of vol\n    IDYA   $16M   1070477   /  192964      554.75% of vol\n    SPDW   $17M   492928    /  1052552     46.83% of vol\n    MCK    $18M   98869     /  699468      14.13% of vol\n    BIL    $18M   202092    /  2021703     10.00% of vol\n    NOC    $18M   63242     /  1396814     4.53% of vol\n    GME    $19M   621483    /  94480858    0.66% of vol\n    FMS    $19M   469951    /  543332      86.49% of vol\n    AI     $20M   145990    /  3673395     3.97% of vol\n    TSLA   $22M   25886     /  31591648    0.08% of vol\n    RETL   $22M   179448    /  100796      178.03% of vol\n    ZM     $22M   62445     /  9410703     0.66% of vol\n    VGT    $23M   65705     /  443651      14.81% of vol\n    LMND   $24M   135997    /  15428353    0.88% of vol\n    LQD    $25M   185355    /  22077842    0.84% of vol\n    XLC    $25M   388611    /  2548053     15.25% of vol\n    SPY    $26M   68916     /  50152199    0.14% of vol\n    AZN    $28M   552409    /  11706274    4.72% of vol\n    FUBO   $28M   792423    /  33088152    2.39% of vol\n    TMKRU  $29M   2884289   /  64652       4461.25% of vol\n    JWN    $31M   851212    /  12049764    7.06% of vol\n    NCNO   $36M   532284    /  1354842     39.29% of vol\n    TTD    $38M   48618     /  644636      7.54% of vol\n    VIPS   $39M   1386042   /  6556018     21.14% of vol\n    MSOS   $43M   967278    /  1317363     73.43% of vol\n    AZRE   $49M   998097    /  220310      453.04% of vol\n    SMH    $55M   237195    /  3371846     7.03% of vol\n    RLAY   $64M   1535964   /  2605340     58.95% of vol\n    ASHR   $67M   1557492   /  2570496     60.59% of vol\n    ACTC   $80M   3508271   /  8994587     39.00% of vol\n    CCIV   $141M  8464902   /  142448106   5.94% of vol\n    IEMG   $515M  7881052   /  12504033    63.03% of vol\n\nI'll let y'all discuss what this means in the comments. Have Fun.\n\nEDIT - Someone pointed out a mistake in my script. Fixed, and added a bit more data\n\nEDIT 2 - For those without enough brain wrinkles / attention span to interpret this - There may have been shady shit in the first few days of Jan, but doesn't look like anything went on in the second week. Will need to wait till Feb 15 to see data in the last few weeks of Jan. I'll probably do some more analysis when that time comes",
        "subreddit": "wallstreetbets",
        "title": "DDDD - Is GME being Illegally Naked Short Sold?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/larhlw/dddd_is_gme_being_illegally_naked_short_sold/",
        "created": 1612285195.0
    },
    {
        "author": "turkeychicken",
        "created_utc": 1612278661,
        "id": "laxqj6",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "With all the talk of diamond hands and losses, it got me thinking about what in my portfolio has been a complete dud but I've refused to let go of.\n\nOne of the first investments I made was in IBM back in May 2012.  I purchased shares at $208.70 (and also paid the $8.95 commission).\n\nSince then IBM has tumbled and I'm still down 38% but I'm holding onto that sucker for as long as it takes.\n\nWhat are some of your poor trades that you refuse to give up on?",
        "subreddit": "stocks",
        "title": "What's the longest loss you've been holding on to?",
        "url": "https://www.reddit.com/r/stocks/comments/laxqj6/whats_the_longest_loss_youve_been_holding_on_to/",
        "created": 1612307461.0
    },
    {
        "author": "blueteambluz",
        "created_utc": 1612230731,
        "id": "laki1v",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Bullish on FEYE over next few quarters. To me it’s unclear how the recent SolarWinds hack will impact Q4 earnings due to the timing of the hack. On a recent conf call Mandia mentioned that Incident Response hours aren’t billed until after the incident response engagement is over. The SolarWinds news broke on Sunday Dec 13th.  Response engagements of this scale typically take weeks if not months. So we might be looking at meeting Q4 estimates but raising Q1 guidance.  Even without a beat, I’ll take this as a bullish sign. \n\nI’ve been watching job openings at FireEye for the last month.  They’ve been recruiting non-stop and a large portion of these at Incident Response or other services consultants. There are currently 192 open roles.  \n\nBack of the napkin calculations are... many of the senior roles will be sent immediately into the field at a billing rate between $250-$450. At a 80% utilization that is between $400k-$720k per head per year. If they have hired between 50-100 people into these roles since the Solarwinds hack that is could lead to $20M-$36M revenue increase on the low end to $40M-$72M on the high end. With current annual revenues at $928M we could see an annual revenue increase of 7% on these services alone which is above their current 6.9% revenue growth rate. If we see acceleration in any of their newish businesses like Managed Defense and Mandiant Advantage Cyber Threat Intelligence services we could have a great growth story on our hands. Incident Response services are (hopefully) a one time thing for breached companies but Managed Defense and Intel services are a recurring revenue stream, so growth in these areas would be a very good thing indeed. \n\nAny upticks in the hardware business would be positive news, but I believe they are facing upgrade cycle challenges and I’m not expecting much on this front. \n\nFinally, I wouldn’t be surprised if we saw FEYE acquired by a larger player in the next few months. There have been multiple rounds of rumors over the last few years that indicate FEYE has hired an investment bank to assist with the process. While Mandia hasn’t confirmed these rumors, he hasn’t denied them either. Cisco allegedly passed. I think good candidates are Microsoft, IBM or even someone like CrowdStrike using their astronomically high share price to swing a deal and create a cyber powerhouse to rival Pali Alto.  \n\nI’m long with shares, considering NTM/OTM LEAPS, might by some June calls.  FD weeklies might payout but are risky IMO.",
        "subreddit": "wallstreetbets",
        "title": "FEYE - Playing tomorrow’s FireEye Q4 earnings based on recent SolarWinds hack",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laki1v/feye_playing_tomorrows_fireeye_q4_earnings_based/",
        "created": 1612259531.0
    },
    {
        "author": "Impressive-Swimmer36",
        "created_utc": 1612291308,
        "id": "lb2ztq",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "**Intro**\n\nKE is a leading integrated online and offline platform for housing transactions and services in China. They are a pioneer in building the industry infrastructure and standards in China to reinvent how service providers and housing customers efficiently navigate and consummate housing transactions, ranging from existing and new home sales, home rentals, to home renovation, real estate financial solutions and other solutions.\n\nMore general info about KE:\n\n[https://investors.ke.com/about-us/default.aspx](https://investors.ke.com/about-us/default.aspx)\n\n**The business**\n\nThe industry KE is operating in is Real Estate. The company was founded in 2001 in China. They have more then 85k employees. \n\nSome highlights about KE:\n\n·  Massive housing market in China with low efficiency in housing transactions and services.\n\n·  The operating system, Agent Cooperation Network (CAN), has been transforming the housing transactions and services industry in China. \n\n·  They utilize new technologies, such as virtual reality, artificial intelligence, big data and Internet-of-Things to create and develop real-life use cases and applications to enhance customer experience and service efficiency.\n\n·  Visionary management team with proven track record of innovations and execution.\n\nThe vision and mission statement:\n\nWe founded our company with the belief that we can transform the housing transactions and services industry in China by improving the quality, efficiency of service providers and enhancing customer experience.\n\nWe aspire to provide comprehensive and trusted housing services through our online and offline platform, to 300 million families.\n\nWow… 300 million families.\n\n**Management**\n\nThe CEO of the company is Peng Yongdong. He is one of the co-founders of the company. Before he was a senior consultant of strategy and revolution at IBM.\n\nFor the other members of the executive team: [https://investors.ke.com/governance/executive-management/default.aspx](https://investors.ke.com/governance/executive-management/default.aspx)\n\n**Business highlights Q3 (non audited)**\n\n* Gross transaction value (GTV) was US$154.6 billion, an increase of 87.2% year-over-year. GTV of existing home transactions was US$84.8 billion, an increase of 71.8% year-over-year. GTV of new home transactions was US$62.0 billion, an increase of 105.7% year-over-year. GTV of emerging and other services was US$7.8 billion, an increase of 151.5% year-over-year.\n* Net revenues were US$3.0 billion, an increase of 70.9% year-over-year.\n* Net income was US$11 million. Adjusted net income was US$274 million, an increase of 210.6% year-over-year.\n* Number of stores was 44,883 as of September 30, 2020, a 41.7% increase year-over-year.\n* Number of agents was 477,810 as of September 30, 2020, a 50.7% increase year-over-year.\n* Mobile monthly active users (MAU) averaged47.9 million, an increase of 82.1% year-over-year.\n\nNotice the increase… Incredible. They expect for Q4 an increase of app. 33,5% to 40,5% compared to the same quarter in 2019.\n\n**Shareholders**\n\nThe main shareholder is Hui Zuo with 46,8% of the shares. He is the founder and the Chairman of the Board. Second greatest shareholder is Tencent Holdings Limited. Tencent provides services to KE in connection to various aspects of the operations. We all know that Tencent is doing great. The CEO Peng Yongdong also has 3,6% of the shares.\n\nIn August 2020 KE went public on the NYSE. Current market price is approx. $63.\n\n**Market opportunities**\n\nAccording to the CIC Report, China has the largest housing market in the world in terms of GTV and number of transactions of existing and new home sales and home rentals in 2019. After a period of significant growth, the market is expected to enter an era of steady growth. It is expected that the existing home transactions market will gain more importance and grow with a CAGR of 12.4%.\n\n**Risk factors (highlights)**\n\n·  The business is susceptible to fluctuations in China's residential real estate market and is subject to government regulations.\n\n·  If they fail to maintain relationships with real estate developers or attract them to engage them, or otherwise fail to procure new real estate property listings at favorable terms, the business and growth prospects may suffer.\n\n·  If they fail to obtain or keep licenses, permits or approvals applicable to the various services provided by them, they may incur significant financial penalties and other government sanctions.\n\n·  Competition from other industry players. They may lose market share and customers if they fail to compete effectively. Their greatest competitor is E-House. Alibaba has a large stake (&gt;10%) in E-House.\n\nSEC Filing F-1: [https://investors.ke.com/financials/sec-filings/sec-filings-details/default.aspx?FilingId=14285443](https://investors.ke.com/financials/sec-filings/sec-filings-details/default.aspx?FilingId=14285443)\n\n**Own opinion**\n\nKE is a long-term investment for me. They have a great growth potential. I really like the real estate sector, especially in such a large company like China, Also,  I started this DD some days ago. Today I read that ARK Invest also has invested in KE. And let’s be honest; everything Cathie touches turns into gold.",
        "subreddit": "investing",
        "title": "DD on KE Holdings ($BEKE)",
        "url": "https://www.reddit.com/r/investing/comments/lb2ztq/dd_on_ke_holdings_beke/",
        "created": 1612320108.0
    },
    {
        "author": "growthinvestor123",
        "created_utc": 1612217324,
        "id": "lafnxg",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "*Disclaimer - I am just a retard w/ a keyboard and you should do your own $DD. Also the karma whores @ WSB keep deleting my shit so one of you go post over there if you like $BB and what you read*\n\nTOday I did research to calm myself down after pounding a redbull and getting triggered by all the misinformation and greedy nitwits that have flooded this site looking for a quick flip.\n\nImagine you’re John Chen. Sauntering down the hallway, with your 50 pound dick grazing the velveteen carpet with each step. You hear the guttural screams coming out of sales. You walk by the engineers, and gaze upon the latest widget as they kowtow before your bespecled grandeur. You hear about the customers who sing your praises, and the (much fewer) ones who tell you your product sucks donkey balls... But we (the retards @ WSB or frankly the dubmasses @ seeking alpha and even JP Morgan equity coverage) don’t know the details any of this, only dry ass reports that come out every quarter.\n\nSo, other than hacking into John’s brain (not recommended), what can we do? We can suckle at the teat of Twitter announcements, and sometimes that’s fun but usually it’s PR driven (unless it comes from Papa Chen’s account in which case suckle away).\n\nBut boy oh boy wouldn’t it be great if we could know the things P. Chiddy does. What new things are in development. Big new sales in the pipeline. Whether the company is hiring (or shrinking), and in what areas….Wait. For the last thing we actually can!\n\nthanks to the grotesquely fat (and very rich, no offense Gabe) founder of a soul-crushing professional network called LinkedIn. Linkedin, very kindly, takes employment related info from companies and displays it for all the world including competitors of those companies and bored autists like me. So let’s see - What Can headcount trends @ $BB tell us about the company?\n\nTo start, I took a look at Job Postings / Total Headcount. If you’re a shrinking company, this should be a low number. If you’re growing, it stands to reason this % would be higher. No company deliberately hires people they don’t think they need, and last time I checked $BB’s CFO wasn’t completely retarded. Now, it’s important not to read too much into this, but as a general matter companies that are growing have high stock prices (b/c they’re growing, duh) and vice versa.\n\nFANG isn’t a perfect comp (I’ll get to the others in a sec), but **serves as a good proxy of a “baseline growthy” tech.** No super saiyan rocketships at this point, but nobody is accusing $AAPL of shrinking. See below.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8x0sjsj4wxe61.png?width=600&amp;format=png&amp;auto=webp&amp;s=dc0b996f191f3f47d37bb6b2888f537c6789ae0e\n\n# IMPLICATION NUMBER #1 - $$BB COMPARES FAVORABLY TO FANG IN TERMS OF HEADCOUNT-IMPLIED GROWTH. IF YOU SAID “$BB IS HIRING MORE RELATIVE TO ITS SIZE THAN THE AVERAGE FANG”, PEOPLE WOULD LAUGH AND THROW BANANAS AT YOU, BUT YOU’D BE RIGHT!!\n\n“But wait,” you say. “growthinvestor123 you fucking idiot, didn’t you just compare $BB to CRWD, ZS, SAIL, and PANW yesterday to justify a **$60 / share** price target for $BB? I want to see the ratios for those.” Ok you, got me. See below, headcount-implied growth is higher for endpoint security comparables.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q7cepei5wxe61.png?width=600&amp;format=png&amp;auto=webp&amp;s=d7308c115e3d45a072dac92b20ac029eb132b348\n\n“Hah,” you say smugly. “Those other endpoint security businesses blow $BB out of the water, $BB sucks”.\n\nNo, you fucking idiot. If a simple headcount ratio without context was all it took I’d be rich instead of handsome like mommy tells me.\n\n$BB went through [**round**](https://channeldailynews.com/news/layoffs-hit-blackberry-in-waterloo/28015) after [**round**](https://duckduckgo.com/?q=blackberry+layoffs&amp;atb=v224-1&amp;ia=web&amp;iai=r1-3&amp;page=1&amp;sexp=%7B%22cdrexp%22%3A%22b%22%2C%22artexp%22%3A%22b%22%2C%22prodexp%22%3A%22b%22%2C%22prdsdexp%22%3A%22c%22%2C%22biaexp%22%3A%22b%22%2C%22msvrtexp%22%3A%22b%22%7D) of painful layoffs as it shifted from being a handset business to what it is today. Despite what the trust fund communists on this site would want you to think, firing people is never easy, and a lot harder than even hiring them. No manager wants to see his team shrunk,and no CEO wants to be painted as a chainsaw wielding asshole. $$ BB has a **history**, and that is a blessing and a curse.\n\n**Remember**, Daddy chen’s primary focus for the past almost-decade has been driving a turnaround. The handset team? Gone. Money-losing International operations? Gone. But the smart monkes and useful apes who might be able to do more than throw feces at each other??? And these smart monkes who were retained – Well, no need to make a job posting for that role anymore, right?\n\n# IMPLICATION #2 – BLACKBERRY HAD &gt; 20K EMPLOYEES. UNTIL RECENTLY THE COMPANY HAS BEEN CUTTING, NOT GROWING, AND ONE OF THE FEW BENEFITS OF ITS PAST SHITTY HISTORY IS THAT THE COMPANY CAN NOW GROW VS. HAVING TO FIND NEW EMPLOYEES QUICKLY LIKE CERTAIN COMPETITORS\n\nThis brings me to the final part of our headcount analysis. Let’s look at those endpoint security comparables again. Headcount is one thing, but of the quality of that headcount? Let’s look at two two non-retard quotes –\n\n***\"I have my own theory about why the decline happens at companies like IBM or Microsoft. The company does a great job, innovates and becomes a monopoly or close to it in some field, and then the quality of the product becomes less important. The product starts valuing the great salesmen, because they're the ones who can move the needle on revenues, not the product engineers and designers. So the salespeople end up running the company.\" Steve Jobs***\n\n***“If your product requires advertising or salespeople to sell it, it’s not good enough: technology is primarily about product development, not distribution.” Peter Thiel***\n\nI was curious and did comparison of the ratio of $BB’s Engineering / IT monkeys to its sales. See below\n\nhttps://preview.redd.it/9s89num7wxe61.png?width=524&amp;format=png&amp;auto=webp&amp;s=5361754f68b831f3ad044aba2fed88c6f93c7849\n\nEven as a $BB bull, I didn’t expect the discrepancy to be so large.\n\n# IMPLICATION #3 – BLACKBERRY ACTUALLY IS MORE OF AN ENGINEERING / IT FOCUSED COMPANY RELATIVE TO ITS PEERS. IN MANY WAYS IT IS MORE OF A “START-UP”. EVEN WITH FINANCIAL PRESSURE, JOHNNY CHEN RETAINED TECHNICAL TALENT. WHAT DOES THAT SAY ABOUT THE COMPANY’S FUTURE, AND VALUATION ???\n\n**TLDR: BB IS NOT A ROCKET SHIP. IT IS A LONG RANGE SHUTTLE, CAPABLE OF BURSTS OF SPEED, PACKED TO THE GILLS WITH RETARDS AND TERRAFORMING EQUIPMENT AND HEADING TO MARS.**",
        "subreddit": "StockMarket",
        "title": "Part 2 of $DD no meems - Wwhat headcount analysis tells us about $BB -",
        "url": "https://www.reddit.com/r/StockMarket/comments/lafnxg/part_2_of_dd_no_meems_wwhat_headcount_analysis/",
        "created": 1612246124.0
    },
    {
        "author": "EZMoneyGreg",
        "created_utc": 1612279914,
        "id": "lay9hm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "IBM Feb 26th 120 Call - thoughts?",
        "url": "https://www.reddit.com/r/options/comments/lay9hm/ibm_feb_26th_120_call_thoughts/",
        "created": 1612308714.0
    },
    {
        "author": "EZMoneyGreg",
        "created_utc": 1612280007,
        "id": "layatw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "IBM Feb 26th 120 Call - thoughts?",
        "url": "https://www.reddit.com/r/options/comments/layatw/ibm_feb_26th_120_call_thoughts/",
        "created": 1612308807.0
    },
    {
        "author": "Deep_Ball_Sr",
        "created_utc": 1612294876,
        "id": "lb4f7r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "IBM to the moon next? 🚀 (been holding since my first nut dropped)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lb4f7r/ibm_to_the_moon_next_been_holding_since_my_first/",
        "created": 1612323676.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612294719,
        "id": "lb4cud",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "Got a favour to ask boys, IBM to the moon next? 🚀 (been holding it since my first nut dropped)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lb4cud/got_a_favour_to_ask_boys_ibm_to_the_moon_next/",
        "created": 1612323519.0
    },
    {
        "author": "GoatInvestments6231",
        "created_utc": 1612195379,
        "id": "la6ixz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I’ve made 200k in investments in the last 9 months . IBM is my next riser . Resistance right now is undervaluing the company heavily burst coming soon I’d recommend all to get in while you can",
        "url": "https://www.reddit.com/gallery/la6ixz",
        "created": 1612224179.0
    },
    {
        "author": "GoatInvestments6231",
        "created_utc": 1612194934,
        "id": "la6bzv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "IBM Surge",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la6bzv/ibm_surge/",
        "created": 1612223734.0
    },
    {
        "author": "i-love-dank-memes",
        "created_utc": 1612172836,
        "id": "l9zltb",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Let's to Intel next",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9zltb/lets_to_intel_next/",
        "created": 1612201636.0
    },
    {
        "author": "CandleBollinger",
        "created_utc": 1612191206,
        "id": "la4soi",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$INTC, Intel Insiders CEO and CFO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4soi/intc_intel_insiders_ceo_and_cfo/",
        "created": 1612220006.0
    },
    {
        "author": "strangebrain12",
        "created_utc": 1612187517,
        "id": "la3hp4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Intel?? Who has thoughts on it?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la3hp4/intel_who_has_thoughts_on_it/",
        "created": 1612216317.0
    },
    {
        "author": "CandleBollinger",
        "created_utc": 1612190121,
        "id": "la4e43",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$INTC, Intel CEO and CFO are buying , P/E only 11, yield 2,5 %.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4e43/intc_intel_ceo_and_cfo_are_buying_pe_only_11/",
        "created": 1612218921.0
    }
]