[
    {
        "author": "b0bee",
        "created_utc": 1628068847,
        "id": "oxow5h",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Why $FSLY is going to take you to moon fastly?\n\n\n**TL;DR: $FSLY is reporting earnings today after hours. Every cloud company out there worth its salt has reported great earnings so far. FSLY has been sold off for last 4 quarters post earnings primarily due to concerns regarding its largest customer being banned in US, which is not the case now. FSLY hired a new CFO, who was earlier the CFO of Fitbit fueling acquisition rumors**\n\n**Company Summary**\nFastly is a content-delivery network (CDN). Its customers include Spotify, NY Times, Shopify etc. It is positioned strongely in streaming, e-commerce, and online gaming.\n\n**Catalysts**\n- Earnings after hours today - August 4\n\n- Potential acquisition - Appointment of Ronald Kisling as CFO, who was most recently CFO of Fitbit, which was acquired by Google.\n\n- Potential earnings beat and increase in Guidance - FSLY recently acquired a cloud security company - Signal Sciences. This might be key for increased guidance and earnings beat as this product allows developers to protect their apps in every environment including cloud / onsite and edge.\n\n**Why it is 10x Bagger**\n- Short float is 22.25% and short ratio 6.26, that means at current volume it will take over 6 days for shorts to cover. Any increase in guidance and a healthy beat on earnings will rocket this stock to mars.\n- A very small chance of acquisition announcement in earnings call\n\n**Why it may flop again**\n- Its revenue is concentrated. Top 10 clients account for 29% of sales revenue. So, if any one of them fails, it materially affects FSLY. Good thing is, in 2017, the top 10 client's revenue accounted for 37% and now it has decreased to 29%.\n\n- Its main competitor is Cloudflare which offers everything that FSLY offers, and both are competing for the same sales share from legacy operators like Akamai etc. Though Cloudflare ($NET) product is more focused toward small and medium size businesses, whereas FSLY deals with big enterprises.\n\n**What does analysts say**\n\n- 12-month target - $52\n\n- Buys - 2 | Holds - 7 | Sells - 2\n\n\n**Play**\nThe stock is currently trading near its all-time low, current price is $46 and all time low - $40. $136 is all time high.\n\n- Since it's a binary and very risky play, its best to do a strangle, that is buy a call and put together on same strike or very close strike, near the money, considering the move is highly likely going to be over 10%, it will very much cover the cost of strangle.\n\n- You can also buy shares and hedge it with a near the money long puts for same week or next week.\n\n- And if you are feeling frisky, you can yolo $50 strike calls for Aug 6 | Aug 13 or Aug 20\n\n\n**My Position**\n- $49 Calls(200) for August 6 \n\n- 20,000 shares\n\n- $45 Puts(200) for August 13\n\n\n**Tracker**\nAs I am looking to do regular short and crisp DD's on /wsb for the stocks which I am playing myself. I will track my performance with each DD. My last DD is here:\nhttps://ns.reddit.com/r/wallstreetbets/comments/omvwpu/why_xpo_is_your_next_510x_bagger/?\nThis has done very well; stock has already gone up over 15% since the time of DD and thesis that I put in the dd unrolled exactly like that.\nScore - 1/1\n\n**Warning**\n I am degenerate like you all and I don't know shit. Do you own DD and don't trust anything from a stranger on internet. The above is no financial advice.\n\n**All the best apes, lets lose money together! **",
        "subreddit": "wallstreetbets",
        "title": "Why $FSLY will take you to moon fastly?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oxow5h/why_fsly_will_take_you_to_moon_fastly/",
        "created": 1628097647.0
    },
    {
        "author": "Mario4272",
        "created_utc": 1628696537,
        "id": "p2flww",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "I am a software engineer and have been working in the industry for 20+ years.  IMO I see a major Shift happening in the web industry.  Typically, web sites have been served up via servers or virtual servers maintained in data centers all over the world.  CDNs, Contend Delivery networks have improved the performance of those web sites considerably, by bringing certain resources closer to the user.  The shift I am speaking about, involves a movement to use the CDNs for the entire website experience.  You develop the site via JamStack like NextJS or Fauna  You deliver it to a CDN via tools like Netlify and boom, the site is 90x faster.  Yes data still travels between the user and the web site user interface, however, using things like client side caching alleviates the time and labor on the site down to changes only after the first load.  The CDN of choice lately is CloudShare.  They are coming up fast behind the big players like Akamai.  Again, just my thoughts based on my experience in this industry.  I'd love to hear anyone's feedback and opinions along the same line.  Thanks for reading",
        "subreddit": "wallstreetbets",
        "title": "Major Shift in Web Technology",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2flww/major_shift_in_web_technology/",
        "created": 1628725337.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628111182,
        "id": "oy2d8t",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, August 4, 2021**\n\nToday was another choppy day, with stocks ending the day mixed, with the Nasdaq (QQQ) climbing 0.14% while the S&amp;P 500 (SPY) and Dow Jones (DIA) fell 0.48% and 0.89% respectively. The Russell 2000 (IWM), which tracks the performance of small-cap stocks, fell 1.25%. It seems market participants were disappointed by a report from ADP, a leading employment services company, which estimated that private employers added half the expected amount of jobs in July. This sets a negative backdrop for the official July Jobs Report, set to be released this Friday. \n\nADP, a leading payroll and human services software company, released its July 2021 Employment Report, which estimated that private employers added only 330,000 jobs in July, less than half the 690,000 gain expected by economists. While ADP’s report isn’t 100% accurate, it’s usually fairly close and sets a negative backdrop for the official July Job Report on Friday. ADP’s report shows that the labor market imbalances stemming from the coronavirus pandemic remain. Moreover, with concerns surrounding the Delta variant increasing, that could be a relatively new factor adding more pressure. Here is the entire report: [https://adpemploymentreport.com/](https://adpemploymentreport.com/)\n\nConcerns surrounding the highly contagious coronavirus Delta variant continue to rise, with Florida emerging as the US’ new epicenter for the disease. Cases in Florida have jumped dramatically, going from 2432 on July 1 to 38,776 on July 30 and have so far had three consecutive days of record infections. Thankfully, however, despite the surge in cases, the death rate has so far remained stable and relatively low, a sign that the vaccines are very effective at preventing hospitalizations and serious death. \n\nSo far, 59% of the companies in the S&amp;P 500 (SPY) have reported Q2 earnings, with 88% of these beating analyst expectations, according to FactSet. This quarter is shaping up to be another record-breaking one, with corporate earnings growth rate expected to accelerate 85%, which would be the biggest jump since the Q4 2009. \n\nHowever, it is important to note that, despite beating earnings expectations, a number of these companies have pulled back, with tepid outlooks moving forward overshadowing strong results. Moving forward, given that most companies have so far exceeded pre-pandemic levels and the current quarter has an easy comparison to last year, expectations for growth are inevitably going to moderate. This said, I think the pullback in some stocks following earnings is an overreaction. \n\n**Highlights**\n\n* Shares of Lyft (LYFT) fell roughly 10% despite posting its first profitable quarter. Earnings are very weird.\n* Shares of GM slipped 8% after posting earnings.\n* Shares of NovaVax (NVAX) gapped up roughly 20$ after the company announced an agreement with the EU to sell up to 200 million COVID vaccines. \n* Shares of some Chinese companies somewhat after pulling back yesterday following signaling that the CCP may be targeting video game companies next as the regulatory crackdown on tech stocks continues. Yesterday, shares of Tencent (TCEHY) and other tech stocks fell after a state-media called video games \"spiritual opium\". This prompted Tencent to say it will limit gaming time for minors and may even ban those under 12 from its platform. \n* Shares of Robinhood (HOOD) gapped up again today, rising roughly 50% today.\n* Federal Reserve Vice Chair Richard Clarida said Wednesday the central bank is still on track to begin raising rates off their current near-zero levels in 2023, as long as the economic recovery remains on its current trajectory. He said “While, as Chair Powell indicated last week, we are clearly a ways away from considering raising interest rates and this is certainly not something on the radar screen right now, if the outlook for inflation and outlook for unemployment I summarized earlier turn out to be the actual outcomes for inflation and unemployment realized over the forecast horizon, then I believe that these three necessary conditions for raising the target range for the federal funds rate will have been met by year-end 2022.”\n* \\*\\***Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Akami Technologies (AKAM) with two target raises. Stock currently around $112\n   * Piper Sandler from $130 to $132 at Overweight\n   * Truist Securities from $130 to $140 at Buy\n* Alnylam Pharma (ALNY) with two target raises. Stock currently around $184\n   * Barclays from $196 to $216 at Overweight\n   * Morgan Stanley from $224 to $234\n* Arista Networks (ANET) target raised by Argus from $360 to $440 at Buy. Stock currently around $382\n* AstraZeneca (AZN) target raised by SVB Leerink from $63 to $69 at Outperform. Stock currently around $57\n* Caesars Entertainment (CZR) with two target raises. Stock currently around $85\n   * Morgan Stanley from $124 to $127 at Overweight\n   * Stifel Nicolaus from $125 to $130 at Outperform\n* DuPont (DD) target raised by Citigroup from $96 to $102 at Buy. Stock currently around $74\n* MicroChip Technology (MCHP) with a host of target raises. Consensus price target $190 at Buy. Stock currently around $148\n* Nvidia (NVDA) target raised by Rosenblatt Securities from $200 to $250 at Buy. Stock currently around $202\n* NXP Semiconductors (NXPI) with a host of target raises. Consensus price target $240 at Outperform. Stock currently around $212\n* SolarEdge Technologies (SEDG) target raised by Susquehanna from $325 to $350 at Outperform. Stock currently around $292\n* Square (SQ) target raised by Barclays from $340 to $345 at Overweight. Stock currently around $266\n\n“The way to get started is to quit talking and start working.” - Walt Disney",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, August 4, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/oy2d8t/here_is_a_market_recap_for_today_wednesday_august/",
        "created": 1628139982.0
    },
    {
        "author": "b0bee",
        "created_utc": 1628065133,
        "id": "oxo3mu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL;DR: $FSLY is reporting earnings today after hours. Every cloud company out there worth its salt has reported great earnings so far. FSLY has been sold off for last 4 quarters post earnings primarily due to concerns regarding its largest customer Tiktok being banned in US, which is not the case now. FSLY hired a new CFO, who was earlier the CFO of Fitbit fueling acquisition rumors\n\n**Company Summary**\nFastly is a content-delivery network (CDN). The reason you get the buttery smooth experience on Tiktok compared to lets say Instagram Reels is because Tiktok uses Fastly content network. Its customers include Spotify, NY Times, Shopify, Tiktok etc. It is positioned strongly in streaming, e-commerce, and online gaming.\n\n**Catalysts**\nEarnings after hours today - August 4\nPotential acquisition - Appointment of Ronald Kisling as CFO, who was most recently CFO of Fitbit, which was acquired by Google.\nPotential earnings beat and increase in Guidance - FSLY recently acquired a cloud security company - Signal Sciences. This might be key for increased guidance and earnings beat as this product allows developers to protect their apps in every environment including cloud / onsite and edge.\n\n**Why it is 10x Bagger**\n- Short float is 22.25% and short ratio 6.26, that means at current volume it will take over 6 days for shorts to cover. Any increase in guidance and a healthy beat on earnings will rocket this stock to mars.\n- An exceedingly small chance of acquisition announcement in earnings call\n\n**Why it may flop again**\n- Its revenue is concentrated. Top 10 clients account for 29% of sales revenue. So, if any one of them fails, it materially affects FSLY, like the way it happened with Tiktok. Good thing is, in 2017, the top 10 client's revenue accounted for 37% and now it has decreased to 29%.\n- Its main competitor is Cloudflare which offers everything that FSLY offers, and both are competing for the same sales share from legacy operators like Akamai etc. Though Cloudflare ($NET) product is more focused toward small and medium size businesses, whereas FSLY deals with big enterprises.\n\n**What does analysts say**\n12-month target - $52\nBuys - 2 | Holds - 7 | Sells - 2\n\n**Play**\nThe stock is currently trading near its all-time low, current price is $46 and all time low - $40. $136 is all time high.\n\n- Since it's a binary and very risky play, its best to do a strangle, that is buy a call and put together on same strike or very close strike, near the money, considering the move is highly likely going to be over 10%, it will very much cover the cost of strangle.\n- You can also buy shares and hedge it with a near the money long puts for same week or next week.\n- And if you are feeling frisky, you can yolo $50 strike calls for Aug 6 | Aug 13 or Aug 20\n\n\n**My Position**\n$49 Calls(200) for August 6 \n20,000 shares\n$45 Puts(200) for August 13\n\n**Tracker**\nAs I am looking to do regular short and crisp DD's on /wsb for the stocks which I am playing myself. I will track my performance with each DD. My last DD is here:\nhttps://ns.reddit.com/r/wallstreetbets/comments/omvwpu/why_xpo_is_your_next_510x_bagger/?\nThis has done very well; stock has already gone up over 15% since the time of DD and thesis that I put in the dd unrolled exactly like that.\nScore - 1/1\n\n**Warning**\n I am degenerate like you all and I don't know shit. Do you own DD and don't trust anything from a stranger on internet. The above is no financial advice.\n\n**All the best apes, lets lose money together!**",
        "subreddit": "wallstreetbets",
        "title": "Why $FSLY is your next 5-10x bagger",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oxo3mu/why_fsly_is_your_next_510x_bagger/",
        "created": 1628093933.0
    },
    {
        "author": "b0bee",
        "created_utc": 1628065549,
        "id": "oxo6sy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL;DR: $FSLY is reporting earnings today after hours. Every cloud company out there worth its salt has reported great earnings so far. FSLY has been sold off for last 4 quarters post earnings primarily due to concerns regarding its largest customer Tiktok being banned in US, which is not the case now. FSLY hired a new CFO, who was earlier the CFO of Fitbit fueling acquisition rumors**\n\n**Company Summary**\nFastly is a content-delivery network (CDN). The reason you get the buttery smooth experience on Tiktok compared to lets say Instagram Reels is because Tiktok uses Fastly content network. Its customers include Spotify, NY Times, Shopify, Tiktok etc. It is positioned strongly in streaming, e-commerce, and online gaming.\n\n**Catalysts**\n- Earnings after hours today - August 4\n- Potential acquisition - Appointment of Ronald Kisling as CFO, who was most recently CFO of Fitbit, which was acquired by Google.\n- Potential earnings beat and increase in Guidance - FSLY recently acquired a cloud security company - Signal Sciences. This might be key for increased guidance and earnings beat as this product allows developers to protect their apps in every environment including cloud / onsite and edge.\n\n**Why it is 10x Bagger**\n- Short float is 22.25% and short ratio 6.26, that means at current volume it will take over 6 days for shorts to cover. Any increase in guidance and a healthy beat on earnings will rocket this stock to mars.\n- An exceedingly small chance of acquisition announcement in earnings call\n\n**Why it may flop again**\n- Its revenue is concentrated. Top 10 clients account for 29% of sales revenue. So, if any one of them fails, it materially affects FSLY, like the way it happened with Tiktok. Good thing is, in 2017, the top 10 client's revenue accounted for 37% and now it has decreased to 29%.\n- Its main competitor is Cloudflare which offers everything that FSLY offers, and both are competing for the same sales share from legacy operators like Akamai etc. Though Cloudflare ($NET) product is more focused toward small and medium size businesses, whereas FSLY deals with big enterprises.\n\n**What does analysts say**\n- 12-month target - $52\n- Buys - 2 | Holds - 7 | Sells - 2\n\n**Play**\nThe stock is currently trading near its all-time low, current price is $46 and all time low - $40. $136 is all time high.\n\n- Since it's a binary and very risky play, its best to do a strangle, that is buy a call and put together on same strike or very close strike, near the money, considering the move is highly likely going to be over 10%, it will very much cover the cost of strangle.\n- You can also buy shares and hedge it with a near the money long puts for same week or next week.\n- And if you are feeling frisky, you can yolo $50 strike calls for Aug 6 | Aug 13 or Aug 20\n\n\n**My Position**\n- $49 Calls(200) for August 6 \n- 20,000 shares\n- $45 Puts(200) for August 13\n\n**Tracker**\nAs I am looking to do regular short and crisp DD's on /wsb for the stocks which I am playing myself. I will track my performance with each DD. My last DD is here:\nhttps://ns.reddit.com/r/wallstreetbets/comments/omvwpu/why_xpo_is_your_next_510x_bagger/?\nThis has done very well; stock has already gone up over 15% since the time of DD and thesis that I put in the dd unrolled exactly like that.\nScore - 1/1\n\n**Warning**\n I am degenerate like you all and I don't know shit. Do you own DD and don't trust anything from a stranger on internet. The above is no financial advice.\n\n**All the best apes, lets lose money together!**",
        "subreddit": "wallstreetbets",
        "title": "Why $FSLY is your next 5-10x bagger",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oxo6sy/why_fsly_is_your_next_510x_bagger/",
        "created": 1628094349.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1630113830,
        "id": "pd0hz9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | J B Hunt Transport Services Inc | **JBHT** | 2.64%  \n2. **Health Care** | DENTSPLY SIRONA Inc | **XRAY** | 2.82%  \n3. **Information Technology** | Teradyne, Inc. | **TER** | 4.64%  \n4. **Communication Services** | Live Nation Entertainment, Inc. | **LYV** | 2.54%  \n5. **Consumer Discretionary** | Caesars Entertainment Inc | **CZR** | 4.25%  \n6. **Utilities** | AES Corp | **AES** | 1.34%  \n7. **Financials** | Zions Bancorporation NA | **ZION** | 5.02%  \n8. **Materials** | Freeport-McMoRan Inc | **FCX** | 5.86%  \n9.  **Real Estate** | Host Hotels and Resorts Inc | **HST** | 3.47%  \n10. **Consumer Staples** | Campbell Soup Company | **CPB** | 2.40%  \n11. **Energy** | Occidental Petroleum Corporation | **OXY** | 6.87%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **L3Harris Technologies Inc** | LHX | **-0.98%**  \n2. Health Care | **Moderna Inc** |  MRNA | **-4.52%**  \n3. Information Technology | **Akamai Technologies, Inc.** | AKAM | **-0.98%**  \n4.  Communication Services | **No losers** | |  \n5. Consumer Discretionary | **Dollar Tree, Inc.** | DLTR | **-2.77%**  \n6. Utilities | **Entergy Corporation** | ETR | **-1.75%**  \n7. Financials | **No losers** | |  \n8. Materials | **FMC Corp** | FMC | **-0.57%**  \n9. Real Estate | **Equinix Inc** | EQIX | **-0.02%**  \n10. Consumer Staples | **Constellation Brands, Inc. Class A** | STZ | **-0.90%**  \n11. Energy | **No losers** | |",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 8/27/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pd0hz9/sp500_winners_and_losers_8272021/",
        "created": 1630142630.0
    }
]