[
    {
        "author": "MVST_100_OR_BUST",
        "created_utc": 1615527937,
        "id": "m3b0p7",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "  \n\nSo, I took some time out to put what I know together, I lost access to my old account so I’ll be posting from here. [This is part 5 of the series](https://www.reddit.com/r/SPACs/comments/l5y3xq/200000_bet_on_thcb_microvast_part_4_da_coming/). I will preface and say that this is what I know to the best of my knowledge and **I am not liable for you not doing your own confirmation**. I did my best with providing sources. I also deliberately left out “dead horse” information. The information is 100% vital but people have posted them already. You can talk about them in the comments but I left them out to save space. Thus said, enjoy...\n\n[part 4](https://www.reddit.com/r/SPACs/comments/l5y3xq/200000_bet_on_thcb_microvast_part_4_da_coming/)\n\n[part 3](https://www.reddit.com/r/SPACs/comments/klcx7i/microvast_financials_and_new_big_four_chinese/)\n\n[part 2](https://www.reddit.com/r/SPACs/comments/kikfkf/microvast_and_tesla_partnership_quantum_scape_and/)\n\n[part 1](https://www.reddit.com/r/wallstreetbets/comments/k0g3br/thcb_microvast_dd/)\n\n# Valuation, Share price, and financial backing\n\nTHCB has been declining due to several factors that I believe in the long term is inconsequential. \n\nIt has going against it that…\n\n1.  The overall market is on a slump.\n\n2. The Tech/EV market is on a slump.\n\nThe truth of the matter however is that both markets WILL return. If you spend enough time on Reddit or watch the news you’d think the world is ending. However, I personally believe that we were never in a massive bubble. Maybe the past few weeks but not the past few months or years. The market is efficient and was priced exactly where it should be and everything is now for sale. All working-class American retirement is now tied to the stock market. Not social security, not pensions that are invested in bonds, gold, etc. With QE the US government has made a material change in the risks associated with the stock market. This is in addition to retail investors being at record highs, including increased participation from internationals. While there is a micro-event occurring, the market will eventually bounce to new highs, after high yielding bonds are bought, remaining and additional funds will return to the market. \n\nIn a market correction or “bubble popping”, everything doesn’t just go to zero. What will happen is the “pets.com”’s of SPACs will go to ZERO, and you know EXCATLY which ones are those. That money will get consolidated into solid investments. Selling Microvast now in my opinion would be selling a solid investment that will make you realize any losses that you are going through. It is part of the reason why I never invest in anything I don’t plan on holding for a while. Most startups, concepts, etc. fail. Investing in research projects are almost never a good idea. Microvast was founded years ago by an individual who sold his prior business for 50X ROI. Microvast has survived 2008, survived the pre-tesla anti-EV environment, survived the 2015 China market crash, survived COVID-19, etc. Its reasons for struggling will be explained further below. Going forward the value in Microvast is essentially its vertical integration and currently viable solutions to unresolved issues like this\n\n[https://twitter.com/GUNMTLM3/status/1367607456361193475](https://twitter.com/GUNMTLM3/status/1367607456361193475)\n\nWith that being said, a significant amount of money is behind Microvast. In total over $1B has been invested into Microvast by these parties.\n\n**Koch Disruptive Technologies** \n\n**CITIC Bank**\n\n**Blackrock**\n\n**Oshkosh**\n\n**US Department of Energy**\n\n**Ford**\n\n**GM**\n\n&amp;#x200B;\n\nNone of these companies are in the business of losing money (except Ford) and have significantly more information than we do about Microvast and the marketspace. Koch’s disruptive technologies fund spent $3B on SPACs and Microvast was one of only four that they believed have high risk high reward value.\n\n&amp;#x200B;\n\n# Potential Partners\n\nThese are potential partners ranked from most likely with sources provided, except in the case of personnel.\n\n&amp;#x200B;\n\n**CNH Industrial**\n\nCNH Industrial is like the John deer of Europe pulling in about $30B in revenue like the likes of Tesla, John deer, etc.. They are owned by the same people who own Ferrari, Fiat, Maserati, Dodge, Chrysler, Alfa Romeo and several other auto manufacturers. Microvast claims that they are running at full capacity and have a backlog of orders. Part of the reasoning for the Germany plant was a letter of intent between CNHI for electrification options of their entire subsidiaries. \n\n[https://newsroom.jeschenko.de/microvast/](https://newsroom.jeschenko.de/microvast/)\n\nThis is their German PR outlet. I translated everything from german to English and lost the files. Unfortunately, I’m NOT doing that again. Use google translate/camera. \n\n&amp;#x200B;\n\n**Oshkosh**\n\nThis is an important partnership because Oshkosh has invested millions into the PIPE funding. They have a financial incentive to increase the value of Microvast through multi-million dollar deals. People have been fixating on the USPS deal, and there are so many DD posts on it so I wont cover that. Oshkosh has several other uses for Microvast. The first is their JLG business which is going full electric. JLG owned by Oshkosh is currently working on a supply deal. Another opportunity is the Oshkosh PowerPulse diesel-electric system. The ROI for these systems is huge. The M1 Abrams gets 2 miles per gallon, the vehicle to transport it, the Oshkosh M-1070 gets less than 1 mile per gallon. Oshkosh came out with the ProPulse system which is forced to use supercapacitors due to the large current demands, but the Microvast LTO would be the next step forward for the PowerPulse system. There have also been rumors of EV dump trucks. \n\nTo speak on USPS and them going full electric. There have been rumors of Oshkosh and insider trading involving the US government and USPS. It could be true or it could be just butthurt Workhorse investors. Either way some congressman have been buying Oshkosh and Ford since their submission date.\n\nI estimate about $1M+ has been invested in Ford and Oshkosh by members of Congress between July the USPS vehicle deadline and today, there is a time delay of reports so there may be more purchases that won't be revealed until several weeks from now. There have been ZERO workhorse purchases. Here are some examples of F/OSK purchases\n\n[https://efdsearch.senate.gov/search/view/ptr/33782dc2-cf18-4f2f-82c3-64d6e9572596/](https://efdsearch.senate.gov/search/view/ptr/33782dc2-cf18-4f2f-82c3-64d6e9572596/)\n\n[https://disclosures-clerk.house.gov/public\\_disc/ptr-pdfs/2020/20017929.pdf](https://disclosures-clerk.house.gov/public_disc/ptr-pdfs/2020/20017929.pdf)\n\n[https://disclosures-clerk.house.gov/public\\_disc/financial-pdfs/2021/10039440.pdf](https://disclosures-clerk.house.gov/public_disc/financial-pdfs/2021/10039440.pdf)\n\nSources:\n\n[https://www.rermag.com/mergers-acquisitions/article/21154954/jlg-industries-inc-investment-in-battery-technology-specialist-microvast-to-strengthen-jlgs-electrification-capabilities](https://www.rermag.com/mergers-acquisitions/article/21154954/jlg-industries-inc-investment-in-battery-technology-specialist-microvast-to-strengthen-jlgs-electrification-capabilities)\n\n[https://www.jlg.com/en/equipment/electric-hybrid-boom-lifts](https://www.jlg.com/en/equipment/electric-hybrid-boom-lifts)\n\n[https://oshkoshdefense.com/advanced-technologies/propulse/](https://oshkoshdefense.com/advanced-technologies/propulse/)\n\n&amp;#x200B;\n\n**Ford**\n\nAgain, trying to reduce repetition. This post has more information on Ford. \n\n[https://www.reddit.com/r/SPACs/comments/lvk44e/summary\\_of\\_microvasts\\_partners\\_thcb/](https://www.reddit.com/r/SPACs/comments/lvk44e/summary_of_microvasts_partners_thcb/)\n\n&amp;#x200B;\n\nWhat I will add is one, that Ford has came out that they will **NOT** be building their own battery factories. The second being an excerpt, likely from Ford about Microvast in the proxy report:\n\n**“The material is currently being evaluated through a United States Advanced Battery Consortium grant, and the project manager from one of the big three OEMs describes this technology as “the greatest breakthrough in LIB separator technology in 20 years”.**\n\nSource:\n\n[https://insideevs.com/news/442058/ford-doesnt-want-own-battery-factory/](https://insideevs.com/news/442058/ford-doesnt-want-own-battery-factory/)\n\n&amp;#x200B;\n\n**BMW**\n\nBMW is another potential contract. They have been working for years with microvast on a fast-charging protocol. Several of Microvast GmbH engineers are former BMW employees or former Joyson employees which is the BMS provider for BMW (hybrids, i3, i8 etc.). Another profound statement in the DA was:\n\n“In Europe, our primary customers include industry-leading companies such as FPT, the global powertrain brand of CNH Industrial Group, ZF Friedrichshafen AG (ZF Group), Safra, CARGOTEC**, a luxury sport vehicle German OEM**, VDL, TFL and the London Bus Operators (former Wrightbus).”\n\nThat really only leaves BMW, Mercedes, Volkswagon / Porsche, and Audi as options. In addition to what was said about CNHI, in an interview with Sascha Kelterborn, they claim that the new factory will be producing the new 330 Wh/kg NMC battery. As per the DA “NMC technology have been third-party evaluated by TUV and various U.S. National Labs, confirming our claims to performance.” In fact, they are one of only two commercial businesses considered to be involved at Argonne CSE. These new NMC cells as per the interview, are designed for the VDA EV standard. The German Association of the Automotive Industry (VDA) is comprised of BMW, Mercedes, and Volkswagon. They are an automobile association setting the standards their suppliers must abide by for their vehicles.\n\nSources\n\n[https://www.energy.gov/sites/prod/files/2020/02/f71/Chapter\\_2\\_Batteries\\_R%26D\\_0.pdf](https://www.energy.gov/sites/prod/files/2020/02/f71/Chapter_2_Batteries_R%26D_0.pdf)\n\n[https://www.anl.gov/cse/technology-development](https://www.anl.gov/cse/technology-development)\n\n&amp;#x200B;\n\n**Daimler (Mercedes Benz, Daimler trucks, etc)** \n\nMicrovast is literally a few yards away from the famous Mercedes Ludwigsfelde factory. \n\nIbb.co/RcbmRpV (new factory was built to the right)\n\nThis factory manufactures the electric Sprinter van among other vehicles. Daimler is also working on an LTO based trucking platform. There is really only two OEMs to pick for regarding this which is Toshiba SciB or Microvast. The proxy and other filings list BMW by name so Mercedes could also be what is being referred to.\n\nSource:\n\n[https://www.energy.gov/sites/prod/files/2020/05/f75/ace100\\_Villeneuve\\_2020\\_o\\_4.29.20\\_250pm\\_TDM.pdf](https://www.energy.gov/sites/prod/files/2020/05/f75/ace100_Villeneuve_2020_o_4.29.20_250pm_TDM.pdf)\n\n&amp;#x200B;\n\n**Tesla**\n\nThis rumor has been around for a while now. It’s largely due to the physical locations of the new Tesla factory as well public discussions between Microvast and tesla on social media. Definitely a reach but the greatest EV producer still has not figured out how to stop their cars from spontaneously catching fire. Now extrapolate this to an EV semi that’s estimated to hold 10-15 tons worth of batteries. Tesla to my knowledge has really not publicly said anything about solving this risk. \n\n[https://mobile.twitter.com/GUNMTLM3/status/1367607456361193475](https://mobile.twitter.com/GUNMTLM3/status/1367607456361193475)\n\n&amp;#x200B;\n\n**China’s Industrial Mining Industry**\n\nWhile I put this last, I don’t think its necessarily least likely, more that its an overlooked aspect by retail investors. INHO the largest per vehicle beneficiaries of EV would actually be the autonomous mining industry. Their vehicles all get less than 1 mile per gallon. Millions in fuel is spent per year literally on just fuel costs for a single dump truck in a single open pit mine. High draw of battery power is a negligible factor if done right, as the sheer weight of these machines recharges them to the point of infinite range. While mining has been growing worldwide, I put china here because they are seeing an explosion in automated mining and they have the greatest chance of skipping technological generations and having their new massive mines adopt EV transport equipment. \n\n[http://www1.micmotor.com.cn/en/business1.html](http://www1.micmotor.com.cn/en/business1.html)\n\n[https://blog.iseekplant.com.au/blog/worlds-biggest-dump-trucks](https://blog.iseekplant.com.au/blog/worlds-biggest-dump-trucks)\n\n[https://www.autoblog.com/2019/08/26/edumper-electric-mining-truck-self-charging/](https://www.autoblog.com/2019/08/26/edumper-electric-mining-truck-self-charging/)\n\nJust to give you an idea 50,000 metric tons of diesel is equivalent to $30 Million dollars.  \n\n[https://www.oemoffhighway.com/trends/electrification/article/21047959/electric-and-autonomous-vehicles-in-mining](https://www.oemoffhighway.com/trends/electrification/article/21047959/electric-and-autonomous-vehicles-in-mining)\n\n&amp;#x200B;\n\n# Technology\n\nLooking at the marketcap of a lot of EV companies, technology is obviously where the eyes are (which is not without reason). Below is the summary of Microvast’s tech and how it holds up to the competition.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6x4wsrbv9jm61.png?width=756&amp;format=png&amp;auto=webp&amp;s=fc494b9575a59c6baeb45bede6f98f6f24c08262\n\n&amp;#x200B;\n\n**Future technology**\n\nBased on research conducted at Argon National lab, patents filed, and trademarks filed, microvast publications, I’ve been led to believe that Microvast will be releasing a battery of this type within a year from now, from most likely to least likely.\n\n**Lithium – Silicon, Silicon-Carbide:** From the proxy statement on R&amp;D, “In the coming years we anticipate that we will develop and market **a new product that contains silicon or silicon oxide**.” This is the same route that Tesla is following instead of solid-state batteries. Microvast personnel have several publications on this topic. \n\n**Solid State:** Has already been covered extensively. A part of the 476 Microvast patents.\n\n**Lithium – Sulfur:** Following the pattern of Microvast’s naming convention the elemental symbol for S is Sulfur. This would be pretty big, bigger than solid state, if it turns out to be the true. Specific energy would be over 2,600 Wh/Kg. Microvast personnel have prior research experience on this subject. \n\n**Sodium Ion Battery for large scale energy storage:** The symbol for Sodium is Na not S so the trademark may not necessarily make sense at its face, but they could be also referring to **So**dium. Several publications including ones co-authored by Microvast and Argonne refer to this battery type as S-ion batteries instead of Na-ion batteries. If this being the next battery chemistry is true, this is also a big deal because large scale energy storage is likely not going to be what Tesla or Stem are doing. It is going to be a different low cost highly abundant chemistry like sodium ion batteries. \n\n[https://en.wikipedia.org/wiki/Sodium-ion\\_battery](https://en.wikipedia.org/wiki/Sodium-ion_battery). The “**Smartery**” trademark might be the equivalent of what Stem inc and others are doing in terms of smart distribution of power. Microvast’s future may be including the battery management into the vertical integration process. From the proxy document: “Our R&amp;D efforts are focused on the following areas:… we are developing control strategies and other systems to manage grid-scale energy storage units.” Lastly they had a older PowerPoint I found floating around that they were investigating sodium ion batteries. Unfortunately, I can no longer find it.  \n\n**Sources**\n\n[https://trademarks.justia.com/878/42/hnso-87842259.html](https://trademarks.justia.com/878/42/hnso-87842259.html)\n\n[https://www.onscope.com/ipowner/en/ip/tmem/018386449.html](https://www.onscope.com/ipowner/en/ip/tmem/018386449.html)\n\nIn regards to patents if you use the wayback machine on microvast's websites youll see that trademark to commercial release can be anywhere from 1 to 4  years. \n\n[https://onlinelibrary.wiley.com/doi/full/10.1002/aenm.201702403](https://onlinelibrary.wiley.com/doi/full/10.1002/aenm.201702403)\n\n[https://pubs.rsc.org/hy/content/articlehtml/2017/ee/c7ee00827a](https://pubs.rsc.org/hy/content/articlehtml/2017/ee/c7ee00827a)\n\n[https://www.sec.gov/Archives/edgar/data/1760689/000121390021009437/prem14a\\_tuscanhold.htm](https://www.sec.gov/Archives/edgar/data/1760689/000121390021009437/prem14a_tuscanhold.htm)\n\n[https://www.tesmanian.com/blogs/tesmanian-blog/tesla-silicon-fast-charge-is-on-the-way](https://www.tesmanian.com/blogs/tesmanian-blog/tesla-silicon-fast-charge-is-on-the-way)\n\nPersonnel:\n\n[https://scholar.google.com/citations?hl=en&amp;user=Rdz80qcAAAAJ&amp;view\\_op=list\\_works&amp;sortby=pubdate](https://scholar.google.com/citations?hl=en&amp;user=Rdz80qcAAAAJ&amp;view_op=list_works&amp;sortby=pubdate)\n\nI won’t continue to post people’s personal information (even though its public and legal) but if you look hard enough you can find others. The R&amp;D team includes respectable individuals from US institutions including Argonne and International universities with research comprising ALL of the battery technology listed above. \n\n&amp;#x200B;\n\n# Lock up period\n\nThis is one of the most important details when it comes to SPAC mergers. Lockups will signify if the stock is a pump and dump scheme or is a legitimate operation with ongoing efforts to increase shareholder stake values (and subsequently their own equity) which improves investor confidence. The SPAC standard as of late has been that PIPE investors have essentially ZERO to 30 days of lockup before they can start selling. This has screwed people up multiple times on this sub (HYLN, NKLA, GEOV, etc). As soon as the resale registration is filed, they can start selling. For the merging companies the typical lockup is ZERO to 6 months. Below are the lockup details for microvast\n\n**PIPE:**  Tuscan will have to provide the PIPE 6,736,111 shares (from convertible notes) + 48,250,000 shares = 55 million shares (included within the 300M shares) which equates to approximately 18% ownership of Microvast as depicted in the DA presentation. Lockup period is 6 months regardless of market conditions. However, a form S-8 will be filed immediately after merger to lockup 5% of total shares for employee incentives. If there was any uncertainty with this DD its here. Id personally be on the lockout for registrant filings post-merger. They aren’t necessarily bad as some markets on some stocks will eat those up, but its best to stay vigilant   \n\n**Yang Wu (Microvast CEO):** 12 Month 25% lock-up unless MVST is trading over $15 for over 20 days. His other remaining 75% of holdings are subject to a 24 Month lockup regardless of market conditions. Wu has a sizable (but not unheard-of) ownership of Microvast at 31% (85M shares) at MOST he can sell 25M shares. He has zero salary or stock options so his financial future is solely dependent on MVST’s share price. \n\n**Everyone else:** 6 Months regardless of market conditions. \n\nI don’t think these terms are abusive, they are slightly better than average but not as good as the proposed lockups they had in a previous proxy so this is a heads up. There have been some material changes between the two. From what I can remember the previous Wu lockup condition was $18 over 30days vs $15 over 20, Non-Wu shareholders locked up was 12 months. So, they probably felt that things were cooling down between the draft of that agreement and the new terms months later. I don’t find this shady at all. Microvast and Tuscan have done a good job detailing out every single way Microvast can playout, and performing audits. \n\n&amp;#x200B;\n\n# Common misconceptions\n\nThese are some false information I’ve seen involving Microvast.\n\n&amp;#x200B;\n\n**“There are 750M outstanding shares”**\n\nOutstanding shares is 300M not 750M. The 750M value is the AUTHORIZED shares which is just a limitless number that’s needed for regulatory reasons. It determines the MAX amount of shares they can legally ever issue. Typically, corporations will have multiple times more authorized shares than they have outstanding shares.\n\n&amp;#x200B;\n\n**“Ashmore considered Microvast “worthless.””**\n\nWhile they were not necessarily satisfied with the appreciation of Microvast since investing years ago they did see increases in value up until late 2018-2020 where debt (which has now been resolved) was greater than assets. So, ON PAPER Microvast was “worthless” but not really (like a lot of other companies with debt-to-equity ratios &lt; 1). In fact, based on filings Ashmore has increased their position and will own almost 10% of Microvast. Most of the concerns in their summaries was hypotheticals and not current business conditions. \n\n&amp;#x200B;\n\n**“Microvast isn’t a startup they’ve been around since 2006”**\n\nWhile this is true, Tesla and co literally have been around since the early 2000s (Tesla (2006), Lucid (2007), Aptera (2005), Rivian (2009), Fisker (2007) etc.). There is a reason why all of these started around the same time but that’s a discussion for another day. Microvast suffered for all the reasons why those businesses suffered. Microvast is one of the few survivors of that era and is nothing to be bearish about.\n\n&amp;#x200B;\n\n**“Microvast is a Chinese company”**\n\nThis is usually said with negative sentiment. It’s a weird one because companies like NIO, Xpeng, Alibaba, etc are purely Chinese businesses, one of which is a clone of an American product. Considering Microvast's large number of international employees, investors, factories, etc. I’d considerate an international business at this point. It's actually is in a really good position where it is American enough to win US grants and conduct research with US universities, but Chinese enough to have access to the EV boom in China.\n\n[vm.tiktok.com/ZMek1MX5S/](https://vm.tiktok.com/ZMek1MX5S/)\n\n&amp;#x200B;\n\n**“ Stanley Whittingham is only there for appearances”** \n\nDr. Whittingham is a noble prize winner who still publishes battery research to this day, which includes several publications on Lithium silicon batteries from 2018-2021. He was brought on by Tuscan with Vogel and others to be directors. However, he was also specifically elected by Yang Wu and will continue to stay on board post-merger at minimum for 2 years. Believe it or not he has worked with Microvast research staff prior to this merger. He likely is involved in the lithium-silicon or other battery type development\n\n&amp;#x200B;\n\nThe last thing I can say is that the definitive agreement deadline is May 1st. Many users priorly were upset they missed the gap up to $27. This date would likely be the last date to buy in. Trade Safely!",
        "subreddit": "SPACs",
        "title": "THCB / Microvast DD Part 5",
        "url": "https://www.reddit.com/r/SPACs/comments/m3b0p7/thcb_microvast_dd_part_5/",
        "created": 1615556737.0
    },
    {
        "author": "th3cr1t1c",
        "created_utc": 1615658754,
        "id": "m4boaq",
        "num_comments": 115,
        "num_crossposts": 0,
        "selftext": "*reprinted from an earlier commentt I made elsewhere on the boards*\n\n**Time Value of Money (TVM)** is the central principle of all finance, and it can work for you or against you. It's applicable to everything: Giving up some money now for more money later, or buying a dollar for sixty cents versus the other way around.\n\nThe Time Value of Money equation can be expressed as:\n\nFV = PV x (1 + r)^(nt)\n\nWhere FV is the future value of an asset. PV is the present value. r is the rate of return. n is the number of times compounded per term. t is the term (in years) compounded. e.g. if you are compounding monthly for 30 years then n = 12, t = 30, nt = 12 \\* 30 = 360.\n\nWhen you're a borrower, you're paying the premium. When you're a depositor and investor, you're collecting the premium... provided that you are properly pricing assets and not buying into the inflated premiums speculators attach to stocks on the front end.\n\nIf you're old enough to remember, there was this game for the Apple \\]\\[ called *Taipan!* that taught Time Value of Money and compound interest in a very interesting way:\n\nThe game involved being a trader on the China Sea. It was basically the predecessor to Dope Wars... you would fight pirates, collect their treasure, buy bigger ships, buy cannons, trade arms, silk, cargo and opium. Opium was like a day trading stock. It could skyrocket for no reason. And you could get rich, then you'd get mugged by robbers and lose all your cash.\n\nYou have this Elder Brother Wu who is basically a loan shark. He can loan you money but he'll loan it to you at a usurious rate of interest... it compounds 10 percent *per turn.* And if you don't pay him off *he'll send his bodyguards to cut your throat.*\n\n**BUT THERE'S A GLITCH...**\n\nIf you repay Wu more money than you owe him, suddenly you have a negative balance... and it grows at the same rate of interest, but in your favor. He owes you 10 percent compounded per turn.\n\nIf you play this out for a while, your balance with him grows into the billions and trillions and hundreds of trillions of British pounds. Pretty soon, the risk of getting mugged over £3 million in opium seems worthless, because by this point in the game you're making more than ~~ten~~ 1000 times that just moving from port to port, causing Wu to incur [humongous interest](https://i.imgur.com/4VtO2BL.png).\n\n**That** is why you should always be, literally, on the right side of the Time Value of Money equation.",
        "subreddit": "stocks",
        "title": "How I Learned About Time Value of Money and Compound Interest Dealing Drugs on the High Seas At The Age Of Ten -or- Why I'm a Value Investor",
        "url": "https://www.reddit.com/r/stocks/comments/m4boaq/how_i_learned_about_time_value_of_money_and/",
        "created": 1615687554.0
    },
    {
        "author": "rook785",
        "created_utc": 1615598198,
        "id": "m3vyog",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "*Join me on this rocket ship named QFIN.*  🚀 🚀 🚀 🚀 🚀 \n\nI have ventured out of my usual territory in my hunt for an exotic rocket ship-shaped banana, and I’ve got good news for all ape-kind: I’ve found one. Here’s my DD (whatever that means). \n\nTicker: **QFIN**, AKA \"360 Digitech\". They are a Chinese Fintech company. Currently trading around $31.50. Market Cap is around 4.8 Billion. Very few people in America have heard of them. PE is less than 10, growth is insane, plenty of cash on the balance sheet, low leverage, etc. From a fundamentals or cashflow analysis, this is a banana mine. \n\n**Here's their business model:**\n\n*First*, they use their online presence to advertise loans to the rapidly-growing Chinese middle class.\n\n*Second*, they use their proprietary risk-assessment tools to analyze the credit-worthiness of the applicants. They also have proprietary identification tools to help prevent fraud and simultaneously speed up the loan process (this is a bigger deal than it sounds like due to the strong desire for convenience in lending) \n\n*Third*, they partner with banks to supply the capital for the loans. \n\n*Fourth,* they service the loans and deal with recovery in case of defaults.\n\nThe business model is important because in order to understand why this is an amazing buy you also need to understand where their revenue comes from. It's not just loan interest as you would expect.\n\n**But first, let’s talk numbers.** 2017 Revenue: *175 million* 2018 Revenue: *3.75 Billion* 2019 Revenue: *6.99 Billion* TTM: *9.19 Billion* (TTM means trailing twelve months)\n\nObviously that’s insane growth. Most apes can’t even count that high. \n\nAnd yet, despite that growth, their P/E ratio is a measly **9.4!** *(P/E is a measure of how high up tree us apes must climb to reach banana, lower number = banana more soon)* **That’s less than half the P/E of the S&amp;P 500** *(P/E: 27.5*), **despite having significantly more growth.** \n\nTo understand why the stock is still so cheap, let’s talk about why dumb apes might *NOT* want to buy it. \n\nFirstly, I assume most of you haven’t bought it yet because you have never heard of it. Do a search for QFIN on reddit – it’s next to impossible to find mention of it here. Furthermore, the trading volume is extremely low…. And most of the ownership is institutional. A few hedge funds, sure, but mostly ETFs, which is exactly what’s caused this great buying opportunity. As most Chinese Fintech stock prices have struggled lately with regulations (with the exception of this week), QFIN is relatively immune from the changes. QFIN has only gone down because most of the ownership is through the sector ETFs, which have been dragging QFIN down with them. Only recently did it buck the trend and move away from its sector's performance, in large part because people are just now starting to notice it.\n\nThis is a misunderstood company with obvious value. The play here isn’t that there’s extra value - the value is obvious to everyone - the play is that the “problems” are being significantly exaggerated and misunderstood… so rather than tell you where the deep value is, I will instead focus on why the doubters are wrong and why QFIN is uniquely placed in its sector. \n\n**First Reason for Doubt – Winnie the Pooh.** The Chinese Fintech industry has recently been slapped with some extra regulations that I had to get my mandarin-speaking wife to translate for me. \n\nOne regulation is that for microlending transactions involving banks and partners, the partners (in this case, QFIN) must contribute at least 25% of the capital. Here’s a breakdown of the rules: [https://www.bloomberg.com/news/articles/2021-02-20/china-imposes-further-caps-on-online-lending-amid-clampdown](https://www.bloomberg.com/news/articles/2021-02-20/china-imposes-further-caps-on-online-lending-amid-clampdown). *The stock tanked 30% when this happened.*\n\n**Why it doesn’t matter:** According to QFIN’s CEO, Wu “Cock Slapper” Haisheng, *“Currently, the outstanding balance of the outstanding loans issued through our micro lending subsidiary, accounts for less than 1% of the total loan balance, and joint lending accounts for around 0.01%. Therefore, based on our personal evaluation, the new rules will have little impact on our loan origination business.”* \n\nAnother new regulation is that online lending can only be done with banks that are established in the same province as the applicant. This is no problem – QFIN has a multitude of partners in each region. There are other new regulations coming down the pipeline (capital requirements, etc) but QFIN is well capitalized and capable of overcoming all the known issues. \n\n**Second Reason for Doubt – Default Risk.** There is concern that the loan default rate will be high, especially if China’s economy crashes, and that this will destroy the value of the company similarly to what happened to US banks with bad mortgages in 2008.\n\n**Why it doesn’t matter:** First of all, *sack up.* \n\nNow that we’ve covered that primary reason, the fact of the matter is that default risk will always be a thing for banks. But QFIN isn’t a bank. *(Actually, they technically do have a banking charter in case they have to become one for due to new regulations, but they aren't currently using it.)* Remember their business model I mentioned earlier? \n\n*Now consider this:* \n\nRemember that 9.9 billion revenue for the trailing twelve months? Of that 9.9 billion, 2.3 billion is interest income. *(600mm interest expense).* Meanwhile, **they’re receiving 8 billion in service revenue**. (source: [https://finance.yahoo.com/quote/QFIN/financials?p=QFIN](https://finance.yahoo.com/quote/QFIN/financials?p=QFIN)) They’re bringing in far more money from loan origination commissions and the SaaS fees for their credit analysis than they’re bringing in from actual interest income. In other words, they aren’t a bank. What’s even more important is that QFIN literally does have the best proprietary software, as evidenced by the default rates of their loans. Compare QFIN’s loans defaults to FINV’s, who shot up *90%* yesterday after their earnings call. Go to slide 17: [https://ir.360shuke.com/static-files/6ffd9815-c5d3-478e-81df-0f4b3eb1ad0f](https://ir.360shuke.com/static-files/6ffd9815-c5d3-478e-81df-0f4b3eb1ad0f) \n\nIf you’re too lazy to click the link, the TL DR is that QFIN’s historical defaults for every tranche is significantly lower. \n\nAnother facet to consider is that even if their interest income does drop significantly, their operating margin is strong and, more importantly, improving. Despite their revenue increasing significantly, “Total operating expenses, excluding provisions were roughly flat Q-on-Q but decreased 33% year-on-year. The year-on-year decline mainly reflects significant improvement in operational efficiency” – CFO Alex “Oh God Please No Not My Face” Xu \n\n**Third Reason for Doubt – uNaUdiTeD fInAnCiALs**\n\nOK so this is the best criticism the bears have. It’s also the most nebulous. \n\nA few things to think about: \n\nThis is a Chinese company with Chinese consumer loans on their balance sheet. The QFIN ticker is an ADR. I’m not an accountant, but AFAIK all of the Chinese fintech companies without a US presence use unaudited financials. I don’t think it’s that weird. \n\nSpeaking of accounting, QFIN has a history of overestimating expected losses. *In other words, they used pessimistic estimates that make their financials look worse than they really are.* Back in 2Q2020, Chinese regulators slapped a cap on the interest rate of internet-sourced loans. Some of QFIN’s loans at the time were above that rate, meaning they were impacted. An unscrupulous CFO would not have marked down the loans in anticipation of a decrease in value due to the new, lower interest they would be receiving*. QFIN did the opposite – they devalued the loans by too much* (mostly because they overestimated the default rate). “...the high take rate for capital-light model in the third quarter, maybe partially contributed to a reversal of the charge in the second quarter.” – Ethan “Prolapse King” Wang, paraphrasing something the CFO took two minutes to explain when asked why the loans were doing better than anticipated after being devalued.\n\n**What risks are there still?**\n\nFirst and foremost, macroeconomic risks. As the Chinese consumer fares, so does QFIN. I view this as a good thing, not a bad one, but it does constitute a risk. Additional regulation from Winnie-The-Pooh represents a risk too, but it looks like, for now, that storm has mostly passed. My take is that the Chinese regulators seemed to have a hard on for fucking up Ant Group – a spinoff of Alibaba. Jack “Actual Vampire” Ma had mouthed off publicly about regulations and so the CCP went after him with even more regulations after disappearing the guy for a month. Ant Group focuses more on microlending, but QFIN’s stock, as another Chinese Fintech company, got dragged down by the bears despite not really being affected. Ant group is finally approved for their IPO, so it looks like Winnie’s red rocket for regulation is rapidly retracting.\n\n**Any big banana showers coming soon?** YES! **Earnings call on 3/15!** QFIN has a history of smashing earnings estimates. If QFIN has even half the success of FINV, who went up 90% on the day of their earnings call, then it’ll be bananas for everyone. Apes taking a rocket ship to banana planet. \n\nIf you still aren’t convinced just look at the fucking fundamentals you god damn baboon. \n\nTLDR: I like the stock. 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 🚀 \n\n*This is obviously not financial advice.*\n\n*Positions: long 15 QFIN 3/19 calls 35 strike, and long 500 shares (cost basis $27.48)*\n\nEDIT: had to remove my source for the conference call quotes since it was SA and blocking posting. If you want the source of the quotes, just google \"QFIN EARNINGS TRANSCRIPT\"",
        "subreddit": "wallstreetbets",
        "title": "QFIN - DD - Big Banana Play - Earnings on 3/15",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m3vyog/qfin_dd_big_banana_play_earnings_on_315/",
        "created": 1615626998.0
    },
    {
        "author": "howtoreadspaghetti",
        "created_utc": 1614797142,
        "id": "lx16xn",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "Pros: it's cheap and they generate tons of cash compared to how expensive it is for them to do what they do. Money transfers aren't a thing of the past and their footprint in emerging markets may be of great benefit to them since cross border transactions make up a material part of their revenues. \n\nCons: Serious earnings games, acquisitions and divestitures allow them to take restructuring charges which obfuscates earnings, management comes from companies that probably have very traditional understandings of money (can't see them pivoting to crypto because of it), revenues have been falling steadily for years.\n\nI'm torn.",
        "subreddit": "investing",
        "title": "Western Union ($WU): Value buy or value trap",
        "url": "https://www.reddit.com/r/investing/comments/lx16xn/western_union_wu_value_buy_or_value_trap/",
        "created": 1614825942.0
    },
    {
        "author": "Natronix31",
        "created_utc": 1614824185,
        "id": "lxaa38",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Hello fellow retards, heres a play for tomorrow, my favorite swing stock $OPEN reports earnings after market close tomorrow. Im bullish af because:\n   \n\\-OPEN received a bunch of capital a quarter ago during the SPAC merger, tomorrow should reflect how did they spend it     \n\n\\-Zillow and Redfin reported good Earnings this quarter which leads me to believe the overall online housing market is bullish    \n\n\\-ARK has more than doubled their position on $OPEN in the last 20 days with ARKF being 2.88% in and ARKW being 2.44% in.  \n\n\nThe Pro's\n\nFundamentally, this company has the potential to disrupt the 1.6T U.S housing market due to a few reasons that Chamath and Cathie Wood have discussed before\n\n1)People are moving away from major cities due to high costs   \n2) 75 Million millennials, a lot who are digitally savvy, entering the housing market   \n3)The federal reserve has told us that they are going to keep interest rates effectively at 0 for a very long time\n\nThe funny candle astrology looks solid too as it's right on support line and bound to bounce off like it did on February 5th.\n\n[FinViz](https://finviz.com/quote.ashx?t=OPEN)\n\nTheir main competition? Zillow. Some people say REDFIN is too technically, but they're the smallest of the 3 market cap wise which leads me to believe they don't have the structure in place to exploit the incoming boom in the housing market. However Zillow is by far the biggest fish on this very large pond, on their Q4 earnings report released AH 02/10 they beat earnings expectations by 41%.HOWEVER I don't think Zillow is going to rule the market on their own, analysts actually expect both companies to triple in the long term according to this [article](https://pub.webull.com/us/news-html/071d6e52807747779fa175c7bbaf50e9.html).\n\nThe Cons:\n\n1)Pre-SPAC it was known as IPOB, founded on 2014 by Eric Wu and other  names involved in the tech industry and their ROE/ROA hasn't been impressive since (their balance sheet needs work).\n\n2) Its highly speculative. Zillow is better known and has twice OPENs market cap\n\n3) They are not expected to become profitable in the short term. While their revenue has been steadily increasing, they have a balance sheet to fortify.\n\nTl:Dr\n\n\\-Tomorrow March 4th earnings report is critical for $OPEN\n\n\\-Chamath and Cathie are invested in\n\n\\-Possibility of disrupting the housing market  \n\n\npositions: x100 shares deep with a cost basis of $30.1/share  \nWill expand my position with LEAPs depending how earnings go.",
        "subreddit": "wallstreetbets",
        "title": "$OPEN DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxaa38/open_dd/",
        "created": 1614852985.0
    },
    {
        "author": "rook785",
        "created_utc": 1615597800,
        "id": "m3vuos",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": " *Join me on this rocket ship named QFIN.*\n\nI have ventured out of my usual territory in my hunt for an exotic rocket ship-shaped banana, and I’ve got good news for all ape-kind: I’ve found one. Here’s my DD (whatever that means). \n\nTicker: **QFIN**, AKA \"360 Digitech\". They are a Chinese Fintech company. Currently trading around $31.50. Market Cap is around 4.8 Billion. Very few people in America have heard of them. PE is less than 10, growth is insane, plenty of cash on the balance sheet, low leverage, etc. From a fundamentals or cashflow analysis, this is a banana mine. \n\n**Here's their business model:**\n\n*First*, they use their online presence to advertise loans to the rapidly-growing Chinese middle class.\n\n*Second*, they use their proprietary risk-assessment tools to analyze the credit-worthiness of the applicants. They also have proprietary identification tools to help prevent fraud and simultaneously speed up the loan process (this is a bigger deal than it sounds like due to the strong desire for convenience in lending) \n\n*Third*, they partner with banks to supply the capital for the loans. \n\n*Fourth,* they service the loans and deal with recovery in case of defaults.\n\nThe business model is important because in order to understand why this is an amazing buy you also need to understand where their revenue comes from. It's not just loan interest as you would expect.\n\n**But first, let’s talk numbers.** 2017 Revenue: *175 million* 2018 Revenue: *3.75 Billion* 2019 Revenue: *6.99 Billion* TTM: *9.19 Billion* (TTM means trailing twelve months)\n\nObviously that’s insane growth. Most apes can’t even count that high. \n\nAnd yet, despite that growth, their P/E ratio is a measly **9.4!** *(P/E is a measure of how high up tree us apes must climb to reach banana, lower number = banana more soon)* **That’s less than half the P/E of the S&amp;P 500** *(P/E: 27.5*), **despite having significantly more growth.** \n\nTo understand why the stock is still so cheap, let’s talk about why dumb apes might *NOT* want to buy it. \n\nFirstly, I assume most of you haven’t bought it yet because you have never heard of it. Do a search for QFIN on reddit – it’s next to impossible to find mention of it here. Furthermore, the trading volume is extremely low…. And most of the ownership is institutional. A few hedge funds, sure, but mostly ETFs, which is exactly what’s caused this great buying opportunity. As most Chinese Fintech stock prices have struggled lately with regulations (with the exception of this week), QFIN is relatively immune from the changes. QFIN has only gone down because most of the ownership is through the sector ETFs, which have been dragging QFIN down with them. Only recently did it buck the trend and move away from its sector's performance, in large part because people are just now starting to notice it.\n\nThis is a misunderstood company with obvious value. The play here isn’t that there’s extra value - the value is obvious to everyone - the play is that the “problems” are being significantly exaggerated and misunderstood… so rather than tell you where the deep value is, I will instead focus on why the doubters are wrong and why QFIN is uniquely placed in its sector. \n\n**First Reason for Doubt – Winnie the Pooh.** The Chinese Fintech industry has recently been slapped with some extra regulations that I had to get my mandarin-speaking wife to translate for me. \n\nOne regulation is that for microlending transactions involving banks and partners, the partners (in this case, QFIN) must contribute at least 25% of the capital. Here’s a breakdown of the rules: [https://www.bloomberg.com/news/articles/2021-02-20/china-imposes-further-caps-on-online-lending-amid-clampdown](https://www.bloomberg.com/news/articles/2021-02-20/china-imposes-further-caps-on-online-lending-amid-clampdown). *The stock tanked 30% when this happened.*\n\n**Why it doesn’t matter:** According to QFIN’s CEO, Wu “Cock Slapper” Haisheng, *“Currently, the outstanding balance of the outstanding loans issued through our micro lending subsidiary, accounts for less than 1% of the total loan balance, and joint lending accounts for around 0.01%. Therefore, based on our personal evaluation, the new rules will have little impact on our loan origination business.”* \n\nAnother new regulation is that online lending can only be done with banks that are established in the same province as the applicant. This is no problem – QFIN has a multitude of partners in each region. There are other new regulations coming down the pipeline (capital requirements, etc) but QFIN is well capitalized and capable of overcoming all the known issues. \n\n**Second Reason for Doubt – Default Risk.** There is concern that the loan default rate will be high, especially if China’s economy crashes, and that this will destroy the value of the company similarly to what happened to US banks with bad mortgages in 2008.\n\n**Why it doesn’t matter:** First of all, *sack up.* \n\nNow that we’ve covered that primary reason, the fact of the matter is that default risk will always be a thing for banks. But QFIN isn’t a bank. *(Actually, they technically do have a banking charter in case they have to become one for due to new regulations, but they aren't currently using it.)* Remember their business model I mentioned earlier? \n\n*Now consider this:* \n\nRemember that 9.9 billion revenue for the trailing twelve months? Of that 9.9 billion, 2.3 billion is interest income. *(600mm interest expense).* Meanwhile, **they’re receiving 8 billion in service revenue**. (source: [https://finance.yahoo.com/quote/QFIN/financials?p=QFIN](https://finance.yahoo.com/quote/QFIN/financials?p=QFIN)) They’re bringing in far more money from loan origination commissions and the SaaS fees for their credit analysis than they’re bringing in from actual interest income. In other words, they aren’t a bank. What’s even more important is that QFIN literally does have the best proprietary software, as evidenced by the default rates of their loans. Compare QFIN’s loans defaults to FINV’s, who shot up *90%* yesterday after their earnings call. Go to slide 17: [https://ir.360shuke.com/static-files/6ffd9815-c5d3-478e-81df-0f4b3eb1ad0f](https://ir.360shuke.com/static-files/6ffd9815-c5d3-478e-81df-0f4b3eb1ad0f) \n\nIf you’re too lazy to click the link, the TL DR is that QFIN’s historical defaults for every tranche is significantly lower. \n\nAnother facet to consider is that even if their interest income does drop significantly, their operating margin is strong and, more importantly, improving. Despite their revenue increasing significantly, “Total operating expenses, excluding provisions were roughly flat Q-on-Q but decreased 33% year-on-year. The year-on-year decline mainly reflects significant improvement in operational efficiency” – CFO Alex “Oh God Please No Not My Face” Xu \n\n**Third Reason for Doubt – uNaUdiTeD fInAnCiALs**\n\nOK so this is the best criticism the bears have. It’s also the most nebulous. \n\nA few things to think about: \n\nThis is a Chinese company with Chinese consumer loans on their balance sheet. The QFIN ticker is an ADR. I’m not an accountant, but AFAIK all of the Chinese fintech companies without a US presence use unaudited financials. I don’t think it’s that weird. \n\nSpeaking of accounting, QFIN has a history of overestimating expected losses. *In other words, they used pessimistic estimates that make their financials look worse than they really are.* Back in 2Q2020, Chinese regulators slapped a cap on the interest rate of internet-sourced loans. Some of QFIN’s loans at the time were above that rate, meaning they were impacted. An unscrupulous CFO would not have marked down the loans in anticipation of a decrease in value due to the new, lower interest they would be receiving*. QFIN did the opposite – they devalued the loans by too much* (mostly because they overestimated the default rate). “...the high take rate for capital-light model in the third quarter, maybe partially contributed to a reversal of the charge in the second quarter.” – Ethan “Prolapse King” Wang, paraphrasing something the CFO took two minutes to explain when asked why the loans were doing better than anticipated after being devalued.\n\n**What risks are there still?**\n\nFirst and foremost, macroeconomic risks. As the Chinese consumer fares, so does QFIN. I view this as a good thing, not a bad one, but it does constitute a risk. Additional regulation from Winnie-The-Pooh represents a risk too, but it looks like, for now, that storm has mostly passed. My take is that the Chinese regulators seemed to have a hard on for fucking up Ant Group – a spinoff of Alibaba. Jack “Actual Vampire” Ma had mouthed off publicly about regulations and so the CCP went after him with even more regulations after disappearing the guy for a month. Ant Group focuses more on microlending, but QFIN’s stock, as another Chinese Fintech company, got dragged down by the bears despite not really being affected. Ant group is finally approved for their IPO, so it looks like Winnie’s red rocket for regulation is rapidly retracting.\n\n**Any big banana showers coming soon?** YES! **Earnings call on 3/15!** QFIN has a history of smashing earnings estimates. If QFIN has even half the success of FINV, who went up 90% on the day of their earnings call, then it’ll be bananas for everyone. Apes taking a rocket ship to banana planet. \n\nIf you still aren’t convinced just look at the fucking fundamentals you god damn baboon. \n\nTLDR: I like the stock.\n\n*This is obviously not financial advice.*\n\n*Positions: long 15 QFIN 3/19 calls 35 strike, and long 500 shares (cost basis $27.48)*\n\nEDIT: had to remove my source for the conference call quotes since it was SA and therefore blocking posting. If you want the source of the quotes, just google \"QFIN EARNINGS TRANSCRIPT\"",
        "subreddit": "stocks",
        "title": "QFIN DD - 360 Digitech, Value play - Earnings on 3/15",
        "url": "https://www.reddit.com/r/stocks/comments/m3vuos/qfin_dd_360_digitech_value_play_earnings_on_315/",
        "created": 1615626600.0
    },
    {
        "author": "canyonridge20",
        "created_utc": 1617163617,
        "id": "mgxrbi",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Wei-Wu He bought over 6 million worth of stock for an average $2.05 today. Smaller cap firm, Casi Pharmaceuticals, market cap is sitting at $231 million, average volume $1.5 million. They're having their earnings call on April 9th so I'm gonna go out on a limb and guess they're going to deliver some favorable news. 6 million is a pretty large purchase for a company that size. U do the maths.\n\nI just came across this so I haven't purchased any yet. Wouldn't be surprised if it took a bit of a run when the market opens in the morning. Haven't done any other DD into what they're selling, but a stock purchase of that size relative to market cap a couple weeks prior to earnings will turn some heads.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "$CASI - CEO buys $6.1m worth of stock at market price",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mgxrbi/casi_ceo_buys_61m_worth_of_stock_at_market_price/",
        "created": 1617192417.0
    },
    {
        "author": "Dinosaur279",
        "created_utc": 1615677975,
        "id": "m4iaqz",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**Summary**\n\n* Triterras is a global trade finance company that is using blockchain technology to bring financing opportunities to parties with who banks do not want to work with due to increased regulations and thus lower margins with traditional systems.\n* Recent price action is due to accusations of fraud in a short report which caused a 50% price drop.\n* My belief is that many of the allegations are not substantive, and the ones I haven't dismissed are highly speculative.\n* Recent events have added support to the companies reliability and future growth and have, in my opinion, resolved the worry of fraud.\n* If this is the case, then a strong price reversal is imminent.\n\n**Company Overview** \n\n[Triterras](https://triterras.com/) is hoping to address the market of small and medium-sized companies who do global trade but who do not work with large enough supplies to qualify for traditional financing with banks. This is largely due to new stricter regulations to protect the parties involved. Such regulations are beneficial in avoiding cases of fraud, but make it less worthwhile for banks to work with companies who don't make enough money to qualify the increased effort and thus lower profit margins on the bank's side.\n\nTriterras is using blockchain technology to more efficiently provide financing whilst still meeting the new regulatory requirements. They're not the only company trying to do this, but they're the one who is furthest ahead. They are also largely focused on bringing traders to the platform, fully aware of the fact that the network effect is both the greatest hurdle and greatest advantage in situations like this.\n\n**What happened?**\n\nA couple of short reports ([A](https://thebearcave.substack.com/p/problems-at-triterras-trit)) ([B](https://phase2partners.egnyte.com/dl/bZMK5uwx27/)) were released with accusations of fraud. The former is relatively speculative, but it has been shared on Reddit before so I included it. Many of the concerns seem far-fetched, especially given the renewed support recently (discussed later). The later report is far more detailed. Many of the accusations are directly discussed in Triterras's [announcement](https://ir.triterras.com/news-events/press-releases/detail/33/triterras-company-statement-in-response-to-short-report) and have in fact already been brought up by the SEC in an earlier [form](https://sec.report/Document/0001213900-20-033318/). Obviously, Triterras didn't provide as much of an answer as I would have liked, but again I think many of the accusations are speculative. A seeking alpha article provided a very thorough look into the situation and much of the comments section furthered the discussion with really valuable perspectives (written by 1035 Capital Management, I cannot link the article per sub rules). I highly recommend reading through all of these resources in full.\n\nAs a result of these reports, the share price fell from the $11-$14 range to the $6-$8 range. I believe a large number of short positions were taken out during this time, see [IBorrowDesk](https://iborrowdesk.com/report/TRIT) and [Fintel](https://fintel.io/ss/us/trit). The current shares shorted is around 8 million shares with a float of around 24 million shares.\n\n**Recent Events**\n\nRecently, Triterras [announced](https://ir.triterras.com/news-events/press-releases/detail/37/triterras-announces-strategic-partnership-with-western) a partnership with Western Union, a massive leader in money transfers and financial services. The description of the partnership provides renewed support in Triterras being a sound company with a hopeful future. \n\nMoreover, Triterras [announced](https://ir.triterras.com/news-events/press-releases/detail/38/triterras-signs-letter-of-intent-to-acquire-invoice-bazaar) the intent to purchase Bazarr, furthering the regional expertise of the company and providing renewed support for future growth.\n\n**Institutional Ownership and Buyback**\n\nHere is where things get a bit more speculative. With the drop in share price, Triterras [announced](https://ir.triterras.com/news-events/press-releases/detail/34/triterras-authorizes-50-million-share-repurchase-program) a $50 million dollar buyback. The verbiage used is \n\n*\"Triterras’ recent share price has created an attractive opportunity for the company to institute a stock repurchase program. The Board of Directors has approved a share repurchase of up to $50 million of the Company’s common stock in open market or privately negotiated transactions, which may or may not be conducted through 10b5-1 plans.\"* \n\nThe key is that the buyback may be done through privately negotiated transactions, remember this.\n\nLooking at the holders on [yahoo finance](https://finance.yahoo.com/quote/TRIT/holders?p=TRIT), we can see that Fidelity owns a large number of shares through both FMR LLC and Fidelity Advisor Growth Opportunity Fund (I'll call them FAGOF, lol). On 02/08 they submitted a [SC 13G form](https://sec.report/Document/0000315066-21-001327/) to the SEC detailing their new positions (this data is not accounted for on yahoo finance yet). We see that FMR LLC's position is essentially unchanged, while FAGOF more than doubled their position, from 2.2 to 5 million shares. A month later, on 03/10, they submitted another [SC 13G/A form](https://sec.report/Document/0000315066-21-001436/) detailing their new position. Now, we see that FMR LLC owns only 56 shares. During that time, the share price was around $7. That brings the value of their position during that time to around $50-$60 million. Now the trading volume during that time was only a couple million a day, and we see a steady decline from mid-February to late-February. So, and here's the speculative part, my belief is that FMR LLC sold a majority of their position to Triterras as part of the $50 million buyback previously mentioned. The remaining shares were slowly liquidated from mid-February to late-February.\n\nBut wait, why would FMR LLC sell all their shares, especially when the price was so low? Well first, so far as I can tell, we don't know what they paid for those shares. It's entirely possible they still made a profit even at this price point. In general, I imagine, Funds like these don't like to participate in stocks that are so crazy volatile and not super reliable. Triterras is a growth company, and the recent news and everything going crazy may have encouraged Fidelity to back out of the craziness. On the other hand, Fidelity's fund focused on growth, FAGOF, which can take the volatility and risk, more than doubled their stake.\n\nLet's assume that 6-8 million shares of FMR LLC's position were sold directly to Triterras through an off-market deal. Triterras already said this was an option, and FMR wouldn't want to trade that many shares on the open market with such a low average volume since it would tank the price. That means the buyback is complete, and the float is now around 16-18 million shares. Further, this means the short float, which was 36%, is now around 45%-50%. Also, right now, the daily volume is low, so the days to cover is around 3, according to the latest [short interest report](https://www.nasdaq.com/market-activity/stocks/trit/short-interest).\n\n**Now What?**\n\nWell, if the accusations are true, then the company will probably go bye-bye, or at least get another drop and take a while to recover or just fizzle away into nothingness. But, if instead, the accusations are false or insignificant, then I expect a good price reversal. The current price is only depressed because of the belief in the accusations. So, with a renewed sense in the companies outlook, and a potential 50% short float, the price could easily go back to its past levels or higher.\n\n**Closing Remarks and My Position**\n\nI would love to hear your thoughts on the matter. I didn't go into many specifics about the short reports, especially the analysis of the actual blockchain transactions in report B. If anyone here is familiar with the data I'd love to hear your opinion.\n\nI currently have a few short, medium, and long-term call contracts and a handful of shares. And of course, this is not financial advice and I am not encouraging you to buy this stock. I'm sharing my findings and am eager for feedback on things to reconsider.",
        "subreddit": "stocks",
        "title": "Triterras $TRIT DD",
        "url": "https://www.reddit.com/r/stocks/comments/m4iaqz/triterras_trit_dd/",
        "created": 1615706775.0
    },
    {
        "author": "tugjobterry",
        "created_utc": 1615378732,
        "id": "m1w8wo",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Martin Shkreli may have been the most hated CEO in America in 2015, but at least he had moderator status on WallStreetBets. Before that fateful year, when he was dragged into the American limelight smirking and giggling for raising the price of Daraprim, an anti-parasitic drug used to treat toxoplasmosis in AIDS patients, from $13.50 a pill to $750 a pill, things had been going pretty well for the Brooklyn-born hedge fund manager. At only 32-years-old, he was worth roughly $70 million, and he was able to buy the sole copy of Wu Tang Clan’s album *Once Upon a Time in Shaolin* for $2 million at an auction earlier that year. Life was pretty great. \n\nMartin wasn’t your typical hedge fund manager. The son of immigrants—both of whom worked as janitors in Brooklyn—he once proclaimed that he was “the most successful Albanian to ever walk the face of this earth.” He had dropped out of high school before his senior year but was able to get enough credits for his diploma through a program that earned him an internship at the Wall Street hedge fund Cramer, Berkowitz, &amp; Co. when he was only 17. \n\nAs an intern at the Jim Cramer founded hedge fund, he didn’t want to just blend in. He wanted to be a star. “I don’t even remember him working for me,” Cramer would later tell Vanity Fair’s Bethany McLean. But Shkreli knew what he saw in the mirror, even if nobody else saw it yet. This was the greatest Albanian to ever walk the face of this earth. A big swinging dick. “Who are the 5 greatest rappers of all time?” he would later ask Twitter in a 2015 tweet. His answer a couple minutes later: “Martin, Martin, Martin, Martin, and Martin.”\n\n&amp;#x200B;\n\n[Who's that handsome man in the mirror?](https://preview.redd.it/gbhsjnlwu6m61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=894a92d423d807153f3a92fafbf3b5874e8e49f9)\n\nAt only 17-years-old, having been a loyal employee at Cramer, Berkowitz, &amp; Co. for several months, he began clamoring for his employer to begin short-selling Regeneron Pharmaceuticals, a biotech company that was testing a weight-loss drug at the time. Somehow, he got them to listen, and when Regeneron stock tumbled, Cramer’s hedge fund made a tidy profit. That’s right, Martin told that handsome face in the mirror, the greatest Albanian to walk this earth.\n\nAfter four years as an associate at Cramer, Berkowitz, &amp; Co., Shkreli felt it was time to move on to greener pastures. He ended up getting a business degree from New York’s Baruch College in 2004, and then worked as a financial analyst at Intrepid Capital Management for a while. But he was tired of just being some financial grunt. He wanted to ball out. So in 2006, he started his own hedge fund and christened it Elea Capital Management. He was about to make bank, bro.\n\nIn 2007, Lehman Brothers sued Elea in New York state court for failing to cover a put option transaction in which Shkreli bet on a broad market decline (did Martin YOLO on 0DTE SPY puts? Perhaps\\*). Stocks rose though, and Shkreli didn’t have the money to pony up. Lehman ended up winning a $2.3 million judgement against Elea and Shkreli, but Lehman collapsed before it could collect on the ruling. Something about its own bad bets on mortgage-backed securities. Shkreli dabbed in his corner office.\n\nThe fund eventually sizzled into insolvency though, so in September of 2009, Martin started MSMB Capital Management with his childhood friend Marek Biestek. The two began aggressively shorting biotech companies and expounding upon these companies’ flaws in trading chat rooms. Shkreli was still in his 20s and he had made the *Forbes 30 Under 30* list.\n\nIn early 2011, MSMB sold short 11 million shares of Orexigen Therapeutics *after* it had already fallen off a cliff, from $9.90 to $2.50 a share. In the ensuing days and weeks, Orexigen rebounded, and suddenly MSMB could not cover their position. MSMB had effectively imploded. Martin sat slumped in his chair, his hoodie drawn up, staring at his screen. Caroline Stewart, who worked for the firm at the time, said that after the failed trade “everything went quiet” in the firm. “The lights were not turned on. People stopped coming into work.” Shkreli informed her that he owed Merrill Lynch—the broker he used in his naked short sale—$10 million. He didn’t tell his investors though that their money had gone up in flames.\n\nIn his dark moments, Shkreli found a way out though: he’d just start another hedge fund, this one called MSMB Healthcare. He was able to convince investors to back him again, and MSMB Healthcare would become a lifeline for the original MSMB fund. With one fund bailing the other out, Shrkeli would rise from the ashes like an autistic phoenix. He was no quitter. He was the greatest Albanian to walk this earth.\n\nWhy stop at a new hedge fund though? Martin understood pharmaceuticals—he used his spare time to create educational chemistry videos which he uploaded to YouTube—so why couldn’t he run his own pharma company? So, at about the same time that the OG MSMB blew up in spectacular fashion, he founded Retrophin. The company would have an emphasis on biotechnology that could be used to create treatments for rare diseases. \n\nAs CEO, Shkreli and his employees created alias Twitter accounts to make gangster rap jokes and encourage the short selling of other biotech stocks. In 2014, he upped the price of a drug called Thiola, which was used to treat the rare disease cystinuria, from $1.50 to $30 a pill (patients had to take 10-15 pills a day).\n\nFor some reason, Retrophin’s board decided in 2014 that Shkreli, while intelligent, was too immature to be CEO of the company he founded. He was ousted as CEO, and a month later he left the fourth firm he founded. What was next? Why, found another pharmaceutical company, of course.\n\nIn February of 2015, he founded Turing Pharmaceuticals which acquired three major drugs from Retrophin: an intranasal version of ketamine used to treat depression, an intranasal version of oxytocin—the hormone and neurotransmitter commonly known as the “love drug” that is involved in childbirth and breast-feeding—and a drug called Vecamyl, which was used to treat hypertension. The business strategy for Turing was simple: obtain licenses on out-of-patent drugs and raise prices as time passed. The markets for out-of-patent drugs are often small, and the pathway to obtaining regulatory approval to manufacture a generic version of a drug is expensive, so Shkreli saw that with closed distribution and essentially no competition, the sky was the limit in terms of pricing.\n\nOnly a couple months after Turing’s inception, they acquired Daraprim, a drug approved by the FDA in 1953, for $55 million. In line with their business strategy, Daraprim’s patent had expired, and no generic version was yet available. So Turing increased the price of Daraprim overnight by a factor of 56, and the world took notice. Or, put bluntly, an angry American mob formed.\n\n&amp;#x200B;\n\n[The face of a criminal mastermind.](https://preview.redd.it/ksjnxz79v6m61.jpg?width=625&amp;format=pjpg&amp;auto=webp&amp;s=476cf43861dbcc0adcd32aa5e8037d4fb408f66d)\n\nIn September of that year, Shkreli still was willing to explain himself. He told Bloomberg Markets that despite the huge increase in price, patient co-pays would actually be lower (insurance companies, for the most part, would be footing the bill, not average Americans), and many patients would get the drug for free thanks to Turing’s expanded drug program. Under the program, half of its drugs sold for one dollar. “If there was a company that was selling an Aston Martin at the price of bicycle,” he told Bloomberg, “and we buy that company and ask to charge Toyota prices, I don’t think that should be a crime.” \n\nBut America was frothing at the mouth. In 2015, with a presidential election looming, candidates Hillary Clinton, Bernie Sanders, and Donald Trump all condemned Shkreli and his actions. The optics of the price hike were certainly not good. A few days after his interview with Bloomberg, Shkreli announced that he planned to lower the price of Daraprim by an unspecified amount, but a couple months later, Turing apparently changed its mind and decided there would be no price cut.\n\nDuring all this turbulence, it was revealed that Shkreli had purchased *Once Upon a Time in Shaolin* for $2 million at an auction that was held months before the price hike of Daraprim. The public was not pleased. In an interview in 2019 with Joe Rogan, RZA revealed he had tried to advise Shkreli to “take this chance to do some philanthropy” and give the album away to the public. But Shkreli refused. “He didn’t mind being a supervillain,” RZA said. After meeting with him, RZA didn’t seem to have the hate in his heart for Shkreli that the rest of the public did. “He was a very smart dude.”\n\nIn December of 2015, Shkreli was arrested by the FBI after a federal indictment was filed for securities fraud unrelated to Daraprim’s price. His charges were related to his time as the Chief Investment Officer of MSMB Capital Management and CEO of Retrophin. At a news conference, U.S. Attorney Robert Capers told reporters that Shkreli used his companies as “a personal piggy bank” and that essentially, he was running a Ponzi scheme. The New York FBI Twitter page made an announcement: “#Breaking no seizure warrant at the arrest of Martin Shkreli today, which means we didn’t seize the Wu-Tang Clan album.” Shkreli told *The Wall Street Journal* that he had been targeted for his price hike of Daraprim and his flamboyant personality.\n\nBecause of his notoriety, it became clear that it would be difficult to find an unbiased jury. In a transcript released by Harper’s Magazine, the following excerpts shed insight into what the public thought of the 32-year-old former hedge fund manager (Benjamin Brafman was the lawyer representing Shkreli, “The Court” being Judge Kiyo Matsumoto):\n\n*The Court: The purpose of jury selection is to ensure fairness and impartiality in this case. If you think that you could not be fair and impartial, it is your duty to tell me. All right. Juror Number 1.*\n\n*Juror No. 1: I’m aware of the defendant and I hate him.*\n\n*Benjamin Brafman: I’m sorry.*\n\n*Juror No. 1: I think he’s a greedy little man.*\n\n*The Court: Jurors are obligated to decide the case based only on the evidence. Do you agree?*\n\n*Juror No. 1: I don’t know if I could. I wouldn’t want me on this jury.*\n\n*The Court: Juror Number 1 is excused.*\n\n*\\*\\*\\**\n\n*The Court: Juror Number 52, how are you?*\n\n*Juror No. 52: When I walked in here today, I looked at him, and in my head, that’s a snake — not knowing who he was. I just walked in and looked right at him and that’s a snake.*\n\n*Brafman: So much for the presumption of innocence.*\n\n*The Court: We will excuse Juror Number 52.*\n\n*\\*\\*\\**\n\n*The Court:  Juror Number 77.*\n\n*Juror No. 77: From everything I’ve seen on the news, everything I’ve read, I believe the defendant is the face of corporate greed in America.*\n\n*Brafman: We would object.*\n\n*Juror No. 77: You’d have to convince me he was innocent rather than guilty.*\n\n*The Court: I will excuse this juror.*\n\n*\\*\\*\\**\n\n*The Court: Juror Number 144, tell us what you have heard.*\n\n*Juror No. 144: I heard through the news of how the defendant changed the price of a pill by up-selling it. I heard he bought an album from the Wu-Tang Clan for a million dollars.*\n\n*The Court: The question is, have you heard anything that would affect your ability to decide this case with an open mind. Can you do that?*\n\n*Juror No. 144: I don’t think I can because he kind of looks like a dick.*\n\n*The Court: You are Juror Number 144 and we will excuse you. Come forward, Juror Number 155.*\n\n*Juror No. 155: I have read a lot of articles about the case. I think he is as guilty as they come.*\n\n*The Court: Then I will excuse you from this case. Juror Number 10, please come forward.*\n\n*Juror No. 10: The only thing I’d be impartial about is what prison this guy goes to.*\n\n*The Court: Okay. We will excuse you. Juror 28, do you need to be heard?*\n\n*Juror No. 28: I don’t like this person at all. I just can’t understand why he would be so stupid as to take an antibiotic which H.I.V. people need and jack it up five thousand percent. I would honestly, like, seriously like to go over there —*\n\n*The Court: Sir, thank you.*\n\n*Juror No. 28: Is he stupid or greedy? I can’t understand.*\n\n*The Court: We will excuse you.*\n\n*\\*\\*\\**\n\n*The Court: Juror Number 59, come on up.*\n\n*Juror No. 59: Your Honor, totally he is guilty and in no way can I let him slide out of anything because —*\n\n*The Court: Okay. Is that your attitude toward anyone charged with a crime who has not been proven guilty?*\n\n*Juror No. 59: It’s my attitude toward his entire demeanor, what he has done to people.*\n\n*The Court: All right. We are going to excuse you, sir.*\n\n*Juror No. 59: And he disrespected the Wu-Tang Clan.*\n\nThe case would get dragged out for over a year, but on August 4, 2017, the trial jury that The Court was finally able to assemble had found Shkreli guilty on two counts of security fraud and one count of conspiracy to commit securities fraud. He was found not guilty of five other counts. It’s worth noting that he was never found guilty of the charges the public deemed him most guilty of—jacking up the price of Daraprim.\n\nShkreli informed the media that he was “delighted” with the outcome and said that his prosecution was a “witch hunt of epic proportions.” A month after the ruling, his bail was revoked after he posted on Facebook offering $5,000 for a strand of Hillary Clinton’s hair. Preceding posts unveiled devious plans to clone Hillary Clinton. The judge didn’t think this was funny though, and he was sent to the Metropolitan Detention Center in Brooklyn to await sentencing.\n\nHe would appeal the conviction, but in 2019 the appeals court unanimously upheld the jury verdict. Shkreli would continue to serve his 7-year sentence and forfeit more than $7.3 million in assets. Judge Kiyo Matsumoto said Shkreli did appear to be “genuinely remorseful”, but that he had “repeatedly minimized” his conduct. In his statement to The Court, Shkreli apparently became misty-eyed as he told The Court that he was “never motivated by money.\"\n\n&amp;#x200B;\n\n[Martin taking the justice system seriously.](https://preview.redd.it/wrs4okznv6m61.jpg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=c34b9068f99927b68481c28ccb86b4f8c05bf877)\n\nWhat did WallStreetBets think of Shkreli and his rise and fall? It’s complicated. While some saw him as a villain, many believed he was misunderstood. While he did raise the price of Daraprim, insurance companies would be picking up most of the tab. Martin did give the drug away for free to those who didn’t have insurance. But it also seemed as though Martin was willing to play the role of the heel. While he at first tried to explain to the public why he didn’t see the price hike as such an egregious act, and then offered to lower the price, he ultimately rescinded his offer and made a joke about his whole trial. Pharmaceutical companies regularly raise the price of drugs, but they often do it slowly over time, in increments that do not raise alarm bells on Main Street. These companies are not much different, they’re just less in-your-face. Raising the drug by over 5,000% overnight was undoubtedly bad optics, but to say it was an attack on the middle-class or those with AIDS seems to be leaving out details of how American healthcare is flawed in myriad ways. Maybe Martin thought he was sticking it to the insurance companies.\n\nFor a time, Martin was a regular poster at WallStreetBets. He popped in somewhat regularly to give his thoughts on pharma stocks and drugs that were in development. When he started serving time in jail—a friend would post on Reddit for him—Martin assured everyone that prison wasn’t “that bad”. It wasn’t like how it was portrayed in TV, he said, but “more of a weird college where no one studies or knows how to read.”\n\nOccasionally, he would slide into other Reddit subs that weren’t WallStreetBets. During the height of his notoriety and the approaching trial, he asked r/iamverybadass in a post, \"U got a problem with me?” \n\nMany on WallStreetBets appreciated Martin for the countless hours he spent creating educational YouTube videos on chemistry and investing (they’re worth a look). Martin was undeniably intelligent, but he was also a troll. His sense of humor, for the most part, was welcome at WallStreetBets even though much of America didn’t feel the same way. Maybe the media had already decided on a narrative for Martin. \n\nUltimately, WallStreetBets couldn’t shelter Martin from the rest of the world. And in February of 2016, he wrote another post titled, “Where did my mod status go?” The body of the post simply read, “Noobs.”\n\n\\#\n\n\\*\\*Probably not\\*\\*\\*\n\n\\*\\*\\*But maybe…\n\nTLDR: All you young bucks and does better brush up on your Shkreli history. If he hears any of you were talking shit in this sub, he's gonna come after you when he gets out of prison.",
        "subreddit": "wallstreetbets",
        "title": "His Name is Martin Shkreli",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1w8wo/his_name_is_martin_shkreli/",
        "created": 1615407532.0
    },
    {
        "author": "kerplunktard",
        "created_utc": 1615496357,
        "id": "m30log",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "$TRIT has a number of positive catalysts yet unbelievably its stock is 38% shorted \n\nTriterras $TRIT Signs Letter of Intent to Acquire Invoice Bazaar\n\nTriterras Inc. a leading fintech company for trade and trade finance, today announced that it has signed a letter of intent to acquire Invoice Bazaar, the transaction is scheduled to close on or around April 30, 2021\n\nNew partnership announced with Western Union $TRIT\n\n[https://ir.triterras.com/news-events/press-releases/detail/37/triterras-announces-strategic-partnership-with-western](https://ir.triterras.com/news-events/press-releases/detail/37/triterras-announces-strategic-partnership-with-western)\n\nTrits trading app Kratos Platform recently became available in the [Apple App Store](https://imgur.com/a/SCD19pM)",
        "subreddit": "pennystocks",
        "title": "$TRIT - positive catalysts",
        "url": "https://www.reddit.com/r/pennystocks/comments/m30log/trit_positive_catalysts/",
        "created": 1615525157.0
    },
    {
        "author": "dect60",
        "created_utc": 1615348952,
        "id": "m1oveh",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SecurityAnalysis",
        "title": "Big Market Delusion: Electric Vehicles (By Rob Arnott, Lillian Wu, Bradford Cornell - Research Affiliates)",
        "url": "https://www.researchaffiliates.com/en_us/publications/articles/826-big-market-delusion-electric-vehicles.html",
        "created": 1615377752.0
    },
    {
        "author": "canyonridge20",
        "created_utc": 1617212042,
        "id": "mhb9hh",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Wei-Wu He bought over 6 million worth of stock for an average $2.05 today. Smaller cap firm, Casi Pharmaceuticals, market cap is sitting at $231 million, average volume $1.5 million. They're having their earnings call on April 9th so I'm gonna go out on a limb and guess they're going to deliver some favorable news. 6 million is a pretty large purchase for a company that size. U do the maths.\n\nI just came across this so I haven't purchased any yet. Wouldn't be surprised if it took a bit of a run. Timing is suspicious. Haven't done any other DD into what they're selling, but a stock purchase of that size relative to market cap a couple weeks prior to earnings will turn some heads.",
        "subreddit": "StockMarket",
        "title": "$CASI - CEO buys $6.1m worth of stock at market price",
        "url": "https://www.reddit.com/r/StockMarket/comments/mhb9hh/casi_ceo_buys_61m_worth_of_stock_at_market_price/",
        "created": 1617240842.0
    },
    {
        "author": "Hat_Bro",
        "created_utc": 1615399343,
        "id": "m240ec",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is a good stock. It has a low cost and easy entry the price atm is right at $8. It has a very low market cap at something like 25milion shares. It also has been heavily shorted despite most analysts saying it was a good buy (let's mess up these firms). Then they just revealed that they are entering a partnership with Western Union which will give be a HUGE boost for them. This gives them a more viable business strategy then something like GME (sorry but, it's true). Then someone just stepped in this morning and bought like 5% of the companies value.  So, someone else knows it is going up. I am going to keep this quick and focus on the bullets listed above. I think it's clear $TRIT is a gold mine.   \n\n\nI say this all in honour of the patron saint of $TRIT PanamajackSafari.",
        "subreddit": "wallstreetbets",
        "title": "Why is no one here talking about $TRIT?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m240ec/why_is_no_one_here_talking_about_trit/",
        "created": 1615428143.0
    },
    {
        "author": "rook785",
        "created_utc": 1615602643,
        "id": "m3x6ip",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "*Join me on this rocket ship named QFIN.*\n\nI have ventured out of my usual territory in my hunt for an exotic rocket ship-shaped banana, and I’ve got good news for all ape-kind: I’ve found one. Here’s my DD (whatever that means). \n\nTicker: **QFIN**, AKA \"360 Digitech\". They are a Chinese Fintech company. Currently trading around $31.50. Market Cap is around 4.8 Billion. Very few people in America have heard of them. PE is less than 10, growth is insane, plenty of cash on the balance sheet, low leverage, etc. From a fundamentals or cashflow analysis, this is a banana mine. \n\n**Here's their business model:**\n\n*First*, they use their online presence to advertise loans to the rapidly-growing Chinese middle class.\n\n*Second*, they use their proprietary risk-assessment tools to analyze the credit-worthiness of the applicants. They also have proprietary identification tools to help prevent fraud and simultaneously speed up the loan process (this is a bigger deal than it sounds like due to the strong desire for convenience in lending) \n\n*Third*, they partner with banks to supply the capital for the loans. \n\n*Fourth,* they service the loans and deal with recovery in case of defaults.\n\nThe business model is important because in order to understand why this is an amazing buy you also need to understand where their revenue comes from. It's not just loan interest as you would expect.\n\n**But first, let’s talk numbers.** 2017 Revenue: *175 million* 2018 Revenue: *3.75 Billion* 2019 Revenue: *6.99 Billion* TTM: *9.19 Billion* (TTM means trailing twelve months)\n\nObviously that’s insane growth. Most apes can’t even count that high. \n\nAnd yet, despite that growth, their P/E ratio is a measly **9.4!** *(P/E is a measure of how high up tree us apes must climb to reach banana, lower number = banana more soon)* **That’s less than half the P/E of the S&amp;P 500** *(P/E: 27.5*), **despite having significantly more growth.** \n\nTo understand why the stock is still so cheap, let’s talk about why dumb apes might *NOT* want to buy it. \n\nFirstly, I assume most of you haven’t bought it yet because you have never heard of it. Do a search for QFIN on reddit – it’s next to impossible to find mention of it here. Furthermore, the trading volume is extremely low…. And most of the ownership is institutional. A few hedge funds, sure, but mostly ETFs, which is exactly what’s caused this great buying opportunity. As most Chinese Fintech stock prices have struggled lately with regulations (with the exception of this week), QFIN is relatively immune from the changes. QFIN has only gone down because most of the ownership is through the sector ETFs, which have been dragging QFIN down with them. Only recently did it buck the trend and move away from its sector's performance, in large part because people are just now starting to notice it.\n\nThis is a misunderstood company with obvious value. The play here isn’t that there’s extra value - the value is obvious to everyone - the play is that the “problems” are being significantly exaggerated and misunderstood… so rather than tell you where the deep value is, I will instead focus on why the doubters are wrong and why QFIN is uniquely placed in its sector. \n\n**First Reason for Doubt – Winnie the Pooh.** The Chinese Fintech industry has recently been slapped with some extra regulations that I had to get my mandarin-speaking wife to translate for me. \n\nOne regulation is that for microlending transactions involving banks and partners, the partners (in this case, QFIN) must contribute at least 25% of the capital. Here’s a breakdown of the rules: [https://www.bloomberg.com/news/articles/2021-02-20/china-imposes-further-caps-on-online-lending-amid-clampdown](https://www.bloomberg.com/news/articles/2021-02-20/china-imposes-further-caps-on-online-lending-amid-clampdown). *The stock tanked 30% when this happened.*\n\n**Why it doesn’t matter:** According to QFIN’s CEO, Wu “Cock Slapper” Haisheng, *“Currently, the outstanding balance of the outstanding loans issued through our micro lending subsidiary, accounts for less than 1% of the total loan balance, and joint lending accounts for around 0.01%. Therefore, based on our personal evaluation, the new rules will have little impact on our loan origination business.”* \n\nAnother new regulation is that online lending can only be done with banks that are established in the same province as the applicant. This is no problem – QFIN has a multitude of partners in each region. There are other new regulations coming down the pipeline (capital requirements, etc) but QFIN is well capitalized and capable of overcoming all the known issues. \n\n**Second Reason for Doubt – Default Risk.** There is concern that the loan default rate will be high, especially if China’s economy crashes, and that this will destroy the value of the company similarly to what happened to US banks with bad mortgages in 2008.\n\n**Why it doesn’t matter:** First of all, *sack up.* \n\nNow that we’ve covered that primary reason, the fact of the matter is that default risk will always be a thing for banks. But QFIN isn’t a bank. *(Actually, they technically do have a banking charter in case they have to become one for due to new regulations, but they aren't currently using it.)* Remember their business model I mentioned earlier? \n\n*Now consider this:* \n\nRemember that 9.9 billion revenue for the trailing twelve months? Of that 9.9 billion, 2.3 billion is interest income. *(600mm interest expense).* Meanwhile, **they’re receiving 8 billion in service revenue**. (source: [https://finance.yahoo.com/quote/QFIN/financials?p=QFIN](https://finance.yahoo.com/quote/QFIN/financials?p=QFIN)) They’re bringing in far more money from loan origination commissions and the SaaS fees for their credit analysis than they’re bringing in from actual interest income. In other words, they aren’t a bank. What’s even more important is that QFIN literally does have the best proprietary software, as evidenced by the default rates of their loans. Compare QFIN’s loans defaults to FINV’s, who shot up *90%* yesterday after their earnings call. Go to slide 17: [https://ir.360shuke.com/static-files/6ffd9815-c5d3-478e-81df-0f4b3eb1ad0f](https://ir.360shuke.com/static-files/6ffd9815-c5d3-478e-81df-0f4b3eb1ad0f) \n\nIf you’re too lazy to click the link, the TL DR is that QFIN’s historical defaults for every tranche is significantly lower. \n\nAnother facet to consider is that even if their interest income does drop significantly, their operating margin is strong and, more importantly, improving. Despite their revenue increasing significantly, “Total operating expenses, excluding provisions were roughly flat Q-on-Q but decreased 33% year-on-year. The year-on-year decline mainly reflects significant improvement in operational efficiency” – CFO Alex “Oh God Please No Not My Face” Xu \n\n**Third Reason for Doubt – uNaUdiTeD fInAnCiALs**\n\nOK so this is the best criticism the bears have. It’s also the most nebulous. \n\nA few things to think about: \n\nThis is a Chinese company with Chinese consumer loans on their balance sheet. The QFIN ticker is an ADR. I’m not an accountant, but AFAIK all of the Chinese fintech companies without a US presence use unaudited financials. I don’t think it’s that weird. \n\nSpeaking of accounting, QFIN has a history of overestimating expected losses. *In other words, they used pessimistic estimates that make their financials look worse than they really are.* Back in 2Q2020, Chinese regulators slapped a cap on the interest rate of internet-sourced loans. Some of QFIN’s loans at the time were above that rate, meaning they were impacted. An unscrupulous CFO would not have marked down the loans in anticipation of a decrease in value due to the new, lower interest they would be receiving*. QFIN did the opposite – they devalued the loans by too much* (mostly because they overestimated the default rate). “...the high take rate for capital-light model in the third quarter, maybe partially contributed to a reversal of the charge in the second quarter.” – Ethan “Prolapse King” Wang, paraphrasing something the CFO took two minutes to explain when asked why the loans were doing better than anticipated after being devalued.\n\n**What risks are there still?**\n\nFirst and foremost, macroeconomic risks. As the Chinese consumer fares, so does QFIN. I view this as a good thing, not a bad one, but it does constitute a risk. \n\nAdditional regulation from Winnie-The-Pooh represents a risk too, but it looks like that storm has mostly passed. My take is that the Chinese regulators had a hard on for fucking up Ant Group – a spinoff of Alibaba.  Jack “Actual Vampire” Ma had mouthed off publicly about regulations and so the CCP went after him with even more regulations - they even \"disappeared\" him for a month. Ant Group focuses more on microlending, but QFIN’s stock got dragged down by the bears anyway despite not really being affected. Ant group is finally approved for their IPO, so it looks like Winnie’s red rocket for regulation is rapidly retracting.\n\n**Is the price already too high?** \n\n**Any big banana showers coming soon?**   \nYES! **Earnings call on 3/15!** QFIN has a history of smashing earnings estimates. If QFIN has even half the success of FINV, who went up 90% on the day of their earnings call, then it’ll be bananas for everyone. Apes taking a rocket ship to banana planet. \n\nIf you still aren’t convinced just look at the fucking fundamentals you god damn baboon. \n\nTLDR: I like the stock.\n\n*This is obviously not financial advice.*\n\n*Positions: long 15 QFIN 3/19 calls 35 strike, and long 500 shares (cost basis $27.48)*\n\nEDIT: had to remove my source for the conference call quotes since it was SA and blocking posting. If you want the source of the quotes, just google \"QFIN EARNINGS TRANSCRIPT\"",
        "subreddit": "StockMarket",
        "title": "QFIN - DD - Big Banana Potential - Earnings on 3/15",
        "url": "https://www.reddit.com/r/StockMarket/comments/m3x6ip/qfin_dd_big_banana_potential_earnings_on_315/",
        "created": 1615631443.0
    }
]