[
    {
        "author": "Engineer_Economist",
        "created_utc": 1634346885,
        "id": "q91ujm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | J B Hunt Transport Services Inc | **JBHT** | 8.74%  \n2. **Health Care** | Organon &amp; Co | **OGN** | 3.72%  \n3. **Information Technology** | FleetCor Technologies, Inc. | **FLT** | 4.31%  \n4. **Communication Services** | Match Group Inc | **MTCH** | 1.92%  \n5. **Consumer Discretionary** | Amazon.com, Inc. | **AMZN** | 3.31%  \n6. **Utilities** | Edison International | **EIX** | 1.33%  \n7. **Financials** | Wells Fargo &amp; Co | **WFC** | 6.70%  \n8. **Materials** | Freeport-McMoRan Inc | **FCX** | 4.01%  \n9.  **Real Estate** | Host Hotels and Resorts Inc | **HST** | 1.82%  \n10. **Consumer Staples** | Walmart Inc | **WMT** | 0.49%  \n11. **Energy** | Halliburton Company | **HAL** | 4.88%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Southwest Airlines Co** | LUV | **-2.23%**  \n2. Health Care | **Moderna Inc** |  MRNA | **-2.31%**  \n3. Information Technology | **Motorola Solutions Inc** | MSI | **-2.15%**  \n4.  Communication Services | **Fox Corp Class A** | FOXA | **-1.98%**  \n5. Consumer Discretionary | **Domino's Pizza, Inc.** | DPZ | **-4.73%**  \n6. Utilities | **Consolidated Edison, Inc.** | ED | **-1.59%**  \n7. Financials | **PNC Financial Services Group Inc** | PNC | **-1.68%**  \n8. Materials | **Westrock Co** | WRK | **-5.58%**  \n9. Real Estate | **UDR, Inc.** | UDR | **-2.05%**  \n10. Consumer Staples | **Walgreens Boots Alliance Inc** | WBA | **-3.64%**  \n11. Energy | **Cabot Oil &amp; Gas Corporation** | CTRA | **-1.98%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 10/15/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q91ujm/sp500_winners_and_losers_10152021/",
        "created": 1634375685.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1635463774,
        "id": "qhzdr4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | A O Smith Corp | **AOS** | 10.50%  \n2. **Health Care** | Merck &amp; Co., Inc. | **MRK** | 6.14%  \n3. **Information Technology** | Teradyne, Inc. | **TER** | 11.33%  \n4. **Communication Services** | CBS Corporation Common Stock | **VIAC** | 3.29%  \n5. **Consumer Discretionary** | Ford Motor Company | **F** | 8.63%  \n6. **Utilities** | NextEra Energy Inc | **NEE** | 1.66%  \n7. **Financials** | T Rowe Price Group Inc | **TROW** | 5.66%  \n8. **Materials** | Albemarle Corporation | **ALB** | 6.24%  \n9.  **Real Estate** | Extra Space Storage, Inc. | **EXR** | 5.32%  \n10. **Consumer Staples** | Hormel Foods Corp | **HRL** | 1.47%  \n11. **Energy** | Schlumberger NV | **SLB** | 2.34%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Northrop Grumman Corporation** | NOC | **-7.60%**  \n2. Health Care | **Teleflex Incorporated** |  TFX | **-5.16%**  \n3. Information Technology | **FleetCor Technologies, Inc.** | FLT | **-3.99%**  \n4.  Communication Services | **Match Group Inc** | MTCH | **-1.51%**  \n5. Consumer Discretionary | **eBay Inc** | EBAY | **-6.76%**  \n6. Utilities | **Pinnacle West Capital Corporation** | PNW | **-1.35%**  \n7. Financials | **Everest Re Group Ltd** | RE | **-4.56%**  \n8. Materials | **Newmont Corporation** | NEM | **-4.55%**  \n9. Real Estate | **Boston Properties, Inc.** | BXP | **-0.99%**  \n10. Consumer Staples | **Altria Group Inc** | MO | **-6.15%**  \n11. Energy | **Hess Corp.** | HES | **-1.26%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 10/28/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qhzdr4/sp500_winners_and_losers_10282021/",
        "created": 1635492574.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1634346908,
        "id": "q91us8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Three ETF's per winner (when available)  \n\n\n**ETF Ticker | % invested in Winner | ETF Full Name**  \n\n\n**Industrials**: ETFs investing in J B Hunt Transport Services Inc  \nFTXR-- 3.89%  First Trust Nasdaq Transportation ETF  \nDFND-- 2.26%  Siren DIVCON Dividend Defender ETF  \nIYT-- 2.14%  iShares US Transportation ETF  \n\n\n**Health Care**: ETFs investing in Organon &amp; Co  \nCSD-- 4.56%  Invesco S&amp;P Spin-Off ETF  \nXPH-- 4.40%  SPDR S&amp;P Pharmaceuticals ETF  \nIHE-- 3.05%  iShares U.S. Pharmaceuticals ETF  \n\n\n**Information Technology**: ETFs investing in FleetCor Technologies, Inc.  \nTPAY-- 4.55%  Ecofin Digital Payments Infrastructure Fund  \nIPAY-- 2.20%  ETFMG Prime Mobile Payments ETF  \n   \n\n\n**Communication Services**: ETFs investing in Match Group Inc  \nPBS-- 5.40%  Invesco Dynamic Media ETF  \nSOCL-- 5.22%  Global X Social Media ETF  \nJHCS-- 3.74%  John Hancock Multifactor Media &amp; Communications ETF  \n\n\n**Consumer Discretionary**: ETFs investing in Amazon.com, Inc.  \nONLN-- 24.52%  ProShares Online Retail ETF  \nVCR-- 23.46%  Vanguard Consumer Discretionary ETF  \nFDIS-- 22.48%  Fidelity MSCI Consumer Discretionary Index ETF  \n\n\n**Utilities**: ETFs investing in Edison International  \nUTES-- 4.04%  Virtus Reaves Utilities ETF  \nJHMU-- 3.85%  John Hancock Multifactor Utilities ETF  \nRYU-- 3.59%  Invesco S&amp;P 500® Equal Weight Utilities ETF  \n\n\n**Financials**: ETFs investing in Wells Fargo &amp; Co  \nKBWB-- 7.52%  Invesco KBW Bank ETF  \nDWLD-- 6.76%  Davis Select Worldwide ETF  \nDUSA-- 6.18%  Davis Select U.S. Equity ETF  \n\n\n**Materials**: ETFs investing in Freeport-McMoRan Inc  \nIYM-- 8.07%  iShares U.S. Basic Materials ETF  \nXLB-- 5.60%  Materials Select Sector SPDR Fund  \nPICK-- 4.87%  iShares MSCI Global Metals &amp; Mining Producers ETF  \n\n\n**Real Estate**: ETFs investing in Host Hotels and Resorts Inc  \nNURE-- 4.17%  Nuveen Short-Term REIT ETF  \nEWRE-- 3.51%  Invesco S&amp;P 500® Equal Weight Real Estate ETF  \n   \n\n\n**Consumer Staples**: ETFs investing in Walmart Inc  \nXLP-- 9.17%  Consumer Staples Select Sector SPDR Fund  \nVDC-- 8.23%  Vanguard Consumer Staples ETF  \nFSTA-- 7.89%  FIDELITY COVINGTON TRUST MSCI CONSUMER STAPLES INDEX ETF  \n\n\n**Energy**: ETFs investing in Halliburton Company  \nOIH-- 12.57%   VanEck Oil Services ETF  \nPXJ-- 8.79%   Invesco Dynamic Oil &amp; Gas Services ETF  \nIEZ-- 4.77%   iShares U.S. Oil Equipment &amp; Services ETF  \n\n\nHappy investing!",
        "subreddit": "StockMarket",
        "title": "ETFs with Investments in SP500 Winners of 10/15/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q91us8/etfs_with_investments_in_sp500_winners_of_10152021/",
        "created": 1634375708.0
    },
    {
        "author": "ImpactExtreme",
        "created_utc": 1633522063,
        "id": "q2j2of",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "**Press Release:**\n\n[https://www.stocktitan.net/news/SNII/rigetti-computing-a-global-leader-in-full-stack-quantum-computing-mg40mty34y2q.html](https://www.stocktitan.net/news/SNII/rigetti-computing-a-global-leader-in-full-stack-quantum-computing-mg40mty34y2q.html)\n\n**Investors Presentation:**\n\n[https://www.rigetti.com/uploads/Rigetti-Investor-Presentation.pdf](https://www.rigetti.com/uploads/Rigetti-Investor-Presentation.pdf)\n\n**Article:**\n\n[https://www.ft.com/content/60055163-276c-4b45-80ff-a52a9a46d749](https://www.ft.com/content/60055163-276c-4b45-80ff-a52a9a46d749)\n\nRigetti Computing, one of the first start-ups to take on the giants of the tech industry in the new field of quantum computing, is planning to go public through a merger with a special purpose acquisition company that values it at about $1.5bn.\n\nThe proposed listing, which is set to raise $457m, is the latest sign of the large amounts of cash being ploughed into a technology that until recently was considered little more than a science experiment.\n\nQuantum computers employ quantum mechanics to accelerate the speed at which they carry out calculations, potentially handling tasks far beyond anything today’s supercomputers can manage.\n\nFounded eight years ago by Chad Rigetti, a physicist who previously worked at IBM, the California-based company has taken longer than it first predicted to reach the cusp of commercialisation.\n\nRigetti said in 2018 that his group would build a computer within a year that employed 128 quantum bits, or qubits — a much larger system than anything then attempted, and an apparent sign that the technology was ready to be scaled up for practical use.\n\nThat claim proved premature, and three months ago the company set a more modest goal of building an 80-qubit system by the end of 2021. Though smaller, Rigetti said the development marked a recent design breakthrough that put his company on a path to much more rapid advances in the coming years.\n\n“We have found a better way to scale,” Rigetti said in an interview with the Financial Times. The latest prediction is based on a modular design that involves linking a number of smaller quantum chips into a single processor, simplifying the job of getting a large number of qubits to work together.\n\nThe company claimed the design gave it an edge over rivals, putting it on a path to build a 1,000 qubit system in 2024 and one based on 4,000 qubits in 2026. Its founder also predicted that it would be able to build a machine ten years from now with more computing power than all of today’s cloud computing systems combined.\n\nHowever, company executives said the decision to go public now reflected a belief that early, more rudimentary versions of the technology would yield commercial benefits much sooner. “We believe we can get to customer value in a couple of years,” said Taryn Naidu, chief operating officer.\n\nRigetti said it planned to go public early next year through a merger with Supernova Partners, a spac, or acquisition vehicle, co-chaired by hedge fund investor Alexander Klabin and Spencer Rascoff, a former chief executive of real estate site Zillow.\n\nThe funding includes a $100m equity investment from investment groups that include T Rowe Price, Bessemer Venture Partners and Franklin Templeton. Other investors include In-Q-Tel, the CIA’s venture capital arm, and Palantir, the data analytics company that has done extensive work for the national security establishment.\n\nWhile Wall Street’s spac boom has opened a route for quantum computing companies to go public, stock market investors have yet to show real appetite for the technology. Shares in IonQ, a rival start-up, closed on Tuesday at $7.73, well below their $10 notional value at the time of the company’s listing last week.",
        "subreddit": "SPACs",
        "title": "$SNII - Rigetti Computing, a Global Leader in Full-Stack Quantum Computing, Announces Plans to Become Publicly Traded via Merger with Supernova Partners Acquisition Company II , valued at $1.5b",
        "url": "https://www.reddit.com/r/SPACs/comments/q2j2of/snii_rigetti_computing_a_global_leader_in/",
        "created": 1633550863.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1633476711,
        "id": "q28db1",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, October 5, 2021**\n\nVolatility in the stock market continues, with the three major indexes, particularly the Nasdaq (QQQ), reversing hard after suffering one of its worst days all year, with Apple (AAPL) and Microsoft (MSFT) leading the charge. Market participants continue to closely monitor developments out of Washington and wait for upcoming economic and earnings data to gauge concerns over supply chain disruptions and inflation. Tech stocks once again came under pressure as the benchmark 10-year Treasury yield continues to rise. The S&amp;P 500 (SPY) closed 1.04% higher, the Nasdaq closed 1.35% higher and the Dow Jones (DIA) closing 0.92% higher. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed, closing just 0.35% higher.\n\nWe’ve seen previous episodes of rising rates, both earlier this year as well as when the Fed first announced intentions to begin tapering quantitative easing in the not too distant future. Each of these episodes caused a hiccup but didn’t derail the broader bull market. According to Edward Jones, yields went from below 1% to 1.75% during the first three months of this year, a period that included pullbacks in the S&amp;P 500 of 3.7% for four days and 4.2% for 12 days. However, during that entire three-month stretch in which rates were rising, the stock market rose more than 7%.  In this current spate, 10-year rates have jumped from 1.30% on September 15 to as high as 1.54% last week, reflecting a renewed concern over inflation pressures and reduced Fed stimulus expectations\n\nStocks are struggling to regain their footing after the September selloff, given that many of the concerns that sparked last month’s drop remain. Congressional lawmakers have yet to come to an agreement on a solution to raise the debt limit to prevent a potential government default sometime mid-October. Failure to do so would be catastrophic for the US economy.  As a reminder, Congress successfully averted a government shutdown last week. The House approved a bill late on Wednesday suspending the debt limit through December 2022. The Senate could vote on it as early as this week Senate Majority Leader Chuck Schumer said, but Republicans are expected to block it again as they have twice before. This is an evolving situation. In my humble opinion, I think the Republicans are playing political games with the debt ceiling and will pass it last minute, similar to the spending bill to avoid the government shutdown.\n\nLooking ahead, the September Jobs Report will be released later this week. Market participants are hoping to see payroll gains accelerate after a shockingly disappointing August report, which shoed just 235,000 new payrolls gains versus more than 700,000 expected. Consensus economists anticipate that 475,000 payrolls returned in September, and that the unemployment rate fell to 5.1% or the lowest since March 2020.\n\n**Highlights**\n\n* According to Facebook (FB), yesterday’s nearly six-hour outage was caused by a mistake during a routine maintenance on how internet data routed through its network. Here is a blog by the company [https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/](https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/)\n* Despite broad weakness in tech in recent weeks, shares of Netflix (NFLX) have been on fire, with the company breaking previous ATH twice in the last five days. Perhaps, could be attributed to the immense popularity of “Squid Game”, which has become the company’s most popular show in less than a month. I watched it, it lives up to the hype.\n* Microsoft (MSFT) unveiled a new version of its flagship operating system today, with the company debuting Windows 11. Here is a WSJ article about the features [https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj\\_RHF](https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj_RHF)\n* Today, Facebook whistleblower Frances Haugen gave testimony before the Senate exposing FB’s business practices and calling for more stringent regulation of the company.\n* The price of ... topped $50k again and up 25% this week\n* Three top US hedge funds, Man Group, Elliot Management, Marshall Wace, and Soros Fund Management, who combined manage roughly $200b in assets, have warned that Chinese businesses have become “uninvestable” amid the anti-monopoly scandal, power shortages and Evergrande situation. I agree and personally divested all my holdings in Chinese stocks months ago, some at a loss. Just my opinion.\n* National Union of Metalworkers of South Africa (NUMSA), South Africa’s largest metalworkers union with over 155,000 members, said it was launching an indefinite strike to press for wage increases. This action could block critical supplies for car manufacturing, threatening to further strain a supply chain already stretched thin.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Chipotle (CMG) target raised by Stephens from $1850 to $2000 at Overweight. Stock currently around $1680\n* Capital One (COF) target raised by Piper Sandler from $177 to $188 at Overweight. Stock currently around $168\n* General Motors (GM) target raised by Wells Fargo from $63 to $64 at Overweight. Stock currently around $54\n* International Business Machines (IBM) target raised by Credit Suisse from $167 to $176 at Outperform. Stock currently around $143\n* NVIDIA (NVDA) target raised by KeyCorp from $245 to $260 at Overweight. Stock currently around $204. My favorite stock :)\n* Texas Instruments (TXN) target raised by KeyCorp from $240 to $250 at Overweight. Stock currently around $240\n\n“More money has been lost trying to anticipate and protect from corrections than actually in them” - Peter Lynch",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, October 5, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/q28db1/here_is_a_market_recap_for_today_tuesday_october/",
        "created": 1633505511.0
    },
    {
        "author": "GreatTraderOnizuka",
        "created_utc": 1634157566,
        "id": "q7k5dg",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "**Disclaimer:**\n\nMade some great trades in the past and made some great bad trades trying to time the market. I've been silent for a while. I'm not a financial advisor and this is not financial advice. Do your own DD and fact check me if you need to.\n\n&amp;#x200B;\n\n**What is FASTLY?**\n\nFastly is a CDN (Content Delivery Network), kind of like Amazon, Google, and Facebook who sells connections to the internet to websites like Shopify, Reddit, Discord etc. \n\n&amp;#x200B;\n\n**WHY FASTLY ISN'T SO POOPY**\n\nJune 8th Outage -  Fastly had a bug and the internet was shut off for a while. During this outage some customers of Fastly were revealed. \n\nKnown client list as of June 8th 2021 -  Reddit, Spotify, Twitch, Stack Overflow, GitHub, gov.uk, Hulu, HBO Max, Quora, PayPal, Vimeo, Shopify, Stripe, and news outlets CNN, The Guardian, The New York Times, BBC and Financial Times.\n\nI don't know about you, but I use Reddit, Spotify, Twitch, Paypal. Seems like pretty big clients, so I think Fastly and the internet will be staying around for a while. This company cannot go tits up.\n\n&amp;#x200B;\n\n**Cybersecurity and the Internet BIZ**\n\nAs of 2021 the Cybersecurity market is $180bn industry. Forecasts say these numbers will only go up over time as the web becomes more connected and security protocols, speed, delivery continues to improve.\n\nBUG - Cyber security ETF, I'm surprised that FSLY is not part of this ETF (yet)\n\nI believe sales will continue to grow. The internet is like the universe 2.0 and continues to expand over time, URLs might not be norm but apps and app connectivity are. Fastly is a CDN for apps too, for the popular app like TikTok.\n\n&amp;#x200B;\n\n**FASTLY TEAM**\n\nOne word - DEDICATED.\n\nYou see people bounce from netflix to facebook to twitter to amazon to google to IBM very often. I see this on linkedin all the time, and the time they spend in the company 2-3 years to get a salary bump and a company under their belt to boast about.\n\nAt Fastly, look up the employees, they are dedicated, 6+years and counting. These employees who connect the internet can move to Amazon, Facebook, and Google, but they choose to stay at Fastly... \n\nThis only means one thing, the employees believe in the company, they like where they are, and they like what they do. Sounds like a recipe for success to me. (7% insider ownership) The founder is no longer the CEO but the CA and they continue to invest and develop ext-gen WAF and RASP to protect web applications, APIs and microservices. \n\n&amp;#x200B;\n\n**SHORTS?! EXPOSED**\n\n2021 is almost over, but the norm for this year was squeeze every short.\n\nFastly has a 16% short interest on a 100m float. Meaning 16m shares shorted.\n\nThe average vol of FSLY is 3.5m and they last time there was a short squeeze that was 10/16/2020 where the volume traded the float.\n\nI went through the options chain to see who owns these short positions that were monthly's at one point that expire THIS WEEK 10/15.\n\n&amp;#x200B;\n\n[15 OCT 21 PUTS](https://preview.redd.it/hv5os40kz9t71.png?width=747&amp;format=png&amp;auto=webp&amp;s=c04042b6ce1df306f31d544c54dee96efc9f09d2)\n\nThe 3300 put options I believe belong to  **Walleye Trading LLC,** based off their 13f filing from Aug 16th. \n\n300 Puts owned by  **Centiva Capital, LP**  based off their 13f filing\n\n600 Puts owned by  **Zweig-DiMenna Associates LLC**  based off their 13f filing\n\n&amp;#x200B;\n\n(**How can I check this?** SEC search their 13-f and open the info tables.)\n\n&amp;#x200B;\n\nIt's obvious that these institutions will want their puts to not expire worthless but what can they do? It's a bull market and FSLY just took off. Sounds like they will be covering the 43, 44, and 45's if the squeeze goes past the big $45 before expiration.\n\nAre hedgefunds friends? Nope, they cannibalize off each other too, that's probably why some whale moved the price this week in hopes to start this ramp.\n\n&amp;#x200B;\n\nThe $43's already got pushed out and the $44 are close. If the $45 are pushed out it's ogre and gamma ramping.\n\n&amp;#x200B;\n\nWhere can a squeeze go? I'm not sure but I know it can trade the float or up to three times the float if there is naked short selling.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**TLDR:**\n\nFSLY If you are reading this you are using them. SHARES FOR LONG HULL, the internet universe expansion is imminent.\n\nFSLY Price movement, shorts found, squeeze or no squeeze? 10/15/2021 remind you later?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPositions:\n\n400 FSLY Shares @ $43.3\n\n100 contracts 50C1022 @ .13 (to back my squeeze thesis.)",
        "subreddit": "wallstreetbets",
        "title": "DD: Content Delivery Network FSLY long and SS thesis",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q7k5dg/dd_content_delivery_network_fsly_long_and_ss/",
        "created": 1634186366.0
    },
    {
        "author": "Itsboomhomie",
        "created_utc": 1634257649,
        "id": "q8chmi",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hey gang!\n\nMajor averages took off after a slew of large companies killed earnings. The Nasdaq-100 ETF (QQQ) led  indexes higher, gaining 1.8% as falling bond yields boosted large-cap tech stocks. With eight members reporting earnings, the S&amp;P 500 Index ETF (SPY) added 1.6%. The benchmark Dow Jones Industrial Average (DIA) climbed 1.5% and the small-cap focused Russell 2000 ETF (IWM) rose 1.3%.\n\nFirst time unemployment claims fell to the lowest level since the pandemic began, as the 239K claims reported was lower than the 315,000 expected. September's producer price index numbers came in lighter than forecast, with demand increasing 0.5%, just below the 0.6% expected. Lower inflation rates could have helped ease bond yields, spurring investors to leave safe havens and return to high growth technology stocks. \n\nI'm four for four (like Wendy's!) on earnings forecasts, and took some nice profits (73%) from iron condors on Citigroup today. Have been correct calling JPMorgan (bearish), Delta Airlines (bearish), Bank of America (bullish), and Citigroup (bearish). Technically Citigroup ended green today, but I'm pricing the wings of my earnings iron condors wider than the straddle's implied move. I'm also *doing my research* on expected earnings for the companies, industry, option pricing, and open interest. If you'd like to know more, feel free to message me. \n\nObligatory: these are not stock recommendations, **this does not constitute financial advice - if you need that kind of advice contact your broker**, I'm just analyzing unusual option data, (so if you don't see your favorite stonk, don't take it personally) please do you own DD, etc. etc. etc.\n\nI pull my data from a premium Market Chameleon account. News I generally get from Finviz, but I also check Google. For economic reports, my go to is ForexFactory. Unusual option activity is defined as options that see at least 1.4x the average option activity by volume.\n\n&amp;#x200B;\n\n|STOCK|PRICE|VOLUME (AVG)|CALLS% - PUTS%|MOST ACTIVE|\n|:-|:-|:-|:-|:-|\n|PROG|2.12|108.1K (22.8K)|82 - 18|Oct 2.5c (27.3K)|\n|EDU|2.38|104.3K (58.6K)|50 - 50|Nov 3.5c (32.8K), Nov 2p (27.5K)|\n|WTRH|1.04|13.3K (3.6K)|80 - 20|Nov 1.5c (2.6K)|\n|WTI|4.10|7.9K (1.9K)|98 - 2|Nov 5c (6.2K)|\n|MIC|3.73|7.7K (683)|57 - 43|Apr 5c (4K)|\n|NGL|2.76|5.8K (1.3K)|98 - 2|Jan22 5c (2.3K)|\n|TGB|2.20|5.1K (1.5K)|97 - 3|Nov 2c (2.5K)|\n|MCF|4.49|4.2K (877)|99 - 1|Oct 4c (1.1K)|\n|AMPE|1.72|3.9K (1.8K)|100 - 0|Oct 1.5c (2.5K)|\n|GNW|4.43|3.7K (1.8K)|98 - 2|Dec 5c (1.4K)|\n|HMY|3.85|3.6K (1.3K)|97 - 3|Jan22 5c (2.7K)|\n|SEEL|2.39|3.2K (1.6K)|98 - 2|Oct 2.5c (2K)|\n|BWEN|3.36|2.7K (380)|90 - 10|Nov 5c (1.1K)|\n|CEI\\*|1.25|40.5K (57.5K)|78 - 22|Oct 1c (4.2K)|\n|FAMI\\*|0.34|N/A|N/A|N/A|\n\n\\*including for ongoing interest/narrative purposes.\n\nNotes:\n\n**PROG +2.45% (+1.44%)** Another wacky day for PROG. After being up in premarket trading PROG slumped out the gate, before shooting to a more than 12% gain. The stock then proceeded to give almost all of it back throughout the day. H.C. Wainwright initiated a \"buy\" rating for the stock with a $4 price target today, yet the price action remained muted on more than 92 million in volume. Open interest as of this morning shows more than 53,000 call options in the money, down from the nearly 62,000 yesterday. ITM open interest has steadily declined this week, putting any sort of OPEX gamma pressure into question. $2 appears to be the battleground and it will be interesting to see if the stock can retain this key level. \n\n**EDU +1.28% (+0.42%)** After opening to a 3% loss, EDU rallied mid-session to post a modest gain. Yesterday the Chinese government laid out a strategy to promote vocational education among its population, offering a lifeline for beaten private education stocks such as EDU. With big trades on either side of the option chain, it's tough to tell if investors were scalping calls on an up day, or prepping for a return to the downside with puts. \n\n**WTRH -18.9% (+0.97%)** A pullback was likely for WTRH, a day after rocketing more than 50% after news broke that Morgan Stanley held a 10% stake in the company. Morgan Stanley reported their earnings today and rose 2.5%, so its possible there could be more upside in the future for WTRH when one of their larger holders is doing well. Ahem, to quote yesterday's report \"With large gains like this, I nearly always expect substantial profit taking the next day, so my bet is that puts will print\". I'm not one to toot my horn a bunch, but BEEP BEEP Y'ALL. To be fair, it was a pretty easy call. \n\n**WTI -5.25% (-1.2%)** WTI fell for the second straight day off no news. \n\n**MIC -0.27% (-0.27%)** I still don't know exactly what this stock is. \n\n**NGL +7.78% (-0.36%)** No reason that I could find for either the price movement or elevated option activity. \n\n**TGB +1.85% (-1.36%)** TGB was up 5% in premarket trading, and managed to swing to the upside after briefly trading in the red. No news. Notable that there are over 32,000 call options in the open interest at the $2 strike for November. \n\n**MCF +0% (+0%)** MCF opened green, fell to a 2% loss, then rallied and fell again for a net zero day. Most of the option activity appears to stem from well over 1,000 calendar spreads at the $4 strike between October and November. \n\n**AMPE +1.8% (+1.18%)**  Was up more than 6% at one point during trading, and was up nearly 5% in after hours trading before pulling back. A lot of the option activity appears to be options being scalped, which can give the appearance of high volume. Considering that nearly all of the activity took place with options that expire tomorrow and that numerous orders were filled by algorithms, the action on this stock today was probably just some quick flips. \n\n**GNW +2.07% (+0%)** No news. A solid amount of the option activity came from a single order for 993 of the December $5 calls, which is slightly bullish *if* they were purchased instead of sold. \n\n**HMY +1.27% (-1.03%)** HMY kind of barcoded in a range today. No news, and the most active option was the same as yesterday. Hmmm. With Producer Price Index numbers coming in better than expected and bond yields falling, this could have been an inflation play closed out from yesterday. \n\n**SEEL -0.42% (+1.7%)** No news. SEEL was up early, then down late. \n\n**BWEN +25.82% (-2.89%)** Curiously no news related to the 25% gain, although BWEN saw 14x its average volume of 400K shares traded. The float is small at just under 18 million, but I'm stumped. \n\n**CEI -10.56% (-2.36%)** The hits keep coming for CEI. According to open interest numbers, over 132,000 call options will expire worthless this month. Once the stock started falling from its relative lofty levels, I imagine MMs were able to unwind their hedges. This continual unwind could be what is responsible for CEI's 46% loss in the last week. That and relative volume falling off, as only 118 million shares were traded today. Shorts are eating good on this one. \n\n**FAMI -3.66% (-1.13%)** Also continuing its fall is FAMI, although not as steep. FAMI is down 7.54% over the last week, as volume has waned. Only 85 million shares were traded today - still roughly 5x the float - but that's less than its 106 million share average. \n\n&amp;#x200B;\n\nGreat day for the bulls, who knows what tomorrow brings. We do get retail sales numbers tomorrow, so we'll have an idea if inflation has pumped the brakes on consumer spending, which I doubt it has. Economists are forecasting a 0.2% decline in retail sales, but a 0.5% increase in core retail sales. The difference between the two is that automobile sales are removed from core retail sales, as they account for 20% of retail sales and could skew the numbers. \n\nEarnings tomorrow aren't the sexiest, with Charles Schwab (SCHW), Rio Tinti (RIO), PNC Financial (PNC), Truist Financial (TFC), and JB Hunt (JBHT) on deck. I'm most interest in JBHT and how they are affected by supply chain bottlenecks. Next week we start to see some of the big boys report, with IBM, Johnson and Johnson (JNJ), Netflix (NFLX), Tesla (TSLA), Verizon (VZ), Intel (INTC) and others on tap. \n\nThe end of October is a murderer's row of mega cap stocks reporting across all sectors. Should be ample opportunity to make money. \n\nOk, I gotta get back to writing option education articles for \\[redacted\\]. Man I wish I could tell y'all who I write for so I don't sound so full of shit. Anyways, this report will most likely be massive tomorrow with monthly OPEX and triple witching. Huzzah!\n\nboom",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Penny Stock Unusual Option Activity 10/14",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/q8chmi/penny_stock_unusual_option_activity_1014/",
        "created": 1634286449.0
    },
    {
        "author": "Dorktastical",
        "created_utc": 1634074774,
        "id": "q6wd40",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Rackspace is currently primed for a 20%+ gap fill and return to 20$ (30% growth) with cheap options due to running under the 50MA for so long.\n\nNotice how the recent two days have held the 20dMA as support, and had whicks above the 50dMA- that nice large gap up back to 17 will create a sick swing range and definitely print you some nice tendies.  With some luck I think getting above the 200MA, back above 20$/Share, is reasonable before the end of the year.\n\nhttps://preview.redd.it/21b3fced83t71.png?width=676&amp;format=png&amp;auto=webp&amp;s=1285bfadaa51a51148ad561a654805c57640d6b9\n\n**What is rackspace?**\n\n\\- They are a very tech-savvy data center with their own provisioning management tools.    Basically, startups need a place to put their servers, and they can put them in rented rack space at rackspace.\n\n**Boring longer version stolen from some older DD someone else wrote:**\n\nRackspace Technologies (RXT), is what we like to call a cloud managed service provider (MSP). They essentially partner with corporations and help them with their migration / shift to the cloud via recurring, multi-year contracts (revenue visibility). In addition to cloud services provided, they also offer a multitude of other services such as privacy and data protection services, building out managed applications, etc. The business recently IPOd after being bought-out by Apollo, so there is a large amount of leverage on the business, but the cash flow of the business is robust and should allow Rackspace to paydown debt and further drive equity value for shareholders. The business currently is trading around $15, off from a peak of the upper-$20s. It traded down due to lumpiness in gross margin as the business is sunsetting certain products and as they win new clients, the margin falls off as the revenues are recognized over multi-year periods. The business is trading at around \\~9x EBITDA, which is well below where other managed-service providers trade in the market. Especially for a business with a TAM of $400B+. Gross Margin should bottom out at around 31%, vs. the historical 32 - 33% (which was the reason for a large sell-off in the stock prior), largely because of the pressures from public cloud transition (multicloud mix transitioning towards public cloud coupled with the decline in the OpenStack Business)\n\nTLDR: Who cares.  There's rumours that Amazon might buy their data centers or something like that.  I haven't bothered to verify those rumours myself but if the above shit doesn't excite you then you're probably the type to get off of unfounded amazon rumours.\n\n**Some quick and dirty highlights for everyone:**\n\n1. Rackspace is uniquely positioned in the market, having built a culture around strong support for its customer base. Only Rackspace now offers customers the ability to deploy workloads and managed applications in multicloud environments more efficiently. Via proprietary technology, tools, and AI, Rackspace can host and manage IT workloads for customers far more efficiently than those customers can themselves, while offering scale advantages in hosted applications.\n2. TAM - total market is growing at 8-10% per year, and should reach over $520B by 2023. Rackspace will participate in cloud adoption and deployments, driving the need for Rackspace's services and will be able to further penetrate the market as it builds its sales and marketing efforts\n3. Bookings momentum growth supports accelerating revenue growth coupled with improving FCF generation and profitability\n4. Partners with all major cloud provides (AWS, Azure, IBM, VMware)\n\nTransactions that show how undervalued the business is:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7u1yowt973t71.png?width=412&amp;format=png&amp;auto=webp&amp;s=2d1adabaae2a40ca837cdabc4d21b13515427c70\n\n[Adoption is just the beginning](https://preview.redd.it/ryr268mb73t71.png?width=492&amp;format=png&amp;auto=webp&amp;s=3f8e1f61ad9eedd6f421f69fbcab68b4c000f1fa)\n\n&amp;#x200B;\n\n[Re-positioned of the business driving strong bookings and less capital intensity](https://preview.redd.it/c3nr4rne73t71.png?width=662&amp;format=png&amp;auto=webp&amp;s=3b23c3e790811cf9f29ba8721d96de002685d809)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy positions: \n\n 600x shares at 15.49  \n 25x Oct15'21 15C @ 1.17  \n \\-3x Oct15'21 20P @ 5.19   \n \\-2x Feb18'22 22.5P @ 9.30  \n \\-4x Jan20'23  17.5P @ 5.65\n\n  (I use deep itm short puts instead of cash to use margin without paying interest- these short puts are all ITM, as in, bad for me as the short since they could get exercised any time, BUT, they have unrealized gains--so, they aren't bags.  I'm holding them to 20$ or so then closing them, and rolling them whenever the expiry approaches until then)",
        "subreddit": "wallstreetbets",
        "title": "$RXT Rackspace going to the moon DeepDive",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q6wd40/rxt_rackspace_going_to_the_moon_deepdive/",
        "created": 1634103574.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1633476806,
        "id": "q28e99",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, October 5, 2021**\n\nVolatility in the stock market continues, with the three major indexes, particularly the Nasdaq (QQQ), reversing hard after suffering one of its worst days all year, with Apple (AAPL) and Microsoft (MSFT) leading the charge. Market participants continue to closely monitor developments out of Washington and wait for upcoming economic and earnings data to gauge concerns over supply chain disruptions and inflation. Tech stocks once again came under pressure as the benchmark 10-year Treasury yield continues to rise. The S&amp;P 500 (SPY) closed 1.04% higher, the Nasdaq closed 1.35% higher and the Dow Jones (DIA) closing 0.92% higher. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed, closing just 0.35% higher. \n\nWe’ve seen previous episodes of rising rates, both earlier this year as well as when the Fed first announced intentions to begin tapering quantitative easing in the not too distant future. Each of these episodes caused a hiccup but didn’t derail the broader bull market. According to Edward Jones, yields went from below 1% to 1.75% during the first three months of this year, a period that included pullbacks in the S&amp;P 500 of 3.7% for four days and 4.2% for 12 days. However, during that entire three-month stretch in which rates were rising, the stock market rose more than 7%.  In this current spate, 10-year rates have jumped from 1.30% on September 15 to as high as 1.54% last week, reflecting a renewed concern over inflation pressures and reduced Fed stimulus expectations\n\nStocks are struggling to regain their footing after the September selloff, given that many of the concerns that sparked last month’s drop remain. Congressional lawmakers have yet to come to an agreement on a solution to raise the debt limit to prevent a potential government default sometime mid-October. Failure to do so would be catastrophic for the US economy.  As a reminder, Congress successfully averted a government shutdown last week. The House approved a bill late on Wednesday suspending the debt limit through December 2022. The Senate could vote on it as early as this week Senate Majority Leader Chuck Schumer said, but Republicans are expected to block it again as they have twice before. This is an evolving situation. In my humble opinion, I think the Republicans are playing political games with the debt ceiling and will pass it last minute, similar to the spending bill to avoid the government shutdown. \n\nLooking ahead, the September Jobs Report will be released later this week. Market participants are hoping to see payroll gains accelerate after a shockingly disappointing August report, which shoed just 235,000 new payrolls gains versus more than 700,000 expected. Consensus economists anticipate that 475,000 payrolls returned in September, and that the unemployment rate fell to 5.1% or the lowest since March 2020.\n\n**Highlights**\n\n* According to Facebook (FB), yesterday’s nearly six-hour outage was caused by a mistake during a routine maintenance on how internet data routed through its network. Here is a blog by the company [https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/](https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/)\n* The price of ... topped $50k again and up 25% this week\n* Despite broad weakness in tech in recent weeks, shares of Netflix (NFLX) have been on fire, with the company breaking previous ATH twice in the last five days. Perhaps, could be attributed to the immense popularity of “Squid Game”, which has become the company’s most popular show in less than a month. I watched it, it lives up to the hype.\n* Microsoft (MSFT) unveiled a new version of its flagship operating system today, with the company debuting Windows 11. Here is a WSJ article about the features [https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj\\_RHF](https://www.wsj.com/articles/microsoft-released-windows-11-but-should-you-upgrade-11633453762?mod=wsj_RHF)\n* Today, Facebook whistleblower Frances Haugen gave testimony before the Senate exposing FB’s business practices and calling for more stringent regulation of the company. \n* Three top US hedge funds, Man Group, Elliot Management, Marshall Wace, and Soros Fund Management, who combined manage roughly $200b in assets, have warned that Chinese businesses have become “uninvestable” amid the anti-monopoly scandal, power shortages and Evergrande situation. I agree and personally divested all my holdings in Chinese stocks months ago, some at a loss. Just my opinion.\n* National Union of Metalworkers of South Africa (NUMSA), South Africa’s largest metalworkers union with over 155,000 members, said it was launching an indefinite strike to press for wage increases. This action could block critical supplies for car manufacturing, threatening to further strain a supply chain already stretched thin. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Chipotle (CMG) target raised by Stephens from $1850 to $200 at Overweight. Stock currently around $168\n* Capital One (COF) target raised by Piper Sandler from $177 to $188 at Overweight. Stock currently around $168\n* General Motors (GM) target raised by Wells Fargo from $63 to $64 at Overweight. Stock currently around $54\n* International Business Machines (IBM) target raised by Credit Suisse from $167 to $176 at Outperform. Stock currently around $143\n* NVIDIA (NVDA) target raised by KeyCorp from $245 to $260 at Overweight. Stock currently around $204. My favorite stock :)\n* Texas Instruments (TXN) target raised by KeyCorp from $240 to $250 at Overweight. Stock currently around $240\n\n“More money has been lost trying to anticipate and protect from corrections than actually in them” - Peter Lynch",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tuesday, Oct 5, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/q28e99/here_is_a_market_recap_for_today_tuesday_oct_5/",
        "created": 1633505606.0
    },
    {
        "author": "Hanako-kun7S",
        "created_utc": 1633191553,
        "id": "pzy8my",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Have you heard about quantum computing?\nI'm telling you guys, this concept is insane. \nThis can, and hopefully will change our world. \nFor the better of course. \n\nSo a SPAC named $DMYI merged with a company named IonQ, this company is the real thing. \n\nI'm talking about investors from:\nGoogle, Microsoft, Samsung, Bosch, Hyundai, Kia, Bill Gates, Michael Dell &amp; more!\n\nThey are also partners with: \nGoogle, Microsoft and Amazon. \nU can find they're technology online on cloud. \n\nCurrently they are LEADING the pack .\n\nNow they are trading at less than $2B valuation!\nLike, tomorrow IBM/Alphabet/Microsoft can come and buy them. It's like pocket money! \n\nThey are down more 11.5% and this is the perfect buying opportunity (even better than pipe investors like Gates or Dell) \n\nLet's get it to $20 next Friday! \n\nQuantum is the future! \n\nhttps://finance.yahoo.com/quote/IONQ",
        "subreddit": "wallstreetbets",
        "title": "$IONQ First Pure Play Quantum Computing IPO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pzy8my/ionq_first_pure_play_quantum_computing_ipo/",
        "created": 1633220353.0
    },
    {
        "author": "samishining",
        "created_utc": 1634021055,
        "id": "q6g3tj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "So my last post here was regarding ORCL Vs IBM, in terms of competitiveness and which one has an advantage. However, after some light DD, I've decided to pass on both\n\nThe question I have now is, with MSFT being in the System Software industry as well, do they have any close/real competition? Given that \"close\" competitors of theirs are the likes of ORCL and such\n\nThanks!",
        "subreddit": "investing_discussion",
        "title": "MSFT a monopoly?",
        "url": "https://www.reddit.com/r/investing_discussion/comments/q6g3tj/msft_a_monopoly/",
        "created": 1634049855.0
    },
    {
        "author": "stackcheesesitds",
        "created_utc": 1634129302,
        "id": "q7af43",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "IBM spinoff Kyndryl, thoughts on valuations",
        "url": "https://www.reddit.com/r/investing/comments/q7af43/ibm_spinoff_kyndryl_thoughts_on_valuations/",
        "created": 1634158102.0
    },
    {
        "author": "babbldev",
        "created_utc": 1634217084,
        "id": "q7zf7e",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I analyzed the sentiment of \\~1,000 finance news articles published this week. Here are the most speculative and reactive tickers expressed in news coverage so far this week *(sources: Benzinga, Yahoo Finance, Seeking Alpha, Motley Fool, Market Watch, 50+ others)*\n\n**MOST SPECULATIVE TICKERS** (discussed with high degree of future-tense language)\n\n1. Intel (**$INTC**)\n2. Advanced Micro Devices (**$AMD**)\n3. Apple (**$AAPL**)\n4. Laboratory Corp. of America (**$LH**)\n5. Twitter (**$TWTR**)\n6. Bitcoin\\* (**$BTC**)\n7. Microsoft (**$MSFT**)\n8. AT&amp;T (**$T**)\n9. Broadcom (**$AVGO**)\n10. Facebook (**$FB**)\n11. Amazon (**$AMZN**)\n\n**MOST REACTIVE TICKERS** (discussed with high degree of past-tense language)\n\n1. MGM Resorts (**$MGM**)\n2. Goldman Sachs (**$GS**)\n3. Southwest Airlines (**$LUV**)\n4. IBM (**$IBM**)\n5. PepsiCo (**$PEP**)\n6. Tesla (**$TSLA**)\n7. Moderna (**$MRNA**)\n8. Nvidia (**$NVDA**)\n9. Airbnb (**$ABNB**)\n10. Qualcomm (**$QCOM**)\n11. Maker\\* (**$MKR**)\n\n*(associated charts below):*\n\nhttps://preview.redd.it/bly9ivgxyet71.png?width=825&amp;format=png&amp;auto=webp&amp;s=d04b64cd1cb6d5b39ea3756a7ee7d2492aa89fad\n\nhttps://preview.redd.it/ebbp7lq60ft71.png?width=834&amp;format=png&amp;auto=webp&amp;s=14ed5593e95b89ff61079bf3f43734b41ab8fe8a",
        "subreddit": "StockMarket",
        "title": "Mid-week most Speculative and Reactive tickers in stock market news coverage (10/10-10/13)",
        "url": "https://www.reddit.com/r/StockMarket/comments/q7zf7e/midweek_most_speculative_and_reactive_tickers_in/",
        "created": 1634245884.0
    },
    {
        "author": "Oldschoolfool22",
        "created_utc": 1633991337,
        "id": "q67jgs",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nUnfortunately, hardly any articles that the author knows of, be they articles on \"professional\" websites or blogs, go into the **technology** **and** **product** **details** as well as **manufacturing costs** **for** **products** **of** the companies about whose shares a buy or sell recommendation is made. Nor on what this means for **future** sales, market and company prospects.\n\nThis is not surprising, many investors are no longer interested in companies and their products at all, only in (minimal) daily profits, especially the short sellers who \"argue\" with \"arguments\" like \"*what* *a* *scam*\", \"*what* *a* *sh.. \"* and the like \"argue\" without ever substantiating this classification. Main thing to create a (negative) mood to get others to sell. Same in the opposite direction. There is daily speculation about takeovers or attempts to bring about a short squeeze based on certain percentages that a stock is sold short.\n\nBoth are wrong in the first place.\n\nHardly any investors still invest in products and companies, many are only \"gamblers\". At the same time, these players put products, companies and jobs at risk. For example, a good product cannot be developed and sold overnight. Nevertheless, these gamblers expect results in days or weeks and months at the most, and if they don't come immediately, this is made out to be a problem. Even though everything within the company is on schedule. Even the development of an iPhone takes a year or more. More and more often you can read, especially with new products or companies, that the company has not made any sales or profits yet. How could it, if the product is still in development?\n\nIf that still doesn't work, the killer argument will eventually be used. Competitor XYZ is already on the market and sells more. Or already has many partners. This was also the argument regarding Apple when Nokia was still the world market leader for mobile phones and smartphones and Apple presented the first iPhone. The outcome is well known. Or with Tesla vis-à-vis the established car manufacturers. Today, a Tesla drives away even a Porsche and Tesla is constantly building new factories. Porsche, on the other hand, is also doing well, but cannot keep up with Tesla's expansion and is technically (e.g. in terms of range) lagging behind.\n\nWhat all of this has in common is that you can't extrapolate from the past to the future. Otherwise, there would never be new market leaders. The future of a company lies in its current and future- oriented products, not in its old ones. There are, of course, exceptions to the rule, such as food manufacturers, like Coca-Cola, or banks, etc. Here, however, it should be about technical products and their manufacturers.\n\n**Summary: Ultimately, only the business outlook determines the future of a company and thus the share price. The business outlook depends on the current and future products.**\n\nThat is why short sales figures etc. are not considered here. Instead,it will be shown **why there is currently only one company in the field of lidar sensors that meets all the requirements of large car manufacturers** such as Volkswagen, Toyota, etc. and where **a short squeeze could be triggered shortly due to their technical superiority**, since this technological superiority cannot be explained away or \"sold short\".\n\n**It should likely cause price reactions when a company is valued at only about 1/3 the market cap of inferior competitors on the stock market, as** **Microvision** **currently is relative to** [**Luminar.**](https://www.luminartech.com/) Both companies in September 2021 at the world's largest motor show IAA in Munich:\n\n📷\n\nSources: private\n\nBecause in the field of lidar for self-driving cars (levels 3-5), the current \"official\" market leader is Luminar. \"Market leader\" mainly because of the market capitalization and the hype around the young company founder and CEO. Luminar has not sold any finished products yet. Last year, Luminar only sold about 100 development systems. I am not aware of numbers for 2021.\n\nThere is no car in the world that could be purchased with a Luminar lidar. This is already due to the fact that the company does not yet have a deliverable product.\n\nHowever, if the market leader has not yet managed to launch and sell a product for **self-driving cars**, it is not surprising that its competitors have not yet been able to generate sales in this area either.\n\nIs lidar necessary?\n\nIt should not be discussed further that Mr. Musk as CEO of the company Tesla [considered ](https://arstechnica.com/cars/2019/08/elon-musk-says-driverless-cars-dont-need-lidar-experts-arent-so-sure/)lidar systems [superfluous.](https://arstechnica.com/cars/2019/08/elon-musk-says-driverless-cars-dont-need-lidar-experts-arent-so-sure/) First of all, this statement is already more than two years old (from mid-2019) and was quite correct at that time. when lidar systems were far too expensive (up to $100,000), far too big so they had to be mounted on car roofs and their resolution was simply too poor compared to cameras. But development continues and today the situation is very different.\n\nFor [his part, ](https://www.pcworld.com/article/532605/worst_tech_predictions.html)an [IBM CEO had ](https://www.pcworld.com/article/532605/worst_tech_predictions.html)also [estimated the worldwide demand for computers at only about five](https://www.pcworld.com/article/532605/worst_tech_predictions.html) [(!) units.](https://www.pcworld.com/article/532605/worst_tech_predictions.html) This shows that even CEOs of global corporations can be wrong.\n\nThe [series of accidents with Tesla cars](https://arstechnica.com/cars/2019/08/elon-musk-says-driverless-cars-dont-need-lidar-experts-arent-so-sure/) show that cameras alone are probably not able to guarantee a safe control of a car.\n\nIn addition, there are **far larger car** **companies** **that** **see lidar** **as** **indispensable.**\n\nMarket for Lidar Systems\n\nSo, it should be undeniable that there is a market for lidar systems. With about 70 million cars produced per year plus trucks\\*\\*,\\*\\* etc., there will soon be an **annual** **demand of** **50-300 million units** (usually several modules are needed per car, just as a Tesla has many cameras; at least one device each for the view to the front and one for the view to the rear), even if you exclude the Tesla cars.\n\nTechnology\n\nAfter the introduction to the topic, we will now look at the technology and **why** **it** **cannot** **be that** a **technologically** **highly superior** **company is** **only valued at a company value of** **only** **1/3** **of** **the** **technically** **far** **inferior** **\"market** **leader\"** and thus a **short** **squeeze** **should only be a matter** **of** **time,** since the true valuation very probably cannot be prevented for a long time.\n\nThis should occur at the latest when the first orders come in or when just enough investors realize that **something** **seems** **to** **be** **fundamentally wrong here**. Depending on what happens first. Both can happen on a daily basis.\n\nUpcoming orders can be considered almost certain due to the superior technology and the much earlier availability of the Microvision models.\n\nCar manufacturers are not interested in TV appearances by CEOs or fairytale up-and-coming stories; they want to build the best cars in their segment and for their target group.\n\nGeneral requirements of car manufacturers for car models\n\nAll car manufacturers in all target groups have the following essential requirements:\n\n* Security\n* Design\n* Vehicle characteristics (such as maximum speed, turning circle, etc.)\n* Price\n\nDepending on the target group of a car model, these are of course weighted differently, so that no order can be given. Only safety should always be at the top of the list for all manufacturers.\n\nOf course, a Mercedes has to look better or different than a pick-up. But it doesn't have to be as maneuverable and its load area can be smaller. However, it is no longer possible to sell ugly pick-ups today. While roof superstructures may not bother pick-ups, they are probably not acceptable for a Mercedes, Volkswagen or Toyota.\n\nIn terms of lidar systems, this means:\n\n* Security:  \n\n   * Highest possible resolution\n   * Refresh rate must be high enough for short response times\n   * non-dazzle\n* Design: as invisible as possible\n* Price: must match the selling price of the vehicle\n\nSystem comparison\n\nSo, let's compare the (only) system from the (previous) market leader Luminar with those from Microvision (four models in total).\n\nFirst of all, it is noticeable that Luminar intends to sell only one model with the product \"Iris\", while Microvision intends to offer three other models in addition to the top model and to cover other market segments with lower or specialized requirements.\n\nLuminar Iris and Microvision Lidar models:\n\n📷\n\nSource: [Luminar](https://www.luminartech.com/products/) and Microvision [Press Kit](https://www.microvision.com/about/press-kit/#brochure)\n\nSecurity: Resolution\n\nThis is quite simple to understand. As is also known for cameras, a camera or a lidar system sees more details and thus smaller objects, the higher the resolution. **If** **the resolution** **is lower** **than that** **of** **the competition,** **a** **lidar** **system** **is** **generally considered to be less** **reliable,** as it may detect a tree, but not a stone on the road. However, both can be dangerous.\n\n**Only the resolutions measured by the companies themselves and officially published shall be considered.**\n\nThe company Luminar has **measured a resolution of** **600,000** **points** **per** **second for** their model \"Hydra\":\n\n&gt;*Measurement* *Rate* *per Pixel* *600,000* *pt/s*\n\n📷\n\nSource: Luminar presentation from 2020\n\nThe future **successor** **model** intended for sale is **to have a** **50%** **increase** **in** **resolution,** **i.e.** **approximately 900,000** **dots** **per** **second**. The 50% increase is due to the fact that the resolution in dots per square degree is to increase from 200 to 300 and the other parameters are to remain essentially unchanged:\n\n📷\n\nSource: Luminar data sheets for the Hydra and Iris models\n\nIn contrast, Microvision **measured a** **resolution of** **over** **10** **million points** **per** **second**. That is **twelve** **times** the **resolution** **that** **Luminar** **offers**. This means that a Microvision Lidar system can also **detect** **twelve times** **more details**.\n\nAccordingly, Microvision also writes on its website of\n\n&gt;*The industry's highest resolution, full velocity, long-range automotive lidar sensor.*\n\nSource: [Microvision](https://www.microvision.com/) October 2021\n\nAs well as from\n\n&gt;*Highest Resolution*  \n*Sensor enables* ***over*** ***10 million*** ***measurement*** ***points/second on*** ***target*** *and* ***can detect*** ***smaller obstacles*** ***from*** ***longer distances***\\*.\\* *Allows* ***progression*** ***from*** ***object*** ***detection to*** ***perception.****\"*\n\nSource: [Microvision](https://www.microvision.com/) October 2021\n\n📷\n\n**These details have been there for months and were not changed after the world's largest auto show, the IAA in Munich in September 2021, where all the big-name rivals were also exhibiting.**\n\n**Nor** **does** **any other** **competitor** **appear** **to** **claim** **the \"highest** **resolution\".** As far as we know, no Microvision competitor has complained to the SEC about misrepresentation, so even the **competition,** **including** **Luminar,** **seems** **to accept** **that** **Microvision Lidar** **has the highest** **resolution** **for** **lidar** **systems** **for** **self-driving cars**.\n\nThe differences in resolution were particularly visible at the IAA in Munich this September. Both Luminar and Microvision filmed the visitors on or in front of their booths. The environmental conditions were therefore almost identical.\n\nLuminar Iris Resolution:\n\n📷\n\nSource: [youtube](https://www.youtube.com/watch?v=Bsrp3QQ-Abg)\n\nIt is clearly visible that Luminar only shows single lines, while Microvision shows closed objects. No wonder with a twelvefold higher resolution.\n\n**This makes the score 1-0 in favor of Microvision over Luminar.**\n\nThis in the already most important category, because as already mentioned, the **resolution** **is** **the** **most** **important** **to** recognize as **many** **details** **as** **possible**, i.e. objects on and beside the road, which could be a danger for the car or others (e.g. small children or animals should not be run over).\n\nSafety: refresh rate\n\nThe frame rate (Hz) is also very important. It indicates how many images a camera or lidar system delivers per second.\n\nFor example, if only one image per second is created, a car at a speed of 100 km/h has already covered a distance of 27.78 meters in that time. This corresponds to the length of about six cars. At a frame rate of 30, on the other hand, the car has covered less than one meter per frame. Thus, at 30 Hz, a passenger car has 30 times more decision-making power and (time) to react to something and can do so 30 times faster.\n\nLuminar and Microvision lidar systems each have up to 30 Hz.\n\nOn closer inspection, however, it is noticeable that Microvision systems always seem to have 30 Hz, Luminar Lidar lies in the range of 1-30 Hz. **This** **suggests** **that** **with higher** **frame** **rates** **at** **Luminar** **Iris** **the resolution decreases** while it remains the same at Microvision, so there are 30 images with the high resolution.\n\n📷\n\nSource: Luminar Iris data sheet and [Microvision](https://www.microvision.com/) October 2021\n\nMicrovision thus seems to be significantly better here as well. However, since the details are not known what exactly 1-30 Hz means for Luminar, this category is not evaluated conclusively.\n\nSafety: non-blinding\n\nEveryone knows it: If you look into the sun without sunglasses, you will be blinded and see less or almost nothing. The same applies to cameras, but also lidar systems. Here, glare protection is necessary. For people, sunglasses. With cameras and especially lidar systems it is technically much more complex.\n\nFor lidar systems there is even not only one sun, but several. **If** **there are** **several cars on a road** **within sight** **of a lidar** **system,** **which also have lidar** **systems,** **these** **lidar** **systems can dazzle each** **other**. This will almost always occur in the future if many cars are equipped with lidar systems.\n\n**In discussions about lidar companies, this problem gets little attention as far as I know.**\n\n**This** **is** **one of** **the main problems** **that** **lidar** **companies** **have to** **solve.** **Without a** **complete** **solution,** **a lidar system** **can hardly** **be used in** **a meaningful way,** **since it** **can be blinded and consequently** **temporarily** **be** **completely or** **partially** **blind - while** **the** **car continues** **to drive.**\n\nThis is because **lidar** **systems** **themselves** **emit** **light** **in the form** **of** **laser** **pulses** and wait to see whether it is reflected. If it is reflected, it will eventually return to the lidar system. The distance of the reflected object can then be determined from the duration, since the speed of light is both known and constant.\n\n**Lidar systems thus illuminate the environment in areas of light that are invisible to humans.**\n\nConsequence: **A** **lidar system** **may be dazzled from** **all** **sides,** **as if many laser** **pointers were directed** **at** **the lidar** **system**. So not only the own light comes back, but also foreign light.\n\nA lidar system must therefore ignore all extraneous light and filter out its own on the amount of light. It must not measure extraneous light under any circumstances.\n\n**This is a technically highly complex and difficult problem to solve.**\n\n**As** **far** **as** **the author** **knows,** **only Microvision has** **solved this** **problem completely**.\n\nThe company Luminar has recognized the problem after all and names it also officially, has however according to own representation on the Internet side no complete solution for it. But only a partial solution whereby this is not defined more precisely:\n\n&gt;*limited* *interference*\n\nSources: [Luminar](https://www.luminartech.com/sensory-overload-making-sense-of-lidar/) and [Microvision.](https://twitter.com/MicroVision/status/1438633835395043328)\n\nHowever, Microvision clearly states that the lidar systems **are** **completely** **immune** **to light** **from** **other** **lidar systems** **and the sun** as show below from the [Microvision](https://www.microvision.com/) October 2021.\n\nVideo content from the [youtube video \"Interference Immunity\":](https://www.youtube.com/watch?v=aK3t8zFcl3I) Microvision's description to the video states complete immunity to other lidar systems (\"free\"):\n\n&gt;*MicroVision's* *Interference* *Immunity* *video* *released at* *IAA 2021.* *MicroVision's* *lidar* *sensor* *will* *work* *across* *all* *ambient* *lighting and* *is* ***free of*** ***interference*** ***from*** ***other*** ***lidars***.\n\n📷\n\nSource: [youtube](https://www.youtube.com/watch?v=aK3t8zFcl3I)\n\nAccording to Microvision, it has adopted a solution that Microvision has already developed for the HoloLens 2 from Microsoft and which is also used there. This is probably also patented.\n\n**A** **lidar** **system** **like Luminar's, which is** **only** **partially immune to other lidar systems** **and sunlight,** **is** **simply too dangerous** and can be blinded or even provide false information, endangering lives.\n\nThis point goes clearly to Microvision. **The** **score** **is** **therefore** **2:0**.\n\nOther competitors also don't seem to have solved this hugely important problem yet. Innoviz has only considered sunlight even with InnovizTwo. Also Blickfeld has not solved the problem, but only for sunlight. This seems to apply to all competitors This would make Microvision the only company whose lidar systems are completely immune to light from other lidar systems. For comparison:\n\n📷\n\nSource: [InnovizTwo](https://innoviz.tech/innoviztwo) and Blickfeld [Vision Plus](https://www.blickfeld.com/products/vision-plus/) and [MicroVision](https://www.microvision.com/)\n\nPracticability\n\nThe author still knows the Walkman from Sony. For the younger ones: These were cassette recorders that could play music that was recorded on magnetic tapes. This tape had to be moved and that was done by a belt drive. The belt drive (and not a direct drive) was used to soften vibrations. This technology from the 80s of the last century is used by Luminar as a drive in Luminar Iris as shown in a patent drawing below (top picture is the inside of a Sony Walkman):\n\n📷\n\nSource: [Walkman](https://blog.fh-kaernten.at/ingmarsretro/tag/walkman-en/?lang=en) and Luminar patent drawing.\n\nThe reason is simple: Luminar, like Sony back then, also wants to avoid vibrations being transmitted to the shaft.\n\nHowever, the author doubts that the Luminar Lidar system Iris will survive everyday car use for years without repairs. Belts wear out, become brittle and even the slightest changes in length etc. will render the systems unusable and result in high repair costs for the car owner.\n\nThe other moving parts such as shafts will also wear out. The slightest changes will also render the system unusable, since a laser beam has to be controlled, which requires the highest precision. With Sony Walkman, the music didn't sound as good then. With Luminar, the system will fail immediately. After all,cars have a lifespan of ten to twenty years.\n\nAlmost all of Luminar's competitors do not have this problem. Since they, including Microvision, do not use any moving parts in their systems, at least in the new models. **Microvision has** **chosen the** **right** **architecture** **with** **Solid State,** **which has long** **proven its** **suitability for** **everyday** **use** **in the** **Microsoft** **HoloLens 2** **and** **the further** **development** **IVAS** **for** **the US** **Army,** even under the most difficult conditions that regularly occur in the military.\n\nDesignHowever, a safe car is of no use if no one buys it.\n\nSince design is very important in all areas of life, from smartphones to cars, and is at least one of the deciding factors in a purchase decision, if not the deciding factor, no car manufacturer can afford to install ugly lidar systems, such as those used to be installed on the roof or as attachments in the front, etc.\n\nWhile Microvision plans to install its lidar system where the interior rearview mirror is located, Luminar wants to install the Iris model on the roof in a bulge in the roof.\n\nSuggestions from Luminar for the installation of \"Iris\":\n\n📷\n\nSource: [Luminar](https://www.luminartech.com/products/) and [Luminar Press](https://www.businesswire.com/news/home/20210902005531/en/)\n\nInstallation suggestion from Microvision:\n\n📷\n\nSource: [Microvision youtube video](https://www.youtube.com/watch?v=XwiI1-rSgq0)\n\n**This is where the mechanical-optical internal design of Luminar Iris takes its toll, resulting in a lidar system that is many times larger than Microvision's chip-based lidar system, which has no mechanical parts.**\n\nThe dimensions of Luminar Iris are according to the official Luminar data sheet:\n\nSource: Luminar Iris data sheet\n\n📷\n\nThus, Luminar Iris without holders has a volume of: 27 cm \\* 5,4 cm \\* 10,6 cm = 1\\*\\*.545,48 ccm\\*\\*\n\nThe A-sample from Microvision has a size of approx.\n\n20 cm \\* 11 cm \\* 3,4 cm = 748 ccm\n\n**It should be noted that** **the** **data from** **Luminar** **are** **the final** **dimensions,** **while** **Microvision has** **only** **measured a prototype**, the size of which could be **halved in** the final product to **about 350 ccm**, as Microvision told visitors at the IAA.\n\nThe Microvision Lidar has therefore already as prototype only half the volume and like Luminar Iris and final, optimized product probably less than 1/5 of the size of Luminar Iris.\n\n📷\n\nSource: [reddit](https://old.reddit.com/r/MVIS/comments/ppqpc4/i_found_a_way_to_measure_the_asample/) and [Microvision](https://twitter.com/MicroVision/status/1436488111610073112/photo/)\n\nVery important for car manufacturers to know: While **Luminar** **Iris is** **wide and tall**, the **Microvision** **Lidar** **system** **is** **narrow** **and** **flat**.\n\nOnly this design allows the seamless integration into car designs.\n\nFrom this author's point of view, the **size and shape of** **Microvision's lidar system** is **a knockout** **criterion for** **all car** **manufacturers who don't** **want to** **disfigure their** **car** **design**.\n\nIn addition, self-driving cars **require at** **least** **two** **lidar** **systems**, one for the view to the front and one for the view to the rear. The roof would therefore have to be bulged out at the front and rear to accommodate the Luminar lidar systems.\n\nMicrovision lidar is both very thin and very narrow, while Luminar lidar is relatively thick and very wide. Car designers needed thin and narrow lidar systems.\n\n**This** **point** **also goes** **clearly to Microvision,** **so the** **score** **is** **already 3:0.**\n\nPriceDevelopment costs\n\nBy its nature, **a price of a** **component** **strongly** **depends** **on the number** **of** **pieces**. This is because a price is made up of several components. They are the fixed costs, the cost of materials and manufacturing costs (and service, recycling costs etc.)\n\nThe fixed costs are, for example, the costs of development but also the other general costs that a company has and that are attributable to the product. They become lower per unit the higher the number of units. Development costs of 1 million dollars mean that products sold in quantity 1 must cost at least 1 million dollars. However, if the product is sold in a million units, the price of a unit is only at least $1.\n\nDevelopment costs incurred:\n\n* Luminar: All expenses in the last ten years, as the company has only developed one product so far: **Accumulated deficit: $697,254,000** (Source: [Luminar Q2 2021 Results](https://www.luminartech.com/luminar-reports-q2-2021-results-and-business-update/))\n* Microvision: Operating costs for approximately two years, as development did not begin until early 2020 and company previously developed and sold other products (such as a projector for Sony, Sharp, Ragenthek; interactive projector, consumer lidar, projectors for HoloLens 2). Here, we can assume roughly **$50 million**, as Microvision's operating costs are about $25 million per year (Source: [Q2 2021](https://ir.microvision.com/news-events/ir-calendar/detail/9856/q2-2021-financial-and-operating-results-call)).\n\n**This makes the development costs to be allocated to the final prices about $800 million for Luminar by the start of production in late 2022 and only about $50 million for Microvision.**\n\n**This** **means** **that** **the development** **costs** **for** **Luminar's** **lidar** **systems** **are approximately 16** **times** **those for** **Microvision**. Of course, this has to be taken into account in the pricing.\n\nProduction costs\n\nHowever, the development costs do not yet constitute a product. The material costs in particular must be taken into account here. As a rule of thumb: The more expensive a material is and the more material is needed, the more expensive a product will be. A watch made of gold is more expensive than one made of steel. In the same way, a car is more expensive than a bicycle because it requires much more material (and for other reasons).\n\nBoth the amount of material needed and the manufacturing costs should be much lower for Microvision. While the Luminar Lidar consists of solid aluminum blocks, Microvision probably only needs a plastic housing.\n\nIn addition, Luminar has many mechanical components, whereas Microvision uses a chip-sized MEMS module and does not use any mechanical components and therefore does not have to manufacture any mechanical components:\n\n📷\n\nSources: Luminar patent application and [Microvision](https://ir.microvision.com/news-events/press-releases/detail/333/microvision-announces-completion-of-its-long-range-lidar)\n\nIt is interesting that Luminar never shows the internal structure of Iris. Luminar always shows only empty cases.\n\nMicrovision, on the other hand, can use inexpensive plastic because Microvision does not use moving parts.\n\nThe mechanical components in the Luminar Lidar are not likely to be cheap to produce either, but they are much cheaper than the production of the many mechanical components, as **Luminar** **requires** **many machines** **such as** **lathes** **and milling machines** **for** **this,** **on** **which they** **have to be** **turned and milled to extremely low** **tolerances,** **for** **example**.\n\n📷\n\nSources: Luminar [Q1 Update](https://www.youtube.com/watch?v=K_KGdSMOZdc&amp;feature=emb_logo) and [Q2](https://www.youtube.com/watch?v=rxmSsHsaDKc)\n\nPlease watch these videos, how complex the production of the Luminar Lidar is, while Microvision (see photo above) only has to assemble printed circuit boards, connect them and insert them into a housing. These differences are the reason why Luminar Lidar- System will never be able to produce as cheap as Microvision:\n\n* [The Path to Series Production: Q1 Update - YouTube](https://www.youtube.com/watch?v=K_KGdSMOZdc&amp;feature=emb_logo)\n* [The Path to Series Production: Q2 Update - YouTube](https://www.youtube.com/watch?v=rxmSsHsaDKc&amp;t=118s)\n\nThat's also why it takes Luminar two years just to set up production, while Microvision has developed a completely new system and can produce it in that time. Above is also Luminar's schedule (from [The Path to Series Production: Q1 Update - YouTube](https://www.youtube.com/watch?v=K_KGdSMOZdc&amp;feature=emb_logo)).\n\nCosts increase in manufacturing the lower the tolerances have to be. The lower the tolerances that have to be maintained during production, the more expensive they are. The **costs** **do not** **increase linearly,** **but** **rather** **exponentially**.\n\nIt goes without saying that only very low tolerances can be permitted here for the control of a laser beam, which certainly go to the limits of what is feasible.\n\nThis means that the **manufacturing costs** are certainly **many** **times** **higher** **than those of** **Microvision** due\n\n* to the high-precision machines\n* very precise tools required\n* **Luminar** **lidar** **consists** **of** **many more individual** **parts** **and**\n* significantly higher costs for quality assurance and testing.\n\n**Luminar ends up doing what Microvision does on a chip basis (MEMS), controlling a laser beam, the old-fashioned way via mechanical components like shafts and a belt drive. See patent drawing before.**\n\nThe result is not only a much larger device, much poorer resolution due to the limitations of the Luminar concept (e.g. moving masses, inertia, etc.) but also much higher cost to manufacture simply due to the large number of components.\n\n**Luminar** **thus** **undoubtedly** **needs** **significantly more** **material,** **more machinery** **and more personnel** **to produce a lidar** **system,** since **more** **steps** **are** **required** due to the large number of mechanical parts **and** **a high degree of** **automation does** **not** **seem** **possible**.\n\nThe Microvision Lidar can be assembled on almost any (automated) assembly line for smartphones or computers, since it consists of nothing more than a housing, computer chips and circuit boards, just like any smartphone, notebook or computer.\n\n**It** **can therefore be assumed that** **Luminar** **Iris** **is** **significantly more expensive to** **manufacture than** **Microvision Lidar.**\n\nScalability\n\nSince Microvision apparently does not have **any moving** **mechanical parts** to finish and therefore **does** **not** need any **special machines,** but will be able to use virtually any production line for smartphones or computers, there are not **only the correspondingly** **high** **costs** **for** **their** **own** **factories** **as** **Luminar** **needs** **them** and is also currently creating, but the **scalability and thus** **the** **deliverability is** **significantly** **higher**.\n\nSmartphones are now manufactured in quantities of hundreds of millions per year. Computers in similar orders of magnitude. **Consequently,** **it** **should** **not** **be difficult for Microvision to produce** **almost** **any number** **of** **units** **required if a** **mass** **producer** **such as** **Foxconn** **is** **commissioned**.\n\nDevelopment status\n\nWhile Luminar is still testing the stopping in front of a dummy on a short test section at low speed according to the last published videos, Microvision has already a company specialized in such tests with its own employees to test on a company-owned test track at high speeds. The following presentation of Luminar shows the current progress:\n\n📷\n\nSources: Luminar and [Microvision](https://www.youtube.com/watch?v=TlG222Ybyvg)\n\nCustomers and partners\n\nA distinction must be made between customers (= companies that actually buy larger quantities of the products) and partners (= companies with whom contacts exist, e.g. for development, testing, etc., but who do not buy much or anything).\n\nCustomers\n\nLuminar does not have any known customers who purchase larger quantities for their end products. In fact, Luminar has not published any order intake to date.\n\nFor Microvision, the same is true for its Lidar division. In the other business areas, however, Microvision has already achieved sales in the double-digit million-dollar range, almost exclusively with Tier 1 companies, such as Sony, Sharp, Microsoft:\n\n📷\n\nSource: [Microvision](https://www.microvision.com/) October 2021 and [Microsoft](https://www.microsoft.com/en-us/hololens/buy)\n\nUnlike Luminar, Microvision is recognized as a supplier by market-leading companies and has already demonstrated the ability to deliver products of the required quality in high volume that are e.g. in use by the US Army through the Microsoft IVAS.\n\nPartners\n\nThis refers to companies that have some kind of agreement for something.\n\nLuminar lists many partners who do pay for development systems and services.\n\nMicrovision is run by techies who shun publicity. Luminar, on the other hand, is led by a \"sunny boy\" and startup CEO [Austin Russell](https://nypost.com/2020/12/04/luminar-chief-austin-russell-25-is-billionaire-after-ipo/).\n\nMicrovision has been in contact with Tier 1 automakers for years ([Q2 2021](https://d1io3yog0oux5.cloudfront.net/_1384295b36c7ce41a69ebebc0424ca35/microvision/db/1111/9864/file/MVIS%2BQ2%2B2021%2BAugust%2B4%2C2021%2BWebcast%2BTranscript%281%29.pdf)):\n\n&gt;*Europeans* *OEMs* *and* ***Tier*** ***1s in Germany*** *have* *been the* ***most*** ***active*** ***in*** ***ADAS*** ***space***\\*,\\* *mostly* *because* *of* *regulation,* *ADAS* *held to* *safety* *and* *beyond.* ***As we*** ***have*** ***mentioned before,*** ***we*** ***have*** ***been actively*** ***promoting*** ***our*** ***technology*** ***in Germany*** ***since*** ***2019***\\*.\\*\n\nTier 1 car manufacturers in Germany are (only):\n\n* Volkswagen with the group brands VW, Audi, Porsche, etc.\n* Mercedes\n* BMW\n\n**This** **suggests** **which companies** **Microvision** **might** **be** **negotiating** **with at** **the** **moment**.\n\nConfidence of the CEO in his own company\n\n[The Luminar CEO is currently selling $200 million of his own stock](https://investors.luminartech.com/node/7546/html) \\- before the first product is even sold.\n\n**This** **shows** **the** **CEO's** **dwindling confidence** **in his** **own** **company**.\n\nLeadership\n\nNot to forget the excellent CEO Microvision has, who has done an **extremely** **good** **job** in a very short time (two years) and has the qualifications to lead Microvision to the world market leader in lidar systems and smart glasses. This is where his experience and qualification pays off which the Luminar CEO does not have.\n\n**His** **personal** **commitment** **and enthusiasm for** **success** **should also** **be** **emphasized**. While the Luminar CEO only appeared at the IAA in Munich for photo opportunities, the Microvision CEO was on site every day to meet with customers.\n\nPotential gains in lidar division for Microvision\n\nApproximately 70 million passenger cars are produced worldwide every year. In addition, there are trucks, etc.\n\nAs stated, 2-4 lidar systems are needed for cars, which **would** **correspond to** an **annual** **number** **of** **about** **150-300** **million units**.\n\n**If Microvision could achieve just 10% share, thus selling 15-30 million units per year, that would equate to $750 million to $1.5 billion in annual profits at just $50 earnings per unit.**\n\n**At a very conservative P/E of 10, the market cap would then have to be $7.5 billion to $15 billion. That would equate to a share price of about $50-$100.**\n\nMicrovision is thus undervalued not only relative to Luminar, but also relative to the expected gutters in the next few years. The author also assumes that Microvision will achieve a significantly higher market share than only 10%.\n\n**The current Luminar stock price of about $15 is equivalent to a Microvision stock price of $30, since Luminar has issued almost exactly twice as many shares as Microvision.**\n\nPrecise forecasts (volumen, profit margin) are difficult. However, it can be assumed that - as with airbags - **lidar systems will soon be installed in almost all cars by few suppliers.** The market will likely consolidate quickly - because of Microvision's technical superiority with Microvision at the top.\n\nConclusion\n\nConclusion remains: **Luminar** **has** **no future** **as** **a** **lidar** **manufacturer** **due to** **its** **already** **fundamentally** **outdated and non-performing** **hardware base**. At least not with large car manufacturers. Luminar could only specialize in software.\n\n**Microvision, on the other hand, has the best chance in the market for lidar systems for self-driving cars because of its technically superior hardware base that has been proven in mass-market products such as the Microsoft HoloLens 2.**\n\nMicrovision is also very much at an advantage, as mass production will start as early as this year, while Luminar is not scheduled to start until late 2022.\n\nIn addition, the **excellent,** **efficient** **and highly** **qualified management** **and development** **team** is certainly **superior** **to** **Luminar**. It has developed the Microvision Lidar from scratch to production readiness in only two years, while the Luminar team needs two years longer.\n\n**Therefore, it is only a matter of (probably short time) that Microvision receives the first orders from large automotive companies like Volkswagen, Mercedes, BMW etc. This makes short selling of shares very risky.**\n\n**Orders can come** **in daily.** **Also, at** **some point** **stock** **buyers** **may recognize** **the massive undervaluation of** **Microvision** **stock** **in** **comparison to Luminar** **and at** **the same time initiate a short** **squeeze,** **which could** **lead to** **a price of** **$60 per** Microvision share. **$30 per Microvision share currently corresponds to the market capitalization of Luminar**.\n\nWhat has also gone completely **unnoticed** in the discussion is that **Microvision Lidar** **is** **probably the** **only** **system** **in the world that is fully immune to light** **from** **other** **lidar** **systems**.\n\n**Other manufacturers specify this only for sunlight as discussed before.**\n\n**However, this is one of the most important features for lidar systems to meet. Microvision also proved this as the only company at the IAA by having two lidar systems facing each other.**\n\nMany cars constantly encounter each other at the same time, on roads, in parking lots, etc. When they dazzle each other, accidents are inevitable. That's why Microvision is probably the only company, which shows this in a video. **The others** **just** **can't** **do it as far as known.**\n\n**This** **technological** **breakthrough**\\*\\*,\\*\\* **which has** **so far** **been completely** **disregarded in the** **valuation of** **the stock,** **is** **a** **very big** **competitive advantage** \\- along with the others such as resolution, form factor, etc.\n\nThat's why here is the link to the Microvision video again. **This** **technology** **alone** **could make an** **advantage of** **billions** **of** **dollars** **in profits** **and make Microvision the** **market** **leader**:\n\nVideo: [https://www.youtube.com/watch?v=aK3t8zFcl3I](https://www.youtube.com/watch?v=aK3t8zFcl3I)\n\n📷Other business areas\n\nNot included in this analysis are the other business areas. While Luminar has no other businesses, Microvision is the market leader in AR glasses, at least for projectors (see Microsoft HoloLens 2), and also offers [solutions ](https://www.microvision.com/solutions/other-solutions/)for HUD, interactive projectors, consumer lidar. **The solution for** **smart** **glasses** **can have a similar** **success as** **the one for** **lidar** **systems.**\n\n📷\n\nSource: [Microvision](https://www.microvision.com/solutions/other-solutions/)",
        "subreddit": "wallstreetbets",
        "title": "Microvision: Technical Superiority In Lidar Systems That May Lead To A Short Squeeze",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q67jgs/microvision_technical_superiority_in_lidar/",
        "created": 1634020137.0
    },
    {
        "author": "eminedgdfgfd",
        "created_utc": 1634055122,
        "id": "q6pncc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "(CSE: TSF)\n\nTraceSafe announced today that they have become the first IoT company to partner with the Credence lab data trust rating system pilot program. TraceSafe is a full suite of real-time location management services and contact tracing solutions. \n\n\"As the global economy continues to be digitized at a lightning pace, data is playing an increasingly important competitive role,\" said Jasling Ong, Managing Director of TraceSafe APAC.\n\nThe Credence DTRS system is the world's first open and decentralized end-to-end data trust rating system, first developed in Singapore. It was launched in the last week of September in Singapore by eleven global industry leaders. Representatives from the Alibaba Group, IBM, KPMG, and TÜV SÜD were part of the Credence committee. The Credence DTRS evaluates firms based on the robustness of their data protection and handling measures.\n\nSource: [https://ca.finance.yahoo.com/news/tracesafe-becomes-first-iot-company-120000920.html](https://ca.finance.yahoo.com/news/tracesafe-becomes-first-iot-company-120000920.html)\n\nThis is not financial advice.",
        "subreddit": "investing_discussion",
        "title": "(CSE: TSF) TraceSafe first IoT company to join Credence lab data trust rating system",
        "url": "https://www.reddit.com/r/investing_discussion/comments/q6pncc/cse_tsf_tracesafe_first_iot_company_to_join/",
        "created": 1634083922.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1633493650,
        "id": "q2cv0l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | A O Smith Corp | **AOS** | 4.05%  \n2. **Health Care** | ABIOMED, Inc. | **ABMD** | 5.93%  \n3. **Information Technology** | NVIDIA Corporation | **NVDA** | 3.64%  \n4. **Communication Services** | Netflix Inc | **NFLX** | 5.21%  \n5. **Consumer Discretionary** | CarMax, Inc | **KMX** | 3.01%  \n6. **Utilities** | AES Corp | **AES** | 2.36%  \n7. **Financials** | Invesco Ltd. | **IVZ** | 5.27%  \n8. **Materials** | Celanese Corporation | **CE** | 4.25%  \n9.  **Real Estate** | CBRE Group Inc | **CBRE** | 0.85%  \n10. **Consumer Staples** | Estee Lauder Companies Inc | **EL** | 2.30%  \n11. **Energy** | Marathon Oil Corporation | **MRO** | 3.64%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Leidos Holdings Inc** | LDOS | **-1.47%**  \n2. Health Care | **Merck &amp; Co., Inc.** |  MRK | **-1.78%**  \n3. Information Technology | **IBM Common Stock** | IBM | **-0.67%**  \n4.  Communication Services | **DISH Network Corp** | DISH | **-0.57%**  \n5. Consumer Discretionary | **Penn National Gaming, Inc** | PENN | **-3.54%**  \n6. Utilities | **Pinnacle West Capital Corporation** | PNW | **-1.68%**  \n7. Financials | **Cboe Global Markets Inc** | CBOE | **-2.08%**  \n8. Materials | **International Flavors &amp; Fragrances Inc** | IFF | **-1.83%**  \n9. Real Estate | **Ventas, Inc.** | VTR | **-3.71%**  \n10. Consumer Staples | **Colgate-Palmolive Company** | CL | **-0.85%**  \n11. Energy | **Schlumberger NV** | SLB | **-1.00%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 10/5/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q2cv0l/sp500_winners_and_losers_1052021/",
        "created": 1633522450.0
    },
    {
        "author": "zetret",
        "created_utc": 1633442880,
        "id": "q1x4b5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "IBM Investor Briefing 2021",
        "url": "https://www.ibm.com/investor/events/ibm-investor-briefing-2021",
        "created": 1633471680.0
    }
]