[
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "hatsune_aru",
        "created_utc": 1613066900,
        "id": "lhqmdo",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "TL;DR: ON, TSM, TXN, ADI, MCHP, STM\n\nHi y'all, if you are a nerd like I am, you should be aware that a lot of consumer electronics have been out of stock for months or having supply chain shortages (see: PS5, NVIDIA GPUs, AMD CPUs, phones, etc etc)\n\nThis is mostly attributable to COVID, but one of the sectors hit the hardest is semiconductor manufacturing. It has been dubbed the Chipocalypse: https://www.cnbc.com/2021/02/10/whats-causing-the-chip-shortage-affecting-ps5-cars-and-more.html\n\nNews just hit that Biden is going to do some EOs to alleviate this situation: \nhttps://www.bloomberg.com/news/articles/2021-02-11/biden-team-pledges-aggressive-steps-to-address-chip-shortage\n\nI think semiconductor foundries and chip makers are severely undervalued because of the current crisis, so I'm going in hard. I saw a DD about $ON having low IVs so I went in a few days ago, but I think with this news I'm gonna double down.\n\n$ON 4/16 $45c",
        "subreddit": "wallstreetbets",
        "title": "tendies alert: semiconductor shortage",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lhqmdo/tendies_alert_semiconductor_shortage/",
        "created": 1613095700.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1613229710,
        "id": "lj2f6m",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 15th, 2021.\n\n# **Stimulus prospects could boost the stock market and interest rates in the week ahead - [(Source)](https://www.cnbc.com/2021/02/12/stimulus-prospects-could-boost-the-stock-market-and-interest-rates-in-the-week-ahead.html)**\n*****\n&gt; The prospects of a big government spending program could continue to boost the stock market and put upward pressure on interest rates in the week ahead.\n*****\n&gt; Earnings season is beginning to wind down, but some big names have yet to report.\n*****\n&gt; Walmart’s earnings on Thursday should provide a good window into the consumer, as should the government’s retail sales report for January, also expected Wednesday.\n*****\n&gt; The Federal Reserve on Wednesday afternoon releases minutes from its last meeting, and investors will dig into those for any insight into the central bank’s view on inflation.\n*****\n&gt; # Two dominant themes amid stimulus prospects\n&gt; Inflation and rising interest rates have been two dominant themes for investors recently and have become increasingly so as the market has upgraded its view of how much fiscal coronavirus stimulus could be signed into law.\n*****\n&gt; “The market is waiting to see how big the package is going to be. It’s going to be important. They can get it through reconciliation,” said Quincy Krosby, chief market strategist at Prudential Financial.\n*****\n&gt; Krosby said that Democrats could pass the stimulus under budget reconciliation, which means they could approve it with a simple majority instead of relying on negotiations with Republicans.\n*****\n&gt; Some in the markets had anticipated a package of $1 trillion or less if there was a negotiated deal, but that now looks unlikely. Strategists have changed their view on the proposed $1.9 trillion package.\n*****\n&gt; “There is less pushback to President Biden’s proposed stimulus from moderate Democrats than we expected, so a price tag of around $1.5 trillion seems likely, which is higher than we initially thought,” noted Cornerstone Macro policy analysts.\n*****\n&gt; They say they expect a bill to come to the floor during the week of Feb. 22, and that it could become law by the first week of March. Investors will stay focused on its progress through Congress.\n*****\n&gt; Market pros expect the bigger the spending package, the larger the pop will be in economic growth in the near term. That has helped send Treasury yields, which move opposite price, to higher levels.\n*****\n&gt; It has also increased concerns about inflation.\n*****\n&gt; # Inflation and rising yields\nIn the past week, the 10-year yield — a key benchmark — touched 1.2% for the first time since March. It reached that level briefly early in the week but returned to it in the final hour of trading Friday.\n*****\n&gt; Yields are rising on optimism for an improving economy, but also as inflation expectations also move higher.\n*****\n&gt; “If you think about the big drivers, they’re related - vaccines, stimulus and inflation,” said Michael Schumacher, head of rate strategy at Wells Fargo Securities. “If there’s more talk out of D.C. about moving the stimulus package forward, that sets the stage for yields to go up.”\n*****\n&gt; The market is concerned about the economy running hotter, since it could be a trigger to change Fed policy.\n*****\n&gt; At the same time, the Fed has said it would tolerate inflation above its 2% target.\n*****\n&gt; Krosby of Prudential Financial said the market will also pay attention to the producer price index Wednesday even though it is not typically a big factor.\n*****\n&gt; “Because there’s such a debate on inflationary trends, I know the CPI [consumer price index] came in comfortable, but the producer price index is coming in and we’ll see if that has eased,” she said.\n*****\n&gt; “Obviously supply chains are being reestablished and inventories are building,” said Krosby.\n*****\n&gt; Consumer inflation was running at an annual pace of 1.4% in January.\n*****\n&gt; # Housing statistics\nHousing data is also dominant on the calendar in the holiday-shortened week.\n*****\n&gt; The National Association of Home Builders releases its housing market index data on Wednesday, a measurement of sentiment around market conditions for new home sales.\n*****\n&gt; On Thursday, the government will issue data on pending home sales and building permits. Finally, the National Association of Realtors will release existing home sales data on Friday.\n*****\n&gt; Upcoming hearing on GameStop and short squeezes\nStocks were higher in the past week, with energy, tech and financials as the best performers. The S&amp;P 500 rose 1.2%, ending the week at 3,934.\n*****\n&gt; There were some market hot spots, like cannabis shares which became the latest target of the Reddit trading community. The stocks shot higher Wednesday, adding to already lofty gains in recent weeks before giving up some of those gains.\n*****\n&gt; Investors will also be focused on the Thursday hearing before the House Financial Services Committee on the wild trading recently in GameStop and other heavily-shorted names.\n*****\n&gt; Robinhood’s CEO is expected to testify, as are executives from Melvin Capital Management and Citadel.\n*****\n&gt; The frenzied activity in some small and shorted stocks has raised concerns about the market becoming overheated. But Ari Wald, head of technical analysis at Oppenheimer, said the broader market’s advance is intact.\n*****\n&gt; “Overall, it’s a bull market. I think the steadiness of the advance is underappreciated,” Wald said. He said the market technicals are healthy. Breadth is broad-based and there’s cyclical leadership.\n*****\n&gt; “The low-volatility, high-dividend paying sectors are at risk,” said Wald. Utilities and consumer staples stocks, which both fit that category, were lower on the week.\n*****\n&gt; The market was also awaiting the outcome of the Senate impeachment trial of President Donald Trump, and it is not expected to react.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/L9zmpOB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/cZgpsNC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/BvmjknF.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/wWv2RIG.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/AfQYO3V.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GNiq0fE.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/v4lTpw4.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/83YL2qB.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/03Kxnx1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/0AZF7RF.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/MUQx3xY.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/60KQa22.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/LBj1NDa.png))**\n\n*****\n\n&gt; # Presidents' Day Seasonality\n\n&gt; The US equity market will be closed on Monday in observance of the Presidents' Day holiday. Since 1971 when the Uniform Monday Holiday Act set the third Monday in February, rather than on George Washington's birthday (February 22nd) as the Federal holiday, equity market performance during the week of Presidents' Day has been pretty mixed. From the Friday before President's Day through the Friday after, the S&amp;P 500 has traded higher half the time for an average decline of 5 bps. Taking a closer look, in the chart below we show the median returns by day for each trading day in Presidents' week. Tuesday and Thursday have both averaged declines of 13 bps and 7 bps, respectively. Wednesday averages flat performance but the S&amp;P 500 has only been higher 40% of the time. Despite weakness throughout most of the week, equities have tended to catch a bid by week's end with an average 6 bps gain on Friday with a move higher 58% of the time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021221-Presidents-Day3f.png))**\n\n&gt; In the charts below, we show the average intraday performance of the S&amp;P 500 during Presidents' Day week since 1983 when our intraday data begins. We also include looks for years when the S&amp;P 500 was up and down YTD headed into the holiday. Again, the general pattern has been a steady drift lower until Friday when the S&amp;P 500 has tended to rebound. We would note that the Friday rebound is not an all-day event. As shown, performance is pretty flat in the first several hours of trading with the biggest ramp higher occurring in the final of hours of tradings. That pattern is also consistent for both up and down years, though, in years that the S&amp;P 500 was down YTD headed into the holiday there was a bit of a rebound midweek which was reversed by the end of the week.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021221-Presidents-Day.png))**\n\n*****\n\n&gt; # Trading After Presidents’ Day Weekend Continues to be Weak\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/902779bf6e4c3920c0a6e594303d1963/f9c2be89a4714ce6-96/s500x750/313ae18652b5c66a140a47602ee5649c59baeee7.jpg))**\n\n&gt; In a recent post we looked at the improving trend of market performance ahead of Presidents’ Day weekend. However, the two days after still display a fair amount of red. Since 1990, Tuesday after Presidents’ Day has been strongest for the S&amp;P 500 with 18 gains and 13 losses for median gain of 0.12% but with an average loss of –0.23%. DJIA also has more gains than losses on the Tuesday after, but NASDAQ is a net loser down 18 of 31 years with and average loss of –0.49% and a median loss of –0.11%.\n\n&gt; Wednesday is all red for all three major averages. NASDAQ and S&amp;P 500 have more losses, but DJIA has a larger average loss. On the Wednesday after the Presidents’ Day holiday DJIA is down 16 of 31 with an average loss of –0.07% and a median decline of –0.10%. S&amp;P 500 is down 18 of 31, average –0.02%, median –0.10% and NASDAQ is down 17 of 31, average –0.01%, median –0.09%.\n\n*****\n\n&gt; # Why Bulls Will Like The Year Of The Ox\n\n&gt; “Bulls make money, bears make money, and pigs get slaughtered.” Old Wall Street saying.\n\n&gt; The Chinese New Year (often called the Lunar New Year) will kick off Friday, February 12, and with it will begin the Year of the Ox. Although we would never suggest investing based on the zodiac signs—it is important to note that the Year of the Ox has historically been quite strong for equities. Not to mention we are saying goodbye to the year of the Rat. Good riddance to the Rat, as the last two years of the Rat were 2008 and 2020, not the best years for many reasons!\n\n&gt; Since the Chinese New Year typically starts between late-January and mid-February, we looked at the 12-month return of the S&amp;P 500 Index starting at the end of January dating back to 1950. And wouldn’t you know it? The Year of the Ox has been up more than 13% on average (with a median advance of nearly 18%); suggesting bulls are smiling indeed!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.10.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; “The year of the Ox is the second of the 12 animal signs of the Chinese zodiac, and the Ox is considered a symbol of diligence, persistence, and honesty. Equity returns indeed are quite persistent during the Ox, as it is the third best return out of the 12 Zodiac signs,” explained LPL Chief Market Strategist Ryan Detrick.\n\n&gt; The LPL Chart of the Day shows how all the 12 Zodiac signs have done historically, with the Goat, Tiger, and Ox as the best, while the Rooster and Snake have been the worst.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.10.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; We want to stress that no one should invest purely based on the zodiac signs. This relationship is random and the sample size is small. Still, here’s hoping that the Year of the Ox plays out well for the bulls once again!\n\n*****\n\n&gt; # Short Interest Update\n\n&gt; Yesterday, bi-weekly short interest data was released for the period ending January 30th. In the chart below, we show the Russell 3000 broken up into deciles based on short interest as a percent of the float at the end of 2020 and these decile's stock's median change in short interest from then to yesterday's release. As shown, with the short squeeze episode playing out in the second half of January, the stocks that came into 2020 the most heavily shorted have seen the biggest declines in short interest. That decile of what had been the most heavily shorted names has seen short interest as a percent of float fall for a median of 2.65 percentage points. Deciles two and three have similarly seen sizable declines, though, they are far smaller than those of the most shorted stocks. On the other hand, the decile of the least shorted stocks is the only one that has seen the median short interest reading move higher since the end of 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Deciles-F.png))**\n\n&gt; In the table below, we show the stocks that currently have the highest short interest as a percent of float. After the historic move higher, short squeeze poster child GameStop (GME) is no longer the Russell 3000's most heavily shorted name! Having dropped over 100 percentage points since the start of the year, only 42.61% of shares are now short compared to 43.57% for Gogo (GOGO); currently the most shorted stock in the index. GOGO has actually seen its shorts come off a bit this year as well but that decline has been far more modest of only a little more than one percentage point. Of the other stocks in the index, only Tanger Outlets (SKT) and Dillard's (DDS) also currently have more than 40% of the float sold short.\n\n&gt; On the January 27th closing high, GME was up 1,744.53% year to date. But with the short squeeze unwinding, the stock has fallen over 86%. Others of this cohort have similarly seen big reversals of their earlier surges. For example, National Beverage (FIZZ) had doubled YTD at the time of the GME peak, but since then it has been cut by 33.78%. Not all of these have been losers since the pinnacle of short selling though. Fulgent Genetics, which now has over 30% of shares short, has risen 91.01%. Clovis Oncology (CLVS) and Ligand Pharmaceuticals (LGND) have similarly seen big gains of over 30%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Table-Current-High.png))**\n\n&gt; Given GME came into the year with an absurd number of shares sold short, the squeeze has resulted in it being the biggest decliner in terms of short interest of any Russell 3000 stock. Short interest as a percentage of float has fallen over 100 percentage points YTD. The next biggest drop came from BigCommerce Holdings (BIGC) and Dillard's (DDS) which both saw larger than 50 percentage point drops. Of the rest of the top twenty biggest decliners, a baker's dozen have seen short interest drop by at least 20 points. Additionally, of these stocks that have seen short interest fall the most, only three—nCino (NCNO), Berkeley Lights (BLI), and 3D Systems (DDD)—now have a single-digit short interest as a percent of float.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Table-Decline.png))**\n\n&gt; Given the massive short squeezes, there are far more stocks that now have a lower short interest as a percent of float than at the start of the year. In fact, of the Russell 3000 stocks, 1887 have seen declines in short interest compared to only 1146 that have seen an increase. In the table below, we show the twenty stocks to have seen the biggest increases in SIPF since the start of the year. As shown, there is only one, International Game Technology (IGT), that has seen short interest rise by double digits since the end of 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Table-Increase.png))**\n\n&gt; Retailers notably dominate the list of stocks with the biggest declines in short interest. To quantify this, in the chart below we show the aggregate number of shorted shares as a percent of total float for each industry group as of the most recent short interest data and the end of 2020. As shown, just as it was at the start of the year, retailers remain the most heavily shorted industry group, but it has greatly improved with only 5.86% short compared to 8.15% at the end of 2020. That is the only industry group to have seen short interest drop by a full percentage point or more. The industry group to have experienced the next largest decline was Transportation with aggregate short interest falling from 5.08% to 4.13%. Conversely, there are two industries, Banks and Materials, that have higher short interest as a percent of float than they did at the end of 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Agg-Industry.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending February 12th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=XX2qSnPh7aQ))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.14.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$PLTR** \n&gt; * **$SHOP** \n&gt; * **$CVS** \n&gt; * **$WMT** \n&gt; * **$ROKU** \n&gt; * **$FSLY** \n&gt; * **$FVRR** \n&gt; * **$AAP** \n&gt; * **$TLRY** \n&gt; * **$TWLO** \n&gt; * **$WIX** \n&gt; * **$AMAT** \n&gt; * **$GOLD** \n&gt; * **$TTD** \n&gt; * **$AN** \n&gt; * **$DBX** \n&gt; * **$BIDU** \n&gt; * **$YNDX** \n&gt; * **$WING** \n&gt; * **$LPX** \n&gt; * **$ZTS** \n&gt; * **$TRU** \n&gt; * **$SPWR** \n&gt; * **$ECL** \n&gt; * **$ADI** \n&gt; * **$BIGC** \n&gt; * **$SEDG** \n&gt; * **$EXPD** \n&gt; * **$WM** \n&gt; * **$MRO** \n&gt; * **$RNG** \n&gt; * **$STMP** \n&gt; * **$USFD** \n&gt; * **$TRMN** \n&gt; * **$ET** \n&gt; * **$BKI** \n&gt; * **$OXY** \n&gt; * **$TRTN** \n&gt; * **$VMC** \n&gt; * **$TSEM** \n&gt; * **$SNBR** \n&gt; * **$HLT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/03Kxnx1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/QgDa3h7.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE TUESDAY'S MARKET OPEN!](https://i.imgur.com/JRy8Aaj.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF PRESIDENTS DAY.)\n\n&gt; # ***Monday 2.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF PRESIDENTS DAY.)\n\n*****\n\n&gt; # ***Tuesday  2.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/OmdMNkE.png))\n\n&gt; # ***Tuesday 2.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FXsPS85.png))\n\n*****\n\n&gt; # ***Wednesday 2.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/IsioZnA.png))\n\n&gt; # ***Wednesday 2.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES #1!](https://i.imgur.com/vU0M3ey.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES #2!](https://i.imgur.com/xgXv9Jn.png))\n\n*****\n\n&gt; # ***Thursday 2.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/4qUjiMa.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/7w3xGSt.png))\n\n&gt; # ***Thursday 2.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/bEPH781.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/bCtqUeh.png))\n\n*****\n\n&gt; # ***Friday 2.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tvZTGpp.png))\n\n*****\n\n&gt; # ***Friday 2.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Palantir Technologies Inc. $31.91\n**Palantir Technologies Inc. (PLTR)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 16, 2021. The consensus earnings estimate is $0.02 per share on revenue of $300.40 million and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for revenue of $299.00 million to $301.00 million. The stock has drifted higher by 120.2% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, January 25, 2021 there was some notable buying of 64,703 contracts of the $33.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 18.2% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Shopify Inc. -\n**Shopify Inc. (SHOP)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, February 17, 2021. The consensus earnings estimate is $1.28 per share on revenue of $906.82 million and the Earnings Whisper ® number is $2.03 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 146.15% with revenue increasing by 79.51%. Short interest has decreased by 9.9% since the company's last earnings release while the stock has drifted higher by 38.3% from its open following the earnings release to be 46.6% above its 200 day moving average of $993.16. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, February 11, 2021 there was some notable buying of 1,548 contracts of the $1,120.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.9% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CVS Health $74.21\n**CVS Health (CVS)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, February 16, 2021. The consensus earnings estimate is $1.24 per share on revenue of $68.67 billion and the Earnings Whisper ® number is $1.49 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 28.32% with revenue increasing by 2.66%. Short interest has decreased by 15.1% since the company's last earnings release while the stock has drifted higher by 17.7% from its open following the earnings release to be 12.7% above its 200 day moving average of $65.83. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, February 9, 2021 there was some notable buying of 15,269 contracts of the $80.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walmart Inc. $144.47\n**Walmart Inc. (WMT)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, February 18, 2021. The consensus earnings estimate is $1.50 per share on revenue of $146.42 billion and the Earnings Whisper ® number is $1.59 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.70% with revenue increasing by 3.35%. Short interest has decreased by 0.3% since the company's last earnings release while the stock has drifted lower by 4.0% from its open following the earnings release to be 6.1% above its 200 day moving average of $136.21. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, February 4, 2021 there was some notable buying of 7,076 contracts of the $152.50 call expiring on Friday, February 26, 2021. Option traders are pricing in a 4.3% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Roku Inc $468.67\n**Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, February 18, 2021. The consensus estimate is for a loss of $0.08 per share on revenue of $615.84 million and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.46% with revenue increasing by 49.76%. The stock has drifted higher by 98.6% from its open following the earnings release to be 113.2% above its 200 day moving average of $219.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 10, 2021 there was some notable buying of 2,679 contracts of the $500.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 13.5% move on earnings and the stock has averaged a 11.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Fastly, Inc. $102.06\n**Fastly, Inc. (FSLY)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 17, 2021. The consensus estimate is for a loss of $0.10 per share on revenue of $82.48 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for a loss of $0.12 to $0.08 per share on revenue of $80.00 million to $84.00 million. Consensus estimates are for earnings to decline year-over-year by 0.00% with revenue increasing by 39.95%. Short interest has increased by 140.9% since the company's last earnings release while the stock has drifted higher by 36.9% from its open following the earnings release to be 26.4% above its 200 day moving average of $80.76. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, February 12, 2021 there was some notable buying of 6,313 contracts of the $110.00 call expiring on Friday, February 26, 2021. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 15.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FSLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Fiverr International Ltd. $323.10\n**Fiverr International Ltd. (FVRR)** is confirmed to report earnings at approximately 1:00 AM ET on Thursday, February 18, 2021. The consensus earnings estimate is $0.12 per share on revenue of $53.95 million and the Earnings Whisper ® number is $0.18 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for revenue of $52.40 million to $53.40 million. Consensus estimates are for year-over-year earnings growth of 166.67% with revenue increasing by 82.69%. Short interest has increased by 65.3% since the company's last earnings release while the stock has drifted higher by 115.6% from its open following the earnings release to be 130.6% above its 200 day moving average of $140.10. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, February 8, 2021 there was some notable buying of 1,192 contracts of the $140.00 put expiring on Friday, July 16, 2021. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FVRR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Advance Auto Parts Inc. $152.81\n**Advance Auto Parts Inc. (AAP)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, February 16, 2021. The consensus earnings estimate is $1.93 per share on revenue of $2.35 billion and the Earnings Whisper ® number is $2.12 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 17.68% with revenue increasing by 11.24%. Short interest has increased by 26.1% since the company's last earnings release while the stock has drifted lower by 0.3% from its open following the earnings release to be 2.2% above its 200 day moving average of $149.58. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, February 2, 2021 there was some notable buying of 8,450 contracts of the $160.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.0% move on earnings and the stock has averaged a 3.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Tilray, Inc. $29.00\n**Tilray, Inc. (TLRY)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 17, 2021. The consensus estimate is for a loss of $0.14 per share on revenue of $56.42 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 77.42% with revenue increasing by 20.21%. Short interest has increased by 24.6% since the company's last earnings release while the stock has drifted higher by 211.5% from its open following the earnings release to be 196.6% above its 200 day moving average of $9.78. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 12, 2021 there was some notable buying of 19,496 contracts of the $40.00 call expiring on Friday, February 19, 2021. The stock has averaged a 11.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Twilio, Inc. $435.29\n**Twilio, Inc. (TWLO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 17, 2021. The consensus estimate is for a loss of $0.05 per share on revenue of $454.64 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for a loss of $0.11 to $0.08 per share on revenue of $450.00 million to $455.00 million. Consensus estimates are for year-over-year earnings growth of 37.50% with revenue increasing by 37.26%. Short interest has decreased by 50.6% since the company's last earnings release while the stock has drifted higher by 46.2% from its open following the earnings release to be 59.3% above its 200 day moving average of $273.25. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 14, 2021 there was some notable buying of 1,512 contracts of the $300.00 put expiring on Friday, June 17, 2022. Option traders are pricing in a 9.8% move on earnings and the stock has averaged a 10.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TWLO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning February 15th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lj2f6m/wall_street_week_ahead_for_the_trading_week/",
        "created": 1613258510.0
    },
    {
        "author": "stee4vendetta",
        "created_utc": 1613546616,
        "id": "llor9h",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "With president Biden expected to sign the executive order to give the semiconductor industry a boost, there are several companies set to benefit from the cash injection:\n\nAMD, Analog Devices, Cree, GlobalFoundries, Intel, Lattice Semiconductor, Marvell Semiconductor, Maxim, Micron Technology, ON Semiconductor, Qorvo, Qualcomm, Silicon Labs, Skyworks, Texas Instruments, Western Digital, Xilinx and the SIA.\n\nA lot of these companies have very affordable stock and steady growth. Do with this information as you will.",
        "subreddit": "wallstreetbets",
        "title": "POTENTIAL EARNING ALERT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/llor9h/potential_earning_alert/",
        "created": 1613575416.0
    },
    {
        "author": "qboptions",
        "created_utc": 1613269601,
        "id": "ljf9hm",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": " \n\nAll options are weekly options expiring Feb19, 2021\n\n**IMPORTANT**: My options trading strategy is based on pricing and the odds I think are for an event to occur. For example, Let’s say APPL is trading at 140 into earnings, and the 147/148 call spread trades at $0.30 giving a payoff of 233% or 2.33 to one. Now, if I think (not what the options market thinks) the likelihood AAPL will be above 148 is 20%, then I will sell the spread. If I think it is 50% then I will buy the spread, so that’s basically my methodology. The pricing must be favorable to what I think the odds should be versus what the market prices them at.\n\nTuesday trades:\n\n**RNG** (1-2 contract limit depending on strike price)  \nHigh RSI, BB Expanded, leaning towards a five-point wing butterfly for 0.05-0.09 debit. It is thinly traded, so it will have to be a miracle fill, and I will be frugal on my limit order. I won’t pay up.  \n\n\n**SHOP** (1-2 contract limit depending on strike price)  \nHigh RSI, BB Expanded, but stock is 45 points below the 1499.75 high it made on Wed. Leaning towards picking a direction depending on the pricing. May sell a credit to pay for a debit. Example sell 1400/1380 Put spread, buy 1500/1520 call spread for a net credit of 0.35  \n \n\n**ADI** (1-2 contract limit depending on strike price)  \nLeaning for a breakout here. I expect pricing to be tight, and may not give me the payoff I am looking for. The spreads are priced exactly where I think the odds are, so no edge. A coin flip.\n\nWednesday trades:  \nwill be updated on Tuesday\n\n**FSLY** (3-5 contract limit depending on strike price)  \n**TLRY** (seeing conflicting earnings dates on this one will have to confirm. Liquidity isn’t an issue)  \n**TWLO** (1-2 contract limit depending on strike price)  \n**BIDU** (5-15 contract limit depending on strike price)  \n**SPWR** (1-3 contract limit depending on strike price)  \n**WMT** (10-50 contract limit depending on strike price)  \n\n\nThursday trades  \n**ROKU** (2-5 contract limit depending on strike price)  \n**AMAT** (5-15 contract limit depending on strike price)  \n**DROP** (5-15 contract limit depending on strike price)\n\n**Disclaimer**: I am not a financial adviser. The above is for entertainment/educational purpose only. I may or may not enter these trades or other trades in the above listed securities which may be in a bullish or bearish direction depending on a variety of factors including but not limited to pricing, liquidity, market direction, and the pricing of the underlying asset.\n\n**Additional Disclaimer**: The above strategies are not suitable for most trades due to various reasons including but not limited to the financial ability to take delivery or deliver the underlying stock at expiration. These risks were not considered when looking at these trade setups since I have a portfolio margin account, which enables me for example to make adjustments by buying or selling short the underlying at the close or afterhours. For example, XYZ closes at 151, and I am long a 145/155 call spread, I can short the stock before the close or afterhours and cover it with the auto exercise at 145. ",
        "subreddit": "options",
        "title": "My Favorite Options Earning Plays for the Week of February 16 2021",
        "url": "https://www.reddit.com/r/options/comments/ljf9hm/my_favorite_options_earning_plays_for_the_week_of/",
        "created": 1613298401.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1613771698,
        "id": "lnrepo",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, February 19, 2021**\n\nAfter opening the day higher, stocks pulled back throughout the session to finish in the red, closing out a very volatile week in the stock market. The S&amp;P 500 (SPY) closed 0.17% down, the tech-heavy Nasdaq closed 0.44% down, and the Dow (DIA) closed 0.03% down. Even though the major indexes pulled back this week, they continue to hover near record levels as optimism over additional stimulus continues to fuel higher levels of risk tolerance among market participants. \n\nThere are many encouraging developments surrounding the coronavirus. This week, the United States averaged 77,665 new coronavirus cases per day, a drop of 43% from the average of two weeks ago, according to data analyzed by the New York Times. Furthermore, [analysis from Bloomberg on Thursday ](https://www.bloomberg.com/news/articles/2021-02-18/how-many-vaccine-doses-are-available-u-s-should-see-a-surge?srnd=premium)showed that the U.S. vaccine supply is poised to double from the current rate of 10 million to 15 million doses per week within the next few weeks, allowing more shots to be given in the near-term.\n\nThursday night, in an interview with CNBC, Treasury Secretary Yellen said a large stimulus package is still necessary to build up sufficient momentum for economic recovery to take off on its own. She said, “We think it’s very important to have a big package \\[that\\] addresses the pain this has caused – 15 million Americans behind on their rent, 24 million adults and 12 million children who don’t have enough to eat, small businesses failing. I think the price of doing too little is much higher than the price of doing something big. We think that the benefits will far outweigh the costs in the longer run,” she added.” \n\nDespite a record low supply and a temporary pullback in December, the housing market remains very strong. According to a report by the National Association of Realtors, sales ended the month of January at a seasonally adjusted, annualized rate of 6.69 million units. That figure is 0.6 higher than December and 23.7% higher when compared with January 2020 and the second-highest sales pace since April 2006.\n\n**Highlights**\n\n* Australian Prime Minister Scott Morrison vowed on Friday to press ahead with laws to force Facebook (FB) to pay news outlets for content, saying he had received support from world leaders after the social media giant blacked out all news media in the country. The US State Department said it sees the dispute as a business matter between a company and a country and is unlikely to get involved.\n* A SPAC called Forest Road Acquisition Corp recently announced a merger with Beachbody and Myx Fitness. The company’s first SPAC raised $300 million and included one third of a warrant with units. Shaquille O’Neal is a strategic advisor for this merger. \n* Bitcoin’s (BTC) impressive rally vaulted the cryptocurrency to a market cap larger than $1 trillion for the first time and well above $50,000 per coin\n* Analog Devices (ADI) target raised by Argus from $155 to $180 at Buy. Stock currently around $158\n* Applied Materials (AMAT) with a host of target raises. Consensus price target is $140 at Overweight. Stock currently around $113\n* Arista Networks (ANET) with a host of target raises. Consensus price target around $350 at Outperform. Stock currently around $308\n* Baidu (BIDU) target raised by UBS Group from $315 to $400 at Buy. Stock currently around $298\n* Crocs (CROX) target raised by Pivotal Research from $87 to $92 at Buy. Stock currently around $80\n* Intuit (INTU) target raised by Barclays from \n* 4455 to $480 at Overweight. Stock currently around $415\n* Sunnova Energy (NOVA) target raised by B. Riley from $55 to $60 at Buy. Stock currently around $47\n* Palo Alto Networks (PANW) target raised by Morgan Stanley (MS) from $425 to $515. Stock currently around $390\n* After positive earnings report, (ROKU) with a host of target raises. Conensus price target $575 at Buy. Stock currently around $450\n* The Trade Desk (TTD) with two target raises. Stock currently around $846\n   * Pivotal Research from $950 to $1010 Buy\n   * Oppenheimer from $900 to $950 at Outperform\n* WorkDay (WDAY) target raised by Evercore ISI from $290 to $320 at Outperform. Stock currently around $272\n\n“An investment in knowledge pays the best interest. “ Benjamin Franklin",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, February 19, 2021. Please Enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/lnrepo/here_is_a_market_recap_for_today_friday_february/",
        "created": 1613800498.0
    },
    {
        "author": "FikerGaming",
        "created_utc": 1613766331,
        "id": "lnplr1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " So hedge funds use alot time and money to find what stocks are trending on WSB sub pages. so here are some to help them out. They need our help, you are welcome hedge funds.\n\nfeel free to copy this and spread it.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The hedge funds need our Help.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lnplr1/the_hedge_funds_need_our_help/",
        "created": 1613795131.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1613229433,
        "id": "lj2cbt",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning February 15th, 2021.\n\n# **Stimulus prospects could boost the stock market and interest rates in the week ahead - [(Source)](https://www.cnbc.com/2021/02/12/stimulus-prospects-could-boost-the-stock-market-and-interest-rates-in-the-week-ahead.html)**\n*****\n&gt; The prospects of a big government spending program could continue to boost the stock market and put upward pressure on interest rates in the week ahead.\n*****\n&gt; Earnings season is beginning to wind down, but some big names have yet to report.\n*****\n&gt; Walmart’s earnings on Thursday should provide a good window into the consumer, as should the government’s retail sales report for January, also expected Wednesday.\n*****\n&gt; The Federal Reserve on Wednesday afternoon releases minutes from its last meeting, and investors will dig into those for any insight into the central bank’s view on inflation.\n*****\n&gt; # Two dominant themes amid stimulus prospects\n&gt; Inflation and rising interest rates have been two dominant themes for investors recently and have become increasingly so as the market has upgraded its view of how much fiscal coronavirus stimulus could be signed into law.\n*****\n&gt; “The market is waiting to see how big the package is going to be. It’s going to be important. They can get it through reconciliation,” said Quincy Krosby, chief market strategist at Prudential Financial.\n*****\n&gt; Krosby said that Democrats could pass the stimulus under budget reconciliation, which means they could approve it with a simple majority instead of relying on negotiations with Republicans.\n*****\n&gt; Some in the markets had anticipated a package of $1 trillion or less if there was a negotiated deal, but that now looks unlikely. Strategists have changed their view on the proposed $1.9 trillion package.\n*****\n&gt; “There is less pushback to President Biden’s proposed stimulus from moderate Democrats than we expected, so a price tag of around $1.5 trillion seems likely, which is higher than we initially thought,” noted Cornerstone Macro policy analysts.\n*****\n&gt; They say they expect a bill to come to the floor during the week of Feb. 22, and that it could become law by the first week of March. Investors will stay focused on its progress through Congress.\n*****\n&gt; Market pros expect the bigger the spending package, the larger the pop will be in economic growth in the near term. That has helped send Treasury yields, which move opposite price, to higher levels.\n*****\n&gt; It has also increased concerns about inflation.\n*****\n&gt; # Inflation and rising yields\nIn the past week, the 10-year yield — a key benchmark — touched 1.2% for the first time since March. It reached that level briefly early in the week but returned to it in the final hour of trading Friday.\n*****\n&gt; Yields are rising on optimism for an improving economy, but also as inflation expectations also move higher.\n*****\n&gt; “If you think about the big drivers, they’re related - vaccines, stimulus and inflation,” said Michael Schumacher, head of rate strategy at Wells Fargo Securities. “If there’s more talk out of D.C. about moving the stimulus package forward, that sets the stage for yields to go up.”\n*****\n&gt; The market is concerned about the economy running hotter, since it could be a trigger to change Fed policy.\n*****\n&gt; At the same time, the Fed has said it would tolerate inflation above its 2% target.\n*****\n&gt; Krosby of Prudential Financial said the market will also pay attention to the producer price index Wednesday even though it is not typically a big factor.\n*****\n&gt; “Because there’s such a debate on inflationary trends, I know the CPI [consumer price index] came in comfortable, but the producer price index is coming in and we’ll see if that has eased,” she said.\n*****\n&gt; “Obviously supply chains are being reestablished and inventories are building,” said Krosby.\n*****\n&gt; Consumer inflation was running at an annual pace of 1.4% in January.\n*****\n&gt; # Housing statistics\nHousing data is also dominant on the calendar in the holiday-shortened week.\n*****\n&gt; The National Association of Home Builders releases its housing market index data on Wednesday, a measurement of sentiment around market conditions for new home sales.\n*****\n&gt; On Thursday, the government will issue data on pending home sales and building permits. Finally, the National Association of Realtors will release existing home sales data on Friday.\n*****\n&gt; Upcoming hearing on GameStop and short squeezes\nStocks were higher in the past week, with energy, tech and financials as the best performers. The S&amp;P 500 rose 1.2%, ending the week at 3,934.\n*****\n&gt; There were some market hot spots, like cannabis shares which became the latest target of the Reddit trading community. The stocks shot higher Wednesday, adding to already lofty gains in recent weeks before giving up some of those gains.\n*****\n&gt; Investors will also be focused on the Thursday hearing before the House Financial Services Committee on the wild trading recently in GameStop and other heavily-shorted names.\n*****\n&gt; Robinhood’s CEO is expected to testify, as are executives from Melvin Capital Management and Citadel.\n*****\n&gt; The frenzied activity in some small and shorted stocks has raised concerns about the market becoming overheated. But Ari Wald, head of technical analysis at Oppenheimer, said the broader market’s advance is intact.\n*****\n&gt; “Overall, it’s a bull market. I think the steadiness of the advance is underappreciated,” Wald said. He said the market technicals are healthy. Breadth is broad-based and there’s cyclical leadership.\n*****\n&gt; “The low-volatility, high-dividend paying sectors are at risk,” said Wald. Utilities and consumer staples stocks, which both fit that category, were lower on the week.\n*****\n&gt; The market was also awaiting the outcome of the Senate impeachment trial of President Donald Trump, and it is not expected to react.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/L9zmpOB.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/cZgpsNC.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/BvmjknF.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/wWv2RIG.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/AfQYO3V.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GNiq0fE.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/v4lTpw4.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/83YL2qB.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/03Kxnx1.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/0AZF7RF.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/MUQx3xY.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/60KQa22.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/LBj1NDa.png))**\n\n*****\n\n&gt; # Presidents' Day Seasonality\n\n&gt; The US equity market will be closed on Monday in observance of the Presidents' Day holiday. Since 1971 when the Uniform Monday Holiday Act set the third Monday in February, rather than on George Washington's birthday (February 22nd) as the Federal holiday, equity market performance during the week of Presidents' Day has been pretty mixed. From the Friday before President's Day through the Friday after, the S&amp;P 500 has traded higher half the time for an average decline of 5 bps. Taking a closer look, in the chart below we show the median returns by day for each trading day in Presidents' week. Tuesday and Thursday have both averaged declines of 13 bps and 7 bps, respectively. Wednesday averages flat performance but the S&amp;P 500 has only been higher 40% of the time. Despite weakness throughout most of the week, equities have tended to catch a bid by week's end with an average 6 bps gain on Friday with a move higher 58% of the time.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021221-Presidents-Day3f.png))**\n\n&gt; In the charts below, we show the average intraday performance of the S&amp;P 500 during Presidents' Day week since 1983 when our intraday data begins. We also include looks for years when the S&amp;P 500 was up and down YTD headed into the holiday. Again, the general pattern has been a steady drift lower until Friday when the S&amp;P 500 has tended to rebound. We would note that the Friday rebound is not an all-day event. As shown, performance is pretty flat in the first several hours of trading with the biggest ramp higher occurring in the final of hours of tradings. That pattern is also consistent for both up and down years, though, in years that the S&amp;P 500 was down YTD headed into the holiday there was a bit of a rebound midweek which was reversed by the end of the week.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021221-Presidents-Day.png))**\n\n*****\n\n&gt; # Trading After Presidents’ Day Weekend Continues to be Weak\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/902779bf6e4c3920c0a6e594303d1963/f9c2be89a4714ce6-96/s500x750/313ae18652b5c66a140a47602ee5649c59baeee7.jpg))**\n\n&gt; In a recent post we looked at the improving trend of market performance ahead of Presidents’ Day weekend. However, the two days after still display a fair amount of red. Since 1990, Tuesday after Presidents’ Day has been strongest for the S&amp;P 500 with 18 gains and 13 losses for median gain of 0.12% but with an average loss of –0.23%. DJIA also has more gains than losses on the Tuesday after, but NASDAQ is a net loser down 18 of 31 years with and average loss of –0.49% and a median loss of –0.11%.\n\n&gt; Wednesday is all red for all three major averages. NASDAQ and S&amp;P 500 have more losses, but DJIA has a larger average loss. On the Wednesday after the Presidents’ Day holiday DJIA is down 16 of 31 with an average loss of –0.07% and a median decline of –0.10%. S&amp;P 500 is down 18 of 31, average –0.02%, median –0.10% and NASDAQ is down 17 of 31, average –0.01%, median –0.09%.\n\n*****\n\n&gt; # Why Bulls Will Like The Year Of The Ox\n\n&gt; “Bulls make money, bears make money, and pigs get slaughtered.” Old Wall Street saying.\n\n&gt; The Chinese New Year (often called the Lunar New Year) will kick off Friday, February 12, and with it will begin the Year of the Ox. Although we would never suggest investing based on the zodiac signs—it is important to note that the Year of the Ox has historically been quite strong for equities. Not to mention we are saying goodbye to the year of the Rat. Good riddance to the Rat, as the last two years of the Rat were 2008 and 2020, not the best years for many reasons!\n\n&gt; Since the Chinese New Year typically starts between late-January and mid-February, we looked at the 12-month return of the S&amp;P 500 Index starting at the end of January dating back to 1950. And wouldn’t you know it? The Year of the Ox has been up more than 13% on average (with a median advance of nearly 18%); suggesting bulls are smiling indeed!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.10.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; “The year of the Ox is the second of the 12 animal signs of the Chinese zodiac, and the Ox is considered a symbol of diligence, persistence, and honesty. Equity returns indeed are quite persistent during the Ox, as it is the third best return out of the 12 Zodiac signs,” explained LPL Chief Market Strategist Ryan Detrick.\n\n&gt; The LPL Chart of the Day shows how all the 12 Zodiac signs have done historically, with the Goat, Tiger, and Ox as the best, while the Rooster and Snake have been the worst.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.10.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; We want to stress that no one should invest purely based on the zodiac signs. This relationship is random and the sample size is small. Still, here’s hoping that the Year of the Ox plays out well for the bulls once again!\n\n*****\n\n&gt; # Short Interest Update\n\n&gt; Yesterday, bi-weekly short interest data was released for the period ending January 30th. In the chart below, we show the Russell 3000 broken up into deciles based on short interest as a percent of the float at the end of 2020 and these decile's stock's median change in short interest from then to yesterday's release. As shown, with the short squeeze episode playing out in the second half of January, the stocks that came into 2020 the most heavily shorted have seen the biggest declines in short interest. That decile of what had been the most heavily shorted names has seen short interest as a percent of float fall for a median of 2.65 percentage points. Deciles two and three have similarly seen sizable declines, though, they are far smaller than those of the most shorted stocks. On the other hand, the decile of the least shorted stocks is the only one that has seen the median short interest reading move higher since the end of 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Deciles-F.png))**\n\n&gt; In the table below, we show the stocks that currently have the highest short interest as a percent of float. After the historic move higher, short squeeze poster child GameStop (GME) is no longer the Russell 3000's most heavily shorted name! Having dropped over 100 percentage points since the start of the year, only 42.61% of shares are now short compared to 43.57% for Gogo (GOGO); currently the most shorted stock in the index. GOGO has actually seen its shorts come off a bit this year as well but that decline has been far more modest of only a little more than one percentage point. Of the other stocks in the index, only Tanger Outlets (SKT) and Dillard's (DDS) also currently have more than 40% of the float sold short.\n\n&gt; On the January 27th closing high, GME was up 1,744.53% year to date. But with the short squeeze unwinding, the stock has fallen over 86%. Others of this cohort have similarly seen big reversals of their earlier surges. For example, National Beverage (FIZZ) had doubled YTD at the time of the GME peak, but since then it has been cut by 33.78%. Not all of these have been losers since the pinnacle of short selling though. Fulgent Genetics, which now has over 30% of shares short, has risen 91.01%. Clovis Oncology (CLVS) and Ligand Pharmaceuticals (LGND) have similarly seen big gains of over 30%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Table-Current-High.png))**\n\n&gt; Given GME came into the year with an absurd number of shares sold short, the squeeze has resulted in it being the biggest decliner in terms of short interest of any Russell 3000 stock. Short interest as a percentage of float has fallen over 100 percentage points YTD. The next biggest drop came from BigCommerce Holdings (BIGC) and Dillard's (DDS) which both saw larger than 50 percentage point drops. Of the rest of the top twenty biggest decliners, a baker's dozen have seen short interest drop by at least 20 points. Additionally, of these stocks that have seen short interest fall the most, only three—nCino (NCNO), Berkeley Lights (BLI), and 3D Systems (DDD)—now have a single-digit short interest as a percent of float.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Table-Decline.png))**\n\n&gt; Given the massive short squeezes, there are far more stocks that now have a lower short interest as a percent of float than at the start of the year. In fact, of the Russell 3000 stocks, 1887 have seen declines in short interest compared to only 1146 that have seen an increase. In the table below, we show the twenty stocks to have seen the biggest increases in SIPF since the start of the year. As shown, there is only one, International Game Technology (IGT), that has seen short interest rise by double digits since the end of 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Table-Increase.png))**\n\n&gt; Retailers notably dominate the list of stocks with the biggest declines in short interest. To quantify this, in the chart below we show the aggregate number of shorted shares as a percent of total float for each industry group as of the most recent short interest data and the end of 2020. As shown, just as it was at the start of the year, retailers remain the most heavily shorted industry group, but it has greatly improved with only 5.86% short compared to 8.15% at the end of 2020. That is the only industry group to have seen short interest drop by a full percentage point or more. The industry group to have experienced the next largest decline was Transportation with aggregate short interest falling from 5.08% to 4.13%. Conversely, there are two industries, Banks and Materials, that have higher short interest as a percent of float than they did at the end of 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/02/021020-SI-Agg-Industry.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending February 12th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=XX2qSnPh7aQ))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 2.14.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$PLTR** \n&gt; * **$SHOP** \n&gt; * **$CVS** \n&gt; * **$WMT** \n&gt; * **$ROKU** \n&gt; * **$FSLY** \n&gt; * **$FVRR** \n&gt; * **$AAP** \n&gt; * **$TLRY** \n&gt; * **$TWLO** \n&gt; * **$WIX** \n&gt; * **$AMAT** \n&gt; * **$GOLD** \n&gt; * **$TTD** \n&gt; * **$AN** \n&gt; * **$DBX** \n&gt; * **$BIDU** \n&gt; * **$YNDX** \n&gt; * **$WING** \n&gt; * **$LPX** \n&gt; * **$ZTS** \n&gt; * **$TRU** \n&gt; * **$SPWR** \n&gt; * **$ECL** \n&gt; * **$ADI** \n&gt; * **$BIGC** \n&gt; * **$SEDG** \n&gt; * **$EXPD** \n&gt; * **$WM** \n&gt; * **$MRO** \n&gt; * **$RNG** \n&gt; * **$STMP** \n&gt; * **$USFD** \n&gt; * **$TRMN** \n&gt; * **$ET** \n&gt; * **$BKI** \n&gt; * **$OXY** \n&gt; * **$TRTN** \n&gt; * **$VMC** \n&gt; * **$TSEM** \n&gt; * **$SNBR** \n&gt; * **$HLT**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/03Kxnx1.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/QgDa3h7.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE TUESDAY'S MARKET OPEN!](https://i.imgur.com/JRy8Aaj.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 2.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF PRESIDENTS DAY.)\n\n&gt; # ***Monday 2.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\nNONE. (U.S. MARKETS CLOSED IN OBSERVANCE OF PRESIDENTS DAY.)\n\n*****\n\n&gt; # ***Tuesday  2.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/OmdMNkE.png))\n\n&gt; # ***Tuesday 2.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FXsPS85.png))\n\n*****\n\n&gt; # ***Wednesday 2.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/IsioZnA.png))\n\n&gt; # ***Wednesday 2.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES #1!](https://i.imgur.com/vU0M3ey.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES #2!](https://i.imgur.com/xgXv9Jn.png))\n\n*****\n\n&gt; # ***Thursday 2.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/4qUjiMa.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/7w3xGSt.png))\n\n&gt; # ***Thursday 2.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/bEPH781.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/bCtqUeh.png))\n\n*****\n\n&gt; # ***Friday 2.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tvZTGpp.png))\n\n*****\n\n&gt; # ***Friday 2.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Palantir Technologies Inc. $31.91\n**Palantir Technologies Inc. (PLTR)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 16, 2021. The consensus earnings estimate is $0.02 per share on revenue of $300.40 million and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for revenue of $299.00 million to $301.00 million. The stock has drifted higher by 120.2% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, January 25, 2021 there was some notable buying of 64,703 contracts of the $33.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 18.2% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Shopify Inc. -\n**Shopify Inc. (SHOP)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, February 17, 2021. The consensus earnings estimate is $1.28 per share on revenue of $906.82 million and the Earnings Whisper ® number is $2.03 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 146.15% with revenue increasing by 79.51%. Short interest has decreased by 9.9% since the company's last earnings release while the stock has drifted higher by 38.3% from its open following the earnings release to be 46.6% above its 200 day moving average of $993.16. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, February 11, 2021 there was some notable buying of 1,548 contracts of the $1,120.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.9% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CVS Health $74.21\n**CVS Health (CVS)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, February 16, 2021. The consensus earnings estimate is $1.24 per share on revenue of $68.67 billion and the Earnings Whisper ® number is $1.49 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 28.32% with revenue increasing by 2.66%. Short interest has decreased by 15.1% since the company's last earnings release while the stock has drifted higher by 17.7% from its open following the earnings release to be 12.7% above its 200 day moving average of $65.83. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, February 9, 2021 there was some notable buying of 15,269 contracts of the $80.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walmart Inc. $144.47\n**Walmart Inc. (WMT)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, February 18, 2021. The consensus earnings estimate is $1.50 per share on revenue of $146.42 billion and the Earnings Whisper ® number is $1.59 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.70% with revenue increasing by 3.35%. Short interest has decreased by 0.3% since the company's last earnings release while the stock has drifted lower by 4.0% from its open following the earnings release to be 6.1% above its 200 day moving average of $136.21. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, February 4, 2021 there was some notable buying of 7,076 contracts of the $152.50 call expiring on Friday, February 26, 2021. Option traders are pricing in a 4.3% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Roku Inc $468.67\n**Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, February 18, 2021. The consensus estimate is for a loss of $0.08 per share on revenue of $615.84 million and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.46% with revenue increasing by 49.76%. The stock has drifted higher by 98.6% from its open following the earnings release to be 113.2% above its 200 day moving average of $219.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, February 10, 2021 there was some notable buying of 2,679 contracts of the $500.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 13.5% move on earnings and the stock has averaged a 11.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Fastly, Inc. $102.06\n**Fastly, Inc. (FSLY)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 17, 2021. The consensus estimate is for a loss of $0.10 per share on revenue of $82.48 million and the Earnings Whisper ® number is ($0.06) per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for a loss of $0.12 to $0.08 per share on revenue of $80.00 million to $84.00 million. Consensus estimates are for earnings to decline year-over-year by 0.00% with revenue increasing by 39.95%. Short interest has increased by 140.9% since the company's last earnings release while the stock has drifted higher by 36.9% from its open following the earnings release to be 26.4% above its 200 day moving average of $80.76. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, February 12, 2021 there was some notable buying of 6,313 contracts of the $110.00 call expiring on Friday, February 26, 2021. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 15.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FSLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Fiverr International Ltd. $323.10\n**Fiverr International Ltd. (FVRR)** is confirmed to report earnings at approximately 1:00 AM ET on Thursday, February 18, 2021. The consensus earnings estimate is $0.12 per share on revenue of $53.95 million and the Earnings Whisper ® number is $0.18 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for revenue of $52.40 million to $53.40 million. Consensus estimates are for year-over-year earnings growth of 166.67% with revenue increasing by 82.69%. Short interest has increased by 65.3% since the company's last earnings release while the stock has drifted higher by 115.6% from its open following the earnings release to be 130.6% above its 200 day moving average of $140.10. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, February 8, 2021 there was some notable buying of 1,192 contracts of the $140.00 put expiring on Friday, July 16, 2021. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 8.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FVRR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Advance Auto Parts Inc. $152.81\n**Advance Auto Parts Inc. (AAP)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, February 16, 2021. The consensus earnings estimate is $1.93 per share on revenue of $2.35 billion and the Earnings Whisper ® number is $2.12 per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 17.68% with revenue increasing by 11.24%. Short interest has increased by 26.1% since the company's last earnings release while the stock has drifted lower by 0.3% from its open following the earnings release to be 2.2% above its 200 day moving average of $149.58. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, February 2, 2021 there was some notable buying of 8,450 contracts of the $160.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.0% move on earnings and the stock has averaged a 3.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Tilray, Inc. $29.00\n**Tilray, Inc. (TLRY)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 17, 2021. The consensus estimate is for a loss of $0.14 per share on revenue of $56.42 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 77.42% with revenue increasing by 20.21%. Short interest has increased by 24.6% since the company's last earnings release while the stock has drifted higher by 211.5% from its open following the earnings release to be 196.6% above its 200 day moving average of $9.78. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, February 12, 2021 there was some notable buying of 19,496 contracts of the $40.00 call expiring on Friday, February 19, 2021. The stock has averaged a 11.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Twilio, Inc. $435.29\n**Twilio, Inc. (TWLO)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, February 17, 2021. The consensus estimate is for a loss of $0.05 per share on revenue of $454.64 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for a loss of $0.11 to $0.08 per share on revenue of $450.00 million to $455.00 million. Consensus estimates are for year-over-year earnings growth of 37.50% with revenue increasing by 37.26%. Short interest has decreased by 50.6% since the company's last earnings release while the stock has drifted higher by 46.2% from its open following the earnings release to be 59.3% above its 200 day moving average of $273.25. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 14, 2021 there was some notable buying of 1,512 contracts of the $300.00 put expiring on Friday, June 17, 2022. Option traders are pricing in a 9.8% move on earnings and the stock has averaged a 10.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TWLO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning February 15th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/lj2cbt/wall_street_week_ahead_for_the_trading_week/",
        "created": 1613258233.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1613684937,
        "id": "lmy9lg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, February 18, 2021**\n\nStocks slid on Thursday, with market participants discouraged by worse-than-expected unemployment data and general market volatility. The S&amp;P 500 (SPY) closed 0.4% down, the tech-heavy Nasdaq (QQQ) finished 0.72% down and the Dow Jones (DIA) finished 0.34% down.\n\nThe chief executives of Robinhood and Reddit, several hedge fund managers, and Reddit-user Keith Gill, better known as DeepFuckingValue or RoaringKitty, were grilled in a Senate hearing regarding the recent drama that unfolded between short-sellers, brokers, and retail traders in “meme stocks” like Gamestop (GME) and AMC. It was a really crazy event, unlike anything we have seen before, and while there is too much for us to cover here, we highly recommend everyone go back to watch the Senate hearing. \n\nThe latest report by the Department of Labor seems to signal a setback in the recovery of the labor market. New unemployment claims totaled 861,000, the highest level in more than a month and way above economist estimates of 773,000. Continuing claims, which show the number of people who already filed unemployment claims, declined again, edging lower to just below 4.5 million, a drop of 64,000.\n\nMarket participants continue to focus on developments surrounding stimulus out of Washington. House Democrats are reportedly finalizing the details of President Biden’s proposed $1.9 trillion stimulus package with the aim to vote on the legislation by the end of next week. Nancy Pelosi told reporters she hopes for a vote “sometime at the end of next week.” House leaders will stay in touch with the Senate about what Congress can include in the aid package under budget reconciliation, which enables Democrats to approve the plan without Republican votes, Pelosi added.\n\n**Highlights**\n\n* Amid the shortage of gaming chips, Nvidia (NVDA) announced it was releasing dedicated chips to mine cryptocurrencies, particularly ethereum. The new chip type is called CMP, or Cryptocurrency Mining Processor. The first cards will go on sale in March, an Nvidia spokesperson said. In a [blogpost](https://blogs.nvidia.com/blog/2021/02/18/geforce-cmp/), the company said, “CMP products — which don’t do graphics — are sold through authorized partners and optimized for the best mining performance and efficiency. They don’t meet the specifications required of a GeForce GPU and, thus, don’t impact the availability of GeForce GPUs to gamers.” This is extremely interesting and the latest mega-cap company to get involved in cryptocurrencies.\n* The U.S. Chamber of Commerce and an industry group backed by Amazon, Facebook Inc and Google have sued Maryland over new its new online advertising tax aimed at funding education, the Washington Post reported on Thursday.\n* Facebook (FB) faced backlash from publishers and politicians on Thursday after blocking news feeds in Australia in a surprise escalation of a dispute with the government over a law to require it to share revenue with Australian news producers. \n* **Disclaimer: Current stock price is written premarket, prices are probably different due to intraday movement.**\n* Analog Devices (ADI) with a host of target raises. Consensus price target around $190 at Outperform. Stock currently around $158\n* Activision-Blizzard (ATVI) price target raised from $102 to $122 at Buy. Stock currently around $102.\n* After a stellar earnings report, Twilio (TWLO) with a host of target raises. Consensus price target around $550 at Buy. Stock currently around $443\n* Ribbon Communications (RBBN) target raised by B. Riley from $12 to $14 at Buy. Stock currently around $10. We like this stock, deserves more attention.\n* Invitae (NVTA) target raised by SVB Leerink from $64 to $64 at Buy. Stock currently around $47.50\n* Shopify (SHOP) with a host of target raises. Consensus price target around $1500 at Overwight. Stock currently around $1384\n\n“The best way to predict the future is to create it.” Abraham Lincoln",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, February 18, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/lmy9lg/here_is_a_market_recap_for_today_thursday/",
        "created": 1613713737.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1613771784,
        "id": "lnrfqt",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, February 19, 2021**\n\nAfter opening the day higher, stocks pulled back throughout the session to finish in the red, closing out a very volatile week in the stock market. The S&amp;P 500 (SPY) closed 0.17% down, the tech-heavy Nasdaq closed 0.44% down, and the Dow (DIA) closed 0.03% down. Even though the major indexes pulled back this week, they continue to hover near record levels as optimism over additional stimulus continues to fuel higher levels of risk tolerance among market participants. \n\nThere are many encouraging developments surrounding the coronavirus. This week, the United States averaged 77,665 new coronavirus cases per day, a drop of 43% from the average of two weeks ago, according to data analyzed by the New York Times. Furthermore, [analysis from Bloomberg on Thursday ](https://www.bloomberg.com/news/articles/2021-02-18/how-many-vaccine-doses-are-available-u-s-should-see-a-surge?srnd=premium)showed that the U.S. vaccine supply is poised to double from the current rate of 10 million to 15 million doses per week within the next few weeks, allowing more shots to be given in the near-term.\n\nThursday night, in an interview with CNBC, Treasury Secretary Yellen said a large stimulus package is still necessary to build up sufficient momentum for economic recovery to take off on its own. She said, “We think it’s very important to have a big package \\[that\\] addresses the pain this has caused – 15 million Americans behind on their rent, 24 million adults and 12 million children who don’t have enough to eat, small businesses failing. I think the price of doing too little is much higher than the price of doing something big. We think that the benefits will far outweigh the costs in the longer run,” she added.” \n\nDespite a record low supply and a temporary pullback in December, the housing market remains very strong. According to a report by the National Association of Realtors, sales ended the month of January at a seasonally adjusted, annualized rate of 6.69 million units. That figure is 0.6 higher than December and 23.7% higher when compared with January 2020 and the second-highest sales pace since April 2006.\n\n**Highlights**\n\n* Australian Prime Minister Scott Morrison vowed on Friday to press ahead with laws to force Facebook (FB) to pay news outlets for content, saying he had received support from world leaders after the social media giant blacked out all news media in the country. The US State Department said it sees the dispute as a business matter between a company and a country and is unlikely to get involved.\n* Analog Devices (ADI) target raised by Argus from $155 to $180 at Buy. Stock currently around $158\n* Applied Materials (AMAT) with a host of target raises. Consensus price target is $140 at Overweight. Stock currently around $113\n* Arista Networks (ANET) with a host of target raises. Consensus price target around $350 at Outperform. Stock currently around $308\n* Baidu (BIDU) target raised by UBS Group from $315 to $400 at Buy. Stock currently around $298\n* Crocs (CROX) target raised by Pivotal Research from $87 to $92 at Buy. Stock currently around $80\n* Intuit (INTU) target raised by Barclays from \n* 4455 to $480 at Overweight. Stock currently around $415\n* Sunnova Energy (NOVA) target raised by B. Riley from $55 to $60 at Buy. Stock currently around $47\n* Palo Alto Networks (PANW) target raised by Morgan Stanley (MS) from $425 to $515. Stock currently around $390\n* After positive earnings report, (ROKU) with a host of target raises. Conensus price target $575 at Buy. Stock currently around $450\n* The Trade Desk (TTD) with two target raises. Stock currently around $846\n   * Pivotal Research from $950 to $1010 Buy\n   * Oppenheimer from $900 to $950 at Outperform\n* WorkDay (WDAY) target raised by Evercore ISI from $290 to $320 at Outperform. Stock currently around $272\n\n“An investment in knowledge pays the best interest. “ Benjamin Franklin",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, February 19, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/lnrfqt/here_is_a_market_recap_for_today_friday_february/",
        "created": 1613800584.0
    },
    {
        "author": "JaytotheEnny",
        "created_utc": 1613762830,
        "id": "lno8kc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I heard about all of the hedge funds working really, really hard on building these trackers that crawl through all of our posts looking for the next big hit. I feel so bad for those little-widdle hedgie funds and wanted to put together a great list for them. \n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JAP, JAP, JAP JAP, JAP JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TATE, TATE, TATE, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Here are some stocks that I like- for all those trackers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lno8kc/here_are_some_stocks_that_i_like_for_all_those/",
        "created": 1613791630.0
    },
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "GomorrahInlet",
        "created_utc": 1612380297,
        "id": "lbvsx5",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Don’t get me wrong, CCC is a perfectly amazing asset.  96% recurring revenue, 10-12% top line growth, sticky retention, decent incremental margins. China story, well aligned with de-urbanization theme, etc.  The problem is that when you pay 10x revenue and 30x EBITDA and argue that it’s cheap to TYL and ADSK at 47-50x ebitda on quality grounds it’s just big yawn.  Add in that it’s a sponsor asset with an overhang and ugh.  \n\nDragoneer is near legend for people who understand their space.  They are the best.  People wanted a nice 2-4 billion mega growth company.  They wanted a Ferrari.  They just got a used BMW M5 that while fully loaded and only with 20,000 miles...and definitely great value at the price offered...just isn’t going to get it done except for impressing the married with 3 kids crowd.  \n\nThink near term this is 12-14 per share and maybe gets to 20 in a year post de-SPAC.  Dragoneer played it safe and will raise another SPAC and get to do this all over again.",
        "subreddit": "SPACs",
        "title": "DGNR: A used BMW M5 at a great price vs the hoped for Ferrari...ugh",
        "url": "https://www.reddit.com/r/SPACs/comments/lbvsx5/dgnr_a_used_bmw_m5_at_a_great_price_vs_the_hoped/",
        "created": 1612409097.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "alexl1994",
        "created_utc": 1613687468,
        "id": "lmz98j",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**Disclaimer and disclosure:** I am not a financial advisor and none of the below research constitutes investment advice or a recommendation to buy or sell. Always do your own due diligence. I currently own 700 commons and 1500 warrants of LCAP and plan to buy an additional 3500 warrants, just waiting for an account transfer to go through. All prices mentioned below are as of market close on February 18.\n\n**Note:** Any constructive criticism to improve this DD would be welcome. If you see any red flags or risks I may have missed, please highlight them.\n\n**TL;DR:** Lionheart Acquisition Corp. II (LCAP) is a SPAC targeting a company at the intersection of real estate and technology with a team experienced in SPAC dealmaking, the target sector, and private equity. Commons and warrants are relatively cheap at $10.73 and $1.57, respectively.\n\n**Fast Facts:**\n\n* Leadership: Ophir Sternberg (CEO, President, and Chairman), Trevor Barran (COO), and Paul Rapisarda (CFO)\n* Units have half a warrant, one warrant for one share + $11.50\n* IPO: August 8, 2020; 18-month term, $230 million initial trust\n* Target: A real-estate technology (“PropTech”) company with an enterprise value of least $1 billion\n* Current prices: units ($11.32), commons ($10.73), and warrants ($1.57)\n* Incorporated in Delaware\n* Interestingly, contrary to what its name suggests, LCAP is not the second SPAC from this sponsor. More on that below.\n\nThough many DD posts tout SPACs that they claim are “under the radar” and “sleeping giants,” I genuinely believe LCAP is relatively overlooked by investors. It has low-to-medium volume (3-month average is 93K, 10-day average is 91K), is relatively near NAV, has only 142 followers on [Stocktwits](https://stocktwits.com/symbol/LCAP), and has no DD posted on this sub to date (which was surprising).\n\n**Leadership:**\n\n* CEO Ophir Sternberg previously led OPES Acquisition Corp., which successfully merged with BurgerFi (BFI, +54% above $10 offer price) in December 2020. (Interestingly, OPES IPO’d in March 2018 and originally focused on a target in Mexico and went through a number of deadline extensions; after Sternberg became Chairman of OPES in March 2020, the BurgerFi deal was announced in June. More on that under “The Sternberg–OPES Connection.”) He has decades of experience developing and investing in the real-estate industry. He’s CEO of Lionheart Capital, a Miami-based real-estate development and investment firm founded in 2010. Sternberg has led a number of large real-estate transactions, including the Miami Beach Ritz-Carlton project, which resulted in a total sell-out value in excess of $560 million as well as the $30 million purchase and $120 million sale of the Seagull Hotel. Ongoing projects include retail properties in Miami’s Design District, two oceanfront condominium towers in Pompano Beach, Florida and a ski-in/ski-out hotel and residences in Breckenridge, Colorado.\n* COO Trevor Barran has been at Lionheart Capital since 2017. For two decades, Barran worked in investment and operations roles across the financial services, healthcare, technology, and real estate industries, including the last ten years acquiring and developing real estate properties.\n* Paul Rapisarda joined Lionheart in 2019 and previously was CFO of Etrion Corp., a solar energy development company.\n* Sternberg, Barran, and Rapisarda are also all part of Out of the Box Ventures, a Lionheart Capital subsidiary that acquires and repositions distressed retail properties in the US. Out of the Box currently controls over 6 million square feet of big box stores, shopping centers, and enclosed regional mall properties with plans to improve and expand upon these acquisitions.\n\n**Target Sector:**\n\nFrom the [S-1](https://sec.report/Document/0001104659-20-086909/#aa_006):\n\n&gt;“We define the PropTech sector as businesses that apply innovative digital technologies and technology-enhanced services and solutions to the identification, design, development, construction, operation, financing, management and disposition of real estate properties. This definition applies to both technology companies that are disrupting the real estate sector as well as to real estate companies that utilize innovative technology.  \n&gt;  \n&gt;The businesses we seek to acquire offer innovative software, hardware, products, operations or services that are technologically equipped to improve property ownership; property financing; property valuation; property operations; property management; leasing; property insurance; real estate asset management and investment management; and design, construction and development. These businesses have a large addressable market across the broader real estate sector potentially including landlords, tenants, developers, operators, managers, brokers, investors, lenders, architects, engineers, and general contractors. We believe the acquisition of one or more businesses in this sector can serve as a platform for expansion, both organically and through further acquisitions, including ‘roll-ups’ of smaller players in some of the more fragmented, emerging sectors such as co-working and co-living.  \n&gt;  \n&gt;We will seek to acquire established businesses of scale that we believe are poised for continued growth with capable management teams and proven unit economics, but potentially in need of financial, operational, strategic or managerial enhancement to maximize value. We do not intend to acquire startup companies or companies without established business plans.”\n\nOverall, I think PropTech is an intriguing sector with the potential for strong growth. Though we’re familiar with some innovative PropTech companies like Airbnb, Zillow, Autodesk, Redfin, and others, the real-estate sector is still ripe for disruption. In 2018, for instance, PropTech companies received just $5.3 billion of venture funding compared to approximately $47 billion for U.S. fintech companies, indicating we’re still early on in this cycle and greater growth and innovation may be ahead.\n\nAlso, recent SPAC mergers with PropTech companies OpenDoor (OPEN, previously IPOB, +211% above $10 offer price) and Porch.com (PRCH, previously PTAC, +105% above $10 offer price) have generated increased awareness of and interest in the sector. I won’t go through possible target companies here (maybe in a future post), but those interested in learning more about the sector and the relevant companies should see “Links of Interest” below.\n\n**Progress on Finding a Target:**\n\nIn October 2020, an [article](https://d1io3yog0oux5.cloudfront.net/_b248f39712383d5ad501a6465d5f6f55/lionheartacquisitioncorp/db/942/8000/pdf/MergerMarket+10+8.pdf) linked from LCAP’s official site noted, “Lionheart Acquisition Corporation II has reviewed more than 20 potential property technology targets since listing in August and **five of them are ‘very interesting,’** CEO Ophir Sternberg said.” The article is short but provides a lot of good information about the kind of target LCAP is looking for and I recommend people read it. In the same article is where he mentions looking for a company that is at least $1 billion in value. It’s relevant to note that Sternberg also said that he’s more interested in the tech side of PropTech than actual real estate companies:\n\n&gt;“We are looking at them all, but companies that are more focused on providing technology than on property are more exciting right now,” Sternberg said. “They have a higher growth potential.”\n\nGiven that four months have passed since the article without an update from Sternberg, my guess is that LCAP is making progress on their search and may have approached one or more businesses to begin talks. They may even be close to finalizing a deal, but this is pure speculation. Beyond that, I can’t make any other claims about where they might be in the process.\n\n**The Sternberg–OPES Connection:**\n\nIn the interest of assessing Sternberg’s leadership and dealmaking skills, I wanted to learn more about his time at OPES. I hope you’ll permit me to go on a bit of a tangent concerning this because I found it pretty interesting. As I mentioned above, OPES IPO’d in March 2018 and originally focused on a target in Mexico and went through a number of deadline extensions; Sternberg only became Chairman of OPES in March 2020, and the BurgerFi deal was announced in June. This prompted a series of questions: **Under what conditions did Sternberg take the lead at OPES? Did OPES approach Sternberg or vice versa? Were they close to a merger deal at the time? When did the pivot from Mexico to BurgerFi happen?** The LCAP S-1 has this to say: “The OPES team, led by Mr. Sternberg, evaluated over 50 potential targets and negotiated business combination terms with multiple candidates **in a span of a few months** and is acquiring BurgerFi at what it believes is an attractive multiple relative to its peers.”\n\nI thought that would be the end of it and we’d never know the precise details of Sternberg’s time at OPES. Well, it turns out that a detailed timeline is provided in the OPES [Schedule 14A](https://www.sec.gov/Archives/edgar/data/1723580/000121390020028487/ea125096-prem14a_opesacqu.htm), the filing where investors are informed of the merger vote meeting, on pp.48–50. In short, OPES decided to shift gears at some point in March 2020, likely around the time their fourth extension was approved by stockholders on March 16, to a new team led by Sternberg that would focus on “identifying a high-growth US company that could take advantage of the new team’s extensive experience in real estate development, design and build, acquisitions, leasing and rapid growth strategies.” Almost immediately, on March 18, Sternberg contacted John Rosatti, the CEO and Founder of BurgerFi, to gauge interest in merging. On April 25, they had an initial draft of the LOI, a signed LOI on June 7, and a signed DA on June 29.\n\nAll of this leads me to believe that Sternberg’s leadership and connections were instrumental in helping OPES pivot and finally close a deal. And this is where we can guess why Lionheart added the “II” to its name after the BurgerFi merger announcement in June: LCAP is not the second SPAC by Lionheart, but instead should be seen as a successor of sorts to OPES. At $15.41/share, BFI investors may not be seeing the kind of returns they would get from an EV or fintech company, but BFI is a fast-growing business executing an expansion plan during a pandemic, and I recall the company being well-liked on this sub (for those who were here then).\n\n**Bearish DD:**\n\nWhile researching, I came across another [writeup](https://spacteams.com/lcap-spac-mall-renovator-making-spac-money-moves/) linked from Stocktwits. Titled “Mall Renovator Making SPAC Money Moves,” the post concludes: \n\n&gt;“Lionheart Corporation is led by a mediocre CEO and a team that has most of its experience in mall-based retailers. Both the SPAC and Lionheart Capital has a bright future ahead and I don’t see them running into any deadline problems. Lionheart is clearly an opportunist, and will likely take advantage of retail displacement due to COVID. Also Lionheart Capital is taking full advantage of the retail real estate deal flow during the Pandemic, so they definitely know what they’re doing. Finally, with subsidiary’s such as Out of the Box Ventures, Lionheart Capital is sure to expand their horizons, whether its in the real estate sector or any other sector.”\n\nPutting aside the question of how a mediocre team can have a bright future, let’s examine these claims. While it’s true that Out of the Box has acquired properties related to a number of struggling mall-based retailers (e.g., Macy’s, JCPenney, Sears, etc.), it specifically targets these kinds of distressed companies and aims to be at the forefront of transforming the properties into multipurpose destinations. Further, Lionheart has a broader portfolio across residential, commercial, hotel, and retail properties, so I think the characterization of the team and their experience as “mall renovators” is unfair and misleading. The mention of COVID, though, was interesting and something I had in mind as well. COVID is changing numerous aspects of real estate (particularly the housing market and commercial/retail spaces like malls) in ways I haven’t fully explored yet, and it wouldn’t surprise me to see LCAP capitalize on that somehow. But at the same time, management makes no mention of using the economic effects of COVID to their advantage in the S-1 and there’s really no solid evidence that it’s part of their strategy (unless you count their emphasis on tech, which has thrived during the pandemic). \n\nLCAP might pick up some sort of mall-based company, as the DD post above suggests, but I think this would be a deviation from the team’s investment thesis, recent interview statements, and commitment to the tech side of PropTech. Further, the sentiment that the team is defined by their focus on dying malls and retailers is inaccurate. Overall, I think the DD post above is off-base and demonstrates a misunderstanding of the kind of target LCAP is looking for. But the bearish outlook is useful for thinking about this SPAC from a different point of view, which is always helpful.\n\n**Miscellaneous:**\n\n* I’ve checked some of management’s LinkedIn pages but found little of interest (actually, I did, but it’s a lot of disconnected pieces that makes me feel a bit like the [guy from this meme](https://knowyourmeme.com/memes/pepe-silvia)).\n* I checked the most recent 10-Q to see if increased operating expenses indicated they may have found a target but saw nothing out of the ordinary.\n* The most recent 13G can be found [here](https://www.sec.gov/Archives/edgar/data/1802450/000110465921024054/tm216967d1_sc13g.htm) and shows that Lionheart Equities and Sternberg own 16.7% of shares each as of December 31 of last year. Other institutional investors can be seen [here](https://whalewisdom.com/stock/lcap?selected_quarter=24) (which also shows Lionheart with a 41% stake in LCAP).\n\n**Risks:**\n\n* **Liquidation and opportunity cost:** As with all SPACs, two main risks are liquidation (if the SPAC fails to find a target before its deadline) and opportunity cost. LCAP is currently about a third of the way through its 18-month term and investors waiting for a DA may be waiting up to a year for an announcement.\n* **Unknown target and valuation:** As with all pre-DA/LOI/rumor SPACs, investors buy into the management and sector without knowing which company they will ultimately merge with, the terms of the agreement, or whether it will be at a fair valuation, making it impossible to determine the long-term market value of their investment.\n\n**Conclusion:**\n\nThis SPAC checks a number of the right boxes for me: good management experience in both SPACs and the target sector, inexpensive shares/warrants, resulting in reduced risk, and in a less-hyped sector than EV or fintech with the potential for growth. This SPAC is about a third of the way through its life cycle, and based on my research, it’s rare to have commons and warrants this cheap this far along without coming across a few red flags—but I haven’t found any. LCAP’s trust is “only” $230 million and it may not pick up the next hottest company, but it doesn’t need to. At this point, I would prefer a fair valuation for an established business. There’s evidence to suggest LCAP offers low-risk access to a growing sector with capable leadership at the helm. In a frothy, unpredictable market, that’s valuable.\n\n**Links/Sources:**\n\n* [S-1](https://sec.report/Document/0001104659-20-086909/#aa_006)\n* [Property tech SPAC Lionheart Acquisition II prices $200 million IPO at $10 press release](https://www.renaissancecapital.com/IPO-Center/News/70307/Property-tech-SPAC-Lionheart-Acquisition-II-prices-$200-million-IPO-at-$10)\n* [Lionheart Acquisition Corp. II website](https://www.lionheartacquisitioncorp.com/)\n* [Lionheart Acquisition II narrows focus to five ‘very interesting’ proptech targets, CEO says](https://d1io3yog0oux5.cloudfront.net/_b248f39712383d5ad501a6465d5f6f55/lionheartacquisitioncorp/db/942/8000/pdf/MergerMarket+10+8.pdf), 13 October 2020\n\n**Links of Interest:**\n\n* [10 Real Estate Technology Companies You Should Know](https://builtin.com/consumer-tech/real-estate-technology)\n* [Where top VCs are investing in real estate and proptech](https://techcrunch.com/2019/11/14/where-top-vcs-are-investing-in-real-estate-and-proptech-part-1-of-2/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAHORVWA5Py9UhffovPVYF-iKCNaL6qb3ySZ3gQn8mmXnc2vcXuO4u87wv_U-4QE8cgkmGQx9bAb_-0d8w0bczAeK_HJRgpjj5tDyZ1B8lL2pg_WZCEEHROXdE4pelEKMbSxZuA8NGR6MKQq7W7uvhLgHjoSr-DuAW2S1ZpZeL3Fx)\n* [Top 10 Proptech companies aiming to change the property market](https://www.information-age.com/top-10-proptech-companies-aiming-change-property-market-123488802/)\n* [How Proptech is Redefining the Real Estate Industry](https://builtin.com/consumer-tech/proptech)\n* [4 trends in property technology](https://mitsloan.mit.edu/ideas-made-to-matter/4-trends-property-technology)",
        "subreddit": "SPACs",
        "title": "Lionheart Acquisition Corp. II (LCAP): Due Diligence on a Real-Estate Technology SPAC",
        "url": "https://www.reddit.com/r/SPACs/comments/lmz98j/lionheart_acquisition_corp_ii_lcap_due_diligence/",
        "created": 1613716268.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "VaPacc",
        "created_utc": 1613159880,
        "id": "lijakg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Designed myself in Autodesk Inventor Professional and 3D printed with Makerbot. Always repping WSB.",
        "url": "https://i.redd.it/n7it7ow0r3h61.jpg",
        "created": 1613188680.0
    },
    {
        "author": "Carlosdelicado6",
        "created_utc": 1612945034,
        "id": "lgp6r9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Any info about ADSK?",
        "url": "https://www.reddit.com/r/StockMarket/comments/lgp6r9/any_info_about_adsk/",
        "created": 1612973834.0
    },
    {
        "author": "hanaanbread420",
        "created_utc": 1612366168,
        "id": "lbq0va",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Autodesk (ADSK) expect their 2021 revenue and earnings to rise 14% and 31% respectively. Take advantage of the dip people.",
        "url": "https://www.reddit.com/r/StockMarket/comments/lbq0va/autodesk_adsk_expect_their_2021_revenue_and/",
        "created": 1612394968.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1612166413,
        "id": "l9y3e7",
        "num_comments": 7565,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n  * StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Feb 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/l9y3e7/rstocks_daily_discussion_monday_feb_01_2021/",
        "created": 1612195213.0
    },
    {
        "author": "ABonafidePotato",
        "created_utc": 1612192565,
        "id": "la5ci3",
        "num_comments": 480,
        "num_crossposts": 1,
        "selftext": "I missed last year's incredible bull run in a lot of tech. I played the options market more and held cash. Now I'm looking for decent value holds. AMD's most recent earnings blowout has me pretty exciting that they're living up to the hype. As far as I can see their P/E was basically cut in half after their report last week. That, plus the fact that their stock has been dropping ever since makes me think this is an excellent dip to buy. \n\nAny thoughts or comments are appreciated. Just wanna discuss what everyone else thinks.",
        "subreddit": "investing",
        "title": "Time to go long on AMD?",
        "url": "https://www.reddit.com/r/investing/comments/la5ci3/time_to_go_long_on_amd/",
        "created": 1612221365.0
    },
    {
        "author": "sillyhands1",
        "created_utc": 1612190993,
        "id": "la4pt3",
        "num_comments": 232,
        "num_crossposts": 0,
        "selftext": "Haven't seen a post about something other than GME since this sub was flooded by millions of people, so I figured I would mention something new. AMD, yeah remember the company everyone seemingly forgot about despite posting huge growth consistently in 2020? Well they recently had earnings and suffered bigly along with most tech. Some highlights from their earnings:\n\n* Record revenue for the year with $9.76 billion in revenue\n* Q4 Revenue up 53% to $3.244 billion (also record quaterly revenue)\n* Gross profit up 53% to $1.451 billion\n* Net income up to $1.78 billion compared to $170 million a year ago\n* EPS up 867% (yes that is right) to $1.45 per share\n* Cash flow up to $554 million YoY\n* Q1 2021 guidance: 3.2B in revenue (79% YoY) and 46% gross margin\n* FY'2021 guidance: 37% increase in revenue YoY\n* Lets not forget their recent acquisition of Xilinx that will put them in a great position for the future\n\nSu bae has been delivering hard on her promises, and I see no reason for this momentum to not carry forward into 2021. They have gone on sale after earnings, and I can't wait to see what AMD has in store for 2021.",
        "subreddit": "wallstreetbets",
        "title": "Incredible AMD financial report that seemingly flew under the radar during all these GME posts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4pt3/incredible_amd_financial_report_that_seemingly/",
        "created": 1612219793.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612184950,
        "id": "la2oov",
        "num_comments": 147,
        "num_crossposts": 0,
        "selftext": "**Stocks end their worst week since October at their lowest point on Friday. Is the Short-Squeeze Over? Over 100 companies report earnings this week. Let’s talk about this &amp; other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of Friday as we saw the stock market finish with another sell-off, as the big 3 indices finished with the worst week since late October with the [SP500](https://ibb.co/Vpq92y3) losing almost 2%, the [Nasdaq Composite](https://ibb.co/yN3b3RQ) losing exactly 2% and the [Dow Jones](https://ibb.co/D7Cy2YQ) shedding 620 points and dropping below 30k. All 3 of them finished the week down more than 3% as the [VIX](https://ibb.co/cgz4N3r) spiked yet again on Friday, rising by almost 10% and finishing the week up more than 40%.\n\nWe saw over 70% of the companies declining [Friday](https://ibb.co/G3rX22D), as the number of companies trading above the 50-day moving average dropped under 50%, with all 11 [sectors](https://ibb.co/HKhY6hC) finishing in the red again, as Energy &amp; Tech were the biggest losers. \n\nSo, let’s take a look at the HEAT MAP from [Friday](https://ibb.co/jVFqVbH). It’s really hard to find any gaining companies, with big tech companies selling off yet again, as most of the small gainers were found in the Health Care sector. For the [WEEK](https://ibb.co/5Y5HR4q)  though, Microsoft was the only big tech name that managed to gain ground after smashing the earnings report, while most of the stock market faced sell-off pressures as the short squeeze mania might have pushed investors into a risk-off approach.\n\nWe also got some economic data on Friday as the December personal disposable [INCOME](https://ibb.co/Khyh7mP) increase by 0.6%, more than expected as this mostly reflected an increase in social benefits &amp; compensations, with the Q4 employment cost [INDEX](https://ibb.co/QcqbM5y) also rising by 0.7% to close out the year.\n\nMeanwhile we saw the Consumer Sentiment [INDEX](https://ibb.co/pX3mFgt) coming in at 79, slightly lower than expected, as this was also seen in the December pending home sales [NUMBER](https://ibb.co/m4tbnWN), which also came in with a 0.3% decrease month/month.\n\nThis week we have somewhat of a quiet economic [CALENDAR](https://ibb.co/LvYY84v), with a couple of interesting numbers through the week, while [EARNINGS](https://ibb.co/rxmpwVK) take center stage yet again, with interesting reports coming from companies like Amazon, Google &amp; Alibaba on Tuesday, while Wednesday we hear from PayPal, Qualcomm &amp; Spotify. We also get earnings reports from some recent favorites like Pinterest, Snap, Ford, Peloton and Penn on Thursday as the earnings season with over 100 companies from the SP500 reporting, might help push the stock market higher after the sell-off last week.\n\nIn some other stock market news, we saw [NIO](https://ibb.co/C0CSdJJ) reporting a new monthly record with 7225 vehicles delivered in the first month of 2021🚀🚀🚀, an increase of more than 350% Y/Y as the company is still ramping up production in an attempt to challenge Tesla’s EV dominance. Nio has had a huge run in the past months but has a long way to go to grow into the big valuation, though the trajectory of the company looks very promising.\n\nMeanwhile the biggest development in the markets was the trading platforms [imposing](https://ibb.co/y5sPVJv) restrictions on the squeezed stocks and even many other stocks that didn’t have such a big short % of the float with big names like AMD, Starbucks &amp; Moderna being affected. These restrictions were reduced back to only 8 companies [Sunday](https://ibb.co/GV5TKxf), but are still limited to whole share aggregate buy limits on the crowd favorites🚀🚀🚀.\n\nThe recent moves in the stock market have made some big changes in the social world as Steve Cohen deactivate his [Twitter](https://ibb.co/0KK2P59) 🚀🚀🚀, while a recent [survey](https://ibb.co/Mf6V8tz) showed that more than ¾ of respondents are planning on leaving RBNHD while 13% already did it, with the limiting tactics being probably the biggest reason for retail investors to make this change.\n\nInteractive [Brokers](https://ibb.co/JzR5qCC) also re-opened trading on these names on Sunday, which brings to question if these platforms have insider knowledge of the future of the stocks, or did they just increased their liquidity just like [RBNHD](https://ibb.co/P6WXwDj) after they raised more than $1B earlier in the week.\n\nSo… I think the stock market is still very volatile and the short squeezes can keep on going for an unknown period of time as markets can act in an unusual pattern for longer than anyone can anticipate, or the short squeeze can vanish in a second… this one is very hard to predict… Yes, keep the pedal to the medal in the hot stocks🚀🚀🚀🚀🚀 but also stay invested in great companies as good earnings reports haven’t helped most stocks again this quarter, but may provide good buying opportunities for the long-term.🚀🚀\n\nAnd finally, let’s hope for a good day in the markets as the US [FUTURES](https://ibb.co/wc2P16r) are pointing to a good open with the Nasdaq leading the way as we await to see the Manufacturing Indexes numbers in the early [morning](https://ibb.co/LvYY84v).\n\n**Thank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗**",
        "subreddit": "wallstreetbets",
        "title": "Stock Market News for Today | Is the Short Squeeze Over? NIO &amp; other Stock Market News [02-01]🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la2oov/stock_market_news_for_today_is_the_short_squeeze/",
        "created": 1612213750.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612183681,
        "id": "la2awb",
        "num_comments": 45,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "AMD DD / Stock Analysis 🚀🚀🚀 [Technical, Fundamental &amp; DCF] &amp; $AMD Stock Forecast [Short &amp; Long Term]🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la2awb/amd_dd_stock_analysis_technical_fundamental_dcf/",
        "created": 1612212481.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612173271,
        "id": "l9zpga",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "AMD is getting bullied, can WSB help? Make AMD Green Again!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9zpga/amd_is_getting_bullied_can_wsb_help_make_amd/",
        "created": 1612202071.0
    },
    {
        "author": "austinstain",
        "created_utc": 1612188394,
        "id": "la3smm",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD: Time to Buy This Hot Growth Stock | The Motley Fool",
        "url": "https://www.fool.com/investing/2021/01/31/amd-time-to-buy-this-hot-growth-stock/?source=eptyholnk0000202&amp;utm_source=yahoo-host&amp;utm_medium=feed&amp;utm_campaign=article&amp;yptr=yahoo",
        "created": 1612217194.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612184952,
        "id": "la2opd",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**Stocks end their worst week since October at their lowest point on Friday. Is the Short-Squeeze Over? Over 100 companies report earnings this week. Let’s talk about this &amp; other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of Friday as we saw the stock market finish with another sell-off, as the big 3 indices finished with the worst week since late October with the [SP500](https://ibb.co/Vpq92y3) losing almost 2%, the [Nasdaq Composite](https://ibb.co/yN3b3RQ) losing exactly 2% and the [Dow Jones](https://ibb.co/D7Cy2YQ) shedding 620 points and dropping below 30k. All 3 of them finished the week down more than 3% as the [VIX](https://ibb.co/cgz4N3r) spiked yet again on Friday, rising by almost 10% and finishing the week up more than 40%.\n\nWe saw over 70% of the companies declining [Friday](https://ibb.co/G3rX22D), as the number of companies trading above the 50-day moving average dropped under 50%, with all 11 [sectors](https://ibb.co/HKhY6hC) finishing in the red again, as Energy &amp; Tech were the biggest losers. \n\nSo, let’s take a look at the HEAT MAP from [Friday](https://ibb.co/jVFqVbH). It’s really hard to find any gaining companies, with big tech companies selling off yet again, as most of the small gainers were found in the Health Care sector. For the [WEEK](https://ibb.co/5Y5HR4q)  though, Microsoft was the only big tech name that managed to gain ground after smashing the earnings report, while most of the stock market faced sell-off pressures as the short squeeze mania might have pushed investors into a risk-off approach.\n\nWe also got some economic data on Friday as the December personal disposable [INCOME](https://ibb.co/Khyh7mP) increase by 0.6%, more than expected as this mostly reflected an increase in social benefits &amp; compensations, with the Q4 employment cost [INDEX](https://ibb.co/QcqbM5y) also rising by 0.7% to close out the year.\n\nMeanwhile we saw the Consumer Sentiment [INDEX](https://ibb.co/pX3mFgt) coming in at 79, slightly lower than expected, as this was also seen in the December pending home sales [NUMBER](https://ibb.co/m4tbnWN), which also came in with a 0.3% decrease month/month.\n\nThis week we have somewhat of a quiet economic [CALENDAR](https://ibb.co/LvYY84v), with a couple of interesting numbers through the week, while [EARNINGS](https://ibb.co/rxmpwVK) take center stage yet again, with interesting reports coming from companies like Amazon, Google &amp; Alibaba on Tuesday, while Wednesday we hear from PayPal, Qualcomm &amp; Spotify. We also get earnings reports from some recent favorites like Pinterest, Snap, Ford, Peloton and Penn on Thursday as the earnings season with over 100 companies from the SP500 reporting, might help push the stock market higher after the sell-off last week.\n\nIn some other stock market news, we saw [NIO](https://ibb.co/C0CSdJJ) reporting a new monthly record with 7225 vehicles delivered in the first month of 2021, an increase of more than 350% Y/Y as the company is still ramping up production in an attempt to challenge Tesla’s EV dominance. Nio has had a huge run in the past months but has a long way to go to grow into the big valuation, though the trajectory of the company looks very promising.\n\nMeanwhile the biggest development in the markets was the trading platforms [imposing](https://ibb.co/y5sPVJv) restrictions on the squeezed stocks and even many other stocks that didn’t have such a big short % of the float with big names like AMD, Starbucks &amp; Moderna being affected. These restrictions were reduced back to only 8 companies [Sunday](https://ibb.co/GV5TKxf), but are still limited to whole share aggregate buy limits on the crowd favorites.\n\nThe recent moves in the stock market have made some big changes in the social world as Steve Cohen deactivate his [Twitter](https://ibb.co/0KK2P59), while a recent [survey](https://ibb.co/Mf6V8tz) showed that more than ¾ of respondents are planning on leaving RBNHD while 13% already did it, with the limiting tactics being probably the biggest reason for retail investors to make this change.\n\nInteractive [Brokers](https://ibb.co/JzR5qCC) also re-opened trading on these names on Sunday, which brings to question if these platforms have insider knowledge of the future of the stocks, or did they just increased their liquidity just like [RBNHD](https://ibb.co/P6WXwDj) after they raised more than $1B earlier in the week.\n\nSo… I think the stock market is still very volatile and the short squeezes can keep on going for an unknown period of time as markets can act in an unusual pattern for longer than anyone can anticipate, or the short squeeze can vanish in a second… this one is very hard to predict… Yes, keep the pedal to the medal in the hot stocks but also stay invested in great companies as good earnings reports haven’t helped most stocks again this quarter, but may provide good buying opportunities for the long-term.\n\nAnd finally, let’s hope for a good day in the markets as the US [FUTURES](https://ibb.co/wc2P16r) are pointing to a good open with the Nasdaq leading the way as we await to see the Manufacturing Indexes numbers in the early [morning](https://ibb.co/LvYY84v).\n\n**Thank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗**",
        "subreddit": "StockMarket",
        "title": "Stock Market News for Today | Is the Short Squeeze Over? NIO &amp; other Stock Market News [02-01]",
        "url": "https://www.reddit.com/r/StockMarket/comments/la2opd/stock_market_news_for_today_is_the_short_squeeze/",
        "created": 1612213752.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612184951,
        "id": "la2op6",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Stocks end their worst week since October at their lowest point on Friday. Is the Short-Squeeze Over? Over 100 companies report earnings this week. Let’s talk about this &amp; other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of Friday as we saw the stock market finish with another sell-off, as the big 3 indices finished with the worst week since late October with the [SP500](https://ibb.co/Vpq92y3) losing almost 2%, the [Nasdaq Composite](https://ibb.co/yN3b3RQ) losing exactly 2% and the [Dow Jones](https://ibb.co/D7Cy2YQ) shedding 620 points and dropping below 30k. All 3 of them finished the week down more than 3% as the [VIX](https://ibb.co/cgz4N3r) spiked yet again on Friday, rising by almost 10% and finishing the week up more than 40%.\n\nWe saw over 70% of the companies declining [Friday](https://ibb.co/G3rX22D), as the number of companies trading above the 50-day moving average dropped under 50%, with all 11 [sectors](https://ibb.co/HKhY6hC) finishing in the red again, as Energy &amp; Tech were the biggest losers. \n\nSo, let’s take a look at the HEAT MAP from [Friday](https://ibb.co/jVFqVbH). It’s really hard to find any gaining companies, with big tech companies selling off yet again, as most of the small gainers were found in the Health Care sector. For the [WEEK](https://ibb.co/5Y5HR4q)  though, Microsoft was the only big tech name that managed to gain ground after smashing the earnings report, while most of the stock market faced sell-off pressures as the short squeeze mania might have pushed investors into a risk-off approach.\n\nWe also got some economic data on Friday as the December personal disposable [INCOME](https://ibb.co/Khyh7mP) increase by 0.6%, more than expected as this mostly reflected an increase in social benefits &amp; compensations, with the Q4 employment cost [INDEX](https://ibb.co/QcqbM5y) also rising by 0.7% to close out the year.\n\nMeanwhile we saw the Consumer Sentiment [INDEX](https://ibb.co/pX3mFgt) coming in at 79, slightly lower than expected, as this was also seen in the December pending home sales [NUMBER](https://ibb.co/m4tbnWN), which also came in with a 0.3% decrease month/month.\n\nThis week we have somewhat of a quiet economic [CALENDAR](https://ibb.co/LvYY84v), with a couple of interesting numbers through the week, while [EARNINGS](https://ibb.co/rxmpwVK) take center stage yet again, with interesting reports coming from companies like Amazon, Google &amp; Alibaba on Tuesday, while Wednesday we hear from PayPal, Qualcomm &amp; Spotify. We also get earnings reports from some recent favorites like Pinterest, Snap, Ford, Peloton and Penn on Thursday as the earnings season with over 100 companies from the SP500 reporting, might help push the stock market higher after the sell-off last week.\n\nIn some other stock market news, we saw [NIO](https://ibb.co/C0CSdJJ) reporting a new monthly record with 7225 vehicles delivered in the first month of 2021, an increase of more than 350% Y/Y as the company is still ramping up production in an attempt to challenge Tesla’s EV dominance. Nio has had a huge run in the past months but has a long way to go to grow into the big valuation, though the trajectory of the company looks very promising.\n\nMeanwhile the biggest development in the markets was the trading platforms [imposing](https://ibb.co/y5sPVJv) restrictions on the squeezed stocks and even many other stocks that didn’t have such a big short % of the float with big names like AMD, Starbucks &amp; Moderna being affected. These restrictions were reduced back to only 8 companies [Sunday](https://ibb.co/GV5TKxf), but are still limited to whole share aggregate buy limits on the crowd favorites.\n\nThe recent moves in the stock market have made some big changes in the social world as Steve Cohen deactivate his [Twitter](https://ibb.co/0KK2P59), while a recent [survey](https://ibb.co/Mf6V8tz) showed that more than ¾ of respondents are planning on leaving RBNHD while 13% already did it, with the limiting tactics being probably the biggest reason for retail investors to make this change.\n\nInteractive [Brokers](https://ibb.co/JzR5qCC) also re-opened trading on these names on Sunday, which brings to question if these platforms have insider knowledge of the future of the stocks, or did they just increased their liquidity just like [RBNHD](https://ibb.co/P6WXwDj) after they raised more than $1B earlier in the week.\n\nSo… I think the stock market is still very volatile and the short squeezes can keep on going for an unknown period of time as markets can act in an unusual pattern for longer than anyone can anticipate, or the short squeeze can vanish in a second… this one is very hard to predict… Yes, keep the pedal to the medal in the hot stocks but also stay invested in great companies as good earnings reports haven’t helped most stocks again this quarter, but may provide good buying opportunities for the long-term.\n\nAnd finally, let’s hope for a good day in the markets as the US [FUTURES](https://ibb.co/wc2P16r) are pointing to a good open with the Nasdaq leading the way as we await to see the Manufacturing Indexes numbers in the early [morning](https://ibb.co/LvYY84v).\n\n**Thank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗**",
        "subreddit": "stocks",
        "title": "Stock Market News for Today | Is the Short Squeeze Over? NIO &amp; other Stock Market News [02-01]",
        "url": "https://www.reddit.com/r/stocks/comments/la2op6/stock_market_news_for_today_is_the_short_squeeze/",
        "created": 1612213751.0
    },
    {
        "author": "Illustrious_Mine1622",
        "created_utc": 1612183371,
        "id": "la27r6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Why is AMD so heavily shorted? Who wants to squeeze it?? 💫",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la27r6/why_is_amd_so_heavily_shorted_who_wants_to/",
        "created": 1612212171.0
    },
    {
        "author": "touchinmuhjunks",
        "created_utc": 1612192143,
        "id": "la56f9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "fuck silver AMD is ripe for the bear fucking",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la56f9/fuck_silver_amd_is_ripe_for_the_bear_fucking/",
        "created": 1612220943.0
    },
    {
        "author": "rollTide199",
        "created_utc": 1612192348,
        "id": "la59h1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "LIQUIDATED MY ENTIRE PORTFOLIO AMD PUT IT IN GME IN THE DIP 🚀🚀🚀🚀 Let’s fucking ride",
        "url": "https://i.redd.it/jfi5s872uve61.jpg",
        "created": 1612221148.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612189280,
        "id": "la43hb",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "IF $AMD reaches 100$",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la43hb/if_amd_reaches_100/",
        "created": 1612218080.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612183875,
        "id": "la2ctv",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "stocks",
        "title": "AMD Stock Price Target Prediction &amp; Analysis [Technical, Fundamental &amp; DCF]",
        "url": "https://www.reddit.com/r/stocks/comments/la2ctv/amd_stock_price_target_prediction_analysis/",
        "created": 1612212675.0
    },
    {
        "author": "The_Veluth",
        "created_utc": 1612191946,
        "id": "la53ip",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Let's get AMD to $100",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la53ip/lets_get_amd_to_100/",
        "created": 1612220746.0
    },
    {
        "author": "Ultramen",
        "created_utc": 1612184740,
        "id": "la2mft",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Bought GME at the top to support you guys, now what? AMC, AMD NOK?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la2mft/bought_gme_at_the_top_to_support_you_guys_now/",
        "created": 1612213540.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612179316,
        "id": "la15rq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "Wallstreetbetsnew",
        "title": "Thoughts on AMD",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/la15rq/thoughts_on_amd/",
        "created": 1612208116.0
    },
    {
        "author": "Necessary_Ad5463",
        "created_utc": 1612175120,
        "id": "la05fv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Bought 500 AMC AMD 100 MAC my first trades pre market",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la05fv/bought_500_amc_amd_100_mac_my_first_trades_pre/",
        "created": 1612203920.0
    },
    {
        "author": "CRE-Invest",
        "created_utc": 1612183097,
        "id": "la24wl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD Squeeze",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la24wl/amd_squeeze/",
        "created": 1612211897.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612183365,
        "id": "la27oz",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "The hedge funds have doubled down on AMD and pressured down value by several billion USD last week, now Robin Hood disabled purchase of AMD shares.🌰🌰🌰🌰",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la27oz/the_hedge_funds_have_doubled_down_on_amd_and/",
        "created": 1612212165.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612182831,
        "id": "la22bq",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "Buy AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la22bq/buy_amd/",
        "created": 1612211631.0
    },
    {
        "author": "Educational_Peak_334",
        "created_utc": 1612183048,
        "id": "la24gv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "amd stock lets get it moving up great earning",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la24gv/amd_stock_lets_get_it_moving_up_great_earning/",
        "created": 1612211848.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612170746,
        "id": "l9z4ds",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "DONT LET THEM FUCK WITH OUR E-GAMING RIGS. HODL AMD AND NVDA 🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9z4ds/dont_let_them_fuck_with_our_egaming_rigs_hodl_amd/",
        "created": 1612199546.0
    },
    {
        "author": "XGenRocks54321",
        "created_utc": 1612181187,
        "id": "la1n38",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD to the Moon....",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la1n38/amd_to_the_moon/",
        "created": 1612209987.0
    },
    {
        "author": "Aggravating-Ad5500",
        "created_utc": 1612178201,
        "id": "la0vzo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Why nobody take interest in AMD. Cut reinforcement and destroy the enemy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la0vzo/why_nobody_take_interest_in_amd_cut_reinforcement/",
        "created": 1612207001.0
    },
    {
        "author": "Sebbeowns",
        "created_utc": 1612172640,
        "id": "l9zk5p",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "[BREAKING] AMD has oficially joined the stonk wars, This by Robinhood limiting purchase of AMD stonks to 1 stonk/person and the Short interest ratio increasing by ~20%. Time to show theese hedgefunds how retarded we gamers and degenerates can get. Lets show them that we like the stonks💎👐 🚀🚀🚀",
        "url": "https://www.reddit.com/gallery/l9zk5p",
        "created": 1612201440.0
    },
    {
        "author": "StockJunky21",
        "created_utc": 1612176724,
        "id": "la0iww",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "BB amd ATOS???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la0iww/bb_amd_atos/",
        "created": 1612205524.0
    },
    {
        "author": "YebacPiS",
        "created_utc": 1612170115,
        "id": "l9yyxe",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "go for AMD comrades !!! even Motley recommends",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9yyxe/go_for_amd_comrades_even_motley_recommends/",
        "created": 1612198915.0
    },
    {
        "author": "Envictus7",
        "created_utc": 1612190630,
        "id": "la4kvp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I am a retard and I have $AMD YOLO, is there a even a slight chance we could just all buy AMD for my sake pls pls pls pls pls.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4kvp/i_am_a_retard_and_i_have_amd_yolo_is_there_a_even/",
        "created": 1612219430.0
    },
    {
        "author": "Cap-Kaz-354",
        "created_utc": 1612191099,
        "id": "la4r6n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD - Short Squeeze? - 71M Shares Shorted",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4r6n/amd_short_squeeze_71m_shares_shorted/",
        "created": 1612219899.0
    },
    {
        "author": "Cap-Kaz-354",
        "created_utc": 1612191555,
        "id": "la4xg4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4xg4/amd/",
        "created": 1612220355.0
    },
    {
        "author": "Cap-Kaz-354",
        "created_utc": 1612191219,
        "id": "la4suy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD - 71M Shorts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4suy/amd_71m_shorts/",
        "created": 1612220019.0
    },
    {
        "author": "elontuskstoothbrush",
        "created_utc": 1612191344,
        "id": "la4ula",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD opportunity",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4ula/amd_opportunity/",
        "created": 1612220144.0
    },
    {
        "author": "poopooooooooocccxx",
        "created_utc": 1612192239,
        "id": "la57wt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "There is no way people are shorting AMD.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la57wt/there_is_no_way_people_are_shorting_amd/",
        "created": 1612221039.0
    },
    {
        "author": "vtl888",
        "created_utc": 1612177153,
        "id": "la0mgh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD and Hedge Funds",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la0mgh/amd_and_hedge_funds/",
        "created": 1612205953.0
    },
    {
        "author": "LowValueTrading",
        "created_utc": 1612191697,
        "id": "la4zsv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Not quite a YOLO, but I sold all my stonks aside from AMD to put into GME and AMC",
        "url": "https://i.redd.it/p861cehvrve61.png",
        "created": 1612220497.0
    },
    {
        "author": "rexuhn",
        "created_utc": 1612190331,
        "id": "la4gsv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$AMD - perfect time to buy at the dip",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4gsv/amd_perfect_time_to_buy_at_the_dip/",
        "created": 1612219131.0
    },
    {
        "author": "Volcano-squared",
        "created_utc": 1612176328,
        "id": "la0fkp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$AMD is looking pretty boss.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la0fkp/amd_is_looking_pretty_boss/",
        "created": 1612205128.0
    },
    {
        "author": "The_Downtown_Funk_2",
        "created_utc": 1612191420,
        "id": "la4vmf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMC CASH APP TRADES ARE PENDING! IT WITH EXPLODE!!!! BUY AMD HOLD!!!! APES TOGETHER STRONG!!🦍🦍🦍",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4vmf/amc_cash_app_trades_are_pending_it_with_explode/",
        "created": 1612220220.0
    }
]