[
    {
        "author": "Polytroposphere",
        "created_utc": 1614892316,
        "id": "lxvjxv",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "You've probably heard the news by now that 6 Dr Seuss books will no longer be published for imagery that has been deemed racist. Regardless of your political beliefs, we're all here to make MONEY. Basic supply and demand indicates that discontinued books will skyrocket in value if demand increases. Sure enough, within two days, these banned Dr Seuss books are now worth their weight in [fucking gold](https://www.cbr.com/dr-seuss-banned-books-sell-high-pries-seconday-market/).\n\nHere's a breakdown by numbers. I'm using data from Barnes and Noble online to establish the normal hardcover price, and then the lowest price on Amazon to establish approximate selling price after it was announced that they will no longer be published:\n\n* The Cat's Quizzer\n   * $9.99 ---&gt; $499.99 **(4,905% increase)**\n* If I Ran the Zoo\n   * $17.99 ---&gt; $594.00 **(3,202% increase)**\n* On Beyond Zebra\n   * $16.99 ---&gt; $425.25 **(2,403% increase)**\n* Scrambled Eggs Super\n   * $14.75 ---&gt; $325.00 **(2,103% increase)**\n* McElligot's Pool\n   * $19.99 ---&gt; $325.00 **(1,526% increase)**\n* And to Think That I Saw it on Mulberry Street\n   * $16.99 ---&gt; $224.25 **(1,220% increase)**\n\nEvery single one of these is a literal ten-bagger. What's even more crazy is that this [Insider article](https://www.insider.com/classic-childrens-books-that-havent-aged-well-2019-5#if-i-ran-the-zoo-by-theodor-seuss-geisel-aka-dr-seuss-has-been-criticized-for-containing-numerous-offensive-images-1) sort of called it almost two years ago—the first book on their list is If I Ran the Zoo. In addition to the above mentioned Insider article, I looked through several lists of books that are being challenged for racial content. My analysis leads me to believe that *The Indian in the Cupboard* by Lynne Reid Banks, currently being published by Harper Collins, is a prime candidate for a discontinued book squeeze. Here's why:\n\n1. **Low Search Volume**. Here's a Google trends graph of how often the recalled Dr Seuss books were searched for on Amazon. \n\nhttps://preview.redd.it/d178buhtl2l61.png?width=2322&amp;format=png&amp;auto=webp&amp;s=4ad443bc373d439abe34e87d8fbd8c8d04ffd32a\n\nNotice how there's nobody trying to buy these books? This makes sense. No publisher in their right mind would discontinue a popular children's book. This is why books like *The Cat in the Hat* or *Peter Pan*, which have also been criticized, will never go out of print. It would be a financial nightmare.\n\nIn contrast, look at how Indian in the Cupboard stacks up against some other contenders:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1xe9dbpun2l61.png?width=2306&amp;format=png&amp;auto=webp&amp;s=01e3995810de807ae599684cd690ba7efc2149b7\n\nIf you follow the red trendline, you will see that searches for \"Indian in the Cupboard Amazon\" are effectively 0 with some slight upticks every now and then. This contrasts with Amazon searches for titles like Little House on the Prairie, which sees consistent search frequency. Discontinuing further printings of The Indian in the Cupboard will probably have little impact on HarperCollins' margins.\n\n2. **Broad readership base, particularly among middle-aged readers.** In addition to being discontinued, a book will need to have excess demand before the price will surge. This will happen only if the book has a broad readership base. In Dr Seuss's case, so many adults have probably read at least one of the 6 discontinued books growing up (hell I loved Mulberry Street when I was little), which is why they're actually buying up these books now that they've become limited edition items. It probably helps that Dr Seuss wrote his books to help children read and literally every elementary school still uses his writing to teach literacy skills.\n\nSimilarly, *The Indian in the Cupboard* was actually well-received in the 80s and was incorporated into school curriculums nationwide. You can still find entire teaching guides built around *The Indian in the Cupboard*, and I distinctly remember reading this book and filling out worksheets back in third grade 2009. Yeah, this book isn't as popular as it once was, but I'm willing to bet that in the 40 years that it's been out, it's been able to build a solid fanbase of readers who will buy a copy out of nostalgia once this book gets banned. This also gives *The Indian in the Cupboard* an advantage over books like *Pippi Longstocking,* which—despite being a children's book with low search volume—is beloved in Sweden but has a much smaller audience in America.\n\n3. **History of contentious debate.** The controversy over Dr Seuss's books didn't just happen overnight (although it certainly felt that way). His books have been banned in libraries for years and there are [arguments](https://www.nbcnews.com/news/nbcblk/reckoning-dr-seuss-racist-imagery-has-been-years-making-n1259330) going all the way back to the 90s about whether his books are racist. This is the same situation that *The Indian in the Cupboard* finds itself in. It's been removed from numerous public libraries and the American Library Association leadership advised educators to avoid the book as far back as 1991. This is important because the decision to remove books is typically time-sensitive. Given almost 30 years to consider whether or not to discontinue publishing, Harper Collins likely has enough financial data and a good picture of consumer preferences, especially under the current political climate, to decide that they will stop further publications of *The Indian in The Cupboard*. \n\nIt's important to keep in mind that there is significantly less liquidity with trading books than stocks. However, books are still less volatile and, like art pieces, tend to appreciate in value over time. I think that *The Indian in the Cupboard* is a long-term hold which has the potential to increase ten fold when it inevitably gets pulled from circulation.",
        "subreddit": "wallstreetbets",
        "title": "Banned/Discontinued Book Investing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxvjxv/banneddiscontinued_book_investing/",
        "created": 1614921116.0
    },
    {
        "author": "Liftasaurusrex",
        "created_utc": 1614813723,
        "id": "lx75uz",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Okay so here are my thoughts. Behind Nestle, PepsiCo is the biggest company in it's sector by revenue. It also follows Coke stock fairly closely. But what made the difference this last year was how these two comparable soda giants fared during covid 19.\n\nKO or Coke performed extremely poorly and made less money yoy. It's payout ratio for its dividend was touching 94%. Meaning they only had 6% left over after paying out their shareholders. That's not a lot of money to do much of anything with. ESPECIALLY in an industry that needs to move towards new products with the decline in popularity of Soda.\n\nTo compare with PepsiCo, which even during the pandemic found a way to make more revenue in 2020 than in 2019.\n\nTo give you specific numbers, in 2018 was an increase in total revenue by 1.79% compared to 2017. In 2019 it increased 3.87% compared to 2018, and in 2020 increased a 4.78% which might I remind you that this increase happened during the pandemic. Now why did PepsiCo do well against their main rival coke?\n\nTo answer this in simple terms their portfolio was more diversified than coke's and they focused on releasing new and more popular products as well as packaged food which saw a huge boost in sales from \"Toilet Paper Bandits\" or panic shoppers stocking up on bags of fritos, lays, cheetos, and on the healthier side of things Quaker Oats and other products. Until recently most people thought coke stock was king between the two companies but I believe 2020 may have put pepsi on the podium as our clear winner of the Cola Wars.\n\nPepsi has a dividend yield of 3.12% and a payout ratio of 79.88%\n\nCoke has a dividend yield of 3.35% and a payout ratio of 93.85%\n\nWith the payout ratios so high I am a little concerned for dividend increases for both but I would be shocked if coke raised it any more than they had to to keep their dividend status.\n\nShare price:\n\nI see PepsiCo valued at $154.36 a share\nTrevis Evaluation puts then at $150.16 which I believe is low but close to a 20 dollar per share increase or more either way.\n\nThis is an upside of 18.46% not including dividends.\n\nAnd I calculated Coke to be valued at $52.72 a share.\nTrevis Evaluation puts it at $55.48 which is more than I calculated.\n\nTaking the higher of the two numbers this leave a share price upside of around 11.00%\n\nThere are many other reasons I believe Pepsi is going to be the better long term pick like how they released the new cocktail mixers neon Zebra (which I would love to try) to take some of the cocktail mixer marketshare. Which the mixer market tops 858 MM$ and an industry that grew 35% just last year. Cocktail culture is coming to North America and in the United States and Canada we are heavily accepting these delicious mixers that are premade and easy to make.\n\nWhat are your thoughts on these two companies or their sectors in general? Do you think PepsiCo is undervalued? Or do you think Coke is still a better buy? Let me know in the comments.\n\nDisclaimer: I am Long PepsiCo and hold positions in the stock mentioned above.",
        "subreddit": "wallstreetbets",
        "title": "PepsiCo (PEP): Is the Market undervaluing this Dividend Staple?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx75uz/pepsico_pep_is_the_market_undervaluing_this/",
        "created": 1614842523.0
    },
    {
        "author": "emoneynati",
        "created_utc": 1614775120,
        "id": "lwsxde",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Has This Sub Seen the RH Parody Ad by Zebra Corner??? Don't let their support stay at such relatively low views!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwsxde/has_this_sub_seen_the_rh_parody_ad_by_zebra/",
        "created": 1614803920.0
    },
    {
        "author": "Shonnnard",
        "created_utc": 1618705937,
        "id": "mt2mht",
        "num_comments": 169,
        "num_crossposts": 0,
        "selftext": "I'm looking for real Pennystock analysis.  Not another bogus P&amp;D looking for unwitting investors to buy something to create the \"allusion\" of value.  Nothing irks me more than retail pumps entrapping traders/flippers/idiots who are looking to buy high to sell higher and then cry when they're caught holding the bag.\n\n&amp;#x200B;\n\nAnyone here tracking microchip names that have real businesses and are under-under the radar, if you're that person, I'd love to hear what you have to say, and eliminate the crappy noise.\n\n&amp;#x200B;\n\nHere's my micro play:  $KGKG KonaGold.  Florida based infused cannabis beverage manufacturer.  Almost fully reporting with about 750,000,000 shares outstanding and about $1,000,000 in sales.  I believe they have great potential and are trading at 3c.  Own 200k shares.\n\n&amp;#x200B;\n\nBe good and good luck!\n\n&amp;#x200B;\n\nSho",
        "subreddit": "pennystocks",
        "title": "anyone here with legit penny names that aren't up 1000%",
        "url": "https://www.reddit.com/r/pennystocks/comments/mt2mht/anyone_here_with_legit_penny_names_that_arent_up/",
        "created": 1618734737.0
    },
    {
        "author": "Evening-General",
        "created_utc": 1617660513,
        "id": "mkw9b3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Canada's 5N Plus takes on the global microchip shortage",
        "url": "https://ca.finance.yahoo.com/news/canadas-5-n-plus-microchip-shortage-steven-ladurantaye-152513539.html",
        "created": 1617689313.0
    },
    {
        "author": "ThickPersonalitywpg",
        "created_utc": 1617651570,
        "id": "mksz40",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "CanadianInvestor",
        "title": "Canada's 5N Plus takes on the global microchip shortage",
        "url": "https://ca.finance.yahoo.com/news/canadas-5-n-plus-microchip-shortage-steven-ladurantaye-152513539.html",
        "created": 1617680370.0
    },
    {
        "author": "Darkseid-earth-prime",
        "created_utc": 1617306217,
        "id": "mi3apr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So, here we are to talk about the SHORTAGE of tiny shards of potato chips in the bottom of Lays bags.  \n\nBut seriously, I want to talk about what the global microchip shortage means in the market, there are good possibilities in tech right now with demand so high, and we are possibly moving toward one of the biggest technological revolutions the market and world has seen.",
        "subreddit": "wallstreetbets",
        "title": "GLOBAL MICROCHIP SHORTAGE DISCUSSION",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mi3apr/global_microchip_shortage_discussion/",
        "created": 1617335017.0
    },
    {
        "author": "wsb_shitposting",
        "created_utc": 1617285307,
        "id": "mhvteb",
        "num_comments": 483,
        "num_crossposts": 0,
        "selftext": "Every single day this month, I tried to do the one thing that everybody says you shouldn't try to do. I tried predict the exact daily movements of the stock market -- specifically, the daily direction, high, and low of the NASDAQ -- and posted my best guess in the daily discussion forum.\n\nI had to pay incredibly close attention to the stock market every day to do it. Every single morning, I did technical and market analysis to try to keep from publicly embarrassing myself. I learned more about the stock market this month than I have in my entire time trading.\n\nTo celebrate one month of predictions, I wanted to take a look back at the month of March and share some of the things I've learned.\n\nHere's the first one:\n\n**I can't predict the stock market.**\n\n*Damn it.* I really thought I'd be able to do it.\n\nYou can see my [full scorecard here](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/MkMAC), but it isn't really anything to brag about. Here's how I did:\n\n* **Direction:** 65% correct\n* **Daily high:** Median error of 0.26%\n* **Daily low:** Median error of 0.36%\n\nI was always more interested in the highs and lows than the direction, but *damn* is 65% ever a bad score. I've looked into it -- if I'd just predicted whatever the premarket said, I would've been right 74% of the time.\n\nPart of the problem was this:\n\n**When J. Powell talks, there's a 66% chance the market will tank.**\n\nWhen J. Powell talked, my prediction was wrong more often than it was right -- and usually by a lot. On average, my prediction for the daily low was off by 1.37% whenever he spoke.\n\nI wanted to look into that, so I tested out some of the big narratives we heard this month\n\n[Click here to see that research visualized.](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/HORAC)\n\nJ. Powell used to be able to pump the market -- but since 2020, I learned, the market has turned red on 66% of the days that he has either made a speech or a public testimony, with the market closing, on average, down 1.24%.\n\n**The NASDAQ is often a better predictor of a stock's price than the company itself.**\n\nI've seen a lot of posts here lately saying: \"Why is everybody talking about indexes? Isn't this supposed to be a stock forum?\"\n\nOne thing this month affirmed for me is that, if you want to know what AAPL or MSFT are going to do today, you have to look at the market itself first.\n\nAAPL, MSFT, GOOG, and AMZN were all extremely correlated with the NASDAQ this month, to the point that, statistically speaking, it can be said that 81% of the variations in Apple's price this month can be explained by changes in the NASDAQ.\n\nI saw a lot of people in the daily discussion asking: \"Why is AAPL tanking? What new is there?\" But -- unless there actually is company news -- that's often the wrong question to ask. \n\n**The market isn't always affected by what CNBC says...**\n\nOne of the biggest stories we heard this month was about the \"bond yield\". The 10-year bond yield went up today, CNBC would report, and so the NASDAQ was sure to tank.\n\nIt never really made sense to a lot of investors -- so I looked into whether that story held up.\n\nI'll let you draw your own conclusions, but here's what I can say for sure:\n\n* There was no statistically significant correlation between the 10-year bond yield and the NASDAQ's price in March\n* If there were one, it would be a positive correlation. When the bond yield went up, it was more likely that the NASDAQ would go up with it than down.\n* There was more of a correlation on days when the bond yield reached a new 12-month high -- but only if the new yield was heavily reported. If it went unmentioned, the NASDAQ went up.\n* The days when the bond yield did significantly go up and the NASDAQ did significantly go down were all days when J. Powell gave a speech\n\n**... but sometimes it is.**\n\nThat doesn't mean everything CNBC said was a lie this year.\n\nAnother huge story this month was the rotation out of tech into value stocks -- and then, at the end of the month, the rotation back.\n\nThis story *totally* holds up. If you plot a tech stock like AAPL's price against JP Morgan's (which I've done for you [here](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/HORAC)), you'll see that, 61% of the time, these stocks went in the exact opposite direction.\n\nPeople really were rotating out of tech and into value -- and they really are starting to come back.\n\n**I still think the stock market can be predicted**\n\nWhen I started doing this, I got a lot of hate from people who said that only an idiot would try to predict the market. But after a while, those hate messages stopped -- and, instead, people started sending me hate messages saying that they could predict the market better than I can.\n\nThey probably can. I didn't do as well as I'd like this month, but, when I was right, I knew *why* I was right. And when I was wrong, I knew *why* I was wrong -- and had a pretty good idea of how to do better next time.\n\nEverything is *not* priced-in, I've learned this month. Take Biden's speech last night. The market didn't even budge while he was talking. Sure, we were in afterhours, but even Robinhood users were allowed to invest -- and his plan had been laid out weeks in advance. But the Wall Street traders were off work, so the market didn't budge until the morning -- when it absolutely mooned.\n\nIf you pay close enough attention, you *can* get ahead of Wall Street. I'm increasingly convinced of that, and I believe that my predictions will get better as time goes on.\n\n[You can see today's prediction here.](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/kHRAC)",
        "subreddit": "stocks",
        "title": "I tried to predict the stock market every day in March. Here's how it went - and what I learned.",
        "url": "https://www.reddit.com/r/stocks/comments/mhvteb/i_tried_to_predict_the_stock_market_every_day_in/",
        "created": 1617314107.0
    },
    {
        "author": "barjay8",
        "created_utc": 1617293013,
        "id": "mhyhj4",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "I am not a financial advisor. I just like the stock.\n\nPositions: 200 Shares / 100 4/16 $30 Calls\n\n**What is CharePoint (CHPT)?**\n\nChargePoint Holdings is an electric vehicle infrastructure company based in Campbell, California. ChargePoint operates the largest online network of independently owned EV charging stations operating in 14 countries and makes the technology used in it\n\n**Financial Analysis:**\n\nString Buy: 40% | Buy: 40% |Hold: 20% \n\nLow: $28.00 | Median: $39.20 | $46.00\n\nFree Float: 7.68B | Free Float: 151.22M | 52 Week High: $49.48\n\n&amp;#x200B;\n\n**Why I Like the Stock**  \n 1. CHPT is the largest provider of EV charging stations in the World with more than 100,000 charging ports . Biden's infrastructure plan calls for 500,000 charging station national wide with a $174B B in the EV market.\n\n[https://www.cnet.com/roadshow/news/biden-infrastructure-plan-ev-rebates-charging-stations/](https://www.cnet.com/roadshow/news/biden-infrastructure-plan-ev-rebates-charging-stations/)\n\n[https://seekingalpha.com/news/3678584-chargepoint-quantumscape-lead-big-gains-in-ev-sector-on-green-tidal-wave-hopes](https://seekingalpha.com/news/3678584-chargepoint-quantumscape-lead-big-gains-in-ev-sector-on-green-tidal-wave-hopes)\n\n2. CHPT owns nearly 75% of the EV Charging market share  \n\n3. CHPT has Strategic Partnerships with MOST major Car Manufacturers  \n\n4. CHPT has hundreds of customers including: \n\n\\- Disney \n\n \\- Google \n\n \\- Facebook \n\n \\- Apple \n\n\\- Microsoft  \n\n\\- Netflix  \n\n\\- Target \n\n\\- Whole Foods (Amazon)  \n\n\\- Johnson &amp; Johnson  \n\n\\- Lyft  \n\n\\- FedEx  \n\n\\- eBay  \n\n\\- GM  \n\n\\- MasterCard \n\n\\- Salesforce  \n\n\\- Uber  \n\n\\- McDonald’s \n\n\\- Chevron\n\n\\- Hundreds More  \n\n5. CHPT is partnered with over 4,000 businesses and organizations  \n\n6. Highly Rated Mobile App  \n\n7. Has over 133,000 public charging points across North America and Europe  \n\n8. Has positive Cash flow of $615 Million  \n\n9. Can charge ANY type of electric vehicle  \n\n10. The Chargepoint app is integrated into Apple CarPlay &amp; Android Auto. It’s also integrated into the navigation systems of BMW, Mercedes, Fiat, Nissan, SiriusXM, &amp; TomTom\n\nTL;DR - Biden's infrastructure calls for 500,000 charging station nation wide with174B dedicated to the EV market.  CHPT is the leading industry and has many major partners. I like the stock. I don't know what I am talking about. I just purchased a lottery ticket.",
        "subreddit": "investing",
        "title": "ChargePoint (CHPT) Due Diligence",
        "url": "https://www.reddit.com/r/investing/comments/mhyhj4/chargepoint_chpt_due_diligence/",
        "created": 1617321813.0
    },
    {
        "author": "uw00wu",
        "created_utc": 1617265219,
        "id": "mhqr0m",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$MSFT $500k YOLO",
        "url": "https://www.reddit.com/gallery/mhqr0m",
        "created": 1617294019.0
    },
    {
        "author": "joe691013",
        "created_utc": 1617279549,
        "id": "mhu2e7",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**Wikisoft Corp (OTC Markets: WSFT)**\n\n**Date: March 31, 2021; current share price: $3.50Mid Term Price Target: $12-$15**\n\n**Company Overview**\n\n*In order to capitalize on current globalization trends, Wikisoft developed a credible online platform for companies and employees in order to serve the growing demand for credible information online. Wikiporfile.com aims to assist businesses and business professionals in order to find valid information in an easy and timely manner, helping them make informed career and hiring decisions. The company’s vision is to become the go to platform for connecting users to business opportunities on a global scale.*\n\n*Share structure: ( according to OTC Markets, via* [*https://www.otcmarkets.com/stock/WSFT/security*](https://www.otcmarkets.com/stock/WSFT/security)*)*\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4nmhhi610kq61.png?width=949&amp;format=png&amp;auto=webp&amp;s=599835133764766749ceb6f074aa80e3c468848d\n\n*Wikisoft was incorporated in Nevada on May 4, 1998, under the name Sensor Technologies, Inc. The company changed its names multiple times, and in March 2018, Bluestar Technologies ultimately became Wikisoft Corp.*\n\n**Management**\n\nMr. Paul Quintal joined the company on August 1, 2020 as Chief Commercial Officer with the main objective to get funding, as he shortly resigned after, in December 2020. He then tool the role as Chairman and Directors, being responsible for corporate governance and investor relations. Mr. Quintal is highly qualified and has extensive experience in search engine technology, as he has worked for companies such as Pentius, Inc., Softbank, Internet.com and Lycos. He was a key member for 2 IPOs, 2 exits via sale and 12 acquisitions &amp; integrations. Specifically, his role at Pentius included leading negotiations for large strategic contracts, managerial guidance, and high-value deal-making.\n\nMr. Carsten Kjems Falk has recently joined Wikisoft Corp, serving as Chief Executive Officer since September 1, 2020, making him responsible for strategy, operations, business development, and all commercial activities. Prior to Wikisoft Corp, Mr. Flak was Chief Executive Officer at Domino’s Pizza DK. Mr. Falk holds a Master’s degree in Mathematics and curriculum studies, and has a proven track record of successfully winning 2 Gazelle Prizes from the leading financial newspaper in Denmark. Also highly relevant, Carsten Falk’s experience could be leveraged at Wikisoft, developing the company into a competitive player in its industry. Mr. Falk has also been awarded twice for the best global online sales by Domino’s International.\n\n**Business Model**\n\nWikisoft’s vision is to become an important player in the business information industry, with Wikiprogile.com. Wikiprofile.com is a portal that provides articles and profiles on companies, business people and corporate influencers. Currently, the website portal is operational in its launched form, however, the company is focused on relaunching the updated format of the website (planned to take place in the Spring 2021). Wikisoft has externalized some of its functions, with developers based in India and IT operations based in Denmark.\n\nWikiprofile.com is built on a modern microservice software stack and is developed in multiple Postgres databases, which represent a main pillar for the platform. The architecture is designed to make the web faster, more secure, easier to scale, and in addition, by using proprietary crawler technology, the databases automatically collect information on newly found entities, seeking to have a complete database. Once relaunched, wikiprofile.com will help users to stay connected and informed, allowing professionals to advance their careers while also allowing business to hire the best professionals and work smarter.\n\nWikisoft is just about to enter into the “growth phase”. After going through the restructuring stage (2017-2019 ), the company went on to build a solid foundation and gear for growth by changing the management team, leveraging their business model, implementing growth strategies. The next period could represent the growth stage, and could be characterized by accelerated growth, becoming a global brand, and capitalizing on the growth opportunities.\n\nIn the long run, Wikisoft plans to disturb the industry when it comes to validation of professional profiles and create new standards, changing the wat people trust digital information. The platform aims to provide trusted information about companies and people, allowing both of them to make the right decision. Wikisoft would engage in a global market worth 479 billion USD, with the United States being the leading country, at 152 billion USD, according to Statista. ( Revenue of global staffing industry 2008-2019 ).\n\nWikisoft believes that they could be a major disruption for the industry, as the company looks to leverage their strengths:\n\n\\- Large global business database that can be used for Marketing &amp; Sales\n\n\\- Highly scalable setup geared towards the future growth journey\n\n\\- Limited operational cost geared for growth\n\n\\- Data crawled, verified &amp; updated daily providing a job market directory for businesses and job seekers\n\n\\- Disruptive business model with low entrance barrier to gain market share\n\nAs Wikisoft is working to relaunch the website portal in its updated format, the company aims to create additional value for their users through four different planned product lines:\n\na) Wiki Business People Profile\n\n\\- Free basic profile, visible to recruiters looking for new employee’s\n\n\\- Additional features such as data insights on profile visitors , financial company information and receiving job proposals are all planned to be available at a cost\n\nb) Wiki Business Profile\n\n\\- Free basic profile, allowing companies to highlight their culture, increase their brand awareness, and\n\n\\- Additional features such as review management and data insights available at a cost\n\nc) Wiki Recruit\n\n\\- Planned to include a free basic profile where recruiters can post jobs\n\n\\- Additional features such as premium ranking, ability to send job proposals directly to job candidates; ( planned to be $19.99 per month for the premium ranking, $29.99 per month for the premium ranking and ability to send direct job proposals )\n\nd) Wiki Company Research\n\n\\- Offer solidity, liquidity and credit reports to make research and ensure right decision making when choosing a new job or supplier\n\nWikisoft plans to generate revenues from premium profiles and recruiting on the website platform, but also by charging users for access to certain information and features on the platform.\n\nOperations plan – timeline, projections:\n\nQ1 2021:\n\n\\- Updated website platform to be launched, including new features and extended profiles of businesses and business professionals;\n\n\\- Mobile version planned to be launched as well, along new investor site on Wikisoft.com\n\n\\- Estimated costs: $40,000\n\nQ2 2021:\n\n\\- commence marketing activities, with the goal of generating users and sign ups; ( main drivers: email, SEM, SEO )\n\n\\- further development if website platform with new features such as reviews, in-mails\n\n\\- having the company’s common stock on the OTC markets OTCQB tier\n\n\\- Estimated costs: $40,000\n\nQ3 2021:\n\n\\- Hiring of marketing managers that will be responsible for optimizing and ensuring KPI driven email, SEM &amp; SEO, and for executing Wikisoft’s marketing strategy\n\n\\- IT development for crawling and fronted development of business logic and products\n\n\\- Estimated costs: $50,000\n\nQ4 2021:\n\n\\- Continue hiring additional developers, hire additional customer care and marketing managers\n\n\\- Develop platform with new features like Jobs and Job Postings\n\n\\- Hire CFO to streamline financial reporting, compliance, investor relations and improve corporate governance\n\n\\- Estimated costs: $70,000\n\nThe industry is evolving with rapid pace, and other companies with significantly bigger financial resources, such as LikedIn, Glassdoor, Facebook, Google, Microsoft, and Twitter could or are developing solutions that compete with Wikisoft. Larger companies could focus on professional networking and directly compete with Wikisoft.\n\nWikisoft is a potential buyout target, ultimately following the footsteps of other similar companies in the industry. LinkedIn was acquired by Microsoft for $26.2 billion; Hired raised $132 million since founding in 2012 +10,000 top companies using Hired employers can reduce time to hire by about 33%; Glassdoor was acquired by Recruit Holdings for $1.2 billion in May 2018. Recruit provides recruiting solutions to 7k+ employers, including about 40% of the Fortune 500.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/earz1h620kq61.png?width=1707&amp;format=png&amp;auto=webp&amp;s=ecbddb859bc3afa1430711612ee19d7540383168\n\nSource: Wikisoft, Management Information, via Information Memorandum\n\nWikisoft will also not have ads on website in order to build brand trust. The company could potentially capture market share through their strong brand recognition and amount of proprietary data. Wikiprofile is rated among the highest in terms of trusted and credible content, while also having a modern IT infrastructure, being e=well organized and integrated for business and consumer applications.\n\n**Risks Factors**\n\n“The Company has generated very little revenue, which was all from a related party, and has incurred losses of $2,888,765 for the year ended December 31, 2019 and $1,954,297 for the year ended December 31, 2020. The Company has incurred an accumulated deficit of $7,583,538 since inception and does not have a sufficient amount of cash required to pay all the costs associated with its operations. Additionally, as of December 31, 2020, the Company had working capital deficit of approximately $23,041. These factors raise substantial doubt about the Company’s ability to continue as a going concern” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\n“The Company seeks to overcome the circumstances that impact its ability to remain a going concern through a combination of the growth of revenues, with interim cash flow deficiencies being addressed through additional equity and debt financing. The Company anticipates raising additional funds through public or private financing, strategic relationships or other arrangements in the near future to support its business operations.” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nWikisoft Corp has little to no history of revenue generation and currently operates at a loss, thus the company is still dependent on financings for the continuation of operations. Also, evaluating and forecasting Wikisoft’s financial performance cannot be done with great accuracy.\n\nMr. Rasmus Refer is the largest shareholder and has substantial control over the company and its policies. As of 03/29/2021, he owns 87.83% of Wikisoft’s common stock. He is also able to exercise significant influence over all matters requiring approval by stockholders.\n\nThe company is extremely likely to conduct offerings of equity in the future, meaning that stockholders would be diluted, as their proportional interest would decrease.\n\nUltimately, the success of the company strictly depends on its ability to develop and commercialize their platform.\n\n**Financials**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5iw9gsb30kq61.png?width=699&amp;format=png&amp;auto=webp&amp;s=60031b8d95e5bd77e95da6f4a87455fd8fe839f9\n\n&amp;#x200B;\n\nhttps://preview.redd.it/iwcbz0i40kq61.png?width=791&amp;format=png&amp;auto=webp&amp;s=e0fd15c9d2f143e58167e70f1263d49887b8f637\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wh1yqm850kq61.png?width=794&amp;format=png&amp;auto=webp&amp;s=3efc2c86bf7e92f4d38ea367fb117315c6dde264\n\nSource: ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nEven though there is little to no financial data that could be analyzed, Wikisoft represents a huge opportunity for investors, as the company is poised for growth in the near future. Although it is too early to make accurate price target estimates and projections, if the Wikisoft’s management team is successful in leveraging their growth strategies, Wikisoft could become a billion dollar capped company sometime In the next 3-6 years, possibly resulting in a 600% return on investment. As soon as the updated version of the online portal is launched and additional features are added, the company will initiate their marketing strategies, and around that time (expected to be in the fourth quarter of 2021), investors should start seeing revenues and cash flows from operations increasing. By that time, Wikisoft ( if nr. of shares outstanding remains the same), should be trading around $12-$15 per share. Overall, I am optimistic about Wikisoft’s long term prospects, and assign the company a BUY rating.\n\nDisclaimer: I assume no responsibility or liability for any errors or omissions in the content of the report. Any person or entity will be solely responsible for the consequences of the data, analysis, and findings of the report are used for decision making.",
        "subreddit": "pennystocks",
        "title": "WSFT Due Diligence",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhu2e7/wsft_due_diligence/",
        "created": 1617308349.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1617268735,
        "id": "mhrha8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Paysafe has finally just gone public with a new Board of Directors, much less debt, lots more cash, new M&amp;A plans and a new ticker: PSFE During yesterday's ticker change, there were several reports of people having no access to their accounts and/or suddenly being faced with an abrupt change in margin requirements from 25% to 100%. Many suggest this was intentional manipulation to give institutions cheaper shares. Regardless, this may have created a good buying opportunity for us too. For those interested, here's some comprehensive DD.\n\nPaysafe is a unique combination of fintech, iGaming, sports betting and banking all rolled into one stock. Whether you like him or not, this is essentially why NBC’s Jim Cramer recently said, “There is something about Paysafe that may be the ultimate stock for this moment.” (video link below) Market analyst Steve Grasso says, “It’s the most excited I’ve been about a stock in a long time.” Grasso, by the way, has repeated called for it to triple ($45-50). So why is that?\n\nPaysafe offers a scalable electronic payment platform used by Draftkings, Roblox, Spotify, eToro, Fortnight, Coinbase, Amazon, Twitch, EA, 888, ApplePay, Youtube, Visa, Microsoft, Xbox, Amelco, William Hill, Ceasar's, Betfair, Pokerstars, PayLease, ESL Gaming, Luckbox, bet365, Lotto among many others.\n\nPaysafe is ranked No. 2 globally in the digital wallet space with presence in 120 countries and No. 4 globally in integrated merchant processing.\n\nImportantly, Paysafe is the No. 1 global leader in iGaming eCash network (currently 36% of revenue) with 10-15X growth projected. US iGaming continues to be legalized state by state, growing revenue by 234% in just the last year. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”\n\nPaysafe is enabled for digital currency (a type that shall not be mentioned in these parts) without having to go through fiat. It recently partnered with Coinbase to expand options in US and it just launched PaysafeCash in US. (Now in 40 currencies and 30 global markets enabling easier cross border payments.)\n\nPerhaps most central to this recent merger is Bill Foley, Fidelity’s Chairman of the Board and now the Chairman of Paysafe, who has a proven track record for generating exponential synergistic inorganic growth. For example, in just the last five years, he grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X) and he says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.”\n\nOf their expansion plans Foley says, “We’ve got a wide landscape we can attack. It’s pretty exciting.” “It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else.” “I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody. That’s why I got so excited about Paysafe Group Holdings Limited as its position in iGaming is really second to none.” “Whether it’s a lottery or slot machines or sportsbetting opening in a state, it’s our job to be there first and to make sure we dominate. We’re focusing on gaming, particularly sportsbetting, in the United States as it becomes legal and we’ve got a wide landscape we can attack. It’s pretty exciting.”\n\nAlong with Bill Foley, Paysafe's newly announced Board of Directors includes a former Morgan Stanley CEO, a former Chairman of the American Gaming Association and CEO of MGM Resorts International, a legal and regulatory expert in the multi-jurisdictional online and retail gambling industries, the CEO of Dun &amp; Bradstreet and CEO of Black Knight, two senior Managing Directors from Blackstone and two senior Managing Directors from CVC,\n\nBetween the new Board of Directors, Bill Foley’s proven expertise in rapid M&amp;A growth and Paysafe’s massive market share and diverse assets, including the world’s second largest digital wallet, $362 million in free cash flow, 30-35% margins (21% CAGR), a projected $100-110 billion in transactional volume and $1.5 billion revenue, it is inevitable that institutional investors will, by necessity, include PSFE in their portfolios.\n\nPaysafe’s industry leading risk management and international regulatory expertise gives them an edge in spaces where competitors have hesitated like iGaming, sportsbetting, alternative currency trading as well as offering essential banking and ecommerce services to the \"unbanked\" (1.7 billion globally). Paysafe has a global platform with integrated cloud technology (Snowflake) allowing for easier migration of eCash, integration of payment methods and expansion into global banking as a service. Paysafe is so diversified that they've identified a $58 trillion TAM.\n\nFurther, major investment funds know that fintechs are the future. Fund manager Cathie Wood says, “Fintechs are going to, we believe, gut banks.” Similarly, Jackie Reses, board member of the SF Federal Reserve and fmr Head of Square Capital, calls for fintech “taking over and revolutionizing banking” representing “a wholesale transition” of a $16 trillion market cap.\n\nAnalyst Michael Del Grosso recently initiated coverage saying, \"We believe PSFE represents a relatively scarce asset within the payments industry given its unique business strategy, geographical footprint, and focus on the iGaming industry. Our forecasts imply revenue growth at the high-end of management's guidance and we believe there is upside to our forecasts in the event of state-level legalization of iGaming. PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States.\"\n\nInvestors should be aware that there is are post-merger lockup periods before insiders can sell their shares: PIPE: = 176 days. Private Equity = 86 days (roughly 6 and 3 months respectively accounting for trading days and weekends). Something to be aware of but there are several signals that these parties aren't in any rush to sell. Eli Nagler, a Senior Managing Director at Blackstone, recently said: “Today is a significant milestone for Paysafe and a testament to the excellent work of their world-class management team over several years. We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.” Regarding Blackstone and CVC, who now have four senior managing directors on Paysafe’s Board, Foley said, “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table… All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.” Also, the PIPE investors are primarily insurance companies known for long term hold strategies and they are closely associated with Bill Foley. As Foley recently said, “Having a large PIPE basically validates the transaction.… The companies that I’m affiliated with actually invested roughly a billion dollars in the PIPE and forward purchase agreements so Paysafe was always a really protected asset, besides the fact that it’s a great asset.”\n\nBill Foley says Paysafe may be his “best investment ever.” He says, “It’s a fortress. It’s got a moat.” “We have a proven strategy of winning as new global markets open. And most importantly, we have unrivaled regulatory risk and technical expertise.”\n\nAs an aside, even though, “Roughly 75% of online gambling operators use Paysafe for processing payments” many in the US haven’t yet heard of it yet. Partially because much of its presence is in back-end processing. Through its several new partnerships (Coinbase, Microsoft Rentmoola), Paysafe is just now rolling out its offerings in the U.S. In Europe, where it is more commonly used, Trustpilot rates Paysafe as “Excellent” (4.7/5 stars) with over 20,000 reviews, and Skrill (owned by Paysafe) 4/5 stars “great” with over 16,000 reviews, while competitor PayPal is rated \"poor\" only 1/5 stars with over 16,000 reviews. Further, Paysafe was winner of the American Gambling Awards’ “Payment Processor of the Year,” and owns Openbucks, Neteller and Skrill, 2019 winner “Best Digital Wallet” for best consumer take up and most innovative technology with “greatest potential to disrupt current ecosystems.” Also, Paysafe won “Best Omni-Channel Payment Solution” 2021 MPE Award and the gaming industry SAGSE award for “Best Payment Method.”\n\nTo give a sense of their pace and progress, these are some of Paysafe’s recent announcements that were made before going public and have not been factored into the current valuation:\n\nDec. 15 — Paysafe launches Paysafecash in the US\n\nDec. 21 — Paysafe partners with Amelco to plug US sports books into unified payments platform\n\nDec. 23 — Paysafe enables online cash payments for Microsoft\n\nJan 11 — Paysafe partners with Colorado’s BetWildwood\n\nFeb 1 — Paysafe expands Virginia Lottery partnership\n\nFeb 17 — Paysafe partners with Luckbox to roll out Skrill and Neteller payment services\n\nFeb 18 — Paysafe expands partnership with ESL Gaming, the world’s largest esports company\n\nFeb 23 — Paysafe’s Skrill launches new fiat-to-digital currency\n\nFeb 25 — Paysafe partners with Austria’s A1 esports League\n\nMar 1 — Paysafe partners with RentMoola to enable US renters to pay rent with Paysafecash eCash\n\nMar 12 — Leeds United announces partnership with Skrill\n\nMar 15 — Paysafe expands U.S. partnership with PointsBet\n\nMar 16 — Paysafe partners with Provema to enable online cash payments\n\nMar 25 -- Paysafe’s Skrill expands digital currency offering to US with Coinbase\n\n&amp;#x200B;\n\nFortunately for shareholders, even before Foley’s value creation play book is put into action, Paysafe is currently undervalued compared to sector peers.\n\nSince market analyst Steve Grasso continues to his repeat his calls for a triple ($45-50), I've looked more closely at EV / EBITDA, EV / Revenue and EV / Free cash flow multiples of sector peers, including PayPal, Nuvei, Repay, Shift 4, Adyen, Square, Affirm, Stripe, Chime and a few others, using cross-referenced data from Nasdaq, WSJ, Morningstar, Macrotrends, Yahoo Finance. The conservative average of those three multiples puts Paysafe’s post-merger pro forma share value at around $46.52:\n\n&amp;#x200B;\n\nPaysafe’s share price using the average multiples from the full list of sector peers:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nMore realistic share prices, after eliminating all outliers with very high multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n&amp;#x200B;\n\nNote: Unlike Paysafe, nearly half of these publicly traded fintechs still do not report positive cash flow. Also, these multiples reflect a collective 27% pull back from recent highs so interest rate risks have been somewhat factored in.\n\nAlso, Paysafe's CFO noted that their conservative 11% growth projection is tied to the general fintech market at large. They have deliberately excluded both M&amp;A plans that are apparently already underway and US iGaming growth that may potentially grow 10x or more over the next 5 years. Further, the above comps include fintechs with slower or similar growth while still commanding much higher multiples. For example, Shift4 reported only 4% y-o-y growth and GPN's growth projection is on par with Paysafe's.",
        "subreddit": "wallstreetbets",
        "title": "Paysafe goes public with new ticker: PSFE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhrha8/paysafe_goes_public_with_new_ticker_psfe/",
        "created": 1617297535.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1617274623,
        "id": "mhss5q",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "InvestmentClub",
        "title": "Microsoft Wins $22B Deal To Supply US Army With HoloLens AR Glasses",
        "url": "https://www.thetechee.com/2021/04/microsoft-wins-22b-deal-to-supply-us.html",
        "created": 1617303423.0
    },
    {
        "author": "CanadianInvestor98",
        "created_utc": 1617285443,
        "id": "mhvuwt",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "GlobeX Data Ltd. the leader in Swiss hosted secure communications and secure data management, is pleased to report that it has completed all internal testing of its SekurMessenger Swiss hosted messaging security and privacy solution, in preparation for its commercial launch in Latin America in April 2021.\n\nAs previously announced in a separate press release dated January 12 2021, GlobeX is launching SekurMessenger, its Swiss hosted encrypted instant messaging, secure voice recording transfer and secure file transfer application, with América Móvi's Telcel mobile operator in Mexico. The secure messaging service has been fully integrated with Telcel's billing and provisioning platform and the commercial launch is expected to start the week of April 12 2021. The launch will start in Mexico and expand to other countries where America Movil operates through its Claro brand, such as Colombia and other Latin American countries as the business grows over the coming years.\n\nGlobeX Data and América Móvil are looking at offering a secure and private alternative to other non-secure and non-private messaging applications. The market is geared primarily for business and government users, and privacy conscious consumers. According information published on América Móvi's website, Telcel is the largest mobile operator in Mexico, with over 75 million mobile subscribers. América Móvil (NYSE:AMX) is the 7th largest telecom operator in the world with over 277 million mobile subscribers in over 20 countries throughout Latin America and Europe.\n\nRecent data breaches in messaging applications and in particular in the WhatsApp application have created a certain urgency for businesses and data privacy advocates to protect their communications form cyber-attacks and identity theft via mobile and desktop devices.\n\nSekurMessenger eliminates many of the privacy and security risks by not only not requiring a phone number, which would divulge a user's phone device ID, but also by not social engineering a user's phone or computer contact list and infecting the contacts by default as well, eliminating a huge loophole in security and privacy. SekurMessenger issue each user a username and a SM number. The SM number is the contact ID a user would disclose in order for other SM users to be added. As the Introduction Video demonstrates, the service comes with a self-destruct timer and other features as well, including GlobeX's proprietary VirtualVaults and HeliX technologies with all data stored in Swiss hosted encrypted servers.\n\nAdditionally, SekurMessenger now comes with a proprietary feature and technology called Chat by Invites. This feature allows a SekurMessenger user (\"SM user\") invite a non-SM user, or a group of non-SM users, to chat in a fully private and secure way, without the recipient ever having to register to SekurMessenger or download the app. At the end of the chat, the initiator of the conversation can remotely terminate the conversation and all traces of the conversation are deleted from all users, including the recipient. This unique feature is now fully deployed and functional on all iOS and Android devices and web platforms. The target sectors are numerous, including but not limited to real estate, legal, financial, government, energy, mining, manufacturing, trade and medical sectors.\n\nAlain Ghiai, CEO of GlobeX Data said: \"We are very happy to have completed the testing phase of the launch with Telcel and are looking forward to the launch in the next couple of weeks. We have completed our Spanish language platform for SekurMessenger, and this means that we now can deploy other languages in the coming months as the ground work for localization coding has been done. We have received notice from Tecel, and other partners, that there is a growing demand to replace WhatsApp as a business messaging solution. SekurMessenger is here to satisfy that demand, and as we are not connected, and never have been connected, to AWS, Microsoft Azure or Google Cloud platforms, commonly referred to as \"Big Tech\", we can offer a truly independent, private and secure means of communications through secure messaging, secure voice record transfer and secure email through our proprietary technology and our secure servers based in Switzerland. We plan to expand to several countries in Central and Latin America in the coming years, as we plan to launch with other partners in the region as well. According to statista.com and other information sites, there are over 580 million people speaking Spanish in Latin America alone, and with security and privacy becoming a global concern, and the new WhatsApp rules to share all users' data with Facebook, we have seen a surge in demand and inquiries for our secure and private communications solutions.\"\n\nGlobeX's Data privacy solutions are all hosted in Switzerland, protecting users' data from any outside data intrusion requests. In Switzerland, the right to privacy is guaranteed in article 13 of the Swiss Federal Constitution. The Federal Act on Data Protection (\"FADP\") of 19 June 1992 (in force since 1993) has set up a strict protection of privacy by prohibiting virtually any processing of personal data which is not expressly authorized by the data subjects. The protection is subject to the authority of the Federal Data Protection and Information Commissioner.\n\nUnder Swiss federal law, it is a crime to publish information based on leaked \"secret official discussions.\" In 2010 the Federal Supreme Court of Switzerland found that IP addresses are personal information and that under Swiss privacy laws they may not be used to track Internet usage without the knowledge of the individuals involved.\n\nDisclaimer: this is not investment advice, please do your own research.",
        "subreddit": "pennystocks",
        "title": "GlobeX Data ($SWIS - $SWISF - $GDT) Launching SekurMessenger with America Movil's Telcel - Aims to Replace WhatsApp for Business Users Throughout Latin America",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhvuwt/globex_data_swis_swisf_gdt_launching/",
        "created": 1617314243.0
    },
    {
        "author": "sir_voldemort",
        "created_utc": 1617276312,
        "id": "mht7xe",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Discord take on Rumors MSFT buying Discord",
        "url": "https://www.youtube.com/watch?v=dHUKVIH8rnk",
        "created": 1617305112.0
    },
    {
        "author": "joe691013",
        "created_utc": 1617278565,
        "id": "mhtskp",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Wikisoft Corp (OTC Markets: WSFT)**\n\n**Date: March 31, 2021; current share price: $3.50Mid Term Price Target: $12-$15**\n\n**Company Overview**\n\n*In order to capitalize on current globalization trends, Wikisoft developed a credible online platform for companies and employees in order to serve the growing demand for credible information online. Wikiporfile.com aims to assist businesses and business professionals in order to find valid information in an easy and timely manner, helping them make informed career and hiring decisions. The company’s vision is to become the go to platform for connecting users to business opportunities on a global scale.*\n\n*Share structure: ( according to OTC Markets, via* [*https://www.otcmarkets.com/stock/WSFT/security*](https://www.otcmarkets.com/stock/WSFT/security)*)*\n\nhttps://preview.redd.it/b326bktrxjq61.png?width=949&amp;format=png&amp;auto=webp&amp;s=734827cf4d0aacc834d043a3c8253796c4e07b0c\n\n*Wikisoft was incorporated in Nevada on May 4, 1998, under the name Sensor Technologies, Inc. The company changed its names multiple times, and in March 2018, Bluestar Technologies ultimately became Wikisoft Corp.*\n\n**Management**\n\nMr. Paul Quintal joined the company on August 1, 2020 as Chief Commercial Officer with the main objective to get funding, as he shortly resigned after, in December 2020. He then tool the role as Chairman and Directors, being responsible for corporate governance and investor relations. Mr. Quintal is highly qualified and has extensive experience in search engine technology, as he has worked for companies such as Pentius, Inc., Softbank, Internet.com and Lycos. He was a key member for 2 IPOs, 2 exits via sale and 12 acquisitions &amp; integrations. Specifically, his role at Pentius included leading negotiations for large strategic contracts, managerial guidance, and high-value deal-making.\n\nMr. Carsten Kjems Falk has recently joined Wikisoft Corp, serving as Chief Executive Officer since September 1, 2020, making him responsible for strategy, operations, business development, and all commercial activities. Prior to Wikisoft Corp, Mr. Flak was Chief Executive Officer at Domino’s Pizza DK. Mr. Falk holds a Master’s degree in Mathematics and curriculum studies, and has a proven track record of successfully winning 2 Gazelle Prizes from the leading financial newspaper in Denmark. Also highly relevant, Carsten Falk’s experience could be leveraged at Wikisoft, developing the company into a competitive player in its industry. Mr. Falk has also been awarded twice for the best global online sales by Domino’s International.\n\n**Business Model**\n\nWikisoft’s vision is to become an important player in the business information industry, with Wikiprogile.com. Wikiprofile.com is a portal that provides articles and profiles on companies, business people and corporate influencers. Currently, the website portal is operational in its launched form, however, the company is focused on relaunching the updated format of the website (planned to take place in the Spring 2021). Wikisoft has externalized some of its functions, with developers based in India and IT operations based in Denmark.\n\nWikiprofile.com is built on a modern microservice software stack and is developed in multiple Postgres databases, which represent a main pillar for the platform. The architecture is designed to make the web faster, more secure, easier to scale, and in addition, by using proprietary crawler technology, the databases automatically collect information on newly found entities, seeking to have a complete database. Once relaunched, wikiprofile.com will help users to stay connected and informed, allowing professionals to advance their careers while also allowing business to hire the best professionals and work smarter.\n\nWikisoft is just about to enter into the “growth phase”. After going through the restructuring stage (2017-2019 ), the company went on to build a solid foundation and gear for growth by changing the management team, leveraging their business model, implementing growth strategies. The next period could represent the growth stage, and could be characterized by accelerated growth, becoming a global brand, and capitalizing on the growth opportunities.\n\nIn the long run, Wikisoft plans to disturb the industry when it comes to validation of professional profiles and create new standards, changing the wat people trust digital information. The platform aims to provide trusted information about companies and people, allowing both of them to make the right decision. Wikisoft would engage in a global market worth 479 billion USD, with the United States being the leading country, at 152 billion USD, according to Statista. ( Revenue of global staffing industry 2008-2019 ).\n\nWikisoft believes that they could be a major disruption for the industry, as the company looks to leverage their strengths:\n\n\\- Large global business database that can be used for Marketing &amp; Sales\n\n\\- Highly scalable setup geared towards the future growth journey\n\n\\- Limited operational cost geared for growth\n\n\\- Data crawled, verified &amp; updated daily providing a job market directory for businesses and job seekers\n\n\\- Disruptive business model with low entrance barrier to gain market share\n\nAs Wikisoft is working to relaunch the website portal in its updated format, the company aims to create additional value for their users through four different planned product lines:\n\na) Wiki Business People Profile\n\n\\- Free basic profile, visible to recruiters looking for new employee’s\n\n\\- Additional features such as data insights on profile visitors , financial company information and receiving job proposals are all planned to be available at a cost\n\nb) Wiki Business Profile\n\n\\- Free basic profile, allowing companies to highlight their culture, increase their brand awareness, and\n\n\\- Additional features such as review management and data insights available at a cost\n\nc) Wiki Recruit\n\n\\- Planned to include a free basic profile where recruiters can post jobs\n\n\\- Additional features such as premium ranking, ability to send job proposals directly to job candidates; ( planned to be $19.99 per month for the premium ranking, $29.99 per month for the premium ranking and ability to send direct job proposals )\n\nd) Wiki Company Research\n\n\\- Offer solidity, liquidity and credit reports to make research and ensure right decision making when choosing a new job or supplier\n\nWikisoft plans to generate revenues from premium profiles and recruiting on the website platform, but also by charging users for access to certain information and features on the platform.\n\nOperations plan – timeline, projections:\n\nQ1 2021:\n\n\\- Updated website platform to be launched, including new features and extended profiles of businesses and business professionals;\n\n\\- Mobile version planned to be launched as well, along new investor site on Wikisoft.com\n\n\\- Estimated costs: $40,000\n\nQ2 2021:\n\n\\- commence marketing activities, with the goal of generating users and sign ups; ( main drivers: email, SEM, SEO )\n\n\\- further development if website platform with new features such as reviews, in-mails\n\n\\- having the company’s common stock on the OTC markets OTCQB tier\n\n\\- Estimated costs: $40,000\n\nQ3 2021:\n\n\\- Hiring of marketing managers that will be responsible for optimizing and ensuring KPI driven email, SEM &amp; SEO, and for executing Wikisoft’s marketing strategy\n\n\\- IT development for crawling and fronted development of business logic and products\n\n\\- Estimated costs: $50,000\n\nQ4 2021:\n\n\\- Continue hiring additional developers, hire additional customer care and marketing managers\n\n\\- Develop platform with new features like Jobs and Job Postings\n\n\\- Hire CFO to streamline financial reporting, compliance, investor relations and improve corporate governance\n\n\\- Estimated costs: $70,000\n\nThe industry is evolving with rapid pace, and other companies with significantly bigger financial resources, such as LikedIn, Glassdoor, Facebook, Google, Microsoft, and Twitter could or are developing solutions that compete with Wikisoft. Larger companies could focus on professional networking and directly compete with Wikisoft.\n\nWikisoft is a potential buyout target, ultimately following the footsteps of other similar companies in the industry. LinkedIn was acquired by Microsoft for $26.2 billion; Hired raised $132 million since founding in 2012 +10,000 top companies using Hired employers can reduce time to hire by about 33%; Glassdoor was acquired by Recruit Holdings for $1.2 billion in May 2018. Recruit provides recruiting solutions to 7k+ employers, including about 40% of the Fortune 500.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5cef80auxjq61.png?width=1707&amp;format=png&amp;auto=webp&amp;s=7a6861513c0f456dbbe6cb0de1b4da50f66ca717\n\nSource: Wikisoft, Management Information, via Information Memorandum\n\nWikisoft will also not have ads on website in order to build brand trust. The company could potentially capture market share through their strong brand recognition and amount of proprietary data. Wikiprofile is rated among the highest in terms of trusted and credible content, while also having a modern IT infrastructure, being e=well organized and integrated for business and consumer applications.\n\n**Risks Factors**\n\n“The Company has generated very little revenue, which was all from a related party, and has incurred losses of $2,888,765 for the year ended December 31, 2019 and $1,954,297 for the year ended December 31, 2020. The Company has incurred an accumulated deficit of $7,583,538 since inception and does not have a sufficient amount of cash required to pay all the costs associated with its operations. Additionally, as of December 31, 2020, the Company had working capital deficit of approximately $23,041. These factors raise substantial doubt about the Company’s ability to continue as a going concern” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\n“The Company seeks to overcome the circumstances that impact its ability to remain a going concern through a combination of the growth of revenues, with interim cash flow deficiencies being addressed through additional equity and debt financing. The Company anticipates raising additional funds through public or private financing, strategic relationships or other arrangements in the near future to support its business operations.” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nWikisoft Corp has little to no history of revenue generation and currently operates at a loss, thus the company is still dependent on financings for the continuation of operations. Also, evaluating and forecasting Wikisoft’s financial performance cannot be done with great accuracy.\n\nMr. Rasmus Refer is the largest shareholder and has substantial control over the company and its policies. As of 03/29/2021, he owns 87.83% of Wikisoft’s common stock. He is also able to exercise significant influence over all matters requiring approval by stockholders.\n\nThe company is extremely likely to conduct offerings of equity in the future, meaning that stockholders would be diluted, as their proportional interest would decrease.\n\nUltimately, the success of the company strictly depends on its ability to develop and commercialize their platform.\n\n**Financials**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h2ez2juvxjq61.png?width=699&amp;format=png&amp;auto=webp&amp;s=3bfcbb534e16fb633c5268cdd5d3bef2d2e20c00\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7byzewlwxjq61.png?width=791&amp;format=png&amp;auto=webp&amp;s=11dbcd21db8c2e9053b4cb27f04076b44e4b2310\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pyikcfgxxjq61.png?width=794&amp;format=png&amp;auto=webp&amp;s=01792e5b157a981bbc80529f9dc6ffaa4dd04c7b\n\nSource: ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nEven though there is little to no financial data that could be analyzed, Wikisoft represents a huge opportunity for investors, as the company is poised for growth in the near future. Although it is too early to make accurate price target estimates and projections, if the Wikisoft’s management team is successful in leveraging their growth strategies, Wikisoft could become a billion dollar capped company sometime In the next 3-6 years, possibly resulting in a 600% return on investment. As soon as the updated version of the online portal is launched and additional features are added, the company will initiate their marketing strategies, and around that time (expected to be in the fourth quarter of 2021), investors should start seeing revenues and cash flows from operations increasing. By that time, Wikisoft ( if nr. of shares outstanding remains the same), should be trading around $12-$15 per share. Overall, I am optimistic about Wikisoft’s long term prospects, and assign the company a BUY rating.\n\nDisclaimer: I assume no responsibility or liability for any errors or omissions in the content of the report. Any person or entity will be solely responsible for the consequences of the data, analysis, and findings of the report are used for decision making.",
        "subreddit": "Wallstreetbetsnew",
        "title": "WSFT Due Diligence",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mhtskp/wsft_due_diligence/",
        "created": 1617307365.0
    },
    {
        "author": "Professional-Ride-62",
        "created_utc": 1617297169,
        "id": "mi00dt",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What do you guys think? I Think Bullish",
        "subreddit": "wallstreetbets",
        "title": "MICROSOFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mi00dt/microsoft/",
        "created": 1617325969.0
    },
    {
        "author": "Accomplished-Art5884",
        "created_utc": 1617289787,
        "id": "mhxch2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Square or Microsoft?",
        "url": "https://www.reddit.com/r/stocks/comments/mhxch2/square_or_microsoft/",
        "created": 1617318587.0
    },
    {
        "author": "Interesting-Sir-4534",
        "created_utc": 1617276258,
        "id": "mht7dq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So...there were a couple of very good news catalysts for MVIS yesterday (new patent for laserscanning and the Microsoft deal with US ARMY worth of close to 22B$). MVIS parts seems to be a very big part off the hardware they are selling to the military.\n\nMicrovision only seems to have good news coming out all around for a long time so I thought I\\`d go and see how the short sellers are replying to these news. And FFS what did I see when I looked up at fintel short interst for MVIS.\n\n[https://fintel.io/ss/us/mvis](https://fintel.io/ss/us/mvis)\n\nWell the short volume for yesterday was 34% of trading volume (over 19 million shares in a day)!! Why are they so heavily shorting stocks that clearly has only upside for the future? Do they have no risk management? WTF is going on??\n\nNot a financial advice! Just a dumb ape asking questions.",
        "subreddit": "wallstreetbets",
        "title": "MVIS is now on the same track as GME was in january?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mht7dq/mvis_is_now_on_the_same_track_as_gme_was_in/",
        "created": 1617305058.0
    },
    {
        "author": "KansasCityJM",
        "created_utc": 1617299185,
        "id": "mi0rf5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Isn’t this a big thing for unity software? Microsoft strikes a deal with the U.S. Army for augmented reality headsets",
        "url": "https://www.cnbc.com/video/2021/04/01/microsoft-strikes-deal-with-us-army-for-augmented-reality-headsets.html",
        "created": 1617327985.0
    },
    {
        "author": "TheTraderSoldier",
        "created_utc": 1617284659,
        "id": "mhvlv8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft - Free Money? I paid $8. Was this a good buy?",
        "url": "https://i.redd.it/y7qzu204gkq61.jpg",
        "created": 1617313459.0
    },
    {
        "author": "Yememachine",
        "created_utc": 1617285407,
        "id": "mhvuj0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I know you guys like stupid ass stocks and I just want to scare the hell out of my teacher. I could easily just invest in tesla, google, and microsoft and be done with it but I know that going to be a variation of that for everyone and I want to let this man know he isn't dealing with some kid doing the class because he needs a math credit before he graduates.",
        "subreddit": "wallstreetbets",
        "title": "Personal Finance class gave me an assignment to make a fake portfolio with 3k what is the most cursed fake portfolio I can make with 3k and 3 companies.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhvuj0/personal_finance_class_gave_me_an_assignment_to/",
        "created": 1617314207.0
    },
    {
        "author": "sir_voldemort",
        "created_utc": 1617276397,
        "id": "mht8o7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Discord take on Rumors MSFT buying Discord",
        "url": "https://www.youtube.com/watch?v=dHUKVIH8rnk",
        "created": 1617305197.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617912176,
        "id": "mn06x7",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, April 8, 2021**\n\nStocks were mostly higher Thursday, with the Nasdaq (QQQ) leading the way, as market participants await the beginning of first-quarter earnings season and digest comments from Federal Reserve Chair Jerome Powell.\n\nAfter a choppy first quarter to the year, the Dow Jones (DIA) and S&amp;P 500 (SPY) largely recovered in the first week of Q2 and continue to hover near record highs. The equity market got a boost after FOMC members signaled in their March meeting that the Fed continues to favor maintaining highly accommodative monetary policies for the foreseeable future and signaling they will hold off on tightening policy at the first sights of inflation. Jeffrey  Kleintop, chief global investment strategist at Charles Schwab said, “A big part of this is making sure the vaccine-led recovery is firmly rooted, and that won't be clear until somewhere in the second half of this year. So it's possible that as we look out to the late summer timeframe or early fall that that's something that we could consider at that point. But until then, there's still a lot of risks. and just to backtrack it, we know that monetary policy works with a lag, and so it makes more sense to ensure that we're on solid footing before you begin to take your foot off the pedal.\" \n\nFurthermore, Speaking at a virtual meeting at the International Monetary Fund (IMF), Federal Reserve Chair Jerome Powell highlighted the uneven recovery in the US labor market as a sign the economic recovery still has a ways to go in order to meet the Federal Reserve’s employment goals. He said “The recovery though here remains uneven and incomplete. Tee burden is still falling on lower-income workers. The unemployment rate in the bottom quartile is still 20%. There are still eight and a half million people out of work. This unevenness that we’re talking about is a very serious issue.” \n\nLooking ahead, market participants will be closely monitoring the upcoming earnings season for the first three months (Q1) of 2021. Over the past several weeks, analysts have raised their earnings estimates by record levels with the expectation that recent economic growth will drive corporate earnings higher. According to FactSet, first-quarter [earnings estimates were increased by a record margin of 6%](https://insight.factset.com/record-high-increase-in-sp-500-eps-estimates-for-q1) over the past several weeks, as analysts adjusted their forecasts for the much stronger-than-expected economic rebound seen so far. Omar Aguilar, chief investment officer at Charles Schwab said, “We’re still in probably the early parts of the expansionary cyclical after recovering from that recession. We’ve started to see cyclical trades playing a big role in the early part of the cycle. Normally what happens at this stage is you continue to see … the cyclical component will continue to drive leadership into the second part of this year into next year.”\n\n**Highlights**\n\n* General Motors (GM) will halt production at several more North American factories and extend shutdowns at some others because of the shortage of semiconductor chips that is disrupting the auto industry.\n* Netflix (NFLX)  has reached a multiyear agreement with Sony Pictures Entertainment for domestic streaming rights to the studio's theatrical movies, the companies said Thursday.\n* Bank of America said on Thursday it will deploy $1 trillion for its environmental business initiative to push for green finance by 2030, expanding on the $300 billion it had announced for the same project in 2019. \n* Twitter Inc held discussions in recent months to buy audio app Clubhouse at a $4 billion valuation, Bloomberg News reported on Wednesday, citing people familiar with the matter. \n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Aphria (APHA) targret raised by Alliance Global Partners from $20 to $26 at Buy. Stock currently around $16\n* Boyd Gaming (BYD) target raised by KeyCorp from $61 to $69 at Overweight. Stock currently around $62\n* Carnival (CCL) target raised by Stifel Nicolaus from $30 to $35 at Buy. Stock currently around $29\n* Capital One (COF) target raised by Piper Sandler from $148 to $154 at Overweight. Stock currently around $133\n* Costco (COST) with two target raises. Stock currently around $359\n   * Wells Fargo (WFC) from $370 to $400 at Overweight\n   * Oppenheimer from $370 to $400 at Outperform\n* Ceasars Entertainment (CZR) target raised by KeyCorp from $102 to $110 at Overweight. Stock currently around $93\n* Dell Technology (DELL) target raised by Morgan Stanley (MS) from $98 to $107 at Overweight. Stock currently around $92\n* FootLocker (FL) target raised by Cowen from $70 to $72 at Outperform. Stock currently around $56\n* Installed Building Products (IBP) target raised by BTIG Research from $146 to $158 at Buy. Stock currently around $116\n* NetApp (NTAP) target raised by Morgan Stanley (MS) from $90 to $92 at Overweight. Stock currently around $74\n* United Therapeutics (UTHR) target raised by JP Morgan (JPM) from $185 to $212 at Overweight. Stock currently around $191\n\n“Luck is what happens when preparation meets opportunity.” - Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, April 8, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mn06x7/here_is_a_market_recap_for_today_thursday_april_8/",
        "created": 1617940976.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617912211,
        "id": "mn07dp",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " **PsychoMarket Recap - Thursday, April 8, 2021**\n\nStocks were mostly higher Thursday, with the Nasdaq (QQQ) leading the way, as market participants await the beginning of first-quarter earnings season and digest comments from Federal Reserve Chair Jerome Powell.\n\nAfter a choppy first quarter to the year, the Dow Jones (DIA) and S&amp;P 500 (SPY) largely recovered in the first week of Q2 and continue to hover near record highs. The equity market got a boost after FOMC members signaled in their March meeting that the Fed continues to favor maintaining highly accommodative monetary policies for the foreseeable future and signaling they will hold off on tightening policy at the first sights of inflation. Jeffrey  Kleintop, chief global investment strategist at Charles Schwab said, “A big part of this is making sure the vaccine-led recovery is firmly rooted, and that won't be clear until somewhere in the second half of this year. So it's possible that as we look out to the late summer timeframe or early fall that that's something that we could consider at that point. But until then, there's still a lot of risks. and just to backtrack it, we know that monetary policy works with a lag, and so it makes more sense to ensure that we're on solid footing before you begin to take your foot off the pedal.\" \n\nFurthermore, Speaking at a virtual meeting at the International Monetary Fund (IMF), Federal Reserve Chair Jerome Powell highlighted the uneven recovery in the US labor market as a sign the economic recovery still has a ways to go in order to meet the Federal Reserve’s employment goals. He said “The recovery though here remains uneven and incomplete. Tee burden is still falling on lower-income workers. The unemployment rate in the bottom quartile is still 20%. There are still eight and a half million people out of work. This unevenness that we’re talking about is a very serious issue.” \n\nLooking ahead, market participants will be closely monitoring the upcoming earnings season for the first three months (Q1) of 2021. Over the past several weeks, analysts have raised their earnings estimates by record levels with the expectation that recent economic growth will drive corporate earnings higher. According to FactSet, first-quarter [earnings estimates were increased by a record margin of 6%](https://insight.factset.com/record-high-increase-in-sp-500-eps-estimates-for-q1) over the past several weeks, as analysts adjusted their forecasts for the much stronger-than-expected economic rebound seen so far. Omar Aguilar, chief investment officer at Charles Schwab said, “We’re still in probably the early parts of the expansionary cyclical after recovering from that recession. We’ve started to see cyclical trades playing a big role in the early part of the cycle. Normally what happens at this stage is you continue to see … the cyclical component will continue to drive leadership into the second part of this year into next year.”\n\n**Highlights**\n\n* General Motors (GM) will halt production at several more North American factories and extend shutdowns at some others because of the shortage of semiconductor chips that is disrupting the auto industry.\n* Netflix (NFLX)  has reached a multiyear agreement with Sony Pictures Entertainment for domestic streaming rights to the studio's theatrical movies, the companies said Thursday.\n* Bank of America said on Thursday it will deploy $1 trillion for its environmental business initiative to push for green finance by 2030, expanding on the $300 billion it had announced for the same project in 2019. \n* Twitter Inc held discussions in recent months to buy audio app Clubhouse at a $4 billion valuation, Bloomberg News reported on Wednesday, citing people familiar with the matter. \n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Aphria (APHA) targret raised by Alliance Global Partners from $20 to $26 at Buy. Stock currently around $16\n* Boyd Gaming (BYD) target raised by KeyCorp from $61 to $69 at Overweight. Stock currently around $62\n* Carnival (CCL) target raised by Stifel Nicolaus from $30 to $35 at Buy. Stock currently around $29\n* Capital One (COF) target raised by Piper Sandler from $148 to $154 at Overweight. Stock currently around $133\n* Costco (COST) with two target raises. Stock currently around $359\n   * Wells Fargo (WFC) from $370 to $400 at Overweight\n   * Oppenheimer from $370 to $400 at Outperform\n* Ceasars Entertainment (CZR) target raised by KeyCorp from $102 to $110 at Overweight. Stock currently around $93\n* Dell Technology (DELL) target raised by Morgan Stanley (MS) from $98 to $107 at Overweight. Stock currently around $92\n* FootLocker (FL) target raised by Cowen from $70 to $72 at Outperform. Stock currently around $56\n* Installed Building Products (IBP) target raised by BTIG Research from $146 to $158 at Buy. Stock currently around $116\n* NetApp (NTAP) target raised by Morgan Stanley (MS) from $90 to $92 at Overweight. Stock currently around $74\n* United Therapeutics (UTHR) target raised by JP Morgan (JPM) from $185 to $212 at Overweight. Stock currently around $191\n\n“Luck is what happens when preparation meets opportunity.” - Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, April 8, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mn07dp/here_is_a_market_recap_for_today_thursday_april_8/",
        "created": 1617941011.0
    }
]