[
    {
        "author": "axos23",
        "created_utc": 1620945781,
        "id": "nbtk08",
        "num_comments": 673,
        "num_crossposts": 0,
        "selftext": "I see a lot of people saying \"I moved everything to ETFs\" or \"I sold all my stocks and have pillows for my couch now with all the cash\".\n\nAm I crazy that I am going to buy some on the dip and just hold? Shit sucks right now, but fundamentally, companies falling haven't had their future change.\n\nMy big holdings: BRK.B, AAPL, SQ, BABA, DIS, MSFT, CRM, BA, SBUX, MCD, NVDA, CVS, UBER, QQQ, SPY, MGK, VTV, DSTL, VIG, SPYD, VUG, VXUS, VNQ.",
        "subreddit": "stocks",
        "title": "Anyone else just plan on hunkering down and riding out the storm?",
        "url": "https://www.reddit.com/r/stocks/comments/nbtk08/anyone_else_just_plan_on_hunkering_down_and/",
        "created": 1620974581.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1620422316,
        "id": "n799ne",
        "num_comments": 324,
        "num_crossposts": 0,
        "selftext": "No unique stock DD this week guys, I had a senior moment and my brain was a day off.  Probably for the best, because this market is off-the-rails broken right now, anyways.  Literally down is up and up is down.\n\n&amp;#x200B;\n\nInstead, let's do an update on the Nrd ETF for the month.  I'll go over some of my trades and, as I have time maybe read how some of you played them and offer some not-financial-advice on how to optimize the plays.\n\n&amp;#x200B;\n\nFor those who want to go to the original discussion, you can find it [here](https://www.reddit.com/r/wallstreetbets/comments/n225dj/because_people_keep_asking_the_nrdrage_etf_may/).  I'll quote box the positions below and then go into it.\n\n&amp;#x200B;\n\n&gt; *My long list (both established positions and sentiment/momentum trades I'll make):*\n\n1. *$CLNE (Positions established; look at DD)*\n2. *$MA*\n3. *$BABA (Positions established; look at DD)*\n4. *$BE (Positions established; look at DD)*\n5. *$CAT (Positions re-established today in fact - July 230c's that I timed perfectly)*\n6. *$EXPE*\n7. *$AAPL*\n8. *$ALGN*\n9. *$PSFE (Positions established earlier)*\n10. *$CVX*\n11. *$ENPH (Positions established today)*\n12. *$TSCO (Positions established)*\n13. *$CAR (Positions established)*\n14. *$KMI (September 18s)*\n15. *$BB (Positions established; see DD)*\n\n&gt;*The Short watch list:*  \n&gt;  \n&gt;*Note  that, when it comes to shorting, I do a lot more scalping and very  short term swing trading.  May is typically a month of low volume, so  you have to be agile.  Puts are generally 2 steps out of the money at  open.  Do your own DD.  This is also not a complete list, just a daily  watch list of companies that I feel are going to fare roughly or whom  have typically underperformed this time of year.  This is also not a  short and hold list.  If you don't know what I'm saying, you should stay  away from these.*\n\n1. *$TSLA (Established today @ an average cost basis of $712.11)*\n2. *$UPST*\n3. *$TWTR (Established April 28th @ $66.08)*\n4. *CLOV (always good for an intraday scalp when the capuchins go full retard)*\n5. *$SPCE*\n6. *$PTON*\n7. *$TSM*\n8. *$BLNK*\n9. *$GS (Established yesterday)*\n10. *$PINS*\n11. *$BMBL*\n12. *$EGHT*\n13. *$MDB*\n14. *$PCG*\n15. *$DASH (Established Wednesday at 162.22)*\n16. *$GRUB (Established Wednesday at 70)*\n17. *$WORK*\n18. *$CAN*\n19. *$BYND*\n20. *$AFRM (Established Wednesday at $77.20)*\n21. *$COUR*\n22. *$HEP*\n23. *$CSCO*\n24. *$PLNT*\n25. *$QS*\n26. *$WMT*\n27. *$ADT*\n28. *$TW*\n29. *$RTX*\n30. *$COF*\n31. *$NOC*\n32. *$ADM*\n33. *$AAL*\n34. *$WHR*\n35. *$LUMN*\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nAnd here's where we are **(LOSERS IN BOLD;** *N/A, draws, or otherwise flat trades in italics)***:**\n\n&amp;#x200B;\n\n1. **$CLNE:  This one got ugly.  Real ugly.  Volume completely dried up, which gave the shorts free rein to walk it down into oblivion all week.  They had an earnings call on Thursday, which was actually quite good (missed on top line EPS, but beat on revenue, upgraded forward guidance, and opened up more about the 1.5bln $AMZN contract, which sounds better and better the more I hear about it.  It actually traded up for a while this morning, but then just got absolutely assaulted the rest of the day because everybody was sitting it out.  I've averaged down - hard - on this one at this stage to make sure that I'm always within a day or two's striking distance of at least breaking even on the June calls.  I have started buying September calls at the same 13 strike.  I also started buying up more shares at $8.85 this afternoon.  I love a sale.   I'm going to re-evaluate how I feel about the June calls in the coming week.  Given that this stock has had 6 red days out of 7, any moves I make right now would be reactionary.  Further, one interesting thing I noticed was that, in the last 5 or 10 minutes or so, other whale buyers showed up HARD at the $8.79 price.  For a stock who's order book all day was just a series of 3-digit and low 4-digit offers, to see 50,000 share bids show up tells me that the shorts who had been fucking this thing all week were covering AND the buyers were coming back in (probably the same assholes who shorted it).**\n2. *$MA:  I'm still yet to open a position here.  I just haven't liked the price action, and the charts have been very choppy.  If you've played it, let me know how it worked out for you.  Looking back at the weekly, I see some openings NOW, but they weren't real clear in the moment.*\n3. $BABA:  I took the opportunity at 226 to finish filling out my call position as referenced in the last solo stock DD.  I know I said in that DD it was impossible to screw up, but apparently I underestimated the internet some, because I've had people messaging me saying they bought in at 234 and are down and \"feeling pain\", when I explicitly said not to buy at those levels.  It's interesting to me that the Chinese stocks, which are universally accepted to be underpriced, are moving in sympathy with domestic growth stocks.  That's broken.  \n4. **$BE:  Bought more August 31's on Thursday when it was at the bottom.  Sub-$20 was too good of an equity price to pass up.  I really liked the price movement on it yesterday and today.  Their earnings call was SPECTACULAR, and their leadership said all the right things.  I feel really good about this one to finally start moving independently of the rest of the green energy sector. Loser for right now, but I'm not getting shaken out**\n5. $CAT:  Those July 230's were made of latinum.  Closed out today for fat profits.  I consider this trade over until $CAT comes back down into the 220's.\n6. $EXPE:  Bought in yesterday morning.  Closed my position at about 2 pm EST today.  I sat on this trade a little too long and left about $3 a share on the table, but profit is profit.  It was a very nice trade.  This trade is closed\n7. *$AAPL:  I never actually got into my long position.  I closed my pre-existing short on Tuesday and have been eyeing an entry, but haven't found one I like yet.*\n8. $ALGN:  In Tuesday @ 575-ish, out today at 600.  Trade is closed\n9. $PSFE:  As discussed in last week's post, I ended up removing this because the apes started trying to meme stock it, and I replaced it with $CVS, which has made me enough tendies to spring for the top shelf lube for when I fuck.  The $CVS trade is still ongoing and a good one to eye an entry, IMO\n10. $CVX:  Jumped in Monday, and I'm still in the trade.  I like the movement on this one.  Still a good trade to enter, IMO\n11. **$ENPH:  I'm upside down on this one, largely because I've been unwilling to average down on it.  My bags aren't super heavy, but I do have some Samsonites right now.  Going to just store it away and let it marinate.  The price action is still downwards here, so if you're eyeing this one, let it come in further**\n12. $TSCO:  The price action on this has been amazing.  I've actually been holding this for quite some time, so my entry is way in the rear view mirror.  But I love how smoothly it's run and feel it's still got a lot more room to till.\n13. **$CAR:  This is another one I've been holding forever, and just don't want to create a taxable event on.  The price action has generally been flat, if you remove the fact they had earnings this week, and we all know what earnings means in this market.  I still like this one for a buy and hold**\n14. $KMI:  We don't talk about $KMI.  But if you're interested, maybe go look at a chart, because it'll make you wet\n15. **$BB:  I haven't done anything with this, and honestly, couldn't even tell you how it's performed.  Probably poorly.**\n\n&amp;#x200B;\n\n# The shorts:\n\n1. $TSLA:  I jumped in at $712.11.  Everybody in the daily told me I hated money.  I got out at 666, even though I was swearing up and down it was going to 650.  The price action just looked like it was turning, so I took tendies.  Then it went to 650 like I thought it would.  Could have done it better, but profit is profit.  I'm eyeing a re-entry to the short side on this one.  I'm thinking 685-690 I'll likely re-establish\n2. $UPST:  My most reliable short  I'm twenty-some dollars a share in the green already and still holding.\n3. $TWTR:  It's been SUUUUUPER choppy this week.  I got out at 52.80 for a nice gain, but I've hated the price action.  Staying away from here on out\n4. *$CLOV:  Never had a good opportunity to play it.  Still watching*\n5. $SPCE:  Death, taxes, and $SPCE tanking.  Still holding for a modest gain with stop losses in place.  Been pretty flat.  Probably still a good short if you can time it.\n6. $PTON:  God bless that Shortbus All-Star kid who got eaten by the treadmill.  Lambo squad trade.  Closed out, and consider the trade done unless I see it in the mid 90's again\n7. *$TSM:  Never entered.  I thought I had a price target in mind, but I wussed out at the last moment.  Doesn't matter, Theta Semi living up to its name*\n8. $BLNK:  30% gain.  I'll look for re-entry at 35.\n9. **$GS:  Defying the odds.  Trimmed my position to hedge losses, but this one isn't working out so far. Will look for weakness to re-establish in full**\n10. $PINS:  Closed half my position at 60 for a nice gain.  Holding the other half with tight stop losses, but I'm optimistic it's got further to fall\n11. *$BMBL:  I missed it.  Kicking myself for it, too.  I knew it was gonna fall.  Not sure how much downside is left*\n12. $EGHT:  Oh the sweet sound of an equity dying.  This one is printing for me hard, and I think it's still got another 3-4 dollars to the downside in it\n13. $MDB:  See $EGHT.  Exact same story\n14. $PCG:  Riding it down like a submissive whore.  I'll probably run this one the entire month.  Printing nicely, still plenty of room to drop\n15. $DASH:  LAMBO SQUAD!  Oh man, this one has been magnificent.  And it's still got downside.  Fair value IMO is 80.  It'll never hit it, but I think 110 is entirely doable.\n16. $GRUB:  Reliable gainer to the downside, but not as nice as $DASH.  Still holding. \n17. $WORK:  Quietly dropped on no news.  Just shows how broken the market is, because the buyout price is baked in.  I was following this so I could see news to potentially short $CRM, but none came.  $CRM, however, fell nicely on the week, but I wasn't there to catch it.  Trade is likely running out of breath\n18. *$CAN  Never entered it, which is sad because it could have been a good gainer.  I'll rectify that mistake on some upwards momentum*\n19. $BYND:  Yacht squad.  What an amazing loser.  Still holding.  I want to see 95\n20. $AFRM:  I love the concept, but I hate the business model.  This one has been a great gainer for me, but I want to see 44.  Still room to drop\n21. $COUR:  Inadvertent earnings play.  Didn't realize t hey were reporting this week.  Happy accidents.  2 bagger, excellent play.  I covered this afternoon.  I think there's probably still another 10% to the downside possible, but I actually like the model and don't want to tempt fate.  This trade is closed to me.\n22. *$HEP:  Got in and got out at dead even.  Thought I had a good entry but then things got choppy and weird.  Removed it from my watch list.  This trade is dead to me with a draw.*\n23. *$CSCO:  never entered.  Which is good, because it's run up.  I'm eyeing an entry*\n24. $PLNT:  Another great winner.  I wanna see another 4 dollars to the downside  Trade still live\n25. $QS:  Patently obvious this was gonna drop like a rock.  Ask me when it's at $10 and I'll probably still be shorting it\n26. *$WMT:  I got cute and walked into a flat trade.  Will exit next week, win lose or draw.*\n27. **$ADT:  Took the L here.  Entered at $9.27, got scared off this afternoon with a small loss.  Took it off my watch list, trade is dead to me**\n28. *$TW, $RTX, $COF, $NOC, $ADM, $AAL, $WHR, $LUMN, didn't enter any of these.  $COF, $AAL and $WHR are the only ones I'm even still tracking.  The others are dead to me*\n\n&amp;#x200B;\n\nRecord after 1 week:  \n\n&amp;#x200B;\n\nLongs:  8-5-2 (given the week that just happened, I'll take it)\n\n&amp;#x200B;\n\nShorts:  18-2-15:  Most of the draws are simply because I never entered the trades.  Take out the trades where I never expended powder and it's 18-2-2.  \n\n# \n\n# Overall (played trades):  26-2-2\n\n&amp;#x200B;\n\nSo....how'd you do?  Let's hear it.",
        "subreddit": "wallstreetbets",
        "title": "The weekend update/discussion of the Nrd May ETF (Thought it was Thursday till 10 after 2 today didn't-write-my-homework edition)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n799ne/the_weekend_updatediscussion_of_the_nrd_may_etf/",
        "created": 1620451116.0
    },
    {
        "author": "big_fish7",
        "created_utc": 1620496439,
        "id": "n7um6w",
        "num_comments": 217,
        "num_crossposts": 0,
        "selftext": " I'm a long term CLOV investor and do not believe the recent price action reflects a squeeze of any kind. More likely that wall street investors woke up to CLOV potential because of [this](https://innovation.cms.gov/media/document/gpdc-model-participant-announcement) CMS update that announces CLOV participation in 10 US states in PY 2021. (This is my first reddit post so here goes)\n\nBelow is why I (a regular, retail investor) have held on to CLOV shares and warrants in my portfolio and why I believe getting in on this stock under $15 is a no brainer (disclaimer: I’m not a financial advisor and this is NOT investment advice, do your own DD before investing):\n\n1. **Business Model:** Clover Health is a Medicare Advantage insurance company. [Sources of revenue for MA insurers](https://www.medicalnewstoday.com/articles/how-is-medicare-advantage-funded) include premiums and payments via CMS, most of which goes to hospitals and doctors. In MA, specially under plans offered by CLOV, premiums are negligible so for our purpose payments made by CMS (government) are the lifeblood of MA plans such as Clover. You may be wondering so what? Well, let’s put things in perspective. The US federal govt spent $1.2 Trillion on healthcare in 2019, $644 Billion of this went to Medicare of which $270B was spent on MA. All or most of this growing annual budget goes to fund MA plans such as Clover for services they provide members. The problem is, there are too many visits and hospitalizations (than are needed). What if there was an innovative startup that used innovation (pay doctors fixed fees per visit) and technology (Clover Assistant software with telehealth features) such that federal government paid out LESS per member to such a company vs. competition ([target outcome of Direct Contracting](https://www.cms.gov/newsroom/fact-sheets/direct-contracting)) for HIGHER quality of care. Great ability to capture market share from legacy insurers and help lower government spending (more on this later) – a WIN-WIN situation for insurer and the govt. This is why Clover’s business model is so fool proof!***TLDR:*** ***Clover operates in a space that is majority funded by government, and its unique business model helps it gain market share***\n2. **Competition:** Now let’s talk competition. Competitors such as Humana, United Health, CVS/Aetna have for years delivered medical insurance but hardly innovated in a way that was positive for federal spending. They continued charging seniors on plan premiums, while trying to receive as much funding as possible from the fed to grow their profits. Why make the process more efficient when all we do to get paid is to broker insurance plans in a highly regulated industry. Clover with its innovation is miles ahead of the competition by getting a nice head start (started in 2014, while other [insurers are just getting started with the innovation)](https://medcitynews.com/2021/02/mercy-humana-partner-to-expand-access-to-virtual-value-based-care/) and the Clover Assistant software will constantly help it become more efficient i.e. achieve better results for its members, at a lower cost to CMS!! CLOV is also MORE HOLISTIC than TDOC in services, while targeting a LOWER TAM i.e. only Seniors right now. Only a matter of time that they expand beyond MA and offer plans for the general population.***TLDR: Clover is disrupting competition through its use of technology.***\n3. **Software:** Now the bit about software. This IS Clover’s secret ingredient. The development is led by an ex-Googler (Andrew Toy, President at Clover Health) to radically transform software used to treat seniors through massive digitization, and interactive UI. This in turn helps doctors improve outcomes for patients. And they are giving it away for free!!! Why would a physician not use software that helped him/her improve the standard of care for their patients while being easy to use and access and FREE. Imagine, Marc Benioff giving away Salesforce for free to sales reps all over. When this software becomes the standard of care because of the years of head start they have in this space, Clover Health could eventually license this to the other insurers and health care providers i.e. additional sources of revenue.***TLDR: The Clover Assistant software is the secret ingredient that helps the company deliver efficient care and achieve better outcomes.***\n4. **Growth:** Ok so we briefly spoke about licensing as an additional mode of revenue, now let’s focus on others. 2) Current projections indicate 14% annual organic growth of MA population, this growth is likely to go bonkers when Biden reduces the Medicare eligible age to 60, as [promised](https://joebiden.com/fact-sheet-how-joe-biden-would-help-you-get-health-insurance-coverage-during-the-coronavirus-crisis/)in his campaign. Evergreen and ever-growing TAM 3) Direct Contracting introduced by CMS is basically a risk sharing model that incentivizes insurers to make treatment of seniors more efficient and cost effective. Insurers that can achieve a lower cost of treatment and fewer hospital visits for the same condition, they are likely to be held in favor by CMS when allotting MA counties every year. Now, if you remember the bit about software, Clover is in the best position to do this…as long as doctors continue to use the Clover Assistant software to treat seniors. This may sound like a risky bet, but it really isn’t….60%+ of Clover members see a PCP that uses the Clover Assistant software. Clover’s [long-term goal](https://investors.cloverhealth.com/static-files/ed2bc09d-cd96-4759-897e-862c2b250213) is to get to a 70%+ rate. 4) End 2020, Clover offered MA plans in 34 counties but this will grow based on participation in more states as per the [CMS Direct Contracting plan for 2021](https://innovation.cms.gov/media/document/gpdc-model-participant-announcement).***TLDR: Growth in MA membership, direct contracting, geographic expansion, potential to license its software are all lucrative growth avenues.***\n5. **Customers:** Let’s now put some light on the target demographic…seniors. Clover is promising them the lowest cost plans ($0 premiums, low/no co-pays) which are highly flexible (telehealth on Clover Assistant) to their needs. Why not? In addition, Clover is developing partnerships with Walmart and other retailers to market their plans which is likely to result in an ever-growing customer and incentivized partner base.\n6. **Media:** The media has lambasted this company quite vocally including on CNBC despite little of substance…except that there was a short-seller report and questions asked about the CEO. To his credit, Cramer recently invited Clover Health to Mad Money…now, when this interview happens it is likely to introduce the company to a pretty massive list of retail investors (the buy and hold kind) and when they realize how undervalued Clover is, they will likely pick up a good portion of the float, causing fewer and fewer shares to be available.\n7. **Management:** If one reads through the exec incentive structure in [SPAC prospectus](https://www.sec.gov/Archives/edgar/data/1801170/000119312520316032/d69158d424b3.htm#toc69158_24), they would soon realize that the CEO has most of his interest in the company tied to the stock – he does not receive a salary. More importantly, both CEO and President performance-based incentive plans do not kick in until CLOV reaches and maintains a volume weighted average price of $30 for a 90-day period. Consider also, **Lee Shapiro who sits on the board of Clover Health is the former CFO of Livongo (now part of TDOC, ARK fav) while Chelsea Clinton adds serious weight and is actively involved as board member and dem access. Recently they added the former director of Medicare - literally the only possible guy in the world that can get them what they need to continue growth for years to come.**  \n8. **Valuation:** SPAC merger docs value the company at $3.7B. Currently, because of the short seller report and the massive short-interest in the company, it is valued at \\~$3B, which is \\~4x 2021E sales. With projected revenues for 2021 of $835M (mid-point), and applying a 8x sales multiple, Clover’s valuation needs to be at least $6.7B+ market cap implying a $16+ PT. With expected 24%+ growth in 2021, and premium multiple for high growth companies (note that the float is only 25% of shares outstanding), I believe a $20-25 target is more in line with current valuations. When medicare eligible age limit is lowered to 60 by Biden later this year or perhaps early next, this PT will need to be re-evaluated…upward. Also consider the fact that this company is NOT zero revenue now, promising billions in 2025 and beyond….it had sales of $670M in sales in 2020 and growing!! Consider also that the industry-leader in the telehealth space – TDOC – and a Cathie Wood &amp; ARK fav currently trades at 16x sales. Similar multiple for CLOV implies a $33 PT.***TLDR: Whichever way you cut it, CLOV is very undervalued right now. Near term $25-30 PT and longer term has LMND-like potential in healthcare insurance***\n\nI am long CLOV because I believe that it is trying to solve a very hard and complex problem in healthcare. It deserves a lot more credit and people rooting for it to succeed.\n\n📷\n\nCLOV YOLO",
        "subreddit": "wallstreetbets",
        "title": "CLOV will be a multi-bagger",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n7um6w/clov_will_be_a_multibagger/",
        "created": 1620525239.0
    },
    {
        "author": "BoredBillionaire",
        "created_utc": 1619972553,
        "id": "n39wvn",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "I'm a long term CLOV investor and do not believe the recent price action reflects a squeeze of any kind. More likely that wall street investors woke up to CLOV potential because of [this](https://innovation.cms.gov/media/document/gpdc-model-participant-announcement) CMS update that announces CLOV participation in 10 US states in PY 2021. (This is my first reddit post so here goes)\n\nBelow is why I (a regular, retail investor) have held on to CLOV shares and warrants in my portfolio and why I believe getting in on this stock under $15 is a no brainer (disclaimer: I’m not a financial advisor and this is NOT investment advice, do your own DD before investing):\n\n1. **Business Model:** Clover Health is a Medicare Advantage insurance company. [Sources of revenue for MA insurers](https://www.medicalnewstoday.com/articles/how-is-medicare-advantage-funded) include premiums and payments via CMS, most of which goes to hospitals and doctors. In MA, specially under plans offered by CLOV, premiums are negligible so for our purpose payments made by CMS (government) are the lifeblood of MA plans such as Clover. You may be wondering so what? Well, let’s put things in perspective. The US federal govt spent $1.2 Trillion on healthcare in 2019, $644 Billion of this went to Medicare of which $270B was spent on MA. All or most of this growing annual budget goes to fund MA plans such as Clover for services they provide members. The problem is, there are too many visits and hospitalizations (than are needed). What if there was an innovative startup that used innovation (pay doctors fixed fees per visit) and technology (Clover Assistant software with telehealth features) such that federal government paid out LESS per member to such a company vs. competition ([target outcome of Direct Contracting](https://www.cms.gov/newsroom/fact-sheets/direct-contracting)) for HIGHER quality of care. Great ability to capture market share from legacy insurers and help lower government spending (more on this later) – a WIN-WIN situation for insurer and the govt. This is why Clover’s business model is so fool proof!  \n***TLDR:*** ***Clover operates in a space that is majority funded by government, and its unique business model helps it gain market share***\n2. **Competition:** Now let’s talk competition. Competitors such as Humana, United Health, CVS/Aetna have for years delivered medical insurance but hardly innovated in a way that was positive for federal spending. They continued charging seniors on plan premiums, while trying to receive as much funding as possible from the fed to grow their profits. Why make the process more efficient when all we do to get paid is to broker insurance plans in a highly regulated industry. Clover with its innovation is miles ahead of the competition by getting a nice head start (started in 2014, while other [insurers are just getting started with the innovation)](https://medcitynews.com/2021/02/mercy-humana-partner-to-expand-access-to-virtual-value-based-care/) and the Clover Assistant software will constantly help it become more efficient i.e. achieve better results for its members, at a lower cost to CMS!! CLOV is also MORE HOLISTIC than TDOC in services, while targeting a LOWER TAM i.e. only Seniors right now. Only a matter of time that they expand beyond MA and offer plans for the general population.  \n***TLDR: Clover is disrupting competition through its use of technology.***\n3. **Software:** Now the bit about software. This IS Clover’s secret ingredient. The development is led by an ex-Googler (Andrew Toy, President at Clover Health) to radically transform software used to treat seniors through massive digitization, and interactive UI. This in turn helps doctors improve outcomes for patients. And they are giving it away for free!!! Why would a physician not use software that helped him/her improve the standard of care for their patients while being easy to use and access and FREE. Imagine, Marc Benioff giving away Salesforce for free to sales reps all over. When this software becomes the standard of care because of the years of head start they have in this space, Clover Health could eventually license this to the other insurers and health care providers i.e. additional sources of revenue.  \n***TLDR: The Clover Assistant software is the secret ingredient that helps the company deliver efficient care and achieve better outcomes.***\n4. **Growth:** Ok so we briefly spoke about licensing as an additional mode of revenue, now let’s focus on others. 2) Current projections indicate 14% annual organic growth of MA population, this growth is likely to go bonkers when Biden reduces the Medicare eligible age to 60, as [promised](https://joebiden.com/fact-sheet-how-joe-biden-would-help-you-get-health-insurance-coverage-during-the-coronavirus-crisis/) in his campaign. Evergreen and ever-growing TAM 3) Direct Contracting introduced by CMS is basically a risk sharing model that incentivizes insurers to make treatment of seniors more efficient and cost effective. Insurers that can achieve a lower cost of treatment and fewer hospital visits for the same condition, they are likely to be held in favor by CMS when allotting MA counties every year. Now, if you remember the bit about software, Clover is in the best position to do this…as long as doctors continue to use the Clover Assistant software to treat seniors. This may sound like a risky bet, but it really isn’t….60%+ of Clover members see a PCP that uses the Clover Assistant software. Clover’s [long-term goal](https://investors.cloverhealth.com/static-files/ed2bc09d-cd96-4759-897e-862c2b250213) is to get to a 70%+ rate. 4) End 2020, Clover offered MA plans in 34 counties but this will grow based on participation in more states as per the [CMS Direct Contracting plan for 2021](https://innovation.cms.gov/media/document/gpdc-model-participant-announcement).  \n***TLDR: Growth in MA membership, direct contracting, geographic expansion, potential to license its software are all lucrative growth avenues.***\n5. **Customers:** Let’s now put some light on the target demographic…seniors. Clover is promising them the lowest cost plans ($0 premiums, low/no co-pays) which are highly flexible (telehealth on Clover Assistant) to their needs. Why not? In addition, Clover is developing partnerships with Walmart and other retailers to market their plans which is likely to result in an ever-growing customer and incentivized partner base.\n6. **Media:** The media has lambasted this company quite vocally including on CNBC despite little of substance…except that there was a short-seller report and questions asked about the CEO. To his credit, Cramer recently invited Clover Health to Mad Money…now, when this interview happens it is likely to introduce the company to a pretty massive list of retail investors (the buy and hold kind) and when they realize how undervalued Clover is, they will likely pick up a good portion of the float, causing fewer and fewer shares to be available.\n7. **Management:** If one reads through the exec incentive structure in [SPAC prospectus](https://www.sec.gov/Archives/edgar/data/1801170/000119312520316032/d69158d424b3.htm#toc69158_24), they would soon realize that the CEO has most of his interest in the company tied to the stock – he does not receive a salary. More importantly, both CEO and President performance-based incentive plans do not kick in until CLOV reaches and maintains a volume weighted average price of $30 for a 90-day period. Consider also, **Lee Shapiro who sits on the board of Clover Health is the former CFO of Livongo (now part of TDOC, ARK fav) while Chelsea Clinton adds serious weight and is actively involved as a board member.**\n8. **Valuation:** SPAC merger docs value the company at $3.7B. Currently, because of the short seller report and the massive short-interest in the company, it is valued at \\~$3B, which is \\~4x 2021E sales. With projected revenues for 2021 of $835M (mid-point), and applying a 8x sales multiple, Clover’s valuation needs to be at least $6.7B+ market cap implying a $16+ PT. With expected 24%+ growth in 2021, and premium multiple for high growth companies (note that the float is only 25% of shares outstanding), I believe a $20-25 target is more in line with current valuations. When medicare eligible age limit is lowered to 60 by Biden later this year or perhaps early next, this PT will need to be re-evaluated…upward. Also consider the fact that this company is NOT zero revenue now, promising billions in 2025 and beyond….it had sales of $670M in sales in 2020 and growing!! Consider also that the industry-leader in the telehealth space – TDOC – and a Cathie Wood &amp; ARK fav currently trades at 16x sales. Similar multiple for CLOV implies a $33 PT.  \n***TLDR: Whichever way you cut it, CLOV is very undervalued right now. Near term $25-30 PT and longer term has LMND-like potential in healthcare insurance***\n\nI am long CLOV because I believe that it is trying to solve a very hard and complex problem in healthcare. It deserves a lot more credit and people rooting for it to succeed.",
        "subreddit": "wallstreetbets",
        "title": "why CLOV will explode sooner or later (DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n39wvn/why_clov_will_explode_sooner_or_later_dd/",
        "created": 1620001353.0
    },
    {
        "author": "Certain_Cobby03",
        "created_utc": 1621202073,
        "id": "ndyzxa",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "Hello everyone! I do't know if you guys will be looking at this on the weekend...\n\nI was hoping some more experienced investors could provide some advice for me, a new trader.\n\nI turned 18 at the beginning of this year and created a brokerage account (TD Ameritrade). I put my savings (about 5k) into some ETFs with good dividends, Grayscale crypto trusts, and bought 1 share of ABBV (bought in mid-March), BRK-B, XOM, CVX and REGN (which I bought in early March). I recently put in another few thousand into some tech stocks that fell a lot early this week - CRM, NVDA, BIDU, BABA, XLK, U, along with a few others. My money has grown a fair amount.\n\nSo, should I put some more money into tech stocks and other stocks that fell this week? If so, which ones should I have on my watchlist?",
        "subreddit": "stocks",
        "title": "Is now the time to buy tech stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/ndyzxa/is_now_the_time_to_buy_tech_stocks/",
        "created": 1621230873.0
    },
    {
        "author": "Hubbyhog",
        "created_utc": 1620450008,
        "id": "n7hr9d",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "So I left this as a comment but thought it would make a worthwhile post. The below 11 holdings (of 43) and constitute 52% of my portfolio. They are my current main plays, and I do detailed DD at 4% or if I see myself increasing my holding to 4%, and are long term hold. \n\n&amp;#x200B;\n\nFeedback / questions / comments welcome. Happy to go into more detail, but for now have just done a very brief rationale for my positions: \n\n&amp;#x200B;\n\n \n\n**£ Hollywood Bowl:** 8.35%. Love this company, branding, numbers (pre-Covid), great management, solid track record and steady growth (also pre-Covid)\n\n**$ Microsoft:** 6.00%. It's just a great company doing well. Diverse, growing, and hungry. It's a growth and divi growth play\n\n**$ BMY:** 5.36%. Obviously disappointing results, but the treatments they have I believe will recover, plus solid looking pipeline at fairly advanced stages\n\n**$ AT&amp;T:** 4.67%. I'm bullish and like what I see, from wireless to HBO. I work in backend telco systems and I delved into the Jan QTR end figures for their wireless division and loved what I saw, so increased my holding materially before the latest very impressive results\n\n**$ EPD:** 4.56%. Defensive and divi, feels undervalued, I like that it has a significant pipeline network built, port and storage infrastructure, significant LNG exposure, and had pretty robust results consider 2020 (commodity prices, Texan weather and Covid dampening demand.\n\n**£ Games Workshop:** 4.52%. Crazy margins, great CEO / management, expansion possibilities, lore on point. It's up 23x over 5 years with divi reinvested, 18x without, it's a beast that'll be in the FTSE100 end of 2023, likely sooner.\n\n**£ Sage Group:** 4.23%. Bit un-noticed but does HR / payroll / finance and is geographically well diversified and under loved. Legacy tech but I like it, divi and buybacks. I generally feel CRM systems (Salesforce most notable) get all the attention because obviously they're meant to drive sales, but other internal systems matter and are in desperate need of modernisation. (If you want a sexier but higher risk play if you accept this logic, consider Workday)\n\n**£ Fevertree Drinks:** 3.8%. Convinced this company will be a monster, and maybe the next Monster. Originally a tonic specialist for Gin, it's targeting both international and other mixers for expansion. Market hugely over-reacted to decent results considering Covid, and I opened a sizeable position. \n\n**$ CACI International:** 3.77%. Also a bit unnoticed, it's a software meets military intelligence and Gov IT company. No divi, and they are quite clear they have no intention of it (literally a Buffett approach, we can use the money better than you.. :)), but winning contracts and very deeply ingrained with US Gov / military.\n\n**$ HBAN**: 3.76%. Regional US bank digesting an acquisition. I like the direction. Recent numbers were so-so and dipped to $14.50, which is was a chance for me to add 80% to my previous holding. \n\n**$ HUN:** 3.2%. Funny story here, I found this by accident when HBAN dipped to $14.50 as was looking for data to understand that drop and put in \"Hunt\" for Huntingdon Bancshares (HBAN) and accidently went to Huntsman Corporation (HUN). Lucky for me I guess, as I was curious and liked what I saw. I was frantically buying under $28, and although the shares shot up following good results and a 15% divi increase, I still like it. I see nobody talking about them,  but they have made significant changes to their business over the last couple of years, so although revenue is falling, earnings are looking great. It's become a leaner business with a war chest for suitable acquisitions, seems undervalued and has a respectable and now fast growing divi.",
        "subreddit": "stocks",
        "title": "My top holdings and why I hold them",
        "url": "https://www.reddit.com/r/stocks/comments/n7hr9d/my_top_holdings_and_why_i_hold_them/",
        "created": 1620478808.0
    },
    {
        "author": "cclagator",
        "created_utc": 1622484676,
        "id": "np9leg",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** finished the week inside its expected move, up 1.1% vs the 1.4% move options were pricing. The VIX was down on the week, into the holiday weekend, from 20 to a Friday close below 17.\n\n**This Week – SPY** options are pricing a **1.1%** move (in either direction) for the upcoming 4 day week. That corresponds to about **$415** as a *bearish consensus* and **$425** as a *bullish consensus*.\n\n**Expected Moves for This Week**\n\n* SPY **1.1%**\n* QQQ **1.5%**\n* IWM **1.6%**\n\n### In the News\n\nMeme stocks were back in the news last week with some large moves higher before some selling on Friday. Expected moves for this week:\n\n* **AMC** AMC **30%**\n* **Gamestop** GME **13%**\n* **Virgin Galactic** SPCE **11%**\n\n### Expected Moves for Companies Reporting Earnings\n\nEarnings season quiets down a little this week but there are still reports from Zoom, Crowdstrike, Docusign, Broadcom and more.\n\nHere is a look for at this week (links go to the Options AI Calendar / Expected move page, free to use):\n\nTUESDAY\n\n**Zoom** ZOOM / [Expected Move: **7.4%** ](https://tools.optionsai.com/earnings/ZOOM)/ Recent moves: -9%, -15%, +41%\n\n**Canopy Growth** CGC / [Expected Move: **11%**](https://tools.optionsai.com/earnings/CGC) / Recent moves: +12%, +5%, +8%\n\n**Ambarella** AMBA / [Expected Move: **7.4%**](https://tools.optionsai.com/earnings/AMBA) / Recent moves: 0%, +15%. -10%\n\nWEDNESDAY\n\n**Splunk** SPLK **/** [Expected Move: **7%**](https://tools.optionsai.com/earnings/SPLK)[ ](https://tools.optionsai.com/earnings/WMT)**/** Recent moves: -3%, -23%, -1%\n\n**Cloudera** CLDR / [Expected Move: **9%**](https://tools.optionsai.com/earnings/CLDR) / Recent moves: -13%, +7%, -12%\n\n**Netapp** NTAP / [Expected Move: **5.5%**](https://tools.optionsai.com/earnings/NTAP)[ ](https://tools.optionsai.com/earnings/LMND)/ Recent moves: -15%, +9%, +4%\n\nTHURSDAY\n\n**Broadcom** AVGO / [Expected Move: **3%**](https://tools.optionsai.com/earnings/AVGO)[ ](https://tools.optionsai.com/earnings/CRM)/ Recent moves: +1%, -1%, +3%\n\n**Crowdstrike** CRWD / [Expected Move: **6%**](https://tools.optionsai.com/earnings/CRWD) / Recent moves: +6%, +14%, -9%\n\n**Lululemon** LULU / [Expected Move: **5%**](https://tools.optionsai.com/earnings/LULU) / Recent moves: -3%, -7%, -7%\n\n**Docusign** DOCU/ [Expected Move: **6%**](https://tools.optionsai.com/earnings/DOCU) / Recent moves: -7%, +5%, -11%\n\n**Plug Power** PLUG / [Expected Move: **8%**](https://tools.optionsai.com/earnings/PLUG) / Recent moves: -14%, +8%, -15%\n\n**Five Below** FIVE / [Expected Move: **6%**](https://tools.optionsai.com/earnings/FIVE) / Recent moves: -4%, +4%, +8%\n\n&amp;#x200B;\n\nLet me know anything I missed in the comments.",
        "subreddit": "options",
        "title": "Expected moves this week. Zoom, Crowdstrike, Lululemon and meme stocks.",
        "url": "https://www.reddit.com/r/options/comments/np9leg/expected_moves_this_week_zoom_crowdstrike/",
        "created": 1622513476.0
    },
    {
        "author": "DayLate10kShort",
        "created_utc": 1622348841,
        "id": "no3ede",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Jim Cramer wants CEO of AMC, Adam Aron to \"take advantage of the situation\" and issue 2-3 billion of new AMC shares. This move would dilute the stock and drive AMC prices down. The point of issuing more shares would be to help AMC raise capital on the backs of WallstreetBets. If the CEO Adam Aron decided to \"take advantage of the situation\" I am walking away from AMC\n\n#2 Jim Cramer is trying to promote BYND (beyond meat) He has owned it for years and is trying to make a play on WSB by constantly saying it's Shorted 25% DONT BUY BYND! No one is with you.\n\n https://www.thestreet.com/jim-cramer/stock-market-advice-cramer-live-amc-gme-cost-crm-may-28",
        "subreddit": "wallstreetbets",
        "title": "Jim Cramer is AGAINST WallstreetBets - Asks AMC CEO Adam Aron to issue more shares equal to 2-3 billion",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/no3ede/jim_cramer_is_against_wallstreetbets_asks_amc_ceo/",
        "created": 1622377641.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1622147570,
        "id": "nmgwfh",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/05/27/salesforce-crm-earnings-q1-2022.html\n\nEarnings: $1.21 per share, adjusted, vs. 88 cents per share as expected by analysts, according to Refinitiv.\n\nRevenue: $5.96 billion, vs. $5.89 billion as expected by analysts, according to Refinitiv.\n\nThis stock is up 4% after market close. It could complete the slack acquisition soon and the stock will be able to compete with other companies more efficiently. This is still one of the good cloud stock among several big cloud players. It is still in the consolidation period so investors can still buy and hold crm.",
        "subreddit": "stocks",
        "title": "Salesforce growth accelerates as company offers strong guidance for coming fiscal year",
        "url": "https://www.reddit.com/r/stocks/comments/nmgwfh/salesforce_growth_accelerates_as_company_offers/",
        "created": 1622176370.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1621278090,
        "id": "neopmk",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Some clues.\n\n1. Drew Houston is on the board of directors of Facebook as of 2020.\n\n2. Dropbox is building it's marketting and collaboration tools, and no longer has a central office.\n\n3. Facebook workplace has grown to 7 million users.\n\n4. Dropbox has over a decades worth of stored images and files.\n\n5. Dropbox has acquired business tools like Docsend and Hellosign to compete with Adobe and Docusend.\n\n6. Dropbox is well integrated with Facebook already in terms of file transfer and chat tools.\n\n7. Dropbox is ubiquitous in integrations across platforms like Zoom, Slack, and other major internet properties.\n\n8. Dropbox is fundamentally undervalued from a financial perspective, which makes it cheap for Facebook.\n\n9. Facebook has recently acquired Kustomer, which is a customer-service and chatbots tool centered around their Shops.\n\n10. Collaboration competitors like Adobe have acquired workfront. Salesforce has acquired slack. Microsoft has teams. Facebook will have Dropbox.\n\n11. Both companies are blue.\n\n\nIn my view, I would not be surprised to see Facebook pick up Dropbox.",
        "subreddit": "wallstreetbets",
        "title": "Hear me out. Facebook will acquire Dropbox. 11 puzzle pieces why.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/neopmk/hear_me_out_facebook_will_acquire_dropbox_11/",
        "created": 1621306890.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621869346,
        "id": "nk0ajr",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "options",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/options/comments/nk0ajr/historical_post_earnings_moves_mega_compilation/",
        "created": 1621898146.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1622485255,
        "id": "np9sys",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation AND Analysis (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 7 of the Historical Post Earnings Moves MEGA Compilation. Although it's a short week this time round, there are still  a surprising ammount of companies posting, meaning there's good money to be made! That being said, earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Although risky, Digital Turbine options are inefficiently priced.** Similar to ZScaler last week, Digital Turbine has the gambler's edge this week. Historically, Digital Turbine moves roughly 8% post earnings, but the options chain is only pricing in a 5% move this time round. Furthermore, across the past 10 earnings reports, Digital Turbine has moved an average of *15%*, giving us an insane edge. Unfortunately, the direction this could go is a complete tossup. Digital turbine is sitting at 4 month lows indicating the potential for a moonshot, and they also postponed earnings by one week, indicating that there's something going on behind the scenes. They claimed they postponed due to the \"anticipated completion of a recently announced acquisition\", leading me to believe they plan to drop some announcements regarding the merger during the ER call, which could be incredibly bullish. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills, or a call debit spread.\n\n&amp;nbsp;\n\n- **Scotia Bank earnings are very likely priced in already.** While the 5 other major Canadian Banks reported earnings last week, Scotia Bank has been banished to this week. Unfortunately for us, we can't make a collateral play on it since it's followed the *exact* price action as the other 5, while still not reporting earnings. The other banks have gone up roughly 2-3% during earnings week, and scotia bank followed suit on no catalysts. Expect Scotia Bank to stay flat or go down post earnings unless they managed to create money out of thin air, or put forward some insane guidance.\n\n&amp;nbsp;\n\n- **Slack has capped upside due to the SalesForce acquisition.** Although you may look at the historical moves and options pricing and think it's an absolute steal, I would avoid playing this ticker entirely. The details of the acquisition state that shareholders will get $26.79 in cash and 0.0776 shares of Salesforce stock in exchange for each share of Slack on the day of the merger. If you run the numbers, this equates to roughly 45$ per share of Slack. With Slack currently trading at 44$, it leaves us with less than 2% upside on this trade - absolutely abysmal odds and return. Slack has no reason to breach 45$ either, as then shareholders would be paying more for less come the merger.\n\n&amp;nbsp;\n\n- **Similar to last week, liquidity is suspect**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\nObviously, since I gave data on over 35 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation AND Analysis (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/np9sys/historical_post_earnings_moves_mega_compilation/",
        "created": 1622514055.0
    },
    {
        "author": "ThinkValue2021",
        "created_utc": 1620426708,
        "id": "n7av4a",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Full report: [https://datastudio.google.com/s/pO1DcwglE7w](https://datastudio.google.com/s/pO1DcwglE7w)  \n**In short, they are still growing on most segments, the CEO does smart acquisitions (usually at a bit of a premium).**\n\n\\--The Business--\n\nMicrosoft is a technology titan focused on commercial and industrial applications with software and solutions such as Office 365, Azure, Microsoft Teams, Dynamics 365, Linkedin, Windows 10. They also provide platforms for developers via Visual Studio Code and Github. A smaller segment of Microsoft are their devices and their games division powered by Xbox.\n\n**--Next Moves: Healthcare Applications--**\n\nThe healthcare sector is characterized by massive bureaucracy and opportunities for growth. It is one of the rare sectors where real future growth is possible by innovation. Microsoft has established itself as a corporate and industry suite, but now it seems that they are taking their whole Eco-system and moving on the healthcare industry.\n\nThis is pure speculation, but it can be one of the boldest moves yet, as healthcare facilities, operations, education, training, quality control are large complex systems that can benefit from the tools and services that the company offers.\n\nWe have seen Microsoft positioning for a certain client type and taking over most of their business. As the opportunities for growth in the corporate sector decrease, Microsoft might just turn to one of the most complex industries with high barriers to entry and large upfront investment costs.\n\nOn 11 April 2021 they entered into an agreement to acquire Nuance Communications for $ 56 per share, or $19.7 Billion. Nuance is a cloud and artificial intelligence (“AI”) software provider with healthcare and enterprise AI experience, and the acquisition will build on our industry-specific cloud offerings. This is effectively their foot in the door to the healthcare industry.\n\n**--Value--**\n\nI think that the company is trading around its intrinsic value, with potential for growth in the future. There is inflation related market risk that can push down value, but with proper management and pricing flexibility they can at least sustain current value levels.\n\nMicrosoft solidified the cloud for the corporate &amp; business sector, and decreased the risk of their sales by adopting a continuous subscription model for most of their services.\n\nTheir business model seems to be growth trough innovation as they are positioning themselves precisely in segments where innovation is lacking and are integrating those segments within their high-barrier to entry, complex systems.\n\n\\--**Product Breakdown--**\n\nAZURE:  The backbone of the productivity suite for most of the western corporations \n\nOffice:  Stabilized revenues for essential business tools\n\nWindows 10:  Declining bloatware built upon old architecture \n\nLinkedIn:  Well positioned, profitable social network with long-term commuted users \n\nDynamics/Viva:  A major competitor for CRM/ERP market-share with potential for innovation \n\nPowerApps:  The future tool for cutting operating expenses and bureaucracy for companies \n\nDevices: Uncertain potential for a better experience for Windows users. Augmented reality done right with industry application\n\nGitHub, VS Code:  The platforms that will keep MSFT on the cutting edge of development tech\n\nGaming/Xbox: Large but risky potential for growth if the devices and games are improved\n\nMicrosoft has a wide and complex set of products and services which can be understood as cost cutting tools for businesses, system architecture utilities, productivity and effectiveness tools. \n\nThey have created a well-thought off interconnected Eco-system that is nothing like the company was even five years ago.\n\nIt is now apparent that they are well positioned as a market leader for industrial and business applications and will further solidify their position in the future.\n\n\\--Competition--\n\nWe are already witnessing the convergence of competitive advantages between the technology titans of Amazon, Google, Microsoft, Facebook, and it is clear that all of them are fighting for market share in similar technologies and industries. \n\nIt seems that every company is fighting for their specific industry positioning within technology. For example, Facebook, Microsoft and Google all experiment with Virtual Reality tools such as Google Glass, Oculus Rift and the HoloLens Headset from Microsoft. However MSFT seems to be the most successful as it is positioning for industrial, military and hybrid workspace applications for the headset - the others had less luck in the consumer/gaming sector application of VR.\n\nGoogle, Amazon and Microsoft are likewise competing for cloud dominance, where Amazon AWS is positioning as a cost effective player for developers, MSFT is positioning as a stable and secure platform for companies and Google is positioning as an advanced cutting edge option for new technologies and companies that are able to scale.\n\nThe last example is between MSFT and GOOGL where they competed for the use of virtual conference apps driven by the new hybrid work culture from the pandemic. Both of the competitors had a variant starting off, MSFT had Skype/Teams, and Google had Hangouts/Meet. It is evident that Microsoft had the right approach with Teams and took over the commercial sector for online communication. Side note, Skype is a drain on the Microsoft brand since the appearance of the pretend close feature. It is irredeemable and should be retired.\n\nDISCLAIMER: I do not own a MSFT position, I am planning to go long on MSFT next week.\n\nTHIS IS NOT INVESTMENT ADVICE, I AM NOT A PROFESSIONAL, I AM NOT TAKING INTO ACCOUNT YOUR GOALS AND SITUATION.",
        "subreddit": "wallstreetbets",
        "title": "I valued MSFT at $ 244, they are doing surprisingly well",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n7av4a/i_valued_msft_at_244_they_are_doing_surprisingly/",
        "created": 1620455508.0
    },
    {
        "author": "razsujemwn",
        "created_utc": 1621539762,
        "id": "nh9isb",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I know that nobody liked my previous theory about [Shipit.to](https://Shipit.to) and Amazon, but this time I think it's a legit find that puts us all ahead of the news. \n\n# Basics first for those who see it for the first time \n\nXigem Technologies - $XIGM on CSE and $2C1 on FSE - is a Canadian company, a technology provider for the remote economy. They have a patented app iAgent (CRM and remote business operations) in development and 5 LOIs with future clients. They also signed an agreement to acquire a P2P payment system FOOi last week, completely. And signed a LOI to acquire 21% of a shipping tracker company [Shipit.to](https://Shipit.to) in April - which is the subject of this post. \n\n# To the best part now\n\nNo new press releases to link, so check out this old one:\n\n[https://www.xigemtechnologies.com/xigem-technologies-announces-strategic-investment-in-logistics-technology-provider-shipit-to/](https://www.xigemtechnologies.com/xigem-technologies-announces-strategic-investment-in-logistics-technology-provider-shipit-to/) \n\n**Xigem Technologies Announces Strategic Investment in Logistics Technology Provider** [**Shipit.to**](https://Shipit.to)\n\n# Two things to highlight: \n\n1. Check the date - April 20, 2021\n2. Check the last paragraph (the one that nobody reads because it's always a disclaimer of some sort). The quote: \n\n&gt;Pursuant to the LOI, the Company (Xigem) will acquire a 21% interest in Shipit.to in exchange for US$200,000 in cash and US$863,291 in common shares of Xigem. In addition, the Company will appoint a representative to the Shipit.to Board of Directors. **The transaction is expected to be completed within the next thirty days**, subject to the execution of definitive agreements and the receipt of any regulatory approvals.\n\n**The \"next thirty days\" end today.** It's May 20, if I'm not out of my mind. \n\nIf it's real, they should publish the press release soon. Today, so late? Doubt it. Tomorrow seems to be more likely. Or on Monday. \n\nIt doesn't matter, because **you've got to look at the chart on April 20:** \n\nhttps://preview.redd.it/epjwrn5lpb071.png?width=929&amp;format=png&amp;auto=webp&amp;s=6861ebee535c35306c750a7d3a32b3689356a62f\n\nSorry for the graph quality but you see **the main point:** \n\n**Just a LOI with** [**Shipit.to**](https://Shipit.to) **sent it from 0,2 to 0,7. And now they have to close the deal in the upcoming days.** \n\nOf course there was also an Advisory board establishment on April 22, but the LOI - a forward-looking statement - started the way to 0,7. No other news were published until April 22, and no news were published before (from April 14 to April 20). \n\n**Mandatory reality check:** I'm not a financial advisor, and even worse - I understand that I might be a bit too excited to trade rationally now. No guarantees it will really happen. No guarantees it will triple the stock again. Maybe less, maybe more. I'll get a cold shower before loading my bags before the closing. If you have any ideas why I can be wrong, please tell me.  \n\n# Short version\n\nWhen Xigem Technologies announced a forward-looking LOI on agreement with [Shipit.to](https://Shipit.to) on April 20, the stock nearly tripled. **Today** (May 20) is the deadline for this exact deal to turn from a forward-looking statement, a promise, into a real transaction and a real part of their portfolio. I think they will not announce it today, but will keep it till tomorrow or Monday. I think it's the end of the discount, so I decided to bring it here as a theory before the news - if there will be any - will make it to the public.",
        "subreddit": "pennystocks",
        "title": "$XIGM and Shipit LOI deadline - Today. Closing of the agreement that tripled the stock might be coming - THEORY",
        "url": "https://www.reddit.com/r/pennystocks/comments/nh9isb/xigm_and_shipit_loi_deadline_today_closing_of_the/",
        "created": 1621568562.0
    },
    {
        "author": "cclagator",
        "created_utc": 1621794443,
        "id": "njdshw",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** finished the week inside its expected move, down about 0.5% vs the 1.5% move options were pricing for the week. The VIX closed just above 20, slightly higher on the week.\n\n**This Week – SPY** options are pricing a **1.4%** move (in either direction) for the upcoming week. That corresponds to about **$410** as a *bearish consensus* and **$42**1 as a *bullish consensus*.\n\n**Expected Moves for This Week** via [**Options AI**](https://www.optionsai.com/):\n\n* SPY **1.4%** (slightly less than last week)\n* QQQ **1.9%** (same as last week)\n* IWM **2.3%** (slightly less than last week)\n\n### \n\n### In the News\n\nCrypto currencies remain front and center. Expected moves for this week:\n\n* Bitcoin: **15%**\n* Ethereum: **20%**\n\nCrypto related stocks:\n\n* **Coinbase** COIN **7%**\n* **Riot Blockchain** RIOT **14%**\n* **Marathon Digital** MARA **14%**\n\n&amp;#x200B;\n\n### Expected Moves for Companies Reporting Earnings\n\nEarnings season continues with reports from Salesforce, Nvidia, , Best Buy and more. Here is a look at this week's earnings moves (links go to the Options AI Calendar / Expected move page, free to use):\n\nTUESDAY\n\n**Intuit** INTU / [Expected Move: **3%** ](https://tools.optionsai.com/earnings/INTU)/ Recent moves: +4%, -4%, +2%\n\n**Toll Brothers** TOL / [Expected Move: **6%**](https://tools.optionsai.com/earnings/TOL) / Recent moves: +3%, -8%, -2%\n\n**Nordstrom** JWM / [Expected Move: **9%**](https://tools.optionsai.com/earnings/JWN) / Recent moves: -3%, +12%. -5%\n\nWEDNESDAY\n\n**Nvidia** **NVDA /** [**Expected Move:** **5%**](https://tools.optionsai.com/earnings/NVDA)[ ](https://tools.optionsai.com/earnings/WMT)**/ Recent moves: -8%, 0%, 0%**\n\n**Snowflake** SNOW / [Expected Move: **8%**](https://tools.optionsai.com/earnings/SNOW) / Recent moves: +1%, +16%\n\n**Workday** WDAY / [Expected Move: **5%**](https://tools.optionsai.com/earnings/WDAY)[ ](https://tools.optionsai.com/earnings/LMND)/ Recent moves: -2%, -9%, +12%\n\n**Okta OKTA** / [Expected Move: **6%**](https://tools.optionsai.com/OKTA) / Recent moves: -6%, +5%, -5%\n\nTHURSDAY\n\n**Salesforce** CRM / [Expected Move: **5%** ](https://tools.optionsai.com/earnings/CRM)/ Recent moves: -6%, -9%, +26%\n\n**Best Buy** BBY / [Expected Move: **6%**](https://tools.optionsai.com/earnings/BBY) / Recent moves: -9%, -7%, -4%\n\n**Costco** COST/ [Expected Move: **3%**](https://tools.optionsai.com/earnings/COST) / Recent moves: -1%, +1%, -1%\n\n**Autodesk** ADSK/ [Expected Move: **5%**](https://tools.optionsai.com/earnings/ADSK) / Recent moves: -3%, +5%, -2%\n\nThe expected move can serve as a gut check for any existing position or new trade. Traders can also use the expected move for strike selection, with a comparison of a trade's breakeven vs the expected move an obvious indication of likelihood of success.\n\nHere’s an example of using the expected move to generate an Iron Condor that “sells the move” in CRM. The Condor looks to profit if CRM stays within its expected move following earnings. It is a max gain between 212.50 and 232.50. If the stock moves beyond what options are pricing, the Condor is a max loss (with defined risk):\n\n*Processing gif 9m8yu14wxw071...*\n\nLet me know in the comments anything I missed that's of interest.",
        "subreddit": "options",
        "title": "Expected moves this week. Nvidia, Salesforce, Snowflake, Costco, BTC and more.",
        "url": "https://www.reddit.com/r/options/comments/njdshw/expected_moves_this_week_nvidia_salesforce/",
        "created": 1621823243.0
    },
    {
        "author": "debussyxx",
        "created_utc": 1621521536,
        "id": "nh1y0o",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I’m Well aware that longer term options won’t have anywhere near the magnitude of change in implied volatility as shorter term options after events such as earnings (but obviously the Vega will be greater on the leaps though). But I’m wondering if anyone has that a study or knows of a study that looks at the effects on leaps say 1 to 2 years out for earnings events? I often do PMCC and so sometimes I wonder if I should sell the leaps before the earnings because I’ll get an IV crush on the leaps and then potentially rebuy after. \n\nBasically wondering this for Salesforce (CRM) next week whether I should sell my leap now because I don’t want to be IV Crushed. I have two for for January 2022 and January 2023.",
        "subreddit": "options",
        "title": "Effects of earnings on LEAPS. IV crush or nah?",
        "url": "https://www.reddit.com/r/options/comments/nh1y0o/effects_of_earnings_on_leaps_iv_crush_or_nah/",
        "created": 1621550336.0
    },
    {
        "author": "mantegarvitrow5zv",
        "created_utc": 1620669167,
        "id": "n9bfkq",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Ticker: **$XIGM**\n\n**Why though:** After seeing it in April I decided «why not, I love myself some cheapies», it was on my watchlist, I did some research and jumped on board. Turns out it was a really good idea, because in that said month $XIGM made a full transformation from «a company with an app with some clients and a 21% share in a shipping industry» into a complete ecosystem with a role in the remote economy.\n\n# What is Xigem - what they do\n\nXigem is a technology company from Toronto, with iAgent (Xigem Platform) as their main asset. Also, it works on a portfolio of companies in various industries of the emerging trillion dollar remote economy. I'll cover the whole thing later in the text.\n\nMore - here, not to make it long: [https://www.xigemtechnologies.com/](https://www.xigemtechnologies.com/)\n\n# iAgent - what is\n\n**iAgent (or Xigem Platform)** is a mobile, cloud-based, geo-targeted customer acquisition and retention app, U.S. patented and Canadian patent-pending. Basically - an app (available in browser as well) to match sales and services with consumers, with a full real-time control of the operation.\n\nHere’s a website [https://iagenttechnologies.com](https://iagenttechnologies.com/) you can watch a video there on the functions, or check the details in the prospectus, it was published on SEDAR on February 26, I just can’t post a link here for some reason.\n\n# Tl;dr - what happened lately:\n\nIt turned from an «ambitious company» with nothing but forward-looking statements into a perspective one-stop-shop solution for all kinds of businesses and gathered a portfolio of companies in exploding markets, set to hit the market this summer.\n\n**A month ago they’ve had:**\n\n2 LOIs with perspective clients\n\n**FluBusters**\n\n[https://www.flubusters.com/](https://www.flubusters.com/)\n\n&gt;Health Canada approved company in the disinfection market, with 3000 employees.\n\nAnd their own Germs Be Gone (I laughed hard at the name) sanitizer.\n\nBy the way, global sanitizers market is $2,64 Billion by now and set to grow **21.75% by 2027. A good client.**\n\n**ISI**\n\n[https://insurance-supermarket.ca/](https://insurance-supermarket.ca/about-us.html)\n\nDespite the fact that I’m not the biggest fan of insurance companies, with\n\n&gt;..a client base of **100,000** Canadians, totalling to more than **10 billion dollars** in benefits\n\nISI looks like a good perspective client as well.\n\n**ISI is the original developer of Xigem’s main app** \\- iAgent. From my understanding, they didn’t find a way or resources to fully implement it in their workflow, and Xigem acquired it in an almost ready state to scale the thing and make it bigger. Spoiler: they did.\n\nOn April 27, they’ve added **Baketree** to the list. It’s a US baking company that will use XIgem Platform to manage their distribution network.\n\n[https://www.xigemtechnologies.com/xigem-technologies-to-develop-remote-technology-platform-for-baketree-inc/](https://www.xigemtechnologies.com/xigem-technologies-to-develop-remote-technology-platform-for-baketree-inc/)\n\n&gt;The U.S. bakery products market has been estimated at **US$94 billion in 2020**, with the global market expected to grow at a compound annual **growth rate of 3.9% through to 2027**.\n\nAgain, looking good as a client, and you can actually get their danish rolls in the US.\n\n**These 3 are huge, guaranteed, but just limited clients.**\n\nAdditionally, Xigem [decided to roll out](https://www.xigemtechnologies.com/xigem-technologies-to-launch-out-of-the-box-version-of-iagent/) a universal version for small and medium enterprises with CRM. **SMEs are estimated to represent over 90% of all businesses, 60-70% of employment and 55% of the World GDP.** It would be weird not to make something out-of-the-box at some point. Now basically any company can get Xigem Platform, when it will hit the market, and with CRM - it’s a bigger thing than just a monitoring app.\n\n# Now - to the most interesting part. The portfolio.\n\nFirst - there's [Shipit.to](http://shipit.to/), a shipment tracking company from Israel. In fact, the **$1,1 Mil acquisition** was the start of their portfolio. Later, [Shipit.to](http://shipit.to/) signed **a new airline - AirBridge Cargo**, in addition to Lufthansa, Korean Air and a dozen of others. $XIGM assets are developing as well.\n\n# So what makes a new DD justified?\n\n**Today Xigem announced a new LOI - with FOOi Inc.** It’s a P2P mobile payment system, and they didn’t just get a share or agreed to sign a contract in the future. They basically bought it completely, with the whole team of developers, clients, and so on. Direct quote [from here](https://ca.finance.yahoo.com/news/xigem-technologies-enters-fintech-market-060000671.html):\n\n&gt;the acquisition of substantially all of the assets of FOOi Inc. for consideration of $500,000\n\n# What did they just buy:\n\nFOOi website: [https://www.fooi.ca](https://www.fooi.ca)\n\n(note: Fooi means “Tip” in Dutch)\n\nA review by Itbusiness: [https://www.itbusiness.ca/news/fooi-the-tipping-point-in-cashless-transactions-in-canada/114304](https://www.itbusiness.ca/news/fooi-the-tipping-point-in-cashless-transactions-in-canada/114304)\n\n**My understanding:** A peer-to-peer/charity/business money transaction system with simplicity of the process as the key feature.\n\nI know that P2P is not exactly a new thing, but FOOi looks like it hits the competitors in the weak spots:\n\n**Venmo** is all about personal info and it charges 3%, **Zelle** doesn’t work with half of banks and cards, **Cash App** charges fees even for a deposit, and I don’t even won’t to start **PayPal** commissions rage.\n\nFOOi charges only for withdrawal, **no extra fees**, doesn’t require email/phone, can keep you anonymous, processes the transaction instantly, and works on any smartphone - not limited to iOS-only or Android-only.\n\nIt's a nice market with a lot of room to grow, not just in Canada, but globally:\n\n[https://www.globenewswire.com/news-release/2020/10/26/2114054/0/en/Global-4-49-Billion-Peer-to-Peer-P2P-Payment-Market-Outlook-to-2027.html](https://www.globenewswire.com/news-release/2020/10/26/2114054/0/en/Global-4-49-Billion-Peer-to-Peer-P2P-Payment-Market-Outlook-to-2027.html)\n\n&gt;Global P2P Payment Market is expected to reach **$4,491.14 million by 2027**, growing at a CAGR of 11.8% during the forecast period.\n\nAnyway, that’s just about FOOi. I didn’t go deep enough into the analysis to scream «It’s the new STRIIIIIPE» at the top of my lungs, it just looks like a perspective project that you can use right here right now.\n\n# FOOi+Xigem= ???\n\nThe most important part is that they say **FOOi won’t be just a separate thing, it will be also integrated into the Xigem Platform.**\n\n**This fact kind of changes everything, and heres a** [direct quote](https://ca.finance.yahoo.com/news/xigem-technologies-enters-fintech-market-060000671.html)**:**\n\n&gt;Integrated with iAgent, Xigem's platform technology, FOOi can create a unique environment for the Company's clients and their users.\n\nThey seriously plan to integrate it.\n\nTo cut it short, iAgent now can do:\n\n* Customer acquisition;\n* CRM;\n* Service management and geo tracking of nearest employees (from a browser tab);\n* Network and field management;\n* Real-time control of the tasks;\n* And finally - **seamless instant payments**.\n\nCorrect me if i’m wrong, but it LOOKS like a real problem-solver ecosystem for business owners who deal with a lot of network, people and asset management. Something that saves money, time, cuts risks and expenses. Also a convenient thing for clients. They should teach it to deal with taxes and do mailing lists now.\n\nIn addition - Xigem portfolio is now worth of 1,6 Mil, and growing (shipit - with new airlines, FOOi - with new clients). And some other developments:\n\n# Advisory Board:\n\n* **Avi Greenspoon** as the inaugural member, Executive Vice President and General Counsel of III Dune Capital Partners Limited. Full guy's bio here[https://ca.finance.yahoo.com/news/xigem-technologies-names-wei-lin-060000812.html](https://ca.finance.yahoo.com/news/xigem-technologies-names-wei-lin-060000812.html)\n* **Wei Lin**, CEO and co-founder of Project Genesis, which focuses on consolidating e-commerce brands, starting with Amazon third-party sellers. Wei is also a co-founder of Lightheart Management Partners. Again, full guy's bio[https://ca.finance.yahoo.com/news/xigem-technologies-establishes-advisory-board-060000452.html](https://ca.finance.yahoo.com/news/xigem-technologies-establishes-advisory-board-060000452.html)\n\n# And financials\n\nI actually tried to do something on this and it didn't get really successful, you can see in my post history. **Spoiler alert:** they don’t have a cashflow by now, it’s all going to start in the summer. So far we can trade on their FLS and LOIs. When it will start operating - it won’t be at this price point, I believe.\n\n**Shares, issued and outstanding:** 106 Mil\n\n**Market cap:** 44,7 Mil\n\n**Total funds available:** 2,02 Mil\n\nDebt: Settled, as they [announced](https://ca.finance.yahoo.com/news/xigem-technologies-announces-shares-debt-120000546.html):\n\n&gt;Xigem Technologies has entered into the debt settlement agreements with three arm's length creditors whereby the Company will settle outstanding payables totalling $76,000 through the issuance of 361,904 common shares.\n\nPrimary Revenue Models (SAAS)\n\n* The **basic** plan will be priced at **$100 per month**, as basic as it gets;\n* **Pro Plan** (will include 24-hour live chat customer support and more users) will be priced at **$350 per month**;\n* **Enterprise Plan** (up to 100 users) will be priced at **$5,000 per month.**\n\n**Alternative Revenue Models are:** Freemium, Recurring Payments, Per User Pricing and Per Feature Pricing. (All from Prospectus)\n\n# Technical Analysis\n\nI’m by no means good at it, but I tend to listen to the guys who know more than me, so here’s the **report from Morningstar**:\n\n[https://www.xigemtechnologies.com/wp-content/uploads/2021/05/Morningstar-Quantitative-Equity-Report-XIGM-April-28-2021.pdf](https://www.xigemtechnologies.com/wp-content/uploads/2021/05/Morningstar-Quantitative-Equity-Report-XIGM-April-28-2021.pdf)\n\nAt 0,68 price per share they said it was **30% undervalued** and the **fair price was around 1,01 per share**. Note that it was **BEFORE the FOOi and the CRM announcement.**\n\n# My plan?\n\nAfter looking at the order book, I see that there’s **no significant resistance up to 0,9**. The stock can easily go up. I have decided to break my investments in 2 parts on this one. 80% speculative and 20% investment. **I will sell 80$% at 0,85 and investment will be there forever (or until 1,5 lol).**\n\n# Instead of a conclusion\n\nI’m not a meme guy, suck at it and basically too old for it, but the format sums up the whole idea pretty good - and every statement is justified either in the links or in the text:\n\n**Xigem a month ago:** we have 2 future clients and will develop an app they will use, patents and plans, remote economy boom, ummm yeah that's it.\n\n**Xigem now:** we bought a 1 Mil share in transportation, got our own successful mobile payment app, doubled the number of signed clients, settled the debt, have an ecosystem that will solve a good half of every business problems, established an advisory board with a rich asian dude that works with China and Amazon and also a lawyer named Avi that knows half of the top management in Toronto, implemented CRM, and decided to make it all available to 70% of the world’s businesses by this summer. Yes, we’re still a cheapie at around 0,4 per share, why do you ask?",
        "subreddit": "pennystocks",
        "title": "Extensive DD on $XIGM Xigem Technologies - with the update",
        "url": "https://www.reddit.com/r/pennystocks/comments/n9bfkq/extensive_dd_on_xigm_xigem_technologies_with_the/",
        "created": 1620697967.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1622235294,
        "id": "nn7etx",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, May 28, 2021**\n\nStocks gained on Friday, with market participants encouraged by new economic data on consumer spending, income and inflation, and a strong Weekly unemployment report. The market has made a remarkable recovery, particularly in technology, after the market tumbled 4% following the April Consumer Price Index roughly two weeks ago. In my view, as I have said for weeks, the recovery in the market confirms that the initial sell-off driven by inflationary fears forcing the Federal Reserve to tighten monetary policy sooner than expected was overblown.\n\nNew government data on Friday showed personal income fell less than expected in April, but still pulled back after March's stimulus-fueled surge. Personal income fell by 13.1% in April compared to March, less than the 14.2% drop expected. This follows a 20.9% increase during March which had been buoyed by the distribution of $1,400 stimulus checks to most Americans. \n\nIn another report, the Department of Commerce reported core personal consumption expenditures increased 3.1% in April from a year earlier, blowing past the Fed’s traditional 2% target. Federal Reserve members consider the core PCE to be the gauge of inflation. The strong inflation readings reported by the Commerce Department on Friday had been widely anticipated as the pandemic's grip eases, thanks to vaccinations, and will have no impact on monetary policy. Fed Chair Jerome Powell has repeatedly stated that higher inflation will be transitory. Supply-chain constraints combined, labor shortages in certain industries, and rising demand as the US economy recovers from the coronavirus-induced recession have all contributed to higher inflationary readings. These are all factors that are widely considered transitory, meaning not permanent. In an April 28 statement, Federal Reserve Chair Jerome Powell said, “An episode of one-time price increases as the economy reopens is not likely to lead to persistent year-over-year inflation into the future. Clogged supply-chains won’t affect Federal Reserve policy because they’re temporary and expected to resolve themselves.” Moreover, he said “For inflation to move up in a persistent way that moves expectations up, that would take some time, and you would think it would be likely we would be in very strong employment for that to happen.” In other words, Powell is saying he expects issues driving inflation higher to resolve themselves moving forward and doesn’t expect inflationary pressures to materialize until the labor market further improves.\n\nIn remarks this week, members of the Federal Open Market Committee (FOMC), reiterated their stance that they were not yet concerned that new inflation data would force the Fed to tighten monetary policy sooner than expected. St. Louis Federal Reserve President James Bullard said he believed increases in inflation would be “mostly temporary” and that the Fed was “not quite there yet” when it came to discussing tapering its asset purchase program. In separate comments, Kansas City Federal Reserve President Esther George said she did not want the Fed to be “overly reliant on historical relationships and dynamics in judging the outlook for inflation.” \n\nRichard Clarida, Vice Chairman of the Fed, offered a slightly different view but one that is in-line with what the Federal Reserve has already said publicly in the past. Clarida said, “there will come a time in upcoming meetings” when the Fed would consider tapering the asset purchase program but that “it is going to depend on the flow of data”. The Fed is currently buying $120 billion a month in government-issued and government-backed securities, and has pledged to continue doing that until the economy is more fully recovered.\n\nThis reaffirms the market that the Fed is not on a set timeline when it comes to rolling back current accommodative policies and will, as they have said time and again, wait for concrete data before any considerations are made. This follows a similar statement from Jerome Powell back in April 14, which proves market participants shouldn’t worry about quantitative easing tapering, in my opinion. Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.”\n\nThe Department of Labor’s Weekly Unemployment Report showed jobless claims fell for the fourth straight week to yet another pandemic-era low, an encouraging sign that the labor market is improving following the extremely disappointing April Jobs report, which showed 266,000 new jobs added in the month, far below estimated of more than 1 million and a sharp deceleration in job growth compared to March. \n\n* **Initial jobless claims, week ended May 22:** 406,000 vs. 425,000 expected and 444,000 the week prior\n* **Continuing claims, week ended May 15:** 3.642 million vs. 3.680 million expected and a revised 3.738 the week prior\n\n**Highlights**\n\n* “Meme-stocks”, particularly AMC, were absolutely on fire this week, as the battle between wallstreetbets and hedge funds continues. \n* President Joe Biden unveiled a budget that would hike federal spending to $6 trillion for the coming fiscal year.\n* Boeing (BA) agreed to pay at least $17 million to settle enforcement cases with the Federal Aviation Administration over production issues with its 737 jets. Stock reacted positively to the news. \n* Durable goods orders, or orders for manufactured goods intended to last at least three years, unexpectedly declined in April, ending an 11-month streak of increases, the Commerce Department said Thursday, an encouraging sign. \n* Amazon (AMZN), Microsoft (MSFT) and Alphabet (GOOG, GOOGL) are all involved in a bidding process to provide cloud services to Boeing, according to multiple reports. \n* Disney’s (DIS) California-based parks will welcome non-California natives starting June 15.\n* **\\*\\*Please note that current price target was written pre-market and does not reflect intraday changes\\*\\***\n* AutoDesk (ADSK) target raised by Barclays from $335 to $340 at Overweight. Stock currently around $287\n* Burlington Stores (BURL) with a host of target raises. Average price target $365 at Overweight. Stock currently around $325\n* Costco (COST) with three target raises. Stock currently around $388\n   * Barclays from $400 to $450\n   * Stifel Nicolaus from $390 to $410 \n   * Telsey Advisory Group from $395 to $415\n* Salesforce (CRM) with three target raises after crushing earnings. Stock currently around $226\n   * Mizuho from $270 to $290\n   * Barclays from $276 to $285 \n   * Moness, Crespi &amp; Hardt $275 to $290\n* Dell Technologies (DELL) target raised by Morgan Stanley from $127 to $130 at Overweight. Stock currently around $100\n* Dollar General (DG) target raised by Citigroup from $250 to $260 at Buy. Stock currently around $205\n* Medtronic (MDT) with two target raises. stock currently around $125\n   * Deutsche Bank from $134 to $149 at Buy\n   * Oppenheimer from $134 to $147 at Outperform\n* Ulta Beauty (ULTA) with a host of target raises after crushing earnings. Average price target $400 at Buy. Stock currently around $328\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.” - Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, May 28, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/nn7etx/here_is_a_market_recap_for_today_friday_may_28/",
        "created": 1622264094.0
    },
    {
        "author": "10xEBITDA",
        "created_utc": 1620935316,
        "id": "nbplz7",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " On December 11th, 2020 after hours, Destination XL Group (OTC:DXLG) filed they are voluntarily delisting from the NASDAQ. The resulting sell-off took away over 1/3 of their market cap, at one point valuing the business below $10m. Management issued a concurrent press release highlighting their liquidity and promising FY21 guidance in mid-January. The reason for delisting was technical, but can present a buying opportunity. DXLG has weathered the actual delist without an additional drop, and has increased 554% from its lows. \nAn aggressive top line rebound coupled with an enhanced liquidity profile and long-term margin expansion due to the measures they took during COVID could propel this stock to ~$6-$8.5 per share.\n\nBusiness Description / Background\nDestination XL (DXLG) is the largest specialty retailer of big &amp; tall men’s clothing and shoes. The company operates 311 stores under the Destination XL and Casual Male XL banners.\nOverview\nCurrent Price Per Share: $1.45 (4/272021 Afterhours)\nPrice Target: $6.0 - $8.50\n\t- 8-10x multiple on $45mm of projected FCF\n52 WK High: 1.60\n52 WK Low: 0.18\nThere are 4 straightforward points to why DXLG is going to moon\n\t1) DXLG is an underappreciated COVID reopening beneficiary (people got fat during covid, and are going to be buying clothes for fat people from DXLG)\n\t2) Meaningful topline growth and company-specific initiatives will drive material uplift to top line growth and long-term profitability\n\t\ta. Like most retailers, DXLG took necessary steps during the pandemic to manage liquidity, furloughing staff, reducing management compensation, and trimming CapEx. Since COVID, the company has reduced their corporate workforce by 29% and their store workforce by 54%. More recently, management trimmed 45 corporate positions in an effort to save $9.7m annually. As we continue to reopen, sales are expected to trend slightly above 2019, resulting in 2021 in-store sales reaching 99% of 2019 levels. Layering in modest 11% yoy growth for direct, equates to revenue of $480mm (vs. guidance of 385-402mm). This, coupled with cost cutting initiatives could drive FY2021 FCF to $45mm.\n\t\tb. https://www.globenewswire.com/news-release/2020/11/20/2130861/0/en/Destination-XL-Group-Inc-Reports-Third-Quarter-Financial-Results.html\n\t3) Current valuation reflects material disconnect from the company’s underlying fundamentals, with stock previously being priced for bankruptcy. This disconnect is further proven by a recently  large volume of insider buying.  Management guided to at least 12 months of liquidity on the Nov-20 conference call, while an additional $17.5mm was raised through the issuance of a term loan in 2021.\n\t\ta. https://www.prnewswire.com/news-releases/pathlight-capital-agents-17-5-million-senior-secured-filo-term-facility-for-destination-xl-group-inc-301252497.html\n\t4) Apes just want moon; the internet loves explosive growth. If DXLG is uplisted from OTC there will be significant interest from retail investors for a stock that will likely have already increased 1,000% from those who do not currently have accounts able to purchase OTC securities.\nThrough research conducted, there is confidence that business trends have accelerated meaningfully into 1Q, with sales in-line or above 1Q19 levels. This, in tandem with the four aforementioned points, gets us to FY2021 revenue of ~$480mm (vs. guidance of $385-$402mm). Layering on +400 bps of merchandise margin expansion (due to reduced promotions) and the associated occupancy leverage drives our FY21 gross margin +150 bps above FY19 levels. Finally, after adjusting the company’s cost base for the structural cost take-out they have achieved, we arrive at the company generating $45mm of FCF ($0.85/share). Assuming an 8-10x FCF multiple implies a target price between $7-$8.50 (+467% to +580% upside).\n\t1) Underappreciated long-term Covid beneficiary\n\t- COVID has driven an increase in obesity which has been well documented in numerous studies (JAMA – Journal of the American Medical Association, the American Heart Association, and the Mayo Clinic have all published on the subject)\n\t\t○ For example, one study published in JAMA suggests the average American gained 7.08 lb.\n\t\t○ Unlike other retailers, DXLG benefits from a “captive” customer due to limited alternatives, enabling them to capture a significant portion of any incremental demand\n\t- Uniquely positioned - DXLG’s is uniquely positioned and will benefit disproportionately relative to its retail peers\n\t\t○ The company operates as the largest player in a niche market (big &amp; tall) with favorable competitive dynamics relative to other retailers\n\t\t○ Greater need for in-person fitting creates natural friction to e-commerce competition\n\t\t\t§ “[the] customer wants to come in and see how things fit, not the typical shopper” – former Director of CRM\n\t\t\t§ A “captive” customer base given limited alternatives within an already underserved segment of the market\n\t- Advantageous store footprint – positioned almost exclusively off-mall, allowing for a faster rebound once restrictions are loosened / overall consumer mobility increases\n\t- Pent up demand - demand from existing customer base to be magnified as customers need to replenish/replace their wardrobe due to weight fluctuations\n\t- Expanded core customer demographic - Anticipate step-function increase in the company’s core customer demographic / overall sales base post-Covid\n\n\t2) Meaningful top-line growth and operating leverage as sales rebound\n\t\n\t• Aggressive top-line rebound\n\t\t○ DXLG operates under two segments 1) In-Store and 2) Direct (online)\n\t\t○ In store revenue declined 49% in 2020, while direct grew 15%.\n\t\t○ On a per store basis, DXLG ended 2020 with in-store sales atr approx 63% of 2019 levels. Based on the research below, we can conclude sales have accelerated to approx. 80% \n\t\t○ As we continue to reopen, sales are expected to trend slightly above 2019, resulting in 2021 in-store sales reaching 99% of 2019 levels. Layering in modest 11% yoy growth for direct, equates to revenue of $480mm (vs. guidance of 385-402mm)\n\t\t○ Factoring in the significant cost cutting measures, this equates to ~$45mm of FCF.\n\t\n\t\n\t- The Company is executing on multiple company-specific initiatives to improve long-term profitability as sales come back faster than the market appreciates\n\t\t○ Highly predictive credit card panels (96.6% correlation) are indicating +30% growth Y/Y in 1Q (QTD), which when making certain assumptions when extrapolating the trend, should correspond to growth of +69% Y/Y in 1Q (or roughly 86% of 2019 sales)\n\t\t○ \n\t\t○ Dozens of channel checks across multiple geographies at the store level suggest accelerating sales from 4Q to 1Q, reaching sales volumes in-line or above 1Q19 levels – (“have been crushing 2019 comps since the 2nd week of March and there is no sign of it letting up” – store check)\n\t\t\t§ “everyone is similar, getting to even or up” – store check (in reference to 1Q trends vs. 2019)\n\t\t\t§ “everyday [we] are consistently beating goals” – store check\n\t\t\n\t\t○ Other independent channel checks/primary research (incl. working with the company’s former Chief Digital Officer) implies systemwide sales significantly ahead of plan and e-commerce sales of 30%+ Y/Y\n\n\t- Long-term margin expansion\n\t\t○ The company reduced operating expenses by $52mm as part of its effort to rationalize its cost structure throughout FY2020\n\t\t\t§ We estimate approximately 50% of the cost take-out is structural and will not return as top line recovers, driving meaningfully improved incremental margins\n\t\t\t§ The Company has eliminated 29% of its corporate headcount\n\t\t\t§ Consistent with the retail space broadly, and per our day-by-day analysis of historical promotions, the company has substantially dialed back its promotionality vs. both 2020 and 2019 levels, which will lead to substantial merchandise margin expansion sequentially\n\t3) Current valuation ascribes minimal value to the business\n\t- There is a reasonable path to DXLG generating $45mm of FCF, or $0.85/share of FCF (approx. 65% of current market cap)\n\t\t○ Assuming an 8-10x FCF multiple equates to equity value per share between $7-$8.50 (+467% to +580% upside)\n\t\n\t- DXLG lists some of the following as specialty retailer peers in their latest proxy, which I find to be useful for how the stock could re-rate with $20m of EBITDA (with notes as to why they're not perfect):\n\t\t○ Kirkland's (KIRK): 11x forward EV/EBITDA, 20x forward earnings (more of an E-commerce story than DXLG, not apparel)\n\t\t○ Citi Trends (CTRN): Historically traded around 13x EV/EBITDA, .4x EV/Sales (lower rents than DXLG)\n\t\t○ Sportsman's Warehouse (SPWH): 10x forward earnings, 7x forward EBITDA, 0.75x EV/Sales (larger stores than DXLG)\n\t\t○ Cato (CATO): Historically 16x EV/EBITDA, 1x EV/Sales (no significant E-Commerce presence)\n\t\t○ Francesca's: Final sale value in January will provide a data point as a comparable valuation.\n\t\t○ Tailored Brands (TLRD)(OTCPK:TLRDQ) would have made for a good comparison in prior years before filing for bankruptcy.\n\t\n\tBecause of how levered the DXLG EV is on their debt, paying down borrowings and growing cash flows will be very accretive to shareholders. Doubling the EV (to 10x FY21 EBITDA) would correspond to about a 10x move in the share price. While that may be a bit aggressive until management can prove their guidance through execution, a $200m EV does not seem as far-fetched by FY22-23 if the business stabilizes.\n\t\n\t- The Company was priced for bankruptcy, however, their recent cost cutting measured coupled with the additional liquidity received from the issuance of a $17.5mm term loan rule this out.\n\t\n\t\t\n\t4) Apes just want moon\n\t- Its simple, stonks only go up and apes just want MOON. DXLG has increased over 600% since its December, 2020 where it was priced for bankruptcy at $0.22 . Taking the aforementioned drivers into account, there is a significant likelihood that this stonk will continue to increase. As the company looks at a potential uplifting, the stonk could potentially go parabolic as casual retail traders pile into a potential 10+ bagger.\n\t\nRisks    \n\t- COVID\n\t\t○ Restrictions stay in place longer than expected\n\t\t○ If SG&amp;A cuts are mostly temporary, and margins too heavily impacted by wholesaling, FY21 EBITDA guidance could be negatively impacted.\n\t\t○ Given the high insider ownership, there could be a risk that management tried to take the company private through a lowball offer. Given this would likely still represent a premium to current prices, I am not too concerned.\n\t\t○ Permanent shift in consumer behavior - company loses customers to e-comm channel\n\t\t○ They do not uplist\n\n\n*Disclaimer: I have a long position in DXLG. This is not financial advice, and I am not receiving any compensation whatsoever from anyone for this post. I wrote this article myself and it expresses my own opinions. I am not receiving any compensation for it. I have no business relationship with any company whose stock is mentioned in this article.*",
        "subreddit": "pennystocks",
        "title": "[DD] Fatten your pockets with $DXLG",
        "url": "https://www.reddit.com/r/pennystocks/comments/nbplz7/dd_fatten_your_pockets_with_dxlg/",
        "created": 1620964116.0
    },
    {
        "author": "razsujemwn",
        "created_utc": 1620325748,
        "id": "n6e1km",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "\\[POST IT AGAIN WITH ALL LINKS OUT BECAUSE AUTOMOD SAID I USE URL SHORTENERS (I DON'T) SORRY ABOUT IT\\]\n\nCall me a conspiracy theorist, it’s nothing but a little puzzle that has come to my mind (and PLEASE don't put your money on that), but I think this is POSSIBLY what makes $XIGM grow again this week. Here's the theory.\n\n# The Timeline\n\n**April 20** \\- Xigem Technologies announces Strategic Investment in Logistics Technology Provider Shipit.to \n\n[https://www.xigemtechnologies.com/xigem-technologies-announces-strategic-investment-in-logistics-technology-provider-shipit-to/](https://www.xigemtechnologies.com/xigem-technologies-announces-strategic-investment-in-logistics-technology-provider-shipit-to/)\n\n**April 21** \\- AirBridgeCargo has approved the shipit.to cargo trackers for use on their flights \n\n[https://www.shipit.to/news/shipitto-trackers-approved-for-use-on-airbridgecargo-flights](https://www.shipit.to/news/shipitto-trackers-approved-for-use-on-airbridgecargo-flights)\n\n**May 3** \\- Xigem Technologies names Wei Lin to Advisory Board \n\n[https://www.newsfilecorp.com/release/82611/Xigem-Technologies-Names-Wei-Lin-to-Advisory-Board](https://www.newsfilecorp.com/release/82611/Xigem-Technologies-Names-Wei-Lin-to-Advisory-Board)\n\n**May 5** \\- Xigem Technologies to launch \"Out-of-the-Box\" Version of iAgent for small-to-medium enterprises Looks like a random natural development, but I think it’s a string of directly connected events that will play a huge role in the future of this stock. \n\n[https://www.proactiveinvestors.com/companies/news/948593/xigem-technologies-launches-packaged-version-of-its-crm-software-iagent-for-small-to-medium-enterprises-948593.html](https://www.proactiveinvestors.com/companies/news/948593/xigem-technologies-launches-packaged-version-of-its-crm-software-iagent-for-small-to-medium-enterprises-948593.html)\n\n**Watch the hands:**\n\n1. Shipit.to is the first company in Xigem’s portfolio that operates in transportation industry. It was their first deal, and XIgem signed LOI to acquire a **21% interest in Shipit.to for US$1.1 million****.**\n2. The next day Shipit.to got approval on AirBridgeCargo, a Russian company with a fleet of giant cargo 747s that work as one of the connections between China and US&amp;Europe. In China they have work with all the major hubs - including Shanghai, Beijing, Zhengzhou and Shenzhen. That's the map from their website: [https://www.airbridgecargo.com/en/page/29/our-network](https://www.airbridgecargo.com/en/page/29/our-network) \n3. Some other developments in the next week or so, and **bang** \\- on May 3 they announce a new member of the advisory board, Mr. Wei Lin. I've linked it above. The guy’s Facebook profile (if it's him [https://www.facebook.com/kodeslinger](https://www.facebook.com/kodeslinger) ) states that he’s from Shanghai, even though he lives in Vancouver now. Most interestingly - his profile on Lightheart Management (he’s one of the co-founders) states:  \n[https://www.lightheartmanagement.com/the-team/](https://www.lightheartmanagement.com/the-team/) \n\n&gt;\"Wei worked as a sales director at a private wealth management firm in Vancouver servicing high net-worth overseas clients; through this role **Wei developed a strong network of operating and strategic partners in China** that offer expansion opportunities for Lightheart-affiliated businesses.  \n\nWell, seems like Lightheart is not the only company that will use these connections now. Wei Lin is also **\"the CEO and co-founder of Project Genesis, which focuses on consolidating e-commerce brands, starting with Amazon third-party sellers\"**, as we know from the press-release. Now, guess what Amazon third-party sellers they’re talking about? Nope, not the ones from Idaho or British Columbia. Here’s a recent review - 45% of Amazon’s third party sellers are based in China. Not really a secret, here's where I got the number: \n\nMarket Pulse Report (75% NEW sellers are from China)   \n[https://www.marketplacepulse.com/articles/75-of-new-sellers-on-amazon-are-from-china](https://www.marketplacepulse.com/articles/75-of-new-sellers-on-amazon-are-from-china) \n\nand E-Commerce Times article (45% TOP sellers are from China).  \n[https://www.ecommercetimes.com/story/87077.html](https://www.ecommercetimes.com/story/87077.html)\n\n# CONCLUSION\n\nSo there we have a guy who works with Chinese businesses that work with Amazon and need to ship their stuff to the US, and he now just happens to sit on the Advisory Board of a company that owns 21% of a shipping trackers company, that just got approved for one of the biggest cargo airlines to fly between China and the West. \n\nNotE that it's just a theory. Really. Could be a coincidence, but... \n\n**If Wei Lin and** **Shipit.to** **will find a way to make it work -** **Shipit.to** **will get some really heavy profits in the future.** And even more - in case they will POSSIBLY make the whole thing operate on the «out-of-the-box» version of iAgent - $XIGM can get A TON of clients and basically connect to their own piece of pie from the said 45% of all 80,46 billion-a-year Amazon third-party sellers industry. Source for the number: [https://www.statista.com/statistics/259782/third-party-seller-share-of-amazon-platform/](https://www.statista.com/statistics/259782/third-party-seller-share-of-amazon-platform/)\n\nIt’s all in plain sight, it’s just networking, and it’s not actually a conspiracy. It’s a possibility. **OF COURSE it will work ONLY if all the suggestions and guesses turn out to be right.**\n\n# Short version\n\n$XIGM can help Chinese third-party sellers from Amazon connect with a shipping trackers company that just got approval on one of the biggest cargo airlines to work with China with a help of a new Advisory Board member Wei Lin. Either Shipit.to - partially owned by $XIGM - wins, or $XIGM can adapt their iAgent to work with the whole thing. Or I’m just a conspiracy weirdo with too much spare time to connect imaginary dots on a cork board. I vote for the third option, tell me what you think.",
        "subreddit": "pennystocks",
        "title": "Shipit.to - partially owned by $XIGM - has a possible link with Amazon through Advisory Board - THEORY",
        "url": "https://www.reddit.com/r/pennystocks/comments/n6e1km/shipitto_partially_owned_by_xigm_has_a_possible/",
        "created": 1620354548.0
    },
    {
        "author": "razsujemwn",
        "created_utc": 1620325196,
        "id": "n6dtxr",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Call me a conspiracy theorist, it’s nothing but a little puzzle that has come to my mind (and PLEASE don't put your money on that), but I think this is POSSIBLY what makes one of my reddit finds $XIGM grow again this week. **Here's the theory.**\n\nhttps://preview.redd.it/rmpbn9k1ljx61.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;s=1cf1236f6c9cdaccca9af52a88732091b3db4293\n\n# The Timeline first\n\n**April 20** \\- Xigem Technologies [announces](https://www.xigemtechnologies.com/xigem-technologies-announces-strategic-investment-in-logistics-technology-provider-shipit-to/) Strategic Investment in Logistics Technology Provider Shipit.to\n\n**April 21** \\- AirBridgeCargo has [approved](https://twitter.com/shipitto/status/1384821140510568452) the shipit.to cargo trackers for use on their flights\n\n**May 3** \\- Xigem Technologies [names](https://www.newsfilecorp.com/release/82611/Xigem-Technologies-Names-Wei-Lin-to-Advisory-Board) Wei Lin to Advisory Board\n\n**May 5** \\- Xigem Technologies [to launch](https://www.proactiveinvestors.com/companies/news/948593/xigem-technologies-launches-packaged-version-of-its-crm-software-iagent-for-small-to-medium-enterprises-948593.html) \"Out-of-the-Box\" Version of iAgent for small-to-medium enterprises\n\nLooks like a random natural development, but I think it’s a string of directly connected events that will play a huge role in the future of this stock.\n\n**NOW watch the hands:**\n\n1. Shipit.to is the first company in Xigem’s portfolio that operates in transportation industry. It was their first deal, and XIgem signed LOI to acquire a [21% interest in Shipit.to for US$1.1 million](https://www.xigemtechnologies.com/xigem-technologies-announces-strategic-investment-in-logistics-technology-provider-shipit-to/).\n2. The next day Shipit.to got approval on AirBridgeCargo, a Russian company with a fleet of giant cargo 747s that work as one of the connections between China and US&amp;Europe. In China they have work with all the major hubs - including Shanghai, Beijing, Zhengzhou and Shenzhen. That's the [map](https://www.airbridgecargo.com/en/page/29/our-network) from their website.\n3. Some other developments in the next week or so, and **bang** \\- on May 3 they announce a new member of the advisory board, Mr. Wei Lin. I've linked it above. The guy’s [Facebook profile](https://www.facebook.com/kodeslinger) (if it's him) states that he’s from Shanghai, even though he lives in Vancouver now. Most interestingly - his profile on Lightheart Management (he’s one of the co-founders) [states](https://www.lightheartmanagement.com/the-team/):\n\n&gt;\"Wei worked as a sales director at a private wealth management firm in Vancouver servicing high net-worth overseas clients; through this role **Wei developed a strong network of operating and strategic partners in China** that offer expansion opportunities for Lightheart-affiliated businesses.\"\n\nWell, seems like Lightheart is not the only company that will use these connections now. Wei Lin is also **\"the CEO and co-founder of Project Genesis, which focuses on consolidating e-commerce brands, starting with Amazon third-party sellers\"**, as we know from the press-release.\n\nNow, guess what Amazon third-party sellers they’re talking about? Nope, not the ones from Idaho or British Columbia.\n\nHere’s a recent review - 45% of Amazon’s third party sellers are based in China. Not really a secret, here's where I got the number: [Market Pulse Report](https://www.marketplacepulse.com/articles/75-of-new-sellers-on-amazon-are-from-china) (75% NEW sellers are from China) and E-Commerce Times [article](https://www.ecommercetimes.com/story/87077.html) (45% TOP sellers are from China).\n\n# CONCLUSION\n\nSo there we have a guy who works with Chinese businesses that work with Amazon and need to ship their stuff to the US, and he now just happens to sit on the Advisory Board of a company that owns 21% of a shipping trackers company, that just got approved for one of the biggest cargo airlines to fly between China and the West.\n\nNot that it's just a theory. Really. Could be a coincidence, but...\n\n**If Wei Lin and** **Shipit.to** **will find a way to make it work -** **Shipit.to** **will get some really heavy profits in the future.** And even more - in case they will POSSIBLY make the whole thing operate on the «out-of-the-box» version of iAgent - $XIGM can get A TON of clients and basically connect to their own piece of pie from the said 45% of all [80,46 billion-a-year](https://www.statista.com/statistics/259782/third-party-seller-share-of-amazon-platform/) Amazon third-party sellers industry.\n\nIt’s all in plain sight, it’s just networking, and it’s not actually a conspiracy. It’s a possibility. OF COURSE it will work ONLY if all the suggestions and guesses turn out to be right.\n\n# Short version\n\n$XIGM can help Chinese third-party sellers from Amazon connect with a shipping trckers company that just got approval on one of the biggest cargo airlines to work with China with a help of a new Advisory Board member Wei Lin. Either Shipit.to - partially owned by $XIGM - wins, or $XIGM can adapt their app iAgent to work with the whole thing and get even higher. Or I’m just a conspiracy weirdo with too much spare time to connect imaginary dots on a cork board. I vote for the third option, tell me what you think.",
        "subreddit": "pennystocks",
        "title": "Shipit.to - partially owned by $XIGM - has a possible link with Amazon through Advisory Board - THEORY",
        "url": "https://www.reddit.com/r/pennystocks/comments/n6dtxr/shipitto_partially_owned_by_xigm_has_a_possible/",
        "created": 1620353996.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1622455194,
        "id": "nozsj8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "So Salesforce is one of my favorite investments and I was reading the most recent earnings report tonight. I noticed one section stand out:\n\n&gt; \"It's made our company, Salesforce and Slack, well, more important to customers than ever. So bringing them together is exciting. And once the merger is approved, we're going to build Slack and all of our products, they'll all become Slack first. It's going to make our customers more productive.\"\n\nThe idea here is that Salesforce is going to go all-in on Slack and the product really is incredible with respects to integrating across the entire tech world. To me it seems like they're Slack is going to be a huge step forward into Microsoft's space and I'm excited to see the competition intensify.\n\n\nThat being said, Salesforce is a less complete solution than what Microsoft has to offer in terms of collaboration tools, and products like Atlassian are too expensive. I've noticed that Microsoft and Atlassian both have product management tools and developer repository tools like GitHub and Bitbucket.\n\nI'm concluding that there is a strong possibility that Slack may acquire companies like Monday.com, who have files for IPO this may, and possibly a company like Digital Ocean.\n\n\nThoughts?",
        "subreddit": "stocks",
        "title": "Future Salesforce Acquisitions",
        "url": "https://www.reddit.com/r/stocks/comments/nozsj8/future_salesforce_acquisitions/",
        "created": 1622483994.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621810550,
        "id": "njjjk2",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/njjjk2/historical_post_earnings_moves_mega_compilation/",
        "created": 1621839350.0
    },
    {
        "author": "koersbordvi",
        "created_utc": 1620232827,
        "id": "n5kbmq",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[https://finance.yahoo.com/news/xigem-technologies-launch-box-version-060000670.html](https://finance.yahoo.com/news/xigem-technologies-launch-box-version-060000670.html)\n\n&gt;Xigem Technologies announced the development of an \"out-of-the-box\" version of its iAgent customer relationship management (\"**CRM**\") software.\n\nIt's going right to the Salesforce, Inc door: CRM market is [estimated](https://www.newsfilecorp.com/redirect/ZRZBHDvnK) to reach $80 billion in revenues by 2025, growing at an average rate of 14% annually.\n\n$XIGM.CN is $0,410 - and it’s just heading to the release. The current leader - Salesforce - CRM - is $180 per share.\n\niAgent is?…\n\nThey’ve raised the stakes at marketing and just launched a new website just for it [https://iagenttechnologies.com/](https://iagenttechnologies.com/)\n\nTo keep things short, it’s a real-time customer acquisition software that merges call centers and sales agents by geolocation to get rid of phone calls, preplanning meetings in advance and make the process easier for all sides.\n\n# What’s \"new\" about it\n\niAgent is now aimed at small-to-medium enterprises to help them act more quickly on leads. SMEs are [estimated](https://www.ifac.org/knowledge-gateway/contributing-global-economy/discussion/foundation-economies-worldwide-small-business-0) to represent over 90% of all businesses, 60-70% of employment and 55% of GDP worldwide. Before the news, iAgent was presented as a customer acquisition service SaaS app with a functionality to manage remote business operations. Same stuff, but not in CRM league. Now it’s officially a bigger thing.",
        "subreddit": "pennystocks",
        "title": "$XIGM.CN iAgent app is now officially CRM aimed at SMEs, the 80 billion to 2025 market",
        "url": "https://www.reddit.com/r/pennystocks/comments/n5kbmq/xigmcn_iagent_app_is_now_officially_crm_aimed_at/",
        "created": 1620261627.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621817468,
        "id": "njlp4z",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/njlp4z/historical_post_earnings_moves_mega_compilation/",
        "created": 1621846268.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1622498478,
        "id": "npej3v",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation AND Analysis (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 7 of the Historical Post Earnings Moves MEGA Compilation. Although it's a short week this time round, there are still  a surprising ammount of companies posting, meaning there's good money to be made! That being said, earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Although risky, Digital Turbine options are inefficiently priced.** Similar to ZScaler last week, Digital Turbine has the gambler's edge this week. Historically, Digital Turbine moves roughly 8% post earnings, but the options chain is only pricing in a 5% move this time round. Furthermore, across the past 10 earnings reports, Digital Turbine has moved an average of *15%*, giving us an insane edge. Unfortunately, the direction this could go is a complete tossup. Digital turbine is sitting at 4 month lows indicating the potential for a moonshot, and they also postponed earnings by one week, indicating that there's something going on behind the scenes. They claimed they postponed due to the \"anticipated completion of a recently announced acquisition\", leading me to believe they plan to drop some announcements regarding the merger during the ER call, which could be incredibly bullish. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills, or a call debit spread.\n\n&amp;nbsp;\n\n- **Scotia Bank earnings are very likely priced in already.** While the 5 other major Canadian Banks reported earnings last week, Scotia Bank has been banished to this week. Unfortunately for us, we can't make a collateral play on it since it's followed the *exact* price action as the other 5, while still not reporting earnings. The other banks have gone up roughly 2-3% during earnings week, and scotia bank followed suit on no catalysts. Expect Scotia Bank to stay flat or go down post earnings unless they managed to create money out of thin air, or put forward some insane guidance.\n\n&amp;nbsp;\n\n- **Slack has capped upside due to the SalesForce acquisition.** Although you may look at the historical moves and options pricing and think it's an absolute steal, I would avoid playing this ticker entirely. The details of the acquisition state that shareholders will get $26.79 in cash and 0.0776 shares of Salesforce stock in exchange for each share of Slack on the day of the merger. If you run the numbers, this equates to roughly 45$ per share of Slack. With Slack currently trading at 44$, it leaves us with less than 2% upside on this trade - absolutely abysmal odds and return. Slack has no reason to breach 45$ either, as then shareholders would be paying more for less come the merger.\n\n&amp;nbsp;\n\n- **Similar to last week, liquidity is suspect**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\nObviously, since I gave data on over 35 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "options",
        "title": "Historical Post Earnings Moves MEGA Compilation AND Analysis (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More",
        "url": "https://www.reddit.com/r/options/comments/npej3v/historical_post_earnings_moves_mega_compilation/",
        "created": 1622527278.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1622485325,
        "id": "np9tv7",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation AND Analysis (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 7 of the Historical Post Earnings Moves MEGA Compilation. Although it's a short week this time round, there are still  a surprising ammount of companies posting, meaning there's good money to be made! That being said, earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Although risky, Digital Turbine options are inefficiently priced.** Similar to ZScaler last week, Digital Turbine has the gambler's edge this week. Historically, Digital Turbine moves roughly 8% post earnings, but the options chain is only pricing in a 5% move this time round. Furthermore, across the past 10 earnings reports, Digital Turbine has moved an average of *15%*, giving us an insane edge. Unfortunately, the direction this could go is a complete tossup. Digital turbine is sitting at 4 month lows indicating the potential for a moonshot, and they also postponed earnings by one week, indicating that there's something going on behind the scenes. They claimed they postponed due to the \"anticipated completion of a recently announced acquisition\", leading me to believe they plan to drop some announcements regarding the merger during the ER call, which could be incredibly bullish. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills, or a call debit spread.\n\n&amp;nbsp;\n\n- **Scotia Bank earnings are very likely priced in already.** While the 5 other major Canadian Banks reported earnings last week, Scotia Bank has been banished to this week. Unfortunately for us, we can't make a collateral play on it since it's followed the *exact* price action as the other 5, while still not reporting earnings. The other banks have gone up roughly 2-3% during earnings week, and scotia bank followed suit on no catalysts. Expect Scotia Bank to stay flat or go down post earnings unless they managed to create money out of thin air, or put forward some insane guidance.\n\n&amp;nbsp;\n\n- **Slack has capped upside due to the SalesForce acquisition.** Although you may look at the historical moves and options pricing and think it's an absolute steal, I would avoid playing this ticker entirely. The details of the acquisition state that shareholders will get $26.79 in cash and 0.0776 shares of Salesforce stock in exchange for each share of Slack on the day of the merger. If you run the numbers, this equates to roughly 45$ per share of Slack. With Slack currently trading at 44$, it leaves us with less than 2% upside on this trade - absolutely abysmal odds and return. Slack has no reason to breach 45$ either, as then shareholders would be paying more for less come the merger.\n\n&amp;nbsp;\n\n- **Similar to last week, liquidity is suspect**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\nObviously, since I gave data on over 35 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1z8vpI6JOEWFScuCdl-gVnmyVEYEJSwB7Jz_BqozX-Bk/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "smallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation AND Analysis (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/np9tv7/historical_post_earnings_moves_mega_compilation/",
        "created": 1622514125.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1622235318,
        "id": "nn7f59",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, May 28, 2021**\n\nStocks gained on Friday, with market participants encouraged by new economic data on consumer spending, income and inflation, and a strong Weekly unemployment report. The market has made a remarkable recovery, particularly in technology, after the market tumbled 4% following the April Consumer Price Index roughly two weeks ago. In my view, as I have said for weeks, the recovery in the market confirms that the initial sell-off driven by inflationary fears forcing the Federal Reserve to tighten monetary policy sooner than expected was overblown.\n\nNew government data on Friday showed personal income fell less than expected in April, but still pulled back after March's stimulus-fueled surge. Personal income fell by 13.1% in April compared to March, less than the 14.2% drop expected. This follows a 20.9% increase during March which had been buoyed by the distribution of $1,400 stimulus checks to most Americans. \n\nIn another report, the Department of Commerce reported core personal consumption expenditures increased 3.1% in April from a year earlier, blowing past the Fed’s traditional 2% target. Federal Reserve members consider the core PCE to be the gauge of inflation. The strong inflation readings reported by the Commerce Department on Friday had been widely anticipated as the pandemic's grip eases, thanks to vaccinations, and will have no impact on monetary policy. Fed Chair Jerome Powell has repeatedly stated that higher inflation will be transitory. Supply-chain constraints combined, labor shortages in certain industries, and rising demand as the US economy recovers from the coronavirus-induced recession have all contributed to higher inflationary readings. These are all factors that are widely considered transitory, meaning not permanent. In an April 28 statement, Federal Reserve Chair Jerome Powell said, “An episode of one-time price increases as the economy reopens is not likely to lead to persistent year-over-year inflation into the future. Clogged supply-chains won’t affect Federal Reserve policy because they’re temporary and expected to resolve themselves.” Moreover, he said “For inflation to move up in a persistent way that moves expectations up, that would take some time, and you would think it would be likely we would be in very strong employment for that to happen.” In other words, Powell is saying he expects issues driving inflation higher to resolve themselves moving forward and doesn’t expect inflationary pressures to materialize until the labor market further improves.\n\nIn remarks this week, members of the Federal Open Market Committee (FOMC), reiterated their stance that they were not yet concerned that new inflation data would force the Fed to tighten monetary policy sooner than expected. St. Louis Federal Reserve President James Bullard said he believed increases in inflation would be “mostly temporary” and that the Fed was “not quite there yet” when it came to discussing tapering its asset purchase program. In separate comments, Kansas City Federal Reserve President Esther George said she did not want the Fed to be “overly reliant on historical relationships and dynamics in judging the outlook for inflation.” \n\nRichard Clarida, Vice Chairman of the Fed, offered a slightly different view but one that is in-line with what the Federal Reserve has already said publicly in the past. Clarida said, “there will come a time in upcoming meetings” when the Fed would consider tapering the asset purchase program but that “it is going to depend on the flow of data”. The Fed is currently buying $120 billion a month in government-issued and government-backed securities, and has pledged to continue doing that until the economy is more fully recovered.\n\nThis reaffirms the market that the Fed is not on a set timeline when it comes to rolling back current accommodative policies and will, as they have said time and again, wait for concrete data before any considerations are made. This follows a similar statement from Jerome Powell back in April 14, which proves market participants shouldn’t worry about quantitative easing tapering, in my opinion. Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.”\n\nThe Department of Labor’s Weekly Unemployment Report showed jobless claims fell for the fourth straight week to yet another pandemic-era low, an encouraging sign that the labor market is improving following the extremely disappointing April Jobs report, which showed 266,000 new jobs added in the month, far below estimated of more than 1 million and a sharp deceleration in job growth compared to March. \n\n* **Initial jobless claims, week ended May 22:** 406,000 vs. 425,000 expected and 444,000 the week prior\n* **Continuing claims, week ended May 15:** 3.642 million vs. 3.680 million expected and a revised 3.738 the week prior\n\n**Highlights**\n\n* “Meme-stocks”, particularly AMC, were absolutely on fire this week, as the battle between wallstreetbets and hedge funds continues. \n* President Joe Biden unveiled a budget that would hike federal spending to $6 trillion for the coming fiscal year.\n* Boeing (BA) agreed to pay at least $17 million to settle enforcement cases with the Federal Aviation Administration over production issues with its 737 jets. Stock reacted positively to the news. \n* Durable goods orders, or orders for manufactured goods intended to last at least three years, unexpectedly declined in April, ending an 11-month streak of increases, the Commerce Department said Thursday, an encouraging sign. \n* Amazon (AMZN), Microsoft (MSFT) and Alphabet (GOOG, GOOGL) are all involved in a bidding process to provide cloud services to Boeing, according to multiple reports. \n* Disney’s (DIS) California-based parks will welcome non-California natives starting June 15.\n* **\\*\\*Please note that current price target was written pre-market and does not reflect intraday changes\\*\\***\n* AutoDesk (ADSK) target raised by Barclays from $335 to $340 at Overweight. Stock currently around $287\n* Burlington Stores (BURL) with a host of target raises. Average price target $365 at Overweight. Stock currently around $325\n* Costco (COST) with three target raises. Stock currently around $388\n   * Barclays from $400 to $450\n   * Stifel Nicolaus from $390 to $410 \n   * Telsey Advisory Group from $395 to $415\n* Salesforce (CRM) with three target raises after crushing earnings. Stock currently around $226\n   * Mizuho from $270 to $290\n   * Barclays from $276 to $285 \n   * Moness, Crespi &amp; Hardt $275 to $290\n* Dell Technologies (DELL) target raised by Morgan Stanley from $127 to $130 at Overweight. Stock currently around $100\n* Dollar General (DG) target raised by Citigroup from $250 to $260 at Buy. Stock currently around $205\n* Medtronic (MDT) with two target raises. stock currently around $125\n   * Deutsche Bank from $134 to $149 at Buy\n   * Oppenheimer from $134 to $147 at Outperform\n* Ulta Beauty (ULTA) with a host of target raises after crushing earnings. Average price target $400 at Buy. Stock currently around $328\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.” - Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, May 28, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/nn7f59/here_is_a_market_recap_for_today_friday_may_28/",
        "created": 1622264118.0
    },
    {
        "author": "mantegarvitrow5zv",
        "created_utc": 1622479692,
        "id": "np7rp7",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Xigem Technologies (Canadian tech company in remote economy and CRM SAAS market) issued a recap of their first quarter. Here are the most notable milestones: \n\nTicker is $XIGM on CSE and 2C1 on FSE, in Canada it's on my Questrade, dunno about other apps. \n\n**The full press release:** \n\n[https://www.xigemtechnologies.com/xigem-technologies-announces-results-for-q1-2021/](https://www.xigemtechnologies.com/xigem-technologies-announces-results-for-q1-2021/)\n\nAnd here are the **most important takeaways** (IMO, because some things like «uhm we listed», «yeah we began trading» are not so important. Only real factual stuff: \n\n* Letter of intent to further commercialize the Company’s patented Software-as-a-Service iAgent platform with Insurance Supermarket Inc. marking the **Company’s entry into the US$3 billion global insurance technology market.** \n* LOI to enhance iAgent platform for consumer packaged goods (“**CPG**”) and service provider FluBusters Inc. marking the Company’s **potential entry into the US$1.5 trillion CPG market;** \n* **Entered the US$17 billion digital logistics space with an LOI to acquire 21% of Israel-based** [**Shipit.to**](http://shipit.to/) (real-time tracking of cargo); \n* LOI to enhance iAgent platform for commercial bakery Baketree Inc., potentially furthering the Company’s in-roads in the **CPG** **marketplace**.\n* Announced plans to launch an “out-of-the-box” version of iAgent platform, **expanding its addressable market in the US$80 billion customer relationship management software market** by targeting the small-to-medium enterprise space; \n* **LOI to acquire the assets of peer-to-peer payment app FOOi, marking the Company’s potential entry into the US$1.5 trillion mobile payments market space;** \n* Established an Advisory Board: named prominent M&amp;A and Securities lawyer **Avi Greenspoon**, private equity leader **Wei Lin** and publisher and marketing entrepreneur **Carli Posner** as initial members. \n\nWhat’s next with revenue and so on? \n\n* **The Company expects to begin recognizing revenue by the third quarter of 2021.** \n* Q1 2021 results included $1.2 million of transaction costs related to the RTO, of which $1.1 million was non-cash, and non-cash share-based compensation of $1.0 million, contributing to a net loss of $2.4 million in the quarter.\n* **The Company ended the quarter with approximately $1.9 million of cash and no long-term debt.**\n\n**Tl;Dr and Conclusion**   \nXigem technologies ($XIGM) released a Q1 recap. They expect revenues by the third quarter of 2021. Super-short version of the recap: «We did a lot of things, entered cool growing tech and logistics markets with 3,1 Trillion in total size, have no debt and lots of plans». Looks like it’s trying to grow and not going to fall apart in the next few weeks. The best performance one can expect from a stock in this sub lol.",
        "subreddit": "pennystocks",
        "title": "Xigem Technologies $XIGM First Quarter Results - Revenue in Q3",
        "url": "https://www.reddit.com/r/pennystocks/comments/np7rp7/xigem_technologies_xigm_first_quarter_results/",
        "created": 1622508492.0
    },
    {
        "author": "The_odd__todd",
        "created_utc": 1620940613,
        "id": "nbrog0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Anyone looking at CRM?",
        "url": "https://www.reddit.com/r/stocks/comments/nbrog0/anyone_looking_at_crm/",
        "created": 1620969413.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621869311,
        "id": "nk0a25",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "smallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/nk0a25/historical_post_earnings_moves_mega_compilation/",
        "created": 1621898111.0
    },
    {
        "author": "myfamousguy",
        "created_utc": 1622339658,
        "id": "no14lt",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "unusual options activity review on $GS $MSFT $GOTO $CLOV $EXPR $GME $MVIS $CRM $VALE $BAC",
        "url": "https://youtu.be/8k3q2XJTfn4",
        "created": 1622368458.0
    },
    {
        "author": "mostwant3d1",
        "created_utc": 1620852163,
        "id": "nayvhw",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I just stumbled upon a random guy on internet that said that he lives in Basel (switzerland) where Palantir is curently looking for salesforce. He mentioned that some of the biggest healthcare companies in the world are located in Basel. Connecting the dots.. \"Palantir hires former IBM Watson Health exec as its first US government chief medical officer\" combined with partnership with Ringier which is also located in Switzerland. Is it just me or its starting to get interesting. :) also i googled the CEO of Ringier, mr. Marc Walder and from his great professional acomplishments i would love to point out this: \"In 2008, Marc Walder completed the Advanced Executive Management Program at Harvard Business School in Boston. Marc Walder is a member of the Federal Council’s Advisory Council on Digital Transformation. He is also the founder of the digitalswitzerland initiative, which brings together more than 130 of the largest Swiss companies and institutions to promote digital development and the digital transformation of Switzerland.\" this sounds beyond amazing to me.\n\n🚀🚀🚀\n55$ PLTR EOY ez money",
        "subreddit": "wallstreetbets",
        "title": "Fresh and new pltr dd... currently holding heavy bags avg cost 26.50",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nayvhw/fresh_and_new_pltr_dd_currently_holding_heavy/",
        "created": 1620880963.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621808960,
        "id": "njj0re",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "options",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/options/comments/njj0re/historical_post_earnings_moves_mega_compilation/",
        "created": 1621837760.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1622484980,
        "id": "np9pdp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 7 of the Historical Post Earnings Moves MEGA Compilation. Although it's a short week this time round, there are still  a surprising ammount of companies posting, meaning there's good money to be made! That being said, earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Although risky, Digital Turbine options are inefficiently priced.** Similar to ZScaler last week, Digital Turbine has the gambler's edge this week. Historically, Digital Turbine moves roughly 8% post earnings, but the options chain is only pricing in a 5% move this time round. Furthermore, across the past 10 earnings reports, Digital Turbine has moved an average of *15%*, giving us an insane edge. Unfortunately, the direction this could go is a complete tossup. Digital turbine is sitting at 4 month lows indicating the potential for a moonshot, and they also postponed earnings by one week, indicating that there's something going on behind the scenes. They claimed they postponed due to the \"anticipated completion of a recently announced acquisition\", leading me to believe they plan to drop some announcements regarding the merger during the ER call, which could be incredibly bullish. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills, or a call debit spread.\n\n&amp;nbsp;\n\n- **Scotia Bank earnings are very likely priced in already.** While the 5 other major Canadian Banks reported earnings last week, Scotia Bank has been banished to this week. Unfortunately for us, we can't make a collateral play on it since it's followed the *exact* price action as the other 5, while still not reporting earnings. The other banks have gone up roughly 2-3% during earnings week, and scotia bank followed suit on no catalysts. Expect Scotia Bank to stay flat or go down post earnings unless they managed to create money out of thin air, or put forward some insane guidance.\n\n&amp;nbsp;\n\n- **Slack has capped upside due to the SalesForce acquisition.** Although you may look at the historical moves and options pricing and think it's an absolute steal, I would avoid playing this ticker entirely. The details of the acquisition state that shareholders will get $26.79 in cash and 0.0776 shares of Salesforce stock in exchange for each share of Slack on the day of the merger. If you run the numbers, this equates to roughly 45$ per share of Slack. With Slack currently trading at 44$, it leaves us with less than 2% upside on this trade - absolutely abysmal odds and return. Slack has no reason to breach 45$ either, as then shareholders would be paying more for less come the merger.\n\n&amp;nbsp;\n\n- **Similar to last week, liquidity is suspect**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\nObviously, since I gave data on over 35 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "options",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 7) - $APPS, $ZM, $CGC, $LULU, $CLDR, $CRWD, $DOCU, $AI and More",
        "url": "https://www.reddit.com/r/options/comments/np9pdp/historical_post_earnings_moves_mega_compilation/",
        "created": 1622513780.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621885357,
        "id": "nk6fit",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nk6fit/historical_post_earnings_moves_mega_compilation/",
        "created": 1621914157.0
    },
    {
        "author": "Better-Regret8924",
        "created_utc": 1622044386,
        "id": "nlkakv",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Anyone playing $CRM earnings?",
        "url": "https://i.redd.it/ivlwpe38lh171.jpg",
        "created": 1622073186.0
    },
    {
        "author": "TexasMachine",
        "created_utc": 1620257965,
        "id": "n5txdw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "What are your thoughts on VeChain and Salesforce partnership?",
        "url": "https://www.reddit.com/r/StockMarket/comments/n5txdw/what_are_your_thoughts_on_vechain_and_salesforce/",
        "created": 1620286765.0
    },
    {
        "author": "Alternative_Unit_812",
        "created_utc": 1620371490,
        "id": "n6sp4c",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "How I discovered a great lead-generation tool | Best CRM and Email Marketing tool | Grow your sales",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6sp4c/how_i_discovered_a_great_leadgeneration_tool_best/",
        "created": 1620400290.0
    },
    {
        "author": "somesortofidiot",
        "created_utc": 1620787223,
        "id": "naej3r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I think salesforce is gonna kill it on earnings. How do I make as much money as possible?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/naej3r/i_think_salesforce_is_gonna_kill_it_on_earnings/",
        "created": 1620816023.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621869161,
        "id": "nk083e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nk083e/historical_post_earnings_moves_mega_compilation/",
        "created": 1621897961.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621884313,
        "id": "nk612l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 6 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is just about over, so there is a good chance that this is going to be the final spreadsheet until Q2 rolls around. Thank you all for joining me for the ride!\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **All major Canadian Banks report this week**. Some names in the lineup include BMO, RY, TD, and CM. BMO reports first out of the four, so we can look at their earnings results and corresponding price movement to predict the movements of the following three banks. Similar to the American banks in Week 1, I'm expecting huge beats across the board, alongside some comfortable upwards movement.\n\n&amp;nbsp;\n\n- **Those with OTC / TSE access should look to make a collateral play on the banks.** Again, similar to Week 1, you could've played XLF alongside the American banks and made a fat bag. Those looking to run that play back should look into **$ZEB** - The IV is low as hell, and it only holds Canadian banks. Options on it are dirt cheap, with an option less than 1% OTM going for a grand total of $0.10. Every percent this thing moves will give you a 3-bagger. Unfortunately, the ticker isn't liquid whatsoever, and the bid ask spread isn't too appealing. You're gonna be buying at the ask, and selling at the bid, so even if we get a nice move, we're still gonna get trashed by slippage. ITM options may be the way to play this one - I couldn't find a better ETF alternative, so this one is the best we got. This play is definitely one of the riskier ones.\n\n&amp;nbsp;\n\n- **Piggybacking off the last point, liquidity is suspect this week**. Majority of the companies reporting have godawful options chains. If you think you see an awesome play, make sure you check the volume and open interests in the option chain before committing to it. You'll find that lots of the tickers this week lack any real liquidity on the options chain, so there's gonna be a fucking crater in the bid-ask spread. You're guaranteed to be buying at the ask and selling at the bid, and this huge spread adds additional risk that will balloon your losses and shrink your winners. \n\n&amp;nbsp;\n\n- **ZScaler options are inefficiently priced.** Historically, ZScaler moves roughly 15% post earnings, but the options chain is only pricing in a 5% move this time round. This gives us gambler a huge edge, since we won't get IV crushed as hard, and we can buy our options for cheap. There are lots of strategies you can run this week, but I'm personally going to opt for a long strangle or long iron condor if I can get good fills.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 40 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1gMemdx2iJkzSfoUg7o4YIUnnc4ftZfft-ZMAM315Xtw/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 6) - $NVDA, $SNOW, $CRM, $COST, $BBY, $ZS, $DKS, $TD, $BMO and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nk612l/historical_post_earnings_moves_mega_compilation/",
        "created": 1621913113.0
    },
    {
        "author": "TexasMachine",
        "created_utc": 1620258125,
        "id": "n5tzc7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "What are your comments on VeChain and Salesforce partnership?",
        "url": "https://www.reddit.com/r/pennystocks/comments/n5tzc7/what_are_your_comments_on_vechain_and_salesforce/",
        "created": 1620286925.0
    },
    {
        "author": "benetest",
        "created_utc": 1620775725,
        "id": "naav09",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "CRM has a global outage right now, shouldn't it impact the stock price tomorrow and after?  \nIf so, how to make profit on this? Buying a put option expiring on May 14th is good?",
        "subreddit": "wallstreetbets",
        "title": "How to profit from $CRM outage?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/naav09/how_to_profit_from_crm_outage/",
        "created": 1620804525.0
    },
    {
        "author": "mat_raymond",
        "created_utc": 1620241564,
        "id": "n5nszk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Drone Delivery Canada – FLT.V (DD)\n\n**tldr;** Drone Delivery Canada isn’t here to replace postal workers in the next 10 years but has many use cases and a lot of revenue potential. It is currently an unprofitable growth stock that seems very promising. At $1.33 (CAD) this is a buy and I have a price target of $6.87 5 years out based on a 10 price to sales ratio.\n\n&amp;#x200B;\n\n*All numbers are in Canadian Dollars unless mentioned otherwise*\n\n**Basic Stats: - (as of May 4, 2021)**\n\nPrice: $1.33\n\nMarket Cap: 279.38M\n\nEPS: -0.08\n\nFloat: 209.61M\n\n&amp;#x200B;\n\n**Description**\n\nDrone Delivery Canada (DDC) provides a drone delivery platform targeted towards various corporations including retailers, service organizations and government agencies and are capable of transporting up to 180kg over 200kms. They have a patented hardware/software platform. DDC has been developing its drone delivery technology since 2014. They are currently trading on the TSX.V Exchange under the symbol FLT, on the U.S. OTC Q B market with Nasdaq International Designation under the symbol TAKOF. As a venture company that is not profitable it is a risky investment but there are many upsides to investing in this innovative technology.\n\n&amp;#x200B;\n\n**Financials**\n\nThe company has reported assets worth $29M and $2.27M worth of liabilities so there is currently little worry of insolvency. With $23.4M in cash and yearly operating expenses of $14.5M, assuming no change, the company can operate with no financing for 1.6 years. This isn’t much of a worry due to increasing revenue and ease of financing.\n\n2020 revenue was $265k and their total operating expenditure was $14.5M totaling a loss of $0.08 per share in 2020. Operating expense dropped in 2020, some key differences is an increase in advertising and marketing spend, a reduction in consulting expenditure, and an increase in personnel expenses. Research and development expenditure was almost the same which is good to see as they are still investing heavily in their technology.\n\nAnalyst estimate 2021 revenue of $6.59M which is over 2000% increase. While it is also expected for operating expenses to increase it’s good to see extreme revenue growth to match their high valuation of 271M. The current price/sales ratio is 1,021, assuming the same stock price and sales of $6.59M the price/sales ratio decreases to 41 which is much more reasonable, though realistically share price will increase this year. But even at twice the share price the price/sales ratio is 82 (which is still very high but much more reasonable than current, goes to show markets value future earnings). 2021 estimated EPS is -0.05 and profitability is expected in 2022.\n\nThe last thing to point out in DDC’s financial statements in they continue to invest heavily in patents. $140k in spent on patenting and trademarks in 2020 and $221k in 2019. With patents worth $750k as of December 31, 2020.\n\n&amp;#x200B;\n\n**Ownership and Leadership**\n\n0.2% of shares are held by private companies, 0.48% by individual insiders, 7.08% by institutions and the rest by the general public. The low insider holding is often seen as a bearish factor, but the low institutional holding can hold potential upside as once the stock is up listed, we can see large purchases as companies start adding shares to funds.\n\nLeadership:\n\nThe CEO Michael Zahra has been the President of Staples Business Advantage (B2B supplies), the president of Yahoo, and has been on the board of directors for Oak Ridges Moraine Land Trust and on the board of governors for North York General Hospital. So, while this is a start-up, they have a veteran leader. They have a strong lineup of C-Suite executives with experienced CFO and CTO. On top of this their board of advisors include the VP of Cargo at Air Canada, and a medical director for Sunnybrook Centre for Prehospital Medicine which is an important strategic piece. The downside of their leadership is they have very high salaries for a company not making any profit.\n\n&amp;#x200B;\n\n**Current Factors**\n\nThese are 3 current small factors that are worth mentioning\n\nPartnership with DSV:\n\nDDC entered in an agreement with DSV through its sales agent Air Canada that provides its drone delivery platform back in October 2019. The program became operational in March which was big for DDC as it is their first source of revenue. In which customers pay DDC a monthly fee for each drone route deployed. DSV provides and manages supply chain solutions for thousands of corporations. Which is a perfect partner for DDC. The initial agreement is for 15 months, with additional 1-year terms following the success of the first agreement.\n\nPartnership with Edmonton Airport:\n\nThis partnership creates the world’s first airport drone delivery hub at Edmonton Airport using DDC’s platform. DDC and Edmonton airport will implement promote and market DDC’s delivery services. The agreement is for 5 years initially with the possibility of an extension unless the agreement is terminated\n\nPatents:\n\nDDC currently holds two US patents, one for its “FLYTE management” and one that covers aspects of its drone delivery technology and processes relating to controlled access zones for UAV landing and takeoff\n\n&amp;#x200B;\n\n**Future Use Cases and Catalysts**\n\nMedical Response:\n\nIn 2019 researchers tested the speed of drones vs the speed of ambulances to respond to a 911 call. The drone carried an AED to the location which was approx. 8km away. The drone was allowed to fly at speeds of 80km/hr and arrived at the scene an average of three to four minutes before the ambulance. Those few minutes could make a life or death difference in a cardiac arrest patient’s outcome. This is why having the medical director for Sunnybrook Centre for Prehospital Medicine on the board of advisors could be a key to implementing their services to the medical field in the future.\n\nUS Expansion:\n\nDDC has expressed their intention to expand to the United States in the past, which is in line with them filing US patents. Expanding into the US will open tons of new opportunities for them but will also be a large challenge.\n\nPotential to move to TSX:\n\nMoving up from the venture exchange to the TSX can pose many benefits. A big one that we care about is increase in share price. “An observation of 34 companies that graduated between October 14, 2005 and August 10, 2006, found that almost sixty per cent of the companies had an average share price over the thirty trading days post-graduation that was higher than the thirty trading days preceding graduation. On average, the share price of all 34 issuers went up over three per cent in that time frame, with four companies showing an increase of over 25 per cent”.\n\nSource: [https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx](https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx)\n\n&amp;#x200B;\n\n**Market Size**\n\nIn Ark Invest’s *BIG IDEAS 2021* report they talked about the delivery drone market. They predict that drone delivery platforms will generate nearly USD50 billion in revenues, USD14 billion in hardware sales, and USD3 billion in mapping revenues by 2025. And by 2030 drone delivery platforms will generate nearly USD275 billion in revenues, USD50 billion in hardware sales, and USD12 billion in mapping revenues.\n\nFor a total market cap of $67B USD by 2025 and $337B USD by 2030.\n\n&amp;#x200B;\n\n**Air Canada Cargo Partnership**\n\nIn Canada, 150K routes have been identified with their partner Air Canada Cargo. DDC’s revenue per route is $10,000/month. They are not even close to operating 150K routes so let’s start with 100 routes and build up.\n\n|**Routes**|**Revenue/month**|**Yearly Revenue**|\n|:-|:-|:-|\n|100|$1M|$12M|\n|1,000|$12M|$144M|\n|10,000|$120M|$1.44B|\n|25,000|$250M|$3B|\n|150,000|$1.5B|$18B|\n\n&amp;#x200B;\n\n**Valuation**\n\nNow let’s take that estimated yearly revenue and calculate share price based off price/sales ratio (assuming a 10x p/s which is a lot lower than current p/s).\n\n|**Yearly Revenue**|**Market Cap**|**Share Price**|\n|:-|:-|:-|\n|$12M| 120M|$0.57|\n|$144M|1.44B|$6.87|\n|$1.44B|$7.2B\\*|$34.35|\n|$3B|$15B\\*|$71.56|\n|$18B|36B\\*\\*|$171.74|\n\n^(\\*reduced P/S ratio to 5)\n\n^(\\*\\*reduced P/S ratio to 2)\n\nIt’s important to note that the bottom 3 numbers are highly unrealistic in the next 5-10 years and require perfect execution and market factors to reach that point even past 10 years. A more realistic target would be a share price of $6.87 5 years out (furthest out analyst prediction is $116.8M of revenue 4 years from now). This is assuming a 10x p/s which aligns for an emerging technology company. A 5 year prediction of 120M in revenue is also falls in line with the previously mentioned $67B drone delivery market size by 2025 predicted by Ark Invest.\n\nA $6.87 price estimate 5 years out at present value, assuming an 8% return found in index funds, equals $4.61.\n\n&amp;#x200B;\n\n**Bear Case(s)**\n\nCurrently DDC is fitted for serving remote areas as there is a lot of regulation surrounding flying drones in urban areas. It’s also unrealistic to have dozens of drones flying around a city anywhere in the near future We need to see a shift in regulation for this to really take off. Big players such as Amazon and FedEx have been investing in delivery drone technology for years and most likely have very developed technology and infrastructure too. This does leave potential for a buyout if a company is trying to catch up to its competitors who have been investing in drone delivery. While financing will be relatively simple for this company this poses the risk of share dilution as they continue to spend money on research, patents, and other the expenses the company will need to sell more shares for cash flow.Lastly, their technology currently only allows delivery on predetermined routes that are from point A to point B and require a launch and landing pad so more technological development needs to happen.\n\n&amp;#x200B;\n\nThis technology isn’t here to replace postal workers in the next 10 years but has a lot of different use cases now and will have more in the future.\n\n&amp;#x200B;\n\nIf you've read this far let me know what you think of the stock and would love some feedback on my DD (also let me know if the formatting needs changing). Thanks!",
        "subreddit": "stocks",
        "title": "Drone Delivery Canada – FLT.V (DD)",
        "url": "https://www.reddit.com/r/stocks/comments/n5nszk/drone_delivery_canada_fltv_dd/",
        "created": 1620270364.0
    }
]