[
    {
        "author": "spacegrab",
        "created_utc": 1623691262,
        "id": "nzrwq2",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Digital Storage is in everything. Cars, Cloud, Phones, PCs, Laptops. It's kinda odd this doesn't get shared more here, but hey this isn't the old WSB we're used to anymore. \n\nhttps://www.westerndigital.com/solutions/automotive-transportation\n\n&gt; The automotive and transportation industries are on the cusp of a disruptive technology phase. Vehicles are not simply mechanical engines but are now data centers on wheels, driving a new generation of storage infrastructure needs. As cars become connected and autonomous, massive amounts of data are being created and consumed. This requires new approaches in data processing that improve communications and interactions between humans and vehicles, vehicles and vehicles (V2V), and vehicles and infrastructures (V2I), while enabling a better and safer driving experience. This places massive demands on data storage and processing at the edge while pushing the boundaries of cloud-based services in the core.\n\nWhat we didn't expect was CHIA driving up the costs of traditional HDD storage. HD prices are going to end up going parabolic the way miners have strangled the shit out of the GPU space, driving gaming enthuiasts to desperation lengths and overpaying for GPUs. Just look at NVDA's price run over the last month.\n\nThe run-up for the storage sector is lagging but following the trend as Seagate (7/27) and WDC (7/28) prepare for ER next month. There will be a significant surge (5-10%) over the next week. Analysts have already lifted price targets; guessing this closes around $80 at the end of June. Easy weekly skimmings. \n\nWDC $75 6/18c",
        "subreddit": "wallstreetbets",
        "title": "Disk-Drive DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nzrwq2/diskdrive_dd/",
        "created": 1623720062.0
    },
    {
        "author": "againirise",
        "created_utc": 1624629655,
        "id": "o7oa8h",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Western Digital has a line of external hard drives that are connected to the internet called My Book Live. [Well now a bunch of customers are reporting that the hard drives have been completely wiped.](https://arstechnica.com/gadgets/2021/06/mass-data-wipe-in-my-book-devices-prompts-warning-from-western-digital/) \n\nIt gets worse, according to [Western Digital](https://www.westerndigital.com/support/productsecurity/wdc-21008-recommended-security-measures-wd-mybooklive-wd-mybookliveduo) themselves, [the CVE involved](https://nvd.nist.gov/vuln/detail/CVE-2018-18472) has been public and unpatched since 2019.\n\nSo yeah, puts are probably a good call here as it seems this news has not been incorporated into the price yet.",
        "subreddit": "wallstreetbets",
        "title": "Western Digital (WDC) just fucked a bunch of their customers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o7oa8h/western_digital_wdc_just_fucked_a_bunch_of_their/",
        "created": 1624658455.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623000704,
        "id": "ntqwp7",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "$WDC has good growth prospects due to a surge in HDD demand, and good earnings prospects.\n\nChia uses spare storage space on hard drives to verify transactions. This is considered to be the 'green' alternative to ASIC and GPUs. \n\n- Increased HDD demand:\n\nChia has gone up massively in recent months, driving a rush to purchase hard drives in order to mine it. As such, there have been hard drive shortages recently due to the increased demand. Much like GPU and semi-conductor stocks, we can expect good price action (and have already seen it) for hard drive manufacturer stocks. \n\n' \"In recent weeks the demand and pricing for high capacity [hard disk drives, or HDDs] has seen a material step higher ... and enterprise [solid state drive, or SSD] prices have also moved higher,\" analysts at Bank of America wrote in a Thursday report. The \"primary upside driver\" for that rising demand, according to BofA: chia. '\n\nWestern Digital is a market leader in the production of HDD's, producing some of the highest quality hard drives that have the best life expectancy, and a good warranty. As Chia transactions are very taxing on HDD's, buyers will be looking for the most durable hard drives. Which is why I am focusing my attention on Western Digital versus another stock such as Seagate. Western Digital is probably the best known manufacturer of hard drives, and usually a top choice for consumers. \n\n- Earnings:\n\nWestern Digital is also an attractive pick due to it's earnings outlook. Analysts are still raising their earnings estimates for the company. The growing optimism on earnings prospects are driving estimates higher, which should get reflected in its stock price.\n\nEarnings estimates for the next quarter and full year are increasingly being driven higher and higher. The company is likely to earn $1.46 per share for the current quarter, representing a change of +18.7%. Two estimates have moved higher in the past 30 days. For the full year, the company is expected to earn $3.83 per share, +25.99% over last year.  \n\n\nThe stock has gained 12.3% over the past four weeks. As earnings growth and the Chia frenzy are both likely to drive the stock higher -  in my opinion, it is a good buy, and I have added it to my portfolio.",
        "subreddit": "wallstreetbets",
        "title": "$WDC Western Digital is being driven up by Chia and earnings prospects",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ntqwp7/wdc_western_digital_is_being_driven_up_by_chia/",
        "created": 1623029504.0
    },
    {
        "author": "delsystem32exe",
        "created_utc": 1624335199,
        "id": "o5e1gn",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$WDC Western Digital Corporation technical analysis... bullish right at very strong support. I actually last year purchased WD (thinking it was western digital but its really walker and dunlop) instead of WDC, so dont make the same mistake.",
        "url": "https://i.redd.it/8wc0qttosq671.png",
        "created": 1624363999.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623058454,
        "id": "nu8axj",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Chia, a 'green' alternative to GPU mining has caused a global shortage of hard discs. I commented on the increased demand, and the earnings expectations in my previous DD.\n\nChia uses a proof of space approach to mining that relies on using empty hard disc space. The high profitability of mining thiscaused a surge in demand for hard discs.\n\nHowever, Chia mining is largely popular in Central and SE Asia right now, with some movement in the West. I expect as more people become aware of this, particularly in the West - it will lead to a shortage of hard discs and SSD's much like the current GPU shortage. There is already a shortage of HDD's/SSD's due to the initial surge of Chia interest causing a buyup of these items. However, as it gains traction, and as people realise how this is much more highly profitable in comparison to GPU mining currently - the demand will be similar to that of GPU's. \n\nThis initial surge I mention, has indeed already caused a surge in the stock prices. With Western digital share price being $52 at the start of the year and now around $77/78. Seagate is also up from $60 to $99. \n\nHoffman, the president of Chia Network, says he 'is suprised at the speed at which the hard disc capacity devoted to Chia has grown and admits that this is likely to caused disruptions to the supply chain for some time.'.\n\nIn summary, Chia is more profitable and more energy efficient than GPU mining. Hard drive demand has already spiked leading to shortages. I expect as this grows in profitability in Asia and the west, it will lead to further shortages much like that we see of HDD's.\nTherefore driving up the stock price as already has been shown.",
        "subreddit": "wallstreetbets",
        "title": "$WDC Western Digital DD: Part 2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nu8axj/wdc_western_digital_dd_part_2/",
        "created": 1623087254.0
    },
    {
        "author": "Ap0piec",
        "created_utc": 1624104581,
        "id": "o3emj1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/5b6f4s1yq7671.png?width=955&amp;format=png&amp;auto=webp&amp;s=5bd1e2ea566e66c10ca592c32f3893982f76f28f\n\nMicron Technology is an American producer of computer memory and computer data storage including dynamic random-access memory, flash memory, and USB flash drives. Its consumer products are marketed under the brands Crucial and Ballistix. Micron and Intel together created IM Flash Technologies, which produces NAND flash memory. Their current market cap is $88.97 billion.\n\nMicron remains firmly positioned in a memory market as more products require chips that are experiencing a shortage right now. Many see the company's situation as a big reason why you should be buying their shares. The shortage could particularly benefit Micron in the DRAM memory market, where South Korean chipmakers Samsung and SK Hynix are its only competitors. DRAM made up about 68% of Micron's revenue in 2020. Additionally, the company claimed about 23% of the global DRAM market. The NAND sector is a bit more diversified thanks to the presence of Western Digital and its SanDisk subsidiary. However, Micron is one of the largest suppliers in this segment as well.\n\nMicron's earnings for the first quarter of 2021 showed little difference from what the analysts were expecting. They reported earnings per share of $0.98, which is 3 cents more than the consensus estimate. They reported a slight beat of revenue estimates as well. Their Q1 2021 revenue came in at $6.24 billion compared to the estimated $6.23 billion. Their next earnings report is scheduled for **Jun 30, 2021**.\n\nAnalysts from **Deutsche Bank** estimate Micron's stock to reach $110 in the next 12 months. The analysts at **Wells Fargo** also have high expectations for this stock with a price target of $115. Out of 24 analysts, 18 have given Micron a BUY rating and 6 a HOLD rating.",
        "subreddit": "StockMarket",
        "title": "Micron Technology $MU stock overview and the analysts' forecasted price (computer memory and data storage)",
        "url": "https://www.reddit.com/r/StockMarket/comments/o3emj1/micron_technology_mu_stock_overview_and_the/",
        "created": 1624133381.0
    },
    {
        "author": "longscotch",
        "created_utc": 1624606329,
        "id": "o7iuxc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Action Required on My Book Live and My Book Live Duo - Western Digital has determined that some My Book Live devices are being infected by malicious software",
        "url": "https://community.wd.com/t/action-required-on-my-book-live-and-my-book-live-duo/268147",
        "created": 1624635129.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1622908388,
        "id": "nsyqj1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\n$WDC has good growth prospects due to a surge in HDD demand, and good earnings prospects.\nChia uses spare storage space on hard drives to verify blockchain transactions. This is considered to be the 'green' alternative to other GPU based mining.\n\nIncreased HDD demand:\n\nChiaCoin has gone up massively in recent months, driving a rush to purchase hard drives in order to mine it. As such, there have been hard drive shortages recently due to the increased demand. Much like GPU and semi-conductor stocks, we can expect good price action (and have already seen it) for hard drive manufacturer stocks.\n' \"In recent weeks the demand and pricing for high capacity [hard disk drives, or HDDs] has seen a material step higher ... and enterprise [solid state drive, or SSD] prices have also moved higher,\" analysts at Bank of America wrote in a Thursday report. The \"primary upside driver\" for that rising demand, according to BofA: chia. '\nWestern Digital is a market leader in the production of HDD's, producing some of the highest quality hard drives that have the best life expectancy, and a good warranty. As ChiaCoin mining is very taxing on HDD's, buyers will be looking for the most durable hard drives. Which is why I am focusing my attention on Western Digital versus another stock such as Seagate. Western Digital is probably the best known manufacturer of hard drives, and usually a top choice for consumers.\n\nEarnings:\n\nWestern Digital is also an attractive pick due to it's earnings outlook. Analysts are still raising their earnings estimates for the company. The growing optimism on earnings prospects are driving estimates higher, which should get reflected in its stock price.\nEarnings estimates for the next quarter and full year are increasingly being driven higher and higher. The company is likely to earn $1.46 per share for the current quarter, representing a change of +18.7%. Two estimates have moved higher in the past 30 days. For the full year, the company is expected to earn $3.83 per share, +25.99% over last year.\nThe stock has gained 12.3% over the past four weeks. As earnings growth and the ChiaCoin frenzy are both likely to drive the stock higher - in my opinion, it is a good buy, and I will be adding it to my portfolio today.\n\nFurther DD on the impact of Chia mining:\nChia, a 'green' alternative to GPU mining has caused a global shortage of hard discs. I commented on the increased demand, and the earnings expectations in my previous DD.\n\nChia uses a proof of space approach to mining that relies on using empty hard disc space. The high profitability of mining this coin caused a surge in demand for hard discs.\n\nHowever, Chia mining is largely popular in Central and SE Asia right now, with some movement in the West. I expect as more people become aware of this, particularly in the West - it will lead to a shortage of hard discs and SSD's much like the current GPU shortage. There is already a shortage of HDD's/SSD's due to the initial surge of Chia interest causing a buyup of these items. However, as it gains traction, and as people realise how this is much more highly profitable in comparison to GPU mining currently - the demand will be similar to that of GPU's.\n\nThis initial surge I mention, has indeed already caused a surge in the stock prices. With Western digital share price being $52 at the start of the year and now around $77/78. Seagate is also up from $60 to $99.\n\nHoffman, the president of Chia Network, says he 'is suprised at the speed at which the hard disc capacity devoted to Chia has grown and admits that this is likely to caused disruptions to the supply chain for some time.'.\n\nIn summary, Chia is more profitable and more energy efficient than GPU mining. Hard drive demand has already spiked leading to shortages. I expect as this grows in profitability in Asia and the west, it will lead to further shortages much like that we see of HDD's. Therefore driving up the stock price as already has been shown.",
        "subreddit": "wallstreetbets",
        "title": "Mega DD $WDC Western Digital is being driven up by 'green' ChiaCoin mining and good earnings prospects",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nsyqj1/mega_dd_wdc_western_digital_is_being_driven_up_by/",
        "created": 1622937188.0
    },
    {
        "author": "TheOv3rminD",
        "created_utc": 1624764916,
        "id": "o8paso",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Seagate Technology Holdings PLC 86.50 USD +23.98 (38.36%) past 6 months  \nWestern Digital Corp 70.75 USD +20.69 (41.33%) past 6 months\n\nIf I would have just taken my $3,000 and bought WD stock, I would have $4,230 Right now. Instead I have a pile of hard drives that no one will ever want to buy and a bunch of half fried SSD's...",
        "subreddit": "wallstreetbets",
        "title": "Hey Guy's, You Know That Chia Thing I Lost a Bunch of Money on....",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o8paso/hey_guys_you_know_that_chia_thing_i_lost_a_bunch/",
        "created": 1624793716.0
    },
    {
        "author": "AngeloMonharti",
        "created_utc": 1623950449,
        "id": "o22hx2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "15k $WDC yolo - betting all WSB gains + 20% life savings on increased revenue guidance and hard drive demand in the storage market.",
        "url": "https://i.redd.it/33v81pef0v571.png",
        "created": 1623979249.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1623949476,
        "id": "o224ia",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "15k $WDC yolo, invested all my recent WSB gains + 20% of my life savings. Betting on increased revenue guidance and HDD demand",
        "url": "https://imgur.com/a/2fDfCVf",
        "created": 1623978276.0
    },
    {
        "author": "spacegrab",
        "created_utc": 1623691262,
        "id": "nzrwq2",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Digital Storage is in everything. Cars, Cloud, Phones, PCs, Laptops. It's kinda odd this doesn't get shared more here, but hey this isn't the old WSB we're used to anymore. \n\nhttps://www.westerndigital.com/solutions/automotive-transportation\n\n&gt; The automotive and transportation industries are on the cusp of a disruptive technology phase. Vehicles are not simply mechanical engines but are now data centers on wheels, driving a new generation of storage infrastructure needs. As cars become connected and autonomous, massive amounts of data are being created and consumed. This requires new approaches in data processing that improve communications and interactions between humans and vehicles, vehicles and vehicles (V2V), and vehicles and infrastructures (V2I), while enabling a better and safer driving experience. This places massive demands on data storage and processing at the edge while pushing the boundaries of cloud-based services in the core.\n\nWhat we didn't expect was CHIA driving up the costs of traditional HDD storage. HD prices are going to end up going parabolic the way miners have strangled the shit out of the GPU space, driving gaming enthuiasts to desperation lengths and overpaying for GPUs. Just look at NVDA's price run over the last month.\n\nThe run-up for the storage sector is lagging but following the trend as Seagate (7/27) and WDC (7/28) prepare for ER next month. There will be a significant surge (5-10%) over the next week. Analysts have already lifted price targets; guessing this closes around $80 at the end of June. Easy weekly skimmings. \n\nWDC $75 6/18c",
        "subreddit": "wallstreetbets",
        "title": "Disk-Drive DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nzrwq2/diskdrive_dd/",
        "created": 1623720062.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623000704,
        "id": "ntqwp7",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "$WDC has good growth prospects due to a surge in HDD demand, and good earnings prospects.\n\nChia uses spare storage space on hard drives to verify transactions. This is considered to be the 'green' alternative to ASIC and GPUs. \n\n- Increased HDD demand:\n\nChia has gone up massively in recent months, driving a rush to purchase hard drives in order to mine it. As such, there have been hard drive shortages recently due to the increased demand. Much like GPU and semi-conductor stocks, we can expect good price action (and have already seen it) for hard drive manufacturer stocks. \n\n' \"In recent weeks the demand and pricing for high capacity [hard disk drives, or HDDs] has seen a material step higher ... and enterprise [solid state drive, or SSD] prices have also moved higher,\" analysts at Bank of America wrote in a Thursday report. The \"primary upside driver\" for that rising demand, according to BofA: chia. '\n\nWestern Digital is a market leader in the production of HDD's, producing some of the highest quality hard drives that have the best life expectancy, and a good warranty. As Chia transactions are very taxing on HDD's, buyers will be looking for the most durable hard drives. Which is why I am focusing my attention on Western Digital versus another stock such as Seagate. Western Digital is probably the best known manufacturer of hard drives, and usually a top choice for consumers. \n\n- Earnings:\n\nWestern Digital is also an attractive pick due to it's earnings outlook. Analysts are still raising their earnings estimates for the company. The growing optimism on earnings prospects are driving estimates higher, which should get reflected in its stock price.\n\nEarnings estimates for the next quarter and full year are increasingly being driven higher and higher. The company is likely to earn $1.46 per share for the current quarter, representing a change of +18.7%. Two estimates have moved higher in the past 30 days. For the full year, the company is expected to earn $3.83 per share, +25.99% over last year.  \n\n\nThe stock has gained 12.3% over the past four weeks. As earnings growth and the Chia frenzy are both likely to drive the stock higher -  in my opinion, it is a good buy, and I have added it to my portfolio.",
        "subreddit": "wallstreetbets",
        "title": "$WDC Western Digital is being driven up by Chia and earnings prospects",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ntqwp7/wdc_western_digital_is_being_driven_up_by_chia/",
        "created": 1623029504.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623058454,
        "id": "nu8axj",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Chia, a 'green' alternative to GPU mining has caused a global shortage of hard discs. I commented on the increased demand, and the earnings expectations in my previous DD.\n\nChia uses a proof of space approach to mining that relies on using empty hard disc space. The high profitability of mining thiscaused a surge in demand for hard discs.\n\nHowever, Chia mining is largely popular in Central and SE Asia right now, with some movement in the West. I expect as more people become aware of this, particularly in the West - it will lead to a shortage of hard discs and SSD's much like the current GPU shortage. There is already a shortage of HDD's/SSD's due to the initial surge of Chia interest causing a buyup of these items. However, as it gains traction, and as people realise how this is much more highly profitable in comparison to GPU mining currently - the demand will be similar to that of GPU's. \n\nThis initial surge I mention, has indeed already caused a surge in the stock prices. With Western digital share price being $52 at the start of the year and now around $77/78. Seagate is also up from $60 to $99. \n\nHoffman, the president of Chia Network, says he 'is suprised at the speed at which the hard disc capacity devoted to Chia has grown and admits that this is likely to caused disruptions to the supply chain for some time.'.\n\nIn summary, Chia is more profitable and more energy efficient than GPU mining. Hard drive demand has already spiked leading to shortages. I expect as this grows in profitability in Asia and the west, it will lead to further shortages much like that we see of HDD's.\nTherefore driving up the stock price as already has been shown.",
        "subreddit": "wallstreetbets",
        "title": "$WDC Western Digital DD: Part 2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nu8axj/wdc_western_digital_dd_part_2/",
        "created": 1623087254.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1622908388,
        "id": "nsyqj1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\n$WDC has good growth prospects due to a surge in HDD demand, and good earnings prospects.\nChia uses spare storage space on hard drives to verify blockchain transactions. This is considered to be the 'green' alternative to other GPU based mining.\n\nIncreased HDD demand:\n\nChiaCoin has gone up massively in recent months, driving a rush to purchase hard drives in order to mine it. As such, there have been hard drive shortages recently due to the increased demand. Much like GPU and semi-conductor stocks, we can expect good price action (and have already seen it) for hard drive manufacturer stocks.\n' \"In recent weeks the demand and pricing for high capacity [hard disk drives, or HDDs] has seen a material step higher ... and enterprise [solid state drive, or SSD] prices have also moved higher,\" analysts at Bank of America wrote in a Thursday report. The \"primary upside driver\" for that rising demand, according to BofA: chia. '\nWestern Digital is a market leader in the production of HDD's, producing some of the highest quality hard drives that have the best life expectancy, and a good warranty. As ChiaCoin mining is very taxing on HDD's, buyers will be looking for the most durable hard drives. Which is why I am focusing my attention on Western Digital versus another stock such as Seagate. Western Digital is probably the best known manufacturer of hard drives, and usually a top choice for consumers.\n\nEarnings:\n\nWestern Digital is also an attractive pick due to it's earnings outlook. Analysts are still raising their earnings estimates for the company. The growing optimism on earnings prospects are driving estimates higher, which should get reflected in its stock price.\nEarnings estimates for the next quarter and full year are increasingly being driven higher and higher. The company is likely to earn $1.46 per share for the current quarter, representing a change of +18.7%. Two estimates have moved higher in the past 30 days. For the full year, the company is expected to earn $3.83 per share, +25.99% over last year.\nThe stock has gained 12.3% over the past four weeks. As earnings growth and the ChiaCoin frenzy are both likely to drive the stock higher - in my opinion, it is a good buy, and I will be adding it to my portfolio today.\n\nFurther DD on the impact of Chia mining:\nChia, a 'green' alternative to GPU mining has caused a global shortage of hard discs. I commented on the increased demand, and the earnings expectations in my previous DD.\n\nChia uses a proof of space approach to mining that relies on using empty hard disc space. The high profitability of mining this coin caused a surge in demand for hard discs.\n\nHowever, Chia mining is largely popular in Central and SE Asia right now, with some movement in the West. I expect as more people become aware of this, particularly in the West - it will lead to a shortage of hard discs and SSD's much like the current GPU shortage. There is already a shortage of HDD's/SSD's due to the initial surge of Chia interest causing a buyup of these items. However, as it gains traction, and as people realise how this is much more highly profitable in comparison to GPU mining currently - the demand will be similar to that of GPU's.\n\nThis initial surge I mention, has indeed already caused a surge in the stock prices. With Western digital share price being $52 at the start of the year and now around $77/78. Seagate is also up from $60 to $99.\n\nHoffman, the president of Chia Network, says he 'is suprised at the speed at which the hard disc capacity devoted to Chia has grown and admits that this is likely to caused disruptions to the supply chain for some time.'.\n\nIn summary, Chia is more profitable and more energy efficient than GPU mining. Hard drive demand has already spiked leading to shortages. I expect as this grows in profitability in Asia and the west, it will lead to further shortages much like that we see of HDD's. Therefore driving up the stock price as already has been shown.",
        "subreddit": "wallstreetbets",
        "title": "Mega DD $WDC Western Digital is being driven up by 'green' ChiaCoin mining and good earnings prospects",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nsyqj1/mega_dd_wdc_western_digital_is_being_driven_up_by/",
        "created": 1622937188.0
    }
]