[
    {
        "author": "bigballsmcginty",
        "created_utc": 1612099625,
        "id": "l9c9my",
        "num_comments": 567,
        "num_crossposts": 1,
        "selftext": "🚨🚨🚨🚨🚨🚨🚨 merger announced enjoy your tendies boys, give me a follow for more DD🚨🚨🚨🚨🚨\n\n**Microvast DD**\n\nI currently hold 3000 shares of Tuscan Holdings (THCB) with a $14.87 average. THCB is a Special Purpose Acquisition Company (SPAC). I initially got in on this trade when the letter of intent (LOI) with Microvast was released and have added to my position in the week passed. The price Peaked at $20.93 on the 28th of December and has since then slowly dropped and traded in the $14-$16 range with a relatively low volume. I have decided to share my detailed Due Diligence where I’ve touched on a number of key points and made my argument as to why the Reward outweighs the Risk with investment in this SPAC.\n\n**TUSCAN HOLDINGS $THCB**\n\nTuscan Holdings have made their desire to merge with Microvast known by filing a 14A (LOI) on the 13th of November in which they also extended the time frame to get the deal done from the 7th of December to the 30th of April 2021.\n\nThe CEO Stephen Vogel is a very success businessman and has a lot of experience with acquisition companies. Notably he was executive chairman at Forum merger Corp and Chief Financial Officer &amp; Director at Subversive Capital Acquisition Corp. \n\nTalks with Microvast will be about different aspects of the deal such as; Valuation, Sponsor Equity, Deal Certainty and Registration rights. Once these have been agreed upon a Definitive Agreement (DA) is filed with the SEC (DEFM14A form).\n\n**MICROVAST**\n\nFounded in 2006 Microvast have established themselves as market leader in the development and manufacture of fast charging, long-Life battery systems with superior safety for electric vehicles. \n\nMicrovast's batteries have supplied a range of e-buses, vans, trucks, passenger vehicles, automated guided vehicles, forklifts, and mining trucks. The company has installed batteries in 28,000 vehicles globally and even supplied buses at the 2018 Seoul winter Olympic Games. This international exposure puts Microvast at the top teir of EV suppliers.\n\n&amp;#x200B;\n\n[Figure 1-Microvast worldwide application](https://preview.redd.it/e9plq25i5oe61.png?width=358&amp;format=png&amp;auto=webp&amp;s=1ec631e4ded41ebbe84b7b806edac766b7757292)\n\nThey have recently released information on a new fast charging battery (HnCO-AH) with a high energy density of 265Wh/kg giving a decisive competitive advantage over current cells for the commercial vehicle sector that have an average density of 240Wh/kg. \n\nin July 2020, Microvast completed construction on a production facility in Ludwigsfelde, Germany (close to potential future clients such as Mercedes-Benzes). The company said it plans to start production in March 2021 to begin making the new battery modules and packs for European customers. Recently the company has posted 77 new jobs for this facility.\n\n&amp;#x200B;\n\n[Figure 2- Microvast German facility plan](https://preview.redd.it/5tqdlclm5oe61.png?width=384&amp;format=png&amp;auto=webp&amp;s=59110abff4025a5b488ff1cd67d78f6eac5ae262)\n\nIn its new plant, Microvast is expected to put together parts made by the company's manufacturing facility in China. At first, the production capacity for the new factory is expected to be 1.5 GWh per year. However, it is expected to ramp up to 6 GWh per year with 250 employees. The new German facility will also function as a research facility and the company’s European headquarters. Microvast said it had invested approximately 50 million euros in the project.\n\nThe company have received credit from the prestigious R&amp;D100 awards for their pioneering design of battery components optimized for high performance and uncompromising safety. This award undoubtedly lead to the United States Advanced Battery Consortium LLC (USABC), a subsidiary of the United States Council for Automotive Research LLC (USCAR), and a collaborative organization of FCA US LLC, Ford Motor Company and General Motors, to announce a $4.5 million contract to Microvast to lead a program to develop low-cost/fast-charge batteries for electric vehicle application. \n\nMicrovast currently exists as a private company and it is still a relative unknown as to how the company is preforming financially. More information on this will come when the DA is announced and is normally contained within the investor’s presentation. The CEO Yang Wu however stated the company expects to generate more than $100 million in revenue in 2020.\n\n**Why buy $THCB**\n\nThere are a number of reasons why I think THCB is a good buy. At current prices\n\nTHCB and Microvast tick several boxes.\n\n1. EV Battery play (EV hype) \n\n2. Multinational company with 2 factories in China and one nearing completion in Germany, hoping to start production in Spring.\n\n3. Amazing technology with recognition from the prestigious R&amp;D100 awards for its new high density and safe battery.\n\n4. Projected revenue's of $100m for 2020 (Big positive, SPAC company that has established supply chain and revenue)\n\n5. low public float (27M shares) with 75.69% institutional holdings and 20.85% insiders. There is also touted to be overwhelming interest in this SPAC in Asia (China, Japan, South Korea) by all accounts, and if true, Chinese hedge funds will make this parabolic on ticker change. (this basically means demand &gt; Supply for shares).\n\n6. Microvast as a company have a high projected growth rate which will be accelerated with capital from merger.\n\n**Indications that DA is imminent.** \n\nFor anyone who has followed this SPAC for a while there has been a lot of anticipation of when the DA will be announced. On a number of forums anticipation has grown and a lot of speculation as to when the DA will be announced has been met with disappointment and lead to frustration with investors. I want to put this to bed by showing you the following timeline.\n\n&amp;#x200B;\n\n[Figure 3-DA timeline Credit-Prospern](https://preview.redd.it/j04m69yo5oe61.png?width=319&amp;format=png&amp;auto=webp&amp;s=ead147ead6c595098aa192b6b1a75e00f4cdf38e)\n\nTHCB is within the normal time frame of getting the deal done and have also had to deal with a number of public holidays within this time frame such as Thanksgiving, Christmas and New years eve which could have caused delay in getting the deal finalised.\n\nMicrovast have also in the last week given a number of indications the deal could close soon. Eagle Eyed investors have noticed the addition of anInvestors section on the Microvast website.\n\n&amp;#x200B;\n\n[Figure 4- microvast Investors page](https://preview.redd.it/gvwqmc6r5oe61.png?width=447&amp;format=png&amp;auto=webp&amp;s=a45e2b9033829cfa5dfca6fd156f5aac960c963c)\n\nas well as the changing of the company’s status as a private company to public on LinkedIn.\n\n&amp;#x200B;\n\n[Figure 5- Microvast LinkedIn update](https://preview.redd.it/m71dpzvs5oe61.png?width=229&amp;format=png&amp;auto=webp&amp;s=32dad53f5cfefe43e4e8603a9bbba824fa2f2b1a)\n\nFor me these are strong indicators that the deal is nearing completion and removes any doubt in my mind that the deal will fall through, and the SPAC liquidated ($10 floor so 33% loss risk). Tuscan holdings have also in recent weeks filed for a new SPAC which is another indication to me that the deal is nearing completion, after all why would they be creating a new SPAC if this was deal was not nearing completion. If the deal fell through Tuscan would lose a lot of integrity and the idea of filing for a new SPAC after this would-be crazy IMO. It is in both Tuscan and Microvasts best interest to complete the deal, Tuscan for integrity purposes(and pay-day) and Microvast to capitalise on the Current EV hype. \n\nIt is also very promising to note that in recent time there have been very few SPAC deals that have not been completed, especially with a LOI already in place.\n\n&amp;#x200B;\n\n[Figure 5- SPAC liquidation statistics since 2010](https://preview.redd.it/ls80kfyw5oe61.png?width=415&amp;format=png&amp;auto=webp&amp;s=c23054e0133b4e6362287ff43501c69ebc536ad6)\n\n**Conclusions** \n\nThe long-awaited DA is the only thing holding this down and a move similar to $QS isn’t out of the question given they are both battery plays. QS ran from $18-$140 within a month or so back in November/December. They will not have a product available for sale until 2024. Microvast has a excellent product already in production and are generating revenues, this gives it huge upside potential in the short-term. \n\nLong term I can see the company expanding production into the states given the interest shown from the USABC and has the potential of forming partnerships with several big automakers, especially now with the factory in Germany.\n\nAt current prices I think this is a steal hence I have decided to share all this information with you. IMO DA will come soon and I’m excited to see what happens and how big a move it can make (my guess 50%+).\n\nGood luck all, I would appreciate any feedback or other information regarding THCB or Microvast I may have missed and you feel is important.\n\n.\n\nLinks\n\n1) [https://www.bloomberg.com/news/articles/2020-11-12/microvast-is-said-in-talks-to-go-public-via-tuscan-spac-merger](https://www.bloomberg.com/news/articles/2020-11-12/microvast-is-said-in-talks-to-go-public-via-tuscan-spac-merger)\n\n2) LOI\n\n[https://www.sec.gov/Archives/edgar/data/1760689/000121390020036989/ea129486-def14a\\_tuscanhold.htm](https://www.sec.gov/Archives/edgar/data/1760689/000121390020036989/ea129486-def14a_tuscanhold.htm)\n\n3) [https://moneymorning.com/2020/12/15/is-microvast-stock-a-buy-after-its-spac-deal/](https://moneymorning.com/2020/12/15/is-microvast-stock-a-buy-after-its-spac-deal/)\n\n4) [https://www.electrive.com/2020/12/18/microvast-announces-fast-charging-utility-vehicle-battery/](https://www.electrive.com/2020/12/18/microvast-announces-fast-charging-utility-vehicle-battery/)\n\n5) [https://www.azom.com/article.aspx?ArticleID=19793](https://www.azom.com/article.aspx?ArticleID=19793)\n\n6) [http://microvast.com/index.php/news/info/109](http://microvast.com/index.php/news/info/109)\n\n7) [https://auto.economictimes.indiatimes.com/news/auto-components/ev-battery-maker-microvast-to-go-public-through-spac-merger/79218830#:\\~:text=Microvast%2C%20whose%20batteries%20powered%20the,Wu%20said%20in%20a%20statement](https://auto.economictimes.indiatimes.com/news/auto-components/ev-battery-maker-microvast-to-go-public-through-spac-merger/79218830#:~:text=Microvast%2C%20whose%20batteries%20powered%20the,Wu%20said%20in%20a%20statement).\n\n8) [https://uk.finance.yahoo.com/quote/THCB/holders?p=THCB](https://uk.finance.yahoo.com/quote/THCB/holders?p=THCB)\n\n9) [https://spacinsider.com/stats/](https://spacinsider.com/stats/)",
        "subreddit": "SPACs",
        "title": "Detailed DD on Tuscan Holdings $THCB. Why you should think about buying soon.",
        "url": "https://www.reddit.com/r/SPACs/comments/l9c9my/detailed_dd_on_tuscan_holdings_thcb_why_you/",
        "created": 1612128425.0
    },
    {
        "author": "martinshkreli",
        "created_utc": 1611946590,
        "id": "l80sl1",
        "num_comments": 340,
        "num_crossposts": 0,
        "selftext": "I was away the last few days giving depositions to a different three-letter government agency--sorry about that. GME continues to be a Carollian experience. Through this looking-glass, there is a world where stock prices do not reflect the value of the underlying companies whose partial ownership is traded through common stock. To some, the market is, more or less, broken, for now. That's not a good or a bad thing. The market mechanism is not supposed to make an implicit judgment. There is information in price, but that information is difficult to divine and interpret. Markets aren't good, bad, rational or irrational: they just are.\r\n  When one group takes action in a market to alter the playing field, the market is not a pure market anymore. It's lost 'integrity' and loses more with every modification. This typically only happens in moments of crisis or technological change: countries ban short-selling, for instance; exchanges will unwind clear 'fat-finger' trades, etc; speed bumps may make the market more 'fair' for the technologically behind. We're learning more about how markets can have what appear to be 'unintended' consequences (flash crashes, GME-style reverse crashes), or can be 'gamed' (spoofing, quant as a whole), but we're back to square one: markets don't have feelings. The rules are simple: post your price, the amount, and the rest is order-matching. All of the rest are modifications against the spirit of the laws of the jungle.\r\n  So, like you, I'm disgusted by what happened the other day. My guess is the DTC and others required incremental collateral for clearing any GME trades--this required RH to raise capital. I actually don't think RH is to blame here! Every broker did the same thing, so there must be a root cause. I mentioned something like this may happen the other day, and I repeat my admonition to not trade on margin. I suspect GME long buying will require 100% margin at virtually any broker. Brokers have to protect themselves, but they can be influenced by the rest of the parties in their food chain, as we saw.\r\n  GME is still worthless compared to its current price. Keep that in mind. You're buying a flower, a baseball card, a beanie baby, a photocopy of a Picasso, all for prices that you know are a lot more--not just a lot more, but insanely more--than anything close to what it could be worth. Those are the facts: GME is just a shitty retailer that will struggle to survive, let alone become a business worth 20 or 30 billion dollars. All of the Ryan Cohen transformation stuff is BS relative to the price change. A good team may be able to turn around GME to the point where it is worth $40, MAYBE. It'll never be worth $300, or at least, the probability that GME operations could support a reasonable price like that is about as small as my odds of becoming a MLB starting pitcher.\r\n  That doesn't mean the stock can't go up. The world is conflating what a market is by trying to assign it implicit judgment. Traders have the right to buy and sell anything they'd like for any price that they'd like. One man's \"bubble\" is another man's \"deep value.\" I bought a rap CD for millions of dollars. That's my right. Did I overpay? Well, that's really not a judgment anyone can make, is it? If I paid $10,000,000 for a baseball card which is well-known to trade for $5, then it seems clear I've overpaid, right?\r\n  No. Speculators buy assets for many reasons. Sometimes its because they're making a value judgment: this is WORTH more than my purchase price. But what does that imply? What is worth or value? Most speculators (I suppose you can define that as a buyer who has an explicit intention to sell at a later date, probably soon) buy things because they are confident they can sell at a higher price soon. The value judgment is secondary, and sometimes not relevant at all. Speculators are the animating spirit of the market. If you curb the ability for speculators to act, you have a farcical excuse of a market. But, you can't blame a clearing broker for saying, \"what happens if your client can't clear this trade?\". The stock just went from 300 to 150--what if your client is broke? To me, the simple answer there is to require 100% margin. Limiting the ability for someone to buy a stock for 100% margin (literally the cash to cover the trade is set aside) smells awful. I wouldn't bother with conspiracies--they won't help you trade well.\r\n  Many of you are brand new to the world of trading. I've traded my whole life--it is very, very hard. I am not very good at it, to be frank. I do think I'm a very good value investor, and in biotech, an extremely good binary-event trader. 99% of people, including in finance, are not good traders. 99% of people are not good 'value' investors, either. That doesn't mean you shouldn't want to become one or try. But it is inordinately difficult. There's nothing wrong with hobbies or 'side gigs', but I really think you should think about the market like a professional sport, or fighting/boxing league, where you are permitted to 'play with the pros'. It doesn't make too much sense to 'part time' fight Brock Lesnar or take LeBron 1-on-1. But this is what you're doing when you trade. Be careful.\r\n  For those newish to trading, here is my advice on some reading materials:\r\n    1) Market Wizards series. This is one of the best series on great investors/traders, which takes you into the mind of the successful trader, in their words. It's always by the same author (JS), too, who is very experienced and knowledgable.\r\n    2) Trading to Win by Ari Kiev. Read it. Probably the best book on the theory of trading ever written.\r\n    3) AVOID most books on trading. Unless there is a reason to read them that you can really digest, they're probably empty wastes of time at best, or at worse, could mislead you into some terrible strategy. You can't go wrong reading the books by or about people who have made fortunes in the market. But always take everything as a grain of salt. AVOID the opinions of others in general. This sounds self-referential, but will make a little bit more sense after reading 1/2.\r\n  When you read these books, you'll realize that my life of 'value investing' is basically irrelevant to the near-term of the stock market, especially in situations like GME or TSLA. GME will probably go down over time, as I mentioned, because it is wildly overvalued and, generally, wildly overvalued stocks tend to go down over time. That doesn't have to be true. That's why investors diversify and 'stop-loss' and do other things to protect themselves. You should do all of that, too. My style, and those of others, simply relate the price of something to the amount of cash it can generate. That's value investing in a nutshell, and it is what the entire industry of Private Equity (Blackstone, Apollo, Carlyle, etc.) is all about. Hedge Funds and Mutual Funds do a little of this as well, but to decide whether a stock will go up or down is this dark art called 'trading'. The \"next\" Steve Cohen might be being born right here, right now, in WallStreetBets. Who knows.\r\n  I still think GME will trade at 1,000. Why? I am guessing, like all of you, and every other trader out there. No one knows anything. As I mentioned, the borrow interest rate is what I think is important to watch. You're at a disadvantage to other traders in that respect: hedge funds can pull up that information through phone calls, contacts, etc. which you are hopeless to compete against. It doesn't mean they're going to make money and you won't. It's just something to think about. I like 1,000: it's a big round number that is meaningful in the psychology of the markets, to a very small extent. It may trade there for 5 seconds, or it may trade there and keep going higher. For some reason, I think the stock has a bit of \"destiny\" to go there. I may be 100% wrong. As I said, to the extent I have any skill at all, it's generally in being able to predict the value of stocks of companies (and other assets) many years from now, and in biopharma, if anywhere. \r\n  I hope everyone does well, and even is being entertained, by all of this. Just make sure that if you have a massive gain in GME, that you 'take something off the table'. Don't be greedy. Some of this money is life-changing. Even if it is 10% of your position, book some kind of gain. It will feel good. Be objective. Don't use margin--you may lose more than you can afford. I've been there. It sucks balls worse than you can imagine. Don't do it for GME, even if RH or anyone else lets you. Don't go too crazy with options, even if they let you. I hope you all are able to buy Wu-Tang albums, tendies, autism treatment and whatever else your hearts desire at the 'end' of this, whatever that means. \r\n  Good luck WSB, I love you!\n\n(sent from martin, posted by mo)",
        "subreddit": "wallstreetbets",
        "title": "GME - Shkreli Thoughts 1/29",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l80sl1/gme_shkreli_thoughts_129/",
        "created": 1611975390.0
    },
    {
        "author": "SignificantBug8852",
        "created_utc": 1611196108,
        "id": "l1ow96",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "***Disclaimer: Have benefited from previous DD and many of these are summary notes of previous DD.  have about 600k interest across all 20 of them. Purpose of this post is to discuss and see if they are any gems left out.***   \n\n\nHere is a list of SPAC below 11 and are still attractive in terms of low downside risk. Any others I am missing? Happy to discuss any thoughts.   \n\n\n1. FPAC (10.38) -  FPAC is a large Fintech SPAC with strong management, reduced founder shares (14.7%), undervalued in comparison to its peers. Previous spac led to 2 LOI, so likely to have LOI soon  \n2. MLAC (10.18) -  Founder is advisor to Bridgetown I and II (bringing and advising on deals) and close connection to the management team of Bridgetown. \n3. HIGA (10.3) -  Healthcare, solid leadership team - Hemant Taneja (MP, General Catalyst),Quentin Clark (Former CTO, Dropbox),Anita Pramoda (Fmr Chair, Federal Reserve Bank of SF),Glen Tullman (Founder and Chairman, Livongo) \n4. ALUS (10.37) -  recent additions John Wu and Christopher Considine. John brought Indie Semiconductor through $THBR and Christopher joined as a science advisor with expertise in molecular engineering and technology. Might change from oil and gas to clean energy. \n5. LATN (10.4) -  \"This is the second SPAC for the Union Acquisition team, having successfully finalized a merger with their first one. They have the experience and know how to get a deal done. LATN is one of the oldest SPACs live on the market today, with a deadline to complete a deal being April 17, 2021. If the Union team expects to complete a deal by their deadline and not go defunct, a deal announcement should happen any time now \n6. BWAC (10.42) -  CEO is a board member of Heineken, control shareholder of NGEN with an ESG portfolio; Encycle, Enzymedica, Zevia, Revolution foods &amp; Bright farms. CEO led the acquisition of Nabisco Foods, a $19 billion transaction, the initial public offering and spinout of Kraft Foods, raising $8.7 billion, and the $5.5 billion merger of Miller Brewing Company with South African Breweries.\n7. ETAC (10.47) -  Led by Steven Singh, MD of Madrona, director at $DOCU -Jeff Clarke, ex CEO $KODK -Madrona VC group that invest in early stage tech companies -Targeting software / tech industry (no target yet) \n8. FRX (10.53) -  Ex Disney and Tiktok executive. Shaq on board. Doing tmt with cash flow. Long hold as just split \n9. GNRS (10.55) - MJ Spac\n10. CRHC (10.61) -  operational team, tiger global, goldman chair. chair joined ibm board \n11. EQD (10.64) -  Chairman Sam Zell, the founder and Chairman of Equity Group Investments; CEO and Director Bill Galvin, the former CEO of Anixter; and CFO Philip Tinkler, the CFO of Equity Group Investments. The company plans to target a business in North America in the industrial sector with an enterprise valuation between $1 billion to $1.5 billion \n12. PRPB (10.68) -  Former co head at Blackstone PE, 3rd SPAC. 25+ years in senior leadership roles at Blackstone and most recently co-head of Private Equity Led taking Dun &amp; Bradstreet private and subsequently IPO in July 2020 Initial investment of $2.1 Billion - worth $8 Billion now \n13. XPOA (10.7) -  Ex uber exec that led didi and uber m&amp;a in china, Eric Schmidt (Google founder) as special advisor \n14. AACQ (10.75) -  Charles Drucker ex Worldpay ceo. Fintech play \n15. GRSV (10.77) -  Gores spac, normally do ok, but not out of the world - case in point GHIV \n16. AONE (10.8) -  Kevin E. Hartz (co-founder of Xoom-~~acq PayPal-~~ and Eventbrite); Spike Lipkin (Founded of Newfront Insurance) - no news yet, but focused on tech \n17. APSG (10.84) -  800m, prestigious group with Apollo that has good connections in private firms, and all headed by Sanjay Patel and Apollo mgmt who are very competent. Previous spac fare ok \n18. FMAC (10.85) -  draftking (very successful gambling spac) ceo as board of director, started by VC first mark that invested in shopify, pinterest, airbnb. rumoured to list discord \n19. AVAN (10.9) -  European spac. Rumoured to be Klarna - fintech \n20. LFTR (10.98) -  Management with ties to Coinbase and Etrade",
        "subreddit": "SPACs",
        "title": "SPAC Below 11",
        "url": "https://www.reddit.com/r/SPACs/comments/l1ow96/spac_below_11/",
        "created": 1611224908.0
    },
    {
        "author": "HawkJockey",
        "created_utc": 1610632257,
        "id": "kx5zmx",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": "Boys, we all know the MMs roll off their risk from selling your way OTM calls by delta hedging with long stock. The sheer thiccness of WSB putting their western union money into OTM calls has clearly created momentum in a lot of names (GME most recently). How do we inject that shit with steroids to ride our positions to the moon you ask? Math, motherfucker. Math.\n\nMM's don't have to buy 100 shares per contract to hedge their position against your degenerate FD's. They only have to delta hedge. This means if you buy a wayyyy OTM option with a delta of 0.30, the MM's hedge ratio is lower - they might only have to buy 30 shares to offset the risk of the option they sold you. And when they only have to buy 30 shares, stonks don't go up as much. However, if we want to commit as much institutional money as possible to a position, we have to find the cheapest options possible to get us the most delta for our buck.\n\nWhat we want to find is the optimal delta to price ratio to pump as many long shares into the market as possible. What kind of options give us the best ratio for this? I'm glad you asked\n\nWAYYYYYYYYYY FUCKING OUT OF THE MONEY CALLS\n\nThat's right, you don't even have to change your \"strategy\" to make this work. Next time you think about buying that ATM safe bet with 3 months to expiration...don't. Do it for u/deepfuckingvalue and the boys: scroll to the bottom of the options chain and click the cheapest shit you can. \n\n&amp;#x200B;\n\nTL;DR GME 15JAN $55 C because math",
        "subreddit": "wallstreetbets",
        "title": "How to Squeeze the life out of GME shorts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kx5zmx/how_to_squeeze_the_life_out_of_gme_shorts/",
        "created": 1610661057.0
    },
    {
        "author": "thestockpenguin",
        "created_utc": 1611777653,
        "id": "l6cz95",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "Tldr: detailed evidence on why i think ALUS will take Freyr battery public and is severely undervalued compared to peers such as PIPP, CLII, PDAC, IMPX\n\nBefore you post comments like new account, ban, pump &amp; dumper, ALUS has gone from 1.1 to 1.8 since when I called it one month ago. I've been accumulating the whole time and have increased my position of 80k warrants at 1.6 and 6k in commons at 10.45.\n\nIf you haven't seen my previous dd post on ALUS, [here it is](https://www.reddit.com/r/SPACs/comments/kyyi8w/new_alus_dd/)\n\n**Brief Background if you don't want to read my previous post:**\n\n* $ALUS (Alussa Energy Acquisition Corp.) is a $290 Million SPAC that's been around since June 2019.\n* Though their target sector appears to be Oil and Gas we have strong evidence to support their shift to clean energy and their target as freyr batteries similar to SBE, SHLL, SPAQ\n* Email to IR for proof they're targetting \"Energy and Energy Transition\" and Linkedin overview name change from \"Oil and Gas\" to \"Global Energy and Energy Transition\" - check prior post for pic proof\n* New additions to board to justify clean energy transition (John Wu, Christopher Considine)\n\n**Evidence and timeline of ALUS finding Freyr batteries as target:**\n\n* Daniel Barcelo is the CEO/President of ALUS and is the sole shareholder on the mgmt team with 20% stake of post-merger company so keep in mind he has all  the incentive to find a good target\n* It first caught my attention when I found his instagram that he had gone to northern Norway in mid-november and I did some investigating to confirm my suspicions that this was for business since were in middle of a pandemic and its fucking cold in norway this time of year\n* Norway caught my eye since Chi Chow, director of IR, has small list of interests on linkedin and 2 of them happen to be EV battery companies in Norway\n* Quick summary on Freyr battery - it is the top ev battery company in Norway and is in development stages with production planned in 2022 and construction for battery building will occur next quarter in Mo i Rana\n\n&amp;#x200B;\n\n* **Clue 1**: November 13 2020 - Trip to northern Norway with wife Paulina\n   * Tracked down location from photo and is closest to Freyr Batteries who is located in Mo i Rana in northern Norway (from his personal IG)\n   * Daniel's linkedin interactions in past few months have been heavy on climate change and lithium batteries\n* **Clue 2**: November 2020 - Daniel's wife Paulina happens to like a Freyr post on Linkedin during November which matches with timeline of trip and is connected to Hilde Renningsen who is director of communications at Freyr.\n   * Evidence here is pointing that she went to Norway and met Hilde of Freyr\n\nhttps://preview.redd.it/5yfuhmhuixd61.jpg?width=540&amp;format=pjpg&amp;auto=webp&amp;s=b146eadc8398d70220e3b46e78035a9758c4a543\n\n* **Clue 3**: Daniel Barcelo is connected to Freyr CFO Steffen Foreid, CEO Tom Jensen, and director of communications Hilde Renningsen\n   * Evidence here shows Daniel is pretty well connected to top Freyr execs on linkedin\n\nhttps://preview.redd.it/ck27sgyzixd61.jpg?width=710&amp;format=pjpg&amp;auto=webp&amp;s=87b9bc3295a415fcb15c13395ee5bc506a02f0bd\n\n* **Clue 4**: Chi Chow, director of investor relation at ALUS, is also connected to Hilde Renningsen of Freyr and has Freyr listed in his interests\n   * Evidence here points toward ALUS team being connected to Freyr\n\nhttps://preview.redd.it/ha0b03e3jxd61.jpg?width=901&amp;format=pjpg&amp;auto=webp&amp;s=a11ad7d18ede9d13a9cf9a8213a69b6b7b8517f3\n\n* **Clue 5**: December 2020 - Daniel Barcelo liked a post by Yuriy Shpek who is the finance director of Glencore. In December 2020, Yuriy happens to like a Freyr post on Linkedin\n   * Dug deeper into this and found that Glencore signed a MOU supply deal with Freyr on December 9 2020. This matches with timelines of linkedin interactions\n   * Evidence suggests that Daniel is involved in Freyr and is also connected to its stakeholders\n\nhttps://preview.redd.it/bq9yfn8ajxd61.jpg?width=1217&amp;format=pjpg&amp;auto=webp&amp;s=1bf74638da109417d999d606251fada177fb6c89\n\n* **Clue 6**: Daniel Barcelo is connected to Arve Ulriksen and Wiggo Dalmo on Linkedin. Arve Ulriksen is the CEO of the land in Mo i Rana where Freyr will be built on. Wiggo Dalmo appear to be doing the      construction for Freyr's new building.\n   * I think by now it is very clear that Daniel went to Norway in November to Mo i Rana to meet Freyr and got a tour of the site hence how he's connected to these people\n* **Clue 7**: Daniel's new most recent like on twitter is in Freyr\n\nAgree or disagree with me, if you still think this is far-fetched and all a coincidence, you can stop reading here. To me and most people I'd believe, this is pretty sound evidence of ALUS being in negotiation with Freyr. If you're still intrigued, let me show you evidence on Freyr's side of them being prepared for listing:\n\n* January 2020 - Introduction of 3 new high level executives: generally a big change in management is evidence for listing\n* Freyr listed on OTC markets in July 2020 and has gone from 1.7 - 15 in the last few months. Evidence of insider buying which could mean they know a deal is on is noted at significant spikes. Most Recent spike was last Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ranegeogjxd61.jpg?width=953&amp;format=pjpg&amp;auto=webp&amp;s=80d4319570d1385377e7b6033ec8e56aefe74a68\n\n* Freyr said in statement in July 2020 that: \"FREYR intends to apply for a listing at a recognized marketplace in the next 12-18 months. \" This would place IPO at around July 2021 which means if its ALUS like I believe it'll be announced soon.\n   * This is in line with their financing needs as they need to raise more funds for the building of their battery factory\n\nNow you might be thinking, what the hell is Freyr batteries?\n\nHere is a quick summary:\n\n\\- A lot of Norway's GDP comes from traditional oil and gas, they realize now they have to keep up hence here's Freyr batteries with intentions to become Norways giga factory with 4 factory locations in a belt and is most ahead in Norway in terms of battery development. Seems to be supported by Norway government as well so strong incentive to succeed.\n\n\\- Norway is leading country in terms of EV car usage - I think its almost 50%? Once Freyr is in full production I think it would become a leading supplier for its domestic EV cars\n\n\\- MOU deal signed with Seimens for supplier deal, partnership with Maersk\n\n\\- Signed deal with 24M for battery technology usage in December 2020\n\n\\- Plans for development of 32 Giga watt factory and to be in production stages by 2022\n\nBear comments\n\n\\- Pre revenue, but this is often seen with other battery companies like QS\n\n\\- Does not have deal with automotive company yet\n\n\\- not sure of valuation, seems to not have too much funding currently but this space is very forward looking so valuation could be high\n\nHere's the link to investor presentation for sneak peak on CAGR, development, etc\n\n[https://www.freyrbattery.com/news/ceo-tom-einar-jensen-presented-freyr-at-pareto-securities-virtual-power-renewable-energy-conference-january-21-2021](https://www.freyrbattery.com/news/ceo-tom-einar-jensen-presented-freyr-at-pareto-securities-virtual-power-renewable-energy-conference-january-21-2021)\n\nOverall, I think ALUS is quite undervalued hence I've been loading all the way up from 1.1 to 1.6s now. Compared to its peers PDAC, IMPX, BOAC who are all trading much higher, I think this is still undervalued. Commons are especially low risk. For what I believe to be a battery play, I think this is well worth the prices we have now. I know this was a long read, but hope you've enjoyed it.",
        "subreddit": "SPACs",
        "title": "deep dive on ALUS and why i think they will take freyr battery public",
        "url": "https://www.reddit.com/r/SPACs/comments/l6cz95/deep_dive_on_alus_and_why_i_think_they_will_take/",
        "created": 1611806453.0
    },
    {
        "author": "slackrooster",
        "created_utc": 1611180359,
        "id": "l1jsgo",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Wanted to share real quick what Payoneer does and my personal experience - I was working in the finance department of a tech startup that had suppliers in 8 countries in Asia and after several months of pain when expanding our country coverage we finally stumbled on Payoneer as a service.\n\n&amp;#x200B;\n\nPayoneer in a nutshell helps companies large (think Airbnb) and small manage and streamline supplier payments across borders and minimize foreign exchange fees. \n\n&amp;#x200B;\n\nTheir competitors are TransferWise, Tipalti, Paypal, Western Union and traditional banking infrastructure amongst others. I see TransferWise as a real competitor but it appears TW is focusing more on the B2C space than B2B.\n\n&amp;#x200B;\n\nIf you've tried before to make a payment to a foreign supplier before either as a consumer (via your credit card or via bank transfer), you'd understand that the fees are very expensive relative to the amount that you're paying. This fee rate goes down as the amounts scale up, but for a small company like ours we were caught in the middle, with a large diverse set of small payments that happen on a monthly basis to many different countries and currencies.\n\n&amp;#x200B;\n\nWhat Payoneer does for us as a service is simple - we upload the payments required to the portal (which I think is really simple to use) on a monthly basis with the suppliers' banking information, and Payoneer consolidates all the payments required into a single amount in our base currency which we send in a lump sum. Before we do so, Payoneer shows us the foreign exchange rates that they apply to our payments and we can cross check it against interbank FX rates, which we have found to be very near par (i.e. a small company like us can get rates that only the big boys enjoy? Hell yes). Payoneer also didn't charge us a service fee per transaction.\n\n&amp;#x200B;\n\nWhy they work so well for us operationally is also simple - seamless country coverage with minimal sending failures. There are still gaps in this space that has difficult banking requirements and currency controls for different countries, and Payoneer simply took all of that away. We were able to send payments with minimal failures to more exotic countries such as Thailand, China, and Indonesia which really helped streamline our daily operations. \n\n&amp;#x200B;\n\nCustomer service wise they are top notch - any escalations we had were resolved within 48 hours and our account representative was very engaged with us. \n\n&amp;#x200B;\n\nWe as a result are really entrenched with the company and I reckon it is very hard to switch to another provider given A) it's very hard to change your setup once you grow larger and larger, B) their rates are very competitive so financially there is no incentive to switch, and C) their customer service is excellent.\n\n&amp;#x200B;\n\nI'm personally super excited about this and I have to thank the folks who alerted me on this sub on their potential SPAC conversations (there was an Israeli company list that was floating around a few weeks back), PLUS the folks who are bullish on Betsy's $FTOC that I see being frequently mentioned as a SPAC manager with great track record.\n\n&amp;#x200B;\n\nPosition: 1800 $FTOC at \\~$11",
        "subreddit": "SPACs",
        "title": "Payoneer experience as an ex-client ($FTOC DD)",
        "url": "https://www.reddit.com/r/SPACs/comments/l1jsgo/payoneer_experience_as_an_exclient_ftoc_dd/",
        "created": 1611209159.0
    },
    {
        "author": "napkins33e",
        "created_utc": 1609941047,
        "id": "kro81j",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Had issues with the visual bot so these charts are from last night. I had to repost and am not going to take the time to update all charts for pre-market movement. \n\nthe banned ticker: [https://imgur.com/a/yM9lWZT](https://imgur.com/a/yM9lWZT)\n\n[Further out TA: CRAYON MANIA! GME, TSLA, PLTR, AMD, CRM, NIO , ZM, and DIS or 4 dos who cant red or right!!!!!!!](https://www.reddit.com/r/wallstreetbets/comments/kqmsqo/crayon_mania_gme_tsla_pltr_amd_crm_nio_zm_and_dis/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\nBefore you poop out my 🖍crayons 🖍\n\nThis is just a taste the DD I perform and I do not solely rely on my magic crayons. Wish it were that easy.\n\n\\-------------------------------------------------------------------------------------------------------------------------------\n\nGME (Long term Bullish) - If you're not already in GME then I don't recommend playing until you see a break at 18.10 (ish) with heavy volume. If it breaks resistance look out for 18.97-19.74-20.5 range.\n\nIf current support fails, look GME to fill a gap at 16.55-15.77 range. If it breaks 15.77 support then we f'ed. Watchout for 14.5-13.50. Anything below 13.5 and that means Cohen probably died or something.\n\nIf it breaks 19.74 then we moon to 21-23 range for this week.\n\nLink to weekly chart: [https://www.tradingview.com/chart/GME/k94qRfVq-gme-weekly/](https://www.tradingview.com/chart/GME/k94qRfVq-gme-weekly/)\n\nLink to earning runnup chart: [https://www.tradingview.com/chart/GME/FajqVHfS-gme/](https://www.tradingview.com/chart/GME/FajqVHfS-gme/)\n\nhttps://preview.redd.it/uct52h9tup961.png?width=3510&amp;format=png&amp;auto=webp&amp;s=a8b9a251d05a4980b1f919c7e3f3af24081e41d4\n\nTSLA (Bullish): Expecting TSLA to head down to 748 range since it mooned after hours and is near resistance BUT it could hit 757-765-770 because it's TSLA. If green support line fails we could see 740-733-731 area but would need catalyst and volume. If it breaks out of support with no volume then it could trade around no-man's land for the rest of the week while our calles get the theta treatment.\n\nLink to weekly chart: [https://www.tradingview.com/chart/TSLA/nHGT9Uma-tsla-weekly/](https://www.tradingview.com/chart/TSLA/nHGT9Uma-tsla-weekly/)\n\nLink to earnings run chart: [https://www.tradingview.com/chart/TSLA/JPJ2pbU2-tsla-2/](https://www.tradingview.com/chart/TSLA/JPJ2pbU2-tsla-2/)\n\nhttps://preview.redd.it/whjtmtpuup961.png?width=3510&amp;format=png&amp;auto=webp&amp;s=663b39d1a6a048499652554b6249d69dd1c08dc6\n\nAMD (bullish for earning run): If AMD breaks 93.20 with volume then look out for 95-97.99 range. If it bounce off 93.20 resistance with volume then look out for 91.55-89.55.\n\nAMD weekly live chart: [https://www.tradingview.com/chart/AMD/aFDkTOVw-amd-weekly/](https://www.tradingview.com/chart/AMD/aFDkTOVw-amd-weekly/)\n\nAMD earnings run chart: [https://www.tradingview.com/chart/AMD/pCUBtFjh-AMD/](https://www.tradingview.com/chart/AMD/pCUBtFjh-AMD/)\n\nhttps://preview.redd.it/d6ppqrkvup961.png?width=3510&amp;format=png&amp;auto=webp&amp;s=4d264f54a62f8d898789aa63ab5aafa87f065f16\n\nCRM (Bullish): If CRM breaks resistance with volume, look for 226-230-231 range. If it bounces with volume, look for 220-218-216 range.\n\nlink to weekly chart: [https://www.tradingview.com/chart/CRM/H7OpE4N6-crm-weekly/](https://www.tradingview.com/chart/CRM/H7OpE4N6-crm-weekly/)\n\nlink to earnings chart: [https://www.tradingview.com/chart/CRM/rF9L6PCW-crm/](https://www.tradingview.com/chart/CRM/rF9L6PCW-crm/)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/izn2cpqwup961.png?width=3510&amp;format=png&amp;auto=webp&amp;s=43dc2c8a7b9a410cae8cc9e66e0979e4120c997d\n\nGT LEAP Bullish: Need volume. Break at 10.7. Pt 11.42 - 12.02. Rejections at 10.70 with volume and lookout for 10.12 - 9.77. Major failure and major break also shown.\n\nlink to weekly chart: [https://www.tradingview.com/chart/GT/RWcInGSH-gt-weekly/](https://www.tradingview.com/chart/GT/RWcInGSH-gt-weekly/)\n\nlink to leap chart: [https://www.tradingview.com/chart/GT/Xc4XjGlW-GT2/](https://www.tradingview.com/chart/GT/Xc4XjGlW-GT2/)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7zyflshxup961.png?width=3510&amp;format=png&amp;auto=webp&amp;s=4b181fddda9db0748ca754bea9d656f0b86ebbc6\n\nNIO (bullish earnings run): Look for a pt of 55.88-57.83 if NIO breaks current resistance area. If not, look for it to stay within 53.16 (ish) - 51.20 consolidation channel. Complete breakdown at 49.38-46.63 range.\n\nlink to weekly chart: [https://www.tradingview.com/chart/NIO/PeCIV1Y1-nio-weekly-2/](https://www.tradingview.com/chart/NIO/PeCIV1Y1-nio-weekly-2/)\n\nlink late feb chart: [https://www.tradingview.com/chart/NIO/R6oYO5er-nio2/](https://www.tradingview.com/chart/NIO/R6oYO5er-nio2/)\n\nhttps://preview.redd.it/zzetcscyup961.png?width=3510&amp;format=png&amp;auto=webp&amp;s=610dfa926af6f562c1938e3ff7eaeb879fc63b7a\n\nPLTR (Bullish): Look for a break at 24.39 with volume for a pt got 25.5-26.96-28.60. If resistance holds look for 21.48 ish. Anything lower and we are in trouble friends.\n\nlink to weekly chart: [https://www.tradingview.com/chart/PLTR/eag3pAz2-pltr-weekly/](https://www.tradingview.com/chart/PLTR/eag3pAz2-pltr-weekly/)\n\nlink to earnings chart: [https://www.tradingview.com/chart/PLTR/Q7tajVq1-PLTR/](https://www.tradingview.com/chart/PLTR/Q7tajVq1-PLTR/)\n\nhttps://preview.redd.it/swj7crazup961.png?width=3510&amp;format=png&amp;auto=webp&amp;s=5f9238d0d0f8e869d572296c924a31296ddf71de\n\nThanks for reading. \n\nNightMan",
        "subreddit": "wallstreetbets",
        "title": "Crayon Mania Weekly Addition!!!!!!!!!! GME, TSLA, AMD, CRM, GT, NIO, and PLTR or 4 thos wu kant red or write gud (3rd grade reading level and below)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kro81j/crayon_mania_weekly_addition_gme_tsla_amd_crm_gt/",
        "created": 1609969847.0
    },
    {
        "author": "thestockpenguin",
        "created_utc": 1610854672,
        "id": "kyyi8w",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "Tldr: Further evidence that ALUS will take a clean energy company public and is severely undervalued compared to peers such as PIPP, CLII, PDAC, IMPX\n\nBefore you post comments like new account, ban, pump &amp; dumper, ALUS has gone from 1.1 to 1.63 since when I called it two weeks ago. I've been accumulating the whole time and now have a position of 18k warrants at 1.25 and 2.6k in commons at 10.3.\n\n**Recap:**\n\n* $ALUS (Alussa Energy Acquisition Corp.) is a $250 Million SPAC that's been around since June 2019.\n* Though their target sector appears to be Oil and Gas we have strong evidence to support their shift to clean energy similar to SBE, SHLL, SPAQ\n* Before you assume their board is just a bunch of boomer oil and gas executives, pay attention to recent additions John Wu and Christopher Considine. John brought Indie Semiconductor through $THBR and Christopher joined as a science advisor with expertise in molecular engineering and technology\n* CEO and other board executives have been having linkedin interactions with clean energy companies in the past 6 months\n* Commons are trading near NAV 10.38 and warrants at 1.63\n\n**Evidence of transition to clean energy:**\n\n* On their website and SEC documents, they have stated they are looking for an oil and gas target. However, they have recently changed their linkedin description last week and sent this email that both reference energy transition\n\n*Processing img 84zb3yf2ctb61...*\n\n*Processing img q5qur1u5ctb61...*\n\n**Who could it be?**\n\n1. EV Battery Companies in Europe\n\n* Whereas the north american EV/Battery private company pool has shrunk to the point where SPACs are reaching for companies like Faraday Futures, there is still a significant amount of European counterparts that have yet to be taken public.\n* From their 10Q, they have paid nearly 1 million **Euros** in consulting fees to find their acquisition target since April 2020.\n* Chi Chow has a limited amount of interests on Linkedin and 3 EV battery companies in Northern Europe happen to be part of his list. These are: Northvolt, Freyr, and Morrow Batteries. Of these, Northvolt would have a valuation closest to their target.\n* Daniel Barcelo (CEO/President) made a trip to Norway in November from his residence in NYC (check his instagram: danbarcelo). Since we're in middle of the pandemic and Norway is fucking cold in winter, this is probably for business purposes. The location he posted from happens to be quite close to the Freyr site.\n\n2. Hyzon Motors\n\n* HYZON Motors is a US-headquartered global supplier of zero-emissions hydrogen fuel cell powered commercial and heavy vehicles. Hyzon currently has 400 trucks on the road today using their fuel cell technology, with projections for 100,000 trucks on the road by 2030.\n* Daniel Barcelo and John Wu, a board member on ALUS, both liked a post by Hyzon Motors in August on Linkedin.\n* Hyzon Motors have stated that they've been approached by SPACs and are considering a reverse merger through SPAC vehicle\n\nPeople can go ahead and pay a premium for over inflated warrants of newly formed SPACs such as CLII, PDAC, PIPP but we can compare returns in a month or two from now",
        "subreddit": "SPACs",
        "title": "new ALUS dd",
        "url": "https://www.reddit.com/r/SPACs/comments/kyyi8w/new_alus_dd/",
        "created": 1610883472.0
    },
    {
        "author": "CleanOilPaper",
        "created_utc": 1611340184,
        "id": "l2tsi3",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "\\- MoneyGram announced the expansion of its Visa debit card deposit service across Europe. The expansion has launched in collaboration with Checkout.com, a leading global payment solution provider, utilizing Visa Direct, Visa's real-time push payments platform. \n\n\\- MoneyGram has blew the shit out of earnings the past 2 quarters and have seen 142% year-over-year transaction growth for December 2020. That's higher than their 136% year-over-year transaction growth for November 2020. \n\n\\- Q4 earnings are expected on 2/22 and they will blow that shit out of the water.\n\n\\- MGI has been making 7% moves a day. (up and down, unusual stock activity)\n\n\\- Western Union just signed a deal with Walmart and Western Union is a garbage bin compared to MoneyGram. \n\n&amp;#x200B;\n\n\\- TLDR: MGI (MoneyGram) . Get on the fking the spaceship before this stock hits the MOON.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "MoneyGram (MGI) - DD - 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l2tsi3/moneygram_mgi_dd/",
        "created": 1611368984.0
    },
    {
        "author": "Top_Reputation5969",
        "created_utc": 1610607004,
        "id": "kx0fk1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hey Spac friends. Ive been very bullish on ALUS, energy. very low key with 290 million in trust people keep saying its oil/gas based team but i think its easy to say we all know thats not going to happen. They will go green. I expect the website picture to change any day. An email recently was replied by the ALUS team and they said they are considering businesses across the ENTIRE energy chain. Another thing people dont realize is JOHN WU is on the board. He just brought THBR public in a huge semiconductor play! This one is flying under the radar PPL",
        "subreddit": "SPACs",
        "title": "ALUS some DD low key",
        "url": "https://www.reddit.com/r/SPACs/comments/kx0fk1/alus_some_dd_low_key/",
        "created": 1610635804.0
    },
    {
        "author": "napkins33e",
        "created_utc": 1609940022,
        "id": "krny11",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Crayon Mania Weekly Addition!!!!!!!!!! GME, TSLA, AMD, CRM, GT, NIO, and PLTR or 4 thos wu kant red or write gud!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/krny11/crayon_mania_weekly_addition_gme_tsla_amd_crm_gt/",
        "created": 1609968822.0
    },
    {
        "author": "Young_Investor111",
        "created_utc": 1610584704,
        "id": "kwu94h",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Wu-Tang Financial",
        "url": "https://youtu.be/zhUnEg0he4A",
        "created": 1610613504.0
    },
    {
        "author": "DownRangeDistillery",
        "created_utc": 1611842292,
        "id": "l6x8hi",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Early stage company that will replace PayPal, Robin Hood, CASH App, Western Union and more. The app will launch in February. Ticker change from $TSNP to $HMBL in February. I'm and investor and believer, I drank the Cool-Aide and I am making another batch, who wants some!",
        "subreddit": "pennystocks",
        "title": "$TSNP Disrupt the Financial System! (HMBL)",
        "url": "https://www.reddit.com/r/pennystocks/comments/l6x8hi/tsnp_disrupt_the_financial_system_hmbl/",
        "created": 1611871092.0
    },
    {
        "author": "napkins33e",
        "created_utc": 1609912736,
        "id": "krhq8e",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Crayon Mania Weekly Addition!!!!!!!!!! GME, TSLA, AMD, CRM, GT, NIO, and PLTR or 4 thos wu kant red or write gud (3rd grade reading level and below)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/krhq8e/crayon_mania_weekly_addition_gme_tsla_amd_crm_gt/",
        "created": 1609941536.0
    },
    {
        "author": "anundfuersich",
        "created_utc": 1611615320,
        "id": "l4zwjq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I've posted a number of times about Microvast and THCB, including in relation to their litigation and issues about management problems, particularly with the CFO being a bad apple. Some new evidence he's a weird choice at best and probably not a great executive for a multi-billion dollar company.\n\nIf you're in THCB (full disclosure: I still am but have sold down most of my stake; it was my biggest SPAC holding; now it's my #8):\n\nMicrovast, Inc. apparently got a PPP Loan of $223,800.  [https://www.federalpay.org/paycheck-protection-program/microvast-inc-stafford-tx](https://www.federalpay.org/paycheck-protection-program/microvast-inc-stafford-tx)\n\nMicrovast Power Solutions Inc. (subsidiary, using same address and mostly same details) apparently got a PPP Loan of $82,000.  [https://www.federalpay.org/paycheck-protection-program/microvast-power-solutions-inc-stafford-tx](https://www.federalpay.org/paycheck-protection-program/microvast-power-solutions-inc-stafford-tx)\n\nThe parent claimed \\~10 employees (and there's a note about a potential reduction-in-force), and the latter claimed 4 employees according to that site.\n\n**But here's the kicker:**\n\nYanzhuan Zheng, the CFO of Microvast, Inc., apparently personally got a PPP Loan of $65,325 and claimed \\~10 employees and a pharmaceutical business.\n\n[https://www.federalpay.org/paycheck-protection-program/yanzhuan-zheng-houston-tx](https://www.federalpay.org/paycheck-protection-program/yanzhuan-zheng-houston-tx)\n\nWhy is the CFO getting a PPP loan in his own name and for not very much money?  Apparently he has time to operate some kind of side of business or used his knowledge of PPP Loans from Microvast to go get one himself?  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/nkegg7ua5kd61.jpg?width=929&amp;format=pjpg&amp;auto=webp&amp;s=b00f7d15fe927d1fad3030a1e98417e009744861\n\n&amp;#x200B;\n\nThe address Microvast's  CFO used for his personal PPP Loan application is also used by a different PPP Loan recipient called Loesch Laboratory Consultants Inc, which got a $9,790 loan and claimed 1 employee:\n\n[https://www.federalpay.org/paycheck-protection-program/loesch-laboratory-consultants-inc-houston-tx](https://www.federalpay.org/paycheck-protection-program/loesch-laboratory-consultants-inc-houston-tx)\n\nAccording to a taxable entities search in TX, Yanzhuan Zheng is the registered agent for Loesch Laboratories.  Not clear if he owns that entity. But, if Loesch is the actual business, then why get a puny &lt;$10k in the name of the business for 1 employee and a \\~$65k loan in his own name for 10 employees?  There's probably something else going on here. \n\n&amp;#x200B;\n\nAnd the address is also used by other businesses, like these two:\n\n[http://www.bio-medicalmanufacturing.com/contact-us/](http://www.bio-medicalmanufacturing.com/contact-us/)\n\n[http://www.prosmileusa.com/contact-us/](http://www.prosmileusa.com/contact-us/)\n\nBy the way, neither of Bio-medial or pro-smile USA shows up on a taxable entities search in Texas. The address looks like a middle of nowhere factory, and next door is something called Power Systems Manufacturing, apparently based in a vacant lot.\n\n&amp;#x200B;\n\nI haven't exhaustively searched how many businesses use that address or have sought PPP Loans and how Yanzhuan Zheng is connected to them. But this continues a theme of at least potential fraud and weird personal financial dealings on the side that has come up in Microvast DD.\n\nI searched the CEO's name, Yang Wu, and there's also a PPP Loan here for $6,400 to \"Cing Mei Ning Yang Wu\" for a Hair Salon (looks like two separate names combined) in Honolulu, HI:\n\n[https://www.federalpay.org/paycheck-protection-program/cindy-mei-ning-yang-wu-honolulu-hi](https://www.federalpay.org/paycheck-protection-program/cindy-mei-ning-yang-wu-honolulu-hi)\n\nCould be a different guy. But Yang Wu, Microvast CEO, does live in Honolulu, HI. And there are a large number of other small dollar hair salons loans that come up in google search of that.  Coincidence? Maybe.\n\nIf I still had a lot of money invested in THCB I might be more concerned enough to keep digging. But this CFO continues to raise question marks to me. I suspect THCB may be having a hard time figuring out whether to trust him. Since we're almost to Chinese New Year, I will not be surprised if this deal gets called off in the next month.\n\n&amp;#x200B;\n\nMaybe the biggest question to me is -- if you're the CFO of a billion dollar business, why do you bother going around and get $9,000 or $65,000 loans for yourself and/or your side business?  And why do Microvast's two companies need a $82,000 or even $223,000 loan? \n\nI know this came up with Nikola and they paid back their loan. It was considered bad optics there, but that deal happened. But I would have been much more concerned with Nikola if Trevor Milton was also getting a loan in his own name claiming 10 employees (off-the-books employees? fraud? time/attention spent on a side gig with as many US employees as the main Microvast company?) and another company for &lt;$10,000 that has just 1 employee (himself?). If he's figured out that trick, are there other companies he owns/operates that also got nickel-and-dime PPP loans at other locations? \n\nThis guy just seems more and more shady. I read about that lawsuit that settled as well as other lawsuits involving Microvast, and I have come away thinking even if with great technology and a hot sector, this is a management team that gives me concerns.\n\nOf course, news broke today about Apollo's Chairman stepping down over ties to Epstein and much, much, much bigger transactions with Epstein. So, maybe I shouldn't be surprised at any level.\n\nAny way, I'm sure the THCB bulls hope I'm wrong. I wish I weren't at that a DA had come a month ago when I was loaded up. Maybe I'll miss out on most of this. But unless they announce a change of leadership, I would not be careful about investing in this business.",
        "subreddit": "SPACs",
        "title": "Microvast, THCB, further DD; PPP Loan",
        "url": "https://www.reddit.com/r/SPACs/comments/l4zwjq/microvast_thcb_further_dd_ppp_loan/",
        "created": 1611644120.0
    },
    {
        "author": "swordofthelord",
        "created_utc": 1611848103,
        "id": "l6zvww",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Vlad Tenev- CEO- 571-224-8804 vlad@robinhood.com\n\nJim Swartwout COO- 3215419434  jim.swartwout@robinhood.com\n\nJason Warnick CFO Mobile#- 2069155858 jason.warnick@robinhood.com\n\nScott Hershorin- Chief Compliance Officer 6103295474\n\nKelly Zigaitis Chief Compliance Officer securities- 3148353050\n\nDirector Business Operations Nafeesa Remtilla - 4156275528\n\nBrianna Bain Marker Operations Head - 503-806-1430\n\nJacob Schwartz- Senior manager customer support- 6502489106\n\nAlison Wu Manager Operations- 4087283773",
        "subreddit": "wallstreetbets",
        "title": "Robinhood contact information for C-level assistance",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6zvww/robinhood_contact_information_for_clevel/",
        "created": 1611876903.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1611672382,
        "id": "l5fem7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "UK/WU trading212 hotlist shows that GME and BB are the most added stocks 🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l5fem7/ukwu_trading212_hotlist_shows_that_gme_and_bb_are/",
        "created": 1611701182.0
    },
    {
        "author": "ApricotOk2968",
        "created_utc": 1612045358,
        "id": "l8xcie",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Western Union",
        "url": "https://www.reddit.com/r/StockMarket/comments/l8xcie/western_union/",
        "created": 1612074158.0
    },
    {
        "author": "ThiccEggDaddy",
        "created_utc": 1611889447,
        "id": "l7hc24",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Western Union (WU)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7hc24/western_union_wu/",
        "created": 1611918247.0
    },
    {
        "author": "stillness0072",
        "created_utc": 1611016487,
        "id": "l07xwn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "On the morning of January 17, the Vascepa clinical research kick-off meeting in Boao Lecheng Pioneer District was held at Boao Yiling Life Care Center. Liu Zhefeng, Deputy Director of Boao Lecheng International Medical Tourism Pilot Zone Administration; ...\n\nThis conference conducted in-depth discussions and exchanges on the research and practical application of Vascepa's real-world data, and jointly discussed the feasible path of Vascepa's clinical data collection and clinical research plan, and developed innovative ideas, unified and efficient actions, and worked together to accelerate the promotion of Vascepa in The domestic approval for listing also provides valuable experience for the regulatory model of innovative drugs and medical devices, allowing more domestic patients with cardiovascular and cerebrovascular diseases to use new, good, and assured drugs\n\nAt the meeting, Liu Zhefeng, deputy director of the Boao Lecheng International Medical Tourism Pilot Zone Administration, delivered a speech. He said that as the only \"medical special zone\" in the country and one of the key parks for the construction of Hainan Free Trade Port, Lecheng Pioneer Zone has always been a test field for bold experiments, bold breakthroughs, and independent reforms.\n\nThe implementation of the pilot work for the application of clinical real-world data in Boao Lecheng, Hainan, is to make full use of the advantages of the policy system and mechanism of the Lecheng Pilot Area, and is an extension of the policy of urgently needed imported licensed medicines and devices in Lecheng clinical.\n\nDeng Jianwei, Vice President of Eton Pharmaceuticals, said: \"We are pleased to see that Vascepa, a new drug that reduces cardiovascular risk, has been approved for first use. The U.S. Food and Drug Administration (FDA) approved Vascepa as a supplement to the maximum tolerance of statins In order to reduce cardiovascular risk, the introduction of this new drug is another successful practice of the licensing policy of the pilot zone. Looking forward to the future, Eton Pharmaceuticals will continue to introduce innovative drugs into the park at a faster rate, benefiting more Domestic patients.\"\n\n\"Before today's seminar, I have studied for many days and done a lot of homework.\" Yue Hongwen, director of Boao Yiling Cardiovascular and Metabolic Disease Prevention and Treatment Center, said with excitement, \"At present, Boao Yiling Cardiovascular and Metabolic Disease Prevention and Treatment The center has established a special medical team to provide guarantee for the smooth implementation of the new drug introduced, and carry out comprehensive collection of patient feedback on clinical use, data statistics, real-world data research, etc. for the optimization of clinical pathways for chronic cardiovascular diseases. I also I very much hope that this new natural medicine, based on statins, can help more patients with chronic cardiovascular diseases, reverse coronary heart disease plaques (soft plaques), reduce the risk of cardiovascular malignant events, and unlock the heart of China A new era in the prevention and rehabilitation of chronic vascular diseases.\"\n\nThe introduction of Vascepa into Lecheng as the drug with the greatest tolerance to statins to reduce the cardiovascular risk of high-risk patients means that Chinese patients will simultaneously share this cutting-edge therapy with patients around the world. Professor Wu Yongjian from Fuwai Hospital of the Chinese Academy of Medical Sciences said that the advent of Vascepa further addresses the urgent need for excellent clinical efficacy in the field of cardiovascular therapy, and can effectively reduce the residual risk of a variety of major cardiovascular adverse events, in order to benefit more Chinese patients.",
        "subreddit": "stocks",
        "title": "$AMRN cardiovascular drug Vascepa will enter China for first time!",
        "url": "https://www.reddit.com/r/stocks/comments/l07xwn/amrn_cardiovascular_drug_vascepa_will_enter_china/",
        "created": 1611045287.0
    },
    {
        "author": "Jay_Ell_",
        "created_utc": 1611860565,
        "id": "l75er7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Alexa, play C.R.E.A.M by Wu-Tang Clan. 😤",
        "url": "https://www.youtube.com/watch?v=PBwAxmrE194",
        "created": 1611889365.0
    },
    {
        "author": "napkins33e",
        "created_utc": 1609941085,
        "id": "kro8d0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Crayon Mania Weekly Addition!!!!!!!!!! GME, TSLA, AMD, CRM, GT, NIO, and PLTR or 4 thos wu kant red or write gud (3rd grade reading level and below)",
        "url": "/r/wallstreetbets/comments/kro81j/crayon_mania_weekly_addition_gme_tsla_amd_crm_gt/",
        "created": 1609969885.0
    },
    {
        "author": "riseofthenothing",
        "created_utc": 1611961554,
        "id": "l876nq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Official “Wu-tang financial” trust fund baby invests based on principle. Says “Diversify your bonds, but HOLD, Gods and Earths on this one, HOLD!”",
        "url": "https://i.redd.it/fm19e9csrce61.jpg",
        "created": 1611990354.0
    }
]