[
    {
        "author": "apooroldinvestor",
        "created_utc": 1621190093,
        "id": "nduoba",
        "num_comments": 419,
        "num_crossposts": 0,
        "selftext": "I don't get it.  What would be the incentive of investing in a company like IBM?  The stock price has been depreciating since 2013.\n\nI realize they have a nice 4.5% dividend, but does that make up for losing your principle investment?\n\nWhat am I failing to see?",
        "subreddit": "stocks",
        "title": "Why would anyone invest in IBM? Losing money since 2013?",
        "url": "https://www.reddit.com/r/stocks/comments/nduoba/why_would_anyone_invest_in_ibm_losing_money_since/",
        "created": 1621218893.0
    },
    {
        "author": "Karnes",
        "created_utc": 1621738644,
        "id": "niyift",
        "num_comments": 349,
        "num_crossposts": 0,
        "selftext": "Total cash, cash equivalents and marketable securities of the company as per the latest quarter (in billions of dollars).\n\n15. Cigna (NYSE:CI) - 10.1 B\n\n14. Cisco (NASDAQ:CSCO) - 11.8 B\n\n13. Costco (NASDAQ:COST) - 13.6 B\n\n12. IBM (NYSE:IBM) - 14.3 B\n\n11. JPMorgan Chase (NYSE:JPM) - 24.9 B\n\n10. GM (NYSE:GM) - 29 B\n\n9. Oracle (NYSE:ORCL) - 43 B\n\n8. Berkshire Hathaway (NYSE:BRK.A) - 48 B\n\n7. Ford Motors (NYSE:F) - 50 B\n\n6. Facebook (NYSE:FB) - 62 B \n\n5. Alibaba (NYSE:BABA) - 70 B\n\n4. Amazon (NASDAQ:AMZN) - 84.4 B\n\n3. Microsoft (NASDAQ:MSFT) - 132 B\n\n2. Alphabet (NASDAQ:GOOG) - 136.7 B\n\n1. Apple (NASDAQ:AAPL) - 195.6 B\n\nSource:  https://finance.yahoo.com/news/15-companies-most-cash-reserves-182708211.html",
        "subreddit": "stocks",
        "title": "15 Companies With The Most Cash Reserves (Traded in the US)",
        "url": "https://www.reddit.com/r/stocks/comments/niyift/15_companies_with_the_most_cash_reserves_traded/",
        "created": 1621767444.0
    },
    {
        "author": "prettyboyv",
        "created_utc": 1620743617,
        "id": "n9ydod",
        "num_comments": 325,
        "num_crossposts": 0,
        "selftext": " \n\nFirst of all let's take a look at PLTR's Q1 financial performance.\n\n* Total revenue grew 49% year-over-year to $341 million\n* US commercial revenue grew 72% year-over-year\n* US government revenue grew 83% year-over-year\n* Cash flow from operations of $117 million, up $404 million year-over-year, and representing a 34% margin\n* Adjusted free cash flow of $151 million, up $441 million year-over-year, and representing a 44% margin\n* GAAP net loss per share, diluted of $(0.07)\n* Adjusted earnings per share, diluted of $0.04\n* Cash and cash equivalents- 2.3 billion\n* The company managed to pay almost all of its outstanding long-term debt\n\nThese numbers look amazing,especially when you take into account the fact that as the management stated numerous times on the earnings call, the company is just starting to expand and acquire new customers. Many people think of Palantir as this old, mature company that is still unprofitable and with limited growth opportunities. The thing is that despite being 17 years old, Palantir is just starting to get recognition on the world stage. They spent years just developing their software and investing heavily into R and D( over 2 billion dollars). Foundry was launched in 2018 and already is experiencing very high-levels of adoption despite the fact that it is a very complex and expensive software( It is way easier to grow your revenue and acquire new customers on a quarter basis when you are selling cheap and rather simple software solutions, not a complete OS for businesses) . PLTR is also just starting to build a proper sales team ( more than 50 new salespeople hired in this quarter alone) and partnering with organizations like IBM that can pinch their soft. to potential customers. The only slightly negative thing is the fact that currently their european commercial business growth is lacking behind the U.S one, but it is mostly because european economic recovery from the Covid pandemic is way slower. They still managed to close some deals and on the earnings call announcead a new client in Peugeot. Also the Covid crisis definitely helped PLTR in a way, but this does not mean that we should expect a slower growth rate in the future, but qute the opposite. For example, video game manufacturers experienced huge growth during the pandemic, because people stayed at home and had nothing better to do, but that would not be the case in the future. On the other hand, the pandemic helped companies to realise how important is for them to be able to make sense of their large databases of unfiltered information and make better-informed decisions to protect their operations from future geopolitical or macro-economic events.\n\nPalantir is also well positioned to increase their revenue significantly in the government sector, due to the fact that their Gotham software proved its worth throughout the years and they just started their AI based Appolo software.( The Biden admin will apparently invest billions in AI technologies in the coming years).\n\nI would not dive deep into other financial metrics, cuz this DD will become too large, but their margins are insane, cost of revenue grew way,way less than actual revenue, adjusted free cash flow is now positive( insane growth also, wink, wink to all analyst who use DCF) and PLTR somehow managed to expand its business operations while at the same time increasing their cash at hand and having almost non-existent debt.\n\nLet's adress some retail investors worries now. WSB and r/ PLTR are constantly complaining about the high amounts of SBC the employees receive. They of course talked about this on the earnings call and the CFO said that the SBC will normalise in the future( very common for growth companies), but they will still give SBC to employess to align their personal interest with interest of the company ( also very common, especially for soft.companies) and to have more cash for expansion and future investments. Also, they said that Alex Karp is selling shares for tax purposes and he plans to continue being one of the biggest shareholders in the future.\n\nA lot of people also complain about the fact that \"the management does not believe in the company, Karp told me to sell my shares\". The truth is that their believe is actually a bit cult-like. Management again stated that they are convinced of the fact that PLTR will become the most important software company in the future and they even literally said that they are a \" few steps away form becoming Skynet\". Furthermore, they invested in Lillium and Sarcos robotics, cuz they think that it is an incredible opportunity for an innovative startup to use Foundry from ground-zero and not waste years of its development having to deal with data silos and so on. When talking specifically about Sarcos, they said that their are vision for Foundry is to become a digital \"IronMan suit\" and Sarcos is trying to build a physical \"IronMan\" suit and they want to combine their efforts. Yes, that is right. Management thinks that their software is so good, that instead of just selling it to other companies, they can just invest in startups, give their soft for free and reap even bigger rewards in the future.\n\nAnother interesting thing we learned from the conference call is that PLTR accepts (the currency that rhymes with groin) as a form of payment. Investing in PLTR is giving you some indirect exposure to the \"forbidden word\" market.\n\nIn conclusion, I want to say that my personal opinion is that PLTR's fundamentals actually became better and as Jeff Bezos said the stock price does not always reflect the state of the company correctly. If you did not FOMO into PLTR expecting it to moon immediatly it is probably better to just wait and stick to your conviction that the company's financials will justify its generous valuation in the coming years.",
        "subreddit": "wallstreetbets",
        "title": "Palantir's (PLTR) fundamentals just became even better ( As management said: \"We are a few steps away from becoming Skynet\")",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9ydod/palantirs_pltr_fundamentals_just_became_even/",
        "created": 1620772417.0
    },
    {
        "author": "creemeeseason",
        "created_utc": 1620389408,
        "id": "n6x0fa",
        "num_comments": 255,
        "num_crossposts": 0,
        "selftext": "Thoughts on IBM and this technology? It seems like this could be a dominant technology in semiconductors in a few years.\n\nIBM (IBM) on Thursday debuted the world’s first 2-nanometer chip making technology, which could enable massive performance gains in terms of both power and battery life over the current industry-leading processors found in everything from smartphones and tablets to the massive computer servers that power the cloud.\n\n“Right now, in the most advanced production in the world is about the 7-nm node, you know on the verge of getting to 5-nm node,” Darío Gil, SVP and director of IBM Research, told Yahoo Finance.\n\n“What we're talking about here is the first time in the world that anybody has shown, externally, that there's a viable technology to enable the 2-nm node.”\n\nLink to source:\nhttps://finance.yahoo.com/news/ibm-2nm-chip-technology-161537366.html",
        "subreddit": "stocks",
        "title": "IBM has revealed a new chip technology that promises massive improvements in both power and energy efficiency.",
        "url": "https://www.reddit.com/r/stocks/comments/n6x0fa/ibm_has_revealed_a_new_chip_technology_that/",
        "created": 1620418208.0
    },
    {
        "author": "PickleEater5000",
        "created_utc": 1620955644,
        "id": "nbx1a3",
        "num_comments": 140,
        "num_crossposts": 0,
        "selftext": "by now you all should be sick to death of hearing about Palantir. shit stock, hype company, everyone knows this already. most of you barely understand what they do. some of you do understand, and root for the potential of the birth of yet another trillion dollar company, but that's not what I'm going to talk about. There is an aspect to all this that I have not yet seen discussed anywhere, and as soon as people figure it out, I suspect Palantir will see activity beyond anything anyone right now has predicted. \n\nLets start by asking a question. If you had to create a company that was perfect in every way, that was untouchable by competition and greater than any company before it, one that would make google or amazon look like AMC by comparison, what would you need to do?\n\nfirst it would need to be a monopoly. no question there right? but a monopoly of what? There are currently 2 options that fit best and are also realistically achievable. those to things are information and energy. both will always exist, they will always be in high demand, they will never go out of style, and whoever finds a way to gain absolute control over one or both will effectively become the most wealthy person ever. 100 thousand years from now when humanity has transcended existence and all material wants we will still need information and energy. Palantir is attempting to monopolize information and to better understand why this is such a big deal, lets see what it would take to monopolize energy. \n\nthe first and surprisingly easiest step, would be to create a viable source of free or almost free energy that you would then sell, probably through monthly payments, to the entire world. miniature thorium reactors, or breakthroughs in fusion technology could potentially do this. There is more to be done however...\n\n1. In order for your business to last for centuries, your device needs to be impossible to recreate by anybody except your business and those associated with it. \n2. it needs to be cheap, very cheap, and yet generate revenue regularly no matter the conditions or state of the world.\n3. It needs to be constantly improved, or somehow protected from the possibility of someone creating an even better idea and putting your company out of business. \n\nassuming all these goals are met, you would now be the owner of a business that will always generate profit, that will always exist and bring value to customers, and that exists in a market that grows as humanity grows, meaning your potential is linked to the success and proliferation of humanity.  With no possible competition, you would be the creator of the most successful company to ever exist. \n\nHow now,  could this be accomplished with information, and how far is Palantir from achieving these same goals? is their product impossible to recreate? is it cheap and consistent with revenue? Is it immune to any possibility of anyone catching up with something even better? \n\nAlmost. not quite yet, but they are surprisingly close.\n\n&amp;#x200B;\n\n1. can their product be recreated?\n\ntechnically yes, but both Gotham and Foundry are seeing adoption by some very important organizations. Gotham is already joined at the hip with the United States government, and with continued proven effectiveness and Palantir's willingness to make deals with other countries, its pretty much guaranteed that Gotham will be seeing mass adoption into other countries as well. Like a really nice disease, eventually everyone aligned with the United States will use it. \n\nFoundry's the big fish here though. The real deal and the reason Palantir is on track with their goal of becoming the biggest software company in the world. That's not me saying that, they literally make that claim in their most recent earnings report. \n\nAll businesses and people essentially have the same problem. Data is very valuable, probably one of the most inherently valuable things in existence. Don't believe me? take a look at your computer. data is just the transfer of information and a computer is simply a really big bundle of information and tricks to measure that information.  A whole bunch of transistors turn on and off and through a massive amount of clever engineering and abstraction, all that data of whether or not something's on or off, 1 or 0, gets turned into your afternoon midget porn.  this is an extreme example of how much value can be pulled from data no matter  how  unimportant or useless it may seem. 100 years ago nobody would have ever guessed that stringing a bunch of lights together and having them interact through rules determined by whether they are on or off would possibly lead to what we have today but here we are. \n\nData has value. The problem that every business has is that they have all this data, but how exactly do you extract value from that? how do you extract the most value possible? everyone has their own solutions to these problems, but there is no unification to any of it. This is where Foundry comes in.\n\nData that the Country or Business or person owns gets fed into Foundry, and everyone using it can assign specific rules to this data. This is a drastic oversimplification, but you frankly don't need to know the gritty details because they don't really matter here.  All you need to know is that  this oversimplification applies to computers as well. Computers are a massive collection of data, governed by rules where the result and potential uses are completely controlled by the person using the computer. \n\nThere are plenty of questions here, how it works exactly, how private it is, what the use cases look like, and you can do this research on your own. What's interesting here is that while this product can definitely be recreated, its much much harder then it sounds and the fact that IBM and AWS have already given up and simply partnered with Palantir rather than try and recreate this technology just goes to show just how hard it would be to make a better Foundry or Gotham.  However, assuming that everyone eventually starts using this tech, what would happen if something better came along? \n\n2. Is Palantir's product immune to new and disruptive competition? \n\nThe answer here is yes and absolutely. the REALLY neat thing about Foundry is that it essentially creates a perpetually self improving system. People input data and assign rules, but that data never disappears and those rules never change or are forgotten unless overruled by other more complex rules. this means that ANY new data added to the system is used to further improve the system.  Again if you  want more details do the research because I'm trying to talk to children here. \n\nI've been talking about data a lot but I feel I should stress the fact that your idea of what data is or can be is likely underdeveloped. did you poo today? what color was it? how soft was it?  was it chunkey or smooth?  how long were you on the toilet?  can any of this info be used to determine what you ate? how healthy you are?  what time did you poo?  do you poo in cycles or does it come randomly? can any of this information help predict when you will poo again?  maybe knowing these things can help you poo even better and more comfortably? \n\nThis is all Data.  All of it can be used, and all of it has value to be found.  everything you see, do, feel, and think is data.  The number of ways this data can be connected and utilized to better understand the world and yourself is potentially infinite.  Therefore, a company that is able to create a product that can monopolize this potential could possibly grow even larger then one based on energy.  a product that is perpetually self improving will never be outpaced by anything else ESPECUALLY if they get a head start which is exactly what Palantir has spent 17 years and billions of dollars of R&amp;D on. \n\n3. Is Palantir's product cheap and guaranteed to be profitably no matter the state of the world? \n\nI think it goes without saying that Software is the best business to be successful in. This is Unfortunately where Palantir is at their weakest currently, but as stated in their earnings report, they are hell bent on focusing on growth over everything else.  First they bag huge companies with lotsa money, then medium ones, then small businesses, and finally everyday average people.  Assuming company's continue to sign contracts, there will one day be a turning point where Palantir goes from a WSB name to a household one.  you wont even notice it happen, it will just happen. As for profitability regardless of the state of the world, Covid has already proven that Palantir's services are in very high demand. \n\n&amp;#x200B;\n\nOn top of ALL this, Palantir is exclusively aligned with United States interests. Imagine if every country in the world used Palantir to some extent, and all that added value and power was exclusively controlled by the United States. There is an even bigger discussion to be had on the current technological race between the USA and China over who will perfect AI first, and the role Palantir will play in all this. The conclusion here is that whoever does win in the end, they will essentially decide the direction the world takes and how people in that world will live. This situation is very similar to the race between the U.S and Germany over who could invent the atomic bomb. luckily for us there's a lot less hot fiery death and a lot more new world order overshadowing the old one through the always watchful eyes of artificial intelligence. Elon musk is damn right to be afraid of AI, and If I had to pick one country to take it all I would like it to be the USA. This means that investing in Palantir is almost like betting on the United states in this all for one game. Make no mistake there is a very very good chance that whether or not you care about Palantir, your life is going to be affected by them one way or another. \n\nThe moral of the story is buy the fucking dip and don't be a pussy about it. when you believe in a company enough it doesn't matter how much it dips because unless Karp and friends die in a fireball of death after boarding a small private jet to their mansions in Hawaii for a night of  drug fueled indulgences, the future will always be bright. If you're unsure about Palantir still don't worry.  They aren't going anywhere and there will be many many many more catalysts to fomo into and lose 50% of your portfolio on. \n\nPositions are 700 shares and 20 19 nov 21 calls.",
        "subreddit": "wallstreetbets",
        "title": "Palantir, how to build a theoretically perfect business, the possible incoming golden age of America, and why you shouldn't feel stupid for buying the dip.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nbx1a3/palantir_how_to_build_a_theoretically_perfect/",
        "created": 1620984444.0
    },
    {
        "author": "NineteenSixtySix",
        "created_utc": 1620040034,
        "id": "n3tdg7",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/05/03/palantir-hires-former-ibm-watson-health-exec.html\n\nPalantir has hired its first U.S. government chief medical officer, a former executive from IBM's Watson Health business, as the data analytics company doubles down on its life sciences business.\n\nWhile the company made its name in software used by government defense agencies, sales to health-related agencies in the federal government have doubled over the last year.\n\nThe company announced Monday its has hired former IBM Watson Health Deputy Chief Health Officer Bill Kassler to lead public health and life sciences teams across Palantir's domestic and global businesses.\n\nKassler said in an exclusive interview with CNBC that he would bring his expertise in clinical care and public health to the role, helping to connect the software to researchers who could benefit from it.\n\n\"Palantir is just an exciting group of young, talented engineers and data scientists and real, real intelligent, smart people,\" he said. \"But in order to deploy technology, you have to understand the theory and the logic and the practice of healthcare and public health. And I think we see a lot of technology companies that want to get into health but don't know that, make mistakes because they're not intimately familiar. And what I can bring to Palantir is my expertise as a clinician, as a public health doc, as somebody who has been working in this field for years to help with the science and the strategy and the relationships.\"\n\nInvesting in tech for the next pandemic\n\nIn his new role, Kassler said, he wants to help put Palantir's technology in the hands of researchers who can use it to make smart decisions in the next pandemic.\n\nHe highlighted three areas that he believes can be improved with the help of tech solutions like Palantir's: patching supply chain issues, dealing with localized surges of cases, and tackling racial and ethnic disparities.\n\nPalantir's Foundry platform has played a significant role in the U.S. government's response to the Covid-19 pandemic as well as private companies' handling of essential supply chains. Palantir's technology allows researchers to combine and overlay datasets in ways that can make supply chain weaknesses or outbreak hotspots more obvious, allowing them to act quickly on their findings.\n\nOn the government side, the National Institutes of Health has recently begun using Palantir's platform to combine datasets from 50 different academic groups that it funds in ways that would have been cumbersome without the software.\n\nPalantir's technology helps the groups share data in ways that protects patient identities but allows them to gain more insights by analyzing a much larger dataset than they would have access to in their individual group settings. Julie Bush, who leads Palantir's federal health care work, said the data is now being used to better understand how the Covid-19 has impacted people with different backgrounds and conditions.\n\nBush said that type of broad data-sharing was less common prior to the pandemic, but that she hopes it continues after.\n\n\"People love to hoard their data,\" she said. \"And the pandemic really forced people to come together and be willing to share information and sort of set the bureaucracy aside. And, of course subject to data use agreements and other things, what we really saw was incredible collaborations happening across the government.\"\n\nKassler said he wants to see the technology used for more everyday use cases, too. One example he gave is how the Centers for Disease Control has already used the technology to help narrow the possible sources of an outbreak linked to produce. Rather than recalling produce from a large region, Palantir can help the agency trace the supply chain and pinpoint a smaller target.\n\n\"We don't know what the next pandemic will be,\" Kassler said. \"So we have to be prepared. And in order to do that we have to have invested in the systems that are able to have that situational awareness and to be able to enable organizations to respond quickly.\"",
        "subreddit": "stocks",
        "title": "Palantir hires former IBM Watson Health exec as first US government chief medical officer",
        "url": "https://www.reddit.com/r/stocks/comments/n3tdg7/palantir_hires_former_ibm_watson_health_exec_as/",
        "created": 1620068834.0
    },
    {
        "author": "BhimDigital",
        "created_utc": 1620387925,
        "id": "n6wl37",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "When in doubt, seek experts. \n\nI went about seeing multiple videos of Buffet and Lynch on Youtube. Then I learnt about the **Circle of Competence** in one of Buffet's interview. Possibly the best piece of advice I have ever got on Investing. The interview is a bit old; during the heydays of IBM and tech was starting to rise. The interviewer asks Buffet aren't you bothered about missing out on this tech revolution going around by not investing in it. Buffet had a very unflustered response: \"I know nothing about a lot of industries and that's alright. I don't have to make money in every game!\"\n\nThe video just gave me massive peace of mind. I don't need to ever worry about the Banking and Telecom industry now!",
        "subreddit": "ValueInvesting",
        "title": "Am I missing out on this great stock that everyone is talking about but I have no idea about this industry? Ever had this feeling? This is how I removed my FOMO.",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/n6wl37/am_i_missing_out_on_this_great_stock_that/",
        "created": 1620416725.0
    },
    {
        "author": "kharkuss",
        "created_utc": 1622160687,
        "id": "nmlb2d",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "TLDR: Just loaded up on some Palantir Options with my sweet tax refund thanks to Uncle Sam &lt;3.\n\nPalantir Options are dirt cheap and there is a lot of eyes on it now. Call options with 100+ day expiry and within $1 of strike are selling for less than $2. Lots of analysts very bullish on this stock. As always do your own DD.\n\nSee you at the top boys.\n\nPosition: $40c June 17 '22\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nI will just tell you why Palantir is going to pop.\n\n1. The company itself, Palantir; one of the only 2 **unicorn** startups to emerge from the defence sector, focused on national security, alongside SpaceX.\n\nA real company that has built its product for **18 years**, &amp; **PROVEN** its products on national level (UK Vaccination), US ARMY , NAVY and soon AIRFORCE, (BP) OIL&amp;GAS Sector, Law Agency, Mining sector (rio tinto), IBM cloud, etc.\n\n2) Just last friday, there were news of Palantir's Enterprise Resource Planning system with Amazon's cloud service platform Amazon Web Services, making it available to all AWS customers. AND PROVEN to be so value-adding, BP used it and saved 50 million in working capital within 2 weeks of installation, with the potential to do more if applied across their worldwide supply chain. The ERP suite can be deployed within days for all AWS customer. This is HUGE , and DOWNPLAYED last friday because of all the market shits that have been going on.\n\n3) I would also say a lot other recent PLTR news have been downplayed, and PLTR always doesnt make a huge marketing about their announcements, like Karp has said, they believe in the long term, the value of PLTR would reveal itself.\n\n4) The insider selloff has made the company undervalued. Remember when insiders were selling their 20% shares in direct listing at $7.50? How undervalued they were before people including Cathie Wood/ArkInvest started to realise and it rose to $27 within a month? You can take advantage of the insiders' selloffs of their long term held shares, infact, i think they are done (a lot were sold initially, but no selloff for last week) and we are going to the fking moon.\n\n5) All the paperhands' shares and insiders' shares are going to diamond hands like Cathie Wood, who are going to hold for years. I see Cathie Wood buying PLTR like TSLA, dont forget Cathie Wood bought TSLA in 2018 (that's some insane gains), and she is the god among all fund managers when it comes to spotting a disruptive/growth stock, she literally does this for a living and got famed as the best investor now at the age of 65.\n\n6) Cathie Wood just keep buying PLTR with 2 ARK funds, owns over 1% of Palantir, and she's not done yet.She bought at $30, $25, every $23.You are literally getting an insurance that cathie wood would save your ass IF the stock goes under.\n\n7) It's literally inevitable for PLTR to get more contracts and increase its revenue and growth... also not forgetting the stickiness of the contracts and business, it's hard to forgo the product after u have integrated it into your business.\n\n8) In this Era of Big Data, PLTR is literally the leader in the dominating industry of the near future, which company/service is not going to use the best Data Analytics software in the future or even now?\n\n9) Proven Track Record of HUGE Growth and credibility , proven 42% revenue growth YoY, expected 45% for next quarter, AT LEAST 30% for next 5 years, words of Karp. Last Year, Karp said at least 30% for YoY and he did 42% YoY like a boss.\n\n10) Dont forget we got a $34 Price Target from Goldman Sachs after the 4Q earnings\n\n11) If investors are justifying growth stocks' value with growth, i see Palantir time and time proven overperformed growth rate as the most bullish factor. Also, its cost is going to drive down because the main costs are from employee stock options now, which will expire in the future. And the accumulation of sticky contracts, it's also easier to maintain/update software installation than installing the software initially in new companies. It also has a huge monopoly in the fast growing industry. (added point from replying a comment)\n\n12) It's ok that the some retards dont join us now, because they will eventually join us in the future, they always join after the rocket is halfway to the moon, they always do. And when that happens, we will still welcome them.",
        "subreddit": "wallstreetbets",
        "title": "Palantir Options - DIRT CHEAP",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nmlb2d/palantir_options_dirt_cheap/",
        "created": 1622189487.0
    },
    {
        "author": "iscrewedupmykeyboard",
        "created_utc": 1620373211,
        "id": "n6t2o7",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "IBM annouced that they had a breakthrough on 2nm technology. \nThey said there will be advantages to this technogy summed up as:\n\nThe potential benefits of these advanced 2 nm chips could include:\n\nQuadrupling cell phone battery life, only requiring users to charge their devices every four daysii.\nSlashing the carbon footprint of data centers, which account for one percent of global energy useiii. Changing all of their servers to 2 nm-based processors could potentially reduce that number significantly.\nDrastically speeding up a laptop's functions, ranging from quicker processing in applications, to assisting in language translation more easily, to faster internet access.\nContributing to faster object detection and reaction time in autonomous vehicles like self-driving cars.\n\nSource:\nhttps://newsroom.ibm.com/2021-05-06-IBM-Unveils-Worlds-First-2-Nanometer-Chip-Technology,-Opening-a-New-Frontier-for-Semiconductors\n\nHow big is this breakthrough for IBM?",
        "subreddit": "stocks",
        "title": "IBM breakthrough on 2nm technology",
        "url": "https://www.reddit.com/r/stocks/comments/n6t2o7/ibm_breakthrough_on_2nm_technology/",
        "created": 1620402011.0
    },
    {
        "author": "puu222",
        "created_utc": 1619875836,
        "id": "n2idnt",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I really don't get them. Is it just like a little bonus, paid out once a year to its shareholders? And can you just make easy money?\n\nLet me explain;\n\nSay i have $20k to invest.\n\nI looked at a random stock list on Finviz of those that pay dividends. One of these is MPLX.\n\nEven better, it looks like it takes place this week. According to a press release last week, it says this;\n\n*\" The board of directors of the general partner of MPLX LP (NYSE: MPLX) has declared a quarterly cash distribution of $0.6875 per common unit for the first quarter of 2021, or $2.75 on an annualized basis. The distribution will be paid on May 14, 2021, to common unitholders of record as of May 7, 2021.\"*\n\nThe dividen yield is 10% but I dunno if this is good or not. I've heard IBM is a good stock for this, but I really don't get it. \n\nSo, does this mean, that anyone who holds stock before May 7th, gets the cash payment dividend on May 14th? I know my broker automatically gives me the dividend as I've had a couple in the past, for a few dollars. \n\nAssuming this is true, if you went and bought 740 shares on Monday, this would cost you just shy of $20,000 ($26.99 per share).\n\nDoes this mean, that by the 7th that valuation would be eligible and on the 14th you'd get paid the dividend? \n\nNext, assuming that is correct, how do you work it out? It says 0.68 per common unit, so does this mean they will give you 0.68 per share, which based on the 740 puchase share example, 0.68x740 = 503.2 (so $503.20 dollars). So if you invest on the Monday, hold until the 14th, you get 500 dollars for putting that 20,000 dollars in?\n\nIs this right or am I chatting nuts? It also says this is quarterly, so you can expect something similar every 3 months, so $2000 a year just for putting the money in?\n\nAssuming this is right, what's to stop people investing in the week before, then pulling everything out when the money gets paid? Nothing I assume? \n\nAnd lastly, if all the above is correct, does anyone know some long term growth stocks that would be stable for large investment that also pay a handsome dividend?",
        "subreddit": "stocks",
        "title": "Help me understand dividends. Can I make easy money off an investment then pull it out again?",
        "url": "https://www.reddit.com/r/stocks/comments/n2idnt/help_me_understand_dividends_can_i_make_easy/",
        "created": 1619904636.0
    },
    {
        "author": "reggiebergst",
        "created_utc": 1619978776,
        "id": "n3c4dj",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Here's some charts that distribute the allocations of President Biden's $2T Infrastructure Plan or [**American Jobs Plan**](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/). Dollar value is approximate.\n\nSince r/stocks doesn't allow images to be upload, you will have to see all my sub-par looking charts [here](https://imgur.com/a/yJF6dOH). \n\nMore details on how the American Jobs Plan...\n\n* [Empowers and Protects Workers](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/23/fact-sheet-the-american-jobs-plan-empowers-and-protects-workers/)\n* [Support Women's Employment](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/21/fact-sheet-the-american-jobs-plan-will-support-womens-employment/)\n* [Supports Veterans](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/15/fact-sheet-the-american-jobs-plan-supports-veterans/)\n* [Supports Small Businesses](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/13/fact-sheet-the-american-jobs-plan-supports-small-businesses/)\n\n**Who is going to pay for this?**\n\nWe the people. Well more like we the 1%ers. And corporations. \n\nAgain, I made more [charts](https://imgur.com/a/zFFfyGJ) to visualize it a bit better. \n\nSo unless you're a high earner, this won't affect you (much). I made these charts about a week or two ago but I heard for the American Families Plan, individuals earning more than $452,700 and married couples earning more than $509,300 (meaning each partners could earn less than $400,000) could see a tax increase.\n\n&amp;#x200B;\n\n**What do you mean, \"won't affect you (much)\"?**\n\nIf there's tax increases for the rich, what will the rich do? They'll take their stock market gains before the tax increases. 2020 saw huge gains so we may see a correction in the coming months. How much of a correction you ask? I don't know but I would guess 10-15% in the broader market. More if you're into speculative high growth stocks. I say that because I know a lot of you have positions on them. Careful how you invest these next few months.\n\nAnd if there's tax increases for corporations, obviously they'll do whatever they can to avoid them. However even a 1% increase in their taxes (note below I mention that many corporations pay very little taxes because of loopholes) will affect their bottom line. This means earnings will be less and therefore lower stock valuations.\n\n**So if the rich sell and corporations are being taxed more, how will that affect the stock market?**\n\n1. Less incentive to invest due to more taxes. People will look to other investments or stay cash. (Seriously though, the tax plan won't make a huge difference unless you're a 1%er.)\n2. Bonds become more [favorable](https://investor.vanguard.com/investing/taxes/government-bonds#:~:text=Income%20from%20bonds%20issued%20by%20state%2C%20city%2C%20and%20local%20governments,where%20the%20bond%20was%20issued). Income from bonds issued by state, city, and local governments (municipal bonds, or munis) is generally free from federal taxes. You will, however, have to report this income when filing your taxes. Examples: MUB, HYD, VOHIX, VWAHX.\n3. ETFs and Mutual funds are more favorable. They both are taxed at the long-term capital gains rate of 0%, 15%, and 20% depending on your earnings. ETFs, however, have an advantage over mutual funds due to three reasons: 1) 2018, 89% of ETFs were passive vs. 4% of mutual funds. Less trading involved with passive. 2) Any high dividend or high interest paying securities will receive more distributions, therefore a high tax bill. 3) ETFs have greater liquidity as they are traded during market hours vs. mutual funds are traded at the beginning and end of market sessions.\n\n\\*In 2018, Goldman Sachs did a study that showed 100% of their ETFs did not pay capital gains. Broadly, 90% of ETFs did not pay capital gains compared to 39% of mutual funds.\n\n4. Tax advantaged accounts like Roth IRA and 401K are more favorable. If you're one of the super rich, take a look at the [backdoor Roth IRA](https://www.investopedia.com/terms/b/backdoor-roth-ira.asp). It's a way for super rich people to put money into retirement without the contribution limits. Roth IRA contribution limit is $6,000 per year. BUT if you make more than $140,000 as a single or $206,000 filing jointly as married then you cannot contribute to a Roth IRA. The easiest way to get by this is converting a traditional IRA account to a Roth IRA account.\n\n&amp;#x200B;\n\nWhat does history [say](https://www.fidelity.com/learning-center/trading-investing/tax-hikes-history#:~:text=In%20the%2013%20previous%20instances,the%20data%20in%20the%20calendar) about stock market performance after tax increases?\n\n\"In the 13 previous instances of tax increases just since 1950, the S&amp;P 500, the stock index that tracks most of the major companies in the US, has shown higher average returns, and higher odds of an advance, in times when taxes are increasing, according to Chisholm's research, which analyzed the data in the calendar year of the tax changes, plus the year prior and year after. This pattern holds true even when you drill down into key sectors of the S&amp;P 500.\" Here's a [chart](https://i.imgur.com/2MaBjOp.png) of the S&amp;P500 performance after tax increases. Not too bad eh?\n\n&amp;#x200B;\n\n**What's happening now with the current tax law?**\n\n* 91 Fortune 500 companies paid $0 in federal corporate taxes. Amazon, Chevron, Halliburton, and IBM are some of those companies. Corporate tax rate is currently 21%.\n* 56 Fortune 500 companies paid 0-5% on their 2018 income.\n* 2017 tax bill cut the average rate that corporations paid in half from 16 percent to less than 8 percent in 2018. I couldn't find any data on this but its due to loopholes in the tax system.\n\n**The Made in America Tax plan**\n\n* Will raise over $2 trillion over the next 15 years and more than pay for the mostly one-time investments in the American Jobs Plan and then reduce deficits on a permanent basis.\n* Increase corporate tax rate at 28% from 21%\n* Right now, the tax code rewards U.S. multinational corporations that shift profits and jobs overseas with a tax exemption for the first ten percent return on foreign assets, and the rest is taxed at half the domestic tax rate.\n* The proposal will increase the minimum tax on U.S. corporations to 21 percent and calculate it on a country-by-country basis so it hits profits in tax havens. It will also eliminate the rule that allows U.S. companies to pay zero taxes on the first 10 percent of return when they locate investments in foreign countries.\n* The United States is now seeking a global agreement on a strong minimum tax through multilateral negotiations.\n* Invert the current law in which U.S. corporations can acquire or merge with a foreign company to avoid U.S. taxes by claiming to be a foreign company, even though their place of management and operations are in the United States.\n* A proposal that companies can no longer write off expenses that come from offshoring jobs. Instead a tax credit will be proposed to support onshoring jobs.\n* Invert a Trump tax law for “Foreign Derived Intangible Income” (FDII), which gave corporations a tax break for shifting assets abroad and is ineffective at encouraging corporations to invest in R&amp;D. Instead the revenue will be used to expand more effective R&amp;D investment incentives.\n* Enact a minimum tax of 15% on large corporations’ book income.\n* Eliminate tax preferences (worth billions of dollars) for fossil fuels and make sure polluting industries pay for environmental clean up.\n* Increase enforcement for tax evasion. Typical workers’ wages are reported to the IRS and their employer withholds, so they pay all the taxes they owe. By contrast, large corporations have at their disposal loopholes they exploit to avoid or evade tax liabilities, and an army of high-paid tax advisors and accountants who help them get away with this. At the same time, an under-funded IRS lacks the capacity to scrutinize these suspect tax maneuvers: A decade ago, essentially all large corporations were audited annually by the IRS; today, audit rates are less than 50 percent.\n\n&amp;#x200B;\n\n**So what should I do to prepare if this bill passes?**\n\nNothing different honestly. Keep investing. DCA - dollar cost average if your stocks drop. Stay the course in your high conviction names. De-risk if you have to by investing in safer investments like index funds or ETFs. I know a lot of you are into SPAX (special purpose acquisition companies. I spelled it this way in case this sub banned the real acronym) and other speculative companies. There's almost 500 of them out there. 217 of those were from 2020. To be honest, 1% of those companies will moon. Most of them won't see a return for years. Are you willing to hold them without knowing they will moon in 5-10 years? Some may not even make a return. Make sure you understand market conditions. Stocks really do go up but its only the ones that are backed by strong earnings and potential. Don't get burned. Money is not everything but it's a tool to bring you financial freedom sooner in life. You know what they say, \"there's only two things guaranteed in life: death and taxes\".",
        "subreddit": "stocks",
        "title": "The American Jobs Plan, How it Will be Paid, and What it Means for the Stock Market",
        "url": "https://www.reddit.com/r/stocks/comments/n3c4dj/the_american_jobs_plan_how_it_will_be_paid_and/",
        "created": 1620007576.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1620333190,
        "id": "n6gx5p",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, May 6, 2021**\n\nRemarkably, despite many individual companies pulling back steeply today, the three major indexes finished the day positive, driven by gains in financial stocks and stability in mega-caps. Growth stocks and more speculative plays have been hit hard by a combination of inflationary fears and recent suggestions by monetary officials that the interest rate should be raised. The S&amp;P 500 (SPY) closed the day 0.81%, less than 1% below it’s record high. The Dow Jones (DIA) recorded a new intraday record while the Nasdaq (QQQ) closed 0.76%. Market participants continue to monitor commentary from monetary officials, ongoing earnings season, and new economic data, particularly the April Jobs Report set for release tomorrow morning.\n\nAfter reclaiming the leadership in April as the best performing sector in the SPY, so far in May we have seen investors rotate out of big tech stocks and into financial stocks, with many big banks pushing all-time highs today. Market participants are worried that a suggested raise in interest would affect the already stretched valuation of some companies. Given the rally the market saw in April, some analysts are worried that positive catalysts for equities are getting harder to achieve and may be running out. The economy in the US is recovering faster than initially predicted by analysts, with this earnings season seeing 86% of companies in the S&amp;P 500 that have reported earnings  beat estimates, according to data from FactSet. \n\nTreasury Secretary Janet Yellen suggested that interest rates may need to rise in the near-term to prevent the economy from overheating, with the recent economic data and corporate earnings showing economic activity recovering much faster than expected as effective distribution of the vaccine in the US allows states to gradually reopen. Yellen said, “It may be that interest rates will have to rise somewhat to make sure that our economy doesn't overheat, even though the additional spending is relatively small relative to the size of the economy. It could cause some very modest increases in interest rates to get that reallocation, but these are investments our economy needs to be competitive and to be productive. I think our economy will grow faster because of them.\" In later remarks, she added that raising rates was not something she was predicting or recommending and that the decision ultimately rests with the Federal Reserve. She said, “Let me be clear, that’s not something I’m predicting or recommending. If anybody appreciates the independence of the Fed, I think that person is me.”\n\nThe Labor Department will release its April jobs report on Friday, which is expected to show a staggering nearly 1 million payrolls came back last month, accelerating March’s gain. As a reminder, in March, the Department of Labor reported nonfarm payrolls increased by 916,000 for the month while the unemployment rate fell to 6% (unemployment rate was 14.6% in April 2020). Economists surveyed by Dow Jones had been looking for an increase of 675,000 and an unemployment rate of 6%.\n\n**Highlights**\n\n* Weekly unemployment claims fell to 498,000 last week—a new low since the Covid-19 pandemic began more than a year ago. The four-week average of initial claims is also at the lowest point since the pandemic began. Read more [here](https://www.wsj.com/articles/weekly-jobless-claims-coronavirus-05-06-2021-11620247798).\n* The Bank of England upped their growth estimates for the economy of the UK, anticipating GDP will grow 7.25% in the country, up from its forecast for 5% growth in February. The BOE also now sees inflation averaging 2.5% in 2021, up from its prior forecast for 2%, but said the rise in price pressures will likely be \"temporary.\" \n* NIO announced the company will expand into Norway, with the group’s first service and delivery center set to open in the capital Oslo in September.\n* A lot of stocks pulled back despite posting better than expected earnings. The market is very narrow right now, with gains concentrated in the financials, energy, and mega-caps.\n* IBM introduced what it says is the world's first 2-nanometer chip making technology. The technology could be as much as 45% faster than the mainstream 7-nanometer chips in many of today's laptops and phones and up to 75% more power efficient, the company said. Read more[ here. ](https://www.reuters.com/technology/ibm-unveils-2-nanometer-chip-technology-faster-computing-2021-05-06/)\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes.\\*\\***\n* Agio Pharmaceuticals (AGIO) target raised by Canaccord Genuity from $57 to $65 at Buy. Stock currently around $53\n* Allegro MicroSystems (ALGM) target raised by Mizuho from $35 to $38 at Buy. Stock currently around  $25.\n* Amazon (AMZN) with a host of target raises. Consensus price target $4150 at Buy. Stock currently around $3270\n* Booking (BKNG) with two target raises. Stock currently around $2338\n   * Deutsche Bank from $2600 to $2665 at Buy\n   * Barclays from $2710 to $2740 at Buy\n* Burlington Stores (BURL) target raised by Morgan Stanley (MS) from $317 to $385 at Overweight. Stock currently around $327\n* CareDX (CDNA) target raised by Piper Sandler from $93 to $100 at Overweight. Stock currently around $73\n* Comcast (CMCSA) with two target raises. Stock currently around $56\n   * Goldman Sachs from $62 to $64 at Buy\n   * Raymond James from $61 to $63 at Outperform\n* Caesars Entertainment (CZR) target raised by KeyCorp from $110 to $125 at Overweight. Stock currently around $102\n* Dell Technologies (DELL) target raised by Morgan Stanley from $120 to $127 at Overweight. Stock currently around $103\n* DexCom (DXCM) with three target raises. Stock currently around $366\n   * Raymond James from $449 to $466 \n   * Canaccord Genuity from $445 to $455\n   * Citigroup from $480 to $488\n* Equitable (EQH) target raised by Morgan Stanley from $44 to $45 at Overweight. Stock currently around $35\n* Floor &amp; Decor (FND) target raised by Wedbush from $110 to $130 at Outperform. Stock currently around $113\n* Gilead Sciences (GILD) target raised by SVB Leerink from $72 to $74 at Outperform. Stock currently around $66.5\n* General Motors (GM) with three target raises. Stock currently around $57.5\n   * Barclays from $64 to $66 \n   * Royal Bank of Canada from $67 to $72 \n   * Deutsche Bank from $67 to $70 \n* HubSpot (HUBS) with four target raises. Stock currently around $503\n   * Needham &amp; Co from $520 to $600 \n   * Piper Sandler from $600 to $615\n   * Morgan Stanley from $567 to $605\n   * BMO Capital Markets from $565 to $585\n* InMode (INMD) with two target raises. Stock currently around $81\n   * Canaccord Genuity from $80 to $95 at Buy\n   * Robert W Baird from $84 to $104 at Outperform\n* JP Morgan (JPM) target raised by Wells Fargo from $190 to $195 at Overweight. Stock currently around $157\n* Mastercard (MA) with two target raises. Stock currently around $369\n   * Mizuho from $430 to $435 at Buy\n   * Jefferies from $440 to $450 at Buy\n* McDonald's (MCD) with a host of target raises. Consensus price target $260 at Outperform. Stock currently around $235\n* NuVasive (NUVA) with two target raises. Stock currently around $70\n   * Piper Sandler from $75 to $80 at Overweight\n   * Needham &amp; Co from $70 to $80 at Buy\n* OSI Systems (OSIS) with two target raises. Stock currently around $95\n   * B. Riley from $104 to $118 at Buy\n   * Roth Capital from $108 to $122 at Buy\n* Paypal (PYPL) with a host of target raises. Consensus price target at $320 at Overweight. Stock currently around $247\n* UBER target raised by Deutsche Bank from $82 to $85 at Buy. Stock currently around $48. Gig-economy stock has been hammered by recent talks from the Secretary of Labor in the US\n\n“Patience is not simply the ability to wait – it’s how we behave while we’re waiting.” – Joyce Meyer",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, May 6, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/n6gx5p/here_is_a_market_recap_for_today_thursday_may_6/",
        "created": 1620361990.0
    },
    {
        "author": "bernie638",
        "created_utc": 1621369544,
        "id": "nfl8th",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Notes from Toyota Motors (TM) 2020 full year Earnings Call (13 May 2021)\n\nWhy do you care? Good question, automobile manufactures have gotten higher multiples (at least for a short time) based on producing, or moving closer to producing Battery Electric Vehicles (BEVs), and sometimes just by pretending they will change their name to emphasize Electrical terminology, and of course having a company named after the people who discovered how to make electricity work gets really high multiples (doesn’t work for utilities named after Edison though). Toyota has been reluctant to move into the BEV space, did this change? Will they rename themselves after Alessandro Volta? Let’s find out.\n\nFirst, I really want to thank the modern world that can take spoken Japanese from multiple speakers and convert that into written English so cheaply that I can read it on the internet without a paid subscription to anything! It’s a wonderful time to be alive!\n\nOh, I guess it's fashionable to add a disclaimer so the black helicopters don’t come and lock me in a bank vault without my reading glasses or something right? Fine, I make my living breaking big atoms into little atoms so nothing I say or type should ever be considered medical, financial, legal, or romantic advice. Good enough? Let’s go.\n\nI can’t find an old blog post I read in the 2009–2011-time frame to give credit, but it was pretty insightful, the blog author did a word search for “customer” in both the Amazon and IBM earnings call, and showed how Amazon (huge number of times saying “*customer*”) would be a better investment because that’s where their focus was compared to IBM which had very few hits for “customer”.  I haven’t checked, but I think Amazon has had slightly better returns than IBM from 2009-present.\n\nCTRL-F for “*customer*” returns **53 hits** for TM, things like:\n\n&gt;“And Toyota is always listening to customers, always trying to develop products that are suitable for every part of the world. And we have to remember that the goal is not electric vehicles. The goal is carbon neutrality. And even if we have the best technology, if it's not chosen by customers, it will not have the impact of reducing emissions and that's the reason why we've chosen to have a full lineup, and we've invested in all of these technologies.”\n\nCompare that to **their competitor**, the largest automobile manufacturer (**by market cap**) most recent earnings call shows just **10 hits** for “*customer*” with things like:\n\n&gt;“we had not yet begun customer deliveries”  \n&gt;  \n&gt;“what we obviously opt to do is to refund customers their deposit”  \n&gt;  \n&gt;“continue to accumulate bitcoin from transactions from our customers as they purchase vehicles”\n\nQuite a difference in company philosophy!\n\nStarting off with the prepared statement, this company is a beast! Their fiscal year begins and ends in March so this is for the entire Covid year without the benefit of the Jan-March 2020 pre-Covid or the reopening time after vaccinations ramped up, this is the worst possible time period and the sold 9.087 Million vehicles (96% of 2019 numbers) under the Toyota/Lexus name and an additional 7.646 Million consolidated vehicles (85.4% of 2019 numbers).\n\nQuick note, they use the term “electrified vehicles” to include Hybrid (HEV), Plug in hybrid (PHEV) and battery electric (BEV) and Hydrogen Fuel Cell electric (FCEV). The sales of electrified vehicles were 112.3% of 2019, which I think were mostly HEVs.\n\nThey went through all the various gains and losses to operating income (currency exchange rates, marketing, cost reductions) and overall operating income went UP by 10 Billion (JPY not USD). Then announced the dividend at a payout ratio of 29.8%. Announced a resumption of share buybacks (had been suspended during the pandemic) of up to 250 BILLION (JPY). Also, a five for one stock split will happen on September 30 2021.\n\nNext the future projections, consolidated 113% of 2020, Toyota/Lexus 105.6% of 2020, and expected 2.8 Million electrified cars 129% of 2020 (29.2% of vehicles sold will be electrified). Again, a breakdown of predicted expenses with an overall prediction an operating income increase 365 Billion (with a B, in JPY)!!\n\nNext, they took questions. First question wanted more detail on predicted finances which they answered, then a very detailed discussion of the plan:\n\n&gt;“By 2050, we are to realize carbon-neutral. That is our target. The new vehicle CO2 is not the point. Transport use -- this overall cycle of CO2 use will have to be made neutral. That will be the point. So at this point, rather than restricting or limiting the types of technologies to be used, in order to realize carbon neutrality, various options or various technologies will have to be addressed. We think that will be the most important point and that is where Toyota is putting its entire efforts in. More specifically, we at Toyota has HEV, PHEV, battery EVs or BEVs or FCEVs”\n\nFrom later in the call, but I wanted to move it here since it explains how they define the term:\n\n&gt;“What does carbon neutrality actually mean for the automotive industry? Carbon neutrality for the automotive industry means achieving zero CO2 emissions in all processes throughout the lifecycle of manufacturing, transporting, operating, fueling and/or charging, and recycling and disposing of vehicles.”\n\nThen they discuss very specific breakdown of anticipated sales of electrified vehicles by region by 2030 and:\n\n&gt;“And globally, this will add up to 8 million electrified vehicles, including hybrids, out of which battery EVs and FCEVs in total would account for about 2 million units. That is our plan. Of course, ultimately, the choice is up to the customer. But at this moment, this is what we are forecasting.”\n\nFollowed by a detailed discussion about the scope of the challenge for future battery production and:\n\n&gt;“at the moment, Toyota's supplied power is 6 gigawatts hours. And in order to realize these numbers, 180 gigawatt hours is necessary; in other words, 30 times the current number. So if you translate that into EV production lines, currently, we have two lines, but that will have to be more than 60 lines, that is more than 30 times. So we will make aggressive investments so that we can realize that. And in addition to that, for battery development or basic units will be reduced, and we will work with alliance partners for procurement so that we can procure the necessary goods. And in addition to that, for battery EV development, compared to the current situation, 15% to 30% reduction in development lead time is to be aimed at. “\n\nAnd\n\n&gt;“So for the investments, electrification case, digitalization, roughly speaking, on an annual basis, we are currently making an investment of JPY 1 trillion. This year, compared to the past levels, we intend to increase investment by 20%”\n\nDid you notice that number, Trillion! I ran out of fingers and toes to count how many zeros that was.\n\nNext the BIG question: “**how do you see the supply demand forecast for semiconductors**?”\n\nWell:\n\n&gt;“The supply demand situation still can fluctuate and we cannot sit back and relax yet, but we are not forecasting a major impact by semiconductors”\n\nCompare that to **their competitor**, the largest automobile manufacturer (**by market cap**) most recent earnings call:\n\n&gt;“yes. This quarter, and I think we'll continue to see that a little bit in Q2 and Q3. So Q1 was -- had some of the most difficult supply chain challenges that we've ever experienced in the life of Tesla and same difficulties with supply chain, with parts -- over the whole range of parts. Obviously, people have heard about the chip shortage.  \n&gt;  \n&gt;This is a huge problem.”\n\nAm I just cherry picking, trying to sensationalize something for clicks? Well, here is **what Ford had to say** in their earnings call:\n\n&gt;“The semiconductor shortage and the impact to production will get worse before it gets better. In fact, we believe our second quarter will be the trough for this year. We have worked to do to get our industry footprint back to firing on all cylinders or maybe should I say fully charged. Overall, though, I'm proud of the progress we made as a team, as our underlying strength at Ford improves”\n\nThen another important question “you also showed the outlook for carbon neutral for 2030, and you talked about 6 million, and your plan was to increase carbon-neutral vehicles and PHEV. And could you share with us the reason why you believe customers will be choosing those vehicles?”\n\nRemember the customer! Here’s part of their answer:\n\n&gt;“And for 2030, for one thing, as Mr. Kamisawa mentioned in his own question, the battery EV, its prices and availability of infrastructure on the global situation is not likely to progress significantly. That's one assessment. And with respect to hybrid EV and plug-in hybrid EV, those are easier for customers to choose and use.  \n&gt;  \n&gt;But I would like to add further to that question about the Japanese data. We are focused on connectivity or connected. And through connected network, we obtain information and data on vehicles. And even in the case of hybrid EVs or plug-in hybrid EVs, especially in urban areas, the distance traveled by electric mode is quite long. And probably, we can share with you later on, but in the urban areas, generally speaking, there is some difference between urban area and suburban areas, but in urban areas, even in the case of hybrid electric vehicles, about 50% of the times, it is running on the electric mode.  \n&gt;  \n&gt;And in the case of PHEV, of course, there are differences in conditions, but 70% or 80% of the times, it is driven on pure electric mode. So hybrid EVs or plug in hybrid EVs, not just their performance and also the data that we can obtain through connectivity, and also, we use information we obtain from navigations. And using that, depending upon where the vehicle is located, the EV mode ratio can be increased or decreased, so adjusted. And those can be doable in the future through hybrid vehicles as well as plug-in EVs. So we would like to make contribution to the environment in a sustainable manner as well as practical manner.”\n\nSo the first hour of the two hour call was intended to be focused on the financials and the second half on the future (more long term plans) for electrification, batteries, data and Woven City. The questioners wanted to focus on all that stuff right away, so they answered the questions.",
        "subreddit": "investing",
        "title": "Notes from Toyota Motors (TM) 2020 full year Earnings Call (13 May 2021)",
        "url": "https://www.reddit.com/r/investing/comments/nfl8th/notes_from_toyota_motors_tm_2020_full_year/",
        "created": 1621398344.0
    },
    {
        "author": "economicsdesign",
        "created_utc": 1622299873,
        "id": "nnp1q2",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": " \n\nIn the past time, we have witnessed tremendous growth from Dogecoin. Especially this growth comes from [Elon Musk](https://twitter.com/elonmusk/status/1391523807148527620) when he constantly \"memes\" about this coin. It is clear that even though Dogecoin is **only created just for fun**, this coin has reached a market cap of over US$60 million a few days ago.\n\nIn today's article, let's dive into Dogecoin based on the analysis of the economic mechanism we often use. Spoiler alert: this might not be the coin you want to put your money in. At least we do not.\n\nNote: This article is not meant to be offensive, we respect the development of any coin in the space. Let's go!\n\n# What Is Dogecoin?\n\n* A meme coin\n* A crypto currency\n* Built using the Bitcoin infrastructure, but not related to Bitcoin prices\n\nDogecoin ($DOGE) is an open-source p2p cryptocurrency. It can easily be sent through the internet from person to person with security. You can send Dogecoin anywhere in a second, faster and cheaper than Bitcoin.\n\nOne of the important points for Dogecoin is that it is already accepted at online retailers. Dogecoin can be used in payment, buy items at gamestop, trade and so much more.\n\n## $DOGE In Real Life\n\n&gt;What is make Dogecoin truly unique from other currencies?\n\nDogecoin's ease of use makes it the perfect way to instantly send cash gifts to people all around the world.\n\nYou can send 10 cents to your favourite comment on Twitter or $10 to your favourite band to purchase their latest album, you can even send $100 to a charity that you support.\n\n \n\nIf you are a creator your fans can financially empower you for the first time. You can directly receive cash from them, rather than a valueless \"like\" on Facebook or \"retweet\" on Twitter. This allows you to focus on creating content instead of thinking about counting cents.\n\n# How Did $DOGE Start?\n\nDogecoin was created on December 6, 2013, by a pair of software engineers **as a joke.**\n\nBilly Markus, an IBM programmer from Portland, Oregon, created his cryptocurrency from bitcoin source and at the time attracted a small pool of miners.\n\nSince Markus wanted his cryptocurrency to be public, he sought help from Jackson Palmer, who works for Adobe (ADBE). Palmer purchased the domain [dogecoin.com](http://dogecoin.com/) \\- a formation for the \"doge\" meme that was popular on the internet at the time.\n\nThe site originated as a joke: the image of the Shiba Inu dog representing $DOGE was the first image, and was surrounded by a series of broken English Comic Sans text.\n\nOn [dogecoin.com](http://dogecoin.com/), its mascot is captioned:\n\n&gt;\"Dogecoin is an open-source peer-to-peer digital currency, favoured by Shiba Inus worldwide.\"\n\n# The Economics of $DOGE\n\nThe same with other cryptocurrencies, $DOGE is a digital currency that can be bought and sold like an investment and spent like money.\n\nWhile each cryptocurrency is unique, they share some similarities with its more well-known peers, since they are all forks of Bitcoin — Bitcoin Cash. But they have a few key differences.\n\nUnlike bitcoin, which has only 21 million Bitcoins that can be mined, dogecoin has 129 billion coins in circulation and will continue to make new blocks of coins available for mining each year. That's part of the reason why a dogecoin is currently valued at around $0.45 and a bitcoin is valued at around $40,000.\n\n## Market Design\n\nWhile cryptocurrency is gaining more acceptance as a currency for buying goods, dogecoin is not being used much in the real world. It has several niche markets, including using dogecoin to make money for online artists.\n\nAnd the main difference is from the active online community of dogecoin. This is what makes this coin so interesting. The group, which is active on Reddit, has donated money (in dogecoin) to charitable causes and in 2014. Or the group successfully raised a grant for drivers advertising dogecoin in their cars.\n\n&amp;#x200B;\n\n## Mechanism Design\n\n### Governance\n\n$DOGE has no administrative features. The same is true for cryptocurrencies that are forked from Bitcoin. The governance is baked directly into the code. This is because it is a simple payment use-case, unlike other DeFi protocols with more complex computation that we have been discussing thus far.\n\n### Structure\n\n$DOGE uses the same PoW algorithm as Bitcoin. Miners can own $DOGE by participating in maintaining the network as $DOGE.\n\n## Token Design\n\n### Token Policy\n\nThe design of $DOGE is not fixed in supply, meaning it can be mined forever and its value depends on demand from users.\n\nBitcoin, like many other altcoins, has a hard limit on the number of cryptocurrencies they will allow. Dogecoin does the opposite, allowing for an ever-increasing supply but in a steady absolute amount each year.\n\nFor example, in 2040, there will be no more Bitcoins that can be mined. Therefore, this will encourage hoarding of the Bitcoin supply. This will push up Bitcoin's price, but reduce Bitcoin's actual transaction volume (i.e. reduce the available floating volume).\n\nOn the other hand, by allowing 5 billion $DOGE per year to increase the supply of Dogecoins infinitely, the supply will increase, but eventually, reach the actual limit. Thus, we can calculate the inflation rate of a currency over time.\n\nGiven the amount of 5 Billion $DOGE being diverged each year, the annual inflation rate will gradually decrease.\n\nIn other words, the inflation rate improved over time, starting from 5% in 2015 to less than 4% in 2019, \\~3% in 2027 and \\~2.5% in 2035.\n\n### Financial Incentives\n\nIn this respect, $DOGE is paid to those who join the network. The money earned from mining $DOGE will be the main profit for mining.\n\n*Get premium access to unlock more content*",
        "subreddit": "investing",
        "title": "How Dogecoin is a sh*tcoin :D",
        "url": "https://www.reddit.com/r/investing/comments/nnp1q2/how_dogecoin_is_a_shtcoin_d/",
        "created": 1622328673.0
    },
    {
        "author": "themainvillian",
        "created_utc": 1622205360,
        "id": "nmwwbg",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "\n **Mods do not delete, this is important to me, please read**\n\n&amp;#x200B;\n\nI was in my early teens during the '08 crisis. I vividly remember the enormous repercussions that the reckless actions by those on Wall Street had in my personal life, and the lives of those close to me. I was fortunate - my parents were prudent and a little paranoid, and they had some food storage saved up. When that crisis hit our family, we were able to keep our little house, but we lived off of pancake mix, and powdered milk, and beans and rice for a year. Ever since then, my parents have kept a food storage, and they keep it updated and fresh.\n\nThose close to me, my friends and extended family, were not nearly as fortunate. My aunt moved in with us and paid what little rent she could to my family while she tried to find any sort of work. Do you know what tomato soup made out of school cafeteria ketchup packets taste like? My friends got to find out. Almost a year after the crisis' low, my dad had stabilized our income stream and to help out others, he was hiring my friends' dads for odd house work. One of them built a new closet in our guest room. Another one did some landscaping in our backyard. I will forever be so proud of my parents, because in a time of need, even when I have no doubt money was still tight, they had the mindfulness and compassion to help out those who absolutely needed it.\n\nTo Melvin Capital: you stand for everything that I hated during that time. You're a firm who makes money off of exploiting a company and manipulating markets and media to your advantage. Your continued existence is a sharp reminder that the ones in charge of so much hardship during the '08 crisis were not punished. And your blatant disregard for the law, made obvious months ago through your (for the Melvin lawyers out there: alleged) illegal naked short selling and more recently your obscene market manipulation after hours shows that you haven't learned a single thing since '08. And why would you? Your ilk were bailed out and rewarded for terrible and illegal financial decisions that negatively changed the lives of millions. I bought shares a few days ago. I dumped my savings into GME, paid my rent for this month with my credit card, and dumped my rent money into more GME (which for the people here at WSB, I would not recommend). And I'm holding. This is personal for me, and millions of others. You can drop the price of GME after hours $120, I'm not going anywhere. You can pay for thousands of reddit bots, I'm holding. You can get every mainstream media outlet to demonize us, I don't care. I'm making this as painful as I can for you.\n\nTo CNBC: you must realize your short term gains through promoting institutions' agenda is just that - short term. Your staple audience will soon become too old to care, and the millions of us, not just at WSB but every person affected by the '08 crash that's now paying attention to GME, are going to remember how you stuck up for the firms that ruined so many of us, and tried to tear down the little guys. I know for sure I'll remember this. In response, here is a [list of CNBC sponsors and partners](https://www.cnbcevents.com/sponsors/). They include, but are not limited to, **IBM**, **Cisco**, **TMobile**, **JPMorgan**, **Oracle**, and **ZipRecruiter**. Their parent company is [NBCUniversal](https://en.wikipedia.org/wiki/NBCUniversal), owned by **Comcast** and **GE**.\n\nTo the boomers, and/or people close to that age, just now paying attention to these \"millennial blog posts\": you realize that, even if you weren't adversely effected by the '08 crash, your children and perhaps grandchildren most likely were? *We're not enemies, we're on the same side*. Stop listening to the media that's making us out to be market destroyers, and start rooting for us, because we have a once in a lifetime opportunity to punish the sort of people who caused so much pain and stress a decade ago, and we're taking that opportunity. Your children, your grandchildren, might have suffered as I described because of the institutions that we're fighting against. You really want to choose them, over your own family and friends? We're not asking you to risk your 401k or retirement fund on a single GME bet. We're just asking you to be understanding, supportive, and to not support the people that caused so much suffering a decade ago.\n\nTo WSB: you all are amazing. I imagine that I'm not the only one that this is personal for. I've read myself so many posts on what you guys went through during the '08 crash. Whether you're here for the gains, to stick it to the man as I am, or just to be part of a potentially market changing movement - thank you. Each and every one of you are the reason that we have this chance. I've never felt this optimistic about the future before. This is life changing amounts of money for so many of you, and to be part of a rare instance of a wealth distribution from the rich to the poor is just incredible. I love you all.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNote: I can't seem to get a hold of mods and they keep fucking removing the post. I have no idea how to get this to stick and its important to me that the people I'm addressing read it.",
        "subreddit": "wallstreetbets",
        "title": "An Open Letter to Melvin Capital, CNBC, Boomers, and WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nmwwbg/an_open_letter_to_melvin_capital_cnbc_boomers_and/",
        "created": 1622234160.0
    },
    {
        "author": "Investyourvalues",
        "created_utc": 1621813885,
        "id": "njklpb",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "They take the S&amp;P 500. Take out the 200 or so companies that donated 75% or more to Democratic politicians and PACs. Then cut that list down to about 40 with an overall goal of looking and feeling like the S&amp;P from a risk perspective.   \n\nTrading at $26.12 as of Friday. \n\nFees @ 0.45. \n\nDEMZ is beating SPY since inception on 11/3/20 by 3.33% (DEMZ up 28.99% net of fees versus SPY up 25.66%)\n\nDEMZ is also up on SPY YTD (DEMZ up 13.76% net of fees; SPY is up 10.98%).\n\nIf you go to their website and click on their index page, it takes you to their S&amp;P index with back calculated data showing the DEMZ index beating the S&amp;P 500 every year for the last five years. \n\nThe top five DEMZ holdings are Avery Dennison, Progressive, IBM, Moody’s &amp; Google.\n\nThey sector weight w/in 5% of the S&amp;P 500 and no single holding can be more than 5% of the ETF. Rebalance is quarterly. \n\nTheir website says their thesis is that they “believe companies that are run by, and support, Democrats will be more profitable and sustainable in the future.”\n\nThe political data comes from Goods Unite Us (which has a dope free app showing political donation info).",
        "subreddit": "wallstreetbets",
        "title": "The new Democratic large cap fund ($DEMZ) is up 3.33% on SPY since launch on 11/3",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/njklpb/the_new_democratic_large_cap_fund_demz_is_up_333/",
        "created": 1621842685.0
    },
    {
        "author": "macrian",
        "created_utc": 1621413388,
        "id": "ng09nd",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "A few stocks recently are announcing spin offs with shareholders receiving shares of new company and such (e.g. IBM, AT&amp;T etc).   \nHow would I calculate the cost of my investment when it automatically splits into something new?  \nFor example, I paid X amount of USD for Y amount of shares. After some time, I also receive Z amount of shares. By a specific formula of let's say 70%, such that Z = 0.7 \\* Y  \nNow what about the cost? How would you guys split the total cost of the (now) two companies?",
        "subreddit": "stocks",
        "title": "How to calculate cost of a stock after spin off",
        "url": "https://www.reddit.com/r/stocks/comments/ng09nd/how_to_calculate_cost_of_a_stock_after_spin_off/",
        "created": 1621442188.0
    },
    {
        "author": "Rated-R-Superstar85",
        "created_utc": 1620908597,
        "id": "nbfdy0",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "It’s time to start buying this stock, as a massive upswing is coming. Some points worth considering:\nPalantir is one of the most exciting software companies as their products are being incorporated by government agencies, large commercial conglomerates and companies of tomorrow.\nPalantir is firing on all cylinders as its Q1 2021 revenue grew by 49% while generating $117 million in cash flow from operations.\nIn addition to the partnerships with Amazon and IBM, Palantir hired Dr. Kassler from IBM to be their Chief Medical Officer.\nARK Invest is buying shares hand over fist and Mr. Wonderful picked PLTR to be on his team in the 2021 CNBC stock draft.",
        "subreddit": "wallstreetbets",
        "title": "Pltr is the play today!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nbfdy0/pltr_is_the_play_today/",
        "created": 1620937397.0
    },
    {
        "author": "raoha",
        "created_utc": 1620027577,
        "id": "n3qj1d",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**E2Open ($ETWO)**\n\n**A 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY**\n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.”  \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%).\n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to Wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n* *A Snapshot of its largest customer base:*\n\nhttps://preview.redd.it/uwe5biyquuw61.png?width=679&amp;format=png&amp;auto=webp&amp;s=fd2bc97da035fdd0cc0d84e11686aa40166f5c91\n\n* *A Snapshot Of Their Investment Thesis:*\n\nhttps://preview.redd.it/m1v3wk1uuuw61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=3530ce3826ed67513c7797afd4bb1a3a0d54e56a\n\n**Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\nhttps://preview.redd.it/tm9r4jdyuuw61.png?width=632&amp;format=png&amp;auto=webp&amp;s=cd452f13403ddf6f1c43151b9fca9415d9aa1826\n\n*A Visual Of $ETWO 's business model:*\n\nhttps://preview.redd.it/pts7oo10vuw61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=b50c7097f059b98ffb48f2e8134628860fccf700\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis. \n\nOne of the most important value factors for SaaS platforms is in the recurring cash flow. In $ETWO's case, this comes from it's subscription sales, which provides some much valued predictability in these uncertain times . This is another strength that $ETWO possesses, as the company boasts an extremely low churn rate - which is a an indicator of a massive moat, which can allow $ETWO to retain profits from its competitors. This only further demonstrates that the company is due for strong future growth. Below are some visuals which exemplify the value of ETWO:\n\n&amp;#x200B;\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/wirah1d2vuw61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=75ae35151c09a121def921cb6bd42c03c947c563\n\n* Attractive Long Term Financial Profile:\n\nhttps://preview.redd.it/9intlpp3vuw61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=ba50479fab89957024b271cc1223ddb2e25d83a1\n\n* Growth and Profitability:\n\nhttps://preview.redd.it/52quo145vuw61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=d93bbeb7ace2f303d45c68a5cf90bd616cff90c8\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it.  If you think about that, you’ll do things differently.”  \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management solutions to the enterprise. While the Supply Chain Management space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest:\n\n[https://finviz.com/screener.ashx?v=152&amp;f=sh\\_opt\\_option,sh\\_short\\_high&amp;o=shortinterestshare&amp;t=ETWO](https://finviz.com/screener.ashx?v=152&amp;f=sh_opt_option,sh_short_high&amp;o=shortinterestshare&amp;t=ETWO)\n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine:\n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "wallstreetbets",
        "title": "A Deep Dive Look at: E2Open ($ETWO) - The Future of Supply Chain Management?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3qj1d/a_deep_dive_look_at_e2open_etwo_the_future_of/",
        "created": 1620056377.0
    },
    {
        "author": "gagan45678",
        "created_utc": 1621893552,
        "id": "nk9kqs",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\nWith Nvidia being the creator of the GPU (Graphic Processing Unit), its benefitting from all the recent trends and ones to stay. Their chips are being used by industry leaders Amazon's AWS, Microsoft's Azure Cloud, Alphabet's Google Cloud, International Business Machines' IBM Cloud, and Alibaba Cloud.\n\nTheir GPUS are crucial in the success of AI. Everyone is trying to develop their own AI processor but at this point, the GPU is still the go to for both researchers and data centers wanting to run AI and other sophisticated algorithms. For example, it will supply NIO the electric vehicle car company in China with its chips for its newest sedan the ET7.\n\nAnother reason why everyone should own Nvidia stock is because of their GRACE CPU. Although Intel holds 90% of the CPU market, their GRACE CPU now will have 10 times the performance of any leading CPU on the market!\n\nTheres more details in the video i made below. Just wanted everyone to be aware of what Nvidia is doing and why it may be worth either having on your watch list or a stock to own. In addition they are also doing a 4 to 1 stock split on July 19th which will make each share valued at roughly $150 according to todays stock price.  \n[https://youtu.be/n5alFa4QNm8](https://youtu.be/n5alFa4QNm8)",
        "subreddit": "StockMarket",
        "title": "Why Everyone Should Own or Watch Nvidia Stock in 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/nk9kqs/why_everyone_should_own_or_watch_nvidia_stock_in/",
        "created": 1621922352.0
    },
    {
        "author": "reggiebergst",
        "created_utc": 1619979891,
        "id": "n3chz4",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Here's some charts that distribute the allocations of President Biden's $2T Infrastructure Plan or [**American Jobs Plan**](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/). Dollar value is approximate.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bgcxr8191rw61.png?width=657&amp;format=png&amp;auto=webp&amp;s=c2a54e70101dff07861af6eb58de5abc002b1f41\n\nhttps://preview.redd.it/n9ezy62a1rw61.png?width=993&amp;format=png&amp;auto=webp&amp;s=5df018d3906f782556eb6e34044bde81d871f9bd\n\nhttps://preview.redd.it/9zdnsuyb1rw61.png?width=715&amp;format=png&amp;auto=webp&amp;s=e511cce486dbe3002f6ac22d3f5d0400102bf6ad\n\nhttps://preview.redd.it/q5v7zsyb1rw61.png?width=1063&amp;format=png&amp;auto=webp&amp;s=855f94ce7ff1b55d61c39becddac35889a21ad00\n\nhttps://preview.redd.it/sbmn9tle1rw61.png?width=600&amp;format=png&amp;auto=webp&amp;s=55d14f6204cb1dc4f99527ff4e68ac09d0294f76\n\nhttps://preview.redd.it/30avftle1rw61.png?width=863&amp;format=png&amp;auto=webp&amp;s=bd57e1cf38281f2349fde61a9011a935a994f862\n\nhttps://preview.redd.it/d94zt2wg1rw61.png?width=958&amp;format=png&amp;auto=webp&amp;s=07e71c79ce1958ccb766e3a53764cb7f60324035\n\nhttps://preview.redd.it/6l5zf0wg1rw61.png?width=765&amp;format=png&amp;auto=webp&amp;s=5d007756dcab2d14e5f175a448243d96269b953e\n\nMore details on how the American Jobs Plan...\n\n* [Empowers and Protects Workers](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/23/fact-sheet-the-american-jobs-plan-empowers-and-protects-workers/)\n* [Support Women's Employment](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/21/fact-sheet-the-american-jobs-plan-will-support-womens-employment/)\n* [Supports Veterans](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/15/fact-sheet-the-american-jobs-plan-supports-veterans/)\n* [Supports Small Businesses](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/13/fact-sheet-the-american-jobs-plan-supports-small-businesses/)\n\n**Who is going to pay for this?**\n\nWe the people. Well more like we the 1%ers. And corporations. \n\nhttps://preview.redd.it/z14j0n3o1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=e7fe2cd9e9d38e4da56734d217c8c501452239ab\n\nhttps://preview.redd.it/p6d21ogo1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=a30da1959f47595babacc3650774f989fd15bd51\n\nhttps://preview.redd.it/5g4w1vqo1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=0ed852635707d9d9d8adbe160aa4dad4d00aa238\n\nhttps://preview.redd.it/2hsitf0p1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=2f0383487ee018543d3f7a30bb6134e9230e87c8\n\nhttps://preview.redd.it/vx91919p1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=383b42773f7f293fb9d2f5bf5f10d35f493d4c5b\n\nhttps://preview.redd.it/2dtl7lhp1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=cb3507e37634e17736b9f98e17b8e17e8a0049d6\n\nhttps://preview.redd.it/18vykusp1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=bf3d95dae53db941fb03e7482fc967affec7fb1a\n\nhttps://preview.redd.it/mayn216q1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=e25995d349c8bc226a6ef6eee2128fd9d0197319\n\nhttps://preview.redd.it/61cug0yq1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=d3e5ea3e071fc572baa1ae42e1468c0b0b546429\n\nhttps://preview.redd.it/kgk8in6r1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=a7a49f0adc94de30e276eac4dd6f2c7716350196\n\nhttps://preview.redd.it/s4xy9uhr1rw61.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=436800922f33ebebf6e28f504b16f4ff5635e68b\n\nSo unless you're a high earner, this won't affect you (much). I made these charts about a week or two ago but I heard for the American Families Plan, individuals earning more than $452,700 and married couples earning more than $509,300 (meaning each partners could earn less than $400,000) could see a tax increase.\n\n**What do you mean, \"won't affect you (much)\"?**\n\nIf there's tax increases for the rich, what will the rich do? They'll take their stock market gains before the tax increases. 2020 saw huge gains so we may see a correction in the coming months. How much of a correction you ask? I don't know but I would guess 10-15% in the broader market. More if you're into speculative high growth stocks. I say that because I know a lot of you have positions on them. Careful how you invest these next few months.\n\nAnd if there's tax increases for corporations, obviously they'll do whatever they can to avoid them. However even a 1% increase in their taxes (note below I mention that many corporations pay very little taxes because of loopholes) will affect their bottom line. This means earnings will be less and therefore lower stock valuations.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/65swnd332rw61.png?width=1260&amp;format=png&amp;auto=webp&amp;s=228f04d002b432308b558a4583878367e49a559b\n\n**So if the rich sell and corporations are being taxed more, how will that affect the stock market?**\n\n1. Less incentive to invest due to more taxes. People will look to other investments or stay cash. (Seriously though, the tax plan won't make a huge difference unless you're a 1%er.)\n2. Bonds become more [favorable](https://investor.vanguard.com/investing/taxes/government-bonds#:~:text=Income%20from%20bonds%20issued%20by%20state%2C%20city%2C%20and%20local%20governments,where%20the%20bond%20was%20issued). Income from bonds issued by state, city, and local governments (municipal bonds, or munis) is generally free from federal taxes. You will, however, have to report this income when filing your taxes. Examples: MUB, HYD, VOHIX, VWAHX.\n3. ETFs and Mutual funds are more favorable. They both are taxed at the long-term capital gains rate of 0%, 15%, and 20% depending on your earnings. ETFs, however, have an advantage over mutual funds due to three reasons: 1) 2018, 89% of ETFs were passive vs. 4% of mutual funds. Less trading involved with passive. 2) Any high dividend or high interest paying securities will receive more distributions, therefore a high tax bill. 3) ETFs have greater liquidity as they are traded during market hours vs. mutual funds are traded at the beginning and end of market sessions.  \n\\*In 2018, Goldman Sachs did a study that showed 100% of their ETFs did not pay capital gains. Broadly, 90% of ETFs did not pay capital gains compared to 39% of mutual funds.\n4. 4. Tax advantaged accounts like Roth IRA and 401K are more favorable. If you're one of the super rich, take a look at the [backdoor Roth IRA](https://www.investopedia.com/terms/b/backdoor-roth-ira.asp). It's a way for super rich people to put money into retirement without the contribution limits. Roth IRA contribution limit is $6,000 per year. BUT if you make more than $140,000 as a single or $206,000 filing jointly as married then you cannot contribute to a Roth IRA. The easiest way to get by this is converting a traditional IRA account to a Roth IRA account.\n\n&amp;#x200B;\n\n**What does history** [**say**](https://www.fidelity.com/learning-center/trading-investing/tax-hikes-history#:~:text=In%20the%2013%20previous%20instances,the%20data%20in%20the%20calendar) **about stock market performance after tax increases?**\n\n\"In the 13 previous instances of tax increases just since 1950, the S&amp;P 500, the stock index that tracks most of the major companies in the US, has shown higher average returns, and higher odds of an advance, in times when taxes are increasing, according to Chisholm's research, which analyzed the data in the calendar year of the tax changes, plus the year prior and year after. This pattern holds true even when you drill down into key sectors of the S&amp;P 500.\" Here's a [chart](https://i.imgur.com/2MaBjOp.png) of the S&amp;P500 performance after tax increases. Not too bad eh?\n\n&amp;#x200B;\n\n**What's happening now with the current tax law?**\n\n* 91 Fortune 500 companies paid $0 in federal corporate taxes. Amazon, Chevron, Halliburton, and IBM are some of those companies. Corporate tax rate is currently 21%.\n* 56 Fortune 500 companies paid 0-5% on their 2018 income.\n* 2017 tax bill cut the average rate that corporations paid in half from 16 percent to less than 8 percent in 2018. I couldn't find any data on this but its due to loopholes in the tax system.\n\n**The Made in America Tax plan**\n\n* Will raise over $2 trillion over the next 15 years and more than pay for the mostly one-time investments in the American Jobs Plan and then reduce deficits on a permanent basis.\n* Increase corporate tax rate at 28% from 21%\n* Right now, the tax code rewards U.S. multinational corporations that shift profits and jobs overseas with a tax exemption for the first ten percent return on foreign assets, and the rest is taxed at half the domestic tax rate.\n* The proposal will increase the minimum tax on U.S. corporations to 21 percent and calculate it on a country-by-country basis so it hits profits in tax havens. It will also eliminate the rule that allows U.S. companies to pay zero taxes on the first 10 percent of return when they locate investments in foreign countries.\n* The United States is now seeking a global agreement on a strong minimum tax through multilateral negotiations.\n* Invert the current law in which U.S. corporations can acquire or merge with a foreign company to avoid U.S. taxes by claiming to be a foreign company, even though their place of management and operations are in the United States.\n* A proposal that companies can no longer write off expenses that come from offshoring jobs. Instead a tax credit will be proposed to support onshoring jobs.\n* Invert a Trump tax law for “Foreign Derived Intangible Income” (FDII), which gave corporations a tax break for shifting assets abroad and is ineffective at encouraging corporations to invest in R&amp;D. Instead the revenue will be used to expand more effective R&amp;D investment incentives.\n* Enact a minimum tax of 15% on large corporations’ book income.\n* Eliminate tax preferences (worth billions of dollars) for fossil fuels and make sure polluting industries pay for environmental clean up.\n* Increase enforcement for tax evasion. Typical workers’ wages are reported to the IRS and their employer withholds, so they pay all the taxes they owe. By contrast, large corporations have at their disposal loopholes they exploit to avoid or evade tax liabilities, and an army of high-paid tax advisors and accountants who help them get away with this. At the same time, an under-funded IRS lacks the capacity to scrutinize these suspect tax maneuvers: A decade ago, essentially all large corporations were audited annually by the IRS; today, audit rates are less than 50 percent.\n\n&amp;#x200B;\n\n**So what should I do to prepare if this bill passes?**\n\nNothing different honestly. Keep investing. DCA - dollar cost average if your stocks drop. Stay the course in your high conviction names. De-risk if you have to by investing in safer investments like index funds or ETFs. I know a lot of you are into SPAX (special purpose acquisition companies. I spelled it this way in case this sub banned the real acronym) and other speculative companies. There's almost 500 of them out there. 217 of those were from 2020. To be honest, 1% of those companies will moon. Most of them won't see a return for years. Are you willing to hold them without knowing they will moon in 5-10 years? Some may not even make a return. Make sure you understand market conditions. Stocks really do go up but its only the ones that are backed by strong earnings and potential. Don't get burned. Money is not everything but it's a tool to bring you financial freedom sooner in life. You know what they say, \"there's only two things guaranteed in life: death and taxes\".",
        "subreddit": "StockMarket",
        "title": "The American Jobs Plan and How it Affects How People Invest in the Stock Market",
        "url": "https://www.reddit.com/r/StockMarket/comments/n3chz4/the_american_jobs_plan_and_how_it_affects_how/",
        "created": 1620008691.0
    },
    {
        "author": "louied91",
        "created_utc": 1621342400,
        "id": "nf9yg5",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "News Link: [https://www.globenewswire.com/news-release/2021/05/18/2231643/0/en/GTX-Corp-Reports-First-Quarter-2021-Financial-Results-and-Corporate-Summary-Update.html](https://www.globenewswire.com/news-release/2021/05/18/2231643/0/en/GTX-Corp-Reports-First-Quarter-2021-Financial-Results-and-Corporate-Summary-Update.html)\n\n&amp;#x200B;\n\nLOS ANGELES CALIFORNIA, May 18, 2021 (GLOBE NEWSWIRE) -- GTX Corp (OTC: [GTXO](https://www.globenewswire.com/Tracker?data=j3gtkmThfATvTg1uMu6qO7ZZ7IzYHd2PRwY4g1pfnw5SYfSiQ5IpJfEpa-lbtO6J7YcNoTryfZN4mXM_U2aKoI98j8nn4P1eQWfXdUa1zR9EvU1ON0Qm5LnXDmx_TvA-)) (“the Company”), a pioneer in the fields of: health &amp; safety wearable GPS human and asset tracking systems and personal protective medical equipment and supplies, today announced financial results for the First Quarter ended March 31, 2021 and provided the following corporate summary:  \n\n\n**First Quarter Financial Highlights**\n\n* Overall Revenue increased 138% over 2020 comparable period.\n* Product Sales increased 445% over 2020 comparable period.\n* Cash on Hand increased 319% over 2020 comparable period.\n* Wages &amp; Benefits decreased 21% over 2020 comparable period.\n* G&amp;A decreased 22% from 2020 comparable period.\n* Current Debt &amp; Liabilities reduced by $709k over 2020 comparable period.\n* Debt reduced by $165K in first quarter 2021.\n* Loss from Operations decreased 8% from 2020 comparable period.\n* Did not take on any new debt.\n\n**First Quarter 2021 Business Highlights and Developments**\n\n* Strong product sales, despite COVID-19.\n* Broadened product offerings in the medical health and safety sectors, by adding Antigen, Antibody Rapid Test-Kits, and hearing health to product line.\n* Significant development progress made on 4G SmartSole modules.\n* Incorporating natural language processing (NLP) and voice assistant features into backend platform utilizing home assistant devices, such as Amazon Echo, Google Home or IBM Watson.\n* Fulfilled multiple orders for PPE to government agencies including the United States Marine Corps, the U.S. Navy, the U.S. Department of Agriculture, and the U.S. Department of Veterans Affairs.\n* Added over 1,500 new customers.\n* Increased shareholder base by approximately 60%.\n\n**Management commentary: Patrick Bertagna, GTX Corp CEO.**\n\nWith businesses across the country opening back up and overall general travel picking back up, we maintained strong PPE, Rapid Test-Kit and SmartSole pre order sales throughout the first quarter and saw a 445% increase in product revenues and a 138% increase in total revenue compared to Q1 2020 with a 22% decrease in SG&amp;A. We added approximately 1,500 new customers, saw continued demand for our new SmartSoles with over 200 pre orders to date, and grew our shareholder base by approximately 60% during Q1 2021.\n\nAs we mapped out our 2021 post pandemic course, we did get more aggressive in our pricing and slightly reduced our gross margins in order to sell down our remaining PPE inventory, while shifting focus more on wearable tech products and gearing up for our Cat M1 LTE SmartSole launch.\n\nSince we cannot accurately predict how long the PPE business will remain in demand, and based on the current events and sales trends, we expect to be transitioning out of many PPE products over the coming months and focus on the strong sellers in our product line while ramping up for the launch of the new SmartSoles, NFC Blockchain platform and other medical wearables such as our hearing health products. The continued demand for PPE during Q1 2021 did enable us to maintain our cash flow, continue to add new customers, expand our brand visibility, and reduce our debt by $165K, eliminating all but $1,800 of our variable priced convertible debt, leaving only fixed price, low interest rate debt on the balance sheet.\n\nDuring the first quarter 2021, we began finalizing the design phase of our next generation miniaturized GPS tracking device, which will utilize a host of new technologies, including CatM1, NB-IoT, enhanced Wi-Fi, and Bluetooth, for better accuracy, faster location requests and less power consumption and started working on testing, certification and ordering parts and components in order to prepare for production and launch. We also started working on a new version of our tracking app and new website. We also expanded our product offering under our hearing health product line and began the integration of Amazon Echo voice assisted capabilities into our backend portal.\n\nHealth &amp; Safety, Track &amp; Trace are the big buzz words that came out of 2020. Everyone wants to be safe and know where someone or something has been, which sits at the core of the GTX technology and IP portfolio. We are hearing from many of our B2B customers and international distributors that they want more tracking solutions. So, a big part of Q1 was making sure we get back to developing and launching new tracking technology products that will meet the global demand throughout 2021 and beyond. We also explored new partnerships and allocated resources for new research and development initiatives.\n\nIn summation, we navigated through the pandemic adding more product sales, more customers, more shareholders, less debt and liabilities and a much cleaner balance sheet. We hope all our stakeholders stay safe and healthy and we will keep updating everyone on our latest developments through our video podcast, press releases and newsletters.",
        "subreddit": "pennystocks",
        "title": "$GTXO GTX Corp Reports First Quarter 2021 Financial Results and Corporate Summary Update",
        "url": "https://www.reddit.com/r/pennystocks/comments/nf9yg5/gtxo_gtx_corp_reports_first_quarter_2021/",
        "created": 1621371200.0
    },
    {
        "author": "raoha",
        "created_utc": 1620047820,
        "id": "n3vs4e",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " **E2Open ($ETWO)**\n\n**A 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\n&amp;#x200B;\n\n\\*Note\\* I posted this a few days ago on WSB. Mods deleted it (probably not enough rocket emojis), so I figured this might be a more suitable place for discussion!. Cheers!\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY**\n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.” \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%).\n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to Wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n* *A Snapshot of its largest customer base:*\n\nhttps://preview.redd.it/5y53bq4inww61.jpg?width=1194&amp;format=pjpg&amp;auto=webp&amp;s=1467048a3391c0da2fe641472522f200b7fcf016\n\n* *A Snapshot Of Their Investment Thesis:*\n\nhttps://preview.redd.it/7v8dt8rjnww61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=80b6e61352dd21cf6df02c9aebb4f2286fc83a01\n\n**Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\nhttps://preview.redd.it/zkuxw31onww61.png?width=632&amp;format=png&amp;auto=webp&amp;s=07d09fcf3e6f6e965ae82f6a48b77f2504896919\n\n*A Visual Of $ETWO 's business model:*\n\nhttps://preview.redd.it/2u9riftpnww61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=b4c32567357a0a5df16fe3df3efa83d2239f20c4\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis.\n\nOne of the most important value factors for SaaS platforms is in the recurring cash flow. In $ETWO's case, this comes from it's subscription sales, which provides some much valued predictability in these uncertain times . This is another strength that $ETWO possesses, as the company boasts an extremely low churn rate - which is a an indicator of a massive moat, which can allow $ETWO to retain profits from its competitors. This only further demonstrates that the company is due for strong future growth. Below are some visuals which exemplify the value of ETWO:\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/vqz514frnww61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=c7da8635fcc90ddc8313cf63284602b07a639e32\n\n* Attractive Long Term Financial Profile:\n\nhttps://preview.redd.it/ypg366qsnww61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=1a55558eaba519a8a3ac9d16fb0b0648c058a38c\n\n* Growth and Profitability:\n\nhttps://preview.redd.it/4sgqj03unww61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=f8b16e1fda840fb7d6c0fd2a7c9192dd645dfbe5\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it. If you think about that, you’ll do things differently.” \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management solutions to the enterprise. While the Supply Chain Management space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest:\n\n[https://finviz.com/screener.ashx?v=152&amp;f=sh\\_opt\\_option,sh\\_short\\_high&amp;o=shortinterestshare&amp;t=ETWO](https://finviz.com/screener.ashx?v=152&amp;f=sh_opt_option,sh_short_high&amp;o=shortinterestshare&amp;t=ETWO)\n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine:\n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "StockMarket",
        "title": "E2Open ($ETWO) - A Great Buy During The Current Global Supply Chain Crisis?",
        "url": "https://www.reddit.com/r/StockMarket/comments/n3vs4e/e2open_etwo_a_great_buy_during_the_current_global/",
        "created": 1620076620.0
    },
    {
        "author": "LucieiStevenson",
        "created_utc": 1620223614,
        "id": "n5gqfs",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I've been poking around on some discussion boards and whatnot, and have been seeing some buzz generated about this company following their recent PR.\n\nDigiCrypts Blockchain Solutiontions (or more commonly known as DigiMax) is a player in the predictive analytics industry. For those of you who like AI and Fintech, these guys are really doing some interesting things. They have a fairly diverse selection of services using their constantly improved predictive AI, and they implement it in a variety of different ways.\n\nSome of their products are as follows\n\n* Cryptodivine - a predictive trend indicator for analyzing patterns in BTC and ETH prices\n* DataNavee - used by business to analyze and predict sales, revenues, and supply chains using machine-learning tech\n* Darwin Ecosystem - used to evaluate and improve a businesses workforce and hiring decisions using PPI (Projected Personality Interpreter)\n\nThe last of those products is actually a result of a partnership with IBM Watson, and seeing a large IP attached to a smaller cap brand like this always gets me excited.\n\nOn May 3rd, they announced an investment into Kirobo, a cryptocurrency solutions developer. They plan to implement Kirobo's tech of canceling blockchain transfers in future projects related to Cryptodevine. Additionally, they brought a fantastic member onto both company's boards, Brock Pierce, a pioneer in the crypto industry.\n\nThe stock is at $0.235 and after poking around a few boards after the announcement I've seen $0.40 floated around as a target that seems attainable in the near future. I also think that with the booms of AI and Crypto its long-term ceiling can be way higher.\n\nAs always, do your own research, this isn't investment advice.",
        "subreddit": "pennystocks",
        "title": "DigiCrypts (CSE:DIGI) announces investment in Kirobo; might be the perfect time to get in.",
        "url": "https://www.reddit.com/r/pennystocks/comments/n5gqfs/digicrypts_csedigi_announces_investment_in_kirobo/",
        "created": 1620252414.0
    },
    {
        "author": "aabot1",
        "created_utc": 1622296060,
        "id": "nnntym",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "With ecommerce being a hot area 🔥, I wanted to invest in it.  So I looked around and settled on Pitney Bowes $PBI since it is so under value compared to one of its main competitor STAMPS.  They doubled their competitors growth plus their revenue is a lot higher these last two quarters but their valuation is stupid low.  \n\nCan some folks bring up counter points?  I want to really vet this since I am betting big on it, and should I stay in it?  I wonder if their issue is they where a dying old dinosaur and generally they are stilled viewed as such, or I am blind to some concerning issues.\n\nHere are bullet points of what I know: \n\n1. 4th Quarter 2020 Total Revenue\n   1. PBI - Global Ecommerce Division $518million (60% YoY Growth)\n   2. STAMPS - $206million (28% YoY Growth)\n2. A few mutual funds have written a great write-up on PBI :\n   1. Domo Capital: Pitney Bowes Already Transformed and Set to Shock... (Seekingalpha)\n   2. Choice Equities Management: [Pitney Bowes Smart Long-Term Buy](https://finance.yahoo.com/news/pitney-bowes-pbi-smart-long-152937767.html)\n3. PBI spent heavily in 2020 building Amazon-type warehouses: [New Fulfillment Centers](https://www.investorrelations.pitneybowes.com/news-releases/news-release-details/pitney-bowes-expands-ecommerce-capabilities-opening-fulfillment)\n4. Reddit post on $PBI a deep value see [DD on Pitney Bowes on StockMarket](https://www.reddit.com/r/StockMarket/comments/mghwow/dd_pitney_bowes_pbi_the_deep_fucking_value/)\n5. Hit piece on Seekingalpha, \"Pitney Bowes is a Healthy Overvalued Company\", but really great info in comments worth reading\n6. PBI's use of big-data with IoT, see [Digital Transformation at Pitney Bowes](https://www.forbes.com/sites/stephendiorio/2021/04/29/enabling-a-digital-transformation-at-pitney-bowes/?sh=1a0d571431cc)\n7. Great Interview with the CEO on the Digital Transformation, [CEO Interview](https://www.youtube.com/watch?v=ezxaAP1UOu0)\n8. New fact shared on reddit: [Pitney Bowes may be a benefit of USPS's new 10-Year Plan](https://www.reddit.com/r/wallstreetbets/comments/mf70pv/pitney_bowes_may_be_the_beneficiary_of_uspss_new/)\n9. 1st Quarter 2021 (Showing the turn-around is happening)\n   1. PBI - Global Ecommerce Division $413million (41% YoY Growth)\n      1. Plus Presort $143mill EBITDA=$27mil, SendTech $359mil EBITDA=$122mil\n   2. STAMPS - $189.16million (25% YoY Growth)\n10. STAMPS cap 3.142B, PBI cap 1.31B (As of 5/14/21 10am)\n11. [IBM contract for cloud computing across PBI operations](https://finance.yahoo.com/news/ibm-aid-pitney-bowes-pbi-145502095.html)\n\nThanks for hearing this out, and what I am missing.  I thought after the Q1 it will reset to a higher range but nope.",
        "subreddit": "StockMarket",
        "title": "What are your thoughts on Pitney Bowes $PBI as a turn-around ecommerce play?",
        "url": "https://www.reddit.com/r/StockMarket/comments/nnntym/what_are_your_thoughts_on_pitney_bowes_pbi_as_a/",
        "created": 1622324860.0
    },
    {
        "author": "Comparison_Wise",
        "created_utc": 1620230514,
        "id": "n5je28",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I am looking at IBM on streetsmartedge. The stock price is at about145 right now. But sometimes it shows the price at around 65. This happens for some other stocks too. What is the reason for this ?\n\nWhy is there such a difference ?",
        "subreddit": "options",
        "title": "Stock price switching between two ranges.",
        "url": "https://www.reddit.com/r/options/comments/n5je28/stock_price_switching_between_two_ranges/",
        "created": 1620259314.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1620420658,
        "id": "n78n3g",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, May 7, 2021**\n\nKeeping up with current volatility, the stock market jumped up today to new records, with the S&amp;P 500 (SPY) and Dow Jones (DIA) reaching fresh intraday records, driven higher by a swift reversal to the upside by tech-stocks. Market participants continue to digest corporate earnings reports and the disappointing April Jobs Report, which showed the US economy added fewer jobs than expected even despite the easing of social distancing guidelines. \n\nThe Labor Department showed that the US only brought back 266,000 jobs for the month of April, far less than the gain of at least 1 million that was originally expected and a big deceleration from the numbers seen in March. The unemployment rate unexpectedly increased to 6.1%, widening further from its pre-pandemic level of 3.5%. \n\nThis new economic data serves to bolster the argument that monetary officials have been making that, despite significant progress, the labor market remains well below pre-pandemic levels and that more support from the Central Bank is needed to bolster the momentum of the recovery. Altogether, the US remains roughly 8.2 million jobs short compared to pre-pandemic levels, and both the unemployment rate and labor force participation remains well below January 2020.\n\nIn the past, Federal Reserve Chair Jerome Powell has suggested the Central Bank wants to see a “string” of strong labor market gains totalling more than 1 million before any adjustment to the current policy is made. With the April report disappointing, it appeared the labor market remains far below the Central Bank targets, meaning it is unlikely to change its current accommodative policy anytime soon.\n\nSeema Shah, Chief Strategist at Principal Global Investors said, “The smaller rise in payrolls should at least assuage some concerns around the Fed policy outlook. As we have heard several times in recent days, even a very strong jobs number wouldn’t have caused the committee to formally discuss changing the pace of bond purchases, so today’s number certainly won’t be giving the Fed cause for concern. They will be in no rush to bring forward tapering plans.\"\n\n**Highlights**\n\n* The weak April jobs report catalyzed a rebound in technology names Friday morning, with the disappointing data easing fears that the Federal Reserve will adjust their policies in the near-term.\n* Moderna (MRNA) posted a profit for the first time for Q1 2021, bolstered by revenue brought from the coronavirus vaccine. \n* ROKU and Square (SQ) both gapped up today after blowing past analyst estimates in their earnings report.\n* Amid mounting pressure from antitrust regulators, e-commerce giant Alibaba Group offloaded its entire stake in a real estate trading platform, retreating from a new business for which it once held high hopes.\n* IBM introduced what it says is the world's first 2-nanometer chip making technology. The technology could be as much as 45% faster than the mainstream 7-nanometer chips in many of today's laptops and phones and up to 75% more power efficient, the company said. Read more[ here. ](https://www.reuters.com/technology/ibm-unveils-2-nanometer-chip-technology-faster-computing-2021-05-06/)\n* Pfizer (PFE) and BioNTech (BNTX) submitted an application with the US FDA to approve use of their coronavirus vaccine for individuals 16 and older\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday movement\\*\\***\n* AutoZone (AZO) target raised by UBS Group from $1415 to $1700 at Buy. Stock currently around $1488\n* Adient (ADNT) target raised by Deutshce Bank from $58 to $63 at Buy. Stock currently around $48\n* Avalara (AVLR) target raised by Morgan Stanley from $170 to $175 at Overweight. Stock currently around $124\n* BioCryst Pharmaceuticals (BCRX) target raised by Barclays from $13 to $20 at Overweight\n* BILL target raised by KeyCorp from $165 to $175 at Overweight. Stock currently around $130\n* Builders FirstSource (BLDR) target raised by Barclays from $57 to $68 at Overweight. Stock currently around $52\n* Costco (COST) target raised by Raymond James from $375 to $410 at Outperform. Stock currently around $382\n* Datadog (DDOG) with two very bullish price target raises. Stock currently around $71\n   * Monness Crespi &amp; Hardt from $100 to $103 at Buy\n   * Needham &amp; Co from $141 to $150 at Buy\n* Diodes (DIOD) target raised by Cowen from $95 to $100 at Outperform. Stock currently around $72\n* Expedia Group (EXPE) with three target raises. Stock currently around $165\n   * Credit Suisse from $168 to $198 at Outperform\n   * JPM Securities from $185 to $195\n   * Wells Fargo from $215 to $235\n* FMC target raised by KeyCorp from $133 to $136 at Overweight. Stock currently around $117\n* Floor &amp; Decor (FND) target raised by Barclays from $110 to $125 at Overweight. Stock currently around $113\n* Health Catalyst (HCAT) with three target raises. Stock currently around $51.50\n   * Cantor Fitzgerald from $52 to $60\n   * SVB Leerink from $53 to $59\n   * Raymond James from $56 to $63\n* Moderna (MRNA) with two target raises. Stock currently around $160\n   * Barclays from $178 to $194 at Overweight\n   * Goldman Sachs from $206 to $228 at Buy\n* Planet Fitness (PLNT) target raised by Jefferies Financial Group from $95 to $100 at Buy. Stock currently around $80\n* Square (SQ) with two target raises after blowout earnings report. Stock currently around $235\n   * JP Morgan from $250 to $300 at Overweight\n   * Credit Suisse from $290 to $300 at Outperform\n* Tapestry (TPR) target raised by Robert W Baird from $45 to $54 at Outperform. Stock currently around $47\n\n“It is in your moments of decision that your destiny is shaped.” - Tony Robbins",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, May 7, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/n78n3g/here_is_a_market_recap_for_today_friday_may_7_2021/",
        "created": 1620449458.0
    },
    {
        "author": "louied91",
        "created_utc": 1620324578,
        "id": "n6dl5b",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "News Link: [https://finance.yahoo.com/news/smartcard-marketing-systems-inc-otc-164500845.html](https://finance.yahoo.com/news/smartcard-marketing-systems-inc-otc-164500845.html)\n\n \n\nNew York, NY, May 06, 2021 (GLOBE NEWSWIRE) -- [via NewMediaWire](https://www.globenewswire.com/Tracker?data=f_cXrgz8o-G1zpe7AuPSEKqG_EVkzfgBXP6t2N0KZXVovc1-V-wcRKq5ZqNFgM2Br2FfryZ8XtoAmC1swI4j5-wJPbgLQOdIR0lH1BENU98=) \\-- SmartCard Marketing Systems Inc (OTC:SMKG) offers two intellectual properties for tokenizing patents issuance: “OriginatorX” and “Granularchain”: an opportunity in what IBM is stating to be a “trillion dollar plus market” for patent tokenization.  \n\n\nNoteworthy source news: IBM is turning patents into NFTs -- says it’s a future “trillion plus dollar market”:\n\n[https://cryptoslate-com.cdn.ampproject.org/c/s/cryptoslate.com/ibm-is-turning-patents-into-nfts-calls-it-a-future-trillion-dollar-market/amp/](https://www.globenewswire.com/Tracker?data=w8jxYt9SWy85baIsKmSdswg7kJzFFNQb8XxAPeN-wadK1zekCPo5995JQTZY45atpRCz5X-nLj_w7lxW5hd-s5XaD1yFulIgugvfxAiztxOZfyDkxoyIjQFhWycuGamAEzC1myXM9GdeGwZyn9YcSEpKFxPQv8NAxgD0j4UWizOjp2smNis1DYr8_regV3WIikFgYFAhX8Y5qO7dVQXHsE5yrwm0j1_hTfE9AdrxHXqo3zrMqik3Z70-KA1rzdFoqgUrNWc2OjGuMcIN5CeHuGp75yegSaUgDZ1jtDzxNEOas3n7nrq6ZFU8tt_rXvyWUDS60_haAjJpPUCsCJmNF2LObQZYlqE7lqmm6VX_gznDGrKMifiyx7yWp8GaqR3-pyffKcvgnr91jLUUB7jO0A==)\n\nSource excerpt: IBM Unlocking a $1 trillion market: According to Spangenberg, only 2-5% of patents translate into $180 billion of value in the market. However, traditional patents are “notoriously difficult to manage, value, and transact to be treated as a liquid asset.” In this light, NFTs represent an opportunity to make the sector much more transparent and cost-efficient, unlocking a $1 trillion—or more—market.\n\n“The use of NFTs to represent patents will help create completely new ways to interact with IP \\[intellectual property\\]. This is expected to benefit not only large enterprises that have significant intellectual property, but it will bring new opportunities to small and medium enterprises and even individual IP owners,” Spangenberg explained.\n\nAs stated by the CEO of SMKG, Massimo Barone, “This is a remarkable precedent to see confirmed that the market size potential to capitalize on as we move forward. Until now, the Patent market size was immeasurable or valuation target not clearly distinguishable, but thanks to Enterprise companies like IBM setting the Token Patent market size at $1Trillion plus. At SMKG, we are now able to quantify our investments into developing and IP strategy for our targets and showcase to investors and stakeholders our internal expert opinions on the true valuation of our proprietary portfolio of 16 Fintech and PayTech applications. This benchmark by IBM allows us to showcase that 3 of our blockchain and tokenizing solutions have a potential market target opportunity in a 1 Trillion USD market. We were already excited in working in collaboration with several partners on tokenizing patents and registered formulas with our two platforms, and preparing the offering potential on listed crypto exchanges. We know with this current market validation by IBM to publicly disclose a market value potential to global markets set us way ahead of the market with future ready solutions to accelerate our offerings with clients.\n\n“At SMKG, we thrive on demonstrating facts and statistics to develop valuation models to benchmark the potential market size opportunities for each of our 16 marketplace technologies. It happens in many cases where we develop a technology with little discoverable valuation for market size and growth which makes it difficult for investors or stakeholders to truly comprehend what we are establishing as we build the IP future of SMKG in Fintech, Retail and Workforce management by enabling payments and blockchain tokenization.\"\n\nAbout:SMKG  \nSmartCard Marketing Systems Inc (OTC:SMKG) an industry leader in specialized industry e-commerce, cloud and mobility applications to the global PayTech and FinTech markets. SMKG is an entrepreneurial boutique technology company, providing business intelligence, blockchain and digital transformation strategies with a proprietary portfolio of applications and wireframes for banking, enterprises, retail e-wallets, digital id, e-KYC, digital workforce, events management, edtech, telemedicine and ride-booking industries. For more info visit [www.smartcardmarketingsystems.com](https://www.globenewswire.com/Tracker?data=0hd0IeOnneODl6qOcruW4ClB2YKKrWw9Ez0xgBMlcpLI4CQSrdYVZa4vF-V4_8_IS17CfWGV8YKn9-8VF_xsAPj_RgC_2TIPtD2YVV57nGImupKvpXUESHVV6mZ4y2Sq) or visit our business applications marketplace at [www.Emphasispay.com](https://www.globenewswire.com/Tracker?data=lEcP2VVdM7supTyUSkUPJfMMIPEmfuRw4JVXgXk3JOXMDnvqRSm5B2hPM3sly6k8fEvTPCXtednxUt5rHPQfu42R6cp6YJz5kLBHDJZUD5g=).",
        "subreddit": "pennystocks",
        "title": "$SMKG Offers Two Intellectual Properties, OriginatorX &amp; Granularchain; Opportunity in What IBM is Stating to be a Trillion Dollar Plus Market",
        "url": "https://www.reddit.com/r/pennystocks/comments/n6dl5b/smkg_offers_two_intellectual_properties/",
        "created": 1620353378.0
    },
    {
        "author": "Affectionate-Pop9053",
        "created_utc": 1620356980,
        "id": "n6oxzg",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hey Guys,\n\nI have held the CLOV since 13.10, and I know there was a risk at that moment by a short institution and DOJ. After reviewing everything, I have put half of my account into CLOV by selling BNGO. I know I am a new one in the stock market (Joined on 09/20). I have left the stock market for two months until it came back from 6.31 to 8.00. If you check the record, CLOV had better performance compared to the BNGO now. After back, I have sold other losing stocks like UVXY and put $5000.00 to add more CLOV. Today, I have sold everything UBER and TSLA to buy CLOV. I will stay in this stock before June to see what happened. No one will take me out from CLOV even it reaches a lower price ($6.00). My share has down from 13.10 to 10.6. I do not need a huge peak, but I truly believe and trust we can make this to the moon!\n\nhttps://preview.redd.it/y22hmv887mx61.png?width=995&amp;format=png&amp;auto=webp&amp;s=89ab32b8122655aee3b2950520af70159ad42c29\n\nhttps://preview.redd.it/vtmxjk3a7mx61.png?width=927&amp;format=png&amp;auto=webp&amp;s=e7e6887b96bedd70581ba9a785726084cb401be0\n\n I have held and kept buying AMC from 2.90 to 1.85. At that time, I do not even know and use Reddit, and I have never heard about WSB. It is just a feeling. Then, I have sold it at 2.90. Yeah! I am really stupid. I think I may have a similar case right now. I will not leave. I put everything I can on CLOV. \n\n[ ](https://preview.redd.it/22rzt0ud7mx61.png?width=947&amp;format=png&amp;auto=webp&amp;s=c59ee56e629fa0da0b4ae18707ac96c26e43b012)\n\nEvery time before a stock rise to the moon has a period that big player would like to buy stocks in a low, to sell part of it for keeping low, to rise it for profits, and finally to sell low and to find new stocks. We are under stage 2. If we check the entire CLOV situation (Volume), the big player is buying at 9.85. I have not seen any big moves above 9.00. But, I have seen more moves around 8.5. It is rising! Please stay with us! Do not be fooled or stupid before the sun rising. It is the same experience in every stock before rising. Be patient. We will fck those short players.\n\nCompared to 6.31 position, we can see that more institutions (I cannot trace before. But I think it is rising from 1% to 8.2%. Our general public was 43% before.) are joining this stock. We are only occupied 34% for this company. It is not that hard to raise the price by those big players. This is a super healthy company situation. If you check about aapl, our general publication occupation is even lower.\n\nhttps://preview.redd.it/x3hovnng7mx61.png?width=1207&amp;format=png&amp;auto=webp&amp;s=79ab3e58f621022c9ec45b94016d93c84a317b08\n\n[ ](https://preview.redd.it/ribjbmfi7mx61.png?width=1228&amp;format=png&amp;auto=webp&amp;s=200d5c7bb2ce7b2f18cf9d307de936b70217e980)\n\nIf we check the graph, we are really standing in the resistance position. We are ready to shoot up. These days, a few big players are selling some stocks and buying more because of simple reasons (The whole market money is going to big companies (to avoid risks), healthcare (Biden), renewable power (Biden, especially nuclear), and electronics market (2 nm IBM)), and people who do not understand this stock and stock mechanism are selling your stock to help big players to fck the price and to scare people like me. I will never leave before 5/21/21! I know the main standard stocks like SPX are high and ready to fall down by Wall Street. Loans will add more interest to cool down the market. However, I think it will not happen this month and mostly in June and September. Please stay with us in CLOV and wait for 5/21/21! It is too early to quit.\n\nAlso, I am proud of everyone holding their CLOVs. If we check the volume, more and more people are buying CLOV when the price is going up. When the price is going down, no one is selling their stock. We have a faith in this stock. Big short players, you can keep fck us. I could lose more in this CLOV. Where can you go? 6.31 or 6? Are there any institutions and insiders following your steps? So, only 25% losing compared now. If we win the shorts even just up to 13.00, it will be 56% profit compared now. I will wait for the final results. I will not fcking leave from CLOV.\n\nThese days, the volume is less than 10 Million daily. Big players, you can keep manipulating the price with your personal shares. I will not sell even a share to you. I hope this post could help some people like me as a newbie. If we stay strong, no one sells their stocks. Will this CLOV dead (0 volume)? The answer to this question is impossible, which means they have to raise the price. Also, please do not forget. We have a short 35% at 4/15/21 and options at 5/21/21. This will not let 0 volume happens soon.\n\n[ ](https://preview.redd.it/wdhc48vl7mx61.png?width=1339&amp;format=png&amp;auto=webp&amp;s=eea7eabccc106d521244ad5361117fa57e42bd83)\n\nIt is everything I have in my pocket. I have less than 1000.00 in my bank for food. I hope we are enough lucky to get some money in this stock.\n\nI love you guys. Let stay together. We are strong. We will win this battle.",
        "subreddit": "wallstreetbets",
        "title": "(Please Visit! not DD, just a newbie player personal experience.) I sold everything in my stock and bought all in the CLOV! Paid everything I can for CLOV as a student!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6oxzg/please_visit_not_dd_just_a_newbie_player_personal/",
        "created": 1620385780.0
    },
    {
        "author": "Total-Glass-583",
        "created_utc": 1620303987,
        "id": "n6635j",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "With today’s news of the 2NM processor production. \n\n(Battery life 50% better or performance 45% better, is the significance as I understand it) \n\nWhat say ye?",
        "subreddit": "Wallstreetbetsnew",
        "title": "Buy IBM?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n6635j/buy_ibm/",
        "created": 1620332787.0
    },
    {
        "author": "JohnLouis24",
        "created_utc": 1620498767,
        "id": "n7vfd5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "The following is an excerpt taken from StockTwits user “DTGoody”\n\n*The Problem*\n\nIoT devices are a powerful new technology, however, they also create new opportunity for hackers as billions of new entry points that can result in devastating losses for the businesses using them. An enormous and growing unmet need for effective cybersecurity for IoT is demonstrated very clearly by the soaring number of breaches that continue to result in millions of dollars per incident and billions of dollars in losses every year. \n\nAs Niraj Kadakia of IBM Business Development and Embedded Analytics stated above, we clearly have vulnerabilities and a big unmet need for improved secure IoT solutions. \n\n*The Solution*\n\nLife On Earth, Inc. (LFER: OTC) recently announced their Binding Letter of Intent to purchase 100% of SmartAxiom, Inc., a provider of patented technologies based cyber security with unbreakable block chain based IoT solutions for multiple industries that include machine to machine (M2M) communications. \n\nThere are competing cybersecurity solutions for IoT, however, none yet seems to work well enough to prevent hackers from stealing valuable data. \n\nSmartAxiom has built a patented solution based on the decentralized ledger of Blockchain that is getting the attention of big users such as, CSCO, INTC, IBM, MRVL, TOY, HPE, Volvo, Mazda, Xerox, MSFT, Amazon Web Services, Renesas, NXP, NuLeds, boa, Globe Teleservices. \n\nThe next excerpt (below) is from StockTwits user “Chris T” - He does a good job on explaining the significance of the recent $1.6M investment made on LFER by Joseph A:\n\nFor those who don't know who Joseph Abrams is.....see below: \n\nSource:https://www.cicerotransact.com/team \n\nJoe Abrams is co-founder of The Software Toolworks, a publicly held developer, publisher, and distributor of educational and entertainment software, which was sold to Pearson, Plc. for $462 million. Mr. Abrams also co-founded Intermix, the predecessor company to MySpace, which was sold to News Corp. in 2005 for $580 million. He has also served on the Board of Advisors for Akeena Solar and and was an adviser to ZAAG, assisting in public offerings, acquisitions and capital raisings. \n\nMr. Abrams specializes in emerging growth companies in several areas including: technology, drug discovery technology services, consumer products,big data and online job placement. Mr. Abrams also sits on University of Rochester Simon School of Business Executive Advisory Committee.",
        "subreddit": "pennystocks",
        "title": "$LFER - Plans to acquire SmartAxiom Inc. (HUGE NEWS)",
        "url": "https://www.reddit.com/r/pennystocks/comments/n7vfd5/lfer_plans_to_acquire_smartaxiom_inc_huge_news/",
        "created": 1620527567.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1620420692,
        "id": "n78nm1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, May 7, 2021**\n\nKeeping up with current volatility, the stock market jumped up today to new records, with the S&amp;P 500 (SPY) and Dow Jones (DIA) reaching fresh intraday records, driven higher by a swift reversal to the upside by tech-stocks. Market participants continue to digest corporate earnings reports and the disappointing April Jobs Report, which showed the US economy added fewer jobs than expected even despite the easing of social distancing guidelines. \n\nThe Labor Department showed that the US only brought back 266,000 jobs for the month of April, far less than the gain of at least 1 million that was originally expected and a big deceleration from the numbers seen in March. The unemployment rate unexpectedly increased to 6.1%, widening further from its pre-pandemic level of 3.5%. \n\nThis new economic data serves to bolster the argument that monetary officials have been making that, despite significant progress, the labor market remains well below pre-pandemic levels and that more support from the Central Bank is needed to bolster the momentum of the recovery. Altogether, the US remains roughly 8.2 million jobs short compared to pre-pandemic levels, and both the unemployment rate and labor force participation remains well below January 2020.\n\nIn the past, Federal Reserve Chair Jerome Powell has suggested the Central Bank wants to see a “string” of strong labor market gains totalling more than 1 million before any adjustment to the current policy is made. With the April report disappointing, it appeared the labor market remains far below the Central Bank targets, meaning it is unlikely to change its current accommodative policy anytime soon.\n\nSeema Shah, Chief Strategist at Principal Global Investors said, “The smaller rise in payrolls should at least assuage some concerns around the Fed policy outlook. As we have heard several times in recent days, even a very strong jobs number wouldn’t have caused the committee to formally discuss changing the pace of bond purchases, so today’s number certainly won’t be giving the Fed cause for concern. They will be in no rush to bring forward tapering plans.\"\n\n**Highlights**\n\n* The weak April jobs report catalyzed a rebound in technology names Friday morning, with the disappointing data easing fears that the Federal Reserve will adjust their policies in the near-term.\n* Moderna (MRNA) posted a profit for the first time for Q1 2021, bolstered by revenue brought from the coronavirus vaccine. \n* ROKU and Square (SQ) both gapped up today after blowing past analyst estimates in their earnings report.\n* Amid mounting pressure from antitrust regulators, e-commerce giant Alibaba Group offloaded its entire stake in a real estate trading platform, retreating from a new business for which it once held high hopes.\n* IBM introduced what it says is the world's first 2-nanometer chip making technology. The technology could be as much as 45% faster than the mainstream 7-nanometer chips in many of today's laptops and phones and up to 75% more power efficient, the company said. Read more[ here. ](https://www.reuters.com/technology/ibm-unveils-2-nanometer-chip-technology-faster-computing-2021-05-06/)\n* Pfizer (PFE) and BioNTech (BNTX) submitted an application with the US FDA to approve use of their coronavirus vaccine for individuals 16 and older\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday movement\\*\\***\n* AutoZone (AZO) target raised by UBS Group from $1415 to $1700 at Buy. Stock currently around $1488\n* Adient (ADNT) target raised by Deutshce Bank from $58 to $63 at Buy. Stock currently around $48\n* Avalara (AVLR) target raised by Morgan Stanley from $170 to $175 at Overweight. Stock currently around $124\n* BioCryst Pharmaceuticals (BCRX) target raised by Barclays from $13 to $20 at Overweight\n* BILL target raised by KeyCorp from $165 to $175 at Overweight. Stock currently around $130\n* Builders FirstSource (BLDR) target raised by Barclays from $57 to $68 at Overweight. Stock currently around $52\n* Costco (COST) target raised by Raymond James from $375 to $410 at Outperform. Stock currently around $382\n* Datadog (DDOG) with two very bullish price target raises. Stock currently around $71\n   * Monness Crespi &amp; Hardt from $100 to $103 at Buy\n   * Needham &amp; Co from $141 to $150 at Buy\n* Diodes (DIOD) target raised by Cowen from $95 to $100 at Outperform. Stock currently around $72\n* Expedia Group (EXPE) with three target raises. Stock currently around $165\n   * Credit Suisse from $168 to $198 at Outperform\n   * JPM Securities from $185 to $195\n   * Wells Fargo from $215 to $235\n* FMC target raised by KeyCorp from $133 to $136 at Overweight. Stock currently around $117\n* Floor &amp; Decor (FND) target raised by Barclays from $110 to $125 at Overweight. Stock currently around $113\n* Health Catalyst (HCAT) with three target raises. Stock currently around $51.50\n   * Cantor Fitzgerald from $52 to $60\n   * SVB Leerink from $53 to $59\n   * Raymond James from $56 to $63\n* Moderna (MRNA) with two target raises. Stock currently around $160\n   * Barclays from $178 to $194 at Overweight\n   * Goldman Sachs from $206 to $228 at Buy\n* Planet Fitness (PLNT) target raised by Jefferies Financial Group from $95 to $100 at Buy. Stock currently around $80\n* Square (SQ) with two target raises after blowout earnings report. Stock currently around $235\n   * JP Morgan from $250 to $300 at Overweight\n   * Credit Suisse from $290 to $300 at Outperform\n* Tapestry (TPR) target raised by Robert W Baird from $45 to $54 at Outperform. Stock currently around $47\n\n“It is in your moments of decision that your destiny is shaped.” - Tony Robbins",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, May 7, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/n78nm1/here_is_a_market_recap_for_today_friday_may_7_2021/",
        "created": 1620449492.0
    },
    {
        "author": "LucieiStevenson",
        "created_utc": 1620223319,
        "id": "n5gmnz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I've been poking around on some discussion boards and whatnot, and have been seeing some buzz generated about this company following their recent PR.\n\nDigiCrypts Blockchain Solutiontions (or more commonly known as DigiMax) is a player in the predictive analytics industry. For those of you who like AI and Fintech, these guys are really doing some interesting things. They have a fairly diverse selection of services using their constantly improved predictive AI, and they implement it in a variety of different ways.\n\nSome of their products are as follows\n\n* Cryptodivine - a predictive trend indicator for analyzing patterns in BTC and ETH prices\n* DataNavee - used by business to analyze and predict sales, revenues, and supply chains using machine-learning tech\n* Darwin Ecosystem - used to evaluate and improve a businesses workforce and hiring decisions using PPI (Projected Personality Interpreter)\n\nThe last of those products is actually a result of a partnership with IBM Watson, and seeing a large IP attached to a smaller cap brand like this always gets me excited.\n\nOn May 3rd, they announced an investment into Kirobo, a cryptocurrency solutions developer.  They plan to implement Kirobo's tech of canceling blockchain transfers in future projects related to Cryptodevine. Additionally, they brought a fantastic member onto both company's boards, Brock Pierce, a pioneer in the crypto industry. \n\nThe stock is at $0.235 and after poking around a few boards after the announcement I've seen $0.40 floated around as a target that seems attainable in the near future. I also think that with the booms of AI and Crypto its long-term ceiling can be way higher.\n\nAs always, do your own research, this isn't investment advice.",
        "subreddit": "CanadianInvestor",
        "title": "People have been really excited about DigiCrypts (CSE:DIGI) after their recent announcment.",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n5gmnz/people_have_been_really_excited_about_digicrypts/",
        "created": 1620252119.0
    },
    {
        "author": "AshamedStudent3059",
        "created_utc": 1620415562,
        "id": "n76p6i",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Thoughts on IBM after 2nm chip announcement?",
        "url": "https://www.reddit.com/r/investing/comments/n76p6i/thoughts_on_ibm_after_2nm_chip_announcement/",
        "created": 1620444362.0
    },
    {
        "author": "Nosoulleftinsideme",
        "created_utc": 1620679791,
        "id": "n9fpgv",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I should start off this post by saying, i'm currently balls deep in $IQST and have gotten an absolute ass whooping over the last month but i've done my due diligence and I believe this company has alot to offer. \n\nBasic knowledge for reference:\n\nMKT CAP $83.1 Million\n\nCurrent price \\~60 cents\n\nSo let's start off with the DD, I will be using the bracket point (Bull) or (Bear) respectively to illustrate where I stand on each of the points and how I believe that point impacts the business.\n\n&amp;#x200B;\n\n1.) Insane revenue + Multiple revenue streams all in very interesting fields (Bull)\n\n\\-IQST has pulled in a $44.9 million in the year 2020 &amp; plans to expand that revenue to $60.5 million which I genuinely believe may be a conservative number they made $18mil in 2019 so you can clearly see the revenue is growing at a very rapid pace\n\n\\-This company is involved in high growth areas such as Blockchain,  Technology services (They're into battery solutions and are working on an EV motorbike) + Internet of things, Telecommunications, and FinTech + more\n\n\\-They announced the first production of 2500 units of their Internet of things Award winning Smart Tank to be launched this month (not sure if they have started yet) but this is an additional new source of revenue for the company\n\n\\-This revenue is much higher than companies such as ALPP, and CLSK who are both valued more than 5x what this company is despite showing very low revenue growth relative to this stock.\n\n\\-I can go on and on about this company and it's revenue + revenue streams but im trying to keep this DD relatively short \n\n\\-This company trades at &lt;2x price to revenue \n\n&amp;#x200B;\n\n2.) Customers (Bullish)\n\n\\-This stock has some very high profile customers that are very eye opening on the first glance some of these costumers include: Verizon, IBM, T-Mobile and FLOW, these people being customers is one of the main selling points for me as it shows that this company is able to perform at the highest level and can attract leaders in the telecommunications industry as customers.\n\n&amp;#x200B;\n\n3.) Marketing (Bullish and potentially Bearish) \\*\\*IMPORTANT READ\\*\\*\n\n\\-The thing I like about this stock is that it's always providing updates to it's investors on where each project is going, these updates seem to come weekly and as an investor, it is very nice to see this transparency. \n\n\\-It seems that compared to other stocks anywhere near a similar value, it is much harder to find any information on them and it is a pain to undergo any analysis as you have to do a very deep dive to get information outside of the companies website on them. My personal belief is that due to their expertise in the telecom and marketing departments, they are able to effectively advertise better than most companies valued similarly.\n\n\\-This one is hard for me to write as someone who is invested in the stock, but the bearish point of this marketing is that perhaps it's making things seem better than it really is and this marketing is in hope of a pump in the stocks price. A big problem I see is that alot of the articles I see is that it is sourced from IQST themselves.\n\n4.) Balance Sheet (BEAR)\n\n\\- Arguably the most bearish point of this DD is a TATL &lt; 1, Meaning that this company has more Liabilities than assets which is never a good sign; however, if you pay attention to the company, it is slowly reducing it's liabilities and slightly increasing assets over the last year\n\n5.) Management (Meh)\n\n\\-Not necessarily a Bear point as the managers don't seem to have a bad track record; however, there was nothing that really stood out. Most of the people in this company have years of experience in the telecom business which is their largest department at the moment\n\n\\-Their team also consists of a lot of engineers which I personally like since I am currently studying to become an engineer and engineering CEO's tend to bring in alot more money (although this isn't true for all individual cases)\n\n\\-I like the way that the company is going about diversifying revenue sources in high growth areas but at the same time that is a double edged sword on a company who doesn't have the greatest balance sheet.\n\n\\-For this point I say meh as it can definitely come back to bite the company but I think with the rollout of the smart tank, this early investment can easily pay off heavily.\n\n6.) Price &amp; Price action (BEAR)\n\n\\-As i've stated at the beginning of this DD, this company has been biting me in the ass over the last month or two but this I believe is due to market manipulation from hedgies\n\n\\-The reason I say this is because i've been in this stock for a while and this stock moves   \n\"methodically downwards\" it will have a huge spike up (Like today) then over a while it will slowly sell off and trend downwards then have another huge spike. this i believe is due to naked shorting however I have no proof and I am not saying that I am right with this. Another reason I think hedgies are potentially involved is due to trading bans that limit the volume of trades/day which basically has forced the price even further downwards.\n\n&amp;#x200B;\n\n7.) Conclusion\n\nFew stocks offer the growth potential and such a large diversity into high growth fields as IQST and unlike most speculation stocks, this stock has proven and continues to prove that it can make money and has quite a few catalysts coming very soon. The only problem is it's margins which should improve within the next year or two &amp; a bad balance sheet. They also plan on uplisting to a higher OTC market/ NASDAQ which should help the price alot. On the flipside, the stock has been been absolutely slashed as of recently and is definitely a high risk play. I'm personally invested on a DCA of 96 cents. Let me know what you guys think about my first DD!\n\nTLDR; Ez 10 bagger under good conditions, portfolio wiper under bad but good outweighs bad imo",
        "subreddit": "wallstreetbets",
        "title": "IQSTEL DD ($IQST) a Penny Stock with Serious growth potential",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9fpgv/iqstel_dd_iqst_a_penny_stock_with_serious_growth/",
        "created": 1620708591.0
    },
    {
        "author": "mostwant3d1",
        "created_utc": 1620852163,
        "id": "nayvhw",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I just stumbled upon a random guy on internet that said that he lives in Basel (switzerland) where Palantir is curently looking for salesforce. He mentioned that some of the biggest healthcare companies in the world are located in Basel. Connecting the dots.. \"Palantir hires former IBM Watson Health exec as its first US government chief medical officer\" combined with partnership with Ringier which is also located in Switzerland. Is it just me or its starting to get interesting. :) also i googled the CEO of Ringier, mr. Marc Walder and from his great professional acomplishments i would love to point out this: \"In 2008, Marc Walder completed the Advanced Executive Management Program at Harvard Business School in Boston. Marc Walder is a member of the Federal Council’s Advisory Council on Digital Transformation. He is also the founder of the digitalswitzerland initiative, which brings together more than 130 of the largest Swiss companies and institutions to promote digital development and the digital transformation of Switzerland.\" this sounds beyond amazing to me.\n\n🚀🚀🚀\n55$ PLTR EOY ez money",
        "subreddit": "wallstreetbets",
        "title": "Fresh and new pltr dd... currently holding heavy bags avg cost 26.50",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nayvhw/fresh_and_new_pltr_dd_currently_holding_heavy/",
        "created": 1620880963.0
    },
    {
        "author": "Nosoulleftinsideme",
        "created_utc": 1620707567,
        "id": "n9oux9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nI should start off this post by saying, i'm currently balls deep in $IQST and have gotten an absolute ass whooping over the last month but i've done my due diligence and I believe this company has alot to offer.\n\nBasic knowledge for reference:\n\nMKT CAP $83.1 Million\n\nCurrent price \\~60 cents\n\nSo let's start off with the DD, I will be using the bracket point (Bull) or (Bear) respectively to illustrate where I stand on each of the points and how I believe that point impacts the business.\n\n1.) Insane revenue + Multiple revenue streams all in very interesting fields (Bull)\n\n\\-IQST has pulled in a $44.9 million in the year 2020 &amp; plans to expand that revenue to $60.5 million which I genuinely believe may be a conservative number they made $18mil in 2019 so you can clearly see the revenue is growing at a very rapid pace\n\n\\-This company is involved in high growth areas such as Blockchain, Technology services (They're into battery solutions and are working on an EV motorbike) + Internet of things, Telecommunications, and FinTech + more\n\n\\-They announced the first production of 2500 units of their Internet of things Award winning Smart Tank to be launched this month (not sure if they have started yet) but this is an additional new source of revenue for the company\n\n\\-This revenue is much higher than companies such as ALPP and Can't aLlow Stock talK (for some reason the ticker symbol isn't allowed on wsb so just filter with capitals) who are valued more than 5x what this company is despite showing very low revenue growth relative to this stock.\n\n\\-I can go on and on about this company and it's revenue + revenue streams but im trying to keep this DD relatively short\n\n\\-This company trades at &lt;2x price to revenue\n\n&amp;#x200B;\n\n2.) Customers (Bullish)\n\n\\-This stock has some very high profile customers that are very eye opening on the first glance some of these costumers include: Verizon, IBM, T-Mobile and FLOW, these people being customers is one of the main selling points for me as it shows that this company is able to perform at the highest level and can attract leaders in the telecommunications industry as customers.\n\n\\&amp;#x200B;\n\n3.) Marketing (Bullish and potentially Bearish) \\*\\*IMPORTANT READ\\*\\*\n\n\\-The thing I like about this stock is that it's always providing updates to it's investors on where each project is going, these updates seem to come weekly and as an investor, it is very nice to see this transparency.\n\n\\-It seems that compared to other stocks anywhere near a similar value, it is much harder to find any information on them and it is a pain to undergo any analysis as you have to do a very deep dive to get information outside of the companies website on them. My personal belief is that due to their expertise in the telecom and marketing departments, they are able to effectively advertise better than most companies valued similarly.\n\n\\-This one is hard for me to write as someone who is invested in the stock, but the bearish point of this marketing is that perhaps it's making things seem better than it really is and this marketing is in hope of a pump in the stocks price. A big problem I see is that alot of the articles I see is that it is sourced from IQST themselves.\n\n4.) Balance Sheet (BEAR)\n\n\\- Arguably the most bearish point of this DD is a TATL &lt; 1, Meaning that this company has more Liabilities than assets which is never a good sign; however, if you pay attention to the company, it is slowly reducing it's liabilities and slightly increasing assets over the last year\n\n5.) Management (Meh)\n\n\\-Not necessarily a Bear point as the managers don't seem to have a bad track record; however, there was nothing that really stood out. Most of the people in this company have years of experience in the telecom business which is their largest department at the moment\n\n\\-Their team also consists of a lot of engineers which I personally like since I am currently studying to become an engineer and engineering CEO's tend to bring in alot more money (although this isn't true for all individual cases)\n\n\\-I like the way that the company is going about diversifying revenue sources in high growth areas but at the same time that is a double edged sword on a company who doesn't have the greatest balance sheet.\n\n\\-For this point I say meh as it can definitely come back to bite the company but I think with the rollout of the smart tank, this early investment can easily pay off heavily.\n\n6.) Price &amp; Price action (BEAR)\n\n\\-As i've stated at the beginning of this DD, this company has been biting me in the ass over the last month or two but this I believe is due to market manipulation from hedgies\n\n\\-The reason I say this is because i've been in this stock for a while and this stock moves  \n\"methodically downwards\" it will have a huge spike up (Like today) then over a while it will slowly sell off and trend downwards then have another huge spike. this i believe is due to naked shorting however I have no proof and I am not saying that I am right with this. Another reason I think hedgies are potentially involved is due to trading bans that limit the volume of trades/day which basically has forced the price even further downwards.\n\n\\&amp;#x200B;\n\n7.) Conclusion\n\nFew stocks offer the growth potential and such a large diversity into high growth fields as IQST and unlike most speculation stocks, this stock has proven and continues to prove that it can make money and has quite a few catalysts coming very soon. The only problem is it's margins which should improve within the next year or two &amp; a bad balance sheet. They also plan on uplisting to a higher OTC market/ NASDAQ which should help the price alot. On the flipside, the stock has been been absolutely slashed as of recently and is definitely a high risk play. I'm personally invested on a DCA of 96 cents. Let me know what you guys think about my first DD!\n\nTLDR; Ez 10 bagger under good conditions, portfolio wiper under bad but good outweighs bad imo",
        "subreddit": "wallstreetbets",
        "title": "$IQST DD. Penny stock with major upside potential.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9oux9/iqst_dd_penny_stock_with_major_upside_potential/",
        "created": 1620736367.0
    },
    {
        "author": "ModernBuddha1",
        "created_utc": 1620489896,
        "id": "n7sces",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "since blackberry's partnership with Amazon in December 2020 they have released about 30 big news. Starting from blackberry security being certified by NSA and Department of defense info network(this is big!!). They are also the foundation software for Baidu Appolo car platform(will be in every chinese car). \n\nAfter every news release the stock goes red. Convince me why it's not manipulation? \n\nBlackberry only security company's whose clients were not impacted by solarwind/msft hack: the stock dropped\n\nIBM ditched their own security and agreed to sell Blackberry security in Canada: The stock dropped\n\nBlackberry approved by NSA as the most secure solution: The stock dropped\n\nBlackberry in 70% of EV cars: The stock dropped\n\nBlackberry to become biggest car data analytic platform in partnership with AWS: The stock dropped\n\nBlackberry sign multi year agreement to secure ENTIRE Canada Government: The stock dropped\n\nBlackberry QNX only OS that can secure connected car: The stock dropped\n\nBlackberry secures 500 million endpoints: The stock dropped\n\nBlackberry integrated artificial intelligence security in all their products and car OS: the stock dropped\n\n&amp;#x200B;\n\nIf this is not manipulation then what is? Why hasn't the SEC taken action to crack down on citadel who short stocks without owning it, naked selling basically?",
        "subreddit": "wallstreetbets",
        "title": "Blackberry stock manipulation, Citadel, SEC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n7sces/blackberry_stock_manipulation_citadel_sec/",
        "created": 1620518696.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1620333220,
        "id": "n6gxmv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, May 6, 2021**\n\nRemarkably, despite many individual companies pulling back steeply today, the three major indexes finished the day positive, driven by gains in financial stocks and stability in mega-caps. Growth stocks and more speculative plays have been hit hard by a combination of inflationary fears and recent suggestions by monetary officials that the interest rate should be raised. The S&amp;P 500 (SPY) closed the day 0.81%, less than 1% below it’s record high. The Dow Jones (DIA) recorded a new intraday record while the Nasdaq (QQQ) closed 0.76%. Market participants continue to monitor commentary from monetary officials, ongoing earnings season, and new economic data, particularly the April Jobs Report set for release tomorrow morning.\n\nAfter reclaiming the leadership in April as the best performing sector in the SPY, so far in May we have seen investors rotate out of big tech stocks and into financial stocks, with many big banks pushing all-time highs today. Market participants are worried that a suggested raise in interest would affect the already stretched valuation of some companies. Given the rally the market saw in April, some analysts are worried that positive catalysts for equities are getting harder to achieve and may be running out. The economy in the US is recovering faster than initially predicted by analysts, with this earnings season seeing 86% of companies in the S&amp;P 500 that have reported earnings  beat estimates, according to data from FactSet. \n\nTreasury Secretary Janet Yellen suggested that interest rates may need to rise in the near-term to prevent the economy from overheating, with the recent economic data and corporate earnings showing economic activity recovering much faster than expected as effective distribution of the vaccine in the US allows states to gradually reopen. Yellen said, “It may be that interest rates will have to rise somewhat to make sure that our economy doesn't overheat, even though the additional spending is relatively small relative to the size of the economy. It could cause some very modest increases in interest rates to get that reallocation, but these are investments our economy needs to be competitive and to be productive. I think our economy will grow faster because of them.\" In later remarks, she added that raising rates was not something she was predicting or recommending and that the decision ultimately rests with the Federal Reserve. She said, “Let me be clear, that’s not something I’m predicting or recommending. If anybody appreciates the independence of the Fed, I think that person is me.”\n\nThe Labor Department will release its April jobs report on Friday, which is expected to show a staggering nearly 1 million payrolls came back last month, accelerating March’s gain. As a reminder, in March, the Department of Labor reported nonfarm payrolls increased by 916,000 for the month while the unemployment rate fell to 6% (unemployment rate was 14.6% in April 2020). Economists surveyed by Dow Jones had been looking for an increase of 675,000 and an unemployment rate of 6%.\n\n**Highlights**\n\n* Weekly unemployment claims fell to 498,000 last week—a new low since the Covid-19 pandemic began more than a year ago. The four-week average of initial claims is also at the lowest point since the pandemic began. Read more [here](https://www.wsj.com/articles/weekly-jobless-claims-coronavirus-05-06-2021-11620247798).\n* The Bank of England upped their growth estimates for the economy of the UK, anticipating GDP will grow 7.25% in the country, up from its forecast for 5% growth in February. The BOE also now sees inflation averaging 2.5% in 2021, up from its prior forecast for 2%, but said the rise in price pressures will likely be \"temporary.\" \n* NIO announced the company will expand into Norway, with the group’s first service and delivery center set to open in the capital Oslo in September.\n* A lot of stocks pulled back despite posting better than expected earnings. The market is very narrow right now, with gains concentrated in the financials, energy, and mega-caps.\n* IBM introduced what it says is the world's first 2-nanometer chip making technology. The technology could be as much as 45% faster than the mainstream 7-nanometer chips in many of today's laptops and phones and up to 75% more power efficient, the company said. Read more[ here. ](https://www.reuters.com/technology/ibm-unveils-2-nanometer-chip-technology-faster-computing-2021-05-06/)\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes.\\*\\***\n* Agio Pharmaceuticals (AGIO) target raised by Canaccord Genuity from $57 to $65 at Buy. Stock currently around $53\n* Allegro MicroSystems (ALGM) target raised by Mizuho from $35 to $38 at Buy. Stock currently around  $25.\n* Amazon (AMZN) with a host of target raises. Consensus price target $4150 at Buy. Stock currently around $3270\n* Booking (BKNG) with two target raises. Stock currently around $2338\n   * Deutsche Bank from $2600 to $2665 at Buy\n   * Barclays from $2710 to $2740 at Buy\n* Burlington Stores (BURL) target raised by Morgan Stanley (MS) from $317 to $385 at Overweight. Stock currently around $327\n* CareDX (CDNA) target raised by Piper Sandler from $93 to $100 at Overweight. Stock currently around $73\n* Comcast (CMCSA) with two target raises. Stock currently around $56\n   * Goldman Sachs from $62 to $64 at Buy\n   * Raymond James from $61 to $63 at Outperform\n* Caesars Entertainment (CZR) target raised by KeyCorp from $110 to $125 at Overweight. Stock currently around $102\n* Dell Technologies (DELL) target raised by Morgan Stanley from $120 to $127 at Overweight. Stock currently around $103\n* DexCom (DXCM) with three target raises. Stock currently around $366\n   * Raymond James from $449 to $466 \n   * Canaccord Genuity from $445 to $455\n   * Citigroup from $480 to $488\n* Equitable (EQH) target raised by Morgan Stanley from $44 to $45 at Overweight. Stock currently around $35\n* Floor &amp; Decor (FND) target raised by Wedbush from $110 to $130 at Outperform. Stock currently around $113\n* Gilead Sciences (GILD) target raised by SVB Leerink from $72 to $74 at Outperform. Stock currently around $66.5\n* General Motors (GM) with three target raises. Stock currently around $57.5\n   * Barclays from $64 to $66 \n   * Royal Bank of Canada from $67 to $72 \n   * Deutsche Bank from $67 to $70 \n* HubSpot (HUBS) with four target raises. Stock currently around $503\n   * Needham &amp; Co from $520 to $600 \n   * Piper Sandler from $600 to $615\n   * Morgan Stanley from $567 to $605\n   * BMO Capital Markets from $565 to $585\n* InMode (INMD) with two target raises. Stock currently around $81\n   * Canaccord Genuity from $80 to $95 at Buy\n   * Robert W Baird from $84 to $104 at Outperform\n* JP Morgan (JPM) target raised by Wells Fargo from $190 to $195 at Overweight. Stock currently around $157\n* Mastercard (MA) with two target raises. Stock currently around $369\n   * Mizuho from $430 to $435 at Buy\n   * Jefferies from $440 to $450 at Buy\n* McDonald's (MCD) with a host of target raises. Consensus price target $260 at Outperform. Stock currently around $235\n* NuVasive (NUVA) with two target raises. Stock currently around $70\n   * Piper Sandler from $75 to $80 at Overweight\n   * Needham &amp; Co from $70 to $80 at Buy\n* OSI Systems (OSIS) with two target raises. Stock currently around $95\n   * B. Riley from $104 to $118 at Buy\n   * Roth Capital from $108 to $122 at Buy\n* Paypal (PYPL) with a host of target raises. Consensus price target at $320 at Overweight. Stock currently around $247\n* UBER target raised by Deutsche Bank from $82 to $85 at Buy. Stock currently around $48. Gig-economy stock has been hammered by recent talks from the Secretary of Labor in the US\n\n“Patience is not simply the ability to wait – it’s how we behave while we’re waiting.” – Joyce Meyer",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, May 6, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/n6gxmv/here_is_a_market_recap_for_today_thursday_may_6/",
        "created": 1620362020.0
    },
    {
        "author": "Websters_invester",
        "created_utc": 1621196621,
        "id": "ndx2ox",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "There is a small tech firm located in Bay Area that is trading for $3 a share and has over 1 billion from fidelity abd 665 million from vanguard. This company has  contracts with apple, and is said to create 50k jobs. I cannot figure out who this company is.  I do know he is responsible for the chassies and what’s inside the computers from intel, ibm, samsung, Microsoft.",
        "subreddit": "investing_discussion",
        "title": "Researching upcoming revolutionary investments",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ndx2ox/researching_upcoming_revolutionary_investments/",
        "created": 1621225421.0
    },
    {
        "author": "FranciscoLemosWy",
        "created_utc": 1622493057,
        "id": "npcmln",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "(CSE:DIGI), (OTC: DBKSF)\n\nWith Digicyrypts recently officially rebranding itself to DigiMax recently I thought it would be a great time to share some DD and overall a brief summary of what these guys are doing and why I like them so much. So without further ado...\n\nDigimax is a Canadian company that focuses on AI and predictive tech. They have got a great team behind them and have several different services that they offer using this advanced technology. These services stretch into several sectors like financial, HR, crypto, and logistics, and all use a similar, constantly improving AI engine. Personally, I'll never get over just how cool AI as a concept is, what once seemed to be the stuff of sci-fi films is now very much so a reality. This engine is extremely effective at completing different types of analysis and predicting trends without the need for human influence or intervention.\n\nTheir first service I want to highlight is DataNavee. This is an engine for commercial business use and helps analyze trends in several factors associated with running a large or small business. These factors and indicators include sales, revenues, and supply chain quantities, all figures that are key to running a smooth business. DataNavee takes companies existing figures and extrapolates and interprets them allowing business owners to choose the best course of action based on the AI's highly advanced projections.\n\nFor anyone who is a big fan of crypto investments, they have their Crypto tracking and predicting service known as Cryptodivine. Once again using an advanced AI, it is able to track the prices and trends of Bitcoin and Etherium and make projections about future fluctuations. This service, in particular, is getting a huge improvement in the near future as Digimax brought on Delphi Anlaytics' crypto division to improve the accuracy of analysis and add other cryptocurrencies. This service generates SAAS revenue and has seen some impressive demand. In the same vein as crypto, they also look to open their own crypto fund which will be supported by their acquisitions of Kirobo and Barberton Fund this year.\n\nI am super impressed with the different revenue streams DigiMax and I still haven't even mentioned Darwin Ecosystem, a system that uses a projected personality interpreter to make hiring decisions. This particular project was made with IBM Watson and is currently used by 17 law enforcement agencies.\n\nWith the upcoming summer launch of their Crypto fund along with advancements in their other projects, DigiMax is looking to take the tech world by storm and offer industry-topping services. While this may be a big vision for a company with a $0.20 stock price, I definitely think it's within the realm of what's possible and for that reason, they are on my list!\n\nDisclaimer: DO YOUR OWN RESEARCH, this ain't investment advice!",
        "subreddit": "investing_discussion",
        "title": "Your going to want to check out AI company DigiMax",
        "url": "https://www.reddit.com/r/investing_discussion/comments/npcmln/your_going_to_want_to_check_out_ai_company_digimax/",
        "created": 1622521857.0
    },
    {
        "author": "Cashuking",
        "created_utc": 1621038111,
        "id": "ncmsze",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "It is astounding, absurd (makes me mad to see people taken advantage of.) Now especially in this f’ckd up society because of the so-called, free money; our next generation &amp; theirs will pay for our greed &amp; stupidity. I say this because I see &amp; deal with so many good people that are led down a trap of manipulation because they follow the same big names everyone else &amp; CNBS does, as well as FOMO &amp; now how the media giants (people don’t realize, but they control the U.S. &amp; are the largest Hedges &amp; MM), &amp; now how they are using social media to get their leads as wells as being able to trade algorithmically w/their computers trading faster than we can, &amp; by the time we get to what we think is a great opportunity trade, most of the liquidity as already been sucked out of the stock.\n\nI really don’t know the best way to get everyone involved without media, because once a reporter gets any kind of info, they would rather settle for Ramen than steak(if that makes sense)\n So, for this to work, and it will, but we must get past the fact that the majority of us ever thinks of their future, they only think of ‘here &amp; now.’ The “future-self” is a stranger to us. We need to think psychologically different - changing our behavior. \n\nAs for us, Variant Times, we look for equities anywhere from six months to 10 years. A lot of people don’t, &amp; that is our edge. Majority of the people are traders because of Covid. That’s not to be ashamed of, but that is also something we all need to be extra careful of. Of such, traders sketchily fit into area of gambling. \n\nHowever we try to provide stocks that are worthy to invest in. And it’s crazy because CNBC &amp; the vast majority of all of us are all distracted! Our focus is smudged with tweets from millionaires &amp; Pompers playing God getting completely buzzed off the feeling. Imagine the “high.” It would be most powerful than any drug. \nWe, by human nature “trust” by  design. It’s who we are &amp; necessary for life. \n\nEveryday, we are drawn powerfully to the “quick rich scheme” that has been around since life began. Sadly, Life wouldn’t be worth living, if you “really think hard about it” if fraud &amp; deceit did not exist. However; that doesn’t mean we need to fall victim or be the aggressor.\n\nInvesting in B!+coin for instance...blah! What is the technology behind it that make is so efficient? Can you really imagine a coin with a picture or mascot of a dog being “even slightly serious enough for the world to accept D-OGE?” Come on... However; I can imagine the same token &amp; “blockchain” technology used to transfer equities and how blockchain will be everywhere in everything that exchanges any important information institutionally or privately.\n\nImagine, for ANY SECTOR of the market or stock, or company to continue to exist, technology will need to be evolved within their structure. More than 93% of the market will be technology stocks, just like people are confused about TESLA being a car company or a Tech company.\n\nMANY companies will go bankrupt &amp; will completely surprise the hell out of all of us; even the largest &amp; existing today that people think would never fail. \n\nAs it IS ALWAYS TRUE. One will have success, but that success has its time in existence. It is timed...IT WILL NEVER LAST, but it can continue its prolonged existence “if” it is able to “change” in the whatever “variant (changing) times” we live in; hence our name: Variant Times\n\nWe focus on the most disruptive innovations that will change how the world operates. Technology, as we know it to be surprising &amp; unwelcome at first met with much resistance &amp; rhetoric.\n\nSure, they’ll be a few legacy companies that’ll continue to exist, but for that reason, they will need to adopt changing their current business models. \n       These companies will be the companies that have the huge capital (and interestingly enough to say...so many of them exist today ...right now!\n\nThink of the many Co.s in the form of blank check or SPAC  Aquisition Firms just “waiting to get their hands in the next technology breakthrough. Legacy companies such as IBM, Alphabet, Apple - many will adopt the changes, but it is because of their high capital &amp; wealth established ready to buy these small-cap companies, penny stock companies, &amp; those companies that are in early the stages of disruptive technology. \n\nThat..is where investors should focus (our) time, and (help) each other do our due-diligence. \nInterestingly, this will ‘satisfy’ the short term trader as well, &amp; investor as “chatter” about new companies comes to light; and to our favor, it will be those who invest early, even in those companies with poor balance-sheets, because it doesn’t take much for a “Reddit-like” stock push to send the company in the range of “acquisition” or purchasing the necessary shares back. \n\nThis indeed we will see millions of millionaires along the way as this age in history “can” be the most wealthy and prosperous ‘era’ than any generation that has or will come to to realize.",
        "subreddit": "wallstreetbets",
        "title": "(3-4min read) How to Invest &amp; Win Against Manipulation &amp; What to Really Invest In a World of Tweets &amp; Tats of the Celebs playing God",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ncmsze/34min_read_how_to_invest_win_against_manipulation/",
        "created": 1621066911.0
    }
]