[
    {
        "author": "diddycarter",
        "created_utc": 1625259392,
        "id": "ocj9ju",
        "num_comments": 679,
        "num_crossposts": 0,
        "selftext": "[S&amp;P 500 rises for a 7th straight day after strong jobs report, best winning streak in 10 months (cnbc.com)](https://www.cnbc.com/2021/07/01/stock-market-open-to-close-news.html)\n\n&gt;Stocks rose on Friday and the S&amp;P 500 hit another record high after the June jobs report showed an accelerating recovery for the U.S. labor market.  \n&gt;  \n&gt;The broad market index rose 0.75% to 4,352.34, while the tech-heavy Nasdaq Composite climbed 0.81% to notch its own record at 14,639.33. The Dow Jones Industrial Average added 152.82 points to close at 34,786.35. The S&amp;P 500 has now risen for seven consecutive sessions, its longest winning streak since August.  \n&gt;  \n&gt;Solid moves by major tech stocks helped support the overall market on Friday, with shares of Apple and Salesforce rising by nearly 2% and 1.3%, respectively. Microsoft jumped 2.2%.  \n&gt;  \n&gt;For the week, the Nasdaq Composite rose nearly 2%, while the S&amp;P 500 and Dow climbed 1.7% and 1%, respectively. Several sectors closed at record levels on Friday, including tech and health care.  \n&gt;  \n&gt;The strong week on Wall Street was spurred by a string of solid economic reports, capped by a better-than-expected jobs report on Friday morning.  \n&gt;  \n&gt;The economy [added 850,000 jobs last month](https://www.cnbc.com/2021/07/02/jobs-report-june-2021.html), according to the Bureau of Labor Statistics. Economists surveyed by Dow Jones were expecting an addition of 706,000. The print topped the revised 583,000 jobs created in May.  \n&gt;  \n&gt;“This is a strong report and should be taken as a sign of things to come for an accelerating labor market,” Aberdeen Standard Investments deputy chief economist James McCann said in a note.  \n&gt;  \n&gt;Angelo Kourkafas, an investment strategist at Edward Jones, said that the report showed solid growth but wouldn’t change the Fed’s policy path, hitting a sweet spot for markets.  \n&gt;  \n&gt;“I think it was one of these goldilocks-type of reports, because hiring accelerated -- which is a positive sign for the second half and the recovery -- but not so much that it would trigger a reaction of an accelerated timeline for the Federal Reserve to start tapering,” Kourkafas said.  \n&gt;  \n&gt;In addition to the job gains, average hourly wages rose 0.3% for the month and are up 3.6% year over year, matching expectations.  \n&gt;  \n&gt;Goldman Sachs chief economist Jan Hatzius said that the report eased concerns about a labor shortage.  \n&gt;  \n&gt;“I think we also learned that the explanations for the weaker numbers from April and May -- namely that seasonal probably weighing on job growth and probably some impact from the unemployment benefits on labor supply -- that those were pretty good explanations. So I think it was reassuring, in that sense,” Hatzius said on CNBC’s “[Squawk on the Street](https://www.cnbc.com/squawk-on-the-street/),” adding that the unemployment rate coming in higher than expected showed that the recovery still had a long way to go.  \n&gt;  \n&gt;The S&amp;P 500 has now risen in five of the past six weeks, while the Nasdaq has gained in six of the past seven weeks.  \n&gt;  \n&gt;Even with the recent strength for stocks, market strategists say that uncertainty about the future of the Fed’s asset purchases and the upcoming earnings season could keep stocks from making major gains in the near term.  \n&gt;  \n&gt;“The market is still very much concerned about the Fed’s reaction function,” said Max Gokhman, head of asset allocation at Pacific Life Fund Advisors, adding that he thought there was still a lot of slack in the labor market.  \n&gt;  \n&gt;One weak spot for the markets this week was small caps, as the Russell 2000 slipped 1% on Friday to finish negative for the week.  \n&gt;  \n&gt;On Friday, shares of Boeing fell 1.3%, weighing on the Dow, after a 737 cargo plane made an [emergency landing off the coast of Honolulu](https://www.cnbc.com/2021/07/02/boeing-cargo-plane-makes-emergency-landing-in-ocean-off-honolulu-coast-faa-says.html?utm_term=Autofeed&amp;utm_medium=Social&amp;utm_content=Main&amp;utm_source=Twitter#Echobox=1625234441). IBM’s stock fell 4.6% after the company [announced that president and former Red Hat CEO Jim Whitehurst was stepping down](https://www.cnbc.com/2021/07/02/ibm-president-jim-whitehurst-steps-down-after-red-hat-deal.html?utm_term=Autofeed&amp;utm_medium=Social&amp;utm_content=Main&amp;utm_source=Twitter#Echobox=1625240953).  \n&gt;  \n&gt;The U.S. markets will be closed on Monday for the July 4 holiday.z",
        "subreddit": "investing",
        "title": "S&amp;P 500 rises for a 7th straight day after strong jobs report, best winning streak in 10 months",
        "url": "https://www.reddit.com/r/investing/comments/ocj9ju/sp_500_rises_for_a_7th_straight_day_after_strong/",
        "created": 1625288192.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1626977475,
        "id": "opjjx7",
        "num_comments": 244,
        "num_crossposts": 0,
        "selftext": "Palantir is an American software company that specializes in big data analytics, with a market cap of 43 billion. They started building software for the intelligence community in the US to assist in counterterrorism investigations by helping them identify patterns hidden deep within large data sets. Later, they realized that similarly to the intelligence community, commercial institutions did not have the most effective tools to manage and make sense of the data involved in large projects. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/9fvuzczr1tc71.png?width=1236&amp;format=png&amp;auto=webp&amp;s=3b5c0be5fc4da1a37bbbbfdfc8893617d005ee3e\n\nAny large scale company or business will always collect a ton of data most often stored in texts such as spreadsheets or databases (which requires programming knowledge to navigate through). A common issue large companies have is simply having too much data. Palantir creates software that consolidates a company's data and displays it in a comprehensible, easily digestible user interface for the company to use. This allows Palantir to work with companies/organizations like the CDC for medicine, the military for national security, etc. \n\nWith Palantir, a normal non-technical operator can click their computer to pull up an order, or an issue that Palanrie detected, make any changes and or notify whoever needs the attention. Let's take the CDC for example. When the vaccine rolled out, Palantir had a huge hand in this. Palantir gives a visual display of where the vaccine is going, how many, and any issues that have risen (if any), allowing for fast response time. For example, Palantir could display a map with the various routes to different deployment sites with pictures of a little truck representing the shipments being routed to their destination. An operator could click one of these shipments/routes and pull up any data of that specific point. With data being displayed and organized in this way it makes it easy to analyze data, where things are going, and what kind of picture the data represents, rather than staring at a spreadsheet of numbers. This is just one example, Palantir is customizable enough where it can represent any business/organization's structure.\n\nPalantir’s revenue streams consist of their two main software: [Gotham](https://www.palantir.com/palantir-gotham/), which was designed primarily for the defence and intelligence sector, and [Foundry](https://www.palantir.com/palantir-foundry/) for the commercial sector. However, the platforms are not exclusive to either sector. For example, Gotham is also offered to commercial customers in the financial services industry. The two platforms can either be used separately or bundled together as a single ecosystem. Currently, revenue is more or less evenly split between the government and commercial sectors. \n\nGotham’s main tools include:\n\nGaia – lets users plan, execute, and report on operations via a shared live map. Live maps track real-time data and users drag and drop objects from other Gotham applications directly into Gaia.\n\nDossier – is a live collaboration document editor to share analysis and discover intelligence. Users can collaborate across teams and organizations to create a living, interactive, and up-to-date document.\n\nVideo – an application designed to interact with both streaming and historical video data. Users can review video footage in the platform as well as enhance raw footage with geospatial information and overlays based on other data sources.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q927qfws1tc71.png?width=1242&amp;format=png&amp;auto=webp&amp;s=aaaf57a3db79d3446b09c24f5205bc918159d4e1\n\nFoundry’s main tools include:\n\nContour – enables exploration of large-scale data. Users can filter, join, and visualize datasets to answer analytical questions and publish the results as a report or new dataset that will automatically update with the underlying datasets.\n\nObject Explorer – allows users to interact with data represented as objects – like customers, equipment, or plants – rather than rows in a table.\n\nAs we know, Palantir started in the defence and intelligence space. This required Palantir to have elite-level security from the start. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This was no easy feat, however, Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has IL-5 clearance with the Department of Defense, which makes them 1 of 4 software companies with this level of clearance, alongside Oracle, Salesforce, and SAP (Google and Snowflake have IL-2 clearance). It has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of classified information.\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology is and should provide ease of mind to companies that they are in business with.",
        "subreddit": "wallstreetbets",
        "title": "Palantir - A long Term Winner",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/opjjx7/palantir_a_long_term_winner/",
        "created": 1627006275.0
    },
    {
        "author": "Lost-Guarantee229",
        "created_utc": 1625150253,
        "id": "obn698",
        "num_comments": 227,
        "num_crossposts": 0,
        "selftext": "**Valuation: Undervalued**\n\n***$PLTR – Palantir Technologies Inc Investment Summary:***\n\n· Recently, there has been a lot of excitement around Palantir, however, very few people actually understand what they do and how they operate. As a result of this I have decided to take on the task of trying explain exactly what Palantir does and why they could be the best undervalued stock to buy now.\n\no I am no data engineer, so this article contains my interpretations of what Palantir does, some of my interpretations may be off, so I would appreciate any helpful comments to clear some things up that I may have got wrong.\n\n· Based on the comparable analyses that I underwent, Palantir is currently an undervalued stock and represents a great opportunity for a long-term hold.\n\no The length of time that I plan on holding is subject to change due to their future financial reports, and any news that may come out.\n\n· It is very hard to say what the upside potential of an investment into Palantir is, which is why my investment plan (found in the “plan” section) is different than usual.\n\no There are various risks to this investment (like there are to every investment), these risks are highlighted near the end of this report under the “risks” section.\n\no Additionally, there are also multiple different catalysts that can help Palantir’s share price, both in the short and long term(s). These catalysts are listed at the end of this report.\n\n***Overview of Palantir as a Company:***\n\n[$PLTR - Palantir Technologies Inc.](https://utradea.com/stocks/PLTR) was founded in 2003 (after their fear/anger after the events observed through 9/11) and started building their software primarily for government institutions and intelligence to assist in counterterrorism by any means possible. At this point in time, Palantir’s only source of revenue was through secretive government contracts.\n\nHowever, since that point in time, Palantir has expanded their operations into commercial enterprises, as they noticed a lot of similarities and overlaps with their applications. Now, Palantir’s revenue comes from both Government Contracts and Commercial Enterprise Contracts.\n\n*Palantir has 2 main software platforms, Palantir “Gotham”, and Palantir “Foundry”.*\n\n[**Palantir Gotham**](https://www.palantir.com/palantir-gotham/) was their first software platform and was designed for defense/intelligence use cases. Palantir has stated that this kind of platform helps agencies find “needles in thousands of haystacks”. They also noted that [Gotham helped soldiers in Iraq and Afghanistan](https://www.palantir.com/wp-assets/wp-content/uploads/2014/03/Impact-Study-Palantir-Defense-During-Drawdown.pdf) to map networks of bomb makers and insurgents through deep/hidden patterns and datasets, helping the army save time and lives. Since this mission, Gotham has expanded into defense operations and mission planning. During this time, Palantir found that Gotham could also be applied in Airbus’ business, as their planes require millions of parts, assembled in multiple factories in different countries. However, Palantir decided to make another software platform that is better tailored to commercial enterprises, this platform was labelled “Palantir Foundry”.\n\n[**Palantir Foundry**](https://www.palantir.com/palantir-foundry/) transforms the way in which organizations interact with their information by creating a central operating system for their data. Palantir enables their customers to construct their own models quickly and easily from countless sets of data points.\n\nPalantir software is used by their 139 Government and Commercial Institutions/enterprises, in over 40 industries, ranging over 150 countries. Palantir works with the US Government and their several allies abroad, as well as the worlds most important/reliable companies.\n\nLastly, Palantir has stated “We are not in the business of collecting, mining, or selling data. We build the software that enable our customers to integrate their own data that they already have.”\n\n***Everything you need to know about Palantir and $PLTR:***\n\n*Palantir Foundry:*\n\nFoundry is essentially a [data warehouse](https://panoply.io/data-warehouse-guide/the-difference-between-a-database-and-a-data-warehouse/) that helps their commercial customers to collect and analyze their data. Foundry’s platform includes a [graphical data interface](https://www.omnisci.com/technical-glossary/graphical-user-interface) that is extremely user friendly allowing their customers to get the most out of their data. Furthermore, Foundry provides statistical analyses through the use of their [AI machine learning](https://www.palantir.com/solutions/ai-ml/) networks that are able to consistently deliver efficient and accurate results.\n\nFoundry helps to enables all of their users, regardless of their technical abilities, to work meaningfully and act with the data that they collect. Foundry provides a suite of applications that help combine data analytics and business logic, helping them to deliver superior data integration.\n\nFoundry’s front-end (what the user sees) enables their users to take advantage of all of the data collected by their organization to make informed decisions. Foundry also has a fantastic application for inter-organizational collaboration, this helps a team to build on each others work.\n\n*Foundry brings all of an enterprises data together onto their platform, however there are access controls in place to define what individuals get control over which dataset(s). From there, Foundry is able to deliver advanced analytics through their machine learning and AI systems to get the most value out of a company’s data, make quality insights, so that their clients can gain a competitive advantage.*\n\n**Foundries potential use cases are almost infinite.**\n\n*Palantir Gotham:*\n\nDubbed “The Operating System for Government Decision Making”, Gotham helps to improve and accelerate decisions across all levels of Government operations.\n\nGotham is primarily used by the defense and intelligence sections of the Government, to help them find what they are looking for. Gotham collects data from millions of different sources and combines it all into one platform to identify hidden patterns and bring all of this data to life. This allows their users to access this data and manage their operations to execute real-world responses to threats that Gotham identifies. Gotham is becoming a main data solution across various different government agencies.\n\nThere is not too much information that is publicly known about the actual uses of Gotham, which makes sense due to the secretive nature of the organizations that they are in business with. However, what we do know is that these organizations have re-signed contracts with Palantir, which helps us to be confident that this platform is truly “the real deal”.\n\nLastly, Gotham is also offered to select commercial customers, primarily the companies that are investigating fraud in financial service industries. Furthermore, [Palantir has been credited](https://www.bizjournals.com/bizjournals/news/2015/01/12/leaked-documents-bernie-madoff-convicted-thanks-to.html) with assisting in finding the largest Ponzi scheme ever (Bernie Madoff’s Ponzi Scheme).\n\n*Gotham helps the Defense and Intelligence sectors of the Government to pool their incomprehensible amounts of data into one place. Palantir uses machine learning to quickly locate hidden pieces of data, and key patterns, so that these institutions can take swift action to the threats/problems they face in real-time.*\n\n*Palantir’s Approach:*\n\nPalantir believes that every large institution in the world has a problem in their approach to mass data analysis, and Palantir believes that their platforms are best suited to help companies address this problem and make the most out of their data.\n\nPalantir recognises that other companies sell features, tools, applications, and/or dashboards, however these products are not built to maintain optimal performance in the long run (if at all). Palantir prides themselves on having the best all around software/platform to have sustainable, reliable, and safe data solutions.\n\nPalantir also groups their Foundry data from all of their companies into one large system of several large “farms” of data provided by each of their client companies. By doing this, Palantir is able to feed more data/information into their machine learning, AI, and algorithms so that they can continue to be more reliable and efficient. This also enables [cross-industry data pools](https://youtu.be/7zqE8J4WKOU), that can be used by their companies when they look to expand or for opportunities in other verticals.\n\n*Palantir Success Stories:*\n\n**BP:**\n\nPerhaps the most notable success story that has come from Palantir is their partnership with [$BP – British Petroleum](https://utradea.com/stocks/BP)\n\nBP and Palantir have been partners since 2014, and recently (February 2021) [BP and Palantir have extended their partnership](https://www.fool.com/investing/2021/02/05/palantir-deepens-ties-with-bp-with-new-5-year-deal/) for 5 more years. Palantir has helped BP to transform their business into a more digital one, and this extension of their partnership will ensure a further acceleration of their strategic digitization of their business.\n\nPalantir’s Foundry has already helped BP by streamlining and enhancing their hydrocarbon-based workflows. Palantir helped BP to analyze their drilling data and has helped them to [increase their oil production in the North Sea by over 10%.](https://www.thetimes.co.uk/article/palantir-the-tech-spooks-who-found-bin-laden-are-helping-bp-find-oil-9qddfpv2r)\n\nThis increase in production helps us to visualize just how useful Palantir’s software can be. This is why their Foundry has been credited as a “competitive advantage”. Other oil producing companies most likely would not have been able to uncover the data, patterns, and relationships that were uncovered by Palantir, thus the companies that are not using Palantir may be losing out.\n\nThis type of publicity is fantastic for Palantir, as companies may see this, and contact Palantir because they too want a competitive advantage. Palantir’s best chance at becoming the next “tech giant” comes through the commercial applications/contracts. This is because there are infinite uses for Palantir, so theoretically, they can get it in the hands of every business (which would help revenues to soar).\n\n**National Institute of Health (NIH) and Britain’s National Health Service (NHS):**\n\nPalantir has historically been a rather controversial company through their help in government agencies like ICE. However, recently Palantir has been getting good press, which has helped their company image. Since the start of the pandemic some institutions like the NIH and NHS have signed contracts with Palantir, for Palantir’s assistance with their fights against COVID-19, and their vaccine distributions. This is good for Palantir as it shows them in a good light and shows that they can help provide the world with help and safety during a crisis like COVID-19.\n\nThe NIH agreed to a [$36M contract](https://www.palantir.com/pt_media/nih-palantir-contract/) to gain a partnership with Palantir. Their (NIH’s), mission is to build the largest centralized COVID-19 patient database in the world, and Palantir has helped them to do this with massive success.\n\nPalantir was able to assist the NIH in building their [N3C data platform](https://covid.cd2h.org/). This platform has come a long way since they teamed up with Palantir, and now has over 7.1B rows of data from 6.5M patients, from 57 different databases. Without the assistance of Palantir, analyzing this amount of data would have been no easy feat, however Palantir has provided the NIH with advanced analytics in the matter of minutes thank to their machine learning capabilities.\n\nAdditionally, in December of 2020, Palantir signed a [2-year $31.5M deal](https://www.businesswire.com/news/home/20201223005018/en/Palantir-Continues-Vital-NHS-Work-With-31.5M-Contract) with the Brittan’s NHS. This partnership requires Foundry to provide a secure, reliable, and timely platform to process data, while protecting patient privacy, to ultimately improve patient care.\n\nBoth of these partnerships highlight the need for Palantir during a crisis and having these large Government Health Institutes choosing Palantir as their first options is a great deal, and shows their confidence in Palantir’s software.\n\n*Sources:*\n\n[The power of data in a pandemic - Technology in the NHS (blog.gov.uk)](https://healthtech.blog.gov.uk/2020/03/28/the-power-of-data-in-a-pandemic/)\n\n*Strengths:*\n\n**Built-in Privacy Controls:**\n\nBy having [privacy controls](https://youtu.be/7zqE8J4WKOU) in place, Palantir is able to operate in places that other data companies cannot go. This is especially true for Foundry, where companies/individuals can request cross-industry data from other Palantir clients to help them in a variety of ways. This request for external data needs to be accepted by a representative of the other company to be allowed. This helps Palantir leverage all of the data that they have on their “Operating System”, which essentially makes their platform a cross-company/cross-country collaborative workspace for all. As Palantir attains more clients, the more attractive/extensive their database is for potential clients. This should help Palantir to expand quickly once they get the ball rolling.\n\nPalantir truly values this privacy and has integrated data legibility, audit logs, access controls, quality checks and requirements to attain external data.\n\n**Government Grade Security:**\n\nAs we know, Palantir started out in just the defense and intelligence spaces. This required Palantir to have elite-level security from the get-go. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This is no easy feat, however Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients, because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has [IL-5 clearance](https://simplemoneylyfe.com/palantir-stock-analysis/) with the Department of Defense (DoD), which makes them 1 of 4 software companies with this level of clearance (alongside Oracle, Salesforce, and SAP). However, it has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of **classified information.**\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology truly is and should provide ease of mind to companies that they are in business with.\n\n**Expansion into the Commercial Sector:**\n\nPalantir currently has a huge opportunity ahead of them as they continue to increase their presence in the commercial sector, partnering with some of the largest enterprises in the world. Palantir plans to provide these businesses with the software that they need to do their jobs as efficient as possible and sees large growth potential in this industry.\n\nPalantir has said that they are focusing on building partnerships with enterprises that are willing to undergo structural changes within the organization/operations. Palantir has a huge market ahead of themselves in the commercial sector, and their stock should do well on the news breaking of new partnerships between Palantir and commercial enterprises.\n\n*Government Contracts:*\n\nDo you remember what I said earlier about what happens once Palantir gets the ball rolling? If so, you will know where I am headed with this section.\n\nBetween 2008-2018 (10 years), Palantir was able to generate $51.9M in revenue from government contracts. However, in the 2 years following this they earned $179.9M in Government contracts (this can be found under the “US Government” section of their [SEC 10-K report](https://sec.report/Document/0001193125-21-060650/#tx65934_1)). Once Palantir was able to get the ball rolling with these agencies, Palantir was able to both expand and renew existing contracts to earn more revenue. I believe that the same thing will happen with Palantir’s commercial operations. Once they start to get a large number of big enterprises renewing their contracts for “bigger bucks”, I believe that Palantir will start to grow their revenues extremely quick and attract new clients “left, right, and center”.\n\nThese contract renewals are so important because essentially, they mean that Palantir met and/or exceeded expectations, and these companies now believe that Palantir is vital to their business/operations, so look out for news around renewals.\n\n*Business Model:*\n\nPalantir has developed a business model that focuses on acquiring contracts and expanding their services and has 3 main phases.\n\n1. **Acquire Customers:** Palantir has expanded their sales force largely over the past couple of years, and actively purse negotiations with companies that they can provide long-term value to. To acquire these companies, Palantir gives them a short demo to see how effective and user friendly their software is, Palantir provides this service for a loss. However, they are willing to incur these (proportionately) small losses to potentially acquire large contracts with these companies. This phase runs at a loss but helps Palantir set up clients for the next phase.\n2. **Expand:** Once Palantir has a potential customer on the hook, they move them along to the expand phase. Palantir installs their software in these enterprises and teaches them the ropes, of course this requires a large investment from Palantir to incorporate it. These customers often sign a short contract with Palantir for a cheap cost (Palantir takes a loss on this phase as well), however clients are able to truly unlock Palantir’s software during this phase and see what it has to offer. If they like their software, they will be moved along to the next phase (scale) which is Palantir’s bread and butter.\n3. **Scale:** These clients tend to sign longer-term deals with Palantir for their software after they have got a “good feel” for their software. The companies in this stage are also generally “hands-off” meaning that they can operate the software without much help. Companies tend to find the most value in this stage, and Palantir makes the best margins on this stage. In 2020, Palantir made $613.4M in this stage with a margin of 70%\n\n*Financial information:*\n\nAll of this information can be found in their [SEC 10-K filing.](https://sec.report/Document/0001193125-21-060650/#tx65934_1)\n\n· **Financial Performance (Good):** In 2020, Palantir increased their gross profit by 47.97% and increased their gross margin to 81% (from 71%), Palantir reported their first net income (excluding stock-based compensation) ever and increase their net revenues by 47.15%.\n\n· **Financial Performance (Bad):** In 2020, Palantir’s loss from operations increased by 103.61%, their stock-based compensation increased by 425.15%, their General and Admin expenses increased by 108.59%, and their net loss increased by 101.22%. Their biggest problem in 2020 was their large stock-based compensation, which will be addressed later.\n\n· **Convertible Preferred Stock:** In 2020, Palantir issued a total of 797,771,675 shares of common stock through conversion of their previous “convertible referred shares”. This one factor of dilution caused an estimated dilutionary effect of Palantir’s stock of 137.19%. This is a huge form of dilution, and I have never seen anything like this before, however I have an explanation for this so stay tuned for that.\n\n· **Repurchase of Common Stock:** In 2020, Palantir repurchased 808,201 shares back. This is a measly amount compared to the amount of dilution from preferred stock, however any buyback is good to see as an investor. This buyback caused an inflationary effect on existing shares of 0.14%, which is not much, but we will still take it.\n\n· **Stock Warrants:** In 2020, Palantir experienced an additional 7,631,329 shares on the market through the exercising of warrants. The exercising of these warrant had a dilutionary effect on Palantir’s stock of 1.31%.\n\n· **Common Stock (Net of Issuance Costs):** In 2020, Palantir unloaded 206,500,523 common shares onto the market from issuance of common stock net of issuance costs. I believe that this means that, Palantir had to fork out additional shares to cover the investment needed to take their shares public. I could very well be wrong on that, and if anyone can pitch in and explain this to me that would be great! Anyways, this caused a dilutionary effect of Palantir’s common stock of roughly 35.51%. This is a large portion of dilution, however it does not even factor in other factors of dilution which is worrying.\n\n· **Stock Options:** In 2020, Palantir added 120,617,527 common shares to their shares outstanding through the exercise of options. These options were exercised and thus converted into these common shares and had a dilutionary effect of 20.72%. Once again, this is a large amount of dilution and should be considered by investors.\n\n· **RSU’s:** In 2020, Palantir issued 82,429,575 shares through their vesting of “Restricted Stock Units” (RSU’s). This had a dilutionary effect on their stock of 14.18% (which is a lot of dilution).\n\n· **Modification to Stock Options:** In 2020, Palantir technically bought back 3,500,0000 shares through modifications to stock options (for the settlement of employee loans accounted for as modifications to stock options). Confusing, right? This technical buyback resulted in a share inflation of 0.6%.\n\n· **Total Share Dilution in 2020:** In 2020, Palantir experience an overall share dilution of 208.19%. This is the most dilution I have ever seen in a stock that I have analyzed, however there are some potential answers as to why there was so much dilution in 2020.\n\n*Explanation of Share Dilution:*\n\nOnce again, all of the below information can be found in Palantir’s [SEC 10-K filing](https://sec.report/Document/0001193125-21-060650/#tx65934_1).\n\nOn September 30th, 2020, Palantir completed their Direct Listing of their Class A common shares on the public markets on the NYSE. Part of this listing involved the redemption of all of Palantir’s convertible share into common shares. This was the largest single source of dilution in Palantir (137%). Additionally, this Direct Listing involved the exercise of al outstanding warrants, which resulted in dilution of 1.31%. Another part of their Direct Listing was the common stocks issued, net of issuance price to complete the direct listing, which had a dilutionary effect of 35.51%. Lastly, Palantir was forced to create new common shares that would hold the place of the unvested RSU’s, which cause a dilutionary effect of 14.18%.\n\nWithout these factors of dilution, Palantir would have only experienced an overall dilution of 20%. This means that due to the Direct listing, Palantir had to increase their shares outstanding by 188.19% to meet the requirements to be eligible for the listing.\n\n*Overall Thoughts on Dilution:*\n\nPalantir is a very weird stock in terms of their dilution, and I have not seen anything quite like this before. Their overall level of dilution is unprecedented and very worrying for investors. However, we know that these levels of dilution were inflated due to the requirements of undergoing a Direct Listing. However, how does Palantir dilution (excluding the effects caused by their Direct Listing compared to their dilution in previous years?\n\nFor starters, Palantir exhibited a 20% share dilution in 2020 when eluding the dilution caused by the Direct Listing. However, historically Palantir has experienced an average share dilution of 5.18% between 2017-2019. So even excluding the effects caused through the Direct Listing, Palantir still experienced a comparably high level of share dilution. However, 20% of dilution is significantly different than the 208.19% of dilution (which would be crazily high). This 20% is relatively normal for an undervalued growth stock, such as Palantir, so currently I would not be too worried. However, investors should keep up with their financial reports and look for their dilution in 2021, because ultimately that will tell us more about Palantir’s dilution after going public, than their past share dilution as a private company.\n\n*Competition:*\n\nIn order to undergo my comparable analyses (which will be discussed later on) I needed to select 4 companies, that I can compare to Palantir.\n\n[**$ZS – Zscaler Inc**](https://utradea.com/stocks/ZS)**:** ZScaler is a security as a service company that helps company adapt to cloud technologies and provides their cybersecurity services through the cloud. ZScaler provides their services to both commercial enterprises and governments, similar to that of Palantir. Furthermore, ZScaler offers their service primarily in the USA, but also has smaller international operations (again like Palantir).\n\n[**$SNOW – Snowflake Inc**](https://utradea.com/stocks/SNOW)**:** Snowflake (like Palantir) is a software and technology company that primarily focuses on data. Snowflake provides data cloud services such as data engineering, data science, data applications, data sharing, and data warehouse. This is very similar to the applications and functions available on Palantir, however Palantir offers other functions that differentiate themselves. Snowflake also provides services for both commercial enterprises and government organizations, similar to that of Palantir.\n\n[**$SPLK – Splunk Inc**](https://utradea.com/stocks/SPLK)**:** Splunk provide software platforms that deliver insights derived from their clients’ data in the USA and internationally. Splunk offers their Ecosystem solutions that consist of data inputs, workflows, reports, dashboards, data visualizations, actions, and methods, and help their clients/customers to make the best out of their data. All of this sounds eerily familiar to the description of Palantir, making it one of the closer competitors. Splunk also offers their services to the public sector as well as the government, making their business model resemble that of Palantir so much more.\n\n[**$TYL – Tyler technologies Inc**](https://utradea.com/stocks/TYL)**:** Tyler technologies is probably the company in this list that least resembles that of Palantir, this is because they provide management solutions, accounting systems, billing systems and other solutions geared toward the public sector. Tyler technologies works primarily with governments of all types (Federal, State, and Municipal), and education institutions. However, the one thing that Tyler has that makes them comparable to Palantir is their data and insight solutions. Their data insights software enables collaboration, displays data visualizations/measurements, and generates insights for their human operators to act on.\n\n*Q1 2021 Updates:*\n\nAll of the below information can be found in [Palantir’s Q1 Investor Presentation](https://investors.palantir.com/files/Palantir%20Q1%202021%20Business%20Update.pdf).\n\nRecently, on May 11th, 2021, Palantir released their Q1 earnings report. When looking at Palantir’s financial performance I did not take this into account, which means that this section will be packed with new information that will help us to understand Palantir’s trajectory even more.\n\nFirst and foremost, this quarter was the first quarter in which Palantir has reported positive earnings. This is a big milestone for Palantir as a public company, and it helps to gets investors excited about the potentially profitable future of Palantir. In Q1, Palantir reported a free cash flow of $151M (was -$290M in Q1 2020) with a 44% adjusted FCF margin, they grew revenues by 49% YoY ($341M), and they grew billings by 248% YoY ($362M) which means that Palantir is acquiring new customers and negotiating higher contracts. These financials are great and show a promising future ahead for Palantir, which should excite their investors.\n\nFurthermore, during this quarter they also disclosed their investment in a SPAC. This SPAC is [$QELL – Qell Acquisition Corp.](https://utradea.com/stocks/QELL) which merging with Lilium. Lilium is an eVTOL transportation company, with this investment they also came to a deal with Lilium to use Foundry for design, engineering, testing, production, quality, logistics, and operations. A while back I looked at another eVTOL SPAC Archer ([$ACIC – Atlas Crest Investment Corp.](https://utradea.com/stocks/ACIC)), which has great upside and has a similar business model to Lilium, so if you want to read that to be more informed about Liliums potential performance, [click here.](https://utradea.com/positions/Take_a_SHOT_at_Archers_SPAC_ACIC)\n\nIn Q1, Palantir was also awarded with a [5-year $90M contract](https://www.businesswire.com/news/home/20210405005238/en/Palantir-Selected-by-the-National-Nuclear-Security-Administration-for-5-year-89.9M-Contract-for-SAFER-Project) from the National Nuclear Security Administration (NNSA), in which Palantir will provide the operational platform for their SAFER (Safety Analytics, Forecasting, and Evaluation Reporting) project. This is big news as this is one of Palantir’s bigger contracts, and it shows the level of confidence of the NNSA in Palantir’s software and their cross-enterprise data integration capabilities. On the topic of Palantir and Government Organizations, the DoD used Palantir’s software in all 11 of their Combatant Commands for globally integrated intelligence. This high level of usage from the DoD definitely means that Palantir is doing something right, and if the DoD likes it so much, then it should be more than enough for commercial enterprises.\n\nLastly, in Q1, Palantir won 15 contracts worth over $5M, and 6 contracts worth over $10M with an average duration of 3.7 years (4.6 for commercial customers). This is fantastic for the company as they gained an additional 11 new commercial customers from this, and I will be keeping up to date with these contracts and others as they come up for renewal/negotiations. Additionally, Palantir was able to grow their gross margin to 83% (from 75% Q1 2020), and their contribution margin to 60% (from 41% in Q1 2020). This shows that Palantir business partners are maturing into their 3rd phase, the scale phase, which enables Palantir to grow their margins.\n\n***$PLTR – Palantir Investment Valuation:***\n\n*Comparable Analyses:*\n\nI decided to undergo 2 different comparable analyses in order to get a variety of valuations (or opinions if you will). Preferably, I would like both of these results to be consistent in terms of their fair value estimate, however, if they are not consistent, I will take the average result. I was only able to find 2 multiples/ratios that I could actually analyze due to the nature of these businesses and their lack of positive financial ratios/multiples.\n\n*EV/Revenue:*\n\nThis is a very common multiple among companies that are not profitable in their operations yet, like Palantir and some of these other comparable companies. By comparing Palantir’s EV/Revenue multiple to that of their competitors (listed above on the “competitors” section of this report), I found that Palantir has a fair value of $32.85/share, which implies an upside to this investment of 23.31%. This implies that given Palantir’s current price, they are undervalued, and the upside is very reasonable, however, I decided to undergo the next comparable to see if this result maintains.\n\n*P/B:*\n\nBy comparing Palantir’s P/B ratio to that of their competitors, I found that Palantir has a fair value of $24.87/share, which implies that there is a downside risk of 6.64% to such an investment. As you have probably noticed, these results are not consistent, therefore I have decided to take the average result to get one, final price target.\n\n*Average Comparable:*\n\nBy taking the average result from the 2 comparable analyses underwent, I found that Palantir has a fair value of $28.86/share, which implies an overall upside of 8.36% to this investment. This also implies that Palantir, is in fact an undervalued growth stock, that has the potential to be one of the best undervalued stocks on the market.\n\n***My Plan for Investing into Palantir:***\n\nMy plan for this investment is a little different from usual.\n\nI see anything between $24.87/share (Fair Value of P/B ratio) and $28.86/share (average comparable) as a good chance to buy Palantir at (or below) its fair value. This helps to limit our downside risk of this investment.\n\nHowever, I think the best way to play an investment in Palantir is over the long-run 3+ years. I would attempt to buy in at the above prices and hold for these 3+ years. During this time, I would re-evaluate my investment with every new financial report and piece of news to decide if it is still worth holding.\n\n***Potential Risks to Palantir’s Stock - $PLTR:***\n\n· **Dilution:** Over the past year Palantir has experienced a lot of dilution, however, we have already attributed a great deal of this dilution to their Direct Listing. However, the 20% of dilution that was not derived from the direct listing is still quite high. As investors, we should keep an eye on their future levels of dilution to recognize any patterns/increases that we should be weary of. If these levels of dilution persist, potential investors may be scares off and current investor might sell their positions, which will hurt the share price.\n\n· **Financial Performance:** This year’s financial performance was not one to be overly happy about. Although they were able to increase some pretty important aspects of their balance sheet, Palantir was still yet to make a profit, and increased their net losses by over 100%. If this poor financial performance continues, and they keep digging themselves into a bigger and bigger hole, investors will run away from this stock and never look back. However, the Q1 financial performance gives investors hope for a more profitable future, which will be discussed later.\n\n· **Bad Press:** Historically, Palantir has not been looked at through a positive lens by many people investors and non-investors alike. Their first public backlash came through their involvement in deporting immigrants through [Palantir’s partnership with ICE](https://www.bbc.com/news/business-54348456). Palantir quicky spoke out against this backlash by saying ICE took advantage of their software without proper oversight, and that they are looking into the issues, furthermore they have since declined some potential partnerships with other border agencies to avoid further backlash. There have also been numerous smaller controversies and protests that have damaged Palantir’s reputation, and if there are more large controversies Palantir’s stock could get hurt as a result of it.\n\n***Potential Catalysts that can Help Palantir’s Stock Price:***\n\n· **Share Buybacks:** Over the past year, Palantir has bought back (both directly and indirectly, in a sense) over 4,300,000 of their common shares. This is good to see as an investor, especially this early in the company (and not too long after their Direct Listing). This gives me hope that Palantir will continue to repurchase more shares in the future. This will be good for the share price as it will increase the value of existing shares, and it will be especially good for the stock price if they continue to buyback more shares each year.\n\n· **Financial Performance:** Palantir’s 2020 financial report was not favourable (as discussed previously), however there were definitely some good to take out of it. Palantir increased their revenue, gross profit, and margins by a hefty amount, which is good to see as an investor, however, there was bad aspects of this report as well that made the report unfavourable. However, their newly released Q1 2021 financial report has so much more to offer in terms of good aspects of a financial report.\n\n· **Positive Press:** As previously mentioned, Palantir has had their fair share of bad press that has had a small effect on their share price. However, recently Palantir has been getting better press through helping organizations like the NIH and NHS in their fight against COVID-19, and their vaccine distribution efforts. Partnerships like this help to display the positive impacts that can be derived from Palantir’s technology. Future events where Palantir can use their software for a good cause can help to combat the negative stigma around Palantir and attract more people to invest in their company. This should help their share price in the short term after these articles are released.\n\n· **Success Stories:** Since Palantir have gone public, they have had a few success stories come out, I mentioned some of these stories throughout the article. These success stories show how impactful Palantir’s software can be and can show companies that they can increase revenues, production etc. just by using Palantir’s software. Any future stories like this that come out, highlighting the benefits of Palantir can help the stock soar, and potential clients to reach out and start business/inquiries with Palantir.\n\n· **Renewing Contracts:** I have mentioned that the renewal of contracts can help Palantir’s share price a couple times throughout this article but why is this the case? This is because these companies that are renewing have already been through Palantir’s 3 stage business model and have experienced their software firsthand for numerous years. After their time with Palantir’s software expires they decide to renew the contract. This is good because it shows that Palantir’s software was effective enough to their business in the time they had it that it is worth these $5-15M+ contract renewals. Furthermore, these companies that are renewing already have underwent Palantir’s installation, and these clients will provide Palantir with the highest margins, which will reflect well on Palantir’s future financial reports.\n\n· **New Partnerships/Contracts (and the expansion of commercial enterprise segment):** Every time that Palantir, or its partners release news that they have entered into a contract/agreement, this will help Palantir’s stock. This is because Palantir needs to keep expanding their software into new companies in order to meet their expected growth projections. Furthermore, as more commercial enterprises try Palantir’s software (and hopefully enjoy it), the more willing other companies might be to give Palantir a shot. I see their biggest potential for growth and to become a large company in their expansion of their commercial enterprise segment through Foundry. Every time Palantir gets more new clients on board it is fantastic and shows the feasibility of this segment, and as more contracts role in, more enterprises will take an interest. Furthermore, when Palantir signs these enterprises to a contract, it will help to increase their revenues, which will show up on their financial reports and hopefully help the, to beat estimates.\n\n*This analysis took a long time, and is one of the most comprehensive that I have seen, so I would greatly appreciate if you followed me* [*here*](https://utradea.com/member-portfolio/BeatingTheVTI?utm_source=R&amp;utm_medium=B&amp;utm_campaign=PLTR)*, and commented on my original post!*",
        "subreddit": "wallstreetbets",
        "title": "The BEST Palantir Analysis Around!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obn698/the_best_palantir_analysis_around/",
        "created": 1625179053.0
    },
    {
        "author": "broman500000",
        "created_utc": 1626272603,
        "id": "ok5e4z",
        "num_comments": 227,
        "num_crossposts": 0,
        "selftext": "For those that remember when MVIS was trading around \\~$1-$2 and then they partnered with Microsoft and ran to $30, this is for you!!!\n\n**About the Company**\n\nVerb Technology Co., Inc. engages in transforming how businesses captivate and engage customers. The firm's Software-as-a-Service (SaaS) platform is based on its proprietary interactive video technology and comprises a suite of sales enablement business software products offered on a subscription basis. Its software applications are available in over 60 countries and in more than 48 languages to large enterprise and small business sales teams that need affordable, easy-to-use, and quick-to-get-results sales tools. The firm’s applications are available in both mobile and desktop versions and offer fully integrated suite, as well as on a standalone basis and include verbCRM (Customer Relationship Management application), verbLIVE (Interactive Livestream eCommerce and Video Webinar application), verbTEAMS (a Self On-boarding version of verbCRM with built-in verbLIVE and Salesforce synchronization for small businesses and solo entrepreneurs), and verbLEARN (Learning Management System application). The company was founded by Rory J. Cutaia on November 27, 2012 and is headquartered in American Fork, UT. \n\n**Catalysts**\n\n1. Partnered with Microsoft yesterday with verbMAIL... it is an interactive video sales tool that allows Microsoft Outlook users to record or upload virtually any video to which users can add interactive clickable buttons and icons right in the video for easy click purchasing by viewers (“Buy-It-Now”), scheduling appointments, downloading or viewing product literature and media, and many other sales enabling interactions – all natively from the new verbMAIL button that will appear on the Outlook toolbar after installation.  Microsoft Outlook reaches 1B users!!!\n2. Partnered with SHOP Today...VERB has partnered to launch SHOP LIVE, a customized, interactive and live-streaming channel unique to each of Market America Worldwide’s global distributors, known as UnFranchise® Owners (UFOs). With this extraordinary and next-level technology, SHOP LIVE™ will allow each UFO to hold their own live broadcast, where they can talk about, demonstrate and sell products to their current and potential customers anytime, anyplace, 24/7. \n3. Today they are doing a presentation of the technology at 2:30pm at the Issuer Direct's Access to Giving Virtual Investor Conference \n\n**Positions : 30k shares in 2 accounts**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/m68wphnqt6b71.png?width=1197&amp;format=png&amp;auto=webp&amp;s=9a244cc83ec4697981497a7b2965336916c9f50a",
        "subreddit": "pennystocks",
        "title": "VERB ($2.60)- Next MVIS Runner from Penny stock to $30 - 30k shares YOLO",
        "url": "https://www.reddit.com/r/pennystocks/comments/ok5e4z/verb_260_next_mvis_runner_from_penny_stock_to_30/",
        "created": 1626301403.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1625970134,
        "id": "ohvzti",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "I've collected 150 stocks, I know it's too many, so I would appreciate some help disqualifying the obvious mistakes. Most of these are either tech stocks, especially cloud, or on some list, like Dividend Kings, or Aristocrats. My goal is to have the absolute best growth stocks, then also growth stocks that also pay increasing dividends, a combination approach, plus a few spec on the side. I have a medium-high risk tolerance and 15 year + Horizon. \n\n* I will keep APL ADBE BABA BIDU COST HD HON INTC KO MA MSFT NVDA O PEP PYPL T TCEHY TGT TXN UNH V \n\n* but I am less certain on others like ABB ABM ACN ADP AMAT APPH APPN ARCC ASML AVGO BAC BLK CMCSA COIN CRM CRWD CSCO DD DDOG DOCU DPZ DUK ENPH ETSY FDX FSLY GILT HVBT IRDM ISRG JMIA JPM LOGI LRCX LSCC MELI MP MRVL MU NEE NET NIO NOW ORA ORCL PAYX PG PLUG PNR PSA QCOM RNG ROKU ROP SE SEDG SNOW SPCE SPLK SQ SWKS TDOC TTD TTWO UPS VSAT WELL XEL ZEN ZG ZM ZS \n\n* and others on those dividend lists such as: ADI AIZ AMT ANTM APD ATO ATR AWK AWR BANF BMI BRO CAT CB CBU CFR CHD CINF CL CLX CME CMI CSL CSX CTBI DCI DOV EMR ESS EXPD FAST FELE GPC HTD ITW JKHY LANC LECO LIN MCHP MCO MGRC NDSN NUE PH RPM SPGI TROW UNP WEC WM",
        "subreddit": "stocks",
        "title": "Way too many stocks to choose from...",
        "url": "https://www.reddit.com/r/stocks/comments/ohvzti/way_too_many_stocks_to_choose_from/",
        "created": 1625998934.0
    },
    {
        "author": "d3dmoo5",
        "created_utc": 1625578613,
        "id": "oev2yc",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "1. Increased Salesforce - they reported 50 new sales people in Q1 with $5.4B of contracted award value. Palantir was had not invested heavily in sales until now. That has allowed them to focus on making a quality product. Now that their product is tits, they are looking to expand and the Sales team is the best way to do that (think servicenow).\n3. Commercial growth: as of 1Q21 commercial growth increased 19% from the prior year and 4% from the last quarter. Commercial growth is going to be the moneymaker for Palantir.\n4. SPAC investment: palantir has been using its substantial cash investing to strategically invest in SPACs, at least 6 that I am aware of.  The goal being that those companies could make use of it's software to the benefit of Palantir and the SPAC. \n5. $151M in cash flow which is an increase of $441 from the prior Q ($290M).\n6. Revenues remain strong Q1 $341.2M $48.8% growth $800M annualized run rate. \n7. The growth of adoption within the government remains strong, and that pipeline is continuing to grow. Congress recently approved a new appropriation pilot for procurement of IT which can be used for RDTE, Procurement and Operating and Maintenance. This provides opportunity to decrease the duration of the government Procurement cycle and will absolutely result in additional RFQ/Procurement contracts (I believe it will take a year to see the RFQ's hit the streets). This will benefit palantir with their new, bigger and hungry sales team.  \n\n\nI'm long palantir, this is not investment advice and I don't recommend anyone listen to anything I say. \n\nPositions\nhttps://imgur.com/a/yQRMXij",
        "subreddit": "wallstreetbets",
        "title": "Palantir 1Q21 Outlook TLDR",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oev2yc/palantir_1q21_outlook_tldr/",
        "created": 1625607413.0
    },
    {
        "author": "Grey_Eye_22",
        "created_utc": 1625506150,
        "id": "oec2k9",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "I personally believe both of these stocks will hit $1 trillion in three years' time. I personally plan on investing $75,000 in each of these and holding for three years minimum. I think these companies have great margins, solid growth, etc. \n\nThoughts?",
        "subreddit": "stocks",
        "title": "PayPal and Salesforce - Trillion Dollars in three years.",
        "url": "https://www.reddit.com/r/stocks/comments/oec2k9/paypal_and_salesforce_trillion_dollars_in_three/",
        "created": 1625534950.0
    },
    {
        "author": "Psyched4this",
        "created_utc": 1626977466,
        "id": "opjjt3",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Tesla (TSLA) is going on a salesforce hiring spree as demand ramps up in the US",
        "url": "https://electrek.co/2021/07/22/tesla-tsla-salesforce-hiring-spree-demand-us/",
        "created": 1627006266.0
    },
    {
        "author": "Yes_Captain_",
        "created_utc": 1626635710,
        "id": "omx7r4",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "# The Company\n\nAvePoint went public via a merger on Friday, the 2nd of July 2021. The company runs over 1,300 employees in 29 global offices and is one of the largest Strategic Cloud Partners of **Microsoft**. It´s all about migrating businesses to the cloud under the aspects of cyber security, compliance and so on. AvePoint had been the global **Microsoft partner of the year** 5 times and runs over 7 Million cloud users already as of today. It aims to add 40,000 managed service provider partners by 2022.\n\nJust a short extract from their customer list:\n\n*Porsche – NBC – Verizon – Rolex – Fiat – Roche – Siemens – Symantec – Disney - NHS – iTV – Sainsburry – really a lot more, but I am lazy.*\n\n# Huge Growth Potential\n\nExpected revenue of $194 Million in 2021 growing with a high rate of &gt;30% YOY and an EBIT Margin of 14% in 2020. Ok, ok. $194 Million - you say *'thats not a lot!'* \\- take 35% Growth rate for the next 6 years: You'll end up with over $1 Billion in revenue by 2027 - SaaS will grow potentially, as we all know, so I don't think we will only have 35% growth. This company is growing and it won't stop - thats for sure. Lets see how AvePoint compares to some of the bigger players out there.\n\n&amp;#x200B;\n\n[$AVPT vs $OKTA vs $CRM Disclaimer: I give no guarantee for the correctness of the data shown.](https://preview.redd.it/i20hk8x8t0c71.png?width=1292&amp;format=png&amp;auto=webp&amp;s=7d40a69ee164921bce649b585e1ff33f9f092d3b)\n\n# AvePoint Announces $20.0 million Share Purchase Program\n\n$AVPT is down almost 50% from its ATH of 16.55 in January. The SPAC sell-off made it more than difficult and even managements announcement to purchase over **$20 Million** didn’t help to keep it uptrend. I am convinced that this is not just another SPAC and that numbers are clearly speaking for its business. Having a partner like Microsoft and growing with over 30% into a cloud-based business is almost a no-brainer for me. Time will tell. Compare it with OKTA in 2017, going public at a $6 Billion valuation, which is not so much far away from AvePoint today.\n\nDisclaimer\n\nThe contents on this site are for informational and entertainment purposes only and does not constitute financial, accounting, or legal advice. I can’t promise that the information shared on my posts is appropriate for you or anyone else. By using this site, you agree to hold me harmless from any ramifications, financial or otherwise, that occur to you as a result of acting on information found on this site. I give no guarantee for the correctness of the data shown.",
        "subreddit": "wallstreetbets",
        "title": "My first own DD: Comparing $AVPT with $OKTA and $CRM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/omx7r4/my_first_own_dd_comparing_avpt_with_okta_and_crm/",
        "created": 1626664510.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1625969497,
        "id": "ohvu7r",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I've collected 150 stocks, I know it's too many, so I would appreciate some help disqualifying the obvious mistakes. Most of these are either tech stocks, especially cloud, or on some list, like Dividend Kings, or Aristocrats. My goal is to have the absolute best growth stocks, then also growth stocks that also pay increasing dividends, a combination approach, plus a few spec on the side. I have a medium-high risk tolerance and 15 year + Horizon. \n\n* I will keep APL ADBE BABA BIDU COST HD HON INTC KO MA MSFT NVDA O PEP PYPL T TCEHY TGT TXN UNH V \n\n* but I am less certain on others like ABB ABM ACN ADP AMAT APPH APPN ARCC ASML AVGO BAC BLK CMCSA COIN CRM CRWD CSCO DD DDOG DOCU DPZ DUK ENPH ETSY FDX FSLY GILT HVBT IRDM ISRG JMIA JPM LOGI LRCX LSCC MELI MP MRVL MU NEE NET NIO NOW ORA ORCL PAYX PG PLUG PNR PSA QCOM RNG ROKU ROP SE SEDG SNOW SPCE SPLK SQ SWKS TDOC TTD TTWO UPS VSAT WELL XEL ZEN ZG ZM ZS \n\n* and others on those dividend lists such as: ADI AIZ AMT ANTM APD ATO ATR AWK AWR BANF BMI BRO CAT CB CBU CFR CHD CINF CL CLX CME CMI CSL CSX CTBI DCI DOV EMR ESS EXPD FAST FELE GPC HTD ITW JKHY LANC LECO LIN MCHP MCO MGRC NDSN NUE PH RPM SPGI TROW UNP WEC WM",
        "subreddit": "StockMarket",
        "title": "Help me disqualify these stocks",
        "url": "https://www.reddit.com/r/StockMarket/comments/ohvu7r/help_me_disqualify_these_stocks/",
        "created": 1625998297.0
    },
    {
        "author": "hmchugh98",
        "created_utc": 1626132997,
        "id": "oj3cuk",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "AVPT\n\nBelow is a portion of the benzinga article from the interview with AVPT (Avepoint’s CEO) \n\nMicrosoft Partnership: AvePoint is the leading data management solutions provider for the Microsoft Corporation (NASDAQ:MSFT) Cloud. \n\nThe company has a 20-year relationship with Microsoft, Jiang said. For every $1 Microsoft earns, there exists $9 of partner opportunity. So rather than competing with Microsoft, AvePoint is competing within the Microsoft ecosystem, he said.\n\nOutside of the current partnership with Microsoft, AvePoint provides services for salesforce.com inc (NYSE:CRM) and Alphabet Inc's (NASDAQ:GOOG) (NASDAQ:GOOGL) Google Docs. The company is also actively looking at working with Amazon.com, Inc.'s (NASDAQ:AMZN) AWS, Jiang said. \n\nEarnings And Analyst Coverage: AvePoint reported first-quarter financial results on May 20. The company announced total revenue of $38.8 million, up 19% year-over-year and SaaS revenue of $18.3 million, up 78% year-over-year.\n\nAvePoint also raised its fiscal year guidance and announced that the company remains debt-free. \n\nAvePoint anticipates announcing its next quarterly financial results in early August. The company is expecting analyst coverage from numerous firms to be published within the next week, Jiang told Benzinga\n\n**disclaimer I currently own 400 call options expiring end of week 15c that I’ve owned for over 3 months.",
        "subreddit": "stocks",
        "title": "No debt = good bet",
        "url": "https://www.reddit.com/r/stocks/comments/oj3cuk/no_debt_good_bet/",
        "created": 1626161797.0
    },
    {
        "author": "kygah0902",
        "created_utc": 1625509038,
        "id": "oed026",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I would love to hear feedback, what people would choose, and why. My top picks would be:\n\n1. MSFT- Nadella is one of the best CEOs in tech, Azure and other cloud services are growing very quickly, they’re diversifying out of just B2B software\n2. AMZN- AWS is growing 40% a year, they’re entering healthcare, one of the most diversified companies in the world \n3. GOOG- have one of the widest moats with intangible assets like data, Google Cloud is still growing strong, super strong subsidiaries like YouTube, Waymo, etc\n4. FB- Instagram is a great platform for e-commerce, Facebook shopping is growing, Oculus is the best VR company and is still in early innings \n5. TSLA- Controversial but there’s a lot to like in their diversification with green industries like EVs, solar, batteries, Musk is hard to bet against \n6. BABA- incredible value for its growth, e-commerce, cloud, and health should create a stable growth for decades  \n7. NVDA- The essential AI chip company, Huang is routinely ranked a top CEO, if passed the ARM acquisition is huge, best machine learning talent in the world outside of Google\n8. PYPL- Digital payments are the furure and they own 2 of the 3 largest companies in the industry (PayPal and Venmo)\n9. ADBE- Extremely wide moat in digital documents and creative media, their creative cloud segment is still picking up traction\n10. CRM- The essential cloud computing company with a visionary CEO, great culture, strong subsidiaries and investments in Tableau and Slack  \n11. SHOP- One of the big dogs in e-commerce that’s only getting stronger, getting into digital payments and logistics, smart partnerships with Google, Pinterest, Facebook\n12. JD- E-commerce, Health, Cloud, AI growing revenue at 30-40% at a PE under 30\n13. ABNB- Will take time to grow into valuation, but it’s hard to see how this company doesn’t become a future FAANG with opportunities in short term stays, long term stays, and an even bigger opportunity in travel experiences\n14. MELI- The leader in ecommerce and digital payments in Latin America which are still in early stages of development, has grown revenue 10-20% for 20 years, great CEO \n\n(Disclosure: I am long MSFT, AMZN, GOOG, TSLA, NVDA, PYPL, ADBE, CRM, SHOP, ABNB, and MELI)",
        "subreddit": "stocks",
        "title": "Best long-term stocks",
        "url": "https://www.reddit.com/r/stocks/comments/oed026/best_longterm_stocks/",
        "created": 1625537838.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1627521301,
        "id": "otngu8",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I've spent quite a bit of time organizing this list. \nI'd like to narrow it down without losing broad sector diversification. \nLooking for growth as well as dividend growth. \n\n* TECH: \n* Software Application: TTD NICE ADSK INTU CDNS CRM (APPS)\n* Software Infrastructure: ZS CRWD ADBE FTNT SNPS NET (MSFT SQ) \n* Semiconductor: AVGO SWKS MPWR (NVDA MRVL LSCC QCOM TXN UMC)  \n* Semiconductor Equipment:: NVMI LRCX TER ENTG AMAT ASML (CAMT)\n* Internet Retail: ETSY MELI PDD (JD BABA) \n* Tech Services: ACN (INFY PRFT) \n* Tech Instruments: GRMN NOVT\n* Comm Equipemt: (CLFD) \n* Electronics: (AAPL)\n* Internet: NTES ZG \n* Hardware: LOGI\n* Gaming: SE \n\n\n*\n\n* TELECOM: TMUS T ZM (VZ) \n* Canadian Telecom: (BCE T) \n\n*\n\n* HEALTH: TDOC UNH (AMEH)\n* Medical Devices: MDT ISRG \n\n*\n\n* FINANCIAL: \n* Banks: BANF JPM IBN (BAC) \n* Canadian Banks: (BNS RY TD)\n* Asset Mgmt: BLK TROW (ARCC BSTZ) \n* Credit Cards: MA V AXP (HX PYPL V GSY) \n* Insurance: AIZ (\n* Canadian Insurance: SLF MFC POW) \n* Exchange: SPGI  \n\n*\n\n* CONSUMER DISC: \n* Personal Services: MED \n* Restaurants: MCD DPZ (PZA)\n* Special Retail: BBY \n* Auto Parts: XPEL\n* Packaging: ATR (ITP)\n* Leisure: POOL \n* Home: HD \n\n*\n\n* CONSUMER STAPLES: \n* Discount Stores: DG COST\n* Beverages: (PEP CELH) \n* Household: CHD \n\n*\n\n* INDUSTRIALS: \n* Machinery: PNR MMM ITW EMR GNRC XYL  (ABB SHYF) \n* Building Parts: CSL \n* Staffing: ADP PAYX \n* Railroads: UNP (CP) \n* Freight: FDX EXPD\n* Renting: (MGRC) \n* Services: CPRT \n* Tools: SNA \n* Waste: WM \n\n*\n\n* MATERIALS: \n* Metals/Mining: BBL RIO VALE \n* Canadian Metals/Mining: (LAC LUN SLI CGXF PWI) \n* Chemicals: APD PPG\n* Steel: (STLD LIF)\n\n*\n\n* UTILITIES: \n* Renewables: ORA \n* Canadian Renewables: (AQN BEP H INE PIF RNW TA) \n* Electric: NEE XEL \n* Canadian Electric: (FTS CU CPX HUTL)\n* Water: AWK \n\n*\n\n* ENERGY:\n* Canadian Energy: (CNQ PPL ENS)  \n\n*\n\n* REITs: VNQ O \n* Canadian: (APR AD BRE FCD INO NWH NXR SRU SMU SGR RIT RS TNT)",
        "subreddit": "stocks",
        "title": "Is there any redundancy here?",
        "url": "https://www.reddit.com/r/stocks/comments/otngu8/is_there_any_redundancy_here/",
        "created": 1627550101.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1626977487,
        "id": "opjk2g",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Palantir is an American software company that specializes in big data analytics, with a market cap of 43 billion. They started building software for the intelligence community in the US to assist in counterterrorism investigations by helping them identify patterns hidden deep within large data sets. Later, they realized that similarly to the intelligence community, commercial institutions did not have the most effective tools to manage and make sense of the data involved in large projects. \n\nAny large scale company or business will always collect a ton of data most often stored in texts such as spreadsheets or databases (which requires programming knowledge to navigate through). A common issue large companies have is simply having too much data. Palantir creates software that consolidates a company's data and displays it in a comprehensible, easily digestible user interface for the company to use. This allows Palantir to work with companies/organizations like the CDC for medicine, the military for national security, etc. \n\nWith Palantir, a normal non-technical operator can click their computer to pull up an order, or an issue that Palanrie detected, make any changes and or notify whoever needs the attention. Let's take the CDC for example. When the vaccine rolled out, Palantir had a huge hand in this. Palantir gives a visual display of where the vaccine is going, how many, and any issues that have risen (if any), allowing for fast response time. For example, Palantir could display a map with the various routes to different deployment sites with pictures of a little truck representing the shipments being routed to their destination. An operator could click one of these shipments/routes and pull up any data of that specific point. With data being displayed and organized in this way it makes it easy to analyze data, where things are going, and what kind of picture the data represents, rather than staring at a spreadsheet of numbers. This is just one example, Palantir is customizable enough where it can represent any business/organization's structure.\n\nPalantir’s revenue streams consist of their two main software: [Gotham](https://www.palantir.com/palantir-gotham/), which was designed primarily for the defence and intelligence sector, and [Foundry](https://www.palantir.com/palantir-foundry/) for the commercial sector. However, the platforms are not exclusive to either sector. For example, Gotham is also offered to commercial customers in the financial services industry. The two platforms can either be used separately or bundled together as a single ecosystem. Currently, revenue is more or less evenly split between the government and commercial sectors. \n\nGotham’s main tools include:\n\nGaia – lets users plan, execute, and report on operations via a shared live map. Live maps track real-time data and users drag and drop objects from other Gotham applications directly into Gaia.\n\nDossier – is a live collaboration document editor to share analysis and discover intelligence. Users can collaborate across teams and organizations to create a living, interactive, and up-to-date document.\n\nVideo – an application designed to interact with both streaming and historical video data. Users can review video footage in the platform as well as enhance raw footage with geospatial information and overlays based on other data sources.\n\nFoundry’s main tools include:\n\nContour – enables exploration of large-scale data. Users can filter, join, and visualize datasets to answer analytical questions and publish the results as a report or new dataset that will automatically update with the underlying datasets.\n\nObject Explorer – allows users to interact with data represented as objects – like customers, equipment, or plants – rather than rows in a table.\n\nAs we know, Palantir started in the defence and intelligence space. This required Palantir to have elite-level security from the start. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This was no easy feat, however, Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has IL-5 clearance with the Department of Defense, which makes them 1 of 4 software companies with this level of clearance, alongside Oracle, Salesforce, and SAP (Google and Snowflake have IL-2 clearance). It has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of classified information.\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology is and should provide ease of mind to companies that they are in business with.",
        "subreddit": "stocks",
        "title": "Palantir - A long Term Winner",
        "url": "https://www.reddit.com/r/stocks/comments/opjk2g/palantir_a_long_term_winner/",
        "created": 1627006287.0
    },
    {
        "author": "reggiebergst",
        "created_utc": 1625774613,
        "id": "ogf7ni",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n|CEO|Approval Rating|% return since becoming CEO until Glassdoor article (6/15/2021)|\n|:-|:-|:-|\n|\\#2 Shantanu Narayen (Adobe)|99%|1184.75%|\n|\\#4 Gary C. Kelly (Southwest Airlines)|98%|286.21%|\n|\\#5 Alfred F. Kelly, Jr. (Visa)|97%|196.53%|\n|\\#6 Satya Nadella (Microsoft)|97%|610.76%|\n|\\#8 Ed Bastian (Delta Airlines)|97%|5.88%|\n|\\#10 Horacio D. Rozanski (Booz Allen Hamilton)|97%|208.29%|\n|\\#11 Mathew Flannery (United Rentals)|97%|140.79%|\n|\\#12 George F. Colony (Forrester)|97%|288.77%|\n|\\#13 Andrew Anagnost (Autodesk)|97%|162.13%|\n|\\#15 Marc Benioff (Salesforce)|97%|6041.27%|\n|\\#16 Pat Gelsinger (Intel)|96%|\\-7.17%|\n|\\#17 Brian Halligan (Hubspot)|96%|1741.65%|\n|\\#18 Jeffrey A. Stoops (SBA)|96%|2809.28%|\n|\\#19 Calvin McDonald (Lululemon)|96%|165.08%|\n|\\#21 Aneel Bhusri (Workday)|96%|376.09%|\n|\\#23 Vas Narasimhan (Novartis)|96%|23.40%|\n|\\#25 Michael F. Mahoney (Boston Scientific)|96%|670.27%|\n|\\#29 Alex Gorsky (Johnson &amp; Johnson)|95%|154.04%|\n|\\#30 Daniel Springer (Docusign)|95%|530.46%|\n|\\#31 Jensen Huang (NVIDIA)|95%|43286.59%|\n|\\#32 Tim Cook (Apple)|95%|864.58%|\n|\\#35 Christophe Weber (Takeda Pharmaceuticals)|95%|\\-29.87%|\n|\\#37 Bill McDermott (ServiceNow)|95%|94.43%|\n|\\#38 Richard D. Fairbank (Capital One)|95%|2941.46%|\n|\\#39 Fabrizio Freda (Estée Lauder)|95%|1707.82%|\n|\\#41 Mark S. Hoplamazian (Hyatt)|94%|192.86%|\n|\\#42 Robert M. Davis (Merck)|94%|\\-2.94%|\n|\\#43 Jason Randall (Appfolio)|94%|248.94%|\n|\\#45 Jon Kessler (HealthEquity)|94%|354.63%|\n|\\#48 Alan D. Schnitzer (Travelers)|94%|33.66%|\n|\\#49 Paul Markovich (Blue Shield)|94%|510.97%|\n|\\#54 Kevin A. Lobo (Stryker)|94%|390.78%|\n|\\#57 Laurence D. Fink (BlackRock)|93%|6135.03%|\n|\\#58 Tom Polen (BD)|93%|\\-14.46%|\n|\\#62 James P. Gorman (Morgan Stanley)|93%|193.43%|\n|\\#63 Eric S. Yuan (Zoom)|93%|479.03%|\n|\\#64 Gary S. Guthart (Intuitive Surgical)|93%|682.53%|\n|\\#65 Tricia Griffith (Progressive Insurance)|93%|182.07%|\n|\\#70 Stu Sjouwerman (KnowBe4)|93%|\\-2.69%|\n|\\#71 Jay Chaudhry (ZScaler)|92%|528.45%|\n|\\#73 Vlad Shmunis (RingCentral)|92%|1367.75%|\n|\\#76 Worthing Jackman (Waste Connections)|92%|29.60%|\n|\\#77 Pascal Soriot (AstraZeneca)|92%|147.85%|\n|\\#78 Rene F. Jones (M&amp;T Bank)|92%|\\-9.70%|\n|\\#79 Dan Burton (Health Catalyst)|92%|43.07%|\n|\\#80 Steve Beauchamp (Paylocity)|92%|576.47%|\n|\\#81 Craig Jelinek (Costco)|92%|380.19%|\n|\\#82 Stewart Butterfield (Slack)|92%|19.91%|\n|\\#84 Brian T. Moynihan (Bank of America)|91%|163.80%|\n|\\#85 Willie Newman (Homepoint)|91%|\\-41.61%|\n|\\#86 Mark Aslett (Mercury Systems)|91%|388.20%|\n|\\#87 Gary Dickerson (Applied Materials)|91%|817.54%|\n|\\#90 Sundar Pichai (Google)|90%|253.64%|\n|\\#91 Jane Fraser (Citi)|90%|15.13%|\n|\\#92 Hugh Frater (Fannie Mae)|90%|73.48%|\n|\\#93 George D. Schindler (CGI)|90%|93.02%|\n|\\#95 Jonas Prising (Manpower)|90%|65.62%|\n|\\#96 Richard D. Fain (Royal Caribbean Group)|90%|845.92%|\n|\\#98 Charles Meyers (Equinix)|90%|84.10%​|\n\n\\*Public companies on this list have returned 1481% in approximately 8 years with the CEOs on this list.\n\n\\*Some CEOs have been in their positions for a few decades while others, less than a few years. \n\n\\*While some of these companies have had nice returns, what this really shows is buying and holding is the way to go. Long term, great companies will reward investors. \n\n\\*Companies shown on here that have underperformed (severely) in comparison to those companies with higher returns doesn't show the lifetime performance of a given company. The reason could be the CEO hasn't been in the current role for very long and/or the company is facing short-term challenges. \n\nHere is a visual of this table in an [infographic form](https://i.imgur.com/vBwjEfo.jpeg).",
        "subreddit": "stocks",
        "title": "Stock Performance of CEOs Listed on Glassdoor's Top CEOs of 2021",
        "url": "https://www.reddit.com/r/stocks/comments/ogf7ni/stock_performance_of_ceos_listed_on_glassdoors/",
        "created": 1625803413.0
    },
    {
        "author": "foyerhead",
        "created_utc": 1625189035,
        "id": "obzv11",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I've been struggling these past few months at settling on a portfolio that I was happy with. I am young (23), so I wanted my investments to take advantage of that by being more aggressive with growth. At the same time, I realize that the current market is overextended, and a lot of the companies I really like are trading with a lot of that growth priced in. So, I wanted to put together a portfolio that would satisfy my risk/reward tolerance without having to pay a hefty premium.\n\nThe two pieces of advice that I greatly resonate with are:\n\n1. Invest in a great company at a good price &gt; good company at a great price\n2. concentration builds wealth, diversification preserves it\n\nSo I wanted to keep the number of stocks low (&lt;10) and put my money in companies for which I have high conviction. I started out by first creating a list of sectors that I think are best set up for hyper-growth in the next 10-20 years. For me, those are:\n\n* Tech &gt; Information &amp; Communications / AI, AR, and Automation / Cyber Security\n* Financial Services &gt; FinTech\n* Healthcare &gt; Health Tech &amp; Genomics\n* Consumer Cyclicals &gt; Internet Retail / Gambling\n* EVs\n\nObviously, that list is not exhaustive, but those are the areas I feel the most comfortable with and in which I can see the long-term potential. I used that list as a starting point to look into companies and solidify the ones that will make up my portfolio. Some of the positions are more speculative than others, but I have found to have a compelling enough business model for me to invest in. If you have any criticism or suggestions, please comment below! I'm always looking to learn and discover great companies!\n\n# Portfolio Holdings:\n\n**FB**\n\nFor me, this was a no-brainer. The fundamentals are absurdly strong; pretty much no debt with a boatload of free cash. Consistent share buybacks (although not much) and increase in revenue. Outside of the main platform, it owns Instagram and Whatsapp which are incredibly sticky apps. Not to mention all the other projects they have going on (Occulus, FB Watch, etc.). What appealed to me the most was the fact that their ROIC is one of the best compared to the other FAANG stocks. There's also still room for ARPU to grow, especially on the international level. Instagram is also getting reworked to increase monetization. This stock is still undervalued/fairly valued and has, in my opinion, a lot more growth compared to some of the other FAANG companies.\n\n&amp;#x200B;\n\n**SOFI**\n\nI wanted a piece of the fintech space, but the industry leaders PYPL and SQ are way too expensive for me to justify starting a position now. Comparatively, SOFI is trading way below their multiples and there's a lot to like about this company. With SPACs, a lot of the time the fundamentals do not match up to the hype they receive. However, SOFI's Q1 report showed tremendous YOY growth with promising guidance. They also show an increase in the number of users that use more than one of their services, which is an extremely important part of their identity. Now bears may say that this company lacks a moat because traditional banks can just enter the space easily, however, that's not considering one of the most compelling parts of this company, which is their acquisition of Galileo, a payment processor that is integrated with over 90% digital banks in North America and over 70 of the top 100 FinTech companies. So, even as more competitors enter the space, SOFI stands to benefit from that.\n\nNot to mention their management team is stacked with talent. What really sealed the deal for me was the vision of CEO Anthony Noto. In a recent interview, Noto states that the reason SOFI hasn't gone international, despite the interest, is that they wanted to keep refining the product and make sure it can suit the user as best as it can before expanding overseas. This is a CEO that really cares about what they're building and the people who use it.\n\nThere's a lot of tailwinds for this company, and even if the fed does increase interest rates in 2022/23, they only stand to benefit.\n\n&amp;#x200B;\n\n**DKNG**\n\nThis position hinges on political policy, but I'm optimistic about it given how smooth the process of legalizing online betting in the US has been so far. The balance sheet may not be the cleanest, but companies like these typically spend a lot upfront in the form of CACs, and they've done an amazing job in that regard at making this company a household brand. Q1 2021 reports that monthly unique payers (MUPs) increased 114% yoy.\n\nThere's so much growth ahead in the short and long term. Over half the country has legalized betting (in some shape) in 3 years. The gambling market size is predicted to undergo hyper-growth in the next 10 years. Furthermore, DKNG has expressed interest in the esports scene, which is also something that has and will see explosive growth.\n\nWith that all said, I don't think the stock is cheap, and there are definitely a lot of risks here, but I believe in what they've done so far and can see a lot of upside in the long term.\n\n&amp;#x200B;\n\n**ABBV**\n\nI was between this and BMY, and I might end up just going 50/50 in both. Great fundamentals, a lot to like. Strong top-line revenue growth yoy and a lot of free cash flow. Share buybacks every year, except for the most recent when they issued shares to raise money for their acquisition. There's some concern that HUMIRA, their most popular drug which makes up about 50% of their revenue, has its exclusivity period ending 2023, but their recent acquisition of Allergen positions them well for the future. ABBV is certainly not a crazy hypergrowth stock, but they still have room for growth and their dividend is king. Especially now, when it's trading at a very reasonable valuation, it's a great time to buy in.\n\n&amp;#x200B;\n\n**BABA**\n\nI'm sure this stock needs no explanation on this sub. I really think this stock, or the likes of TENCHY, belongs in every portfolio that's focused on long-term growth at a reasonable price. So unless you're extremely against Chinese companies and the risk they may present, this is an absolute steal at these prices. In fact, right now most U.S companies are overvalued whereas almost every Chinese stock is undervalued.\n\n&amp;#x200B;\n\n**COIN**\n\nI stayed far away from buying into this company when it IPO'd. Now it has fallen to a pretty reasonable valuation, so I decided to start a small position. I hold a small crypto portfolio myself and although I don't think crypto will replace fiat money, I still see a lot of potential in it long term for a variety of uses. If you don't believe in crypto at all, then it's a lot harder to justify buying into this company.\n\nCOIN itself is one of the most popular crypto exchanges and they posted blistering numbers in their 2021 Q1 report. Granted, a lot of that was tied to the initial explosion of crypto in mainstream media, but the conservative projections for the full year of 2021 are still great. Crypto is still in its infancy in terms of mainstream support and use and the potential TAM is massive.\n\nThat said in the short term, there will be a lot of volatility with this stock. That's why I'm starting with a very small position, with the intention to add if the numbers and guidance continue to impress. Bear cases made of COIN usually rests on the fact that there is nothing proprietary about COIN or that they depend too heavily on transaction fees, which I fully acknowledge, but they have the name recognition and the biggest userbase, and it'll be up to their management team to make the right moves and continue to innovate. I'm still learning about the crypto space, but there's a lot more than just a means of exchange.\n\n&amp;#x200B;\n\n**CLF**\n\nAmerican steel. Steel futures have been unstoppable lately, with the re-opening and word that an infrastructure deal is in the works, there's a lot to like about steel. News of China pulling back from steel exports also allows American steel to be more competitive in the marketplace. Yet, despite all these catalysts, the prices of companies like CLF are still lagging behind. This is not your typical growth play, and I personally see this as a short-term (6-12 months) position, due to steel's cyclical nature. I'll also admit I got into this a few months before when CLF was sitting at 18 a share. Still, CLF is poised to gain a lot, and quite a lot to like about this company. The management team under Lourenco Goncalves has revitalized CLF, making big acquisitions of AK Steel and ArcelorMittal USA. He's also recently gone and raised Q2 2021 guidance, and there's reason to believe that even that was conservative for how hot the industry is currently. \n\nIf you're interested in learning more about the thesis behind steel, I'd suggest checking out r/Vitards. Anyways, I don't know if I'm going to hold this position for say 10+ years, so I'll be looking to capitalize on some short-term gains and use those profits to either open up a new position or fuel my current investments.\n\n&amp;#x200B;\n\n**TDOC**\n\nThis is also a very speculative position, similar to COIN. After the major pullback, I believe TDOC is at a very fair evaluation. Despite posting another quarter without profit, there's a lot to like about this company. They have one of the highest NPS scores, significantly greater than AMZN and APPL, which is something that's very compelling and which is something the balance sheet doesn't reflect. Combine that with the fact that they have captured a big chunk of the market, with healthcare professionals and big institutions, makes the company very, very sticky. Even if it only is the \"Zoom for healthcare,\" the quality is strong enough that users won't just drop it for just any other substitute. \n\nBut it's not just the \"Zoom for healthcare\". The acquisitions it has made, both BetterHelp and Livongo, have amazing implications and have yet to show their full potential on TDOC's balance sheet. There's still so much of the healthcare space that can be innovated, and TDOC is primed to take over.\n\nFor right now, I'm OK with TDOC being unprofitable even with the pandemic pushing it along so well. That tells me they're funneling their revenue back into research and development to continue to build up its services and revenue streams.\n\nI also believe that telehealth is still in its infancy, and even though it was massively adopted during COVID, that only accelerates its long-term use and adoption by a little bit. It's going to take a while before it becomes sophisticated enough for people to see the value. This is a long-term play to which I will be consistently adding.\n\n&amp;#x200B;\n\n**BARK**\n\nBarkbox features in delivering monthly care packages for dogs on a subscription basis. This is something that's not as hyped as EVs, but pet care is a fast-growing market that sees more spending each year. In fact, quarantine boosted the number of pet owners in the US dramatically. Barkbox has seen tremendous yoy growth in revenue and subscriptions, with a CAGR, gross margins, and a returning customer rate that beats the industry leader CHWY as well as other popular brands. BARK has made a lot of partnerships with the likes of AMZN, WMT, TGT, etc., and looks to continue to expand vertically in the space of dog hygiene/medicine/food. All of this while trading at a much lower multiple than the other big pet care brands. \n\nThe management team is fantastic. Manish Joneja, CEO of BARK, has 2 decades of experience as director of Amazon global exports and expansion and 5+ years on eBay as product lead. Carly Strife and Henrik Werdelin have been featured in Forbes 30 under 30 and Top 100 Most Creative/Top 100 people in tech, respectively. \n\nThe bear case of this company is that they have no moat, but their customer retention speaks a lot to brand loyalty and satisfaction. CHWY also has a box subscription service for dogs, however, it's nowhere close to as popular as BARK. BARK is also expanding internationally, starting first with Australia.\n\nWill it get to where CHWY is? That part isn't clear and it depends on how well BARK is able to build on what it has and expand what it has to offer. But the stock has a lot of room to run given the current valuation, and the product is sticky enough to either allow them to succeed or be a target for an acquisition. \n\n\\-\n\nI want to get into a genomics stock but I haven't read up enough to be confident in opening a position yet. I think I'd either go with ARKG, or the likes of CRSP/BEAM/XTG. \n\nI have my eye on a couple of companies that I would love to get into for the right price. However, they are currently way too overvalued for my liking. \n\n* CRWD/NET/S (Cybersecurity in general)\n* ABNB\n* PINS\n* DUOL (IPO set for 2021)\n* AI/PATH\n* CRM\n* ETSY\n* PYPL/SQ\n* PTON\n* EVs (TSLA/Nio/etc.)\n* STEM\n* FIGS",
        "subreddit": "stocks",
        "title": "Building a Growth at a Reasonable Price (GARP) Portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/obzv11/building_a_growth_at_a_reasonable_price_garp/",
        "created": 1625217835.0
    },
    {
        "author": "TheStonksHub",
        "created_utc": 1626621121,
        "id": "omsciq",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": " **Overview**\n\nWhat is exactly is Global-E? They are a company that integrates with e-commerce platforms to remove complexity with international transactions and provide localized solutions that improve the online shopping experience. The core of the services revolve around the following (from the S-1):\n\n&amp;#x200B;\n\n&gt;“The vast capabilities of our end-to-end platform include interaction with shoppers in their native languages, market-adjusted pricing, payment options tailored to local market preferences, compliance with local consumer regulations and requirements such as customs duties and taxes, shipping services, after-sales support and returns management. These elements are unified under the Global-e platform to enhance the shopper experience and enable merchants to capture the cross-border opportunity.”\n\n&amp;#x200B;\n\nThey are the “plug and play” of making e-commerce international. Their vast network of APIs allow a customer to simply integrate their platform and seamlessly begin selling across different borders and languages. Here’s what they do.\n\nhttps://preview.redd.it/iu033n8ylzb71.png?width=1446&amp;format=png&amp;auto=webp&amp;s=80b6e7ff09081d8ec26559daaba269f34c0a742e\n\nCurrently, Global-E supports:\n\n* Local messaging in over 25 languages\n* Purchases in over 100 currencies\n* Accepts over 150 payment methods\n* A multitude of competitively-priced shipping options\n\n&amp;#x200B;\n\n**Business Model**\n\nGlobal-E generates revenues by charging a fee (“service fee”) for the integration of their platform into a merchant’s services. Service fees are highly variable based on transaction volume, destination markets, level of customer service provided, etc, and are generated as a percentage of the Gross Merchandise Value (“GMV”) that flows through the platform. Global-E mandatorily bundles certain components of their integrated platform solutions that they believe are essential for achieving improved sales conversions from international traffic. However, their fulfillment services are offered on an optional basis and merchants can choose to utilize those services or cancel at any time. Think of it as bundling service A and B to have the greatest effect, while offering service C as an add-on component. Service fees make up for approximately 35% of revenue while fulfillment services are currently accounting for roughly 65%.\n\n&amp;#x200B;\n\n**Partnerships &amp; why they use Global-E**\n\nGlobal-E has formed many key technological as well as service partnerships. These third-party e-commerce platforms include: Salesforce Commerce Cloud, Shopify, BigCommerce, Magento Commerce, SAP, WooCommerce, PrestaShop, and others.\n\n&amp;#x200B;\n\n*What they do for merchants?*\n\nSome of the key benefits they provide for merchants are:\n\n* increased sales conversions: converting international traffic\n* offloading complexities: handling local pricing, payment collection, import duties, fraud, etc \n* reduction of risk: reduce legal complexity, manage import duties and taxes, handle compliance\n* enabling growth to new markets: allowing merchants flexibility to expand to cross-border opportunities\n\nAll while emphasizing merchant branding. The customer always faces the digital store-front and never leaves the brand page to check-out.\n\n&amp;#x200B;\n\n*What they do for shoppers?*\n\nGlobal-E’s goal is to offer a frictionless shopping journey, regardless of the origin of the customer. This means:\n\n* Localized languages\n* Re-pricing in local currencies\n* Handling cross-border payments\n* Accurately pre-price import duties and taxes and include them in the final cost of the product\n* Delivery: using an extensive network of over 20 shipping carriers they are able to offer multiple shipping modes at attractive rates.\n* After-sale support and returns\n\nMerchants integrating Global-E into their platform generally experience a significantly higher international traffic conversion rate (often exceeding 60%). The Global-E platform removes many complexities involved with international expansion. They already have more than 400 merchants, from small companies to globally-recognized retailers, on the platform across various diversified verticals.\n\n&amp;#x200B;\n\n**Shopify Deal**\n\nAs mentioned above, one of Global-E most lucrative partners lies with Shopify making them the exclusive third-party and cross-border solution across the large network of Shopify merchants. Shopify knows what kind of business that will bring for Global-E and thus Shopify has bought 7.75 million shares and acquired a **6.5% stake** in the company. As Shopify grows Global-E grows and Shopify knows this, hence the stake in a company that reflects their own revenues by proxy.\n\n&amp;#x200B;\n\n**TAM, &amp; CAGR**\n\nFirst came the transition to domestic e-commerce as well as sourcing and reselling products from China (aka Dropshipping). Next is going to be the transition of global e-commerce and cross-border sales. According to this 225 page **research by GlobeNewsWire**, the global cross-border B2C e-commerce market was 780 billion in 2019 and expected to grow at a CAGR of 27% through 2026 where it will become a 4.82 trillion market.\n\nhttps://preview.redd.it/96veafozlzb71.png?width=1680&amp;format=png&amp;auto=webp&amp;s=6d3fc8afcb51b413dbdbb3deb95b24fadf89d313\n\n&amp;#x200B;\n\n**Global-E’s Smart Insights**\n\nOne of the company’s strengths lies within sophisticated “Smart Insights” they use to scale their applications. Smart Insights is a “big data” network that uses various metrics such as country, price-point, and shopper behaviors allowing Global-E to provide highly-optimized experience for shoppers. This ends up driving increased conversion rates and revenues for the merchant and a better overall experience for the shopper. The company has noted by integrating big-data into their platform they can experience “economies of scale” as well as “economies of skill” enabling them to optimize merchants’ cross-border sales. These insights are continuously expanding as they collect additional data points along the purchasing journey.\n\n&amp;#x200B;\n\n**Competitive Advantage &amp; Growth Opportunities**\n\nWhat seems to be becoming more of a trend since 2020 and even more so now in 2021 are corporation’s use of big data. I’m not talking about basic user data such as age, gender, location, but more on the lines of vastly large information networks. These networks can utilize things such as time spent on page, scrolls, and clicks all in one massive database. Global-E differentiates themselves through their main data asset (“Smart Insights”) that informs them on certain decisions and is able to optimize how merchants sell their product across different borders. They integrate this data network into a flywheel effect, for example: their current analytics drives more sales to merchants, which then feeds new data back into the system, which then allows for higher optimization and better conversions. They feed into each other back and forth getting smarter with each website visitor and purchase. This aligns perfectly for their products “Net Dollar Retention Rate” of 134% and 172% in 2019 and 2020, respectively.\n\n&amp;#x200B;\n\nGlobal-E attributes much of their growth to being a first mover (and doing it right) in the cross-border e-commerce space. Their success has been accelerated by several key factors, such as:\n\n* Accelerated shift towards e-commerce outpacing traditional retail\n* Cross-border e-commerce growing faster than domestic e-commerce\n* Their merchant’s strategic focus on D2C sales, maintaining relationship with shoppers globally\n* The complexity and limitations of leaving the merchant responsible for implementing what Global-E offers. This doesn’t come down to just a cost, but also time-intensive as well as being difficult to maintain and scale\n* Covid-19 tailwinds\n\n&amp;#x200B;\n\nAs a result of the above and other market factors, the cross-borders e-commerce market is expected to continue the surge in growth. I previously mentioned the forecast in TAM however, Forrester, a research company, also expects the cross-border e-commerce markets to reach $736 billion by 2023.\n\nGlobal-E has several opportunities to expand on existing channels and capture new markets. This can be done with:\n\n* Growth through existing portfolio of merchants and strengthening relationships\n* Acquiring new merchants in existing geographies\n* Expanding in new geographies that they don’t have exposure to\n* Continue to expand and innovate their platform\n* Continue to develop strategic partnerships (with key brands and players)\n\n&amp;#x200B;\n\n**Risks**\n\nMany of Global-E’s risks fall under the category of general business risks. Some of these include: retaining old merchants and attracting new ones, failing to enhance the platform as well as successfully competing against new and existing competition, failing to manage growth, pricing pressures from competition, and being highly dependent on cross-border regulations, sales, and operations.\n\n&amp;#x200B;\n\n**Revenues, Scale, &amp; Profitability**\n\nIn FY 2020 Global-E helped process 4.6 million orders for their merchants generating $136.4 million. Their Gross Merchandise Value (GMV) also grew to 774 million for the same period. Other impressive metrics were their net dollar retention rate and gross profit as % of revenue both of which continue to climb at 172% and 31.9%, respectively. Stellar!\n\nhttps://preview.redd.it/2quy1ct0mzb71.png?width=1074&amp;format=png&amp;auto=webp&amp;s=cf2d87fbd8f20317fe7d69d27c639fcf6132c5f9\n\nSome key growth metrics the company has seen in 2019 and 2020.\n\nhttps://preview.redd.it/o25hb862mzb71.png?width=1184&amp;format=png&amp;auto=webp&amp;s=acb11f768d6c2f19dae64fdbaa43d4be321e92bb\n\nAlthough the company has recently turned a profit while growing top-line revenue and GMV at a high pace. The company suggested that short-term profitability might be sacrificed due to the expansions they are making to cover larger markets. As noted from the S-1:\n\n&amp;#x200B;\n\n&gt;“We expect our operating expenses to significantly increase over the next several years as we hire additional personnel, expand into new geographies, expand our partnerships, operations, and infrastructure, continue to enhance our platform, develop and expand its features, integrations and capabilities, expand and improve our service offering and increase our spending on sales and marketing. We intend to continue to build and enhance our platform through internal research and development and we may also selectively pursue acquisitions.”\n\n&amp;#x200B;\n\nLet’s take a quick peak at their consolidated statement of operations. Note the revenue growth and total operating expenses that *decreas*e, as a percentage of total revenue, as revenues increase (almost doubles YoY).\n\nhttps://preview.redd.it/tsq4hmx3mzb71.png?width=1656&amp;format=png&amp;auto=webp&amp;s=caa3a9af7e659b3e3721817a5dad8e06495dba72\n\n**Valuation**\n\nLooking at GLBE’s valuation it is clear that you pay a premium when owning this company.\n\n&amp;#x200B;\n\n*The Good*\n\nGLBE is growing revenue at 134% YoY.\n\nGross margins are improving while the company continues to scale.\n\nMany tech and services partnerships they can piggy back on.\n\n&amp;#x200B;\n\n*The Bad*\n\nConsistent profitability could be years away as the company is investing heavily into their own expansion of current and new markets.\n\nGLBE is currently trading at roughly 50x price to sales and 260 forward P/E.\n\n&amp;#x200B;\n\n*Up for Debate*\n\nGlobal-E has almost no long-term debt, but current liabilities are stacking up while the company is not generating much FCF. I wouldn’t expect them to be generating this much FCF this early in the game after their IPO.\n\nLock-up expiration on August 11, 2021.\n\n&amp;#x200B;\n\n**Final Thoughts**\n\nIn my opinion Global-E is top of the class when it comes to their business. They are growing extremely fast while improving margins and this is the premium you would pay versus investing in a “stable” company generating tons of FCF, but not much growth. Due to the nature of being a high-growth stock there will naturally be more volatility around the trade. While it’s currently trading at 50x price/sales I am more likely to shy away from entering a new position. We could see this stock swing to 40x p/s and potentially enter on the dips.\n\nThis is somewhat of a chicken or the egg situation because there might not be any dips to buy with this kind of growth. For example, at current growth rates (100-135% YoY) if stock price is maintained it would only be trading at less than half it’s price/sales valuation only one year from now. This is definitely a stock to monitor closely if you are wanting to find the right entry point for a long-term hold.\n\n&amp;#x200B;\n\n**TLDR;**\n\n1. Global-E is an “enabler” that allows e-commerce and digital stores to seamlessly integrate international transactions. They deal with tasks from translations, currency re-pricing, international shipping &amp; returns, compliance &amp; tax regulations, etc.\n2. GLBE integrates their proprietary “Smart Insights” application that analyses customer shopping and transaction data to continuously improve on sales conversions. The feedback loop is always learning as it collects more and more data along each customer’s purchase journey.\n3. GLBE is trading at a rich valuation given their total revenue was $136 million in 2020. However, they are growing top-line revenues and Gross Merchandise Value (GMV) over 130% Y.o.Y. Shopify holds a 6.5% stake in Global-E as GLBE facilitates a large amount of transactions on the Shopify network. As Shopify grows, GLBE grows.\n4. GLBE is growing through many tailwinds such as those from covid lockdowns and accelerated shift toward e-commerce outpacing traditional retail. They’ve got an opportunity to expand into more international regions, strengthen relationships with existing merchants, while continuing to expand and improve their platform.",
        "subreddit": "wallstreetbets",
        "title": "The Weekly DD - Global-E Online (GLBE): The Uncut Diamond",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/omsciq/the_weekly_dd_globale_online_glbe_the_uncut/",
        "created": 1626649921.0
    },
    {
        "author": "gorays21",
        "created_utc": 1626809901,
        "id": "oo9dq6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Here are some of Reddit's favorite companies with upcoming earnings dates:\n\n&amp;#x200B;\n\n* **Tesla** \\- July 26th\n* **Alphabet** \\- July 27th\n* **AMD** \\- July 27th\n* **Microsoft** \\- July 27th\n* **Apple** \\- July 27th\n* **Paypal** \\- July 28th\n* **Facebook** \\- July 28th\n* **Amazon** \\- July 29th\n* **Alibaba** \\- August 3rd\n* **Etsy** \\- August 4th\n* **Square** \\- August 5th\n* **Cloudflare** \\- August 5th\n* **Draftkings** \\- August 6th\n* **Roblox** \\- August 9th\n* **Airbnb** \\- August 12th\n* **Disney** \\- August 12th\n* **Coinbase** \\- August 12th\n* **Sea Limited** \\- August 17th\n* **Nvidia** \\- August 18th\n* **Salesforce** \\- August 24th",
        "subreddit": "stocks",
        "title": "Upcoming Earnings Dates for Reddit's favorite companies!",
        "url": "https://www.reddit.com/r/stocks/comments/oo9dq6/upcoming_earnings_dates_for_reddits_favorite/",
        "created": 1626838701.0
    },
    {
        "author": "gemparkanbj",
        "created_utc": 1625487136,
        "id": "oe642n",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "This is a DAMN GOOD start for the week. For everyone who asked «where can I get it» and «Can’t see it on my app» and so on:\n\n**Quote** [**https://www.xigemtechnologies.com/xigem-technologies-applies-to-trade-on-otcqb/**](https://www.xigemtechnologies.com/xigem-technologies-applies-to-trade-on-otcqb/)\n\n&gt;Xigem Technologies Corporation (CSE:XIGM) (FSE:2C1), a technology provider for the emerging remote economy, announced that it has filed an application with the OTC Markets Group for its common shares to trade on the OTCQB.  \n&gt;  \n&gt;“Trading on the OTCQB would be a meaningful step in enhancing shareholder value,” said Brian Kalish, co-founder and CEO of Xigem.  \n&gt;  \n&gt;Xigem looks forward to working with these parties to complete the Company’s OTCQB application process during the third quarter of 2021.\n\nSo Q3 as you probably know is July-September. If you have Questrade or some other magic broker that has $XIGM (spoiler: almost nobody has it at this moment), here are the reasons I'm loading more:\n\n* Uplisting means a new market, more people, more money, price growth. Morningstar reported that it’s fair price is over 1$ and today’s 0,3 price is a joke. Now maybe it will look more realistic;\n* They’re developing and feel confident enough to face all the US SE bureaucracy - it means that they will close the deals, like promised, before August. [https://www.xigemtechnologies.com/xigem-technologies-provides-update-on-proposed-acquisitions/](https://www.xigemtechnologies.com/xigem-technologies-provides-update-on-proposed-acquisitions/) \n\nIt enters the US market in a good shape tho:\n\n* FinTech FOOi P2P app complete acquisition loi;\n* 21% shipping industry trackers ShipitTo acquisition loi;\n* iAgent CRM and workforce management platform developed and waiting for tests;\n* Bunch of clients for the platform, like Baketree, FluBusters and ISI, already signed to pay Xigem for it.\n\nTo the theories that they’re leaving CSE - they don't, now it's obvious why they needed the US pr advisors. Things stay the same, just more people will be able to buy it. No reinventing things under a new name. I’m not really experienced in it, but uplisting is supposed to be a sensitive process and you’re screwed HARD if you try to play tricks in the middle of it. No way back for them, just growth and more money.\n\n**tl;dr:** Xigem $XIGM, Canadian tech company with its own all-in-one solution for business management and a portfolio of remote economy companies, goes to OTC. Previously it was only on CSE and FSE so most people couldn’t buy it, I checked some old threads on it here and remember mine. Now people will be able to get it when the uplisting is done. Looks like some good gains are coming this summer.",
        "subreddit": "pennystocks",
        "title": "Xigem Technologies $XIGM announced it goes to OTCQB -&gt; more people will be able to buy -&gt; more volume and liquidity",
        "url": "https://www.reddit.com/r/pennystocks/comments/oe642n/xigem_technologies_xigm_announced_it_goes_to/",
        "created": 1625515936.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1626977526,
        "id": "opjkj7",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Palantir is an American software company that specializes in big data analytics, with a market cap of 43 billion. They started building software for the intelligence community in the US to assist in counterterrorism investigations by helping them identify patterns hidden deep within large data sets. Later, they realized that similarly to the intelligence community, commercial institutions did not have the most effective tools to manage and make sense of the data involved in large projects. \n\nAny large scale company or business will always collect a ton of data most often stored in texts such as spreadsheets or databases (which requires programming knowledge to navigate through). A common issue large companies have is simply having too much data. Palantir creates software that consolidates a company's data and displays it in a comprehensible, easily digestible user interface for the company to use. This allows Palantir to work with companies/organizations like the CDC for medicine, the military for national security, etc. \n\nWith Palantir, a normal non-technical operator can click their computer to pull up an order, or an issue that Palanrie detected, make any changes and or notify whoever needs the attention. Let's take the CDC for example. When the vaccine rolled out, Palantir had a huge hand in this. Palantir gives a visual display of where the vaccine is going, how many, and any issues that have risen (if any), allowing for fast response time. For example, Palantir could display a map with the various routes to different deployment sites with pictures of a little truck representing the shipments being routed to their destination. An operator could click one of these shipments/routes and pull up any data of that specific point. With data being displayed and organized in this way it makes it easy to analyze data, where things are going, and what kind of picture the data represents, rather than staring at a spreadsheet of numbers. This is just one example, Palantir is customizable enough where it can represent any business/organization's structure.\n\nPalantir’s revenue streams consist of their two main software: [Gotham](https://www.palantir.com/palantir-gotham/), which was designed primarily for the defence and intelligence sector, and [Foundry](https://www.palantir.com/palantir-foundry/) for the commercial sector. However, the platforms are not exclusive to either sector. For example, Gotham is also offered to commercial customers in the financial services industry. The two platforms can either be used separately or bundled together as a single ecosystem. Currently, revenue is more or less evenly split between the government and commercial sectors. \n\nGotham’s main tools include:\n\nGaia – lets users plan, execute, and report on operations via a shared live map. Live maps track real-time data and users drag and drop objects from other Gotham applications directly into Gaia.\n\nDossier – is a live collaboration document editor to share analysis and discover intelligence. Users can collaborate across teams and organizations to create a living, interactive, and up-to-date document.\n\nVideo – an application designed to interact with both streaming and historical video data. Users can review video footage in the platform as well as enhance raw footage with geospatial information and overlays based on other data sources.\n\nFoundry’s main tools include:\n\nContour – enables exploration of large-scale data. Users can filter, join, and visualize datasets to answer analytical questions and publish the results as a report or new dataset that will automatically update with the underlying datasets.\n\nObject Explorer – allows users to interact with data represented as objects – like customers, equipment, or plants – rather than rows in a table.\n\nAs we know, Palantir started in the defence and intelligence space. This required Palantir to have elite-level security from the start. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This was no easy feat, however, Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has IL-5 clearance with the Department of Defense, which makes them 1 of 4 software companies with this level of clearance, alongside Oracle, Salesforce, and SAP (Google and Snowflake have IL-2 clearance). It has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of classified information.\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology is and should provide ease of mind to companies that they are in business with.",
        "subreddit": "investing",
        "title": "Palantir - A long Term Winner",
        "url": "https://www.reddit.com/r/investing/comments/opjkj7/palantir_a_long_term_winner/",
        "created": 1627006326.0
    },
    {
        "author": "Btwn3n20charachters",
        "created_utc": 1627475300,
        "id": "ot8w9d",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Trying to be diversified between stocks/realestate/stable income. I know I'm tech heavy although SCHD is a nice balance. How's this look?\n\n&amp;#x200B;\n\n|AMZN|12%|\n|:-|:-|\n|PYPL|11%|\n|SBUX|10%|\n|AMD|9%|\n|TRMB|8%|\n|SCHD|7.5%|\n|ORCL|7%|\n|ZBRA|7%|\n|CRM|6.5%|\n|AMT|6%|\n|VNQ|5%|\n|BX|5%|\n|PFFD|5%|",
        "subreddit": "stocks",
        "title": "Thoughts on my diversification?",
        "url": "https://www.reddit.com/r/stocks/comments/ot8w9d/thoughts_on_my_diversification/",
        "created": 1627504100.0
    },
    {
        "author": "valuescott",
        "created_utc": 1625382177,
        "id": "odf85w",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": " \n\n**OMC**\n\n**Omnicom group inc.**\n\n**July 3, ‘21**\n\n# Omnicon DD\n\n## Company Summary\n\nOmnicom is an advertising agency that specializes in advertising, marketing and business communications services.  In a world of increasingly fragmented information streams (Different social media platforms, more and more places to list ads ...), OMC may find difficulty in growing their business and competing with large content providers for diversified revenue.  Since they are solely an advertising agency, they are not a direct competitor with facebook / twitter, but they will have to, and have been changing their approach to how they carry out their operations.  OMC can act as a middleman in advertising.  A business looking to carry out an advertising campaign would go to OMC and OMC would spread marketing content across many content providers.  \n\nTheir operations can be generalized into three categories: Advertising, Public relations, healthcare, and CRM stuff.  Here is the list of the distinct different services that they offer:\n\nadvertising, investor relations, branding, graphic arts/digital imaging, \n\nmarketing research, content marketing, media planning and buying,\n\ncorporate social responsibility consulting, merchandising and point of sale,\n\ncrisis communications, mobile marketing, custom publishing , non-profit marketing,\n\nmulti-cultural marketing, data analytics, database management, organizational communications,  \n\npackage design, digital transformation, product placement, digital/direct marketing ,\n\nentertainment marketing, promotional marketing, experiential marketing,  \n\npublic affairs, field marketing, public relations, sales support,\n\nfinancial/corporate business-to-business advertising, retail marketing,\n\nhealthcare marketing and communications, search engine marketing, instore design,  \n\nshopper marketing, interactive marketing, social media marketing, sports and event marketing\n\nManagement overview:\n\nFrom glassdoor, 95% of employees approve of the CEO.  Most reviews say that management encourages discussion and recommendations, but there are a few bad reviews related to the personal relationships between management and employees.  The CEO seems average. CFO and CEO do not have much info about them online.  The CIO seems like he knows what he’s doing, and has a lot of experience.  \n\n## Company history\n\nOMC was created from a three way merger in 1986.  The current CEO has been in his position since 1999.  The three way merger involved BBDO, DDB, and NHW.  BBDO was rated the world's most creative agency, DDB was one of the largest advertising networks in the world, and TBWA was ranked in the top ten agencies that utilize disruption to develop business changing ideas.  These companies all exist under OMC as subsidies where OMC acts as the holding company.  The three subsidies act independently of each other.\n\nBBDO was formed in 1919 in NYC.  Bruice Barton (the BB) was a philosopher and eventually a congressman and then almost a senator.  He has admitted that he was not a good match for the advertising industry.  Roy Durstine (the D) was more involved in the actual business.  He eventually became a workaholic, lost his wife, became an alcoholic and got fired in 1939.  Alex Osbor (the O) is a mystery.  BBDOs business then started to boom and they picked up some large clients in the early 40s.  There was a lot of turmoil in the company in the 50s and 60s as the old guys were replaced, and new clients were slowly being acquired as old ones were lost or went out of business.  They became very involved in advertising for the republicans during this time.  They did not do well in the 70s during the recession, which should not be forgotten today, but they managed to get by much better than other companies.    In 1976, a CEO started an 8 year tenure and managed to keep the company stable by employing special cost management measures so as not to waste the spoils of growth.  At the time of the merger, BBDO was the only of the three that was not experiencing financial difficulties.  BBDO agreed to the merger because the other companies had consistent international growth, which was apparently lacking in BBDO.\n\nDDB was formed in 1949 by three men all of whom had previous industry experience.  They had tremendous success early on, focusing on hiring the most creative people they could find and taking the road not traveled.  At the time, Polaroid was an unknown company.  They were one of the first four to be clients of DDB In the 60s they did work for Avis rentals and Volkswagen.  At the time, nobody wanted Volkswagens in America.  DDB was instrumental in changing this with their campaigns for the VW beetle, making the vehicle a major success in America. Following this success they won over many major clients such as Heinz, American Airlines, Mobil oil, and Gillette to name a few.  In 1982, William Bernbach (the B) died.  This caused earnings to plummet, and financial difficulty closely followed.  By 1986, they had lost some of their most important clients, including polaroid, which was probably their biggest success.  The merger was a no-brainer for them with the resources of BBDO.\n\nTBWA started in 1924.  They had a strong presence in the middle east.  They provided a lot of services to smaller companies that otherwise felt neglected by larger advertising agencies.  I cannot find anything interesting about them between 1924 and 1970.  In the 70s, they found it difficult to find investment interest, so they decided to become private.  They had by now acquired many blue chip clients such as xerox, mcdonalds, honda, and sears on top of their many smaller clients.  They lost mcdonalds and xerox leading up to the 198 6 merger, and there were some conflicts in the merger such as campbells soup threatening to leave TBWA because Heinz would be a client of the parent OMC after the merger.  \n\nProfits for OMC after the merger were low.  In the 90s, OMC grew revenues, and at the end of the decade, a new CEO was put in place and the company had begun to diversify into digital marketing.  In 1997, they were fortune's most respected advertising group.  In 1997, they won back McDonalds.  All throughout this period, they have been acquiring companies worldwide.  \n\nIn the 2000s, OMC lost its position as the world's largest advertiser to WPP.  OMC bought 19 companies in 2000. OMC was hurt by 9/11, but managed to rebuild with the rest of the country.  OMC aggressively pursued goals in hollywood.  When the Enron scandal happened, 7 of OMCs board members were ousted and OMC decided to commit to better corporate governance. By 2002, OMC was in good shape while rivals were restructuring and laying off employees.  \n\nGrowth afterwards was much more predictable.  OMC took on many blue chip companies as clients, and saw great client retention for the next two decades.   \n\n## Revenue Breakdown / Company segments\n\nTheir 100 largest clients represent 54% of revenue, and their largest client represents 3.4%.  They lost 11.7% of revenue in the past year, but given that the events last year are not typical, this is not expected to be a long term trend.\n\nTotal revenue is 13.171 billion.\n\n1. The Americas accounted for 8.752B of this.  North America had 7.577B and latin America had 0.275 B.\n2. Europe, Middle East, And Asia Accounted for 5.317 Billion.  Europe had 3.607B, Middle East/Africa had 0.207B, and Asia had 1.503B\n\nBecause this is an American company, the implications make sense.  Revenue is most concentrated in places that the company understands - westernized countries, leaving a lot of room for growth in emerging markets.  This growth may not be desired by the company due to the instability and tendency to default on debts in emerging countries.  \n\nRevenue streams:\n\nAdvertising: 7.369 B (56%)\n\nCRM: 3.308 B (25.1%)\n\nPR: 1.301 B ( 9.9%)\n\nHealthcare: 1.191 B (9.0%)\n\n## Industry position\n\nThey are the largest public advertising company, which brings pros and cons for any industry.  They will be missing out on a lot of revenue because they will be focusing on larger clients, while letting a lot of smaller ones slip by.  At the same time, they will get the largest contracts in the industry, and as a result they have been able to sustain the highest margins in the industry.\n\nTheir payout ratio (57%) is much higher than other dividend paying advertising agencies.  This has dual implications.  They are not retaining as much earnings, and they are not spending as much on internal investments.  It also means that they have reached a point where growth is organic and the company has a stable capital structure so they can and do pay out earnings that are not needed.\n\n## Company base statistics\n\nMarket Cap: 17.42B\n\nTotal Debt: 5.81B\n\nCash &amp; Liquid assets: 5.6B\n\nEnterprise Value:  20.01B\n\nEquity: 3.084B\n\nShares Outstanding: 217M\n\nEV/Sales: 1.517x\n\nEarnings: 0.975B\n\nROE: 34.4%\n\nEmployees: 64100, 20800 in the US, 27100 in north america, 25800 in europe and 11200 in asia\n\n## Overview/Growth and Developments\n\nGrowth: \n\n* There has been slow revenue growth over the last 15 years.  Recently it has decreased from what it was in 2014-2018.  Based on past data, it is likely to stay stable, and in the long term slowly grow.\n* Earnings have been positive for every quarter 15 years straight.  Growth is better than revenue with the last year being much lower than proceeding years.  This is expected for a large company, where they are slowly finding ways to increase profitability.\n* FCF is constantly at around 10% of the market cap.  It has not been growing, but rather fluctuating around 1.5-2 billion for the past 15 years.  This implies operational stability, but stunted growth.\n\nBased on the growth indicators above, OMC is not a growth stock.  It does have the characteristics of a classic value stock.\n\nMargins:\n\n* Profit margins have been quite low, and show slow growth.  Never negative (See earnings).\n* Gross margin is at around 17%.  It has been around this since 2013.  In 2013, there was a drop from 26% to 17%.  Before 2013 GM was above 22% every year.\n* Ebitda margin follows profit margin with +3%.\n\nNet reinvestment:\n\n* OMC has very little net reinvestment.  The nature of the business does not require much, but it would be something nice to see, especially if they decide to diversify into other industries.  \n\nShare buybacks:\n\n* OMC has consistently bought back shares every year for 15 years.  This and dividends are how they maximize shareholder value.  They have consistently bought back under 15 million shares per year, averaging around 10 million per year.  This is another indicator of their status as a traditional value stock.\n* They stated that they do not plan on any repurchase in the recent future.  This is a very smart move given the economic conditions.  This shows that management is willing to temporarily stunt shareholder value in order to preserve it in the long run.  This isn't something they have to disclose, so it is meaningful that they elected to do so \n\nCost of capital:\n\n* D/E has steady growth, and is at 1.6.  This is not very concerning because the company has capital reserves that can easily cover over 90% of debt, and most debt is long term.\n* Moodys assigned a baa1 credit rating with a stable outlook.  Meaning they have adequate ability to meet debt obligations.  \n* S&amp;P gave them BBB+ credit ratings on commercial paper.\n\nCosts:\n\n* Interest expenses are at 184M\n* Cogs represent almost all expenses\n* No R&amp;D ever - See reinvestment\n\nDebts: \n\n* Lots of LTD, covered by cash\n* 1.25B due 2022 - easily covered\n* 750 M due 2024- \\^\\^\n* Next 5y interest payments are 684.1 Million, manageable\n* Lease payments next 5y - 1.2B, manageable.  \n* Almost negligible pension plan payments.  309m obligation over time, 164m liability\n* 71.9 M earn out, 31.1M payable in 2021 (Where a company has an obligation to pay out earnings to the seller of a business they acquired - usually a condition of lower purchase price)\n* 101.6M foreign tax transition obligations, 11.6M payable in 2021.\n* Recently issued 600M debt, paid off older debt issues with the new issuance.  This is a standard practice.\n* Another issuance of longer term debt provided 600M to general corporate expenses including working capital expenditures, fixed asset expenditures and repayment of debt issues (They used the debt issue to finance general operating activities)\n* The terms of any debt that is issues is not subject to change in the event that credit ratings change\n\nThe capital obligations are manageable, and OCF currently covers and has in the past aptly covered obligations.\n\nAssets\n\n* Most cash coming from OCF.\n* Cash is managed daily internally.  A company treasury receives excess cash from operations and provides cash to operations when there is a need for it.  Great for keeping track of cash and also overseeing operations.\n* Company treasuries invest excess cash they have in short term maturity securities (1-90 day expiry on average)\n* 2.3 out of 5.6 B of cash is held by foreign subsidies.\n* Net debt decreased by 624M (Total debt - total cash)\n\nWACC: 10.6-.8%\n\nLong term growth rate: 3%\n\nLegal: Nothing large worth noting\n\nRecent/expected developments: Nothing worth noting\n\n## Valuation\n\nOMCs DCF Valuation is between $120-140.  Seeing that the company is experiencing slow growth and is not a well known company, this figure may not be an accurate price prediction but is nonetheless a devent valuation providing an adequate margin of safety.\n\nNote 1. Their use of EBITDA in their analysis is slightly reckless.  Not realizing interest expenses is not recommended in the industry.  Interest expenses are very real, as are taxes, and so they should be considered by a company when they are performing an internal audit.\n\nSources:\n\nTheir 10-K (This is where you really get to understand the capital and debt structure): [https://www.sec.gov/ix?doc=/Archives/edgar/data/29989/000002998921000004/omc-20201231.htm](https://www.sec.gov/ix?doc=/Archives/edgar/data/29989/000002998921000004/omc-20201231.htm)\n\nMacrotrends (Better than SEC for fast long term data, sometimes inaccurate): https://www.macrotrends.net/stocks/charts/OMC/omnicom-group/stock-price-history\n\nGlassdoor: https://www.glassdoor.ca/Reviews/Omnicom-Reviews-E1734.htm\n\nCIO Linkedin: [https://www.linkedin.com/in/chadi-farhat-2b421a76/](https://www.linkedin.com/in/chadi-farhat-2b421a76/)\n\nYahoo finance: [https://ca.finance.yahoo.com/quote/OMC/profile?p=OMC](https://ca.finance.yahoo.com/quote/OMC/profile?p=OMC)\n\nFinviz: [https://finviz.com/screener.ashx?v=121&amp;f=ind\\_advertisingagencies](https://finviz.com/screener.ashx?v=121&amp;f=ind_advertisingagencies)\n\nHistory: https://www.referenceforbusiness.com/history2/69/Omnicom-Group-Inc.html",
        "subreddit": "ValueInvesting",
        "title": "OMC Due Dilligence",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/odf85w/omc_due_dilligence/",
        "created": 1625410977.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1626700458,
        "id": "ondtb7",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/g741pim166c71.png?width=716&amp;format=png&amp;auto=webp&amp;s=4a346a61b34dc53a97e0ecd21eff30074b7dcdf3\n\n**Introduction**\n\n\tDocuSign (DOCU) is an electronic signature agreement platform. DOCU makes money by charging those who create contracts.\n\nMarket Cap (MKT Cap)\n\n* 2018- $5.53B\n* 2019- $13.35B\n* 2020- $41.29B\n* Current- $54.81B\n\n\\*MKT Cap has increased by 891% in three years\n\nEPS (Dilution)\n\n* 2018- ($8.15)\n* 2019- $3.91\n* 2020- ($1.18)\n* Current- ($1.09)\n\n\\*EPS has increased by 87% in three years\n\n**Financial Statement Highlights (in thousands)**\n\nTotal Revenue (TR)\n\n* 2018- $0.65B\n* 2019- $0.90B\n* 2020- $1.30B\n* Current- $1.63B\n\n\\*TR has increased by 150% in three years\n\nPrice to Earnings Ratio (PE)\n\n* 2019- 16.93\n* 2020- 0.00\n* Current- 0.00\n\n\\*PE Ratio has decreased by 100% in two years\n\nPrice to Sales Ratio (PS)\n\n* 2019- 12.12\n* 2020- 28.57\n* Current- 32.68\n\n\\*PS Ratio has increased by 169% in two years\n\nPrice to Book Ratio (PB)\n\n* 2019- 20.84\n* 2020- 88.55\n* Current- 225.80\n\n\\*PB Ratio has increased by 984% in two years\n\nGross Margin\n\n* 2018- 73.7%\n* 2019- 74.6%\n* 2020- 74.6%\n* Current- 75.7%\n\n\\*Gross Margin has increased by 2% in three years\n\n**Balance Sheet Highlights (in thousands)**\n\nTotal Liabilities\n\n* 2018- 0.91B\n* 2019- 1.22B\n* 2020- 1.63B\n* Current- 2.05B\n\n\\*Total Liabilities have increased by 125% in three years\n\nLong Term Debt (LTD)\n\n* 2018- 0.43B\n* 2019- 0.46B\n* 2020- 0.47B\n* Current- 0.74B\n\n\\*LTD has increased by 72% in three years\n\nDebt to Equity Ratio (DE)\n\n* 2018- 0.53\n* 2019- 0.81\n* 2020- 1.14\n* Current- 3.05\n\n\\*DE Ratio has increased by 475% in three years\n\n**Customers**\n\n* Apple\n* Visa\n* Citgo\n* Samsung\n* Facebook\n* Deloitte\n* T-Mobile\n* BMW Group\n* Unilever\n* AstraZeneca\n* Santander\n* Salesforce\n\n**Competitors**\n\n* Adobe Sign\n* signNow\n* GetAccept\n* HelloSign\n* DocHub\n\n**Stock Price History**\n\n* 2018- $40\n* 2019- $75\n* 2020- $245\n* Current- $280\n\n\\*Stock price has increased by 600% in three years\n\n**Conclusion**\n\n\tDocuSign is leading us into the future with its electronic capabilities. Say goodbye to formal paper agreements. DocuSign makes it easy to sign agreements. No more going into the office to sign a contract. No more losing your documents. All the documents are stored in the cloud making your agreements easy to find. Some of the top-performing fortune 500 companies use DocuSign. If they back them, why shouldn't you? COVID-19 has had a positive effect on DOCU. DOCU has been able to capitalize on all the people working from home during the pandemic. This can be proven by the massive increase in market cap. This can also be proven by the PE, PS, and PB ratios. I believe those who have transitioned to DOCU during the pandemic have no reason to switch back to paper. I believe we're going to see more companies make the switch from paper to the cloud whether or not they choose DocuSign. The digital era requires digital solutions. I believe DOCU is a good long-term investment.\n\n&amp;#x200B;\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "StockMarket",
        "title": "[DD] DocuSign (DOCU)",
        "url": "https://www.reddit.com/r/StockMarket/comments/ondtb7/dd_docusign_docu/",
        "created": 1626729258.0
    },
    {
        "author": "tay_clem",
        "created_utc": 1627009246,
        "id": "optg1a",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I had purchased about a dozen or so shares of Slack a few months ago. My plan was to get in while it was around $35 and hold onto it for a bit to see if I could make a small profit since WFH and hybrid work doesn’t seem to be going anywhere for awhile. Then the Salesforce merger happened.\n\nWhat I need help understanding is what is going to happen with the stock that I had bought. Is it going to convert to CRM? Am I going to get a payout? Am I going to lose that investment?\n\nI use TD Ameritrade to buy/sell shares, and both the app and website info is a bit...wonky for lack of a better word. There’s missing data, and it just seems like there’s something weird happening. \n\nI haven’t been trading long, so I’m still trying to learn how it all works. I appreciate any insight y’all can give or even if you can just point me in the right direction for better info.",
        "subreddit": "StockMarket",
        "title": "Question about Slack",
        "url": "https://www.reddit.com/r/StockMarket/comments/optg1a/question_about_slack/",
        "created": 1627038046.0
    },
    {
        "author": "Empty_Performance308",
        "created_utc": 1625597981,
        "id": "of1ko4",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi guys!! Former wall street analyst here... I'm sharing what I've learned from 10 years of experience. \n\n(I wrote a [book](https://henrychien.com/investing-book/)!) Here's an excerpt on business models - which is a HUGE part of investing and picking stocks. It's a way to simplify a business so you can get a sense of how the big the company can get (i.e. its growth) and how much cash flows it can create  (i.e. its profits). \n\nThen you have an idea (i.e. your thesis) and can estimate where the price of a stock can go. \n\nI'll use $DMTK, which is a popular stock on Fintwit (and also very limited research), of how you research the company to learn its business model, to then estimate its finances. \n\n## What is a “business model”?\n\nThis is a way to simplify how business works into a “model”. With a model you can estimate the change of a company’s growth and cash flows to reach a value of a stock.\n\n***You start by describing the basic business model (here with DermTech):***\n\n* **A business provides a product or a service.** DermTech ($DMTK) provides a test for dermatologists to test people for melanoma. Each test costs a certain $ amount which is charged to either patients or insurers. \n* **This provides some value to its customers.** The test is an alternative to biopsies which are painful and leave scars. It is also more accurate which means less biopsies, which also means less overall costs for insurers. \n* **It operates in a “market” which is its current or potential customers.** $DMTK’s target market is U.S. dermatologists that test and monitor their patients for melanoma. \n* **Management has a vision for the business.** CEO John Dobak wants to build DermTech into a leading platform of genetic testing for dermatology practices. \n\n***And then the business strategy\\*:***\n\n* **The business has a strategy to grow or “scale” to a certain level.** Management plans to expand sales to the majority of testing dermatology clinicians and expand reimbursement to most commercial insurance plans.\n* **Business has a future potential source of profits or “margin.”** The cost of the facility and equipment is largely fixed so higher prices should support gross margin. Sales and marketing should also grow slower than revenues to create operating margin and profits over time. \n\n*\\*This fits directly into the valuation framework of growth and cash flows.*\n\nOnce you do this, you build a “sense” of a company and what is the critical factor that will drive earnings and the value of the company. This is super important to build an investment thesis.\n\n* **Simplify a company into a business model to estimate change.** \n\n## Where to find information to describe a business model?\n\nUse these key sources of information to use when looking at a company. \n\n**SEC Filings** \\- The 10K and / or the S1 prospectus has the most detailed information on the business model, its financials and the market it operates in. 10Qs provide quarterly updates.These are all accessible on SEC [EDGAR](https://www.sec.gov/edgar.shtml). \n\nPay attention to these sections in the 10K and S1 for the most valuable information.\n\n* ***“Business”*** and ***“Management Discussion and Analysis”*** sections typically describe the businesses’ products or services, the value to customers, the market it operates in. The discussion usually describes the company’s growth strategy.\n* ***“Risk factors''*** section is where you get a sense of the risk of the business. This is also a good area to look for the critical factor for the value of the business. \n\n**Investor presentation** \\- Use this to get more information on the market and the business model. Here is where management will often highlight the growth strategy.\n\nThis is helpful for building the upside of an investment thesis (expected growth and earnings).\n\n* **Videos of management or Q&amp;A** \\- Use these videos to get a sense of the business model and growth strategy from management. Here they will usually outline the company’s vision, the growth strategy and sometimes targets for scale and margin. \n\n**Transcript of earnings calls (Q&amp;A)** \\- Look at the prepared commentary for a business update (focus on the critical factors) and then search the Q&amp;A for additional details to help understand the financial model or change in the business. \n\n**Earnings releases** \\-  Look at these for the metrics for business updates. These are posted on investor relations pages and in 8K filings on EDGAR. Pay attention to guidance. \n\n* *Later, you will learn how to quickly analyze these releases.*  \n\n&amp;#x200B;\n\n***Here’s a sample business model overview from $DMTK***\n\n$DMTK provides a non-invasive diagnostic for melanoma that uses genomic analysis (pigmented lesion assay). There are three sources of value:\n\n* The value to customers is fewer biopsies to diagnose melanoma (requires 2.5 to 1 vs. 25 to 1 for biopsies)\n* Clinical value also lowers probability of missing melanoma (&lt;1%) and higher predictive value (3-4% from 18.7%)\n* Economic value to payers from lower cost to $760 vs. $947 for visual assessment, fewer biopsies and earlier detection of melanoma.\n\nManagement’s vision is to incorporate genomic testing into dermatology with this platform.\n\n* The “market” for this product is the 4m surgical biopsies performed every year for early stage melanoma (which translates to about 207K / year).\n* The plan to expand commercial insurance reimbursement coverage to increase sales price to $760 per test, which will raise gross margins to 60-70%. \n* The growth strategy is to target the 5,000 clinicians that perform the majority of biopsies and plan to increase their salesforce to 50 people. \n\nThe critical factor (and risk) is getting commercial reimbursement coverage in order to raise the price point. Another risk is the ability to generate profits and scale its salesforce.\n\n&amp;#x200B;\n\nWith those assumptions you can estimate the future finances of the company, which you can then use to estimate the future price of the stock! (That will require another post!).\n\nFeel free to DM me (or follow me on twitter - henrychien4 ). And here's the [book link](https://henrychien.com/investing-book/) if you are interested. Cheers and happy investing!!!",
        "subreddit": "StockMarket",
        "title": "How to study a company and its \"business model\" and where to get information ($DMTK example)",
        "url": "https://www.reddit.com/r/StockMarket/comments/of1ko4/how_to_study_a_company_and_its_business_model_and/",
        "created": 1625626781.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1626700220,
        "id": "ondqwl",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n*Processing img ri318upc56c71...*\n\nSome of you may know me from my Educational and Due Diligence posts at r/DoctorStock. Here is this week's brief DD.\n\n**Introduction**\n\n\tDocuSign (DOCU) is an electronic signature agreement platform. DOCU makes money by charging those who create contracts.\n\nMarket Cap (MKT Cap)\n\n* 2018- $5.53B\n* 2019- $13.35B\n* 2020- $41.29B\n* Current- $54.81B\n\n\\*MKT Cap has increased by 891% in three years\n\nEPS (Dilution)\n\n* 2018- ($8.15)\n* 2019- $3.91\n* 2020- ($1.18)\n* Current- ($1.09)\n\n\\*EPS has increased by 87% in three years\n\n**Financial Statement Highlights (in thousands)**\n\nTotal Revenue (TR)\n\n* 2018- $0.65B\n* 2019- $0.90B\n* 2020- $1.30B\n* Current- $1.63B\n\n\\*TR has increased by 150% in three years\n\nPrice to Earnings Ratio (PE)\n\n* 2019- 16.93\n* 2020- 0.00\n* Current- 0.00\n\n\\*PE Ratio has decreased by 100% in two years\n\nPrice to Sales Ratio (PS)\n\n* 2019- 12.12\n* 2020- 28.57\n* Current- 32.68\n\n\\*PS Ratio has increased by 169% in two years\n\nPrice to Book Ratio (PB)\n\n* 2019- 20.84\n* 2020- 88.55\n* Current- 225.80\n\n\\*PB Ratio has increased by 984% in two years\n\nGross Margin\n\n* 2018- 73.7%\n* 2019- 74.6%\n* 2020- 74.6%\n* Current- 75.7%\n\n\\*Gross Margin has increased by 2% in three years\n\n**Balance Sheet Highlights (in thousands)**\n\nTotal Liabilities\n\n* 2018- 0.91B\n* 2019- 1.22B\n* 2020- 1.63B\n* Current- 2.05B\n\n\\*Total Liabilities have increased by 125% in three years\n\nLong Term Debt (LTD)\n\n* 2018- 0.43B\n* 2019- 0.46B\n* 2020- 0.47B\n* Current- 0.74B\n\n\\*LTD has increased by 72% in three years\n\nDebt to Equity Ratio (DE)\n\n* 2018- 0.53\n* 2019- 0.81\n* 2020- 1.14\n* Current- 3.05\n\n\\*DE Ratio has increased by 475% in three years\n\n**Customers**\n\n* Apple\n* Visa\n* Citgo\n* Samsung\n* Facebook\n* Deloitte\n* T-Mobile\n* BMW Group\n* Unilever\n* AstraZeneca\n* Santander\n* Salesforce\n\n**Competitors**\n\n* Adobe Sign\n* signNow\n* GetAccept\n* HelloSign\n* DocHub\n\n**Stock Price History**\n\n* 2018- $40\n* 2019- $75\n* 2020- $245\n* Current- $280\n\n\\*Stock price has increased by 600% in three years\n\n**Conclusion**\n\n\tDocuSign is leading us into the future with its electronic capabilities. Say goodbye to formal paper agreements. DocuSign makes it easy to sign agreements. No more going into the office to sign a contract. No more losing your documents. All the documents are stored in the cloud making your agreements easy to find. Some of the top-performing fortune 500 companies use DocuSign. If they back them, why shouldn't you? COVID-19 has had a positive effect on DOCU. DOCU has been able to capitalize on all the people working from home during the pandemic. This can be proven by the massive increase in market cap. This can also be proven by the PE, PS, and PB ratios. I believe those who have transitioned to DOCU during the pandemic have no reason to switch back to paper. I believe we're going to see more companies make the switch from paper to the cloud whether or not they choose DocuSign. The digital era requires digital solutions. I believe DOCU is a good long-term investment.\n\n&amp;#x200B;\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "smallstreetbets",
        "title": "[DD] DocuSign (DOCU)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ondqwl/dd_docusign_docu/",
        "created": 1626729020.0
    },
    {
        "author": "DDavid_Nguyen",
        "created_utc": 1627351096,
        "id": "osdji0",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "https://twitter.com/lillianmli/status/1418936597349732352?s=21\n\nhttps://lillianli.substack.com/people/3249443-lillian-li\n\nLillian Li\n\nRefactoring. Ex-VC @ Eight Roads Ventures, Salesforce Ventures, Ex-drone @ LEK Consulting. Cambridge and LSE alum. @lillianmli\n\n\n\n630 views\n\n1) Given the amount of panic I've seen on Twitter over Chinese stocks. I'm once again, asking you to consider some fundamental framings of the rules and objectives of Chinese governance. \n\nIt might be interesting. But it is better than being mired in FUD.\n\n$TAL $TCHY $BABA\n\n2) It makes great sense to pay attention to the rules of the game that the players are playing in. \n\nThe implicit rules of China are that the government sets goals for the country and invert back to to key objectives that the country should be attaining. \n\nThey don't hide this\n\n3) It's literally called the Five Year Plan, it's the blueprint for the next five years and beyond for the Chinese economy. \n\nThere is a bit of reading the tea leaves but it's not impenetrable. \nLiterally. Every. Investor. I know in China pores over this.\n\n4) In terms of China's biggest woes in the future - it's aging demographic and lack of children \nIt's in the targets for 5YP, China didn't list a GDP growth figure but said they needed to increase population. This is basically them laying down the law\n6) You know the kind of stress Chinese kids and parents are under these days? \nPrimary kids here in China are literally carrying rolling baggages of books to school, they are so heavy they can't even carry them. Their days are packed with going to school, then cram schools.\n\n7) Advertisement selling status anxieties to get kids into after schools are rife. Whenever I chat to parents they all tell me they can't afford kids given the cost of schooling and and tutoring. \nThis is also just the tier one cities\n\n8) This kind of resources isn't even available to tier 3 and lower cities. If continued this will increase inequality in education attainment and therefore income in China going forward. \nLowering inequality - another key OKR for China\n\n9) An eagle eye journalist told me that out of all the sessions Xi decided to chair the one on education for Lianghui and chaired another high-level political discussion on education on May 21. \n\nThat kind of attention matters and shows priority of the top leaders.\n\n10) Also given the lagging regulatory environment in China, education is a public good and shouldn't be overtly privitised. That's also coming into play here as well. \nThis is overdue catch-up\n11) As for $BABA, $TCHY and $DIDI - look man, the focus on technology in the 5YP is on hard tech and not e-commerce or taxis. These players have moved into value extraction and are taking up valuable innovation air from more worthy causes in the party's eyes.\n\n12) I'm not asking people to pass their value judgement here on whether that's a right way or wrong way to govern. That's beside the point. \n\nAs an investor, first and foremost our job is to understand the game that is being played and the rules of the game.\n\n13) China plays with its own set of rules and it's understandable. People in China don't get rich purely on dumb luck. They understand the rules of the game very well. \nAsk Hillhouse or Himalaya. \nIf an investor wants to invest in China. Learn the rules.\n\n14) To make this a bit concrete - yes the education players are in trouble for the foreseeable future. Once the first regulations came out about limiting hours, it was just a matter of when it could get harsher. (Chinese investors already sold during that time)\n\n15) The next thing on this list to make having children more affordable - housing. \n\nI would be very wary of players in that space which props up high housing prices. Pricey houses is a hurdle to having kids. Why is a longer cultural discussion, but it is true.\n\n16) This is not a blanket kill all order for all Chinese tech. But everyone worth their salt during this year is going lay low. Why attract adding attention, unless you're $Didi. \nI'm very comfortable in seeing a great future for Chinese tech players.\n\nShould make clear this is just one pseudo-intellectual’s personal opinion and not definitive by any means.\n\n• • •",
        "subreddit": "wallstreetbets",
        "title": "These are insights on $Baba by Lillian Li",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/osdji0/these_are_insights_on_baba_by_lillian_li/",
        "created": 1627379896.0
    },
    {
        "author": "Lost-Guarantee229",
        "created_utc": 1625149986,
        "id": "obn2z7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Valuation: Undervalued**\n\n***$PLTR – Palantir Technologies Inc Investment Summary:***\n\n· Recently, there has been a lot of buzz around Palantir, however, very few people actually understand what they do and how they operate. As a result of this I have decided to take on the task of trying explain exactlywhat Palantir does and why they could be the best undervalued stock to buy now.\n\no I am no data engineer, so this article contains my interpretations of what Palantir does, some of my interpretations may be off, so I would appreciate any helpful comments to clear some things up that I may have got wrong.\n\n· Based on the comparable analyses that I underwent, Palantir is currently an undervalued stock and represents a great opportunity for a long-term hold.\n\no The length of time that I plan on holding is subject to change due to their future financial reports, and any news that may come out.\n\n· It is very hard to say what the upside potential of an investment into Palantir is, which is why my investment plan (found in the “plan” section) is different than usual.\n\no There are various risks to this investment (like there are to every investment), these risks are highlighted near the end of this report under the “risks” section.\n\no Additionally, there are also multiple different catalysts that can help Palantir’s share price, both in the short and long term(s). These catalysts are listed at the end of this report.\n\n***Overview of Palantir as a Company:***\n\n[$PLTR - Palantir Technologies Inc.](https://utradea.com/stocks/PLTR) was founded in 2003 (after their fear/anger after the events observed through 9/11) and started building their software primarily for government institutions and intelligence to assist in counterterrorism by any means possible. At this point in time, Palantir’s only source of revenue was through secretive government contracts.\n\nHowever, since that point in time, Palantir has expanded their operations into commercial enterprises, as they noticed a lot of similarities and overlaps with their applications. Now, Palantir’s revenue comes from both Government Contracts and Commercial Enterprise Contracts.\n\n*Palantir has 2 main software platforms, Palantir “Gotham”, and Palantir “Foundry”.*\n\n[**Palantir Gotham**](https://www.palantir.com/palantir-gotham/) was their first software platform and was designed for defense/intelligence use cases. Palantir has stated that this kind of platform helps agencies find “needles in thousands of haystacks”. They also noted that [Gotham helped soldiers in Iraq and Afghanistan](https://www.palantir.com/wp-assets/wp-content/uploads/2014/03/Impact-Study-Palantir-Defense-During-Drawdown.pdf) to map networks of bomb makers and insurgents through deep/hidden patterns and datasets, helping the army save time and lives. Since this mission, Gotham has expanded into defense operations and mission planning. During this time, Palantir found that Gotham could also be applied in Airbus’ business, as their planes require millions of parts, assembled in multiple factories in different countries. However, Palantir decided to make another software platform that is better tailored to commercial enterprises, this platform was labelled “Palantir Foundry”.\n\n[**Palantir Foundry**](https://www.palantir.com/palantir-foundry/) transforms the way in which organizations interact with their information by creating a central operating system for their data. Palantir enables their customers to construct their own models quickly and easily from countless sets of data points.\n\nPalantir software is used by their 139 Government and Commercial Institutions/enterprises, in over 40 industries, ranging over 150 countries. Palantir works with the US Government and their several allies abroad, as well as the worlds most important/reliable companies.\n\nLastly, Palantir has stated “We are not in the business of collecting, mining, or selling data. We build the software that enable our customers to integrate their own data that they already have.”\n\n***Everything you need to know about Palantir and $PLTR:***\n\n*Palantir Foundry:*\n\nFoundry is essentially a [data warehouse](https://panoply.io/data-warehouse-guide/the-difference-between-a-database-and-a-data-warehouse/) that helps their commercial customers to collect and analyze their data. Foundry’s platform includes a [graphical data interface](https://www.omnisci.com/technical-glossary/graphical-user-interface) that is extremely user friendly allowing their customers to get the most out of their data. Furthermore, Foundry provides statistical analyses through the use of their [AI machine learning](https://www.palantir.com/solutions/ai-ml/) networks that are able to consistently deliver efficient and accurate results.\n\nFoundry helps to enables all of their users, regardless of their technical abilities, to work meaningfully and act with the data that they collect. Foundry provides a suite of applications that help combine data analytics and business logic, helping them to deliver superior data integration.\n\nFoundry’s front-end (what the user sees) enables their users to take advantage of all of the data collected by their organization to make informed decisions. Foundry also has a fantastic application for inter-organizational collaboration, this helps a team to build on each others work.\n\n*Foundry brings all of an enterprises data together onto their platform, however there are access controls in place to define what individuals get control over which dataset(s). From there, Foundry is able to deliver advanced analytics through their machine learning and AI systems to get the most value out of a company’s data, make quality insights, so that their clients can gain a competitive advantage.*\n\n**Foundries potential use cases are almost infinite.**\n\n*Palantir Gotham:*\n\nDubbed “The Operating System for Government Decision Making”, Gotham helps to improve and accelerate decisions across all levels of Government operations.\n\nGotham is primarily used by the defense and intelligence sections of the Government, to help them find what they are looking for. Gotham collects data from millions of different sources and combines it all into one platform to identify hidden patterns and bring all of this data to life. This allows their users to access this data and manage their operations to execute real-world responses to threats that Gotham identifies. Gotham is becoming a main data solution across various different government agencies.\n\nThere is not too much information that is publicly known about the actual uses of Gotham, which makes sense due to the secretive nature of the organizations that they are in business with. However, what we do know is that these organizations have re-signed contracts with Palantir, which helps us to be confident that this platform is truly “the real deal”.\n\nLastly, Gotham is also offered to select commercial customers, primarily the companies that are investigating fraud in financial service industries. Furthermore, [Palantir has been credited](https://www.bizjournals.com/bizjournals/news/2015/01/12/leaked-documents-bernie-madoff-convicted-thanks-to.html) with assisting in finding the largest Ponzi scheme ever (Bernie Madoff’s Ponzi Scheme).\n\n*Gotham helps the Defense and Intelligence sectors of the Government to pool their incomprehensible amounts of data into one place. Palantir uses machine learning to quickly locate hidden pieces of data, and key patterns, so that these institutions can take swift action to the threats/problems they face in real-time.*\n\n*Palantir’s Approach:*\n\nPalantir believes that every large institution in the world has a problem in their approach to mass data analysis, and Palantir believes that their platforms are best suited to help companies address this problem and make the most out of their data.\n\nPalantir recognises that other companies sell features, tools, applications, and/or dashboards, however these products are not built to maintain optimal performance in the long run (if at all). Palantir prides themselves on having the best all around software/platform to have sustainable, reliable, and safe data solutions.\n\nPalantir also groups their Foundry data from all of their companies into one large system of several large “farms” of data provided by each of their client companies. By doing this, Palantir is able to feed more data/information into their machine learning, AI, and algorithms so that they can continue to be more reliable and efficient. This also enables [cross-industry data pools](https://youtu.be/7zqE8J4WKOU), that can be used by their companies when they look to expand or for opportunities in other verticals.\n\n*Palantir Success Stories:*\n\n**BP:**\n\nPerhaps the most notable success story that has come from Palantir is their partnership with [$BP – British Petroleum](https://utradea.com/stocks/BP)\n\nBP and Palantir have been partners since 2014, and recently (February 2021) [BP and Palantir have extended their partnership](https://www.fool.com/investing/2021/02/05/palantir-deepens-ties-with-bp-with-new-5-year-deal/) for 5 more years. Palantir has helped BP to transform their business into a more digital one, and this extension of their partnership will ensure a further acceleration of their strategic digitization of their business.\n\nPalantir’s Foundry has already helped BP by streamlining and enhancing their hydrocarbon-based workflows. Palantir helped BP to analyze their drilling data and has helped them to [increase their oil production in the North Sea by over 10%.](https://www.thetimes.co.uk/article/palantir-the-tech-spooks-who-found-bin-laden-are-helping-bp-find-oil-9qddfpv2r)\n\nThis increase in production helps us to visualize just how useful Palantir’s software can be. This is why their Foundry has been credited as a “competitive advantage”. Other oil producing companies most likely would not have been able to uncover the data, patterns, and relationships that were uncovered by Palantir, thus the companies that are not using Palantir may be losing out.\n\nThis type of publicity is fantastic for Palantir, as companies may see this, and contact Palantir because they too want a competitive advantage. Palantir’s best chance at becoming the next “tech giant” comes through the commercial applications/contracts. This is because there are infinite uses for Palantir, so theoretically, they can get it in the hands of every business (which would help revenues to soar).\n\n**National Institute of Health (NIH) and Britain’s National Health Service (NHS):**\n\nPalantir has historically been a rather controversial company through their help in government agencies like ICE. However, recently Palantir has been getting good press, which has helped their company image. Since the start of the pandemic some institutions like the NIH and NHS have signed contracts with Palantir, for Palantir’s assistance with their fights against COVID-19, and their vaccine distributions. This is good for Palantir as it shows them in a good light and shows that they can help provide the world with help and safety during a crisis like COVID-19.\n\nThe NIH agreed to a [$36M contract](https://www.palantir.com/pt_media/nih-palantir-contract/) to gain a partnership with Palantir. Their (NIH’s), mission is to build the largest centralized COVID-19 patient database in the world, and Palantir has helped them to do this with massive success.\n\nPalantir was able to assist the NIH in building their [N3C data platform](https://covid.cd2h.org/). This platform has come a long way since they teamed up with Palantir, and now has over 7.1B rows of data from 6.5M patients, from 57 different databases. Without the assistance of Palantir, analyzing this amount of data would have been no easy feat, however Palantir has provided the NIH with advanced analytics in the matter of minutes thank to their machine learning capabilities.\n\nAdditionally, in December of 2020, Palantir signed a [2-year $31.5M deal](https://www.businesswire.com/news/home/20201223005018/en/Palantir-Continues-Vital-NHS-Work-With-31.5M-Contract) with the Brittan’s NHS. This partnership requires Foundry to provide a secure, reliable, and timely platform to process data, while protecting patient privacy, to ultimately improve patient care.\n\nBoth of these partnerships highlight the need for Palantir during a crisis and having these large Government Health Institutes choosing Palantir as their first options is a great deal, and shows their confidence in Palantir’s software.\n\n*Sources:*\n\n[The power of data in a pandemic - Technology in the NHS (blog.gov.uk)](https://healthtech.blog.gov.uk/2020/03/28/the-power-of-data-in-a-pandemic/)\n\n*Strengths:*\n\n**Built-in Privacy Controls:**\n\nBy having [privacy controls](https://youtu.be/7zqE8J4WKOU) in place, Palantir is able to operate in places that other data companies cannot go. This is especially true for Foundry, where companies/individuals can request cross-industry data from other Palantir clients to help them in a variety of ways. This request for external data needs to be accepted by a representative of the other company to be allowed. This helps Palantir leverage all of the data that they have on their “Operating System”, which essentially makes their platform a cross-company/cross-country collaborative workspace for all. As Palantir attains more clients, the more attractive/extensive their database is for potential clients. This should help Palantir to expand quickly once they get the ball rolling.\n\nPalantir truly values this privacy and has integrated data legibility, audit logs, access controls, quality checks and requirements to attain external data.\n\n**Government Grade Security:**\n\nAs we know, Palantir started out in just the defense and intelligence spaces. This required Palantir to have elite-level security from the get-go. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This is no easy feat, however Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients, because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has [IL-5 clearance](https://simplemoneylyfe.com/palantir-stock-analysis/) with the Department of Defense (DoD), which makes them 1 of 4 software companies with this level of clearance (alongside Oracle, Salesforce, and SAP). However, it has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of **classified information.**\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology truly is and should provide ease of mind to companies that they are in business with.\n\n**Expansion into the Commercial Sector:**\n\nPalantir currently has a huge opportunity ahead of them as they continue to increase their presence in the commercial sector, partnering with some of the largest enterprises in the world. Palantir plans to provide these businesses with the software that they need to do their jobs as efficient as possible and sees large growth potential in this industry.\n\nPalantir has said that they are focusing on building partnerships with enterprises that are willing to undergo structural changes within the organization/operations. Palantir has a huge market ahead of themselves in the commercial sector, and their stock should do well on the news breaking of new partnerships between Palantir and commercial enterprises.\n\n*Government Contracts:*\n\nDo you remember what I said earlier about what happens once Palantir gets the ball rolling? If so, you will know where I am headed with this section.\n\nBetween 2008-2018 (10 years), Palantir was able to generate $51.9M in revenue from government contracts. However, in the 2 years following this they earned $179.9M in Government contracts (this can be found under the “US Government” section of their [SEC 10-K report](https://sec.report/Document/0001193125-21-060650/#tx65934_1)). Once Palantir was able to get the ball rolling with these agencies, Palantir was able to both expand and renew existing contracts to earn more revenue. I believe that the same thing will happen with Palantir’s commercial operations. Once they start to get a large number of big enterprises renewing their contracts for “bigger bucks”, I believe that Palantir will start to grow their revenues extremely quick and attract new clients “left, right, and center”.\n\nThese contract renewals are so important because essentially, they mean that Palantir met and/or exceeded expectations, and these companies now believe that Palantir is vital to their business/operations, so look out for news around renewals.\n\n*Business Model:*\n\nPalantir has developed a business model that focuses on acquiring contracts and expanding their services and has 3 main phases.\n\n1. **Acquire Customers:** Palantir has expanded their sales force largely over the past couple of years, and actively purse negotiations with companies that they can provide long-term value to. To acquire these companies, Palantir gives them a short demo to see how effective and user friendly their software is, Palantir provides this service for a loss. However, they are willing to incur these (proportionately) small losses to potentially acquire large contracts with these companies. This phase runs at a loss but helps Palantir set up clients for the next phase.\n2. **Expand:** Once Palantir has a potential customer on the hook, they move them along to the expand phase. Palantir installs their software in these enterprises and teaches them the ropes, of course this requires a large investment from Palantir to incorporate it. These customers often sign a short contract with Palantir for a cheap cost (Palantir takes a loss on this phase as well), however clients are able to truly unlock Palantir’s software during this phase and see what it has to offer. If they like their software, they will be moved along to the next phase (scale) which is Palantir’s bread and butter.\n3. **Scale:** These clients tend to sign longer-term deals with Palantir for their software after they have got a “good feel” for their software. The companies in this stage are also generally “hands-off” meaning that they can operate the software without much help. Companies tend to find the most value in this stage, and Palantir makes the best margins on this stage. In 2020, Palantir made $613.4M in this stage with a margin of 70%\n\n*Financial information:*\n\nAll of this information can be found in their [SEC 10-K filing.](https://sec.report/Document/0001193125-21-060650/#tx65934_1)\n\n· **Financial Performance (Good):** In 2020, Palantir increased their gross profit by 47.97% and increased their gross margin to 81% (from 71%), Palantir reported their first net income (excluding stock-based compensation) ever and increase their net revenues by 47.15%.\n\n· **Financial Performance (Bad):** In 2020, Palantir’s loss from operations increased by 103.61%, their stock-based compensation increased by 425.15%, their General and Admin expenses increased by 108.59%, and their net loss increased by 101.22%. Their biggest problem in 2020 was their large stock-based compensation, which will be addressed later.\n\n· **Convertible Preferred Stock:** In 2020, Palantir issued a total of 797,771,675 shares of common stock through conversion of their previous “convertible referred shares”. This one factor of dilution caused an estimated dilutionary effect of Palantir’s stock of 137.19%. This is a huge form of dilution, and I have never seen anything like this before, however I have an explanation for this so stay tuned for that.\n\n· **Repurchase of Common Stock:** In 2020, Palantir repurchased 808,201 shares back. This is a measly amount compared to the amount of dilution from preferred stock, however any buyback is good to see as an investor. This buyback caused an inflationary effect on existing shares of 0.14%, which is not much, but we will still take it.\n\n· **Stock Warrants:** In 2020, Palantir experienced an additional 7,631,329 shares on the market through the exercising of warrants. The exercising of these warrant had a dilutionary effect on Palantir’s stock of 1.31%.\n\n· **Common Stock (Net of Issuance Costs):** In 2020, Palantir unloaded 206,500,523 common shares onto the market from issuance of common stock net of issuance costs. I believe that this means that, Palantir had to fork out additional shares to cover the investment needed to take their shares public. I could very well be wrong on that, and if anyone can pitch in and explain this to me that would be great! Anyways, this caused a dilutionary effect of Palantir’s common stock of roughly 35.51%. This is a large portion of dilution, however it does not even factor in other factors of dilution which is worrying.\n\n· **Stock Options:** In 2020, Palantir added 120,617,527 common shares to their shares outstanding through the exercise of options. These options were exercised and thus converted into these common shares and had a dilutionary effect of 20.72%. Once again, this is a large amount of dilution and should be considered by investors.\n\n· **RSU’s:** In 2020, Palantir issued 82,429,575 shares through their vesting of “Restricted Stock Units” (RSU’s). This had a dilutionary effect on their stock of 14.18% (which is a lot of dilution).\n\n· **Modification to Stock Options:** In 2020, Palantir technically bought back 3,500,0000 shares through modifications to stock options (for the settlement of employee loans accounted for as modifications to stock options). Confusing, right? This technical buyback resulted in a share inflation of 0.6%.\n\n· **Total Share Dilution in 2020:** In 2020, Palantir experience an overall share dilution of 208.19%. This is the most dilution I have ever seen in a stock that I have analyzed, however there are some potential answers as to why there was so much dilution in 2020.\n\n*Explanation of Share Dilution:*\n\nOnce again, all of the below information can be found in Palantir’s [SEC 10-K filing](https://sec.report/Document/0001193125-21-060650/#tx65934_1).\n\nOn September 30th, 2020, Palantir completed their Direct Listing of their Class A common shares on the public markets on the NYSE. Part of this listing involved the redemption of all of Palantir’s convertible share into common shares. This was the largest single source of dilution in Palantir (137%). Additionally, this Direct Listing involved the exercise of al outstanding warrants, which resulted in dilution of 1.31%. Another part of their Direct Listing was the common stocks issued, net of issuance price to complete the direct listing, which had a dilutionary effect of 35.51%. Lastly, Palantir was forced to create new common shares that would hold the place of the unvested RSU’s, which cause a dilutionary effect of 14.18%.\n\nWithout these factors of dilution, Palantir would have only experienced an overall dilution of 20%. This means that due to the Direct listing, Palantir had to increase their shares outstanding by 188.19% to meet the requirements to be eligible for the listing.\n\n*Overall Thoughts on Dilution:*\n\nPalantir is a very weird stock in terms of their dilution, and I have not seen anything quite like this before. Their overall level of dilution is unprecedented and very worrying for investors. However, we know that these levels of dilution were inflated due to the requirements of undergoing a Direct Listing. However, how does Palantir dilution (excluding the effects caused by their Direct Listing compared to their dilution in previous years?\n\nFor starters, Palantir exhibited a 20% share dilution in 2020 when eluding the dilution caused by the Direct Listing. However, historically Palantir has experienced an average share dilution of 5.18% between 2017-2019. So even excluding the effects caused through the Direct Listing, Palantir still experienced a comparably high level of share dilution. However, 20% of dilution is significantly different than the 208.19% of dilution (which would be crazily high). This 20% is relatively normal for an undervalued growth stock, such as Palantir, so currently I would not be too worried. However, investors should keep up with their financial reports and look for their dilution in 2021, because ultimately that will tell us more about Palantir’s dilution after going public, than their past share dilution as a private company.\n\n*Competition:*\n\nIn order to undergo my comparable analyses (which will be discussed later on) I needed to select 4 companies, that I can compare to Palantir.\n\n[**$ZS – Zscaler Inc**](https://utradea.com/stocks/ZS)**:** ZScaler is a security as a service company that helps company adapt to cloud technologies and provides their cybersecurity services through the cloud. ZScaler provides their services to both commercial enterprises and governments, similar to that of Palantir. Furthermore, ZScaler offers their service primarily in the USA, but also has smaller international operations (again like Palantir).\n\n[**$SNOW – Snowflake Inc**](https://utradea.com/stocks/SNOW)**:** Snowflake (like Palantir) is a software and technology company that primarily focuses on data. Snowflake provides data cloud services such as data engineering, data science, data applications, data sharing, and data warehouse. This is very similar to the applications and functions available on Palantir, however Palantir offers other functions that differentiate themselves. Snowflake also provides services for both commercial enterprises and government organizations, similar to that of Palantir.\n\n[**$SPLK – Splunk Inc**](https://utradea.com/stocks/SPLK)**:** Splunk provide software platforms that deliver insights derived from their clients’ data in the USA and internationally. Splunk offers their Ecosystem solutions that consist of data inputs, workflows, reports, dashboards, data visualizations, actions, and methods, and help their clients/customers to make the best out of their data. All of this sounds eerily familiar to the description of Palantir, making it one of the closer competitors. Splunk also offers their services to the public sector as well as the government, making their business model resemble that of Palantir so much more.\n\n[**$TYL – Tyler technologies Inc**](https://utradea.com/stocks/TYL)**:** Tyler technologies is probably the company in this list that least resembles that of Palantir, this is because they provide management solutions, accounting systems, billing systems and other solutions geared toward the public sector. Tyler technologies works primarily with governments of all types (Federal, State, and Municipal), and education institutions. However, the one thing that Tyler has that makes them comparable to Palantir is their data and insight solutions. Their data insights software enables collaboration, displays data visualizations/measurements, and generates insights for their human operators to act on.\n\n*Q1 2021 Updates:*\n\nAll of the below information can be found in [Palantir’s Q1 Investor Presentation](https://investors.palantir.com/files/Palantir%20Q1%202021%20Business%20Update.pdf).\n\nRecently, on May 11th, 2021, Palantir released their Q1 earnings report. When looking at Palantir’s financial performance I did not take this into account, which means that this section will be packed with new information that will help us to understand Palantir’s trajectory even more.\n\nFirst and foremost, this quarter was the first quarter in which Palantir has reported positive earnings. This is a big milestone for Palantir as a public company, and it helps to gets investors excited about the potentially profitable future of Palantir. In Q1, Palantir reported a free cash flow of $151M (was -$290M in Q1 2020) with a 44% adjusted FCF margin, they grew revenues by 49% YoY ($341M), and they grew billings by 248% YoY ($362M) which means that Palantir is acquiring new customers and negotiating higher contracts. These financials are great and show a promising future ahead for Palantir, which should excite their investors.\n\nFurthermore, during this quarter they also disclosed their investment in a SPAC. This SPAC is [$QELL – Qell Acquisition Corp.](https://utradea.com/stocks/QELL) which merging with Lilium. Lilium is an eVTOL transportation company, with this investment they also came to a deal with Lilium to use Foundry for design, engineering, testing, production, quality, logistics, and operations. A while back I looked at another eVTOL SPAC Archer ([$ACIC – Atlas Crest Investment Corp.](https://utradea.com/stocks/ACIC)), which has great upside and has a similar business model to Lilium, so if you want to read that to be more informed about Liliums potential performance, [click here.](https://utradea.com/positions/Take_a_SHOT_at_Archers_SPAC_ACIC)\n\nIn Q1, Palantir was also awarded with a [5-year $90M contract](https://www.businesswire.com/news/home/20210405005238/en/Palantir-Selected-by-the-National-Nuclear-Security-Administration-for-5-year-89.9M-Contract-for-SAFER-Project) from the National Nuclear Security Administration (NNSA), in which Palantir will provide the operational platform for their SAFER (Safety Analytics, Forecasting, and Evaluation Reporting) project. This is big news as this is one of Palantir’s bigger contracts, and it shows the level of confidence of the NNSA in Palantir’s software and their cross-enterprise data integration capabilities. On the topic of Palantir and Government Organizations, the DoD used Palantir’s software in all 11 of their Combatant Commands for globally integrated intelligence. This high level of usage from the DoD definitely means that Palantir is doing something right, and if the DoD likes it so much, then it should be more than enough for commercial enterprises.\n\nLastly, in Q1, Palantir won 15 contracts worth over $5M, and 6 contracts worth over $10M with an average duration of 3.7 years (4.6 for commercial customers). This is fantastic for the company as they gained an additional 11 new commercial customers from this, and I will be keeping up to date with these contracts and others as they come up for renewal/negotiations. Additionally, Palantir was able to grow their gross margin to 83% (from 75% Q1 2020), and their contribution margin to 60% (from 41% in Q1 2020). This shows that Palantir business partners are maturing into their 3rd phase, the scale phase, which enables Palantir to grow their margins.\n\n***$PLTR – Palantir Investment Valuation:***\n\n*Comparable Analyses:*\n\nI decided to undergo 2 different comparable analyses in order to get a variety of valuations (or opinions if you will). Preferably, I would like both of these results to be consistent in terms of their fair value estimate, however, if they are not consistent, I will take the average result. I was only able to find 2 multiples/ratios that I could actually analyze due to the nature of these businesses and their lack of positive financial ratios/multiples.\n\n*EV/Revenue:*\n\nThis is a very common multiple among companies that are not profitable in their operations yet, like Palantir and some of these other comparable companies. By comparing Palantir’s EV/Revenue multiple to that of their competitors (listed above on the “competitors” section of this report), I found that Palantir has a fair value of $32.85/share, which implies an upside to this investment of 23.31%. This implies that given Palantir’s current price, they are undervalued, and the upside is very reasonable, however, I decided to undergo the next comparable to see if this result maintains.\n\n*P/B:*\n\nBy comparing Palantir’s P/B ratio to that of their competitors, I found that Palantir has a fair value of $24.87/share, which implies that there is a downside risk of 6.64% to such an investment. As you have probably noticed, these results are not consistent, therefore I have decided to take the average result to get one, final price target.\n\n*Average Comparable:*\n\nBy taking the average result from the 2 comparable analyses underwent, I found that Palantir has a fair value of $28.86/share, which implies an overall upside of 8.36% to this investment. This also implies that Palantir, is in fact an undervalued growth stock, that has the potential to be one of the best undervalued stocks on the market.\n\n***My Plan for Investing into Palantir:***\n\nMy plan for this investment is a little different from usual.\n\nI see anything between $24.87/share (Fair Value of P/B ratio) and $28.86/share (average comparable) as a good chance to buy Palantir at (or below) its fair value. This helps to limit our downside risk of this investment.\n\nHowever, I think the best way to play an investment in Palantir is over the long-run 3+ years. I would attempt to buy in at the above prices and hold for these 3+ years. During this time, I would re-evaluate my investment with every new financial report and piece of news to decide if it is still worth holding.\n\n***Potential Risks to Palantir’s Stock - $PLTR:***\n\n· **Dilution:** Over the past year Palantir has experienced a lot of dilution, however, we have already attributed a great deal of this dilution to their Direct Listing. However, the 20% of dilution that was not derived from the direct listing is still quite high. As investors, we should keep an eye on their future levels of dilution to recognize any patterns/increases that we should be weary of. If these levels of dilution persist, potential investors may be scares off and current investor might sell their positions, which will hurt the share price.\n\n· **Financial Performance:** This year’s financial performance was not one to be overly happy about. Although they were able to increase some pretty important aspects of their balance sheet, Palantir was still yet to make a profit, and increased their net losses by over 100%. If this poor financial performance continues, and they keep digging themselves into a bigger and bigger hole, investors will run away from this stock and never look back. However, the Q1 financial performance gives investors hope for a more profitable future, which will be discussed later.\n\n· **Bad Press:** Historically, Palantir has not been looked at through a positive lens by many people investors and non-investors alike. Their first public backlash came through their involvement in deporting immigrants through [Palantir’s partnership with ICE](https://www.bbc.com/news/business-54348456). Palantir quicky spoke out against this backlash by saying ICE took advantage of their software without proper oversight, and that they are looking into the issues, furthermore they have since declined some potential partnerships with other border agencies to avoid further backlash. There have also been numerous smaller controversies and protests that have damaged Palantir’s reputation, and if there are more large controversies Palantir’s stock could get hurt as a result of it.\n\n***Potential Catalysts that can Help Palantir’s Stock Price:***\n\n· **Share Buybacks:** Over the past year, Palantir has bought back (both directly and indirectly, in a sense) over 4,300,000 of their common shares. This is good to see as an investor, especially this early in the company (and not too long after their Direct Listing). This gives me hope that Palantir will continue to repurchase more shares in the future. This will be good for the share price as it will increase the value of existing shares, and it will be especially good for the stock price if they continue to buyback more shares each year.\n\n· **Financial Performance:** Palantir’s 2020 financial report was not favourable (as discussed previously), however there were definitely some good to take out of it. Palantir increased their revenue, gross profit, and margins by a hefty amount, which is good to see as an investor, however, there was bad aspects of this report as well that made the report unfavourable. However, their newly released Q1 2021 financial report has so much more to offer in terms of good aspects of a financial report.\n\n· **Positive Press:** As previously mentioned, Palantir has had their fair share of bad press that has had a small effect on their share price. However, recently Palantir has been getting better press through helping organizations like the NIH and NHS in their fight against COVID-19, and their vaccine distribution efforts. Partnerships like this help to display the positive impacts that can be derived from Palantir’s technology. Future events where Palantir can use their software for a good cause can help to combat the negative stigma around Palantir and attract more people to invest in their company. This should help their share price in the short term after these articles are released.\n\n· **Success Stories:** Since Palantir have gone public, they have had a few success stories come out, I mentioned some of these stories throughout the article. These success stories show how impactful Palantir’s software can be and can show companies that they can increase revenues, production etc. just by using Palantir’s software. Any future stories like this that come out, highlighting the benefits of Palantir can help the stock soar, and potential clients to reach out and start business/inquiries with Palantir.\n\n· **Renewing Contracts:** I have mentioned that the renewal of contracts can help Palantir’s share price a couple times throughout this article but why is this the case? This is because these companies that are renewing have already been through Palantir’s 3 stage business model and have experienced their software firsthand for numerous years. After their time with Palantir’s software expires they decide to renew the contract. This is good because it shows that Palantir’s software was effective enough to their business in the time they had it that it is worth these $5-15M+ contract renewals. Furthermore, these companies that are renewing already have underwent Palantir’s installation, and these clients will provide Palantir with the highest margins, which will reflect well on Palantir’s future financial reports.\n\n· **New Partnerships/Contracts (and the expansion of commercial enterprise segment):** Every time that Palantir, or its partners release news that they have entered into a contract/agreement, this will help Palantir’s stock. This is because Palantir needs to keep expanding their software into new companies in order to meet their expected growth projections. Furthermore, as more commercial enterprises try Palantir’s software (and hopefully enjoy it), the more willing other companies might be to give Palantir a shot. I see their biggest potential for growth and to become a large company in their expansion of their commercial enterprise segment through Foundry. Every time Palantir gets more new clients on board it is fantastic and shows the feasibility of this segment, and as more contracts role in, more enterprises will take an interest. Furthermore, when Palantir signs these enterprises to a contract, it will help to increase their revenues, which will show up on their financial reports and hopefully help the, to beat estimates.\n\n*This analysis took a long time, and is one of the most comprehensive that I have seen, so I would greatly appreciate if you followed me* [*here*](https://utradea.com/member-portfolio/BeatingTheVTI?utm_source=R&amp;utm_medium=B&amp;utm_campaign=PLTR)*, and commented on my original post!*",
        "subreddit": "wallstreetbets",
        "title": "The best Palantir analysis available!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obn2z7/the_best_palantir_analysis_available/",
        "created": 1625178786.0
    },
    {
        "author": "garrettd714",
        "created_utc": 1627076169,
        "id": "oqc41u",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "So, I had long-term position in WORK. I received about a 1/3 of my equity in CRM stock and the other 2/3 in cash\n\nIs this cash going to be taxed as income/short-term? Did I screw up by not selling my WORK shares for a long term capital gain?",
        "subreddit": "stocks",
        "title": "CRM/WORK merger &amp; taxes",
        "url": "https://www.reddit.com/r/stocks/comments/oqc41u/crmwork_merger_taxes/",
        "created": 1627104969.0
    },
    {
        "author": "hmchugh98",
        "created_utc": 1625837687,
        "id": "ogvo6n",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "AVPT (Formerly known as APXT)\n\nBelow is a portion of the benzinga article from the interview with AVPT (Avepoint’s CEO) \n\nMicrosoft Partnership: AvePoint is the leading data management solutions provider for the Microsoft Corporation (NASDAQ:MSFT) Cloud. \n\nThe company has a 20-year relationship with Microsoft, Jiang said. For every $1 Microsoft earns, there exists $9 of partner opportunity. So rather than competing with Microsoft, AvePoint is competing within the Microsoft ecosystem, he said.\n\nOutside of the current partnership with Microsoft, AvePoint provides services for salesforce.com inc (NYSE:CRM) and Alphabet Inc's (NASDAQ:GOOG) (NASDAQ:GOOGL) Google Docs. The company is also actively looking at working with Amazon.com, Inc.'s (NASDAQ:AMZN) AWS, Jiang said. \n\nEarnings And Analyst Coverage: AvePoint reported first-quarter financial results on May 20. The company announced total revenue of $38.8 million, up 19% year-over-year and SaaS revenue of $18.3 million, up 78% year-over-year.\n\nAvePoint also raised its fiscal year guidance and announced that the company remains debt-free. \n\nAvePoint anticipates announcing its next quarterly financial results in early August. The company is expecting analyst coverage from numerous firms to be published within the next week, Jiang told Benzinga",
        "subreddit": "wallstreetbets",
        "title": "No debt = good bet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ogvo6n/no_debt_good_bet/",
        "created": 1625866487.0
    },
    {
        "author": "Yes_Captain_",
        "created_utc": 1626622724,
        "id": "omsvg7",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "# The Company\n\nAvePoint went public via a merger with $APXT on Friday, the 2nd of July 2021. The company runs over 1,300 employees in 29 global offices and is one of the largest Strategic Cloud Partners of **Microsoft**. It´s all about migrating businesses to the cloud under the aspects of cyber security, compliance and so on. AvePoint had been the global **Microsoft partner of the year** 5 times and runs over 7 Million cloud users already as of today. It aims to add 40,000 managed service provider partners by 2022.\n\nJust a short extract from their customer list:\n\n*Porsche – NBC – Verizon – Rolex – Fiat – Roche – Siemens – Symantec – Disney - NHS – iTV – Sainsburry – really a lot more, but I am lazy.*\n\n# Huge Growth Potential\n\nExpected revenue of $194 Million in 2021 growing with a high rate of &gt;30% YOY and an EBIT Margin of 14% in 2020. Ok, ok. $194 Million - you say *'thats not a lot!'* \\- take 35% Growth rate for the next 6 years: You'll end up with over $1 Billion in revenue by 2027 - SaaS will grow potentially, as we all know, so I don't think we will only have 35% growth. This company is growing and it won't stop - thats for sure. Lets see how AvePoint compares to some of the bigger players out there.\n\n&amp;#x200B;\n\n[$AVPT vs $OKTA vs $CRM Disclaimer: I give no guarantee for the correctness of the data shown.](https://preview.redd.it/1zhrkr9nqzb71.png?width=1292&amp;format=png&amp;auto=webp&amp;s=1827c93650b44c29af23a2352846b417be010971)\n\n# AvePoint Announces $20.0 million APXT Share Purchase Program\n\n$AVPT is down almost 50% from its ATH of 16.55 in January. The SPAC sell-off made it more than difficult and even managements announcement to purchase over **$20 Million** didn’t help to keep it uptrend. I am convinced that this is not just another SPAC and that numbers are clearly speaking for its business. Having a partner like Microsoft and growing with over 30% into a cloud-based business is almost a no-brainer for me. Time will tell. Compare it with OKTA in 2017, going public at a $6 Billion valuation, which is not so much far away from AvePoint today.\n\nDisclaimer\n\nThe contents on this site are for informational and entertainment purposes only and does not constitute financial, accounting, or legal advice. I can’t promise that the information shared on my posts is appropriate for you or anyone else. By using this site, you agree to hold me harmless from any ramifications, financial or otherwise, that occur to you as a result of acting on information found on this site. I give no guarantee for the correctness of the data shown.",
        "subreddit": "wallstreetbets",
        "title": "My first DD on $AVPT comparing it to $OKTA and $CRM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/omsvg7/my_first_dd_on_avpt_comparing_it_to_okta_and_crm/",
        "created": 1626651524.0
    },
    {
        "author": "Adept_Chip",
        "created_utc": 1626191735,
        "id": "ojiijf",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "So I read this article by Angela Harmantas from Proactive Investors today and it made me question things. Here’s a quote: \n\n&gt;**It has been said that the coronavirus (COVID-19) pandemic has accelerated the remote economy, but is that really true?**  \n&gt;  \n&gt;Before the pandemic hit in 2020, around 5% of Americans worked out of the home, but by the spring of that year that number had **skyrocketed to 60%.**   \n&gt;  \n&gt;Kalish estimates that the remote economy is a “**multi-trillion-dollar global marketplace**” that has room for multiple players, many of which are just starting out. “It may seem like this is a mature economy, but I believe we’re on the ground floor of opportunities in this tech space.”  \n&gt;  \n&gt;“Adopting any kind of flexibility to function in a remote world is going to be the new normal,” Kalish said. **“You can be a doctor without an office, or a professor without a lecture room.”**\n\nThe article you can see here [Xigem Technologies sees multiple opportunities to help companies make the shift to the remote economy](https://www.proactiveinvestors.com/companies/news/954785/xigem-technologies-sees-multiple-opportunities-to-help-companies-make-the-shift-to-the-remote-economy-954785.html)\n\nThe first question, I can’t find a direct definition for the \"remote economy\". I'm somewhat new to it, I know gig economy, sharing economy, but not remote economy. **What is it?** \n\nI get the general idea, but my best description is “you know, all this sh#t that started in 2019”. I know that it will most likely bring me gains, i FEEL what it is, but I don’t want to invest in “all this sh#t”. it would be hard to explain lol. Some better words are needed. \n\nThey don't give the definition, mention the options: \n\n**$XIGM Xigem** \\- the subject of the article, so hard to be unbiased here for them, I guess. I already bought 700 shares a week ago in case of a shot anyway, revenue is promised in Q3, but so far it’s a high risk - high win. And most importantly - it’s just one stock;  \n\n**$CRM SalesForce** \\- it’s growing, it looks promising, I like it, but it costs damn $246,3 per share. It’s not a penny; \n\n**$ORCL Oracle** \\- 44% in the last 6 months, real «remote economy» stock, but not a penny, it’s $87,5 for share. \n\nI’m a good-ol’ rebel, so I tried to come up with **other ideas**. My best guesses, NOTE - before the DD on each of them: \n\n**$XELA - Exela tech**, business solutions, transactions management, and all that stuff. The stock that actually made me do the 2+2 with Xigem article, because it shot 48% up today, and it’s 236% up in the last 6 months. No idea why and I wish I noticed it before. Guess I’m late here. \n\n**$PIXY - ShiftPixy**, looks good and fits in the article, especially in the «professor without a classroom» part, just for anyone. Basically a remote gig economy stock. Cheapie as well: $2,14 for share. Falling, but don’t know yet whether any catalysts will be in the nearest future. \n\nI’ve had a good, professional and in-depth discussion with my imaginary friends this whole morning, and now I invite you to join. **The main question:** \n\nWhat exactly is Remote Economy and what companies should shoot up on this train? Any other companies position themselves as providers for this this multi-trillion-dollar thing like Xigem, or they’re the first ones in it? Given that the whole remote thing is not going anywhere, how to make money on it? \n\nBonus question for those in $XELA or $PIXY - am I late?",
        "subreddit": "pennystocks",
        "title": "Tech in Remote Economy. What is even that?",
        "url": "https://www.reddit.com/r/pennystocks/comments/ojiijf/tech_in_remote_economy_what_is_even_that/",
        "created": 1626220535.0
    },
    {
        "author": "CUIN2Telx",
        "created_utc": 1625712078,
        "id": "ofy5sg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Check out VERB Technology Company in the am? SaaS CRM/LiveStreaming interactive video technology and sales enablement company that just integrated with Microsoft Outlook. https://www.verb.tech",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ofy5sg/check_out_verb_technology_company_in_the_am_saas/",
        "created": 1625740878.0
    },
    {
        "author": "butthoofer",
        "created_utc": 1626977941,
        "id": "opjpie",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "The Call Stated off with David introducing himself as the new CEO and then he went on to cover the the milestones that have been hit.\n\n\\#1 Obviously he is the New CEO and have been operating inside fuse Science for the last 2 quarters of FY20 \n\n\\# 2 He discussed that they have Access to OTC IQ and confirmed that Filings and attorney letter will be up soon \n\n\\# 3 He then went on to confirm that the Share Structure will not be altered and will remain as is  \n\n&amp;#x200B;\n\nThe David Went onto detail the main focus of the company Kustomeroo\n\nhttps://preview.redd.it/jf2ozs160tc71.png?width=1336&amp;format=png&amp;auto=webp&amp;s=b11f7277f8965fe985b432447d394b63c97cfb0c\n\nKustomeroo is a new contender in the in booming software as a service (SaaS) market focusing on the real time and engaging customer service like the ability to take video service calls or for an easy way to  field service and support for clients with integration with Shopify, Slack, WebFlow, Zapier, Airtable  and Hubspot as the main plug and play widget the client can integrate with\n\n&amp;#x200B;\n\n[David also covered the Pricing model and covered the white label solution for a seamless setup for each client ](https://preview.redd.it/ioj8jsct0tc71.png?width=1339&amp;format=png&amp;auto=webp&amp;s=833d81caa856751d5312e28f39828a9417ea9a24)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ojoqsj3c1tc71.png?width=1339&amp;format=png&amp;auto=webp&amp;s=f274c1157c81f14499cf9e0c8ae70a1bfde48421\n\nThen it was time for a quick walkthrough of the actually application and an explanation of all the current features including the easy click and create widgets that clients can use for their service platforms \n\nHe then went on to do a quick Q&amp;A where he confirmed they are ontrack for current status before the September deadlines and even possibly before the TD Ameritrade august cutoff \n\nTLDR So how was it \n\nDave seems like a grinder that has poured allot into the development of this product while new to the market has the key indicators for a successful SaaS app like a simple click and create design \n\nConfirmation of the Stable Share structure and Partnerships that will add growth is promising and he seemed excited about Growth prospects \n\nwith SaaS service platforms getting bought like the recent Five9 acquisition and Salesforce buying slack the market could see some added attention in the upcoming weeks/months \n\nOverall I am still Bullish AF",
        "subreddit": "pennystocks",
        "title": "$DROP Had its First Share Holder Event Last night how did it Go?",
        "url": "https://www.reddit.com/r/pennystocks/comments/opjpie/drop_had_its_first_share_holder_event_last_night/",
        "created": 1627006741.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1626977518,
        "id": "opjkfu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Palantir is an American software company that specializes in big data analytics, with a market cap of 43 billion. They started building software for the intelligence community in the US to assist in counterterrorism investigations by helping them identify patterns hidden deep within large data sets. Later, they realized that similarly to the intelligence community, commercial institutions did not have the most effective tools to manage and make sense of the data involved in large projects. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/2sunzi3x1tc71.png?width=1236&amp;format=png&amp;auto=webp&amp;s=68fa49140d7b85732881dce430169202ab36885e\n\nAny large scale company or business will always collect a ton of data most often stored in texts such as spreadsheets or databases (which requires programming knowledge to navigate through). A common issue large companies have is simply having too much data. Palantir creates software that consolidates a company's data and displays it in a comprehensible, easily digestible user interface for the company to use. This allows Palantir to work with companies/organizations like the CDC for medicine, the military for national security, etc. \n\nWith Palantir, a normal non-technical operator can click their computer to pull up an order, or an issue that Palanrie detected, make any changes and or notify whoever needs the attention. Let's take the CDC for example. When the vaccine rolled out, Palantir had a huge hand in this. Palantir gives a visual display of where the vaccine is going, how many, and any issues that have risen (if any), allowing for fast response time. For example, Palantir could display a map with the various routes to different deployment sites with pictures of a little truck representing the shipments being routed to their destination. An operator could click one of these shipments/routes and pull up any data of that specific point. With data being displayed and organized in this way it makes it easy to analyze data, where things are going, and what kind of picture the data represents, rather than staring at a spreadsheet of numbers. This is just one example, Palantir is customizable enough where it can represent any business/organization's structure.\n\nPalantir’s revenue streams consist of their two main software: [Gotham](https://www.palantir.com/palantir-gotham/), which was designed primarily for the defence and intelligence sector, and [Foundry](https://www.palantir.com/palantir-foundry/) for the commercial sector. However, the platforms are not exclusive to either sector. For example, Gotham is also offered to commercial customers in the financial services industry. The two platforms can either be used separately or bundled together as a single ecosystem. Currently, revenue is more or less evenly split between the government and commercial sectors. \n\nGotham’s main tools include:\n\nGaia – lets users plan, execute, and report on operations via a shared live map. Live maps track real-time data and users drag and drop objects from other Gotham applications directly into Gaia.\n\nDossier – is a live collaboration document editor to share analysis and discover intelligence. Users can collaborate across teams and organizations to create a living, interactive, and up-to-date document.\n\nVideo – an application designed to interact with both streaming and historical video data. Users can review video footage in the platform as well as enhance raw footage with geospatial information and overlays based on other data sources.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w2ck45zx1tc71.png?width=1242&amp;format=png&amp;auto=webp&amp;s=e562521338e3b912c19a1a47e17e4013ad9b5e61\n\nFoundry’s main tools include:\n\nContour – enables exploration of large-scale data. Users can filter, join, and visualize datasets to answer analytical questions and publish the results as a report or new dataset that will automatically update with the underlying datasets.\n\nObject Explorer – allows users to interact with data represented as objects – like customers, equipment, or plants – rather than rows in a table.\n\nAs we know, Palantir started in the defence and intelligence space. This required Palantir to have elite-level security from the start. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This was no easy feat, however, Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has IL-5 clearance with the Department of Defense, which makes them 1 of 4 software companies with this level of clearance, alongside Oracle, Salesforce, and SAP (Google and Snowflake have IL-2 clearance). It has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of classified information.\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology is and should provide ease of mind to companies that they are in business with.",
        "subreddit": "StockMarket",
        "title": "Palantir - A long Term Winner",
        "url": "https://www.reddit.com/r/StockMarket/comments/opjkfu/palantir_a_long_term_winner/",
        "created": 1627006318.0
    },
    {
        "author": "WallstApes666",
        "created_utc": 1626125176,
        "id": "oj0uei",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GLOBE NEWSWIRE) — Verb Technology Company, Inc. (NASDAQ: VERB) (“VERB” or the “Company”), a leader in interactive video-based sales enablement applications, including interactive livestream eCommerce, webinar, CRM and marketing applications for entrepreneurs and enterprise. Verb🚀✈️",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oj0uei/globe_newswire_verb_technology_company_inc_nasdaq/",
        "created": 1626153976.0
    },
    {
        "author": "Chamath_Papaya",
        "created_utc": 1626400836,
        "id": "ol75g9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Payoneer is a payment platform that offers a way for businesses to pay and receive money, for a low fee. Payoneer believes that the total addressable market (defined as global e-commerce volume) is $26 trillion a year. Payoneer processed over $44 billion in 2020 alone.\n\nPayoneer works with 9 of the top 20 most valuable companies. Alongside these big names, Payoneer also has 5 million+ marketplaces and businesses, across over 190 countries.\n\nPayoneer also offers:\n\n* Accounting integrations\n* Capital to small businesses\n* Regulatory and compliance infrastructure\n* Physical debit cards\n* Tax solutions\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins and no doubt they will be offering that soon, if anything they should make that a major priority.\n\n**Management Team**\n\nScott Galit - CEO of Payoneer, previously a senior VP at MasterCard. Serious financial services pedigree.\n\nMichael G Levine - CFO of Payoneer, ex-City VP and ex-CFO of Maler Technologies. MBA from Wharton.\n\nBetsy Cohen - Tons of finance related experience, including founding Bancorp. Should be able to give Payoneer great advice for future growth.\n\n**Customers**\n\nPayoneer has some big name clients, including but not limited to:\n\n* Amazon Europe\n* Google\n* eBay\n* Walmart\n* Upwork\n* Fiverr\n* AirBnB\n* Booking.com\n\nWeird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n**Switching Costs**\n\nIntegrating, setting up, and teaching staff how to use a new payment platform can be time-consuming and expensive for businesses. Therefore, when a client is set up on Payoneer, it is unlikely that they will switch to another provider. This is best seen by the &gt;100% volume retention that Payoneer has (i.e. customers stay and increase their payment volume).\n\n**Brand**\n\nPayoneer, from what I have seen, has a strong brand (though this is obviously a subjective factor). This idea is reinforced by the presence of their big name clients. Branding is really important in FinTech, businesses need 100% confidence when money and payments are involved. This offers not only stops entrants into their market, but should also facilitate future growth and customer acquisition.\n\n**Network Effect**\n\nImagine company A is on Payoneer and wants to pay company B. Company A suggests payment through their usual payment processor, Payoneer. Company B now signs up to Payoneer and decides to do all their payments through it etc. This is the network effect that Payoneer enjoys. This is a very powerful barrier to entry - very difficult to overcome, while also hard to create yourself.\n\n**Geographies**\n\nUNSUBSTANTIATED: Conversations on Reddit leads me to believe that Payoneer has a strong presence in Asia. If anyone has evidence, please put it in the comments.\n\nIf this is true, it should give Payoneer an edge in capitalising on the future growth of the emerging markets.\n\nSome evidence:\n\n* The CEO has gone on record saying Korea is one of their big market focuses.\n* Achieved triple digit growth each year in the asian markets from 2012-2016.\n\n# Valuation and Financials\n\n# Enterprise Value: $3.29 billion\n\n# Projected 2021 revenue: $432 million\n\n# EV/2021 revenue multiple: 7.6x\n\n# 2019-2020 revenue growth: 8.8%\n\n**Institutional Ownership**\n\nPayoneer has some institutional giants already invested, including Wellington Management, Dragoneer Investment Group, Fidelity Management and Research, Temasek, and Franklin Templeton.\n\n**What do I think the future holds for Payoneer? I actually think there are several exits for this company.**\n\n1. **Growth**: The company continues to grow and eventually reach billions of revenue within 5 to 10  years.\n2. **Consolidation**: Large international payments processer buys them. Could be Paypal, Square,      Stripe, First Data, etc. consolidation WILL happen in this space and I  think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks, and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n3. **Wildcard**: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First, it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be stored, and legal transactions then it will be a financial transaction.      They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\nPersonal Note\n\n**Price Target**\n\nBull Case: $26\n\nMain Case: $21\n\nBear Case: $16\n\nHow did I get these numbers? Just educated guesses.\n\nDisclosure I am long on the company  (LEAP's and Shares)",
        "subreddit": "stocks",
        "title": "$PAYO your Baby Momma so she can feed the kids",
        "url": "https://www.reddit.com/r/stocks/comments/ol75g9/payo_your_baby_momma_so_she_can_feed_the_kids/",
        "created": 1626429636.0
    },
    {
        "author": "stilgre",
        "created_utc": 1627069952,
        "id": "oqa33d",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Lost Money on $WORK + $CRM Merger. Can Someone Explain How This Happened Please?",
        "url": "https://www.reddit.com/r/investing/comments/oqa33d/lost_money_on_work_crm_merger_can_someone_explain/",
        "created": 1627098752.0
    },
    {
        "author": "Yes_Captain_",
        "created_utc": 1625694738,
        "id": "oft02j",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "# The Company\n\nAvePoint went public via a merger with $APXT on Friday, the 2nd of July 2021. The company runs over 1,300 employees in 29 global offices and is one of the largest Strategic Cloud Partners of **Microsoft**. **Folks, get ready for a new SaaS company that will pull your trousers up, up and above**. It´s all about migrating businesses to the cloud under the aspects of cyber security, compliance and so on. AvePoint had been the global **Microsoft partner of the year** 5 times already and runs over 7 Million cloud users already as of today. It aims to add 40,000 managed service provider partners by 2022.\n\nJust a short extract from their customer list:\n\n*Porsche – NBC – Verizon – Rolex – Fiat – Roche – Siemens – Symantec – Disney  -  NHS – iTV – Sainsburry – really a lot more, but I am lazy.*\n\n**Huge Growth Potential**\n\nExpected revenue of $194 Million in 2021 growing with a high rate of &gt;30% YOY and an EBIT Margin of 14% in 2020. Ok, ok. $194 Million - you say *'thats not a lot!'* \\- take 35% Growth rate for the next 6 years: You'll end up with over $1 Billion in revenue by 2027 - SaaS will grow potentially, as we all know, so I don't think we will only have 35% growth. This company is growing and it won't stop - thats for sure. To show you how much I think this is undervalued I created a comparison between AvePoint, Okta and Salesforce. Lets get this in depth:\n\n&amp;#x200B;\n\n[$AVPT vs $OKTA vs $CRM](https://preview.redd.it/msir6zet2v971.png?width=2068&amp;format=png&amp;auto=webp&amp;s=7da6e311a97fa6761f96ce9f6262952d26cc9874)\n\n# AvePoint Announces $20.0 million APXT Share Purchase Program\n\n$AVPT is down almost 50% from its ATH of 16.55 in January. The SPAC sell-off made it more than difficult and even managements announcement to purchase over **$20 Million** didn’t help to keep it uptrend. I am convinced that this is not just another SPAC and that numbers are clearly speaking for its business. Having a partner like Microsoft and growing with over 30% into a cloud-based business is almost a no-brainer for me. Time will tell. Compare it with OKTA in 2017, going public at a $6 Billion valuation, which is not so much far away from AvePoint today. \n\n**It´s not that Eppstein, youre thinking of**\n\nJeff Eppstein - yes, you read it correctly - but its not THAT Jeff Eppstein you're thinking of. **This** Jeff brought already companies like booking $BKNG from a $1 Billion valuation up to $80 Billion on the NASDAQ. But also the NYSE knows Jeff pretty good: He brought $TWLO in 2017 from $4 Billion to $48 Billion. Folks, get in or stay out - buckle up: this is going to be HOT HOT HOT, isn't it?\n\nDisclaimer \n\nThe contents on this site are for informational and entertainment purposes only and does not constitute financial, accounting, or legal advice. I can’t promise that the information shared on my posts is appropriate for you or anyone else. By using this site, you agree to hold me harmless from any ramifications, financial or otherwise, that occur to you as a result of acting on information found on this site. I give no guarantee for the correctness of the data shown.",
        "subreddit": "wallstreetbets",
        "title": "$AVPT vs $OKTA vs $CRM or why AvePoint will make you money (CSC - Company Stock Comparison)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oft02j/avpt_vs_okta_vs_crm_or_why_avepoint_will_make_you/",
        "created": 1625723538.0
    },
    {
        "author": "TheStonksHub",
        "created_utc": 1626620915,
        "id": "omsa3r",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " **Overview**\n\nWhat is exactly is Global-E? They are a company that integrates with e-commerce platforms to remove complexity with international transactions and provide localized solutions that improve the online shopping experience. The core of the services revolve around the following (from the S-1):\n\n&amp;#x200B;\n\n&gt;“The vast capabilities of our end-to-end platform include interaction with shoppers in their native languages, market-adjusted pricing, payment options tailored to local market preferences, compliance with local consumer regulations and requirements such as customs duties and taxes, shipping services, after-sales support and returns management. These elements are unified under the Global-e platform to enhance the shopper experience and enable merchants to capture the cross-border opportunity.”\n\n&amp;#x200B;\n\nThey are the “plug and play” of making e-commerce international. Their vast network of APIs allow a customer to simply integrate their platform and seamlessly begin selling across different borders and languages. Here’s what they do.\n\n&amp;#x200B;\n\nCurrently, Global-E supports:\n\n* Local messaging in over 25 languages\n* Purchases in over 100 currencies\n* Accepts over 150 payment methods\n* A multitude of competitively-priced shipping options\n\n&amp;#x200B;\n\n**Business Model**\n\nGlobal-E generates revenues by charging a fee (“service fee”) for the integration of their platform into a merchant’s services. Service fees are highly variable based on transaction volume, destination markets, level of customer service provided, etc, and are generated as a percentage of the Gross Merchandise Value (“GMV”) that flows through the platform. Global-E mandatorily bundles certain components of their integrated platform solutions that they believe are essential for achieving improved sales conversions from international traffic. However, their fulfillment services are offered on an optional basis and merchants can choose to utilize those services or cancel at any time. Think of it as bundling service A and B to have the greatest effect, while offering service C as an add-on component. Service fees make up for approximately 35% of revenue while fulfillment services are currently accounting for roughly 65%.\n\n&amp;#x200B;\n\n**Partnerships &amp; why they use Global-E**\n\nGlobal-E has formed many key technological as well as service partnerships. These third-party e-commerce platforms include: Salesforce Commerce Cloud, Shopify, BigCommerce, Magento Commerce, SAP, WooCommerce, PrestaShop, and others.\n\n&amp;#x200B;\n\n*What they do for merchants?*\n\nSome of the key benefits they provide for merchants are:\n\n* increased sales conversions: converting international traffic\n* offloading complexities: handling local pricing, payment collection, import duties, fraud, etc \n* reduction of risk: reduce legal complexity, manage import duties and taxes, handle compliance\n* enabling growth to new markets: allowing merchants flexibility to expand to cross-border opportunities\n\nAll while emphasizing merchant branding. The customer always faces the digital store-front and never leaves the brand page to check-out.\n\n&amp;#x200B;\n\n*What they do for shoppers?*\n\nGlobal-E’s goal is to offer a frictionless shopping journey, regardless of the origin of the customer. This means:\n\n* Localized languages\n* Re-pricing in local currencies\n* Handling cross-border payments\n* Accurately pre-price import duties and taxes and include them in the final cost of the product\n* Delivery: using an extensive network of over 20 shipping carriers they are able to offer multiple shipping modes at attractive rates.\n* After-sale support and returns\n\nMerchants integrating Global-E into their platform generally experience a significantly higher international traffic conversion rate (often exceeding 60%). The Global-E platform removes many complexities involved with international expansion. They already have more than 400 merchants, from small companies to globally-recognized retailers, on the platform across various diversified verticals.\n\n&amp;#x200B;\n\n**Shopify Deal**\n\nAs mentioned above, one of Global-E most lucrative partners lies with Shopify making them the exclusive third-party and cross-border solution across the large network of Shopify merchants. Shopify knows what kind of business that will bring for Global-E and thus Shopify has bought 7.75 million shares and acquired a **6.5% stake** in the company. As Shopify grows Global-E grows and Shopify knows this, hence the stake in a company that reflects their own revenues by proxy.\n\n&amp;#x200B;\n\n**TAM, &amp; CAGR**\n\nFirst came the transition to domestic e-commerce as well as sourcing and reselling products from China (aka Dropshipping). Next is going to be the transition of global e-commerce and cross-border sales. According to this 225 page **research by GlobeNewsWire**, the global cross-border B2C e-commerce market was 780 billion in 2019 and expected to grow at a CAGR of 27% through 2026 where it will become a 4.82 trillion market.\n\n&amp;#x200B;\n\n**Global-E’s Smart Insights**\n\nOne of the company’s strengths lies within sophisticated “Smart Insights” they use to scale their applications. Smart Insights is a “big data” network that uses various metrics such as country, price-point, and shopper behaviors allowing Global-E to provide highly-optimized experience for shoppers. This ends up driving increased conversion rates and revenues for the merchant and a better overall experience for the shopper. The company has noted by integrating big-data into their platform they can experience “economies of scale” as well as “economies of skill” enabling them to optimize merchants’ cross-border sales. These insights are continuously expanding as they collect additional data points along the purchasing journey.\n\n&amp;#x200B;\n\n**Competitive Advantage &amp; Growth Opportunities**\n\nWhat seems to be becoming more of a trend since 2020 and even more so now in 2021 are corporation’s use of big data. I’m not talking about basic user data such as age, gender, location, but more on the lines of vastly large information networks. These networks can utilize things such as time spent on page, scrolls, and clicks all in one massive database. Global-E differentiates themselves through their main data asset (“Smart Insights”) that informs them on certain decisions and is able to optimize how merchants sell their product across different borders. They integrate this data network into a flywheel effect, for example: their current analytics drives more sales to merchants, which then feeds new data back into the system, which then allows for higher optimization and better conversions. They feed into each other back and forth getting smarter with each website visitor and purchase. This aligns perfectly for their products “Net Dollar Retention Rate” of 134% and 172% in 2019 and 2020, respectively.\n\n&amp;#x200B;\n\nGlobal-E attributes much of their growth to being a first mover (and doing it right) in the cross-border e-commerce space. Their success has been accelerated by several key factors, such as:\n\n* Accelerated shift towards e-commerce outpacing traditional retail\n* Cross-border e-commerce growing faster than domestic e-commerce\n* Their merchant’s strategic focus on D2C sales, maintaining relationship with shoppers globally\n* The complexity and limitations of leaving the merchant responsible for implementing what Global-E offers. This doesn’t come down to just a cost, but also time-intensive as well as being difficult to maintain and scale\n* Covid-19 tailwinds\n\n&amp;#x200B;\n\nAs a result of the above and other market factors, the cross-borders e-commerce market is expected to continue the surge in growth. I previously mentioned the forecast in TAM however, Forrester, a research company, also expects the cross-border e-commerce markets to reach $736 billion by 2023.\n\nGlobal-E has several opportunities to expand on existing channels and capture new markets. This can be done with:\n\n* Growth through existing portfolio of merchants and strengthening relationships\n* Acquiring new merchants in existing geographies\n* Expanding in new geographies that they don’t have exposure to\n* Continue to expand and innovate their platform\n* Continue to develop strategic partnerships (with key brands and players)\n\n&amp;#x200B;\n\n**Risks**\n\nMany of Global-E’s risks fall under the category of general business risks. Some of these include: retaining old merchants and attracting new ones, failing to enhance the platform as well as successfully competing against new and existing competition, failing to manage growth, pricing pressures from competition, and being highly dependent on cross-border regulations, sales, and operations.\n\n&amp;#x200B;\n\n**Revenues, Scale, &amp; Profitability**\n\nIn FY 2020 Global-E helped process 4.6 million orders for their merchants generating $136.4 million. Their Gross Merchandise Value (GMV) also grew to 774 million for the same period. Other impressive metrics were their net dollar retention rate and gross profit as % of revenue both of which continue to climb at 172% and 31.9%, respectively. Stellar!\n\n&amp;#x200B;\n\nAlthough the company has recently turned a profit while growing top-line revenue and GMV at a high pace. The company suggested that short-term profitability might be sacrificed due to the expansions they are making to cover larger markets. As noted from the S-1:\n\n&amp;#x200B;\n\n&gt;“We expect our operating expenses to significantly increase over the next several years as we hire additional personnel, expand into new geographies, expand our partnerships, operations, and infrastructure, continue to enhance our platform, develop and expand its features, integrations and capabilities, expand and improve our service offering and increase our spending on sales and marketing. We intend to continue to build and enhance our platform through internal research and development and we may also selectively pursue acquisitions.”\n\n&amp;#x200B;\n\nLet’s take a quick peak at their consolidated statement of operations. Note the revenue growth and total operating expenses that *decreas*e, as a percentage of total revenue, as revenues increase (almost doubles YoY).\n\n&amp;#x200B;\n\n**Valuation**\n\nLooking at GLBE’s valuation it is clear that you pay a premium when owning this company.\n\n&amp;#x200B;\n\n*The Good*\n\nGLBE is growing revenue at 134% YoY.\n\nGross margins are improving while the company continues to scale.\n\nMany tech and services partnerships they can piggy back on.\n\n&amp;#x200B;\n\n*The Bad*\n\nConsistent profitability could be years away as the company is investing heavily into their own expansion of current and new markets.\n\nGLBE is currently trading at roughly 50x price to sales and 260 forward P/E.\n\n&amp;#x200B;\n\n*Up for Debate*\n\nGlobal-E has almost no long-term debt, but current liabilities are stacking up while the company is not generating much FCF. I wouldn’t expect them to be generating this much FCF this early in the game after their IPO.\n\nLock-up expiration on August 11, 2021.\n\n&amp;#x200B;\n\n**Final Thoughts**\n\nIn my opinion Global-E is top of the class when it comes to their business. They are growing extremely fast while improving margins and this is the premium you would pay versus investing in a “stable” company generating tons of FCF, but not much growth. Due to the nature of being a high-growth stock there will naturally be more volatility around the trade. While it’s currently trading at 50x price/sales I am more likely to shy away from entering a new position. We could see this stock swing to 40x p/s and potentially enter on the dips.\n\nThis is somewhat of a chicken or the egg situation because there might not be any dips to buy with this kind of growth. For example, at current growth rates (100-135% YoY) if stock price is maintained it would only be trading at less than half it’s price/sales valuation only one year from now. This is definitely a stock to monitor closely if you are wanting to find the right entry point for a long-term hold.\n\n&amp;#x200B;\n\n**TLDR;**\n\n1. Global-E is an “enabler” that allows e-commerce and digital stores to seamlessly integrate international transactions. They deal with tasks from translations, currency re-pricing, international shipping &amp; returns, compliance &amp; tax regulations, etc.\n2. GLBE integrates their proprietary “Smart Insights” application that analyses customer shopping and transaction data to continuously improve on sales conversions. The feedback loop is always learning as it collects more and more data along each customer’s purchase journey.\n3. GLBE is trading at a rich valuation given their total revenue was $136 million in 2020. However, they are growing top-line revenues and Gross Merchandise Value (GMV) over 130% Y.o.Y. Shopify holds a 6.5% stake in Global-E as GLBE facilitates a large amount of transactions on the Shopify network. As Shopify grows, GLBE grows.\n4. GLBE is growing through many tailwinds such as those from covid lockdowns and accelerated shift toward e-commerce outpacing traditional retail. They’ve got an opportunity to expand into more international regions, strengthen relationships with existing merchants, while continuing to expand and improve their platform.",
        "subreddit": "stocks",
        "title": "The Weekly DD - Global-E Online (GLBE): The Uncut Diamond",
        "url": "https://www.reddit.com/r/stocks/comments/omsa3r/the_weekly_dd_globale_online_glbe_the_uncut/",
        "created": 1626649715.0
    },
    {
        "author": "valuescott",
        "created_utc": 1625441302,
        "id": "odvguf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Company Summary\n\nOmnicom is an advertising agency that specializes in advertising, marketing and business communications services.  In a world of increasingly fragmented information streams (Different social media platforms, more and more places to list ads ...), OMC may find difficulty in growing their business and competing with large content providers for diversified revenue.  Since they are solely an advertising agency, they are not a direct competitor with facebook / twitter, but they will have to, and have been changing their approach to how they carry out their operations.  OMC can act as a middleman in advertising.  A business looking to carry out an advertising campaign would go to OMC and OMC would spread marketing content across many content providers.  \n\nTheir operations can be generalized into three categories: Advertising, Public relations, healthcare, and CRM stuff.  Here is the list of the distinct different services that they offer:\n\nadvertising, investor relations, branding, graphic arts/digital imaging, \n\nmarketing research, content marketing, media planning and buying,\n\ncorporate social responsibility consulting, merchandising and point of sale,\n\ncrisis communications, mobile marketing, custom publishing , non-profit marketing,\n\nmulti-cultural marketing, data analytics, database management, organizational communications,  \n\npackage design, digital transformation, product placement, digital/direct marketing ,\n\nentertainment marketing, promotional marketing, experiential marketing,  \n\npublic affairs, field marketing, public relations, sales support,\n\nfinancial/corporate business-to-business advertising, retail marketing,\n\nhealthcare marketing and communications, search engine marketing, instore design,  \n\nshopper marketing, interactive marketing, social media marketing, sports and event marketing\n\nManagement overview:\n\nFrom glassdoor, 95% of employees approve of the CEO.  Most reviews say that management encourages discussion and recommendations, but there are a few bad reviews related to the personal relationships between management and employees.  The CEO seems average. CFO and CEO do not have much info about them online.  The CIO seems like he knows what he’s doing, and has a lot of experience.  \n\n## Company history\n\nOMC was created from a three way merger in 1986.  The current CEO has been in his position since 1999.  The three way merger involved BBDO, DDB, and NHW.  BBDO was rated the world's most creative agency, DDB was one of the largest advertising networks in the world, and TBWA was ranked in the top ten agencies that utilize disruption to develop business changing ideas.  These companies all exist under OMC as subsidies where OMC acts as the holding company.  The three subsidies act independently of each other.\n\nBBDO was formed in 1919 in NYC.  Bruice Barton (the BB) was a philosopher and eventually a congressman and then almost a senator.  He has admitted that he was not a good match for the advertising industry.  Roy Durstine (the D) was more involved in the actual business.  He eventually became a workaholic, lost his wife, became an alcoholic and got fired in 1939.  Alex Osbor (the O) is a mystery.  BBDOs business then started to boom and they picked up some large clients in the early 40s.  There was a lot of turmoil in the company in the 50s and 60s as the old guys were replaced, and new clients were slowly being acquired as old ones were lost or went out of business.  They became very involved in advertising for the republicans during this time.  They did not do well in the 70s during the recession, which should not be forgotten today, but they managed to get by much better than other companies.    In 1976, a CEO started an 8 year tenure and managed to keep the company stable by employing special cost management measures so as not to waste the spoils of growth.  At the time of the merger, BBDO was the only of the three that was not experiencing financial difficulties.  BBDO agreed to the merger because the other companies had consistent international growth, which was apparently lacking in BBDO.\n\nDDB was formed in 1949 by three men all of whom had previous industry experience.  They had tremendous success early on, focusing on hiring the most creative people they could find and taking the road not traveled.  At the time, Polaroid was an unknown company.  They were one of the first four to be clients of DDB In the 60s they did work for Avis rentals and Volkswagen.  At the time, nobody wanted Volkswagens in America.  DDB was instrumental in changing this with their campaigns for the VW beetle, making the vehicle a major success in America. Following this success they won over many major clients such as Heinz, American Airlines, Mobil oil, and Gillette to name a few.  In 1982, William Bernbach (the B) died.  This caused earnings to plummet, and financial difficulty closely followed.  By 1986, they had lost some of their most important clients, including polaroid, which was probably their biggest success.  The merger was a no-brainer for them with the resources of BBDO.\n\nTBWA started in 1924.  They had a strong presence in the middle east.  They provided a lot of services to smaller companies that otherwise felt neglected by larger advertising agencies.  I cannot find anything interesting about them between 1924 and 1970.  In the 70s, they found it difficult to find investment interest, so they decided to become private.  They had by now acquired many blue chip clients such as xerox, mcdonalds, honda, and sears on top of their many smaller clients.  They lost mcdonalds and xerox leading up to the 198 6 merger, and there were some conflicts in the merger such as campbells soup threatening to leave TBWA because Heinz would be a client of the parent OMC after the merger.  \n\nProfits for OMC after the merger were low.  In the 90s, OMC grew revenues, and at the end of the decade, a new CEO was put in place and the company had begun to diversify into digital marketing.  In 1997, they were fortune's most respected advertising group.  In 1997, they won back McDonalds.  All throughout this period, they have been acquiring companies worldwide.  \n\nIn the 2000s, OMC lost its position as the world's largest advertiser to WPP.  OMC bought 19 companies in 2000. OMC was hurt by 9/11, but managed to rebuild with the rest of the country.  OMC aggressively pursued goals in hollywood.  When the Enron scandal happened, 7 of OMCs board members were ousted and OMC decided to commit to better corporate governance. By 2002, OMC was in good shape while rivals were restructuring and laying off employees.  \n\nGrowth afterwards was much more predictable.  OMC took on many blue chip companies as clients, and saw great client retention for the next two decades.   \n\n## Revenue Breakdown / Company segments\n\nTheir 100 largest clients represent 54% of revenue, and their largest client represents 3.4%.  They lost 11.7% of revenue in the past year, but given that the events last year are not typical, this is not expected to be a long term trend.\n\nTotal revenue is 13.171 billion.\n\n1. The Americas accounted for 8.752B of this.  North America had 7.577B and latin America had 0.275 B.\n2. Europe, Middle East, And Asia Accounted for 5.317 Billion.  Europe had 3.607B, Middle East/Africa had 0.207B, and Asia had 1.503B\n\nBecause this is an American company, the implications make sense.  Revenue is most concentrated in places that the company understands - westernized countries, leaving a lot of room for growth in emerging markets.  This growth may not be desired by the company due to the instability and tendency to default on debts in emerging countries.  \n\nRevenue streams:\n\nAdvertising: 7.369 B (56%)\n\nCRM: 3.308 B (25.1%)\n\nPR: 1.301 B ( 9.9%)\n\nHealthcare: 1.191 B (9.0%)\n\n## Industry position\n\nThey are the largest public advertising company, which brings pros and cons for any industry.  They will be missing out on a lot of revenue because they will be focusing on larger clients, while letting a lot of smaller ones slip by.  At the same time, they will get the largest contracts in the industry, and as a result they have been able to sustain the highest margins in the industry.\n\nTheir payout ratio (57%) is much higher than other dividend paying advertising agencies.  This has dual implications.  They are not retaining as much earnings, and they are not spending as much on internal investments.  It also means that they have reached a point where growth is organic and the company has a stable capital structure so they can and do pay out earnings that are not needed.\n\n## Company base statistics\n\nMarket Cap: 17.42B\n\nTotal Debt: 5.81B\n\nCash &amp; Liquid assets: 5.6B\n\nEnterprise Value:  20.01B\n\nEquity: 3.084B\n\nShares Outstanding: 217M\n\nEV/Sales: 1.517x\n\nEarnings: 0.975B\n\nROE: 34.4%\n\nEmployees: 64100, 20800 in the US, 27100 in north america, 25800 in europe and 11200 in asia\n\n## Overview/Growth and Developments\n\nGrowth: \n\n* There has been slow revenue growth over the last 15 years.  Recently it has decreased from what it was in 2014-2018.  Based on past data, it is likely to stay stable, and in the long term slowly grow.\n* Earnings have been positive for every quarter 15 years straight.  Growth is better than revenue with the last year being much lower than proceeding years.  This is expected for a large company, where they are slowly finding ways to increase profitability.\n* FCF is constantly at around 10% of the market cap.  It has not been growing, but rather fluctuating around 1.5-2 billion for the past 15 years.  This implies operational stability, but stunted growth.\n\nBased on the growth indicators above, OMC is not a growth stock.  It does have the characteristics of a classic value stock.\n\nMargins:\n\n* Profit margins have been quite low, and show slow growth.  Never negative (See earnings).\n* Gross margin is at around 17%.  It has been around this since 2013.  In 2013, there was a drop from 26% to 17%.  Before 2013 GM was above 22% every year.\n* Ebitda margin follows profit margin with +3%.\n\nNet reinvestment:\n\n* OMC has very little net reinvestment.  The nature of the business does not require much, but it would be something nice to see, especially if they decide to diversify into other industries.  \n\nShare buybacks:\n\n* OMC has consistently bought back shares every year for 15 years.  This and dividends are how they maximize shareholder value.  They have consistently bought back under 15 million shares per year, averaging around 10 million per year.  This is another indicator of their status as a traditional value stock.\n* They stated that they do not plan on any repurchase in the recent future.  This is a very smart move given the economic conditions.  This shows that management is willing to temporarily stunt shareholder value in order to preserve it in the long run.  This isn't something they have to disclose, so it is meaningful that they elected to do so \n\nCost of capital:\n\n* D/E has steady growth, and is at 1.6.  This is not very concerning because the company has capital reserves that can easily cover over 90% of debt, and most debt is long term.\n* Moodys assigned a baa1 credit rating with a stable outlook.  Meaning they have adequate ability to meet debt obligations.  \n* S&amp;P gave them BBB+ credit ratings on commercial paper.\n\nCosts:\n\n* Interest expenses are at 184M\n* Cogs represent almost all expenses\n* No R&amp;D ever - See reinvestment\n\nDebts: \n\n* Lots of LTD, covered by cash\n* 1.25B due 2022 - easily covered\n* 750 M due 2024- \\^\\^\n* Next 5y interest payments are 684.1 Million, manageable\n* Lease payments next 5y - 1.2B, manageable.  \n* Almost negligible pension plan payments.  309m obligation over time, 164m liability\n* 71.9 M earn out, 31.1M payable in 2021 (Where a company has an obligation to pay out earnings to the seller of a business they acquired - usually a condition of lower purchase price)\n* 101.6M foreign tax transition obligations, 11.6M payable in 2021.\n* Recently issued 600M debt, paid off older debt issues with the new issuance.  This is a standard practice.\n* Another issuance of longer term debt provided 600M to general corporate expenses including working capital expenditures, fixed asset expenditures and repayment of debt issues (They used the debt issue to finance general operating activities)\n* The terms of any debt that is issues is not subject to change in the event that credit ratings change\n\nThe capital obligations are manageable, and OCF currently covers and has in the past aptly covered obligations.\n\nAssets\n\n* Most cash coming from OCF.\n* Cash is managed daily internally.  A company treasury receives excess cash from operations and provides cash to operations when there is a need for it.  Great for keeping track of cash and also overseeing operations.\n* Company treasuries invest excess cash they have in short term maturity securities (1-90 day expiry on average)\n* 2.3 out of 5.6 B of cash is held by foreign subsidies.\n* Net debt decreased by 624M (Total debt - total cash)\n\nWACC: 10.6-.8%\n\nLong term growth rate: 3%\n\nLegal: Nothing large worth noting\n\nRecent/expected developments: Nothing worth noting\n\n## Valuation\n\nOMCs DCF Valuation is between $120-140.  Seeing that the company is experiencing slow growth and is not a well known company, this figure may not be an accurate price prediction but is nonetheless a devent valuation providing an adequate margin of safety.\n\n## Opinion\n\nBased on this analysis, I would give OMC a weak buy rating.  They have some value, but their growth is stunted.\n\nNote 1. Their use of EBITDA in their analysis is slightly reckless.  Not realizing interest expenses is not recommended in the industry.  Interest expenses are very real, as are taxes, and so they should be considered by a company when they are performing an internal audit.\n\nSources:\n\nTheir 10-K (This is where you really get to understand the capital and debt structure): [https://www.sec.gov/ix?doc=/Archives/edgar/data/29989/000002998921000004/omc-20201231.htm](https://www.sec.gov/ix?doc=/Archives/edgar/data/29989/000002998921000004/omc-20201231.htm)\n\nMacrotrends (Better than SEC for fast long term data, sometimes inaccurate): https://www.macrotrends.net/stocks/charts/OMC/omnicom-group/stock-price-history\n\nGlassdoor: https://www.glassdoor.ca/Reviews/Omnicom-Reviews-E1734.htm\n\nCIO Linkedin: [https://www.linkedin.com/in/chadi-farhat-2b421a76/](https://www.linkedin.com/in/chadi-farhat-2b421a76/)\n\nYahoo finance: [https://ca.finance.yahoo.com/quote/OMC/profile?p=OMC](https://ca.finance.yahoo.com/quote/OMC/profile?p=OMC)\n\nFinviz: [https://finviz.com/screener.ashx?v=121&amp;f=ind\\_advertisingagencies](https://finviz.com/screener.ashx?v=121&amp;f=ind_advertisingagencies)\n\nHistory: https://www.referenceforbusiness.com/history2/69/Omnicom-Group-Inc.html",
        "subreddit": "StockMarket",
        "title": "$OMC-Due Diligence for a massive advertising firm",
        "url": "https://www.reddit.com/r/StockMarket/comments/odvguf/omcdue_diligence_for_a_massive_advertising_firm/",
        "created": 1625470102.0
    },
    {
        "author": "TheStonksHub",
        "created_utc": 1626621022,
        "id": "omsbcm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " **Overview**\n\nWhat is exactly is Global-E? They are a company that integrates with e-commerce platforms to remove complexity with international transactions and provide localized solutions that improve the online shopping experience. The core of the services revolve around the following (from the S-1):\n\n&amp;#x200B;\n\n&gt;“The vast capabilities of our end-to-end platform include interaction with shoppers in their native languages, market-adjusted pricing, payment options tailored to local market preferences, compliance with local consumer regulations and requirements such as customs duties and taxes, shipping services, after-sales support and returns management. These elements are unified under the Global-e platform to enhance the shopper experience and enable merchants to capture the cross-border opportunity.”\n\n&amp;#x200B;\n\nThey are the “plug and play” of making e-commerce international. Their vast network of APIs allow a customer to simply integrate their platform and seamlessly begin selling across different borders and languages. Here’s what they do.\n\nhttps://preview.redd.it/uwy75emnlzb71.png?width=1446&amp;format=png&amp;auto=webp&amp;s=fe55001708d8baa9ce43a356fc1fd05223c723c6\n\n&amp;#x200B;\n\nCurrently, Global-E supports:\n\n* Local messaging in over 25 languages\n* Purchases in over 100 currencies\n* Accepts over 150 payment methods\n* A multitude of competitively-priced shipping options\n\n&amp;#x200B;\n\n**Business Model**\n\nGlobal-E generates revenues by charging a fee (“service fee”) for the integration of their platform into a merchant’s services. Service fees are highly variable based on transaction volume, destination markets, level of customer service provided, etc, and are generated as a percentage of the Gross Merchandise Value (“GMV”) that flows through the platform. Global-E mandatorily bundles certain components of their integrated platform solutions that they believe are essential for achieving improved sales conversions from international traffic. However, their fulfillment services are offered on an optional basis and merchants can choose to utilize those services or cancel at any time. Think of it as bundling service A and B to have the greatest effect, while offering service C as an add-on component. Service fees make up for approximately 35% of revenue while fulfillment services are currently accounting for roughly 65%.\n\n&amp;#x200B;\n\n**Partnerships &amp; why they use Global-E**\n\nGlobal-E has formed many key technological as well as service partnerships. These third-party e-commerce platforms include: Salesforce Commerce Cloud, Shopify, BigCommerce, Magento Commerce, SAP, WooCommerce, PrestaShop, and others.\n\n&amp;#x200B;\n\n*What they do for merchants?*\n\nSome of the key benefits they provide for merchants are:\n\n* increased sales conversions: converting international traffic\n* offloading complexities: handling local pricing, payment collection, import duties, fraud, etc \n* reduction of risk: reduce legal complexity, manage import duties and taxes, handle compliance\n* enabling growth to new markets: allowing merchants flexibility to expand to cross-border opportunities\n\nAll while emphasizing merchant branding. The customer always faces the digital store-front and never leaves the brand page to check-out.\n\n&amp;#x200B;\n\n*What they do for shoppers?*\n\nGlobal-E’s goal is to offer a frictionless shopping journey, regardless of the origin of the customer. This means:\n\n* Localized languages\n* Re-pricing in local currencies\n* Handling cross-border payments\n* Accurately pre-price import duties and taxes and include them in the final cost of the product\n* Delivery: using an extensive network of over 20 shipping carriers they are able to offer multiple shipping modes at attractive rates.\n* After-sale support and returns\n\nMerchants integrating Global-E into their platform generally experience a significantly higher international traffic conversion rate (often exceeding 60%). The Global-E platform removes many complexities involved with international expansion. They already have more than 400 merchants, from small companies to globally-recognized retailers, on the platform across various diversified verticals.\n\n&amp;#x200B;\n\n**Shopify Deal**\n\nAs mentioned above, one of Global-E most lucrative partners lies with Shopify making them the exclusive third-party and cross-border solution across the large network of Shopify merchants. Shopify knows what kind of business that will bring for Global-E and thus Shopify has bought 7.75 million shares and acquired a **6.5% stake** in the company. As Shopify grows Global-E grows and Shopify knows this, hence the stake in a company that reflects their own revenues by proxy.\n\n&amp;#x200B;\n\n**TAM, &amp; CAGR**\n\nFirst came the transition to domestic e-commerce as well as sourcing and reselling products from China (aka Dropshipping). Next is going to be the transition of global e-commerce and cross-border sales. According to this 225 page **research by GlobeNewsWire**, the global cross-border B2C e-commerce market was 780 billion in 2019 and expected to grow at a CAGR of 27% through 2026 where it will become a 4.82 trillion market.\n\nhttps://preview.redd.it/inyhcsiplzb71.png?width=1680&amp;format=png&amp;auto=webp&amp;s=b34faf468998be77cce529a3ba10fa5bc995acbf\n\n&amp;#x200B;\n\n**Global-E’s Smart Insights**\n\nOne of the company’s strengths lies within sophisticated “Smart Insights” they use to scale their applications. Smart Insights is a “big data” network that uses various metrics such as country, price-point, and shopper behaviors allowing Global-E to provide highly-optimized experience for shoppers. This ends up driving increased conversion rates and revenues for the merchant and a better overall experience for the shopper. The company has noted by integrating big-data into their platform they can experience “economies of scale” as well as “economies of skill” enabling them to optimize merchants’ cross-border sales. These insights are continuously expanding as they collect additional data points along the purchasing journey.\n\n&amp;#x200B;\n\n**Competitive Advantage &amp; Growth Opportunities**\n\nWhat seems to be becoming more of a trend since 2020 and even more so now in 2021 are corporation’s use of big data. I’m not talking about basic user data such as age, gender, location, but more on the lines of vastly large information networks. These networks can utilize things such as time spent on page, scrolls, and clicks all in one massive database. Global-E differentiates themselves through their main data asset (“Smart Insights”) that informs them on certain decisions and is able to optimize how merchants sell their product across different borders. They integrate this data network into a flywheel effect, for example: their current analytics drives more sales to merchants, which then feeds new data back into the system, which then allows for higher optimization and better conversions. They feed into each other back and forth getting smarter with each website visitor and purchase. This aligns perfectly for their products “Net Dollar Retention Rate” of 134% and 172% in 2019 and 2020, respectively.\n\n&amp;#x200B;\n\nGlobal-E attributes much of their growth to being a first mover (and doing it right) in the cross-border e-commerce space. Their success has been accelerated by several key factors, such as:\n\n* Accelerated shift towards e-commerce outpacing traditional retail\n* Cross-border e-commerce growing faster than domestic e-commerce\n* Their merchant’s strategic focus on D2C sales, maintaining relationship with shoppers globally\n* The complexity and limitations of leaving the merchant responsible for implementing what Global-E offers. This doesn’t come down to just a cost, but also time-intensive as well as being difficult to maintain and scale\n* Covid-19 tailwinds\n\n&amp;#x200B;\n\nAs a result of the above and other market factors, the cross-borders e-commerce market is expected to continue the surge in growth. I previously mentioned the forecast in TAM however, Forrester, a research company, also expects the cross-border e-commerce markets to reach $736 billion by 2023.\n\nGlobal-E has several opportunities to expand on existing channels and capture new markets. This can be done with:\n\n* Growth through existing portfolio of merchants and strengthening relationships\n* Acquiring new merchants in existing geographies\n* Expanding in new geographies that they don’t have exposure to\n* Continue to expand and innovate their platform\n* Continue to develop strategic partnerships (with key brands and players)\n\n&amp;#x200B;\n\n**Risks**\n\nMany of Global-E’s risks fall under the category of general business risks. Some of these include: retaining old merchants and attracting new ones, failing to enhance the platform as well as successfully competing against new and existing competition, failing to manage growth, pricing pressures from competition, and being highly dependent on cross-border regulations, sales, and operations.\n\n&amp;#x200B;\n\n**Revenues, Scale, &amp; Profitability**\n\nIn FY 2020 Global-E helped process 4.6 million orders for their merchants generating $136.4 million. Their Gross Merchandise Value (GMV) also grew to 774 million for the same period. Other impressive metrics were their net dollar retention rate and gross profit as % of revenue both of which continue to climb at 172% and 31.9%, respectively. Stellar!\n\nhttps://preview.redd.it/d0znsk3rlzb71.png?width=1074&amp;format=png&amp;auto=webp&amp;s=86a85e8ca385840bc628dc9c4e571920db0da764\n\nSome key growth metrics the company has seen in 2019 and 2020.\n\nhttps://preview.redd.it/mieawv2slzb71.png?width=1184&amp;format=png&amp;auto=webp&amp;s=63878409148360ba2d9cf60dc271726d3fbe84e0\n\n&amp;#x200B;\n\nAlthough the company has recently turned a profit while growing top-line revenue and GMV at a high pace. The company suggested that short-term profitability might be sacrificed due to the expansions they are making to cover larger markets. As noted from the S-1:\n\n&amp;#x200B;\n\n&gt;“We expect our operating expenses to significantly increase over the next several years as we hire additional personnel, expand into new geographies, expand our partnerships, operations, and infrastructure, continue to enhance our platform, develop and expand its features, integrations and capabilities, expand and improve our service offering and increase our spending on sales and marketing. We intend to continue to build and enhance our platform through internal research and development and we may also selectively pursue acquisitions.”\n\n&amp;#x200B;\n\nLet’s take a quick peak at their consolidated statement of operations. Note the revenue growth and total operating expenses that *decreas*e, as a percentage of total revenue, as revenues increase (almost doubles YoY).\n\nhttps://preview.redd.it/w4hi5pdtlzb71.png?width=1656&amp;format=png&amp;auto=webp&amp;s=38673b72baccef59379b9448939f4a7bb89fbfbf\n\n**Valuation**\n\nLooking at GLBE’s valuation it is clear that you pay a premium when owning this company.\n\n&amp;#x200B;\n\n*The Good*\n\nGLBE is growing revenue at 134% YoY.\n\nGross margins are improving while the company continues to scale.\n\nMany tech and services partnerships they can piggy back on.\n\n&amp;#x200B;\n\n*The Bad*\n\nConsistent profitability could be years away as the company is investing heavily into their own expansion of current and new markets.\n\nGLBE is currently trading at roughly 50x price to sales and 260 forward P/E.\n\n&amp;#x200B;\n\n*Up for Debate*\n\nGlobal-E has almost no long-term debt, but current liabilities are stacking up while the company is not generating much FCF. I wouldn’t expect them to be generating this much FCF this early in the game after their IPO.\n\nLock-up expiration on August 11, 2021.\n\n&amp;#x200B;\n\n**Final Thoughts**\n\nIn my opinion Global-E is top of the class when it comes to their business. They are growing extremely fast while improving margins and this is the premium you would pay versus investing in a “stable” company generating tons of FCF, but not much growth. Due to the nature of being a high-growth stock there will naturally be more volatility around the trade. While it’s currently trading at 50x price/sales I am more likely to shy away from entering a new position. We could see this stock swing to 40x p/s and potentially enter on the dips.\n\nThis is somewhat of a chicken or the egg situation because there might not be any dips to buy with this kind of growth. For example, at current growth rates (100-135% YoY) if stock price is maintained it would only be trading at less than half it’s price/sales valuation only one year from now. This is definitely a stock to monitor closely if you are wanting to find the right entry point for a long-term hold.\n\n&amp;#x200B;\n\n**TLDR;**\n\n1. Global-E is an “enabler” that allows e-commerce and digital stores to seamlessly integrate international transactions. They deal with tasks from translations, currency re-pricing, international shipping &amp; returns, compliance &amp; tax regulations, etc.\n2. GLBE integrates their proprietary “Smart Insights” application that analyses customer shopping and transaction data to continuously improve on sales conversions. The feedback loop is always learning as it collects more and more data along each customer’s purchase journey.\n3. GLBE is trading at a rich valuation given their total revenue was $136 million in 2020. However, they are growing top-line revenues and Gross Merchandise Value (GMV) over 130% Y.o.Y. Shopify holds a 6.5% stake in Global-E as GLBE facilitates a large amount of transactions on the Shopify network. As Shopify grows, GLBE grows.\n4. GLBE is growing through many tailwinds such as those from covid lockdowns and accelerated shift toward e-commerce outpacing traditional retail. They’ve got an opportunity to expand into more international regions, strengthen relationships with existing merchants, while continuing to expand and improve their platform.",
        "subreddit": "smallstreetbets",
        "title": "The Weekly DD - Global-E Online (GLBE): The Uncut Diamond",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/omsbcm/the_weekly_dd_globale_online_glbe_the_uncut/",
        "created": 1626649822.0
    },
    {
        "author": "hmchugh98",
        "created_utc": 1626113602,
        "id": "oiwyaz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nBelow is a portion of the benzinga article from the interview with AVPT (Avepoint’s CEO)\n\nMicrosoft Partnership: AvePoint is the leading data management solutions provider for the Microsoft Corporation (NASDAQ:MSFT) Cloud.\n\nThe company has a 20-year relationship with Microsoft, Jiang said. For every $1 Microsoft earns, there exists $9 of partner opportunity. So rather than competing with Microsoft, AvePoint is competing within the Microsoft ecosystem, he said.\n\nOutside of the current partnership with Microsoft, AvePoint provides services for salesforce.com inc (NYSE:CRM) and Alphabet Inc's (NASDAQ:GOOG) (NASDAQ:GOOGL) Google Docs. The company is also actively looking at working with Amazon.com, Inc.'s (NASDAQ:AMZN) AWS, Jiang said.\n\nEarnings And Analyst Coverage: AvePoint reported first-quarter financial results on May 20. The company announced total revenue of $38.8 million, up 19% year-over-year and SaaS revenue of $18.3 million, up 78% year-over-year.\n\nAvePoint also raised its fiscal year guidance and announced that the company remains debt-free.\n\nAvePoint anticipates announcing its next quarterly financial results in early August. The company is expecting analyst coverage from numerous firms to be published within the next week, Jiang told Benzinga",
        "subreddit": "wallstreetbets",
        "title": "This company is being shorted, and the COMPANY IS DEBT FREE AND PROFITABLE. ONLY $10 right now. UNDERVALUED STOCK BY AT LEAST $20",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oiwyaz/this_company_is_being_shorted_and_the_company_is/",
        "created": 1626142402.0
    },
    {
        "author": "Dwbrown705",
        "created_utc": 1626059528,
        "id": "oiit1q",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There’s just one thing that I need to point out because I don’t think it is talked about often enough and it’s the fact that the same way hedge funds tried to short GameStop and AMC to death the retail investor has bid them back to life. It’s truly a beautiful thing\n\nThe boost in their balance sheet through the increase in share price has given GameStop the leverage to expedite their transformation into e-commerce and the digital era. They’ve got amazonesque warehouses now, NFTs in the works, and their subreddit is made of Lego! AMC was able to pay off a huge chunk of debt and is now in a position to acquire the ArcLight and Pacific Theaters venues. Not to mention, a new and growing base of extremely loyal fans. I like the stocks and it all started right here with you gambling, degenerative, retards. \n\n“Sir this is a wendys” “sir this is a casino” yeah yeah but this is also my home. I made my first yolo here when Disney+ was announced. Doubled my money in 24 hours after they broke 1 million subscribers on release. Then I turned around and suffered my first IV crush playing Salesforce earnings and lost it all. Anyone doing the math will realize I’m not a day one but I’m also not 1 of the 8 million people that joined after the GameStop rally this year which leads me to my next point.\n\n There are a lot of paper handed shills in here that need to quit being a little bitch. Everytime I share my excitement for the future some hedge fund op asks me how heavy my bag is. What you should be asking is how is it not a regulatory conflict of interest for a market maker who has the ability to see supply and demand in real time to also act as a hedge fund? But to answer the question I’ve got 2 bags hanging under my mickey and you’re welcome to be Glittering Goldie to my left one or Brigitta MacBridge to my right. Either way you can tell your manager there’s at least 4.1 million individual investors rocketing to the moon to find out if he really does shit gold",
        "subreddit": "wallstreetbets",
        "title": "Let me further clear up the air on GME and AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oiit1q/let_me_further_clear_up_the_air_on_gme_and_amc/",
        "created": 1626088328.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1627006847,
        "id": "opsraa",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | CSX Corporation | **CSX** | 3.48%  \n2. **Health Care** | Danaher Corporation | **DHR** | 3.28%  \n3. **Information Technology** | [salesforce.com](http://salesforce.com/), inc. | **CRM** | 2.57%  \n4. **Communication Services** | Facebook, Inc. Common Stock | **FB** | 1.43%  \n5. **Consumer Discretionary** | Domino's Pizza, Inc. | **DPZ** | 14.55%  \n6. **Utilities** | FirstEnergy Corp. | **FE** | 4.29%  \n7. **Financials** | Marsh &amp; McLennan Companies, Inc. | **MMC** | 2.47%  \n8. **Materials** | Albemarle Corporation | **ALB** | 1.34%  \n9.  **Real Estate** | CBRE Group Inc | **CBRE** | 0.85%  \n10. **Consumer Staples** | Estee Lauder Companies Inc | **EL** | 1.08%  \n11. **Energy** | No Winners | |  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Southwest Airlines Co** | LUV | **-3.48%**  \n2. Health Care | **Universal Health Services, Inc. Class B** |  UHS | **-1.91%**  \n3. Information Technology | **Texas Instruments Incorporated** | TXN | **-5.32%**  \n4.  Communication Services | **Omnicom Group Inc.** | OMC | **-2.28%**  \n5. Consumer Discretionary | **Las Vegas Sands Corp.** | LVS | **-4.51%**  \n6. Utilities | **AES Corp** | AES | **-1.40%**  \n7. Financials | **People's United Financial, Inc.** | PBCT | **-3.35%**  \n8. Materials | **Celanese Corporation** | CE | **-1.71%**  \n9. Real Estate | **Crown Castle International Corp** | CCI | **-4.47%**  \n10. Consumer Staples | **SYSCO Corporation** | SYY | **-1.79%**  \n11. Energy | **Cabot Oil &amp; Gas Corporation** | COG | **-2.91%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 7/22/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/opsraa/sp500_winners_and_losers_7222021/",
        "created": 1627035647.0
    },
    {
        "author": "Dwbrown705",
        "created_utc": 1626388613,
        "id": "ol3obz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There’s just one thing that I need to point out because I don’t think it is talked about often enough and it’s the fact that in the same way hedge funds plotted to short GameStop and AMC to death the retail investor has bid them back to life. It’s truly a beautiful thing\n\nThe boost in their balance sheet through the increase in share price has given GameStop the leverage to expedite their transformation into e-commerce and the digital era. They’ve got amazonesque warehouses now, and blockchain technology. AMC was able to pay off a huge chunk of debt and is now in a position to  to acquire the ArcLight and Pacific Theaters venues. Not to mention, a growing base of extremely loyal fans. Not only do I like the stocks, but I like the businesses too and it all started right here with you gambling, degenerative, retards. \n\n“Sir this is a wendys” “sir this is a casino” yeah but this is also my home. I made my first yolo here when Disney+ was announced. Doubled my money in 24 hours after they broke 1 million subscribers on release. Then I turned around and suffered my first IV crush playing Salesforce earnings and lost it all. Anyone doing the math will realize I’m not a day one but I’m also not 1 of the 8 million people that joined after the GameStop rally this year which leads me to my next point.\n\nThere are a lot of new paper handed shills in here that need to quit being a little bitch. Everytime I try to share my excitement for the future some hedge fund op asks me how heavy my bags are. What you should be asking is how is it not a regulatory conflict of interest for a market maker who has the ability to see supply and demand in real time to also act as a hedge fund? But to answer the question I’ve got 2 bags hanging under my mickey and you’re welcome to be Glittering Goldie to my left one or Brigitta MacBridge to my right. Either way, you can tell your manager there’s at least 4.1 million individual investors rocketing to the moon to find out if he really does shit gold \n\nHere’s my advice, instead of being a sad, envious, little shit. Get yourself a nice box of tendies to cheer yourself up. I hear they’re on sale",
        "subreddit": "wallstreetbets",
        "title": "Let me to further clear the air on GME and AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ol3obz/let_me_to_further_clear_the_air_on_gme_and_amc/",
        "created": 1626417413.0
    },
    {
        "author": "stilgre",
        "created_utc": 1627070225,
        "id": "oqa63j",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Not a ton of money, so I'm not super concerned, but I'm confused about what happened here and want to know how I can be on the lookout for this in the future.\n\nI had 20 shares of $WORK, worth $535.80 at the time of the merger. For the 20 shares of $WORK, I got 1 share of $CRM (worth \\~$241 at the time of merger) + $127.17 cash. So \\~$368 for my $535 worth of $WORK. So what happened to the \\~$167 difference?\n\nWhat should I have been on the lookout for to avoid this kind of loss? (see image linked). Did everyone who had money invested in $WORK just poof and lose \\~30% of their investment?\n\n[https://imgur.com/a/bKSNgfX](https://imgur.com/a/bKSNgfX)",
        "subreddit": "StockMarket",
        "title": "Lost money on $WORK + $CRM merger, and confused why this happened.",
        "url": "https://www.reddit.com/r/StockMarket/comments/oqa63j/lost_money_on_work_crm_merger_and_confused_why/",
        "created": 1627099025.0
    },
    {
        "author": "ThinkLongterm",
        "created_utc": 1626884113,
        "id": "oot64m",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Salesforce closes $27.7 billion acquisition of Slack",
        "url": "https://finance.yahoo.com/news/salesforce-completes-slack-acquisition-132247106.html",
        "created": 1626912913.0
    },
    {
        "author": "bigmucusplug",
        "created_utc": 1627235689,
        "id": "orgcqk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I held some WORK (12) through the merger. I see them pay me the cash amount per share of WORK held. \n\nI do not see the converted partial share that I am suppose to get. Any idea when that is suppose to post?",
        "subreddit": "stocks",
        "title": "When do I receive my share of CRM?",
        "url": "https://www.reddit.com/r/stocks/comments/orgcqk/when_do_i_receive_my_share_of_crm/",
        "created": 1627264489.0
    },
    {
        "author": "jmschlmrs",
        "created_utc": 1627503380,
        "id": "oti0z5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Had shares of (US-listed) Slack (WORK) in my Canadian margin account. Slack was acquired by (US-listed) Salesforce (CRM) in a cash and stock deal: \"for one share of Slack, Slack shareholders will receive $26.79 a share and .0776 shares of Salesforce.\"\n\nSeems like the deal has closed as I now have some USD and some CRM shares in my margin account instead of WORK shares.  \n\n\nMy question is, will I need to pay capital gains tax to the CRA on one or both of the cash or stock portions of the deal? I assume I will on the cash portion, but am unsure if it is also considered a taxable event when the WORK shares are exchanged for CRM shares.  \n\n\nThanks!",
        "subreddit": "CanadianInvestor",
        "title": "Tax on stock-based acquisition? (CRM, WORK)",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/oti0z5/tax_on_stockbased_acquisition_crm_work/",
        "created": 1627532180.0
    },
    {
        "author": "SavannahSmiles_",
        "created_utc": 1625266779,
        "id": "oclp84",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " [Amazon grants 61,000 shares of stock to incoming CEO Andy Jassy (cnbc.com)](https://www.cnbc.com/2021/07/02/amazon-grants-61000-shares-of-stock-to-incoming-ceo-andy-jassy.html) \n\n**PUBLISHED FRI, JUL 2 2021 4:53 PM EDT** \n\n[**Jordan Novet**](https://www.cnbc.com/jordan-novet/)[**@JORDANNOVET**](https://twitter.com/jordannovet) \n\n**KEY POINTS**\n\n* **Andy Jassy gets a stock award worth $214 million at today’s price as he takes over as Amazon CEO.**\n* **The award will vest over ten years.**\n* **Jassy built up the Amazon Web Services cloud business that leads the market.**\n\n**In this article**\n\n* [**AMZN -1.48** **(-0.04%)**](https://www.cnbc.com/quotes/AMZN)\n\n[Amazon](https://www.cnbc.com/quotes/AMZN) said in a [filing](https://www.sec.gov/ix?doc=/Archives/edgar/data/1018724/000101872421000016/amzn-20210628.htm) on Friday that it will grant Andy Jassy 61,000 shares of stock on Monday, when he replaces Jeff Bezos as the online retailer’s second CEO. The shares will vest over a period of ten years.\n\nThe grant represents a financial acknowledgment of a high-priority leadership change for one of the world’s top technology companies.\n\nBezos founded Amazon in 1994 and is today the world’s richest person, with a net worth of nearly $200 billion, according to [Bloomberg](https://www.bloomberg.com/billionaires/). Now he is handing over the entire company to a trusted executive who led Amazon Web Services since its inception, helping Amazon expand beyond commerce and making the company more profitable.\n\nAfter serving as Bezos’ shadow, Jassy led the company’s push into technology that companies could use to run computing workloads and store data in Amazon’s data centers, with the first services arriving in 2006. Now the company leads the market, with Microsoft, Google and other companies trying to catch up.\n\nThe additional shares are worth $214 million at Amazon’s Friday closing price of $3.510.98 per share. In addition to the award, Jassy owns 0.02% of Amazon stock, worth more than $300 million, according to FactSet.\n\nJassy’s successor as AWS chief is [Adam Selipsky](https://www.cnbc.com/2021/03/27/how-adam-selipsky-could-make-aws-even-bigger.html), who rejoined Amazon from Salesforce earlier this year.",
        "subreddit": "StockMarket",
        "title": "Amazon grants 61,000 shares of stock to incoming CEO Andy Jassy",
        "url": "https://www.reddit.com/r/StockMarket/comments/oclp84/amazon_grants_61000_shares_of_stock_to_incoming/",
        "created": 1625295579.0
    },
    {
        "author": "Empty_Performance308",
        "created_utc": 1625597981,
        "id": "of1kmn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi guys!! Former wall street analyst here... I'm sharing what I've learned from 10 years of experience. \n\n(I wrote a [book](https://henrychien.com/investing-book/)!) Here's an excerpt on business models - which is a HUGE part of investing and picking stocks. It's a way to simplify a business so you can get a sense of how the big the company can get (i.e. its growth) and how much cash flows it can create  (i.e. its profits). \n\nThen you have an idea (i.e. your thesis) and can estimate where the price of a stock can go. \n\nI'll use $DMTK, which is a popular stock on Fintwit (and also very limited research), of how you research the company to learn its business model, to then estimate its finances. \n\n## What is a “business model”?\n\nThis is a way to simplify how business works into a “model”. With a model you can estimate the change of a company’s growth and cash flows to reach a value of a stock.\n\n***You start by describing the basic business model (here with DermTech):***\n\n* **A business provides a product or a service.** DermTech ($DMTK) provides a test for dermatologists to test people for melanoma. Each test costs a certain $ amount which is charged to either patients or insurers. \n* **This provides some value to its customers.** The test is an alternative to biopsies which are painful and leave scars. It is also more accurate which means less biopsies, which also means less overall costs for insurers. \n* **It operates in a “market” which is its current or potential customers.** $DMTK’s target market is U.S. dermatologists that test and monitor their patients for melanoma. \n* **Management has a vision for the business.** CEO John Dobak wants to build DermTech into a leading platform of genetic testing for dermatology practices. \n\n***And then the business strategy\\*:***\n\n* **The business has a strategy to grow or “scale” to a certain level.** Management plans to expand sales to the majority of testing dermatology clinicians and expand reimbursement to most commercial insurance plans.\n* **Business has a future potential source of profits or “margin.”** The cost of the facility and equipment is largely fixed so higher prices should support gross margin. Sales and marketing should also grow slower than revenues to create operating margin and profits over time. \n\n*\\*This fits directly into the valuation framework of growth and cash flows.*\n\nOnce you do this, you build a “sense” of a company and what is the critical factor that will drive earnings and the value of the company. This is super important to build an investment thesis.\n\n* **Simplify a company into a business model to estimate change.** \n\n## Where to find information to describe a business model?\n\nUse these key sources of information to use when looking at a company. \n\n**SEC Filings** \\- The 10K and / or the S1 prospectus has the most detailed information on the business model, its financials and the market it operates in. 10Qs provide quarterly updates.These are all accessible on SEC [EDGAR](https://www.sec.gov/edgar.shtml). \n\nPay attention to these sections in the 10K and S1 for the most valuable information.\n\n* ***“Business”*** and ***“Management Discussion and Analysis”*** sections typically describe the businesses’ products or services, the value to customers, the market it operates in. The discussion usually describes the company’s growth strategy.\n* ***“Risk factors''*** section is where you get a sense of the risk of the business. This is also a good area to look for the critical factor for the value of the business. \n\n**Investor presentation** \\- Use this to get more information on the market and the business model. Here is where management will often highlight the growth strategy.\n\nThis is helpful for building the upside of an investment thesis (expected growth and earnings).\n\n* **Videos of management or Q&amp;A** \\- Use these videos to get a sense of the business model and growth strategy from management. Here they will usually outline the company’s vision, the growth strategy and sometimes targets for scale and margin. \n\n**Transcript of earnings calls (Q&amp;A)** \\- Look at the prepared commentary for a business update (focus on the critical factors) and then search the Q&amp;A for additional details to help understand the financial model or change in the business. \n\n**Earnings releases** \\-  Look at these for the metrics for business updates. These are posted on investor relations pages and in 8K filings on EDGAR. Pay attention to guidance. \n\n* *Later, you will learn how to quickly analyze these releases.*  \n\n&amp;#x200B;\n\n***Here’s a sample business model overview from $DMTK***\n\n$DMTK provides a non-invasive diagnostic for melanoma that uses genomic analysis (pigmented lesion assay). There are three sources of value:\n\n* The value to customers is fewer biopsies to diagnose melanoma (requires 2.5 to 1 vs. 25 to 1 for biopsies)\n* Clinical value also lowers probability of missing melanoma (&lt;1%) and higher predictive value (3-4% from 18.7%)\n* Economic value to payers from lower cost to $760 vs. $947 for visual assessment, fewer biopsies and earlier detection of melanoma.\n\nManagement’s vision is to incorporate genomic testing into dermatology with this platform.\n\n* The “market” for this product is the 4m surgical biopsies performed every year for early stage melanoma (which translates to about 207K / year).\n* The plan to expand commercial insurance reimbursement coverage to increase sales price to $760 per test, which will raise gross margins to 60-70%. \n* The growth strategy is to target the 5,000 clinicians that perform the majority of biopsies and plan to increase their salesforce to 50 people. \n\nThe critical factor (and risk) is getting commercial reimbursement coverage in order to raise the price point. Another risk is the ability to generate profits and scale its salesforce.\n\n&amp;#x200B;\n\nWith those assumptions you can estimate the future finances of the company, which you can then use to estimate the future price of the stock! (That will require another post!).\n\nFeel free to DM me (or follow me on twitter - henrychien4 ). And here's the [book link](https://henrychien.com/investing-book/) if you are interested. Cheers and happy investing!!!",
        "subreddit": "StockMarket",
        "title": "How to study a company and its \"business model\" and where to get information ($DMTK example)",
        "url": "https://www.reddit.com/r/StockMarket/comments/of1kmn/how_to_study_a_company_and_its_business_model_and/",
        "created": 1625626781.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1626699910,
        "id": "ondnmf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/ajazggkf46c71.png?width=716&amp;format=png&amp;auto=webp&amp;s=ed3b957e5a079a5be76fe3bb7334c145f7a0d91f\n\nSome of you may know me from my Educational and Due Diligence posts at r/DoctorStock. Here is this week's brief DD.\n\n**Introduction**\n\n\tDocuSign (DOCU) is an electronic signature agreement platform. DOCU makes money by charging those who create contracts.\n\nMarket Cap (MKT Cap)\n\n* 2018- $5.53B\n* 2019- $13.35B\n* 2020- $41.29B\n* Current- $54.81B\n\n\\*MKT Cap has increased by 891% in three years\n\nEPS (Dilution)\n\n* 2018- ($8.15)\n* 2019- $3.91\n* 2020- ($1.18)\n* Current- ($1.09)\n\n\\*EPS has increased by 87% in three years\n\n**Financial Statement Highlights (in thousands)**\n\nTotal Revenue (TR)\n\n* 2018- $0.65B\n* 2019- $0.90B\n* 2020- $1.30B\n* Current- $1.63B\n\n\\*TR has increased by 150% in three years\n\nPrice to Earnings Ratio (PE)\n\n* 2019- 16.93\n* 2020- 0.00\n* Current- 0.00\n\n\\*PE Ratio has decreased by 100% in two years\n\nPrice to Sales Ratio (PS)\n\n* 2019- 12.12\n* 2020- 28.57\n* Current- 32.68\n\n\\*PS Ratio has increased by 169% in two years\n\nPrice to Book Ratio (PB)\n\n* 2019- 20.84\n* 2020- 88.55\n* Current- 225.80\n\n\\*PB Ratio has increased by 984% in two years\n\nGross Margin\n\n* 2018- 73.7%\n* 2019- 74.6%\n* 2020- 74.6%\n* Current- 75.7%\n\n\\*Gross Margin has increased by 2% in three years\n\n**Balance Sheet Highlights (in thousands)**\n\nTotal Liabilities\n\n* 2018- 0.91B\n* 2019- 1.22B\n* 2020- 1.63B\n* Current- 2.05B\n\n\\*Total Liabilities have increased by 125% in three years\n\nLong Term Debt (LTD)\n\n* 2018- 0.43B\n* 2019- 0.46B\n* 2020- 0.47B\n* Current- 0.74B\n\n\\*LTD has increased by 72% in three years\n\nDebt to Equity Ratio (DE)\n\n* 2018- 0.53\n* 2019- 0.81\n* 2020- 1.14\n* Current- 3.05\n\n\\*DE Ratio has increased by 475% in three years\n\n**Customers**\n\n* Apple\n* Visa\n* Citgo\n* Samsung\n* Facebook\n* Deloitte\n* T-Mobile\n* BMW Group\n* Unilever\n* AstraZeneca\n* Santander\n* Salesforce\n\n**Competitors**\n\n* Adobe Sign\n* signNow\n* GetAccept\n* HelloSign\n* DocHub\n\n**Stock Price History**\n\n* 2018- $40\n* 2019- $75\n* 2020- $245\n* Current- $280\n\n\\*Stock price has increased by 600% in three years\n\n**Conclusion**\n\n\tDocuSign is leading us into the future with its electronic capabilities. Say goodbye to formal paper agreements. DocuSign makes it easy to sign agreements. No more going into the office to sign a contract. No more losing your documents. All the documents are stored in the cloud making your agreements easy to find. Some of the top-performing fortune 500 companies use DocuSign. If they back them, why shouldn't you? COVID-19 has had a positive effect on DOCU. DOCU has been able to capitalize on all the people working from home during the pandemic. This can be proven by the massive increase in market cap. This can also be proven by the PE, PS, and PB ratios. I believe those who have transitioned to DOCU during the pandemic have no reason to switch back to paper. I believe we're going to see more companies make the switch from paper to the cloud whether or not they choose DocuSign. The digital era requires digital solutions. I believe DOCU is a good long-term investment.\n\n&amp;#x200B;\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "investing_discussion",
        "title": "[DD] DocuSign (DOCU)",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ondnmf/dd_docusign_docu/",
        "created": 1626728710.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1626944667,
        "id": "opa4oj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "Deal: Salesforce Completes $28B Slack Purchase",
        "url": "https://www.thetechee.com/2021/07/deal-salesforce-completes-28b-slack.html",
        "created": 1626973467.0
    },
    {
        "author": "Professional_Tart691",
        "created_utc": 1626944231,
        "id": "opa1l3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "CRM/WORK Merger Question for Shareholders",
        "url": "https://www.reddit.com/r/stocks/comments/opa1l3/crmwork_merger_question_for_shareholders/",
        "created": 1626973031.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1626944546,
        "id": "opa3wd",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Deal: Salesforce Completes $28B Slack Purchase",
        "url": "https://www.thetechee.com/2021/07/deal-salesforce-completes-28b-slack.html",
        "created": 1626973346.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1626944534,
        "id": "opa3t3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Deal: Salesforce Completes $28B Slack Purchase",
        "url": "https://www.thetechee.com/2021/07/deal-salesforce-completes-28b-slack.html",
        "created": 1626973334.0
    },
    {
        "author": "HumbleCoast",
        "created_utc": 1626881750,
        "id": "ooscwz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Salesforce shares?",
        "url": "https://www.reddit.com/r/stocks/comments/ooscwz/salesforce_shares/",
        "created": 1626910550.0
    },
    {
        "author": "leviosuh_dude",
        "created_utc": 1626925032,
        "id": "op5v7l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Apologies for this newbie question, but I bought some Work stock when it went public and they've always showed up in Robinhood. I know the Salesforce deal closed recently so should I expect to see Salesforce stocks in my account? I don't see any history of it leaving my account but I can see where I bought it.\n\nThanks!",
        "subreddit": "stocks",
        "title": "Missing WORK stock?",
        "url": "https://www.reddit.com/r/stocks/comments/op5v7l/missing_work_stock/",
        "created": 1626953832.0
    }
]