[
    {
        "author": "sslavi",
        "created_utc": 1629202318,
        "id": "p62ixo",
        "num_comments": 109,
        "num_crossposts": 0,
        "selftext": "As many of you probably know, TipRanks, Seeking Alpha and similar websites actively share the latest stock recommendations from more or less known analysts. The general impression upon reading them is that we are being given a rather professionally elaborated set of info.\n\nBut how do the recommended stock perform months later? Here I am analyzing the performance of stocks suggested in the articles published by TipRanks over the last year. I have chosen TipRanks because they have a very active mailing list with heaps of info. If I find some spare time, I might do the same type of check on other similar websites.\n\nSo I have randomly selected a group of articles over the past year or so, and have checked the performance of each of recommended stocks.\n\nThe last line under each article shows the performance of S&amp;P 500 in the given time period (which spans between 4 to 9 months).\n\nHere we go:\n\n[https://www.tipranks.com/news/article/jpmorgan-2-stocks-for-stellar-long-term-gains/](https://www.tipranks.com/news/article/jpmorgan-2-stocks-for-stellar-long-term-gains/)\n\n4.1 months later, the performance of recommended stocks is:  \n*CTMX: -36%*  \n*KALA: -62%*  \n***S&amp;P 500: +7%***\n\n[https://www.tipranks.com/news/article/analysts-say-these-3-stocks-are-their-top-picks-for-2021-4/](https://www.tipranks.com/news/article/analysts-say-these-3-stocks-are-their-top-picks-for-2021-4/)\n\n4.3 months later, the performance of recommended stocks is:  \n*ASND: -5%*  \n*ALVR: -21%*  \n*WDC: -14%*  \n***S&amp;P 500: +8%***\n\n[https://www.tipranks.com/news/article/2-strong-buy-biotech-stocks-with-major-catalysts-approaching/](https://www.tipranks.com/news/article/2-strong-buy-biotech-stocks-with-major-catalysts-approaching/)\n\n4.7 months later:  \n*ARDX: -78%*  \n*HRTX: -30%*  \n***S&amp;P 500: +11%***\n\n[https://www.tipranks.com/news/article/these-3-strong-buy-stocks-are-top-picks-for-2021-say-analysts/](https://www.tipranks.com/news/article/these-3-strong-buy-stocks-are-top-picks-for-2021-say-analysts/)\n\n7 months later:  \n*TALO: -10%*  \n*TWLO: -22%*  \n*SIBN: -32%*  \n***S&amp;P 500: +15%***\n\n[https://www.tipranks.com/news/article/3-strong-buy-stocks-insiders-are-snapping-up-2/](https://www.tipranks.com/news/article/3-strong-buy-stocks-insiders-are-snapping-up-2/)\n\n7.8 months later:  \n*VST: -5%*  \n*GDYN: +85%*  \n*ARVN: +4%*  \n***S&amp;P 500: +19%***\n\n[https://www.tipranks.com/news/article/billionaire-ray-dalio-picks-up-these-3-strong-buy-stocks/](https://www.tipranks.com/news/article/billionaire-ray-dalio-picks-up-these-3-strong-buy-stocks/)\n\n8.3 months later:  \n*BAX: -5%*  \n*CVS: +19%*  \n*DAR: +31%*  \n***S&amp;P 500: +22%***\n\n[https://www.tipranks.com/news/article/3-monster-growth-stocks-that-still-have-room-to-run-2/](https://www.tipranks.com/news/article/3-monster-growth-stocks-that-still-have-room-to-run-2/)\n\n8.8 months later:  \n*BAND: -27 %*  \n*W: +15%*  \n*SDGR: -17%*  \n***S&amp;P 500: +22%***\n\n&amp;#x200B;\n\nThe results of the above analysis look quite miserable:\n\n* Only 2 of stocks recommended in the articles have outperformed the marked.\n* Only 5 out of 19 suggested stocks have realized a gain to date, the rest of them are at loss.\n* 11 out of 19 suggested stocks have lost more than 10% of the initial value. \n* 8 out of 19 suggested stocks have lost more than 20% of the initial value.\n\nThis leaves me quite puzzled about the usefulness of freely-available info from stock analysts.\n\nBut I would like to hear your opinion as well - did you find their tips useful and follow their suggestions, and did you realize gains by doing so?\n\nCheers",
        "subreddit": "StockMarket",
        "title": "Are the tips from stock-market websites really useful?",
        "url": "https://www.reddit.com/r/StockMarket/comments/p62ixo/are_the_tips_from_stockmarket_websites_really/",
        "created": 1629231118.0
    },
    {
        "author": "devilmaskrascal",
        "created_utc": 1629340427,
        "id": "p761je",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "In spite of the \"SPACs are dead\" zeitgeist, thanks to the SPAC frenzy during the bubble SPAC teams in general undoubtedly have more high quality sponsors now than ever before. Bad price action, pessimistic sentiment and the arb trap are what they are, but more legit unicorn list companies have DA'd since the crash than the entire history of SPACs prior to that, and quality companies continue to DA at competitive multiples to competition. Many of these SPAC teams have significant reputations on the line and are expected to deliver high quality long term investments, regardless of short term trading action.\n\nSince I am predominantly a pre-DA warrants investor, when vetting SPAC teams I like to look for: \n\na.) past successful SPAC experience; \n\nb.) high level of specialized experience in the sector of focus (for example, FTPA/FTVI/HERA/SCLE's Betsy Cohen and ACQR's Steven McLaughlin are specialized experts at fintech and know the field like the back of their hand). This is one of the highest indicators of long-term success.\n\nc.) past C-suite experience at high level companies. Below is a list of Fortune 200 companies' former C-Suite execs, Chairmen of the Board and/or Presidents currently on or advising SPAC teams. *I included Directors for Fortune 15 only, but many SPACs have Fortune 200 Directors. I did not include exec VPs, division heads, vice chairs or non-US subsidiary execs, of which there are also many more.*\n\n**1. Walmart** \n\n* EQD (Bill Simon, Former CEO/President/COO, Walmart US)\n* PLMI (Kevin Turner, Fmr CEO/COO, Sam's Club)\n* ENPC (Gisel Ruiz, Fmr COO, Walmart and Sam's Club)\n* BSKY (Michael Smith, Fmr COO Walmart.com)\n* TPBA (Kerry Cooper, Fmr CMO, Walmart.com)\n* Directors: DGNU, MSDA, CPAR\n\n**3. Apple** \n\n* LCAA (John Sculley, Fmr CEO)\n* Directors: ZNTE\n\n**5. UnitedHealth Group** \n\n* SNRH (Richard Burke, Founder/Fmr CEO)\n\n**6. Berkshire Hathaway** \n\n* Directors: CPAR\n\n**9. Alphabet/Google** \n\n* XPOA (Eric Schmidt, Fmr CEO and Exec Chairman)\n* Directors: CPAR\n\n**10. Exxon Mobil** \n\n* Directors: CPAR, PLMI\n\n**12. Costco Wholesale** \n\n* AFAQ (Richard Galanti, CFO)\n\n**15. Microsoft** \n\n* PLMI (Kevin Turner, Fmr COO)\n* LMACA (Greg Maffei, Fmr CFO)\n* Directors: CPAR\n\n**16. Walgreen Boots Alliance** \n\n* FORE (Greg Wasson, Fmr CEO, Walgreens)\n\n**18. Home Depot** \n\n* AAQC (Bob Nardelli, Fmr CEO/Chairman)\n\n**20. Verizon Communications** \n\n* CTAC (Dr. Shaygan Kheradpir, Fmr CIO/CTO)\n\n**23. Anthem** \n\n* CHPM (Joseph Swedish, Fmr CEO)\n\n**25. Fannie Mae** \n\n* EJFA (Timothy J. Mayopoulos, Fmr CEO/President)\n\n**28. Dell Technologies** \n\n* MSDA (Michael Dell, Founder/CEO)\n\n**29. Bank of America Merrill Lynch** \n\n* PIPP (John Thain, Fmr CEO, Merrill Lynch)\n\n**33. CitiGroup** \n\n* CCV, CVII, CCVI (Michael Klein, Fmr CEO Citigroup Markets and Banking)\n\n**34. Facebook** \n\n* BGSX (Owen Van Natta, Fmr COO)\n\n**35. UPS** \n\n* ATVC (Richard Peretz, Fmr CFO)\n\n**38. General Electric** \n\n* HCIC (Jeff Immelt, Fmr Chairman/CEO)\n\n**40. Intel** \n\n* CPUH (Omar Ishrak, Chairman)\n* SLCR (Andy Bryant, Fmr Chairman)\n\n**44. PepsiCo** \n\n* CPAR, GSAH (Steven Reinemund, Fmr. Exec Chair and CEO)\n* LCAA (John Sculley, Fmr CEO)\n* OCA (Albert Carey, Fmr CEO - North America)\n\n**45. FedEx** \n\n* YSAC (David Bronczek, Fmr President and COO)\n\n**50. Walt Disney** \n\n* FRXB (Tom Staggs, Fmr COO)\n\n**54. Boeing** \n\n* NVSA (Dennis Muilenberg, Fmr CEO/COO; John Tracy, Fmr CTO)\n\n**56. HP** \n\n* LEGA (Meg Whitman, Fmr CEO)\n* BTAQ (Leo Apotheker, Fmr CEO)\n\n**59. Goldman Sachs Group** \n\n* CRHC (Gary Cohn, Fmr COO)\n\n**64. Charter Communications** \n\n* PGRW (Carl Vogel, Fmr CEO)\n\n**77. Pfizer** \n\n* PHIC (Ian Read, Fmr Chair/CEO)\n\n**80. Oracle** \n\n* SCLE (Raymond Lane, Fmr COO)\n* DMYQ, DMYI (Harry You, Fmr CFO)\n\n**83. American Express** \n\n* CPAR (Ken Chenault, Fmr CEO/Chair)\n\n**86. Northrop Grumman** \n\n* ZNTE (Ronald Sugar, Fmr CEO/Chair)\n\n**89. Abbott Laboratories** \n\n* REVH (Jeff Leiden, Fmr FOO)\n\n**91. Dollar General** \n\n* ENPC (Michael Calbert, Chairman)\n\n**93. Coca-Cola** \n\n* HYAC (Steven Heyer, Fmr COO)\n\n**95. Thermo Fisher Scientific** \n\n* OACB (Paul Meister, Chairman)\n\n**104. Jabil** \n\n* SHAC (Tim Main, Chairman)\n\n**109. ViacomCBS** \n\n* MRAC (Thomas Freston, Fmr CEO, Viacom)\n* STWO (Sarah Kirshbaum Levy, Fmr COO, Viacom)\n* GGPI (Nancy Tellem, Fmr President, CBS)\n\n**110. Kraft Heinz** \n\n* HPX (Bernardo Hees, Fmr CEO)\n\n**115. Netflix** \n\n* MSDA (Barry McCarthy, Fmr CFO)\n\n**116. Gilead Sciences** \n\n* CPAR (Robin Washington, Fmr CFO)\n\n**118. Eli Lily** \n\n* HIGA (Sidney Taurel, Fmr CEO)\n\n**122. CBRE Group** \n\n* CBAH (Robert Sulentic, CEO)\n\n**124. Qualcomm** \n\n* PRSR (Derek Aberle, Fmr Pres/COO, Steve Altman, Fmr Pres/Vice Chair)\n\n**134. Paypal Holdings** \n\n* BTWN, BTNB (Peter Thiel, Founder/Fmr CEO)\n* RTPY (Reid Hoffman, Fmr CEO)\n\n**152. DXC Technology** \n\n* TLGA (Mike Lawrie, Fmr CEO)\n\n**163. L3Harris Technologies** \n\n* NVSA (Howard Lance, Fmr CEO/Chair, Harris)\n\n**164. Macy’s** \n\n* DEH (Terry Lundgren, Fmr CEO)\n\n**175. Marsh &amp; McLennan** \n\n* FRW (Courtney Leimkuhler, Fmr CFO, Marsh)\n\n**178. Delta Air Lines** \n\n* GNPK (Richard Anderson, Fmr CEO)\n\n**182. Western Digital** \n\n* PIAI (Mike Cordano, Fmr COO)\n\n**189. AECOM** \n\n* SBEA (Stephen Kadenacy, Fmr COO)\n\n**197. DISH Network** \n\n* CONX (Charles Ergen, Fmr CEO/Exec Chair)\n* PGRW (Carl Vogel, Fmr President)\n\nPlease let me know if there are any mistakes/corrections/sponsors I missed on currently active SPACs.",
        "subreddit": "SPACs",
        "title": "SPAC teams with Fortune 200 former/current C-suite execs, Chairmen of the Board and/or Presidents",
        "url": "https://www.reddit.com/r/SPACs/comments/p761je/spac_teams_with_fortune_200_formercurrent_csuite/",
        "created": 1629369227.0
    },
    {
        "author": "jqdaddy2020",
        "created_utc": 1629925183,
        "id": "pbkb9x",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "WDC saved my a$$ today!! At one point I was down $12k. Got out with $30k profit.",
        "url": "https://i.redd.it/rkpmqhrvikj71.jpg",
        "created": 1629953983.0
    },
    {
        "author": "DuckieBasileus",
        "created_utc": 1628436414,
        "id": "p0go61",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Micron Technology(NASDAQ:MU) is the 4th largest distributor of semiconductors in the world leading in production of DRAM and NAND. Analysts predict a one year stock value median of $120  compared to current $82. My own calculation, which skews more conservative, has them at 118.12% with a 30.6 Margin of Safety. \n\nLooking at valuation, they consistently surprise EPS expectations. Last quarter they beat an expected 1.72 at 1.88 and have an expected EPS of 2.32 for Q3. Their PE of 22.63 is below the industry's 31.97x, has P/B of 2.17 compared to industry's 14.2x, P/S is 3.62 compared to Industry's 12.18, PEG Ratio is .36 compared to industry's .12. Altogether, a great start. \n\nFundamentally, looking at their financials they did take a big hit in 2019 because of the semiconductor supply shortage. Look up price of GPU from 2019 to today and you'll quickly see what I mean. This impacted their sales and earnings. In 2018 their high was 31B Revenue and 14B in earnings. With COVID and that stock shortage already there, 2020 earnings had tumbled to 21.43 B and a meager 2.69B. If you go to quarterlies though, they're currently smashing it. They're last quarterly was simply phenomenal. Revenue of 7.42 B, and earnings of 1.74B. Year to Year and Year to quarterly is just fantastic from where they were. Next year they're predicting an EBIDA growth of 20%. Very ambitious estimate and while definitely not sustainable for 5 year period, a one year 20% EBIDA prediction is still very good.\n\nMany things in their favor is they're buying back shares. They're starting to buy back shares. Its not much, but last quarter saw the first decrease in ordinary share number and increase in treasury shares. This is course change from previous quarters of a slight dilution they've had. Its not as intense as Intel's buyback, but it shows management's belief that they're undervalued. They also just announced a dividend. Its small, 10 cents a share, but you don't do that unless you're confident. It also gets on the radar of intuitions that require a dividend. They're domestic so there is no concentration on foreign crackdowns. In fact, in 2019 Huawei was 14% of their business and the USA restriction already had that hit. \n\nSome hits against them are that there are other competitors. Multiple companies have the cash to to invest in hyper expansion like Intel and Ti. Since the start of the shortage, MU has had decreased earnings and revenue seeing shrinkage of about 28% from their 2018 high. Until recently, they weren't  that cash flow positive and have been taking on more debt to power expansion. This may effect DCF calculations. Its more held by institutions than insiders so while the board has an obligation to share holders, it won't keep them up at night. I\n\nSome insight to the semiconductors as a whole. US Gov passed a bill a couple months back approving funding for domestic semicondutor chip development of 50B. So they're not prone to the infrastructure bill may or may not passing, they already have increased federal funding. Also, DRAM and NAND are respectively dynamic memory and logic gates necessary for computers to function. DRAM is expected to increase 16% in sales and NAND is expected to go  up 30%. DRAM makes up a larger portion of sales for MU to NAND. However, none of these things are going away. These are core components of any development and are only looking to increase in demand.\n\nAnother competitor you might want to look at is Western Digital (WDC). They have similar fundamentals and potential for growth. However, Micron has better ratios at the moment  so that's why I chose to focus on it. Either one I think is a greatly undervalued stock with MU just being better.",
        "subreddit": "ValueInvesting",
        "title": "Micron Technology: Semiconductor Giant on Verge of Swing",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/p0go61/micron_technology_semiconductor_giant_on_verge_of/",
        "created": 1628465214.0
    },
    {
        "author": "Nice_Theta",
        "created_utc": 1630182524,
        "id": "pdhaa3",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I posted [my July earnings trading report](https://www.reddit.com/r/thetagang/comments/ov71vv/my_july_earnings_report/) last month, and many of you were kind enough to share your thoughts with me.\n\nTLDR: My July results were almost a scratch, $93 into a positive column, and I was undecided if trading earnings is a worthwhile thing.\n\nFast forward to the end of August… I couldn’t keep away from earnings, just love trading them.\n\nHere are my August stats:\n\n* 21 earnings trades (short condors and strangles, all small positions, average BPu $532.85 per position)\n* 19 wins and 2 losses. A win rate - 90%. Better than July’s 77%. A little experience helps!\n* My wins brought in $567.68\n* Losses took away $104.00\n* Net profit $463.68.\n\nWins: ABNB, BBY, CRM, CSCO, DASH, GPS, HPQ, INTU, M, MRVL, NVDA, PTON, SNOW, SPLK, TGT, TJX, ULTA, URBN, WDC\n\nLosses: LOW, JWN\n\nThe wins are great - no doubt. But it is the losses that are really interesting and have a high learning value. My losses show my indecision between two lines of thought: to defend a losing trade or to exit ASAP to minimize the loss. I have seen convincing arguments for both approaches, and am not yet sure where I stand on this.\n\nI managed my losing LOW trade fairly well in the beginning, brought it from several hundred down to around $30 loss. I could have brought it to a win, but I made a mistake - misread where I was standing and exited for a small loss. I learned how to read the position correctly and did another losing trade right - turned it into a win.\n\nI decided to take a loss on JWN because my overall win rate for August was around 93% and I thought I could afford a small loss. But now I think it could’ve been managed and perhaps turned. But we’ll never know if it could and if I had the skill to do it.\n\nWhere do you stand on this question? Do you defend? Or take a loss and move on to the next trade?",
        "subreddit": "options",
        "title": "My August earnings report",
        "url": "https://www.reddit.com/r/options/comments/pdhaa3/my_august_earnings_report/",
        "created": 1630211324.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628197116,
        "id": "oyrodl",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, August 5, 2021**\n\nAfter closing mixed yesterday, stocks firmly rose today as market participants digested more corporate earnings reports and the Weekly Unemployment Report, which showed improvement. Tomorrow, the Department of Labor will release it’s July Unemployment Report. This report is set to be a wild card, with analyst estimates ranging wildly from ADP estimating an addition of 330,000 jobs to Bloomberg economists estimate of 845,000 jobs added. We’ll see tomorrow.\n\nThe three major indexes powered higher today, with both the S&amp;P 500 (SPY) and Nasdaq (QQQ) recording fresh intraday all-time highs. The Dow Jones (DIA) closed 0.75% higher and is marginally below it’s previous all-time high. The Russell 2000 (IWM), which tracks the performance of small-cap stocks, closed 1.8% higher. \n\nADP, a leading payroll and human services software company, released its July 2021 Employment Report, which estimated that private employers added only 330,000 jobs in July, less than half the 690,000 gain expected by economists. While ADP’s estimates aren’t 100% accurate, it sets up a negative backdrop for the July Jobs Report set to be released tomorrow. As I said earlier, estimates between economists range wildly, so we’ll just have to wait and see how the report unfolds. \n\nSo far, 59% of the companies in the S&amp;P 500 (SPY) have reported Q2 earnings, with 88% of these beating analyst expectations, according to FactSet. This quarter is shaping up to be another record-breaking one, with corporate earnings growth rate expected to accelerate 85% year-on-year, which would be the biggest jump since the Q4 2009. \n\nHowever, it is important to note that, despite beating earnings expectations, a number of these companies have pulled back, with tepid outlooks moving forward overshadowing strong results. Moving forward, given that most companies have so far exceeded pre-pandemic levels and the current quarter has an easy comparison to last year, expectations for growth are inevitably going to moderate. This said, I think the pullback in some stocks following earnings is an overreaction. \n\n**Highlights**\n\n* The Weekly Unemployment Report came in roughly in-line with analyst expectations\n   * First time jobless claims: 385,000 vs 383,000 expected\n   * Continuing Claims 2.93 million vs 3 million\n* The rally in Robinhood (HOOD) stopped, with the stock dropping more than 27% today, very crazy movement in this stock the last few days. On the other hand, shares of “meme stocks” advanced after falling a few days in a row. \n* Uber (UBER) posted a wider than expected loss for Q2. This bodes bad for the company since rival Lyft (LYFT) unexpectedly posted a profit last quarter.\n* Shares of Etsy (ETSY) sank 10% after the company posted slightly disappointed during earnings. \n* Shares of DataDog (DDOG) gapped up after the company smashed earnings estimates \n* Penn National Gaming (PENN) acquired Score Media (SCR), the largest sports media app in Canada and the third largest in the US for $2 billion in cash and stock. Jay Snowden, President and CEO said of the acquisition, “theScore’s unique media platform and modern, state-of-the art technology is a powerful complement to the reach of Barstool Sports and its popular personalities and content. We are now uniquely positioned to seamlessly serve our customers with the most powerful ecosystem of sports, gaming and media in North America, ultimately creating a community that doesn’t currently exist.” I personally like this stock.\n* In a White House event, the Biden administration and auto makers committed to try and get EV sales to make up 50% of cars sold in the US by 2030, contingent on the government support for the transition.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AbbVie (ABBV) target raised by Argus from $130 to $140 at Buy. Stock currently around $115.\n* AmerisourceBergen (ABC) target raised by Robert W Baird from $156 to $162 at Outperform. Stock currently around $122\n* Costco (COST) with a host of target raises. Consensus price target $480 at Overweight. Stock currently around $443\n* CVS target raised by Deutsche Bank from $95 to $101 at Buy. Stock currently around $80\n* DataDog (DDOG) target raised by Needham &amp; Co from $150 to $173 at Buy. Stock currently around $132\n* Electronic Arts (EA) with a host of target raises. Consensus price target $175 at Buy. Stock currently around $137\n* Equitable (EQH) target raised by Morgan Stanley from $45 to $46 at Overweight. Stock currently around $32\n* GoDaddy (GDDY) with two target raises. Stock currently around $73\n   * Raymond James from $107 to $108 at Strong-Buy\n   * Wedbush from $92 to $108 at Outperform\n* Lyft (LYFT) target raised by Citigroup from $80 to $88 at Buy. Stock currently around $52\n* Regeneron Pharma (REGN) Target raised by Piper Sandler from $650 to $675 at Overweight. Stock currently around $602\n* Roku (ROKU) target raised by DA Davidson from $560 to $600 at Buy. Stock currently around $403\n* Western Digital (WDC) with four target raises. Stock currently around $67\n   * Rosenblatt Securities from $70 to $80 at Outperform\n   * Mizuho from $90 to $92 at Buy\n   * Wedbush from $90 to $95 at Outperform\n   * Craig Hallum from $95 to $101 at Buy.\n\n“Rather fail with honor than succeed by fraud.” Sophocles",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, August 5, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/oyrodl/here_is_a_market_recap_for_today_thursday_august/",
        "created": 1628225916.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629922215,
        "id": "pbjalm",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, August 25, 2021**\n\nStocks continued their momentum, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) once again reaching intraday record highs. It seems market participants have looked past the Federal Reserve’s July meeting minutes, which included language signaling that tapering may begin sooner rather than later, and continue to digest Q2 record-breaking earnings season and new developments coming out of Washington D.C. Looking ahead, market participants await Fed Chair Jerome Powell annual Jackson Hole speech, scheduled this Friday morning.\n\nThis earnings season has been a smashing, record-breaking success. 91% of companies in the SPY have reported, with 87% of those outperforming estimates in revenue. The blended, year-over-year earnings growth rate is an eye-popping 85.1%, absolutely smashing original estimates of 66.5%. What is most remarkable is this comes among a resurgence of coronavirus cases due to the delta variant, supply-side disruptions, and labor market imbalances in the US. \n\nUS Crude oil prices continued gaining, building on advances after recently hitting a seven-day consecutive losing streak. West Texas intermediate crude oil rose by nearly 3% on Tuesday to settle at $67.54 a barrel. Brent crude, the international standard, also gained to top $71 per barrel.\n\nEnergy prices gained as optimism mounted over a pick-up in consumer mobility following the full FDA approval of Pfizer's coronavirus vaccine. U.S. crude oil prices have so far risen 39% for the year-to-date.\n\nYesterday, The House of Representatives voted to adopt a $3.5 trillion budget resolution, taking a major step toward enacting President Biden’s ambitious economic agenda that calls for increased spending on education, health care and renewable energy. The 220-212 vote, which fell along partisan lines, was originally delayed after a group of moderate Democrats said they would not approve the budget until the infrastructure bill was voted on. \n\nFollowing the vote, House Speaker Nancy Pelosi said, “Passing an infrastructure bill is always exciting for what it means in terms of jobs and commerce in our country.” President Biden thanked every member of the House, saying, “There were differences. Strong points of view. They’re always welcome. What’s important is that we came together to advance our agenda.”\n\nFederal Reserve's virtual Jackson Hole Symposium, which kicks off on Thursday. After last week's July Federal Open Market Committee meeting minutes came off as more hawkish than many market participants were expecting, more clues on the path forward for monetary policy remain a key focal point. Namely, traders are looking to see whether central bank officials signal when they will announce and implement tapering of pandemic-era quantitative easing.\n\n**Highlights**\n\n* Mortgage applications unexpectedly rose, according to data from the Mortgage Bankers Association. Overall applications were up 1.6% during the week ended August 20, following a drop of 3.9% during the previous week. Home purchases led the advances, with these rising 3% week-on-week on a seasonally adjusted basis to reach the highest level since early July.\n* Western Digital (WDC) is in advanced talks to merge with Japanese semiconductor company Kioxia in a deal valued roughly $20 billion.\n* Shares of Nvidia (NVDA) continued absolutely beasting, which makes me so happy. As I have said before, NVDA is by far my favorite stock in the market.\n* President Joe Biden called cybersecurity a \"core national security challenge\" in a meeting with leaders from Silicon Valley, the water and energy sectors, the banking and insurance industries and academic institutions on Wednesday to discuss [shoring up the nation's cybersecurity.](https://www.cnn.com/2021/05/12/politics/cybersecurity-executive-order/index.html) IMO cybersecurity stocks are a great place to look into for future value.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Advance Auto Parts (AAP) with a host of target raises. Average price target $240 at Outperform. Stock currently around $212\n* Affirm (AFRM) target raised by Bank of America from $71 to $82 at Buy. Stock currently around $72\n* Best Buy (BBY) with two target raises. Stock currently around $121\n   * Jefferies Financial from $136 to $145 at Buy\n   * Telsey Advisory Group from $140 to $150 at Outperform\n* Digital Realty Trust (DLR) target raised by Barclays from $177 to $178 at Overweight. Stock currently around $159\n* Intuit (INTU) with a host of target raises. Average price target $650 at Buy. Stock currently around $557\n* Marvell Technology (MRVL) target asied by Susquehanna from $64 to $72 at Positive. Stock currently around $63\n* Pinduoduo (PDD) target raised by Bank of America from $143 to $148 at Buy. Stock currently around $97\n\n“It is the mark of an educated mind to be able to entertain a thought without accepting it” - Aristotle",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, August 25, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pbjalm/here_is_a_market_recap_for_today_wednesday_august/",
        "created": 1629951015.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1629916295,
        "id": "pbh9xq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "https://www.marketwatch.com/story/western-digitals-stock-soars-after-wsj-report-of-talks-on-20-billion-merger-deal-with-japans-kioxia-2021-08-25?mod=mw_quote_news\n\nShares of Western Digital Corp. WDC, +10.50% soared 11.7% in afternoon trading Wednesday, to pace the S&amp;P 500's SPX, +0.30% gainers, after The Wall Street Journal reported that the data storage company was in merger talks with Japan-based Kioxia Holdings Corp., in a deal that could be valued at more than $20 billion. Citing people familiar with the matter, the WSJ report said the long-running talks have heated up in the past few weeks, with a deal possible as early as the middle of September. Western Digital would use stock to pay for the deal, and the combined company would likely be run by David Goeckeler, its chief executive, the WSJ report said. The stock has now gained 22.5% year to date, while the SPDR Technology Select Sector ETF XLK, -0.17% has rallied 21.0% and the S&amp;P 500 has advanced 19.8%.\n\nThis is definitely a positive news for WDC and MU. MU is been down after the earning report and the winter coming warning from Morgan Stanley. MU should be continue to benefit from the current chip shortage trend and the iphone 13 release by apple on September.",
        "subreddit": "stocks",
        "title": "Western Digital's stock soars after WSJ report of talks on $20+ billion merger deal with Japan's Kioxia",
        "url": "https://www.reddit.com/r/stocks/comments/pbh9xq/western_digitals_stock_soars_after_wsj_report_of/",
        "created": 1629945095.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629922243,
        "id": "pbjayc",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, August 25, 2021**\n\nStocks continued their momentum, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) once again reaching intraday record highs. It seems market participants have looked past the Federal Reserve’s July meeting minutes, which included language signaling that tapering may begin sooner rather than later, and continue to digest Q2 record-breaking earnings season and new developments coming out of Washington D.C. Looking ahead, market participants await Fed Chair Jerome Powell annual Jackson Hole speech, scheduled this Friday morning.\n\nThis earnings season has been a smashing, record-breaking success. 91% of companies in the SPY have reported, with 87% of those outperforming estimates in revenue. The blended, year-over-year earnings growth rate is an eye-popping 85.1%, absolutely smashing original estimates of 66.5%. What is most remarkable is this comes among a resurgence of coronavirus cases due to the delta variant, supply-side disruptions, and labor market imbalances in the US. \n\nUS Crude oil prices continued gaining, building on advances after recently hitting a seven-day consecutive losing streak. West Texas intermediate crude oil rose by nearly 3% on Tuesday to settle at $67.54 a barrel. Brent crude, the international standard, also gained to top $71 per barrel.\n\nEnergy prices gained as optimism mounted over a pick-up in consumer mobility following the full FDA approval of Pfizer's coronavirus vaccine. U.S. crude oil prices have so far risen 39% for the year-to-date.\n\nYesterday, The House of Representatives voted to adopt a $3.5 trillion budget resolution, taking a major step toward enacting President Biden’s ambitious economic agenda that calls for increased spending on education, health care and renewable energy. The 220-212 vote, which fell along partisan lines, was originally delayed after a group of moderate Democrats said they would not approve the budget until the infrastructure bill was voted on. \n\nFollowing the vote, House Speaker Nancy Pelosi said, “Passing an infrastructure bill is always exciting for what it means in terms of jobs and commerce in our country.” President Biden thanked every member of the House, saying, “There were differences. Strong points of view. They’re always welcome. What’s important is that we came together to advance our agenda.”\n\nFederal Reserve's virtual Jackson Hole Symposium, which kicks off on Thursday. After last week's July Federal Open Market Committee meeting minutes came off as more hawkish than many market participants were expecting, more clues on the path forward for monetary policy remain a key focal point. Namely, traders are looking to see whether central bank officials signal when they will announce and implement tapering of pandemic-era quantitative easing.\n\n**Highlights**\n\n* Mortgage applications unexpectedly rose, according to data from the Mortgage Bankers Association. Overall applications were up 1.6% during the week ended August 20, following a drop of 3.9% during the previous week. Home purchases led the advances, with these rising 3% week-on-week on a seasonally adjusted basis to reach the highest level since early July.\n* Western Digital (WDC) is in advanced talks to merge with Japanese semiconductor company Kioxia in a deal valued roughly $20 billion.\n* Shares of Nvidia (NVDA) continued absolutely beasting, which makes me so happy. As I have said before, NVDA is by far my favorite stock in the market.\n* President Joe Biden called cybersecurity a \"core national security challenge\" in a meeting with leaders from Silicon Valley, the water and energy sectors, the banking and insurance industries and academic institutions on Wednesday to discuss [shoring up the nation's cybersecurity.](https://www.cnn.com/2021/05/12/politics/cybersecurity-executive-order/index.html) IMO cybersecurity stocks are a great place to look into for future value.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Advance Auto Parts (AAP) with a host of target raises. Average price target $240 at Outperform. Stock currently around $212\n* Affirm (AFRM) target raised by Bank of America from $71 to $82 at Buy. Stock currently around $72\n* Best Buy (BBY) with two target raises. Stock currently around $121\n   * Jefferies Financial from $136 to $145 at Buy\n   * Telsey Advisory Group from $140 to $150 at Outperform\n* Digital Realty Trust (DLR) target raised by Barclays from $177 to $178 at Overweight. Stock currently around $159\n* Intuit (INTU) with a host of target raises. Average price target $650 at Buy. Stock currently around $557\n* Marvell Technology (MRVL) target asied by Susquehanna from $64 to $72 at Positive. Stock currently around $63\n* Pinduoduo (PDD) target raised by Bank of America from $143 to $148 at Buy. Stock currently around $97\n\n“It is the mark of an educated mind to be able to entertain a thought without accepting it” - Aristotle",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, August 25, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pbjayc/here_is_a_market_recap_for_today_wednesday_august/",
        "created": 1629951043.0
    },
    {
        "author": "GoodUnhappy",
        "created_utc": 1628600846,
        "id": "p1ot7g",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ZEV &amp; WDC all the way!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1ot7g/zev_wdc_all_the_way/",
        "created": 1628629646.0
    },
    {
        "author": "GoodUnhappy",
        "created_utc": 1628805139,
        "id": "p39smx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Shorts destroyed MU and WDC..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p39smx/shorts_destroyed_mu_and_wdc/",
        "created": 1628833939.0
    },
    {
        "author": "peaceinpieces",
        "created_utc": 1629919245,
        "id": "pbiapq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$WDC in talks to merge with long time JV partner Kioxia",
        "url": "https://www.wsj.com/amp/articles/western-digital-in-advanced-talks-to-merge-with-kioxia-in-20-billion-plus-deal-11629914820",
        "created": 1629948045.0
    },
    {
        "author": "peaceinpieces",
        "created_utc": 1629917055,
        "id": "pbhj7l",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$WDC in advanced talks to merge with long time JV partner Kioxia",
        "url": "https://www.google.com/amp/s/www.wsj.com/amp/articles/western-digital-in-advanced-talks-to-merge-with-kioxia-in-20-billion-plus-deal-11629914820",
        "created": 1629945855.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1629935788,
        "id": "pbnovt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | Quanta Services Inc | **PWR** | 3.17%  \n2. **Health Care** | Catalent Inc | **CTLT** | 2.30%  \n3. **Information Technology** | Western Digital Corp | **WDC** | 7.80%  \n4. **Communication Services** | News Corp Class A | **NWSA** | 1.16%  \n5. **Consumer Discretionary** | Penn National Gaming, Inc | **PENN** | 8.66%  \n6. **Utilities** | NRG Energy Inc | **NRG** | 3.75%  \n7. **Financials** | American Express Company | **AXP** | 3.09%  \n8. **Materials** | Corteva Inc | **CTVA** | 2.89%  \n9.  **Real Estate** | Regency Centers Corp | **REG** | 2.46%  \n10. **Consumer Staples** | Archer-Daniels-Midland Co | **ADM** | 1.16%  \n11. **Energy** | Devon Energy Corp | **DVN** | 2.49%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **TransDigm Group Incorporated** | TDG | **-0.70%**  \n2. Health Care | **Biogen Inc** |  BIIB | **-1.90%**  \n3. Information Technology | **Global Payments Inc** | GPN | **-1.23%**  \n4.  Communication Services | **TAKE-TWO INTERACTIVE SOFTWARE, INC Common Stock** | TTWO | **-1.93%**  \n5. Consumer Discretionary | **Gap Inc** | GPS | **-5.31%**  \n6. Utilities | **Edison International** | EIX | **-0.97%**  \n7. Financials | **MarketAxess Holdings Inc.** | MKTX | **-1.75%**  \n8. Materials | **Nucor Corporation** | NUE | **-2.67%**  \n9. Real Estate | **Digital Realty Trust, Inc.** | DLR | **-1.83%**  \n10. Consumer Staples | **Campbell Soup Company** | CPB | **-2.17%**  \n11. Energy | **Williams Companies Inc** | WMB | **-0.16%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 8/25/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pbnovt/sp500_winners_and_losers_8252021/",
        "created": 1629964588.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628197142,
        "id": "oyrooy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, August 5, 2021**\n\nAfter closing mixed yesterday, stocks firmly rose today as market participants digested more corporate earnings reports and the Weekly Unemployment Report, which showed improvement. Tomorrow, the Department of Labor will release it’s July Unemployment Report. This report is set to be a wild card, with analyst estimates ranging wildly from ADP estimating an addition of 330,000 jobs to Bloomberg economists estimate of 845,000 jobs added. We’ll see tomorrow.\n\nThe three major indexes powered higher today, with both the S&amp;P 500 (SPY) and Nasdaq (QQQ) recording fresh intraday all-time highs. The Dow Jones (DIA) closed 0.75% higher and is marginally below it’s previous all-time high. The Russell 2000 (IWM), which tracks the performance of small-cap stocks, closed 1.8% higher. \n\nADP, a leading payroll and human services software company, released its July 2021 Employment Report, which estimated that private employers added only 330,000 jobs in July, less than half the 690,000 gain expected by economists. While ADP’s estimates aren’t 100% accurate, it sets up a negative backdrop for the July Jobs Report set to be released tomorrow. As I said earlier, estimates between economists range wildly, so we’ll just have to wait and see how the report unfolds. \n\nSo far, 59% of the companies in the S&amp;P 500 (SPY) have reported Q2 earnings, with 88% of these beating analyst expectations, according to FactSet. This quarter is shaping up to be another record-breaking one, with corporate earnings growth rate expected to accelerate 85% year-on-year, which would be the biggest jump since the Q4 2009. \n\nHowever, it is important to note that, despite beating earnings expectations, a number of these companies have pulled back, with tepid outlooks moving forward overshadowing strong results. Moving forward, given that most companies have so far exceeded pre-pandemic levels and the current quarter has an easy comparison to last year, expectations for growth are inevitably going to moderate. This said, I think the pullback in some stocks following earnings is an overreaction. \n\n**Highlights**\n\n* The Weekly Unemployment Report came in roughly in-line with analyst expectations\n   * First time jobless claims: 385,000 vs 383,000 expected\n   * Continuing Claims 2.93 million vs 3 million\n* The rally in Robinhood (HOOD) stopped, with the stock dropping more than 27% today, very crazy movement in this stock the last few days. On the other hand, shares of “meme stocks” advanced after falling a few days in a row. \n* Uber (UBER) posted a wider than expected loss for Q2. This bodes bad for the company since rival Lyft (LYFT) unexpectedly posted a profit last quarter.\n* Shares of Etsy (ETSY) sank 10% after the company posted slightly disappointed during earnings. \n* Shares of DataDog (DDOG) gapped up after the company smashed earnings estimates \n* Penn National Gaming (PENN) acquired Score Media (SCR), the largest sports media app in Canada and the third largest in the US for $2 billion in cash and stock. Jay Snowden, President and CEO said of the acquisition, “theScore’s unique media platform and modern, state-of-the art technology is a powerful complement to the reach of Barstool Sports and its popular personalities and content. We are now uniquely positioned to seamlessly serve our customers with the most powerful ecosystem of sports, gaming and media in North America, ultimately creating a community that doesn’t currently exist.” I personally like this stock.\n* In a White House event, the Biden administration and auto makers committed to try and get EV sales to make up 50% of cars sold in the US by 2030, contingent on the government support for the transition.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AbbVie (ABBV) target raised by Argus from $130 to $140 at Buy. Stock currently around $115.\n* AmerisourceBergen (ABC) target raised by Robert W Baird from $156 to $162 at Outperform. Stock currently around $122\n* Costco (COST) with a host of target raises. Consensus price target $480 at Overweight. Stock currently around $443\n* CVS target raised by Deutsche Bank from $95 to $101 at Buy. Stock currently around $80\n* DataDog (DDOG) target raised by Needham &amp; Co from $150 to $173 at Buy. Stock currently around $132\n* Electronic Arts (EA) with a host of target raises. Consensus price target $175 at Buy. Stock currently around $137\n* Equitable (EQH) target raised by Morgan Stanley from $45 to $46 at Overweight. Stock currently around $32\n* GoDaddy (GDDY) with two target raises. Stock currently around $73\n   * Raymond James from $107 to $108 at Strong-Buy\n   * Wedbush from $92 to $108 at Outperform\n* Lyft (LYFT) target raised by Citigroup from $80 to $88 at Buy. Stock currently around $52\n* Regeneron Pharma (REGN) Target raised by Piper Sandler from $650 to $675 at Overweight. Stock currently around $602\n* Roku (ROKU) target raised by DA Davidson from $560 to $600 at Buy. Stock currently around $403\n* Western Digital (WDC) with four target raises. Stock currently around $67\n   * Rosenblatt Securities from $70 to $80 at Outperform\n   * Mizuho from $90 to $92 at Buy\n   * Wedbush from $90 to $95 at Outperform\n   * Craig Hallum from $95 to $101 at Buy.\n\n“Rather fail with honor than succeed by fraud.” Sophocles",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, August 5, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/oyrooy/here_is_a_market_recap_for_today_thursday_august/",
        "created": 1628225942.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1629935762,
        "id": "pbnomg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Three ETF's per winner (when available)  \n\n\n**ETF Ticker | % invested in Winner | ETF Full Name**  \n\n\n**Industrials**: ETFs investing in Quanta Services Inc  \nGRID-- 3.77%  First Trust Nasdaq Clean Edge Smart GRID Infrastructure Index  \nFLM-- 3.53%  First Trust Global Engineering and Construction ETF  \nEMLP-- 3.18%  First Trust North American Energy Infrastructure Fund  \n\n\n**Health Care**: ETFs investing in Catalent Inc  \nPBE-- 5.97%  Invesco Dynamic Biotechnology &amp; Genome ETF  \nXPH-- 5.46%  SPDR S&amp;P Pharmaceuticals ETF  \nIHE-- 4.95%  iShares U.S. Pharmaceuticals ETF  \n\n\n**Information Technology**: ETFs investing in Western Digital Corp  \nN/A--    \n   \n   \n\n\n**Communication Services**: ETFs investing in News Corp Class A  \nN/A--    \n   \n   \n\n\n**Consumer Discretionary**: ETFs investing in Penn National Gaming, Inc  \nCSD-- 6.47%  Invesco S&amp;P Spin-Off ETF  \nBEDZ-- 4.39%  AdvisorShares Hotel ETF  \nBETZ-- 4.01%  Roundhill Sports Betting &amp; iGaming ETF  \n\n\n**Utilities**: ETFs investing in NRG Energy Inc  \nRYU-- 4.11%  Invesco S&amp;P 500® Equal Weight Utilities ETF  \nPUI-- 3.25%  Invesco DWA Utilities Momentum ETF  \nSPDV-- 1.92%  AAM S&amp;P 500 High Dividend Value ETF  \n\n\n**Financials**: ETFs investing in American Express Company  \nIPAY-- 5.65%  ETFMG Prime Mobile Payments ETF  \nTPAY-- 4.25%  Ecofin Digital Payments Infrastructure Fund  \nDUSA-- 4.11%  Davis Select U.S. Equity ETF  \n\n\n**Materials**: ETFs investing in Corteva Inc  \nKROP-- 13.04%  Global X AgTech &amp; Food Innovation ETF  \nCSD-- 6.92%  Invesco S&amp;P Spin-Off ETF  \nVEGI-- 6.04%  iShares MSCI Global Agriculture Producers ETF  \n\n\n**Real Estate**: ETFs investing in Regency Centers Corp  \nUTRN-- 3.98%  Vesper U.S. Large Cap Short-Term Reversal Strategy ETF  \n   \n   \n\n\n**Consumer Staples**: ETFs investing in Archer-Daniels-Midland Co  \nFTXG-- 7.73%  First Trust Nasdaq Food &amp; Beverage ETF  \nVEGI-- 6.41%  iShares MSCI Global Agriculture Producers ETF  \nNANR-- 6.13%  SPDR S&amp;P North American Natural Resources ETF  \n\n\n**Energy**: ETFs investing in Devon Energy Corp  \nFRAK-- 6.45%   VanEck Vectors Unconventional Oil &amp; Gas ETF  \nRYE-- 5.17%   Invesco S&amp;P 500® Equal Weight Energy ETF  \nFCG-- 5.16%   First Trust Natural Gas ETF  \n\n\nHappy investing!",
        "subreddit": "StockMarket",
        "title": "ETFs with Investments in SP500 Winners of 8/25/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pbnomg/etfs_with_investments_in_sp500_winners_of_8252021/",
        "created": 1629964562.0
    },
    {
        "author": "wdw67",
        "created_utc": 1629916734,
        "id": "pbhf8f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Western Digital",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/pbhf8f/western_digital/",
        "created": 1629945534.0
    },
    {
        "author": "investing-scientist2",
        "created_utc": 1630599692,
        "id": "pgl6ia",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Here is a couple of stocks that might be worth your attention this week. They were selected using a couple of criteria - most of them heavily rely an the company's fundamentals; the analysts recommendations are only provided as a kind of support for the hand-picked names. This is why I’m calling the approach a **consensus strategy.** \n\nThe stocks I’m going to present you below are generally believed to outperform the stock market in the coming months, they have a consensus recommendation of Buy, their fundamentals are scored considerably better than most stocks and their average target price by stock analysts is above current market valuation.\n\nIn order to consider buying the stock’s shares, the following criteria need to be satisfied:\n\n* **TheStreet score**: A+, A or A-\n* **Zacks Rank**: 1 (Strong Buy), 2 (Buy) or 3 (Hold)\n* **Weiss Ratings recommendation**: A or B\n* **Yahoo Finance recommendation**: at least mixed Buy/Hold\n* **Yahoo Finance target price**: min. 5% higher than current price\n* **Piotroski F-Score**: min. 4\n* **InvestorsObserver Overall Score**: min. 50  \n\n**Note**: Descriptions of those criteria are provided at the end of this post as well as [HERE](https://www.investing-scientist.com/research/top-stocks-to-buy-a-consensus-strategy/). If you decide to buy any of the below stocks, you might want to consider the following selling conditions (at least one of them should be satisfied):\n\n* price is higher or close to target\n* profit is in range 20% – 30%\n* loss is higher than 50%\n* TheStreet recommendation is changed to Sell\n* Weiss Ratings recommendation is changed to Sell\n* Yahoo Finance recommendation is changed to Sell\n\n###### Let’s now take a look at the stocks I’ve identified with this strategy today.\n\n&amp;#x200B;\n\n### APPLE INC (AAPL)\n\n**Sector**: Electronic Technology  \n**Industry**: Telecommunications Equipment  \n**Description**: Apple, Inc engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other variety of related services. Its products and services include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, Apple Care, iCloud, digital content stores, streaming, and licensing services. The company was founded by Steven Paul Jobs, Ronald Gerald Wayne, and Stephen G. Wozniak in 1977 and is headquartered in Cupertino, CA.  \n**Dividend**: Apple pays an annual dividend of $0.88 per share, with a dividend yield of 0.57%. AAPL's most recent quarterly dividend payment was made to shareholders of record on Thursday, August 12. The company has grown its dividend for the last 8 consecutive years and is increasing its dividend by an average of 9.50% each year. Apple pays out 26.83% of its earnings out as a dividend.  \n**Current valuation**: $153.72\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$166.23**  \nYahoo Finance 1 year change: **8.14%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **58**\n\n&amp;#x200B;\n\n### BROADCOM INC (AVGO)\n\n**Sector**: Electronic Technology  \n**Industry**: Semiconductors  \n**Description**: Broadcom, Inc. is a global technology company, which designs, develops and supplies semiconductor and infrastructure software solutions. It operates through the following segments: Semiconductor Solutions and Infrastructure Software. The Semiconductor Solutions segment manages movement of data in data center, telecom, enterprise and embedded networking applications. The Infrastructure Software segment provides a portfolio of mainframe, enterprise and storage area networking solutions.  \n**Dividend**: Broadcom pays an annual dividend of $14.40 per share, with a dividend yield of 2.93%. AVGO's most recent quarterly dividend payment was made to shareholders of record on Wednesday, June 30. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 40.53% each year. Broadcom pays out 78.05% of its earnings out as a dividend.  \n**Current valuation**: $491.48\n\n##### Valuation of entry parameters:\n\nTheStreet score: A  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$530.62**  \nYahoo Finance 1 year change: **7.96%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **76**\n\n&amp;#x200B;\n\n### COMCAST CORP (CMCSA)\n\n**Sector**: Consumer Services  \n**Industry**: Cable/Satellite TV  \n**Description**: Comcast Corporation is a media and technology company. The Company has two primary businesses: Comcast Cable and NBCUniversal. Its Comcast Cable business operates in the Cable Communications segment. Its NBCUniversal business operates in four business segments: Cable Networks, Broadcast Television, Filmed Entertainment and Theme Parks.  \n**Dividend**: Comcast pays an annual dividend of $1.00 per share, with a dividend yield of 1.62%. CMCSA's next quarterly dividend payment will be made to shareholders of record on Wednesday, October 27. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 23.96% each year. Comcast pays out 38.31% of its earnings out as a dividend.  \n**Current valuation**: $61.64\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$66.74**  \nYahoo Finance 1 year change: **8.27%**  \nPiotroski F-Score: **5**  \nInvestorsObserver Overall Score: **70**\n\n&amp;#x200B;\n\n### CRA INTERNATIONAL INC (CRAI)\n\n**Sector**: Commercial Services  \n**Industry**: Miscellaneous Commercial Services  \n**Description**: CRA International, Inc. is a consulting firm, which engages in provision of economic, financial and management consulting services. It offers consulting services through the litigation, regulatory, financial, and management consulting areas. The company was founded in 1965 and is headquartered in Boston, MA.  \n**Dividend**: CRA International pays an annual dividend of $1.04 per share, with a dividend yield of 1.06%. CRAI's next quarterly dividend payment will be made to shareholders of record on Friday, September 10. The company has grown its dividend for the last 4 consecutive years and is increasing its dividend by an average of 17.21% each year. CRA International pays out 31.04% of its earnings out as a dividend.  \n**Current valuation**: $95.0\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Strong Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$110.0**  \nYahoo Finance 1 year change: **15.79%**  \nPiotroski F-Score: **8**  \nInvestorsObserver Overall Score: **85**\n\n&amp;#x200B;\n\n### CVS HEALTH CORP (CVS)\n\n**Sector**: Retail Trade  \n**Industry**: Drugstore Chains  \n**Description**: CVS Health Corp. engages in the provision of health care services. It operates through the following segments: Pharmacy Services, Retail or Long Term Care, Health Care Benefits, and Corporate/Other. The company was founded by Stanley P. Goldstein and Ralph Hoagland in 1963 and is headquartered in Woonsocket, RI.  \n**Dividend**: CVS Health pays an annual dividend of $2.00 per share, with a dividend yield of 2.29%. CVS's most recent quarterly dividend payment was made to shareholders of record on Monday, August 2. CVS Health pays out 26.67% of its earnings out as a dividend.  \n**Current valuation**: $86.89\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$96.32**  \nYahoo Finance 1 year change: **10.85%**  \nPiotroski F-Score: **4**  \nInvestorsObserver Overall Score: **74**\n\n&amp;#x200B;\n\n### JOHNSON &amp; JOHNSON (JNJ)\n\n**Sector**: Health Technology  \n**Industry**: Pharmaceuticals: Major  \n**Description**: Johnson \\&amp;amp; Johnson is a holding company, which is engaged in the research and development, manufacture and sale of a range of products in the healthcare field. It operates through three segments: Consumer, Pharmaceutical and Medical Devices. Its primary focus is products related to human health and well-being. Its research facilities are located in the United States, Belgium, Brazil, Canada, China, France, Germany, India, Israel, Japan, the Netherlands, Singapore, Switzerland and the United Kingdom.  \n**Dividend**: Johnson &amp; Johnson pays an annual dividend of $4.24 per share, with a dividend yield of 2.43%. JNJ's next quarterly dividend payment will be made to shareholders of record on Tuesday, September 7. The company has grown its dividend for the last 59 consecutive years and is increasing its dividend by an average of 6.23% each year. Johnson &amp; Johnson pays out 52.80% of its earnings out as a dividend.  \n**Current valuation**: $174.93\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$189.61**  \nYahoo Finance 1 year change: **8.39%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **64**  \n\n\n \n\n#### Now, a few words on the criteria I’m using and sources of data.\n\n**1. TheStreet score**\n\nThe first filtering step is to get stocks with Buy recommendation at TheStreet stock screener. I’m only keeping stocks with A+, A or A- rating (top ones), although A-, B+, B and B- are Buys as well.\n\nFrom thestreet.com:\n\n***A (Excellent)*** *– The stock has an excellent track record for maximizing performance while minimizing risk, thus delivering the best possible combination of total return on investment and reduced volatility. It has made the most of the recent economic environment to maximize risk-adjusted returns compared to other stocks. While past performance is just an indication — not a guarantee — we believe this fund is among the most likely to deliver superior performance relative to risk in the future as well.*\n\nAnd about the methodology (source: https://www.thestreet.com/r/ratings/reports/detail/T.html):\n\n*TheStreet Ratings’ stock model projects a stock’s total return potential over a 12-month period including both price appreciation and* ***dividends****. Our Buy, Hold or Sell ratings designate how we expect these stocks to perform against a general benchmark of the equities market and interest rates. While our model is quantitative, it utilizes both* ***subjective*** *and* ***objective*** *elements. For instance, subjective elements include expected equities market returns, future interest rates, implied industry outlook and forecasted company earnings. Objective elements include volatility of past operating revenues, financial strength, and company cash flows.*\n\n**2. Zacks Rank**\n\nIt is required that the Zacks Rank is Hold, Buy or Strong Buy (so we’re avoiding stocks with Sell and Strong Sell recommendations). The Zacks Rating utilizes a completely different system, based on company earnings-related data, in particular earnings estimate revisions and earnings surprises, to predict profitability of holding the company’s shares. More from https://www.zacks.com/education/stock-education/zacks-rank-guide-6:\n\n*A portfolio of Zacks Rank #1 (Strong Buy) stocks has beaten the market in 26 of the last 31 years with an average annual return of* ***+24.3%*** *a year; more than double that of the S&amp;P 500’s +10.6% .*\n\n**3. Weiss Ratings recommendation**\n\nWe’re only keeping stocks with Buy (B) or Strong Buy (A) recommendation.\n\nWjat are these scores? This is what I found at their website:\n\n*“A” Rating:* ***Excellent.*** *The company’s stock has an excellent track record for providing strong performance with lower-than-average risk, and it is trading at a price that represents good value relative to the company’s earnings prospects. While past performance is no guarantee of future results, our opinion is that this stock is among the most likely to deliver superior performance relative to risk in the future. Of course, even the best stocks can decline in a down market. But our “A” rating can generally be considered the equivalent of a “****Strong Buy****“.*\n\n*“B” rating:* ***Good.*** *The company’s stock has a good track record for delivering a balance of performance and risk. While the risk-adjusted performance of any stock is subject to change, our opinion is that this stock is a good value, with good prospects for outperforming the market. Although even good investments can decline in a down market, our “B” rating is considered the equivalent of a “****Buy****“.*\n\n**4.  Yahoo Finance  recommendation and target price**\n\nIt is required that the Yahoo Finance stock recommendation is at least mixed Buy/Hold from experts. Additionally, the predicted target price (average, from experts) should be at least 5% higher than the current one.\n\n**5. Piotroski F-Score**\n\nThe Piotroski score is a number between 0-9 that reflects nine criteria used to determine the strength of a company’s financial situation, including profitability, leverage or operating efficiency. Zero is the worst value and nine is the best. As we can read in[ Piotroski’s paper](https://pdfs.semanticscholar.org/9dc9/b030da18ab28d1e1a1bbf7e33fb5911f189e.pdf) from 2000:\n\n*In addition, an investment strategy that buys expected winners and shorts expected losers generates a* ***23% annual return*** *between 1976 and 1996, and the strategy appears to be robust across time and to controls for alternative investment strategies.*\n\nIt is required that the score is 4 or higher. The values were retrieved from https://www.gurufocus.com.\n\n**6. InvestorsObserver Overall Score**\n\nThe rank has a value in between 0 and 100. It takes into account both **technical** analysis and **fundamental** stock data. An Overall Rank of N means that a given company is rated above N% of stocks, therefore the higher the number, the better. My requirement is that the company has InvestorsObserver Overall score of at least 50.\n\n*The Overall Score combines our two technical scores (Short Term and Long Term) with our Fundamental Score into one metric. This makes our overall score a great place to start when evaluating stocks, regardless of your investing style.*\n\n*A low score doesn’t necessarily mean a stock is likely to go down, just that our system doesn’t think there’s much of a bullish case for it.*\n\nPlease note that the company profile data (short description) was taken from  tradingview (sometimes I shortened it) and dividend data was retrieved from MarketBeat.\n\nI hope you enjoyed the reading. What do you think about this stock selection and the strategy? Feel free to leave a comment below.\n\n*Michael*\n\n&amp;#x200B;\n\nDisclosures:\n\n* What you see here is my personal opinion, my own investments and should not be treated as investing advice\n* I’m an amateur investor",
        "subreddit": "investing",
        "title": "Six attractive stocks IMHO (AAPL AVGO CMCSA CRAI CVS JNJ). What do you think?",
        "url": "https://www.reddit.com/r/investing/comments/pgl6ia/six_attractive_stocks_imho_aapl_avgo_cmcsa_crai/",
        "created": 1630628492.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608199,
        "id": "pgnzpg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO EARNINGS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnzpg/avgo_earnings/",
        "created": 1630636999.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608116,
        "id": "pgnypx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnypx/avgo/",
        "created": 1630636916.0
    },
    {
        "author": "nikola28",
        "created_utc": 1631102830,
        "id": "pk96et",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Stocks making the biggest moves premarket: Coinbase, Tesla, Citrix PayPal and more",
        "url": "https://www.cnbc.com/2021/09/08/stocks-making-the-biggest-moves-premarket-coinbase-tesla-citrix-paypal-and-more.html",
        "created": 1631131630.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1631189072,
        "id": "pkwghj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Markets: Activist Fund Elliott Goes After Citrix, Again",
        "url": "https://www.thetechee.com/2021/09/markets-activist-fund-elliott-goes.html",
        "created": 1631217872.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1631189088,
        "id": "pkwgm9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Markets: Activist Fund Elliott Goes After Citrix, Again",
        "url": "https://www.thetechee.com/2021/09/markets-activist-fund-elliott-goes.html",
        "created": 1631217888.0
    },
    {
        "author": "nikola28",
        "created_utc": 1631102830,
        "id": "pk96et",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Stocks making the biggest moves premarket: Coinbase, Tesla, Citrix PayPal and more",
        "url": "https://www.cnbc.com/2021/09/08/stocks-making-the-biggest-moves-premarket-coinbase-tesla-citrix-paypal-and-more.html",
        "created": 1631131630.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1631189072,
        "id": "pkwghj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Markets: Activist Fund Elliott Goes After Citrix, Again",
        "url": "https://www.thetechee.com/2021/09/markets-activist-fund-elliott-goes.html",
        "created": 1631217872.0
    }
]