[
    {
        "author": "greensymbiote",
        "created_utc": 1625146568,
        "id": "oblzj8",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "Posting here to offer a little perspective on what some apes saw as a quick hype play.\n\nIt was evident that PSFE had finally found bottom last week after months of daily short attacks.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE long-term.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for the diamond handed apes who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\nhttps://preview.redd.it/1axvo1n3sl871.png?width=475&amp;format=png&amp;auto=webp&amp;s=ca4bb0678156d9737029ff6a3075728bd54e8940\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n&amp;#x200B;\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) see fintel or other source for institutional ownership. (bot mods won't allow link)\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)   [https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi](https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi)\n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "wallstreetbets",
        "title": "My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oblzj8/my_highconviction_bet_on_paysafe_psfe/",
        "created": 1625175368.0
    },
    {
        "author": "yewnique",
        "created_utc": 1625460971,
        "id": "oe041n",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "I know y’all are gambling addicts, and shy of throwing it all on green you need your fix. Canadian markets are open on July the 5th so you can buy yolo calls on Canadian versions of your favourite stocks. Canadian Energy, Canadian Tech, Literally BB, Canadian movie theatre, Canadian pharmaceuticals, Canadian pot. \n\n\nLet’s go, what’s your move? \n\nI’m pretty sure there’s a word count for discussions so to make sure I’m past it I’m going to just leave this:\n\nMark Hanna: Stay with me. We don’t create shit; we don’t build anything.\n\nJordan Belfort: No.\n\nMark Hanna: So if you got a client who brought stock at eight, and it now sits at sixteen, and he’s all fucking happy, he wants to cash it and liquidate and take his fucking money and run home. You don’t let him do that.\n\nJordan Belfort: Okay.\n\nMark Hanna: Cause that would make it real.\n\nJordan Belfort: Right.\n\nMark Hanna: No, what do you do? You get another brilliant idea, a special idea. Another situation, another stock to reinvest his earnings and then some. And he will, every single time. Cause they’re fucking addicted. And then you just keep doing this, again, and again, and again. Meanwhile, he thinks he’s getting shit rich, which he is, on paper. But you and me, the brokers?\n\nJordan Belfort: Right.\n\nMark Hanna: We’re taking home cold hard cash via commission, motherfucker.\n\nJordan Belfort: Right! That’s incredible, sir. I’m…I can’t tell you how excited I am.\n\nMark Hanna: You should be. There’s two keys to success in the broker business. First of all, you gotta stay relaxed.\n\nJordan Belfort: Yeah.\n\nMark Hanna: You jerk off?\n\nJordan Belfort: Do I…do I jerk off? Yeah. Yeah, I jerk off, yeah.\n\nMark Hanna: How many times a week?\n\nJordan Belfort: Like, uh…three…three, three, four…three or four times, maybe five.\n\nMark Hanna: You gotta pump those numbers up. Those are rookie numbers in this racket. I, myself, I jerk off at least twice a day.",
        "subreddit": "wallstreetbets",
        "title": "July 5th TSX Megathread: What are your moves?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oe041n/july_5th_tsx_megathread_what_are_your_moves/",
        "created": 1625489771.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625147803,
        "id": "obmdbu",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "It was evident that PSFE had finally found bottom last week.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE for a long time.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for investors with a longer view who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) [https://fintel.io/so/us/psfe](https://fintel.io/so/us/psfe).\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)  Global Capital link removed due to forbidden word in the url. \n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "stocks",
        "title": "Connecting the Dots: My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/stocks/comments/obmdbu/connecting_the_dots_my_highconviction_bet_on/",
        "created": 1625176603.0
    },
    {
        "author": "SavannahSmiles_",
        "created_utc": 1625513222,
        "id": "oeeelv",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "[https://finance.yahoo.com/news/10-biggest-hedge-fund-casualties-170206625.html](https://finance.yahoo.com/news/10-biggest-hedge-fund-casualties-170206625.html)\n\n **Usman Kabir Mon, July 5, 2021, 1:02 PM**\n\n* [**GME**](https://finance.yahoo.com/quote/GME?p=GME)**-0.75%**\n* [**BIDU**](https://finance.yahoo.com/quote/BIDU?p=BIDU)**-2.36%**\n* [**MA**](https://finance.yahoo.com/quote/MA?p=MA)**+1.17%**\n* [**AMZN**](https://finance.yahoo.com/quote/AMZN?p=AMZN)**+2.27%**\n* [**TSLA**](https://finance.yahoo.com/quote/TSLA?p=TSLA)**+0.14%**\n\nIn this article, we discuss the 10 biggest hedge fund casualties of Reddit WallStreetBets' short squeezes. If you want to skip our detailed analysis of these hedge funds, go directly to the [**5 Biggest Hedge Fund Casualties of Reddit WallStreetBets' Short Squeezes**](https://www.insidermonkey.com/blog/5-biggest-hedge-fund-casualties-of-reddit-wallstreetbets-short-squeezes-958146/)**.**\n\nHedge funds have suffered billions in losses this year in a fierce stock market showdown with retail investors on internet platforms like Reddit and Twitter over the past six months. These battles have usually centered around stocks that the hedge funds attempted to short-sell, inviting the wrath of users on Reddit forums like WallStreetBets, mostly comprising young investors, who bought up stakes in these companies to drive up the share price, initiating a short squeeze and making handsome profits in the process.\n\nSome of the firms involved in this saga include GameStop Corp. (NYSE: [GME](https://www.insidermonkey.com/insider-trading/company/gamestop%20corp/1326380/)), AMC Entertainment Holdings, Inc. (NYSE: [AMC](https://www.insidermonkey.com/insider-trading/company/amc%20entertainment%20holdings%20inc/1411579/)), ContextLogic Inc. (NASDAQ: [WISH](https://www.insidermonkey.com/insider-trading/company/contextlogic%20inc/1822250/)), and Clover Health Investments, Corp. (NASDAQ: [CLOV](https://www.insidermonkey.com/insider-trading/company/clover%20health%20investments%20corp%20de/1801170/)), among others. According to some media reports, hedge funds have suffered a total of $12 billion in losses in these short-selling schemes. Investment bank Goldman Sachs last year compiled an index of stocks that these retail investors favored. That index has doubled in value over the past few months.\n\nIn an analysis, released to clients earlier this month, the investment bank [highlighted](https://markets.businessinsider.com/news/stocks/stock-market-analysis-retail-investors-plowing-400-billion-into-stocks-2021-6) that the retail favorites index had beaten the overall market by three percentage points this month. The analysis also underlined that retail investor spending into equities was poised to rise to $400 billion this year, an increase of $50 billion from a previous estimate of $350 billion. Perhaps this is one reason why hedge funds have been actively monitoring the hype around certain companies on Reddit in order to better manage their risk profiles.\n\nThe battle, though, still looks to be far from over. According to Goldman Sachs, the retail investor boom in equities is just beginning. Hedge funds managers, like Andrew Left, who expected retail investors to jump ship and drive the price of shorted stocks down, have been left red-faced as the prices of these stocks — referred to as meme stocks — continues to soar higher. However, in addition to being active, these stocks have been some of the most volatile ones on the market, adding to the overall chaos in the market.\n\nThe entire hedge fund industry is feeling the reverberations of the changing financial landscape. Its reputation has been tarnished in the last decade, during which its hedged returns couldn’t keep up with the unhedged returns of the market indices. On the other hand, Insider Monkey’s research was able to identify in advance a select group of hedge fund holdings that outperformed the S&amp;P 500 ETFs by more than 124 percentage points since March 2017. Between March 2017 and February 26th 2021 our monthly newsletter’s stock picks returned 197.2%, vs. 72.4% for the SPY. Our stock picks outperformed the market by more than 124 percentage points (see the details here). We were also able to identify in advance a select group of hedge fund holdings that significantly underperformed the market. We have been tracking and sharing the list of these stocks since February 2017 and they lost 13% through November 16th. That’s why we believe hedge fund sentiment is an extremely useful indicator that investors should pay attention to. You can subscribe to our free newsletter on our homepage to receive our stories in your inbox. \n\nWith this context in mind, here is our list of the 10 biggest hedge fund casualties of Reddit WallStreetBets' short squeezes. These were ranked keeping in mind the overall losses, size of the hedge fund, and the market credence of the hedge fund manager. The hedge funds that suffered losses, either directly or indirectly, as a result of the short squeezes but did not shutter completely have also been included in this list.\n\n**Biggest Hedge Fund Casualties of Reddit WallStreetBets' Short Squeezes**\n\n**10. Citron Capital**\n\nAndrew Left, the editor of investment newsletter *Citron Research*, is one of the most famous short-sellers on the market. His hedge fund was one of the biggest losers in the GameStop Corp. (NYSE: GME) short squeeze. Citron is placed tenth on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets' short squeezes. Left took to video sharing website YouTube in January to [assure](https://www.youtube.com/watch?v=yS4yPsmaDDQ) investors in Citron Capital that he had made a mistake in predicting that GameStop Corp. (NYSE: GME) stock would lower in price.\n\nLeft clarified that Citron had managed to cover the short positions on GameStop Corp. (NYSE: GME) at a 100% loss, learning important lessons in the process. However, Left, in the video, said that he expected the stock of the video game retailer to return back to normal levels within a short span of time. This prediction has not aged well, as the stock is still trading at a high price, despite pulling back from record highs registered in January.\n\n**9.** [**Maverick Capital**](https://www.insidermonkey.com/hedge-fund/maverick-capital/17/)\n\nMaverick Capital is an investment firm run from Texas. It is placed ninth on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets' short squeezes. The hedge fund is run by Lee Ainslie and manages over $10 billion in assets. Earlier this month, *Financial Times* [reported](https://www.ft.com/content/dcd86860-09ed-420e-a5cc-d6d281863c03) that Maverick Capital was keeping track of the hype around certain stocks on Reddit forums in order to protect itself from short squeezes, lending credence to earlier reports that the hedge fund had suffered losses in the GameStop Corp. (NYSE: GME) saga at the turn of the year.\n\nMaverick Capital holds a large stake in Amazon.com, Inc. (NASDAQ: AMZN), the ecommerce retailer based in Washington. Out of the hedge funds being tracked by Insider Monkey, London-based investment firm [Citadel Investment Group](https://www.insidermonkey.com/hedge-fund/citadel+investment+group/44/) is a leading shareholder in Amazon.com, Inc. (NASDAQ: AMZN) with 3.3 million shares worth more than $10.5 billion.\n\nJust like GameStop Corp. (NYSE: GME), AMC Entertainment Holdings, Inc. (NYSE: AMC), ContextLogic Inc. (NASDAQ: WISH), and Clover Health Investments, Corp. (NASDAQ: CLOV), Amazon.com, Inc. (NASDAQ: AMZN) is one of the stocks to watch out for this year.\n\nIn its Q1 2021 investor letter, Hayden Capital, an asset management firm, highlighted a few stocks and Amazon.com, Inc. (NASDAQ: [AMZN](https://www.insidermonkey.com/insider-trading/company/amazon%20com%20inc/1018724/)) was one of them. [Here](https://www.insidermonkey.com/blog/is-amazon-com-amzn-a-great-investment-choice-943917/) is what the fund said:\n\n&gt;*“Amazon (AMZN): We sold our last remaining stake in Amazon this quarter. Amazon was our longest-running investment holding, after having originally purchasing it at the inception of Hayden in 2014, at a price of \\~$317.*  \n*I gave some details of how Amazon has progressed over these past 6.5 years in last year’s Q2 2020 letter, which partners can find here (LINK). The company has executed amazingly well over this tenure, with revenues up \\~3.3x and since our initial purchase, and reported operating income up \\~30x over that period.*  \n*Generally, I believe there are three reasons to sell an investment: 1) we recognize our initial thesis is wrong (sell out as quick as possible), 2) we have a significantly higher returning opportunity to redeploy the capital into (sell-down to fund the new investment), or 3) the company is maturing and hitting the top part of it’s S-curve / business lifecycle, so the business has fewer places to reinvest its capital internally. As such, the future returns will likely be lower than the past. This investment thus becomes a “source of capital” in the future, as we fund earlier-stage investment opportunities...\" (*[*Click here to view the full text*](https://www.insidermonkey.com/blog/is-amazon-com-amzn-a-great-investment-choice-943917/)*)*\n\n&amp;#x200B;\n\n **8.** [**Citadel Investment Group**](https://www.insidermonkey.com/hedge-fund/citadel-investment-group/44/)\n\nCitadel Investment Group is an investment management company registered in Chicago. It is ranked eighth on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets' short squeezes. The hedge fund is run by billionaire Ken Griffin and has a portfolio value of over $400 billion, one of the biggest in the world. Although the fund was not directly impacted by the Reddit-backed short squeeze, it did help arrange close to $3 billion in capital for Melvin Capital that had been hit hard by the short squeeze.\n\nOne of the top holdings of Citadel Investment Group is Tesla, Inc. (NASDAQ: TSLA), the California-based electric vehicle maker. Out of the hedge funds being tracked by Insider Monkey, Chicago-based investment firm[ Citadel Investment Group](https://www.insidermonkey.com/hedge-fund/citadel+investment+group/44/) is a leading shareholder in Tesla, Inc. (NASDAQ: TSLA) with 24.4 million shares worth more than $16.3 billion.\n\nJust like GameStop Corp. (NYSE: GME), AMC Entertainment Holdings, Inc. (NYSE: AMC), ContextLogic Inc. (NASDAQ: WISH), and Clover Health Investments, Corp. (NASDAQ: CLOV), Tesla, Inc. (NASDAQ: TSLA) is one of the stocks to watch out for this year.\n\nHere is what Baron Partners Fund has to say about Tesla, Inc. (NASDAQ: [TSLA](https://www.insidermonkey.com/insider-trading/company/tesla%20inc/1318605/)) in its Q1 2021 investor letter:\n\n&gt;*“Tesla, Inc. designs, manufactures, and sells fully electric vehicles, solar products, energy storage solutions, and battery cells. The stock fell during the quarter as a result of general market dynamics and a potential production slowdown due to parts shortages. A refreshed S/X and China Model Y ramp could also have a negative impact on margins in early 2021. We anticipate strong growth and improved margins driven by new production capacity, manufacturing efficiencies, localization of its manufacturing and supply chain, and maturation of Tesla’s full self-driving technology.*\n\n**7.** [**Candlestick Capital Management**](https://www.insidermonkey.com/hedge-fund/candlestick-capital-management/1231/)\n\nCandlestick Capital Management is a hedge fund headquartered in Connecticut. It is placed seventh on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets' short squeezes. The fund is run by Jack Woodruff and manages more than $4 billion in assets, according to latest filings. The fund was a big gainer in 2020, gaining a handsome 26% over the pandemic period, but suffered low to midteen percentage losses in the Reddit-backed short squeeze earlier this year, per a [report](https://www.wsj.com/articles/several-hedge-funds-stung-by-market-turmoil-11611842693) in business news publication *The Wall Street Journal*.\n\nCandlestick Capital Management has invested heavily in Mastercard Incorporated (NYSE: MA), the New York-based payments processing firm. Out of the hedge funds being tracked by Insider Monkey, Virginia-based investment firm [Akre Capital Management ](https://www.insidermonkey.com/hedge-fund/akre+capital+management/103/)is a leading shareholder in Mastercard Incorporated (NYSE: MA) with 5.8 million shares worth more than $2 billion.\n\nJust like GameStop Corp. (NYSE: GME), AMC Entertainment Holdings, Inc. (NYSE: AMC), ContextLogic Inc. (NASDAQ: WISH), and Clover Health Investments, Corp. (NASDAQ: CLOV), Mastercard Incorporated (NYSE: MA) is one of the stocks to watch out for this year.\n\nIn its Q4 2020 investor letter, Bretton Fund, an asset management firm, highlighted a few stocks and Mastercard Incorporated (NYSE: [MA](https://www.insidermonkey.com/insider-trading/company/mastercard%20inc/1141391/)) was one of them. [Here](https://www.insidermonkey.com/blog/should-you-buy-these-2-financial-services-stocks-before-its-too-late-922927/) is what the fund said:\n\n&gt;*“While consumers resumed much of their spending by summer, what and how they used their Visas and Mastercards changed. For obvious reasons, people shifted to contactless payments—one of the Covid-era changes we think is permanent—and replaced travel purchases with online shopping and food delivery. Consumers spent more on their debit cards and less on their credit cards; Visa and Mastercard make more per transaction on the latter. They also make more on cross-border transactions that come mostly from international travel, which ground to a halt early in the pandemic. Visa’s and Mastercard’s earnings per share fell by 7% and 16%, respectively, compared to their usual mid-teens growth. We’re not too worried, and we think they’ll catch up nicely in the post-vaccine world. Visa’s stock returned 17.1% and Mastercard’s 20.2%.”*\n\n**6.** [**Point72 Asset Management**](https://www.insidermonkey.com/hedge-fund/point72-asset-management/750/)\n\nPoint72 Asset Management is a Connecticut-based hedge fund. It is ranked sixth on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets' short squeezes. The fund is managed by Steven Cohen and is one of the biggest in the US, managing more than $21 billion in assets at the end of March, according to latest filings. *The New York Times* [reported](https://www.nytimes.com/live/2021/01/27/business/us-economy-coronavirus/point72-gamestop) in February that the fund lost 15% during the GameStop Corp. (NYSE: GME) short squeeze in January. The fund also helped finance a multi-billion dollar bailout for Melvin Capital this year.\n\nOne of the premier holdings of Point72 Asset Management is Baidu, Inc. (NASDAQ: BIDU), the Chinese technology company. At the end of the first quarter of 2021, 89 hedge funds in the database of Insider Monkey held stakes worth $6.5 billion in Baidu, Inc. (NASDAQ: BIDU), up from 51 in the preceding quarter worth $4.6 billion.\n\nJust like GameStop Corp. (NYSE: GME), AMC Entertainment Holdings, Inc. (NYSE: AMC), ContextLogic Inc. (NASDAQ: WISH), and Clover Health Investments, Corp. (NASDAQ: CLOV), Baidu, Inc. (NASDAQ: BIDU) is one of the stocks to watch out for this year.\n\nIn its Q1 2021 investor letter, Horos Asset Management, an asset management firm, highlighted a few stocks and Baidu, Inc. (NASDAQ: [BIDU](https://www.insidermonkey.com/insider-trading/company/baidu+inc/1329099/)) was one of them. [Here](https://www.insidermonkey.com/blog/heres-why-horos-asset-management-sold-its-baidu-bidu-stake-943425/) is what the fund said:\n\n&gt;*“We have also fully exited our stake in Baidu, following their outstanding performance during the period and their lower relative upside potential compared to other investment alternatives, which we will discuss below.*  \n*The Chinese technology platform company Baidu has also been held in the portfolios managed by Alejandro, Miguel and myself for several years. During this period, we have seen very high volatility in its share price, which we have taken advantage of to make significant rebalancing moves in our position (in fact, we even sold our entire position once, when we thought the stock’s upside potential was exhausted). After several years of instability, market sentiment turned very positive, putting an end to the historical advertising problems in the healthcare sector, the divestments in O2O (Online-to-Offline) businesses that continued to weigh on the company’s margins, the IPO of part of the iQiyi streaming business (which hid Baidu’s underlying cash generation capacity) and the tough competition from other industry giants such as Tencent and Alibaba, as well as the entry of new players with disruptive business models (ByteDance). At the same time, the company’s recent commitment to electric vehicles contributed even more to this change of narrative. Baidu’s share price rose almost fourfold from the March 2020 lows to all-time highs and reached a valuation where the margin of safety, in our view, was too narrow.”*\n\n **5.** [**D1 Capital Partners**](https://www.insidermonkey.com/hedge-fund/d1-capital-partners/1063/)\n\nD1 Capital Partners is a hedge fund managed from New York. It is placed fifth on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets’ short squeezes. The fund manages more than $13 billion in assets at the end of the first quarter of 2021. It is run by Dan Sundheim. News publication *Bloomberg* [claims](https://www.bloomberg.com/news/articles/2021-01-28/dan-sundheim-s-20-billion-d1-capital-loses-about-20-this-month) that the fund took a 20% hit in the short-selling saga involving GameStop Corp. (NYSE: GME) in January. D1 was one of the best-performing funds in 2020, finishing the year with a 60% gain and $20 billion in assets under management.\n\nD1 Capital Partners has invested a lot of money in Microsoft Corporation (NASDAQ: MSFT), the Washington based technology company that sells computer software and services. Out of the hedge funds being tracked by Insider Monkey, Washington-based investment firm [Fisher Asset Managemen](https://www.insidermonkey.com/hedge-fund/fisher+asset+management/11/)t is a leading shareholder in Microsoft Corporation (NASDAQ: MSFT)  with 23.9 million shares worth more than $5.6 billion.\n\nIn its Q1 2021 investor letter, Polen Capital, an investment management firm, highlighted a few stocks and Microsoft Corporation (NASDAQ: [MSFT](https://www.insidermonkey.com/insider-trading/company/microsoft%20corp/789019/)) was one of them. [Here](https://www.insidermonkey.com/blog/should-you-consider-investing-in-microsoft-msft-943062/) is what the fund said:\n\n&gt;“We have written extensively about Microsoft in recent commentaries. It was our leading contributor last year and one of our largest weightings within the Portfolio. It continues to experience business momentum through several dominant, essential, and competitively advantaged businesses, like Office 365 and Azure. The markets it competes for are enormous, which gives the company the ability to compound at scale. In the past quarter alone, the company generated over $40 billion in revenue, representing a 17% growth rate. The inherent operating leverage in Microsoft’s business model continues and led to 34% earnings growth this past quarter. Despite the broad rotation we saw in the first quarter and Microsoft’s robust performance in 2020, we think its business fundamentals continue to exhibit strength, and the stock continues to reflect the fundamentals.”\n\n **4.** [**Maplelane Capital**](https://www.insidermonkey.com/hedge-fund/maplelane-capital/546/)\n\nMaplelane Capital is an investment firm run from New York. It is ranked fourth on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets’ short squeezes. The hedge fund, run by Leon Shaulov, managed over $4 billion in assets. In late January, news publication *Bloomberg* [reported](https://www.bloomberg.com/news/articles/2021-01-27/hedge-fund-maplelane-loses-about-33-on-short-bets-this-month) that the fund had lost 33% in a single month after a failed attempt to short-sell GameStop Corp. (NYSE: GME) stock. However, the firm adjusted the short position before it took further losses as the share price of the video game retailer climbed because of Redditors. \n\nOne of the top investments of Maplelane Capital is Alphabet Inc. (NASDAQ: GOOG), the parent company of internet search engine Google. Out of the hedge funds being tracked by Insider Monkey, London-based investment firm [TCI Fund Management ](https://www.insidermonkey.com/hedge-fund/tci+fund+management/1356/)is a leading shareholder in Alphabet Inc. (NASDAQ: GOOG) with 2.9 million shares worth more than $6.1 billion. \n\nIn its Q1 2021 investor letter, [Artisan Partners](https://www.insidermonkey.com/institutional-investor/artisan-partners-limited-partnership/26598/), an asset management firm, highlighted a few stocks and Alphabet Inc. (NASDAQ: [GOOG](https://www.insidermonkey.com/insider-trading/company/alphabet%20inc/1288776/)) was one of them. [Here](https://www.insidermonkey.com/blog/artisan-partners-we-have-high-hopes-on-alphabet-goog-regarding-future-prospects-945976/) is what the fund said:\n\n&gt;“Large-cap tech companies have been resilient through the pandemic—Alphabet among them. A top contributor, Alphabet’s Play Store and Google Cloud are in demand as businesses accelerate online activity which, along with strong YouTube user growth, is helping stabilize temporarily weaker search ad revenue trends. Through the lens of our disciplined bottom-up research process, we view Alphabet as one of the best businesses in the world, capable of expanding revenues at a rapid rate for years to come, with a bullet proof balance sheet and an average asking price. It’s a name we’ve owned since 2012 and for which we continue to have high hopes regarding future prospects.”\n\n **3.** [**Light Street Capital**](https://www.insidermonkey.com/hedge-fund/light-street-capital/552/)\n\nLight Street Capital is an investment company headquartered in California. It is placed third on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets’ short squeezes. The hedge fund is a high-profile casualty to the GameStop Corp. (NYSE: GME) short-selling scheme that failed as Redditors squeezed short-sellers. Light Street Capital, according to *Financial Times*, [managed](https://www.ft.com/content/ca1090ba-c3aa-446c-8406-7ce0e01bb510) over $3 billion in assets at the start of the year. This figure has since fallen to $1.8 billion, with losses primarily driven by short-selling attempts in January and May.\n\nOne of the biggest holdings of Light Street Capital is Facebook, Inc. (NASDAQ: FB), the California-based technology company that just crossed $1 trillion in market cap. At the end of the first quarter of 2021, 257 hedge funds in the database of Insider Monkey held stakes worth $40 billion in Facebook, Inc. (NASDAQ: FB), up from 242 in the preceding quarter worth $38 billion. \n\nIn its Q1 2021 investor letter, [ClearBridge Investments](https://www.insidermonkey.com/institutional-investor/clearbridge-investments-llc/44201/), an asset management firm, highlighted a few stocks and Facebook, Inc. (NASDAQ: [FB](https://www.insidermonkey.com/insider-trading/company/facebook%20inc/1326801/)) was one of them. [Here](https://www.insidermonkey.com/blog/is-facebook-fb-a-good-stock-to-invest-in-947954/) is what the fund said:\n\n&gt;“We continued to keep our learnings from 2020 in mind during the quarter as we sought to increase the up capture of the portfolio. We also made adjustments to the portfolio’s top 10 holdings to increase the participation of select stocks, including Facebook, while trimming our weighting to stable names, which now represent 47% of the portfolio. Our repositioning has been encouraging so far with the portfolio performing better on up days in the market while maintaining good down capture during more turbulent sessions.”\n\n **2.** [**Melvin Capital Management**](https://www.insidermonkey.com/hedge-fund/melvin-capital-management/804/)\n\nMelvin Capital Management is a hedge fund that operates from New York. It is ranked second on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets’ short squeezes. The fund took heavy losses as it tried to short-sell GameStop Corp. (NYSE: GME) in January. According to a [report](https://www.cnbc.com/2021/01/27/hedge-fund-targeted-by-reddit-board-melvin-capital-closed-out-of-gamestop-short-position-tuesday.html) by news publication *CNBC*, the fund, managed by Gabriel Plotkin, and with more than $17 billion in assets under management at the end of the first quarter of 2021, was given a bailout worth $3 billion by billionaires Ken Griffin and Steve Cohen in January. \n\nA top holding of Melvin Capital Management is Expedia Group, Inc. (NASDAQ: EXPE), the Wasington-based online travel firm. At the end of the first quarter of 2021, 86 hedge funds in the database of Insider Monkey held stakes worth $6.1 billion in Expedia Group, Inc. (NASDAQ: EXPE), up from 76 in the previous quarter worth $6.5 billion.\n\nIn its Q1 2021 investor letter, [ClearBridge Investments](https://www.insidermonkey.com/institutional-investor/clearbridge-investments-llc/44201/), an asset management firm, highlighted a few stocks and Expedia Group, Inc. (NASDAQ: [EXPE](https://www.insidermonkey.com/insider-trading/company/expedia%20group%20inc/1324424/)) was one of them. [Here](https://www.insidermonkey.com/blog/should-you-consider-investing-in-expedia-expe-946679/) is what the fund said:\n\n&gt;“Several of our better performers in the first quarter were purchased while their business models were under stress from COVID restrictions or the macro environment the pandemic created. What gave us confidence in purchasing Expedia were the actions the company took to extend out their balance sheets until travel resumed. It should benefit as a broader vaccination rollout prompts cruise lines to resume operations and consumers to start traveling again and are positioned to deliver better margins and gain pricing power as the economy normalizes due to the cost controls implemented during the downturn.”\n\n **1.** [**White Square Capita**l](https://www.insidermonkey.com/hedge-fund/white-square-capital/1020/)\n\nWhite Square Capital is a London-based investment management firm. It is placed first on our list of 10 biggest hedge fund casualties of Reddit WallStreetBets’ short squeezes. The firm recently announced that it was closing the main fund and would return capital to investors, according to a [report](https://www.ft.com/content/397bdbe9-f257-4ca6-b600-1756804517b6) published by news publication *Financial Times*. This follows the firm taking in double-digit percentage losses in a short-selling attempt involving GameStop Corp. (NYSE: GME) at the beginning of this year. The fund managed more than $400 million in assets at peak.\n\nOne of the top holdings of White Square Capital is The Walt Disney Company (NYSE: DIS), the mass media and entertainment firm based in California. At the end of the first quarter of 2021, 134 hedge funds in the database of Insider Monkey held stakes worth $12.5 billion in The Walt Disney Company (NYSE: DIS), down from 144 in the preceding quarter worth $16.4 billion. \n\nIn its Q4 2020 investor letter, [Harding Loevner](https://www.insidermonkey.com/institutional-investor/harding-loevner-lp/331/), an asset management firm, highlighted a few stocks and The Walt Disney Company (NYSE: [DIS](https://www.insidermonkey.com/insider-trading/company/walt%20disney%20co/1744489/)) was one of them. [Here](https://www.insidermonkey.com/blog/harding-loevner-on-walt-disney-dis-theres-fight-left-in-this-old-dog-929397/) is what the fund said:\n\n&gt;“One of the original constituents of the Nifty Fifty holds a place in our portfolio today. When we bought Disney three years ago, we wrote that “we view Disney theme parks in the US, Europe, and China as resistant to online substitution.” We did not reckon on a pandemic, which closed all of them, and sent all of usto our couches. Disney, however, wasready for us, brilliantly illustrating the importance of management foresight and change management. Or, as Louis Pasteur said, “chance favors the prepared mind.  \nA century after its founding in 1923, Disney is in the middle of a bold shift from its legacy media networks &amp; entertainment model—with cable TV, theme parks, and theater films dominating its earnings—to a direct-to-consumer streaming media model. The keys to Disney’s transition: matchless storytelling, coupled with financial strength. The company reliably creates content that people all over the world are eager to consume. It also hastened spending on original content to attract subscribers to its new streaming platform. These factors have allowed Disney to weather the pandemic having expanded its direct engagement with customers. Such connections yield a rich harvest of insights used to customize offerings on a mass scale, reinforcing that engagement in a virtuous circle and thereby raising the lifetime value of each customer. Subscribers to Disney+ reached 86.8 million one year after launch, compared to the 60 – 90 million management projected to reach in 2024. To be sure, Netflix, Apple, and Amazon remain formidable competitors in new-era streaming entertainment (mind what we said about everyone standing up at once), but there’s fight left in this old dog.” ",
        "subreddit": "StockMarket",
        "title": "10 Biggest Hedge Fund Casualties of Reddit WallStreetBets’ Short Squeezes",
        "url": "https://www.reddit.com/r/StockMarket/comments/oeeelv/10_biggest_hedge_fund_casualties_of_reddit/",
        "created": 1625542022.0
    },
    {
        "author": "xShaqOfficial",
        "created_utc": 1625437117,
        "id": "oduc2g",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Evening everyone,\n\nI've recently been getting back into the market. For now, I'm utilizing a stock simulator instead of my real account, which has been out of commission for a while. This time, I want to come in with a different style of investing, I've been looking into some equity analyses on a few blue chips along with a couple focus lists from Wells Fargo and Edward Jones. My timeframe isn't long term at all, I'm looking at exiting my positions 8-12 months from July. \n\nI'd like some advice and insight on the price targets I've set for these tickers:\n\n**Total Capital** \\- $4 000 000.00 (Virtual)\n\n**Max Per Position** \\- $571 428.50\n\n**PTs:** \n\n* Canadian Pacific Railway Ltd (CP) - **$80.30**\n* Keysight Technologies Inc (KEYS) - **$160.15**\n* Chevron Corporation (CVX) - **$113.11**\n* CGI Inc (CGI) - **$96.14**\n* Southwest Gas Holdings Inc (SWX) - **$71.14**\n* Omnicom Group Inc. (OMC) - **$88.10**\n* Verizon Communications Inc. (VZ) - **$61.53**\n\nHere are the focus lists for anyone interested: [Wells Fargo](https://saf.wellsfargoadvisors.com/emx/dctm/Research/ASG/Focus_Portfolio/opn_focus_client.pdf) [Edward Jones](https://www.edwardjones.com/sites/default/files/acquiadam/2021-07/stock-table.pdf)\n\nLet me know if you think these targets are accurate and any thoughts,\n\nCheers!",
        "subreddit": "stocks",
        "title": "Are my price targets accurate?",
        "url": "https://www.reddit.com/r/stocks/comments/oduc2g/are_my_price_targets_accurate/",
        "created": 1625465917.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625145621,
        "id": "oblp63",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Posting here to offer a little perspective on what some apes saw as a quick hype play.\n\nIt was evident that PSFE had finally found bottom last week after months of daily short attacks.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE long-term.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for the diamond handed apes who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\nhttps://preview.redd.it/2tce80abpl871.png?width=475&amp;format=png&amp;auto=webp&amp;s=32e78dde014d5edf387cd4f9f603fceb6ab6c4c7\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n&amp;#x200B;\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) [https://fintel.io/so/us/psfe](https://fintel.io/so/us/psfe).\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)   [https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi](https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi)\n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "wallstreetbets",
        "title": "My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oblp63/my_highconviction_bet_on_paysafe_psfe/",
        "created": 1625174421.0
    }
]