[
    {
        "author": "ThinRedLine87",
        "created_utc": 1617039666,
        "id": "mfuz84",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "First off, I am not giving you advice. I'm not a financial advisor, nor do I work in the pharma industry. I'm just sharing some research I did, and I'm open to all feedback and comments. Additionally (in full disclosure) based on what I found, I'm holding 450 shares because I'm still afraid of options.\n\nLets start off with some TLDR for the bullish thoughts and bearish thoughts.\n\nBullish points:\n\nBased on fairly conservative COGS I have a share target of $19, but if that turns out to be overly conservative a more realistic value could easily push the share target to $24-$30. These values also assume fairly conservative adoption among the patient pool. The recent injection of liquidity also gives them plenty of runway to start cashing in on a fully approved drug (Orladeyo). Additionally none of this accounts for their developmental drug (BCX9930) at all which [has been racking up some big wins in clinical trials fairly recently](https://www.reddit.com/r/wallstreetbets/comments/mckprn/bcrx_biocrysts_factor_d_inhibitor_bcx9930_hit_it/?utm_source=share&amp;utm_medium=web2x&amp;context=3) and could push this to another level entirely. Considering that their Orladeyo drug on its own would support nearly double the current share price this makes a 10$ entry point fairly attractive with a potential bonus moonshot if BCX9930 takes off.\n\nBearish points:\n\nDespite being approved, the rate of adoption of Orladeyo could take years to secure my estimated market share (I cant find any data to help estimate adoption rates). Drug trials can be a shot in the dark, and while currently there is no bad news regarding their up and coming drug BCX9930, a bad result would certainly draw enough negative sentiment to tank the price, despite Orladeyo easily supporting a share price of 19$ on its own. Additionally BCX9930 will need to complete trials for all of the numerous diseases they plan to market it for. Those trials will cost time and money and drag out for years. Lastly drug prices are in the focus of media pressure in the US which could likely have a negative impact on the pharma industry as a whole.\n\nNow for the details. I'm going to talk through Liquidity, Revenue estimates, Cost estimates, and eventually arrive at my price target estimates. Lastly I'll speculate on some risks.\n\n* Liquidity: In the 3rd quarter, they lost around 45M and had around 150M cash.  In Dec., they secured an additional 325M in liquidity (200M as a line of credit, and 125M as a 1-time gain which results in them paying a royalty on Orladeyo).  They have plenty of liquidity.  \n* Revenue:  they have 2 drugs that I consider material.  Orladeyo which was approved in US and Japan, and is about to be approved in Europe.  BCX9930 which is far from approval in all but 1 disease in the US.    \n\n   * Orladeyo is the only oral treatment for a rare disease known as HAE.  \n   * Orladeyo will likely be sold for around 300000 per patient per year.  Biocryst set a price for sales in US of 485000, and will likely be sold for less in Europe, but I figure it averages 300000.  This price might sound obscene but is actually cheaper then its competition Takhzyro and Haegarda, which cost over 500000 per year.  \n   * Orladeyo was actually only 30-44% effective in reducing HAE attacks, whereas Takhzyro and Haegarda are both around 80% effective.  However, Orladeyo is the only oral medication while Takhzyro and Haegarda both require injections.  The keys to Orledeyo are that it is a much more convenient and less invasive treatment, and despite its seemingly low effectiveness, it turns out that 50% of patients had a 70% reduction in attacks (while the other 50% probably saw little or no benefit, averaging to 30-44%).  \n   * Also, in Biocryst's 3rd quarter conference call, management discussed a survey that they conducted, and found that about half of patients receiving injection treatments would consider switching to Orladeyo.  Since Orladeyo is effective in half of patients, and half of patients would consider switching, I conclude that Orladeyo could likely secure roughly a 25% market share\n   * There are 7500 patients in US and 6500 in Europe.  If I conservatively assume 20% market share, their revenue would be .2\\*14000\\*300000=840M.  FYI, their guidance is \"north of 500M\".  \n   * For sales in Japan, Biocryst made a deal with a pharma company called Torii.  Torii will sell Orladeyo in Japan and pay a royalty to Biocryst of between 20-40%, which will amount to around 15M in royalty revenue for Biocryst.  \n* Costs  \n\n   * After looking at various income statements, it looks like cost-of-goods-sold is generally 15-33% in the pharma industry.  I'll conservatively assume 33% for Orladeyo.  Gross profit is 840M\\*.67 + 15M royalties=575M\n   * In the [4th quarter](https://ir.biocryst.com/node/22286/pdf) they had 605000 in product sales (100000 was Orladeyo).  COGS was only 33000.  It's unclear how much of this COGS is attributable to Orladeyo or how much noise there is due to revenue still being so small, but 33000/605000 implies a COGS of just 5.5%.  This leads me to think my 33% assumption may be high.  If COGS turns out to be 25%, then gross profit would be 645M.   If COGS turns out to be 16%, then gross profit would be 715M.  I can't imagine COGS being any lower (otherwise the drug wouldn't cost 485000).  \n   * As a result of securing additional liquidity, Biocryst will pay a royalty of 8.75% on the first 350M of sales, then 2.75% on sales between 350M and 550M, then 0 thereafter.  This amounts to a maximum annual royalty expense of 350\\*8.75% + 200\\*2.75% = 36M\n   * SG&amp;A + R&amp;D + interest expenses were 50M in 3rd quarter, and increased to 62M in the 4th quarter.  They said they had infrastructure set up to market/distribute Orladeyo so I imagine SG&amp;A won't increase much, but R&amp;D will likely increase to fund further research of BCX9930 as well as other drugs.  I'll assume these expenses rise to 75M per quarter, or 300M annually.  \n* Based on these assumptions that leaves profit of 575M - 36M - 300M = 239M.  Again, COGS is a major unknown in my model, but profit could be as large as 309M (in my 25% scenario) or 379M (in my 16% scenario)\n* Share count was 176M in 3rd quarter, and increased from 110M last year.  I'll assume risk of further dilution to 200M.  \n* EPS is 239/200=1.19.  I estimate a $19 share price based on P/E of 16 and COGS of 33% (This improves to $24 and $30 share prices in my 25% or 16% COGS scenarios respectively, both of which are more realistic than a conservative 33%).  **This is** ***before*** **considering the BC.0X9930 drug, which actually seems to be their primary asset.**  I did not see any revenue estimates for BCX9930.  But lets look at what we do know:  \n\n   * 9930 is already close to approval to treat PNH in the US (here is some great [DD thats focused more on this new drug](https://www.reddit.com/r/wallstreetbets/comments/mckprn/bcrx_biocrysts_factor_d_inhibitor_bcx9930_hit_it/?utm_source=share&amp;utm_medium=web2x&amp;context=3) from [u/BIO9999](https://www.reddit.com/user/BIO9999/)), but there would only be around 300 patients in the US.  I found a presentation on Biocryst's [IR page](https://ir.biocryst.com/static-files/41ee0771-0acc-479e-a39e-2842101c6aa9) that listed other diseases that 9930 could treat, and I googled the prevalence of each in the US:   \n\n      * aHUS - 600\n      * ANCA vasculitis - 6000\n      * Lupus nephritis - 12000\n      * IgAN vasculitis - 66000\n      * glomerulonephritis - inconclusive\n      * primary membranous nephropathy - 3000\n      * IgA nephropathy - 7500\n   * It's unclear how many of these patients would need treatment with 9930 or what the price of 9930 would be, but there seems to be a **huge opportunity for 9930 to easily double my revenue/profit forecasts**.  This revenue is many years and many clinical trials away though, and may eventually face competition from other drugs, so I didn't include it in my analysis.  \n* Risks:  (1) I did not consider corporate tax on their profit (though they probably won't pay much tax due to years of losses to carry forward).  (2) I've seen politicians tweet about obscene drug prices, and the bad press/political pressure may cause price reductions and instantly hurt the share price.  (3) According to Seeking Alpha, analyst consensus revenue estimates are only 56.8M in 2021 and 144M in 2022 (as opposed to my long-term estimate of 855M).  It seems it might be some time before they reach my revenue targets.  \n* Again, I'm not that familiar with the pharma industry so I'm not really sure what will happen with COGS, R&amp;D, or SG&amp;A, but I tried to be conservative.  I never thought I would consider a pharma stock, but this really looks good around 10.  Thoughts?  \n\nSupporting Info:\n\n[Q4 Financial Results](https://ir.biocryst.com/node/22286/pdf)\n\nAdditional BCRX DD:\n\n[https://www.reddit.com/r/wallstreetbets/comments/mckprn/bcrx\\_biocrysts\\_factor\\_d\\_inhibitor\\_bcx9930\\_hit\\_it/](https://www.reddit.com/r/wallstreetbets/comments/mckprn/bcrx_biocrysts_factor_d_inhibitor_bcx9930_hit_it/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/mcghx5/revival\\_of\\_a\\_company\\_wall\\_st\\_believed\\_to\\_be\\_a/](https://www.reddit.com/r/wallstreetbets/comments/mcghx5/revival_of_a_company_wall_st_believed_to_be_a/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/mckt2y/bcrx\\_big\\_pharma\\_assassin\\_bcx9930\\_to\\_jump\\_from/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/wallstreetbets/comments/mckt2y/bcrx_big_pharma_assassin_bcx9930_to_jump_from/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "subreddit": "wallstreetbets",
        "title": "Biocryst ($BCRX) continues to remain undervalued",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mfuz84/biocryst_bcrx_continues_to_remain_undervalued/",
        "created": 1617068466.0
    },
    {
        "author": "Neblos",
        "created_utc": 1617215007,
        "id": "mhcb0z",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Heads up apes, Ubiquiti (ticker: UI) is about to take it up the tendie hole from shorts. They are a manufacturer of internet of things devices like routers, video recorders, and cameras. There was a security breach in January that was severely downplayed and suppressed, and now a whistleblower has alerted European regulatory bodies. From the article and another post on the system admin subreddit:\n\n&gt;“The breach was massive, customer data was at risk, access to customers’ devices deployed in corporations and homes around the world was at risk.”  \n&gt;  \n&gt;**“They were able to get cryptographic secrets for single sign-on cookies and remote access, full source code control contents, and signing keys exfiltration,” Adam said.**  \nSuch access could have allowed the intruders to remotely authenticate to countless Ubiquiti cloud-based devices around the world. According to its website, Ubiquiti has shipped more than 85 million devices that play a key role in networking infrastructure in over 200 countries and territories worldwide.\n\nThe money quote:\n\n&gt;Adam says Ubiquiti’s security team picked up signals in late December 2020 that someone with administrative access had set up several Linux virtual machines that weren’t accounted for.  \n&gt;  \n&gt;“Ubiquiti had negligent logging (no access logging on databases) so it was unable to prove or disprove what they accessed, but the attacker targeted the credentials to the databases, and created Linux instances with networking connectivity to said databases,” Adam wrote in his letter. “Legal overrode the repeated requests to force rotation of all customer credentials, and to revert any device access permission changes within the relevant period.”\n\n[\\^Article in question](https://krebsonsecurity.com/2021/03/whistleblower-ubiquiti-breach-catastrophic/)\n\nAnd now, a law firm that specializes in securities litigation has just opened a case against them. [Article here.](https://www.yahoo.com/entertainment/shareholder-alert-ubiquiti-inc-investigated-184800904.html) Supposedly Ubiquiti was the real target in the AWS hack a while back. Anyone remember that story of a casino's mainframe being hacked [through a smart thermometer on a fishtank?](https://www.washingtonpost.com/news/innovations/wp/2017/07/21/how-a-fish-tank-helped-hack-a-casino/) Well, this is a hack that was apparently much more invasive (infiltrated all S3 data buckets, all application logs, all databases, all user database credentials, and secrets required to forge single sign-on (SSO) cookies) and this is a company that manufactures *security cameras and routers*. If a smart thermometer could get dataframe access at a casino, imagine the damage that could be done here to any business with a Ubiquiti product hooked into their network. I'm not saying they haven't patched up a good portion of the breach, but at this point it's hard to tell what else might be compromised if they swept it under the rug this long. Anyone smoothbrains smarter than me please feel free to explain in more depth.\n\nUbiquiti has dropped 15% on the day and this news has not hit mainstream networks or media yet, just a system security blog and a small Yahoo Finance alert. If this gets any more publicity, or there is any major updates with he litigation, this thing might see a 50% drop like SolarWinds did during their hack which I expect to play out over next couple trading days into next week. \n\nPuts have gotten more expensive, but personally I'm in. Buying puts $240 Apr 16 and May 21. Companies that have this level of security incompetence and are this negligent towards their customers don't deserve to be valued like this. Let's bring this thing up (down?) to the moon.",
        "subreddit": "wallstreetbets",
        "title": "Ubiquiti Security Breach and Short Opportunity",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhcb0z/ubiquiti_security_breach_and_short_opportunity/",
        "created": 1617243807.0
    },
    {
        "author": "DeerLegal",
        "created_utc": 1616948887,
        "id": "mf470p",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "\nMy previous post’s theories were ¼ right, but it was missing something extremely important. That being *Add Liquidity Only orders* and Supplemental Liquidity Providers (SLP) which explains:\n\n1. Why we see huge “volume” pop up on TD TOS for GME\n2. Why we see huge “volume” pop up on TD TOS for other stocks\n3. Why we see it in the “volume” column with no buy/sell orders lodged against it\n4. Why this “volume” **can’t** be used to calculate short interest, potential prices or whatever other\n\nThe middle two being points where people still had questions around and the latter other posters speculating and using them incorrectly (nothing wrong with that, this sub is about improving all our analysis when new information is found!).\n\nNow, this will be a long read which is why I'm trying to get it out on a Sunday for people to consume and take it in before the market opens.\n\nThanks to u/SmithEchoes for collaborating with me on this DD.\n\n\\---------------------------------------------------------------\n\nLet’s get into it!\n\nThe same assumption regarding NYSE Chicago being a sandpit for Shitadel and co remains the same from my [previous post](https://www.reddit.com/r/GME/comments/mdnph0/more_proof_the_115_billion_buy_order_was_real_and/).\n\nLet’s recap what we saw in terms of order behaviour on this exchange over the past 6 months.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y3jcvaeczrp61.png?width=512&amp;format=png&amp;auto=webp&amp;s=2d9eab1540ec5bd37c5f940cc5a4a63e986f9896\n\nWe saw volume shift **away** from *Limit Non-Routable IOC* to:\n\n1. IOC ISO\n2. Limit Non-displayed\n3. Add Liquidity Only (ALO)\n\nThese three order types are the keys to the puzzle we’ve been needing, to figure out their strategy to manipulate GME prices. So let’s start off by getting an understanding of what they are!\n\nBare with the explanations, pretty graphs, charts and some pretty mind boggling conclusions lay beyond the order type explanations.\n\n# \n\n# IOC ISO (Immediate or Cancel Intermarket Sweep Order)\n\nFor those who have not read my previous post find an excerpt below.\n\n[Intermarket sweep order](https://ibkr.info/article/1734)’s are generally a large quantity order that is sent to **multiple exchanges**.This is how it functions:\n\n* An order is submitted in the pre market to sell at a price of 40.80 and is sent to exchange A.\n* The best offer price on exchange A is 40.63.\n* Exchange B receives an intermarket sweep order to buy 800 shares of the stock at a limit price of 40.88.\n* The best offer price on exchange B is 40.88\n\n*The trader that enters the intermarket sweep order would be required to fulfill their Regulation NMS requirement by executing the maximum available quantity on exchange A at 40.63 and then may execute the balance of the order on exchange B at 40.88 even though it is at a price that is inferior to the 40.80 order resting in the book on exchange A. The 40.80 price is not the inside quote and is therefore not \"protected\" in terms of the balance of the sweep order executing at exchange B at a price of 40.88.*\n\n**So in monke speak**, it fills the lowest alternate exchange price before filling the order at the higher price.\n\nTo make it more complicated this is an order with a modifier (ISO is the modifier), so let’s understand an IOC.\n\nThese are orders which attempt to execute immediately and cancel any unfilled portion. E.g. place a buy for 10 u/180, it’s only able to be filled to a portion of 5 u/180 and then canceled straight away.\n\nA key part to these types of orders is derived from the following.\n\n*\"The intermarket sweep exception enables trading centers that receive sweep orders to execute those orders immediately, without waiting for better priced quotations in other markets to be updated.\"*\n\nThis is [derived from a response](https://www.sec.gov/comments/sr-nyse-2014-32/nyse201432-2.pdf) to change how ALOs work by the NYSE, as they’ve been a thorn in their side since 2014. A prelude to what we’ll go into later. Sounds suspicious right?\n\n*\\*nudge nudge\\* Almost like they’d be handy for HFTs \\*nudge nudge\\**\n\n# \n\n# Limit Non-displayed\n\nAn order to buy or sell stock at or better than a specified price, these orders are HIDDEN from us apes and others. They also don’t care about [lock or cross situation](https://www.investopedia.com/terms/l/lockedmarket.asp) cases. Refer to [previous post](https://www.reddit.com/r/GME/comments/mdnph0/more_proof_the_115_billion_buy_order_was_real_and/) for and understanding on this.\n\nThis means the HFT (high frequency traders) can effectively jump the line by posting [“hide not slide”](https://docs.google.com/document/d/1QmoFpdq9HeGJ-cdPP7y808uWxVufJNr2b69J0GY_-SQ/edit?usp=sharing) orders instead of visible orders. **This is because a hidden order will not be slidden, resetting the timestamp**. So if i placed an order at $120.01 for GME, they then place a hidden order for $120.01 as well, I get my timestamp reset as i’ve placed a locked/cross order, but the hidden order does not get their timestamp reset therefore essentially skipping the fucking line.\n\nYet another bread and butter tool when it comes to HFT. The key here though is the fact that it’s HIDDEN and how this plays out with ALO order types (IB allows retail to place these orders as well).\n\n# \n\n# Add Liquidity Only (ALO)\n\nFirst of all, major thanks to u/SmithEchoes on this bad boy as it’s a complicated beast.\n\nNow this order type is a doozy, and is currently being used for nefarious purposes.\n\nALO follows a strict “If,then” rule set based on if it locks [(7.31(e)(2)(b)iii-iv)](https://nyseguide.srorules.com/rules/document?treeNodeId=csh-da-filter!WKUS-TAL-DOCS-PHC-%7B4A07B716-0F73-46CC-BAC2-43EB20902159%7D--WKUS_TAL_19401%23teid-37) **OR** crosses [(7.31(e)(2)(b)ii)](https://nyseguide.srorules.com/rules/document?treeNodeId=csh-da-filter!WKUS-TAL-DOCS-PHC-%7B4A07B716-0F73-46CC-BAC2-43EB20902159%7D--WKUS_TAL_19401%23teid-37).  This rule set forces the ALO to perform these trades until it is fully consumed, or the order is canceled.  Rule [7.31(e)(2)(C)](https://nyseguide.srorules.com/rules/document?treeNodeId=csh-da-filter!WKUS-TAL-DOCS-PHC-%7B4A07B716-0F73-46CC-BAC2-43EB20902159%7D--WKUS_TAL_19401%23teid-37), once ALO is resting on the exchange **AND** it was forced to change its price in accordance with [7.31(e)(2)(b)i-iv](https://nyseguide.srorules.com/rules/document?treeNodeId=csh-da-filter!WKUS-TAL-DOCS-PHC-%7B4A07B716-0F73-46CC-BAC2-43EB20902159%7D--WKUS_TAL_19401%23teid-37) **THEN** it now gets to be priced in accordance with [7.31(e)(1)(A)iii and iv](https://nyseguide.srorules.com/rules/document?treeNodeId=csh-da-filter!WKUS-TAL-DOCS-PHC-%7B4A07B716-0F73-46CC-BAC2-43EB20902159%7D--WKUS_TAL_19401%23teid-37). This is the equivalent of HFT when ALO “activates” BUT it comes with a built in safety feature that IF the price goes UP(Sell ALO) or DOWN (buy ALO) the ALO limit price is no longer locking or crossing at the values it was getting moved to, it **REVERTS** back to its original limit order price.\n\n**Monke speak translator:** These orders create sell/buy walls that have a nifty function that essentially “flips the safety switch” back to the original limit order price if too much buy/sell pressure is applied.\n\nFunnily enough, the NYSE has tried to [amend how ALO orders work](https://www.federalregister.gov/documents/2014/10/16/2014-24547/self-regulatory-organizations-new-york-stock-exchange-llc-nyse-mkt-inc-order-approving-proposed-rule), because of how they can be used for nefarious purposes…. *\\*cough\\* Shitadel \\*cough\\** The amendment would force to cancel the ALO once it crosses or locked, and not perform how it currently does in accordance with [7.31(e)(2)(b)i-v](https://nyseguide.srorules.com/rules/document?treeNodeId=csh-da-filter!WKUS-TAL-DOCS-PHC-%7B4A07B716-0F73-46CC-BAC2-43EB20902159%7D--WKUS_TAL_19401%23teid-37). Which means no buy/sell wall capability for them to use and abuse.\n\nThe last thing we needa talk about are mother fucking SLPs. This ain’t an order type but it’ll clear up many questions. We’ll then get into analysing price action after this (the fun part).\n\n# \n\n# SLP (Supplemental Liquidity Providers)\n\nGuess who can be a [SLP](https://www.nyse.com/markets/liquidity-programs)? That’s right. Market Makers.\n\nOur friend, Shitadel is a SLP.\n\nSLPs are pretty simple to understand. They are market participants that use HFT to create high volume on exchanges in order to add liquidity to the markets. This is all done to create *tight spreads*.\n\nSLPs such as Shitadel can artificially create liquidity in the market through **explosively shitting out volume** through the use of HFT methods. **This is important.**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jpucmp5fzrp61.png?width=510&amp;format=png&amp;auto=webp&amp;s=1d95d29d66122b4c7702e4b0e8af26e7513415d0\n\nBecause GME liquidity has been drying up bit by bit since January-2021, Shitadel and co need to use their position as an SLP to manipulate GMEs price as us apes are hodling.\n\nThe whole premise of market makers is to remain neutral and to make money through scraping cents of cents off the spread, therefore not directionally affecting the price. However, if i’m on my last legs and feel like doing something illegal, I can use a mixture of the order types above in combination with SLP to manipulate GME at my will.\n\n# \n\n# SLP and Our Beloved TD TOS “Errors”\n\nLet’s clear up this TD TOS situation once and for all as I’m HIGHLY certain this is exactly what we’re seeing.\n\nAs we’ve said above, Shitadel and co can explosively shit volume into the market. This is exactly what we’re seeing flow through TOS.\n\n**Myth 1. “BuT iT IsN’T BuY oR sELl”**\n\n**It’s neither a sell or a buy because it’s both**. Which is why we see no buy orders or sell orders in TOS in the example below. It’s also why we can’t project prices using it, so any post you see trying to do that to justify the value of GME, it’s just not true as not all of it needs to be executed. Apologies.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/m3a2sgxgzrp61.png?width=632&amp;format=png&amp;auto=webp&amp;s=6a6b8d5a088a836db8fcb5c5da0008b78e548d05\n\n**Myth 1. “BuT iT hAppEnS to OtHEr TiCkeRs”**\n\nIt’s also commonplace within the market, which is why we see it pop up for other stocks. In general, SLP is good because it does create those tighter spreads. But it sure as hell can be used for manipulation if the SLP wants to take illegal risks to shake retail investors from a certain stock *\\*cough\\* GME \\*cough\\**.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8t1t4wzhzrp61.png?width=636&amp;format=png&amp;auto=webp&amp;s=d1d1fcf0a6af0a70e82744c2037b0fd6383940cf\n\n# \n\n# Rewind.\n\nNow we know what we’re talking about, let’s go back to this table. A very juicy pattern starts to emerge which is the huge increases we see in ALO distribution.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fwr7cswjzrp61.png?width=506&amp;format=png&amp;auto=webp&amp;s=fe7d3ba75b4014d179c36c6cf995b145bf47fe34\n\nWhen we look at historical *NYSE Chicago volume*, we see visible step changes in the highs that sussly match up with ALOs monthly increases.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n98d42zkzrp61.png?width=622&amp;format=png&amp;auto=webp&amp;s=76d4b13baaf6e2e2bfb57c84518083f3b74fef41\n\nThis leads me to believe they are using ALOs as a buy/sell wall in level 2 data, which helps them to control momentum. However ALOs need to be timed well, as they could be blown away due to pressure from other parties.\n\nSo what are the tools that our HFs buddies have to manipulate the price?\n\n1. **IOC ISO orders**\n   1. Cross exchange sweep that allows them to get ahead of the order queue to an extent\n   2. Used as buy/sell pressure when needed\n2. **Limit non-displayed orders**\n   1. A hidden order that does not affect the price\n   2. Used to offset IOC ISO orders so as a market maker they can remain “neutral” without causing buy/sell pressure\n3. **ALO orders**\n   1. A order placed to create a buy/sell wall\n   2. Used to stop momentum and turn the trend around\n\nHere are the players which they need to factor into their strategy:\n\n1. **Retail investors 📈🐒**\n   1. Likely displaying a predictable buying pattern by now\n2. **Long Whales 📈🐳**\n   1. Shitadel and Co likely know the strategy they are trying to employ (outside of sporadic buy pressure from the equitie side of things\n3. **Other parties such as day traders** 📉👿\n   1. *Don’t day trade GME for the love of everything good in this world*\n\n# \n\n# Let’s put it all together!!!!!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lmyg2mqmzrp61.png?width=634&amp;format=png&amp;auto=webp&amp;s=f6704aefbe17b150cd44df6dc631e3bb4985ca84\n\nI’m taking the three most recent observations of SLP volume from TOS and have marked them on a GME 1 hour candle chart. It’s pretty telling looking at this straight away what’s going on. At each of the specific candles i’ve highlighted, we see a *wall* being hit and a reversal in price.\n\n# \n\n# Strategy Breakdown\n\n**\\~630M @\\~$181**\n\n1. Place ALO **sell** order to create a wall in preparation for earnings in after market\n2. Use HFT IOC ISO **sell** order to create downward pressure during earnings call and after\n3. Use HFT Limit Non-Display **buy** order to remain “neutral” without creating any upward pressure\n\n**\\~113M @\\~$120**\n\n1. Place IOC ISO buy order to buy up shares on the way up\n2. Place Limit buy order to buy up shares on the way up\n\n**\\~290M @\\~$183**\n\n1. Place ALO **sell** order to create a wall to reduce upward pressure\n2. Use HFT IOC ISO **sell** order to create downward pressure\n3. Use HFT Limit Non-Display **buy** order to remain “neutral” without creating any upward pressure\n\n# \n\n# The question is WHY are they doing this?\n\nFTDs.\n\nThe shorts know they have to cover a certain amount of FTDs out of pocket each [cycle](https://iamnotafinancialadvisor.com/Current-DD/), they naturally want the price as low as possible in order to do this. Cover implies whatever they could not borrow to use towards covering their FTDs.\n\nYep, you read that right ape.\n\n**Those screenshots you see from iborrow with borrowed shares disappearing ain’t being used to short the stock, they are being used to cover their FTDs.**\n\nOn that bombshell, back to HFT. As mentioned above, they’d want to manage buy pressure and keep the price as low as possible so they sweep up some shares at the lowest price they can.\n\nThis is what’s happening from the first SLP Volume coming through in the picture above. Drop the price, then at the point they can’t drop it much further they start sweeping up shares with IOC ISOs and regular limit orders **to cover the rest of their FTDs they could not through borrowing** and this is our second SLP volume coming through. Lastly, they needa put a cap on this so it does not get out of control, so they create a sell wall and start to work the price back down again.\n\nThey knew Earnings Release was a good bet to tank the price, they had it all planned out, from the PR campaign MSM was running to even profiting off the spread from the decline to the bounce due to them adding liquidity into the market as a **SL-fucking-P**.\n\nTheory time (this whole post is, but humour me as I have the **PERSONAL** belief the above is fairly on point, do your own DD to confirm 😉 ).\n\n# \n\n# Theory 1 | We Will See It Again\n\nAs FTDs are cyclical we will see this behaviour moving forward until the bubble bursts as the FTD cycle slowly grows out of their control. HODL.\n\nI base this on the fact that I believe if we had noticed the SLP volume sooner we would be able to match this whole post to exactly what happened in late February below (with a few variations in strategy dependent on their options spread).\n\nhttps://preview.redd.it/6fltgujozrp61.png?width=634&amp;format=png&amp;auto=webp&amp;s=c5b38abb929ece9d9c8533e8b79aab0ef0498396\n\n# \n\n# Theory 2 | Options and Long Whales\n\nShorts are trying to balance two plates.\n\n1. Covering FTDs\n2. Making money to cover those FTDs through options\n\nThey are carefully managing how they can use their HFT strategy using their status as a SLP and to make money on options as well to fund covering FTDs among other things like paying employees etc..\n\nThis is where the long whales come in, historically in MY EYES, whales are responsible for the spike in price on the 24th February to just under the $200 mark. Since then and much before, they contributed little volume. It’s entirely made up of HFT and retail investors buying.\n\nWhere they do play into this and i think is a valid theory is using their weight when it matters to inflict [max pain](https://www.reddit.com/r/GME/comments/mejp0k/the_concept_of_max_pain_and_why_this_is_probably/) (post suggest whales pushed up price, that’s not true based on everything in this post, but it’s entirely valid that they slowed it down so the price upon market close on friday would inflict max pain).\n\n# \n\n# Conclusion\n\nWow, that was a lot. As such, take time to take it in and properly understand it. As always, PM or comment and I'll clear things up as best I can.\n\nThis has been going on since as early as October when we first witnessed a huge shift in order strategy. SLPs are meant to be a “good” thing for the market, but as always, there is room to misuse their positions as market makers to yet again fuck over retail investors.\n\nBest part about this is, when we see SLPs volume come through in TD TOS, we can likely with a **reasonable degree of accuracy predict price movements.**\n\nAnd last last note i promise, this is why using TA analysis ON ITS OWN is dangerous as it doesn't know what’s actually going on.\n\n# \n\n# TLDR;\n\nThe shorts are in a death spiral of borrowing to cover FTDs and using HFT trading tactics to cover the remaining FTDs that the borrowed shares could not.\n\nWhales are on our side, but are putting their effort into controlling buy/sell pressure on certain days to inflict max pain on the shorts options spread.\n\nThe price action we are seeing is largely made up of HFTs, Retail, the odd day trader or two (don’t fucking do it).\n\n&amp;#x200B;\n\nThis ain't financial advice yo, just an ape analysing data and reading boring as fuck SEC filings.\n\nEdit: Readability changes\n\n\n**Important: Let’s Spread Awareness++\nMy dear Apes check this out.\n\nLet’s spread awareness of what an massive fraud is happening currently on the stock markets. What better way is there than than educating ourselves and others? ... Would you like to see how we can spread awareness?\n\nThis is no financial advice. I really have no clue what i’m talking about. I just like the stock. \nOriginal Source by u/jsmar18",
        "subreddit": "Wallstreetbetsnew",
        "title": "WHAT HedgeFuks dont want you to know: IWas Missing a KEY Piece of the Puzzel. This is how HFTs are covering FTDs and Why the TD TOS \"Bugs\" are NOT What We Think They Are. 🦧🦧",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mf470p/what_hedgefuks_dont_want_you_to_know_iwas_missing/",
        "created": 1616977687.0
    },
    {
        "author": "LeRumba",
        "created_utc": 1615486315,
        "id": "m2wqlm",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n**MicroVision: $150 stock when acquired for $20 Billion?**\n\nI can’t tell you what people expect from the 4th Qtr CC, but I wouldn't look for an announcement that the company was sold. I wouldn’t look for an announcement that someone took an equity stake. I wouldn't look for an announcement that Lidar A-Sample is already done. In my opinion these are not realistic expectations and may not happen at the 4th Qtr Earnings CC.\n\nHowever, I would look for an update on all of the relevant topics with a positive spin… that’s the new MicroVision where the minor dilution of (2.5 million shares sold for $50 million) was done before the 4th Qtr Earnings CC, and not afterwards as has been the case over the past 15 years.\n\nI expect MVIS stock to move forward and not backwards. I would NOT expect that everything is status quo. MicroVision of today is an energetic, vibrant and a wealthy company with a market cap of over $2.5 billion… a historical high.\n\nSo if you own the stock now at the current price and we find out that things are improving and progressing well, why would you sell?\n\nI would look for a mention that we have 50 million more going into 4th Qtr Earnings CC, that we didn't have a few weeks ago. I would expect that the Lidar A-Sample is on target for April and some key specs have improved. I would expect that we have multiple companies conducting due diligence toward acquiring the company.\n\n**MicroVision: Why a $150 stock when acquired for $20 Billion?**\n\nReal billion dollar ideas have trillion dollar market size, they are scalable, and leverage the drivers of growth to go viral or global.\n\nIn my last [research on MicroVision ](https://www.lerumba.com/Directory/microvision-holds-the-keys-to-the-future-3000-profit-potential-in-over-10-billion-ma-article-132.aspx#.YEpP3Z1KjIU)(NASDAQ: MVIS), I introduced this 20 year old high-tech company that is at the cusp of acquisition by a major technology company. In the last few weeks, MVIS stock price has gone up by 60-fold \\[from 25 cents to over $15\\] on well qualified speculations. Now it is trading in the $14 to $24 range giving new investors the opportunity to take position; for the future of $70 to $150 dollar trading range in the next 12-months or so... depending on the acquisition price of $10 billion or $20 billion.\n\n**Here's the short answer...**\n\nEach of the Six LBS core technology verticals can spawn Trillion dollar markets of the future. Considering the diversity of its product line, built around the LBS core technology over the last 20 years, and protected by it's IP and 500 patents, each core vertical can spawn markets worth trillions, and be worth billions in an acquisition or a merger.\n\n**Why sell the company or merge with a deep pocket Tier 1 Technology partner...**\n\nAt low volumes, the cost of components that MicroVision sells to its Tier 1 partners is 5 to 10 times higher than what it is sold for in anticipation of large quantities... and loosing money on each component sold is what has shaped the company's past blunders loosing millions of dollars each quarter for the last 15 years.\n\nFinally, to sell the company, or to sell one or all of its 6 core vertical engines that can spawn trillion dollar markets, is the right decision. Under the leadership and stewardship of a deep pocket Tier 1 technology partner from the FAMGA gang can truly realize the potential of MicroVision technology, and bring hundred of products to the market that will be sold in billion units per year.\n\nIn the last few weeks, MVIS stock price has gone up by 60-fold \\[from 25 cents to over $14.95\\] on qualified speculations. Now it is trading in the $14 to $24 range giving new investors the opportunity to take position; for the future of $70 to $150 dollar trading range in the next 12- months or so... depending on the acquisition price of $10 billion or $20 billion.\n\n[**What to expect from sale or merger of MicroVision...**](https://www.lerumba.com/Directory/microvision-30-stock-when-acquired-for-5-billion-article-127.aspx#.Xz3sPchKjIX)\n\nOver the last 3 decades, the FAMGA tech giants — Facebook, Amazon, Microsoft, Google, and Apple — have collectively made [770 acquisitions](https://www.cbinsights.com/search/deals/?invs=1038%2C1167%2C10160%2C12103%2C19786&amp;comStatusIds=2&amp;invStages=M%26A&amp;limit=25&amp;offset=0&amp;displayType=table). Even amid the Covid-19 pandemic, some have continued to write checks, with Apple being the [most active acquirer in 2020 to date](https://www.cbinsights.com/search/deals/?sdate=2020-01-01&amp;edate=2020-05-05&amp;invs=1038%2C1167%2C10160%2C12103%2C19786&amp;comStatusIds=2&amp;invStages=M%26A&amp;limit=25&amp;offset=0&amp;displayType=table) among them.\n\nThis FAMGA group of acquirers has deep pockets. Some of their biggest checks have been written for high-profile companies such as career platform [LinkedIn](https://www.cbinsights.com/company/linkedin) (acquired by Microsoft for $26.2B), chat app [WhatsApp](https://www.cbinsights.com/company/whatsapp) (Facebook for $22B), and video-sharing platform[YouTube](https://www.cbinsights.com/company/youtube) (Google for $1.7B).\n\nLuminar Technologies ([LAZR](http://finance.yahoo.com/quote/LAZR?p=LAZR)) went public and the stock price at $40 dollars more than doubled in two days as a public company, with a market cap of over $14 billion… and made its co-founder CEO Austin Russell a billionaire ─ at the age of 25. Luminar specializes in making Lidar sensors for the [automotive sector](http://www.fool.com/investing/stock-market/market-sectors/consumer-discretionary/automotive-stocks/) that will be used in the development of autonomous vehicles.\n\nHowever, the keys to several future technologies are being held by an older company MicroVision that was always ahead of its time. [MicroVision](http://www.microvision.com/) (MVIS), founded in 1993, is most famous for their Micro Electro Mechanical systems (MEMs) and Laser Beam Scanning (LBS) technology that is protected by over 500 patents.\n\nMicroVision’s automotive Lidar will be packaged in a solid-state module that is smaller, cheaper and more versatile than potential competitors like Luminar and Velodyne.\n\nAutonomous vehicles of the future will utilize MicroVision’s Lidar because it is a superior “Best in Class” technology compared to Luminar and Velodyne; and due to its small size, 280M range, and point cloud density of 20 million points per second.\n\nT**OP 5 ACQUISITIONS BY COMPANY**\n\nBelow, we break down each of these companies’ top 5 acquisitions by value. Read more about these deals in the posts linked below.\n\n**Facebook**\n\n1. [WhatsApp](https://www.cbinsights.com/company/whatsapp) ($22B, 2014)\n2. [Oculus VR](https://www.cbinsights.com/company/oculus-vr) ($2B, 2014)\n3. [Instagram](https://www.cbinsights.com/company/instagram) ($1B, 2012)\n4. [CTRL-labs](https://www.cbinsights.com/company/ctrl-labs) ($1B, 2019)\n5. [LiveRail](https://www.cbinsights.com/company/liverail) ($500M, 2014)\n\n**Amazon**\n\n1. [Whole Foods](https://www.cbinsights.com/company/whole-foods-market) ($13.7B, 2017)\n2. [Ring](https://www.cbinsights.com/company/bot-home-automation) ($1.2B, 2018)\n3. [Zappos](http://www.cbinsights.com/company/zappos) ($1.2B, 2009)\n4. [PillPack](https://www.cbinsights.com/company/pillpack) ($1B, 2018)\n5. [Twitch Interactive](https://www.cbinsights.com/company/justintv) ($970M, 2014)\n\n**Microsoft (Top 10)**\n\n1. [LinkedIn](https://www.cbinsights.com/company/linkedin) ($26.2B, 2016)\n2. [Skype](https://www.cbinsights.com/company/skype) ($8.5B, 2011)\n3. [GitHub](https://www.cbinsights.com/company/github) ($7.5B, 2018)\n4. [Nokia’s Devices &amp; Services Business](https://www.cbinsights.com/company/nokia) ($7.2B, 2014)\n5. [aQuantive](https://www.cbinsights.com/company/aquantive) ($6.3B, 2007)\n6. [Mojang](https://www.cbinsights.com/company/mojang) ($2.5B, 2014)\n7. [Affirmed Networks](https://www.cbinsights.com/company/affirmed-networks) ($1.4B, 2020)\n8. [Visio Corporation](http://www.cbinsights.com/company/visio-corporation) ($1.4B, 1999)\n9. [Navision](http://www.cbinsights.com/company/navision) ($1.3B, 2002)\n10. [Yammer](http://www.cbinsights.com/company/yammer) ($1.2B, 2012)\n\n**Google (Top 6)**\n\n1. [Motorola Mobility](https://www.cbinsights.com/company/motorola-mobility) ($12.5B, 2012)\n2. [Nest Labs](https://www.cbinsights.com/company/nest-labs) ($3.2B, 2014)\n3. [DoubleClick](https://www.cbinsights.com/company/doubleclick) ($3.1B, 2007)\n4. [Looker](https://www.cbinsights.com/company/looker-data-sciences) ($2.6B, 2019)\n5. [Fitbit](https://www.cbinsights.com/company/fitbit) ($2.1B, 2019)\n6. [YouTube](https://www.cbinsights.com/company/youtube) ($1.7B, 2006)\n\n**Apple (Top 7)**\n\n1. [Beats Electronics](https://www.cbinsights.com/company/beats-electronics) ($3B, 2014)\n2. [Intel — Smartphone Modem Business](https://www.cbinsights.com/company/intel-smartphone-modem-business) ($1B, 2019)\n3. [Dialog Semiconductor](https://www.cbinsights.com/company/dialog-semiconductor-chip-power-management-unit) ($600M, 2018)\n4. [Anobit Technologies](https://www.cbinsights.com/company/anobit-technologies) ($500M, 2011)\n5. [Texture](https://www.cbinsights.com/company/next-issue-media) ($485M, 2018)\n6. [Shazam](https://www.cbinsights.com/company/shazam) ($400M, 2017)\n7. [NeXT Computer](https://www.cbinsights.com/company/next-computer) ($400M, 1996)\n\nAs an investor you know change equals opportunity… the bigger the change, the bigger the opportunity. The next few years are going to be either the most interesting, exciting, and lucrative years for you or you’re going to be left behind.\n\n**Change can mean big profits for investors getting in on the biggest changes early.**\n\nThese two sectors -- artificial intelligence and TaaS -- are all seeing massive changes and we’re just starting to see their impact in the world.\n\nHistorically, when you just start to see these changes is the best time to buy.\n\nAnd it’s why in a few years you’ll be kicking yourself for not jumping on them when you had the chance.\n\nSome of the best, most direct, and highest-potential ways to jump on them are with **Microsoft (MSFT), MicroVision (MVIS) and Tesla (TSLA)**\n\nBest regards,",
        "subreddit": "wallstreetbets",
        "title": "MicroVision: $150 stock when acquired for $20 Billion?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2wqlm/microvision_150_stock_when_acquired_for_20_billion/",
        "created": 1615515115.0
    },
    {
        "author": "robot-legs",
        "created_utc": 1615221130,
        "id": "m0jjoo",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$ASO Yolo update! Got the keys to the bananas here! 🚀🚀🚀🚀🚀🚀",
        "url": "https://i.redd.it/ghyemqhyztl61.jpg",
        "created": 1615249930.0
    },
    {
        "author": "AllureDreams1998",
        "created_utc": 1617165614,
        "id": "mgya90",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": " \n\nI am generally a Bitcoin maximalist in that I have only ever held the real asset itself in cold storage. However, I am interested in using this year's TFSA and RRSP room for a Bitcoin ETF for the tax free and tax deferred gains.\n\nI understand that there are risks involved with trusting another entity with the actual asset (i.e. not your keys, not your Bitcoin) and that I will merely own shares of those ETFs which is not the same as Bitcoin itself.\n\nWith that said, both of these companies apparently use Gemini as their custodian and I have no issues with Gemini due to their leadership and reputation. I can clearly see on Purpose Invests website that they explicitly state that Gemini is their custodian; however, I cannot find an explicit declaration on CI Galaxy's website that Gemini is their custodian but I read it via a third-party source.\n\nAdditionally, concerning management fees, BTCX (CI Galaxy ETF) is much cheaper at 0.40% while BTCC (Purpose Invest ETF) is much more expensive at 1.00%. Can anyone confirm that BTCX (CI Galaxy ETF) uses Gemini as their custodian? Is there anything else that I should consider between these two choices/companies/ETFs? If they are both using Gemini as a custodian, I see no point in going with BTCC (Purpose Invest ETF) due to their expensive management fees relative to BTCX (CI Galaxy ETF). I am not interested in QBTC.",
        "subreddit": "CanadianInvestor",
        "title": "BTCX (CI Galaxy ETF) vs. BTCC (Purpose Invest ETF)",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/mgya90/btcx_ci_galaxy_etf_vs_btcc_purpose_invest_etf/",
        "created": 1617194414.0
    },
    {
        "author": "crockett5",
        "created_utc": 1617206236,
        "id": "mh96r3",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I'm not trying to give financial advice for dummies, but I know a lot of guys are new at this shit and I wanted to explain basic maths for less retarded apes and tell a story about an ape named Jack Mi. Offswald. \n\nJack has $1k dollars burning a hole in his pocket from govt socalisms. Jack is a poor ape with big dreams of having his own Lambo and the govt gave him a payday.  Jack sees the flashy GME's going to the moon and wants to have diamond hands like all the other apes, but the maths are hard for retards.\n\nJack yolos his $1k on a stonk at $200. He gets 5 golden tickets to the moon and is ready for his rocketship..  The problem is Jack is retarded and failed maths in High School. Jack didn't realize to make $100 in tendies with only 5 stonks his $200 golden ticket needs to jump up $20.\n\nJack didn't get that lucky, the stonk barely moved it bounced from $190 to $205 and he's stuck like a dummy looking for his Lambo keys in the gutter at 2am on a rainy moonless night. 2 weeks go by and Jack gets a little lucky by selling his 5 stonks to get his $1k dollars back. He didn't lose anything, but he didn't gain anything either. Jack just let some fat pig borrow his money for 2 weeks free of charge.\n\nJack checks the memes and sees a less flashy stock but the memes are great so he yolos in. This time the stock is only $2 and Jack gets 500 golden tickets to the moon. 2 days later Jack's cash account has settled and the $2 stock has been up and down from $1.90 to $2.25. Jack sells at $2.20 and gets $100 in sweet tendies.\n\n Jack Mi. Offswald is now less of a retarded ape because he found out if you don't have a lot of green it's better to yolo on cheaper stocks that don't need big gains than get left bag holding in an expensive stonk that you will never get any gains from. Jack still doesn't have his Lambo but at least he now has the keys to a rusty 1981 Honda Accord and he's out driving on a full moon night with the windows down because his AC is broken, but at least he can now see the moon..",
        "subreddit": "wallstreetbets",
        "title": "A poor Ape doesn't have to always be retarded, a story about Jack Mi. Offswald",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mh96r3/a_poor_ape_doesnt_have_to_always_be_retarded_a/",
        "created": 1617235036.0
    },
    {
        "author": "Fibognocchisoup",
        "created_utc": 1615555528,
        "id": "m3hhmx",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "\nI’ve been there in the good and bad you see\nIt all started a few months ago\nWhen the hedgies did a bit too much blow\n\nGameStock, they said was going to plummet.\nIt’s dieing retail, it’ll never reach the summit \nBut little did they know there was not a cat in town\nWho noticed the antics of these hedgie clowns\n\nBuy the dip he said from $4 to $2\nIt was dismal it seemed, the buying was through\nBut then all of a sudden, Ryan Cohen hopped aboard\nHe bought into the stock, this could not be ignored!\n\nPeople realized the value of this great stonk\nThe price skyrocketed, the hedge funds in shock\nBut then the hedgies thought we cannot let this be\nRetail traders, beating us? We’re losing our money tree.\n\nSo the hedgies decided they would take a stand.\nAgainst “dumb money” (that’s us) and the WSB brand.\nThey gave millions to officials news outlets and more\nTo spread the story that GME would make everyone poor\n\nTheir FUD wasn’t working billions down the drain\nThey decided to restrict trading to stop the retail gain\nNo more shares could be bought, you could only sell\nThe problem is, we didn’t hear no bell\n\nAs the stock dropped to $40, I sank to my knees\nThe market was rigged and I didn’t have the keys\nThey change the rules when they want\nAs the ultra rich twitter warriors, gloat and taunt\n\nThe paper hands started screaming, we told you so!\nIn disbelief I saw the number -90% and below.\nBut then I realized a small and true fact\nThat I could actually survive these attacks\n\nIt wasn’t a loss until I actually sold\nSo I did something others, might have called bold.\nI doubled down on my shares and lowered my cost\nAs the price continued to decrease all seemed to be lost\n\nThen a glimmer of light started to shine through.\nThe headbanded investor bought more for me and for you.\nThis catalyst was all that the stock seemed to need\nAs the price rose, and hedgies again started to bleed.\n\nThe price hit almost $400 and dropped like a rock\n$198 the chart said, the chat screaming what the fock\nThe price jumped back up quick and went back to even\nI doubled my resolve, this is a stock to believe in\n\nAnd now we have made it to today\nWhat side are you on and with what do you play \nMake a choice, hold or buy if you can\nJust make sure you are going in with your own plan.\n\nGameStonk to the moon, yet again it seems\nIt can stay a great rocket, just through all the great memes\nTo the moon we may go, keep us In your prayers\nAt the end of the day, power to all the players\n\n\nTL:DR : The GME story from a point of view that is entirely my own. 🤲💎🦍🚀\n\nNote: this is not financial advice and I am not a financial adviser. I made this story up, it is entirely fiction.",
        "subreddit": "wallstreetbets",
        "title": "The History of the Tendiest Stock in the World, GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m3hhmx/the_history_of_the_tendiest_stock_in_the_world_gme/",
        "created": 1615584328.0
    },
    {
        "author": "stockmarket101",
        "created_utc": 1616912687,
        "id": "mew059",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "A) Buy and hold that shit! 💎🖐🏻💎\n\nB) Buy more on the dips!  🚀Love that discounted rocket fuel 🚀\n\nC) Don’t waste money buying crazy ass yolo calls (800c).  Nobody knows the date that the squeeze will produce that many bananas 🍌.  Use those bananas for more shares!  GME shares🥇\n\nD) When the dips get to down use plenty of lotion and alcohol 🍺 to relax yourself!                             Step away from the screen and know it’s cuming 🚀 soon. \n\nE) Don’t  worry about your wife’s boyfriend, he is helping you out by servicing your wife while you concentrate on making more bananas 🍌       Remember to thank him!\n\nF) HODL the F____k__g  line apes!!! 🦧 and your bananas 🍌 will 🚀🚀🚀to the🌘. \n\nThis is not financial advice.  I definitely eat crayons 🖍 as my main source of vitamins.  \nKnow your limits.  Batman knows no limits!",
        "subreddit": "wallstreetbets",
        "title": "Keys to GME success... after reading 100’s of posts from my fellow apes, I have concluded some keys points to our moon 🚀 launch.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mew059/keys_to_gme_success_after_reading_100s_of_posts/",
        "created": 1616941487.0
    },
    {
        "author": "Fibognocchisoup",
        "created_utc": 1615471177,
        "id": "m2qmzv",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "This is a poem about my favorite stock, GME\n\nI’ve been there in the good and the bad, you see\n\nIt all started a few months ago\n\nWhen the hedges did a bit too much blow\n\n\nGameStock they said, was going to plummet\n\nIt’s dying retail, it’ll never reach the summit\n\nBut little did they know, there was not a cat in town\n\nWho noticed the antics of these hedgie clowns\n\n\nBut the dip he said from $4 to $2\n\nIt was dismal it seemed, the buying was through\n\nBut then all of a sudden Ryan Cohen hopped aboard\n\nHe bought into the stock, this could not be ignored!\n\n\nPeople realized the value of this great stock\n\nThe price skyrocketed, the hedge funds in shock\n\nBut then the hedgies thought, we cannot let this be\n\nRetail traders beating us, were losing our money tree\n\n\nSo the hedgies decided they would take a stand\n\nAgainst “dumb money” (that’s us) and the WSB brand\n\nThey gave millions to officials, news outlets and more\n\nTo spread the story that GME would make everyone poor\n\n\nTheir FUD wasn’t working, billions down the drain\n\nThey decided to restrict trading to stop the retail gain\n\nNo more shares could be bought, you could only sell\n\nThe problem is, we didn’t hear no bell\n\n\nAs the stock dropped to $40 I sank to my knees\n\nThe market was rigged, and I didn’t have the keys\n\nThey change the rules when they want\n\nAs the Steven cohens of the world, sir and taunt\n\n\nThe paper hands started screaming, we told you so!\n\nIn disbelief I saw my statement number, -90% and below.\n\nBut then I realized a small and true fact \n\nThat I could actually survive these attacks\n\n\nIt wasn’t a loss until I actually sold\n\nSo I did something others might have called bold\n\nI doubled down on my shares and lowered my cost\n\nAs the price continued to decrease all seemed to be lost\n\n\nThen a glimmer of light started to shine through\n\nThe headbanded investor bought more for me and for you\n\nThis catalyst was all that the stock seemed to need\n\nAs we shot back up and hedgies again started to bleed\n\n\nThe price hit $380 then fell to the ground\n\n$198 the chart said, many were dumbfound\n\nThe price jumped back up quick and went back to even\n\nI doubled my resolve, this is a stock to believe in\n\n\nAnd now we have made it to today\n\nWho’s side are you on and with what do you play\n\nMake a choice, hold or buy if you can\n\nJust make sure going in you have your own plan\n\n\nGameStop to the moon, yet again it seems\n\nIt can stay our rocket, just through all the great memes\n\nTo the moon we go, keep us in your prayers\n\nAt the end of the day, power to all the players\n\nTL:DR GME go down. Then GME go up. Then go down again. Now up again. To the moon 🚀🚀🚀🤲💎🦍🦍🦍",
        "subreddit": "wallstreetbets",
        "title": "The Story of GME in poetry form for you apes who like rhymes",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2qmzv/the_story_of_gme_in_poetry_form_for_you_apes_who/",
        "created": 1615499977.0
    },
    {
        "author": "Fibognocchisoup",
        "created_utc": 1615557505,
        "id": "m3i2ox",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I’ve been there in the good and bad you see\n// It all started a few months ago\n// When the hedgies did a bit too much blow\n\nGameStock, they said was going to plummet.\n//It’s dieing retail, it’ll never reach the summit \n//But little did they know there was not a cat in town\n//Who noticed the antics of these hedgie clowns\n\nBuy the dip he said from $4 to $2\n//It was dismal it seemed, the buying was through\n//But then all of a sudden, Ryan Cohen hopped aboard\n//He bought into the stock, this could not be ignored!\n\nPeople realized the value of this great stonk\n//The price skyrocketed, the hedge funds in shock\n//But then the hedgies thought we cannot let this be\n//Retail traders, beating us? We’re losing our money tree.\n\n//So the hedgies decided they would take a stand.\n//Against “dumb money” (that’s us) and the WSB brand.\n//They gave millions to officials news outlets and more\n//To spread the story that GME would make everyone poor\n\nTheir FUD wasn’t working billions down the drain\n//They decided to restrict trading to stop the retail gain\n//No more shares could be bought, you could only sell\n//The problem is, we didn’t hear no bell\n\nAs the stock dropped to $40, I sank to my knees\n//The market was rigged and I didn’t have the keys\n//They change the rules when they want\n//As the ultra rich twitter warriors, gloat and taunt\n\nThe paper hands started screaming, we told you so!\n//In disbelief I saw the number -90% and below.\n//But then I realized a small and true fact\n//That I could actually survive these attacks\n\nIt wasn’t a loss until I actually sold\n//So I did something others, might have called bold.\n//I doubled down on my shares and lowered my cost\n//As the price continued to decrease all seemed to be lost\n\nThen a glimmer of light started to shine through.\n//The headbanded investor bought more for me and for you.\n//This catalyst was all that the stock seemed to need\n//As the price rose, and hedgies again started to bleed.\n\nThe price hit almost $400 and dropped like a rock\n//$198 the chart said, the chat screaming what the fock\n//The price jumped back up quick and went back to even\n//I doubled my resolve, this is a stock to believe in\n\nAnd now we have made it to today\n//What side are you on and with what do you play \n//Make a choice, hold or buy if you can\n//Just make sure you are going in with your own plan.\n\nGameStonk to the moon, yet again it seems\n//It can stay a great rocket, just through all the great memes\n//To the moon we may go, keep us In your prayers\n//At the end of the day, power to all the players\n\n\nTL:DR : The GME story from a point of view that is entirely my own. 🤲💎🦍🚀\n\nNote: this is not financial advice and I am not a financial adviser. I made this story up, it is entirely fiction.\n\n—MOD said as a meme not enough hype so came back to a discussion 😬💎🚀🦍",
        "subreddit": "wallstreetbets",
        "title": "The History of the Tendiest Stock in the World, GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m3i2ox/the_history_of_the_tendiest_stock_in_the_world_gme/",
        "created": 1615586305.0
    },
    {
        "author": "Fibognocchisoup",
        "created_utc": 1615474133,
        "id": "m2rswg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "A story about GameStonk, in POEM (sorry rappers)\n\nNote: this is not financial advice and I am not a financial adviser. I made this story up, it is entirely fiction.\n\nThis is a poem about my favorite stock GME\n\nI’ve been there in the good and bad you see\n\nIt all started a few months ago\n\nWhen the hedgies did a bit too much blow\n\n\nGameStock, they said was going to plummet.\n\nIt’s dieing retail, it’ll never reach the summit \n\nBut little did they know there was not a cat in town\n\nWho noticed the antics of these hedgie clowns\n\n\nBuy the dip he said from $4 to $2\n\nIt was dismal it seemed, the buying was through\n\nBut then all of a sudden, Ryan Cohen hopped aboard\n\nHe bought into the stock, this could not be ignored!\n\n\nPeople realized the value of this great stonk\n\nThe price skyrocketed, the hedge funds in shock\n\nBut then the hedgies thought we cannot let this be\n\nRetail traders, beating us? We’re losing our money tree.\n\n\nSo the hedgies decided they would take a stand.\n\nAgainst “dumb money” (that’s us) and the WSB brand.\n\nThey gave millions to officials news outlets and more\n\nTo spread the story that GME would make everyone poor\n\n\nTheir FUD wasn’t working billions down the drain\n\nThey decided to restrict trading to stop the retail gain\n\nNo more shares could be bought, you could only sell\n\nThe problem is, we didn’t hear no bell\n\n\nAs the stock dropped to $40, I sank to my knees\n\nThe market was rigged and I didn’t have the keys\n\nThey change the rules when they want\n\nAs the ultra rich twitter warriors, gloat and taunt\n\n\nThe paper hands started screaming, we told you so!\n\nIn disbelief I saw the number -90% and below.\n\nBut then I realized a small and true fact\n\nThat I could actually survive these attacks\n\n\nIt wasn’t a loss until I actually sold\n\nSo I did something others, might have called bold.\n\nI doubled down on my shares and lowered my cost\n\nAs the price continued to decrease all seemed to be lost\n\n\nThen a glimmer of light started to shine through.\n\nThe headbanded investor bought more for me and for you.\n\nThis catalyst was all that the stock seemed to need\n\nAs the price rose, and hedgies again started to bleed.\n\n\nThe price hit almost $400 and dropped like a rock\n\n$198 the chart said, the chat screaming what the fock\n\nThe price jumped back up quick and went back to even\n\nI doubled my resolve, this is a stock to believe in\n\n\nAnd now we have made it to today\n\nWhat side are you on and with what do you play \n\nMake a choice, hold or buy if you can\n\nJust make sure you are going in with your own plan.\n\n\nGameStonk to the moon, yet again it seems\n\nIt can stay a great rocket, just through all the great memes\n\nTo the moon we may go, keep us In your prayers\n\nAt the end of the day, power to all the players\n\n\nTL:DR : The GME story from a point of view that is entirely my own. 🤲💎🦍🚀",
        "subreddit": "wallstreetbets",
        "title": "The GameStonk saga, call me D R Stonkseuss",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2rswg/the_gamestonk_saga_call_me_d_r_stonkseuss/",
        "created": 1615502933.0
    },
    {
        "author": "Fibognocchisoup",
        "created_utc": 1615562225,
        "id": "m3jncy",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is a poem about my favorite stock GME\n//I’ve been there in the good and bad you see\n//It all started a few months ago\n//When the hedgies did a bit too much blow\n\nGameStock, they said was going to plummet.\n//It’s dieing retail, it’ll never reach the summit \n//But little did they know there was not a cat in town\n//Who noticed the antics of these hedgie clowns\n\nBuy the dip he said from $4 to $2\n//It was dismal it seemed, the buying was through\n//But then all of a sudden, Ryan Cohen hopped aboard\n//He bought into the stock, this could not be ignored!\n\nPeople realized the value of this great stonk\n//The price skyrocketed, the hedge funds in shock\n//But then the hedgies thought we cannot let this be\n//Retail traders, beating us? We’re losing our money tree.\n\nSo the hedgies decided they would take a stand.\n//Against “dumb money” (that’s us) and the WSB brand.\n//They gave millions to officials news outlets and more\n//To spread the story that GME would make everyone poor\n\nTheir FUD wasn’t working billions down the drain\n//They decided to restrict trading to stop the retail gain\n//No more shares could be bought, you could only sell\n//The problem is, we didn’t hear no bell\n\nAs the stock dropped to $40, I sank to my knees\n//The market was rigged and I didn’t have the keys\n//They change the rules when they want\n//As the ultra rich twitter warriors, gloat and taunt\n\nThe paper hands started screaming, we told you so!\n//In disbelief I saw the number -90% and below.\n//But then I realized a small and true fact\n//That I could actually survive these attacks\n\nIt wasn’t a loss until I actually sold\n//So I did something others, might have called bold.\n//I doubled down on my shares and lowered my cost\n//As the price continued to decrease all seemed to be lost\n\nThen a glimmer of light started to shine through.\n//The headbanded investor bought more for me and for you.\n//This catalyst was all that the stock seemed to need\n//As the price rose, and hedgies again started to bleed.\n\nThe price hit almost $400 and dropped like a rock\n//$198 the chart said, the chat screaming what the fock\n//The price jumped back up quick and went back to even\n//I doubled my resolve, this is a stock to believe in\n\nAnd now we have made it to today\n//What side are you on and with what do you play \n//Make a choice, hold or buy if you can\n//Just make sure you are going in with your own plan.\n\nGameStonk to the moon, yet again it seems\n//It can stay a great rocket, just through all the great memes\n//To the moon we may go, keep us In your prayers\n//At the end of the day, power to all the players\n\nTL:DR : The GME story from a point of view that is entirely my own. 🤲💎🦍🚀\n\nNote: this is not financial advice and I am not a financial adviser. I made this story up, it is entirely fiction.",
        "subreddit": "wallstreetbets",
        "title": "The Tendiest Stock a history (you already know what it is)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m3jncy/the_tendiest_stock_a_history_you_already_know/",
        "created": 1615591025.0
    },
    {
        "author": "ArtichokeOk9708",
        "created_utc": 1615298914,
        "id": "m174cm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Morning Stock Review Mar 9 2021 $PAYC",
        "url": "https://youtube.com/watch?v=1CtOjZMF-Oo&amp;feature=share",
        "created": 1615327714.0
    }
]