[
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610723872,
        "id": "kxwje8",
        "num_comments": 223,
        "num_crossposts": 0,
        "selftext": "**Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon.\n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September.\n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products.\n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services. Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally.\n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe.\n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world?\n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future.\n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\nThank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "StockMarket",
        "title": "Amazon Stock Price Target Prediction &amp; Analysis [DCF, Fundamental &amp; Tehnical]",
        "url": "https://www.reddit.com/r/StockMarket/comments/kxwje8/amazon_stock_price_target_prediction_analysis_dcf/",
        "created": 1610752672.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610744214,
        "id": "ky3nxo",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "**Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!**\n\n**\\~Warning! Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon.\n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September.\n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products.\n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services. Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally.\n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe.\n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world?\n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future.\n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\nThank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "stocks",
        "title": "Amazon Stock Price Target Prediction &amp; Analysis [DCF, Fundamental &amp; Tehnical]",
        "url": "https://www.reddit.com/r/stocks/comments/ky3nxo/amazon_stock_price_target_prediction_analysis_dcf/",
        "created": 1610773014.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610718176,
        "id": "kxurg0",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "**🚀🚀🚀Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!🚀🚀🚀**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon.\n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September.\n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products.\n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services. Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally.\n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe.\n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world?\n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future.\n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\n🙏Thank you everyone for reading!🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "wallstreetbets",
        "title": "Amazon Stock 150% Upside?! |Amazon Stock Price Target Prediction &amp; Analysis | Buy or Sell [AMZN]?🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kxurg0/amazon_stock_150_upside_amazon_stock_price_target/",
        "created": 1610746976.0
    },
    {
        "author": "TheDirtyDagger",
        "created_utc": 1610129561,
        "id": "kt847w",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Hey Gang,\n\nStumbled across an opportunity with Foley Trasimene Acquisition II Corp (BFT) that I thought I'd share with you all. For those who are unfamiliar, BFT is a lower tier meme stock here on WSB. It's a SPAC that [intends to acquire PaySafe](https://www.businesswire.com/news/home/20201207005389/en/Foley-Trasimene-Acquisition-Corp.-II-and-Paysafe-A-Leading-Global-Payments-Provider-Focused-on-Digital-Commerce-and-iGaming-Announce-Merger), a leading digital payments platform for \\~$9B. Paysafe has about $1.5B in revenue and is growing in the eCommerce and online gaming markets. Plus they have a [pretty spiffy investor deck](https://www.paysafe.com/fileadmin/user_upload/Foley-Trasimene-Acquisition-Corp-II-and-Paysafe-investor-presentation.pdf) full of vague promises of profitability if you take away most of their expenses. Next stop, the moon.\n\n**What's the trade?**\n\n1. Buy BFT shares in blocks of 100 at \\~$14.80\n2. Sell 10/15/21 $20 covered calls at \\~4.75\n3. ???\n4. Profit\n\n**What do our outcomes look like?**\n\n* Best Case Scenario: BFT goes to 20 or above. We get called on the options we sold and we pocket a $5.20 gain + $4.75 premium for each share, for a return of $9.95 on our $14.80 initial investment per share (67% return in 9 months). We do max out at 67% though if this bad boy really moons.\n* Worst Case Scenario #1: Acquisition falls through, BFT shares return towards their liquidation value ($10). We lose on our shares, but since we got that $4.75 covered call premium we're only looking at a loss of \\~$.05 / share\n* Worst Case Scenario #2: Acquisition goes through and the stock tanks. Theoretical max loss is $10.05 per share (cost basis - premium for covered call), but realistically I think we can assume Paysafe isn't going to zero between now and October. \n* Anywhere in between we're probably making money as our adjusted cost basis is \\~$10.05\n* So basically it literally can't go tits up. Right guys?\n\n&amp;#x200B;\n\n**Positions:** \n\nLong 500 shares in BFT, sold 5 $20 10/15/21 Covered Calls\n\n&amp;#x200B;\n\nStill pretty new to this, appreciate your comments on how retarded I am / how I just effed myself. Cheers!",
        "subreddit": "wallstreetbets",
        "title": "Big Opportunity in BFT Covered Calls (Literally can't go tits up? Tell me how I just effed myself)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kt847w/big_opportunity_in_bft_covered_calls_literally/",
        "created": 1610158361.0
    },
    {
        "author": "someonesnewaccount",
        "created_utc": 1610506316,
        "id": "kw7ano",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "[https://techcrunch.com/2021/01/12/visa-will-not-acquire-plaid-after-running-into-regulatory-wall/](https://techcrunch.com/2021/01/12/visa-will-not-acquire-plaid-after-running-into-regulatory-wall/)  \n\n\nVisa acquisition of Plaid did not go through. Considering the experience of Drucker with Worldpay, a global payments company, I believe Plaid would be a great target. Visa wanted to acquire Plaid to capitalize on the fact that their client base is very different than theirs. The leadership team of AACQ would be very relevant to help grow Plaid. This could be why AACQ pumped today.\n\n&amp;#x200B;\n\nDisclosure: I have 100 AACQ commons.",
        "subreddit": "SPACs",
        "title": "AACQ: Plaid seems to be extremely fitting",
        "url": "https://www.reddit.com/r/SPACs/comments/kw7ano/aacq_plaid_seems_to_be_extremely_fitting/",
        "created": 1610535116.0
    },
    {
        "author": "AA92",
        "created_utc": 1610983090,
        "id": "kzwkbv",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hey Everyone! I am back with The Analyst Score today. I've posted about this score a couple of times on Reddit, but I've been having troubles gathering the needed data. Well, I got access to some new data, so it's back. \n\nI love this score because in the past it has shown great, market beating returns, while holding what I'd consider some great companies. Of course, the nature of the score and the data means that I cannot backtest, so I have no idea how this will eventually perform in a bear market. \n\n# How It Works\n\nI monitor the day-to-day changes in analyst recommendations for *almost* every stock. Why? Well because I wanted to know how analysts perform as a collective. The answer, it seems, is quite well. \n\nI store all of the analyst recommendations and then once a month bundle all the changes up together, weight all the companies against each other, and give them a letter grade (A+ through F). The stocks you'll see mentioned throughout this post are A+ rated stocks. To be an A+ rated stock, a company must have only had buy recommendations by at least five \"good\" (according to my model) analysts. \n\n# How Has The Score Performed?\n\nStocks meeting the top criteria in July 2020 have returned more than 70% since then (as a basket). Stocks in the November run (my last run) have performed admirably too. All A+ rated stocks have returned 18.48%, while narrowing things down to larger firms (say over $2B) **have returned 22.55%. The market (S&amp;P 500) during the same period has returned just 3.82%.** A link to the November data is below \\[0\\]. \n\nTrying out different variants, I've looked at having higher-quality analysts only, and I've looked at different sectors. Health Technology, for example had just two companies score A+ that had market caps in excess of $5B (for safety of principal). **Those two companies have returned 32% and 68% since 11/24 when the score was run.** \n\nAnother variant, only using stocks covered by 10 analysts is where I've settled though for a trial run in a Public trading account. **There were 14 companies covered by 10 analysts in November and they have returned 22.56% since then.** \n\n# What Makes Up Your Portfolio?\n\nToday, there are 17 and I've already made the investments via Public and will continue to update here on Reddit, and on my YouTube channel. \n\nHere are the 17 stocks that I invested in:\n\n* Microsoft Corporation\n* Enbridge Inc\n* Equinix Inc\n* Global Payments Inc\n* HCA Healthcare Inc\n* ConocoPhillips\n* RingCentral Inc\n* Phillips 66\n* D. R. Horton Inc\n* Gaming and Leisure Properties Inc\n* Signature Bank\n* Builders FirstSource, Inc.\n* Lumentum Holdings Inc\n* Maravai Lifesciences Holdings Inc\n* Chart Industries, Inc.\n* Arena Pharmaceuticals, Inc.\n* Immunovant Inc\n\nEach month I will add new A+ stocks, and sell stocks that have dropped to B or below. Stock buys are for 5% of the portfolio. \n\nThe portfolio can be seen on the brokerage app Public, but I'm not certain I am allowed to link there in this subreddit. \n\n# Where Can I See The Data?\n\nI put the A+ companies up on Google Sheets. Google Sheets are a bit fickle, especially if something happens to the company (acquired etc.), but they work for quickly conveying the information. \n\nAbove, I promised the end of November / December data and that can be found here \n\n\\[0\\] [https://docs.google.com/spreadsheets/d/1OwlopOmSpdul\\_rtoDJ0B2Oov2nPbInHVIF\\_UQI6iMKw/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1OwlopOmSpdul_rtoDJ0B2Oov2nPbInHVIF_UQI6iMKw/edit?usp=sharing)\n\nThe current data (A+ rated stocks today) is here: [https://docs.google.com/spreadsheets/d/1jEGkmtRhjAMY106V283poSXvtI\\_yImy8C9ZFOOZOUlk/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1jEGkmtRhjAMY106V283poSXvtI_yImy8C9ZFOOZOUlk/edit?usp=sharing)\n\n&amp;#x200B;\n\nI am happy to answer any questions about the score, or any of my other scores if you've seen my other work. As with all the data I post, **this score is not the holy-grail,** it's probably not even a grail, honestly. For me it's another tool in the arsenal for finding great stocks.",
        "subreddit": "investing",
        "title": "The Analyst Score Update - Tracking Whether Analysts Are Good And Finding An Edge",
        "url": "https://www.reddit.com/r/investing/comments/kzwkbv/the_analyst_score_update_tracking_whether/",
        "created": 1611011890.0
    },
    {
        "author": "RobinKennedy23",
        "created_utc": 1610317178,
        "id": "kuojir",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi r/securityanalysis, I am trying to become better at researching investment ideas and here is a piece I recently put together. I would love some feedback and a discussion on your thoughts on it. \n\n**The Situation and Company Background**\n\nAffirm is a leading buy now, pay later (BNPL) provider that allows consumers to have the flexibility to pay for their purchase over a period of 6 weeks to 48 months with merchants that have added Affirm as a payment option. The company is expected to trade under the ticker “AFRM” and start trading next Wednesday with price talk around $38/share, which equates to an equity value of around $9.2B. This is a severely lower valuation than other fintech peers such as Afterpay, Square, and Shopify. We believe that AFRM should be valued at least $20B to $30B using a conservative FY23 EV/Sales total company comp of 13x compared to Afterpay at 18.3x, SHOP at 28.1x, and Visa and Mastercard around 16x. \n\nThe company mainly operates in the United States, and as of September 30th, has already partnered with over 6,500 merchants and has 3.9M active consumers but recently acquired PayBright, a Canadian based BNPL provider. Affirm generates most of their revenue through fees charged to merchants when a customer uses the BNPL option at checkout. Additionally, the company generates revenue through simple interest charged to consumers that have chosen to extend their payment options beyond the interest-free payment length. Merchant fees range from 2 – 3% while APR ranges from 0 – 30%. Additionally, the company earns fees through customers who utilize a virtual debit card, gains on loans sold to third-party investors, and servicing fees on loans managed by Affirm. \n\nIn FY20 (June end), Affirm saw +92.7% revenue growth to $509.5M, with $256.8M in merchant network revenue (50.4% of revenue) and $186.7M in interest income (36.6% of revenue). Additionally, active customers grew +76.9% to 3.62M active users and gross merchandise volume (GMV) grew +77.0% to $4.6B. We note that Affirm is currently reliant on one merchant, Peloton (PTON) for their revenue as the partner accounted for 28% of FY20 revenue and the top 10 merchants accounted for 35% of revenue. \n\n**Investment Thesis**\n\nWe believe that Affirm will be the dominant BNPL provider in the future in the United States that will benefit from increasing usage of BNPL at checkout. We anticipate Affirm’s recent partnerships with e-commerce platform Shopify (SHOP) and payment company Adyen (ADYEN.AS) will help drive a flywheel effect to allow Affirm to establish itself as the dominant BNPL provider in the United States as both platforms will help bring additional merchants and consumers onto the platform. We expect the Shopify partnership to help capture a differentiated market that is underserved compared to competitors Afterpay and Klarna. With the addition of Shopify, hundreds of thousands of vendors can now add a BNPL option seamlessly which will allow Affirm take market share, which will further drive the flywheel effect. \n\nWe also believe that Affirm provides a better product suite than competitors from the perspective of both the merchant and consumer. Affirm’s product provides more flexibility on payment term length compared to its competitors, offers virtual debit cards to allow consumers to use Affirm at retailers that have not currently partnered with Affirm, and a no fee and competitive high-yield savings account. Additionally, Affirm charges substantially lower merchant fees. Together, we believe merchants are more likely to choose Affirm when deciding on which BNPL company to implement, which will further compound the desirability of implementing Affirm as their consumer and merchant base grows.  \n\nFinally, we anticipate Affirm to serve a Millennial, Gen Z, and Gen X population that has not adopted credit card usage like their older generations. Their generations are more accustomed to online shopping and utilizing digital payments but have built a distrust in traditional credit due to seeing their older friends and family negatively impacted during the 2008 financial crisis.\n\n**Comparable Company Analysis and Valuation**\n\n[Comp Sheet](https://imgur.com/CLgDfsK) Source: Factset, and [Valuation](https://imgur.com/UM5iiOS) indicate a fair value of $20B to $30B equity value compared to IPO pricing of around $9.2B. This is another severely underpriced IPO that is poised to pop on the first day of trading. \n\n**Buy Now Pay Later Background**\nAffirm offers a new alternative way that people can transact. Consumers have been utilizing different methods to trade for goods and services since the dawn of man. Transactions have originally started through bartering for different items and goods and evolved into using coins made from precious metals as accepted methods of payment. In a more modern world, we have moved to utilizing paper currency and coinage, and more recently, into credit/debit and digital wallets. The way people shop has also significantly evolved throughout time. Gone are the days merchants carried their wares across different towns. Although we still have outdoor markets much like Greek agoras in 1,000 B.C., we have evolved in the way we pay for goods and services at markets. Local stores and department stores, which dominated the way consumers shopped in the 19th and 20th century, are in a decline. Now, we are entering a new period in how consumers shop; online. With this revolution, we can see continued shifts and advancement in the way people pay and we believe the “buy now pay later” option is the innovation that has the potential to upend the traditional credit/debit card market.\n\nAffirm will become the second largest publicly traded BNPL provider, behind Australia’s Afterpay. The BNPL payment option is an alternative way for a consumer to pay for product by providing flexibility regarding payment terms and is a point-of-sale (POS) loan.  Although the BNPL payment method is still miniscule compared to traditional payment methods such as credit and debit cards, accounting for approximately 1% of e-comm sales in 2019, Worldpay’s 2020 Global Payments report expects penetration to increase 3x to 3% of e-comm sales utilizing BNPL by 2023. In EMEA, the payment method is already more established and accounted for 6% of 2019 e-comm payments and Worldpay expects it to reach ~10% penetration by 2023. Market research company eMarketer estimated that U.S. consumers spent $590B on e-comm in 2019. According to the U.S. Census Bureau, the first 3 quarters of 2020 had 16.3% of retail sales ex-auto penetration through e-comm, compared to 12.5% in the same period LY, and e-comm dollars spent grew +34.2%. With the pandemic reshaping how consumers shop and accelerating the growth of e-comm sales usage and spending, we believe that BNPL usage could potentially beat Worldpay’s estimates. \n\nAnother key piece for Affirm’s success relates to their credit risk model. Unlike a traditional credit card where a consumer is approved for a credit limit at the time of application, Affirm provides a credit limit in addition to analyzing risk at the transaction level and can approve/reject purchases at the time of purchase. The company’s risk model has allowed them to approve 20% more customers compared to other competitors while still limiting delinquency and default rates. Additionally, their 36-month delinquency rate is more than 50% lower than the credit card industry average of 2.5%, with a rate of 1.1%. We also estimate that AFRM’s net charge-off rates are also about 50% lower than industry average, ending FY20 with 1.8% of loans charged off compared to the credit card industry average of 3.7% in the same period. Although traditional credit card companies can lower a consumer’s credit limit at any point in time, they are often slow to react as their algorithms rely on antiquated methods such as credit scores, transaction history, and credit usage. This indicates credit card algorithms are utilizing data that could be older than a month to make credit risk decision. Affirm’s proprietary risk model has brought the credit risk model into modern times with real-time economic data in addition to SKU level data to assess risk more advantageously and at a transactional level.\n\n**Why Affirm?**\n\nAlthough Affirm is not the only BNPL provider in the U.S. and was not the first provider, we believe that Affirm’s product suite is superior compared to competitors such as Afterpay and Klarna. Currently, Afterpay only lets consumers split their purchase into 4 interest free payments split in 2-week intervals across 4 payments, spreading payments across 6-weeks. Klarna’s product is essentially identical. Affirm allows consumers to split their purchases monthly for up to 48 months, with most interest free periods ranging up to 12 months. Additionally, we believe Affirm is more compelling for the retailer to utilize because the merchant fees charged are substantially lower (2 – 3%) vs. Afterpay (3 – 6%) and Klarna (up to 5.99%). Affirm also offers a virtual debit card, which lets you use your Affirm account to pay at retailers that have not currently partnered with Affirm as their chosen BNPL provider. \n\n[Affirm vs. Competitors](https://imgur.com/tVivw6t) Source: Company websites\n\n**How Can Affirm Continue to Grow and Improve?**\n\nAffirm is Still Missing Multiple Pieces to Become the Dominant BNPL Provider. Although we are bullish on Affirm’s long-term prospects and impressed with their current progress, we believe there is still room to improve. We believe two key components of a dominating alternative payment company are still missing, and once implemented, can accelerate new user adoption. (1) Affirm needs to implement a rewards program, similar to traditional credit cards and Klarna’s “Vibe” rewards program. Affirm highlighted most of their users have the ability to pay for their purchase in full but prefer the financial flexibility of splitting payments. We believe Affirm’s users are financially responsible consumers and may face hesitation to utilize the BNPL option vs. a credit card as there is no rewards/cash back offering at Affirm. We expect Affirm to offer a rewards program in the near future, which would impact profitability, but would help drive customer acquisition in the long-term. (2) A physical card that allows the user to utilize Affirm’s BNPL option in retail stores could help drive additional GMV growth. The card would be programmed to follow the merchant’s current agreement and timeframe of repayment that the merchant and Affirm have already agreed too. However, if the card is used at a non-partner merchant, AFRM would allow the card to be used as a 0% APR credit card with repayment term lengths determined by their proprietary credit risk model. Recall that a credit card was used to pay in 40% of in-store transactions, and we believe a physical card can help complete AFRM’s product suite. We also believe the card can help bring Affirm on equal footing with competitors that have partnered with substantially more merchants as consumers can use the Affirm card online with any merchant.\n\n**The Bears**\n\nAffirm is in a distant third place with 3.9M active users in the U.S. as of September 30, 2020, trailing Afterpay’s 6.5M active U.S. customers and Klarna’s 10M customers in the same period. Additionally, Affirm currently has 6.5k active U.S. merchant partnerships compared to Afterpay’s 13.9k U.S. partnerships and Klarna’s 235k+ global partners. Lastly, Affirm lags both competitors in GMV. Affirm saw $5.3B in TTM GMV compared to Afterpay’s $11.1B AUD and Klarna’s $35B+ USD from January to September 2020.  We do highlight that Affirm is the leader in average GMV/customer at $1,359 compared to Afterpay at $991 and Klarna at $412, which we believe is due to high exposure to PTON and other higher-AOV retailers.\n\nAffirm is still heavily reliant on Peloton (PTON), but we believe they have a symbiotic relationship. PTON offers Affirm as an option to finance equipment at 0% APR for up to 39 months. Our field checks and PTON’s 10-K indicate that substantial portion of PTON equipment purchases are financed through AFRM. AFRM also disclosed that 28% of FY20 revenue came from their PTON partnership. A big critique of AFRM’s business model is that they are too reliant on one merchant for their revenue. We believe that this could pose a risk in the intermediate future, but analysts expect PTON’s performance through FY2021 (June 30-end) to remain strong. PTON recently reported an explosive 1Q (Sept-30 end) with +233% revenue growth but +281% growth in their connected fitness segment, which is the segment that recognizes sales of their Peloton Bike. \n\n[PTON Connected Fitness Revenue Estimates](https://imgur.com/734f82O) Source: FactSet and PTON\n\n**Still Undervalued Excluding PTON**\n[Still valued at $22B excluding PTON revenue](https://imgur.com/M5aoT3p) Source: My estimates from backing out PTON revenue contribution\n\n**Valuation**\n\nWe use a blended valuation to arrive to a $94 implied value/share, which provides +147% upside to the high end of the IPO price talk of $33 to $38/share. Our valuation is based on a 75%/25% blend of a multiples-based analysis on FY2023E and a DCF model. Our EV/sales analysis assigns a 16x multiple on merchant network revenue, 12x multiple on interest income revenue, and a 2x multiple on servicing income, virtual card revenue, and gain on sale of loans. This provides a total company EV/sales multiple of 13x FY23 estimates. This is lower than APT’s 18.3x FY23 EV/sales multiple, which we believe is justified due to AFRM’s revenue mix that is more concentrated towards interest income revenue, lower GMV, fewer active customers, and high reliance on one merchant. However, AFRM is a fast-growing alternative payment company that is growing share in a fast-growing industry, has strong partnerships that we believe will help drive growth long-term, and a strong leadership team with successful experience in the internet/payment space. For DCF, we use a WACC of 10.9%.\n\n[13x FY23 EV/Sales Valuation](https://imgur.com/UM5iiOS) Source: FactSet, and [10 Year DCF Analysis](https://imgur.com/dItAhab) Source: My estimates\n\n[Finally, a more conservative sensitivity table indicates ~$73 valuation with a very conservative EV/sales multiple and lower 3-year CAGR assumption.](https://imgur.com/4FAtFHA) Source: My estimates\n\nNote: All ideas are my own and I will be buying the IPO on Wednesday. This does not constitute a recommendation to buy or sell any security discussed.",
        "subreddit": "SecurityAnalysis",
        "title": "AFRM: Another Underpriced IPO Worth Looking At",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kuojir/afrm_another_underpriced_ipo_worth_looking_at/",
        "created": 1610345978.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610717602,
        "id": "kxuli7",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "**Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon. \n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September. \n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products. \n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services.  Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally. \n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe. \n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50. \n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world? \n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future. \n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\n 🙏Thank you everyone for reading!🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "wallstreetbets",
        "title": "Amazon Stock 150% Upside?! |Amazon Stock Price Target Prediction &amp; Analysis | Buy or Sell [AMZN]?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kxuli7/amazon_stock_150_upside_amazon_stock_price_target/",
        "created": 1610746402.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610722862,
        "id": "kxw72v",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon.\n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September.\n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products.\n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services. Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally.\n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe.\n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world?\n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future.\n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\n🙏Thank you everyone for reading!🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "stocks",
        "title": "Amazon Stock 150% Upside?! |Amazon Stock Price Target Prediction &amp; Analysis | Buy or Sell [AMZN]?",
        "url": "https://www.reddit.com/r/stocks/comments/kxw72v/amazon_stock_150_upside_amazon_stock_price_target/",
        "created": 1610751662.0
    },
    {
        "author": "Professor_Smallz",
        "created_utc": 1609958404,
        "id": "kru3lb",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Global Payments gonna moon",
        "url": "https://i.redd.it/gx58fgdebr961.jpg",
        "created": 1609987204.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610718163,
        "id": "kxurbc",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**🚀🚀🚀Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!🚀🚀🚀**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon.\n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September.\n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products.\n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services. Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally.\n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe.\n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world?\n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future.\n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\n🙏Thank you everyone for reading!🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "stocks",
        "title": "Amazon Stock 150% Upside?! |Amazon Stock Price Target Prediction &amp; Analysis | Buy or Sell [AMZN]?🚀🚀🚀",
        "url": "https://www.reddit.com/r/stocks/comments/kxurbc/amazon_stock_150_upside_amazon_stock_price_target/",
        "created": 1610746963.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610718169,
        "id": "kxurdr",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**🚀🚀🚀Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!🚀🚀🚀**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon.\n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September.\n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products.\n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services. Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally.\n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe.\n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world?\n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future.\n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\n🙏Thank you everyone for reading!🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "StockMarket",
        "title": "Amazon Stock 150% Upside?! |Amazon Stock Price Target Prediction &amp; Analysis | Buy or Sell [AMZN]?🚀🚀🚀",
        "url": "https://www.reddit.com/r/StockMarket/comments/kxurdr/amazon_stock_150_upside_amazon_stock_price_target/",
        "created": 1610746969.0
    },
    {
        "author": "DumplingGoddessTe",
        "created_utc": 1610723228,
        "id": "kxwbo6",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Friday, 15 January 2021\n\n*Live Updates*\n\n&amp;#x200B;\n\n**First Post:**\n\n[https://www.reddit.com/r/wallstreetbets/comments/kuwg1e/i\\_have\\_a\\_discount\\_trading\\_bot\\_which\\_gives\\_out/](https://www.reddit.com/r/wallstreetbets/comments/kuwg1e/i_have_a_discount_trading_bot_which_gives_out/)\n\n&amp;#x200B;\n\n**Background:**\n\n* My discount bot to help /r/wallstreetbets. It took me almost a year to develop it to my standard.\n* My private codes was used to develop it, and it's very unlikely I will sell it off to anyone or publish the code freely as it took me way too long to develop it. I rather post updates freely, at no cost to anyone than give out the code.\n* I will not be posting this hourly. It just too long to load everything up maybe in the future. I will post during open though.\n* Discord and telegram admins, don't try to monetize my bot suggestions to vulnerable people, when you don't even own the codes behind it.\n* There are a lot of SPY500/\"boomer\" companies within the bot, I thought about removing it but many people preferred that I kept it in there.\n* There won't be any sell signals, as stocks only go up, so I rather just do a discount algorithm.\n* Batch 1 = Algorithm/Bot + Human Judgement\n* Batch 2 = Algorithm/Bot Judgement Only\n* This is a one man bot.\n\n&amp;#x200B;\n\n**Bot Overview**:\n\nIt's showing an opportunity that you may have missed otherwise, so you can decide for yourself if you want to pursue the discount of a stock for potential profits. Backtesting has not been done, do not YOLO your life savings into whatever stated risking it all.  Rather use this as a side tool.\n\n&amp;#x200B;\n\n**Key:**\n\n* Pharma companies are very risky.\n* Meme/Hype stocks are very risky.\n* Companies that you don't know how they work are very risky.\n* Follower companies are very risky because they join the hype train (what NKLA is to TSLA).\n* I have a very low amount in options (less than $500), and I have 100k+ in shares and cash.\n* When doing options have a lot of collateral, so you don't hit margin call.\n* Take the \"Calls\" as very discounted, and \"Potentially A Call\" as somewhat discounted.\n* Old money companies are slow. While tech companies are fast-paced.\n* Only invest in companies that you do know and see potential in.\n* You don't have to invest every day, only when you see the potential.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;***At Close of Thursday***\n\n&amp;#x200B;\n\n**Batch 1:**\n\n* Data Processing &amp; Outsourced Services\tMA\tMastercard Inc\n* Financial Exchanges &amp; Data\tMKTX\tMarketAxess Holdings Inc.\n* Financial Exchanges &amp; Data\tMSCI\tMsci Inc\n* BMS\tBraemar Shipping Services plc\n* CSRA\tCisadane Sawit Raya PT\n\n*Maybe*:\n\n* CRSR\tCorsair Gaming Inc\n* TWTR\tTwitter Inc\n* Data Processing &amp; Outsourced Services\tFLT\tFleetCor Technologies, Inc.\n* Data Processing &amp; Outsourced Services\tGPN\tGlobal Payments Inc\n* Data Processing &amp; Outsourced Services\tJKHY\tJack Henry &amp; Associates, Inc.\n* Environmental &amp; Facilities Services\tROL\tRollins, Inc.\n* Financial Exchanges &amp; Data\tCME\tCME Group Inc\n* Health Care Equipment\tBDX\tBecton Dickinson and Co\n* Health Care Equipment\tDXCM\tDexCom, Inc.\n* Industrial Conglomerates\tROP\tRoper Technologies Inc\n* Interactive Media &amp; Services\tTWTR\tTwitter Inc\n* Internet Services &amp; Infrastructure\tVRSN\tVerisign, Inc.\n* Managed Health Care\tHUM\tHumana Inc\n* Pharmaceuticals\tPRGO\tPerrigo Company PLC\n* Restaurants\tDPZ\tDomino's Pizza, Inc.\n* Restaurants\tMCD\tMcdonald's Corp\n* Research &amp; Consulting Services\tINFO\tIHS Markit Ltd\n* TYL\tTyler Technologies, Inc.\n* DPZ\tDomino's Pizza, Inc.\n* DXCM\tDexCom, Inc.\n* JKHY\tJack Henry &amp; Associates, Inc.\n* GPN\tGlobal Payments Inc\n* FB\tFacebook, Inc. Common Stock\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Batch 2:**\n\n&amp;#x200B;\n\nCall:\n\n* Facebook, Inc. Common Stock\tFB\n* Automatic Data Processing Inc\tADP\n* Fidelity National Information Servcs Inc\tFIS\n* Brown-Forman Corporation Class B\tBF.B\n* MarketAxess Holdings Inc.\tMKTX\n* S&amp;P Global Inc\tSPGI\n* Twitter Inc\tTWTR\n* HRL\n* Kraft Heinz Co\tKHC\n* IHS Markit Ltd\tINFO\n* Coca-Cola Co\tKO\n* MarketAxess Holdings Inc.\tMKTX\n* IHS Markit Ltd\tINFO\n\n&amp;#x200B;\n\nPotential Call:\n\n* Air Transport Services Group Inc.\tATSG\n* Adobe Inc\tADBE\n* Paycom Software Inc\tPAYC\n* salesforce .com, inc.\tCRM\n* Tyler Technologies, Inc.\tTYL\n* Las Vegas Sands Corp.\tLVS\n* Fiserv Inc\tFISV\n* Global Payments Inc\tGPN\n* Mastercard Inc\tMA\n* Paychex, Inc.\tPAYX\n* Cintas Corporation\tCTAS\n* Alliant Energy Corporation\tLNT\n* American Electric Power Company Inc\tAEP\n* Consolidated Edison, Inc.\tED\n* Dominion Energy Inc\tD\n* Entergy Corporation\tETR\n* WEC Energy Group Inc\tWEC\n* Moody's Corporation\tMCO\n* Msci Inc\tMSCI\n* Atmos Energy Corporation\tATO\n* Church &amp; Dwight Co., Inc.\tCHD\n* Kimberly Clark Corp\tKMB\n* Roper Technologies Inc\tROP\n* W W Grainger Inc\tGWW\n* Verisign, Inc.\tVRSN\n* Ball Corporation\tBLL\n* Ameren Corp\tAEE\n* CenterPoint Energy Inc\tCNP\n* NiSource Inc.\tNI\n* Pinnacle West Capital Corporation\tPNW\n* Campbell Soup Company\tCPB\n* General Mills, Inc.\tGIS\n* J M Smucker Co\tSJM\n* Kellogg Company\tK\n* Domino's Pizza, Inc.\tDPZ\n* Realty Income Corp\tO\n* Pfizer Inc.\tPFE\n* Atmos Energy Corporation\tATO\n* Msci Inc\tMSCI\n* SBA Communications Corporation\tSBAC\n* Alliant Energy Corporation\tLNT\n* Global Payments Inc\tGPN\n* Church &amp; Dwight Co., Inc.\tCHD\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;***At Open of Friday***\n\n&amp;#x200B;\n\n**Batch 1:**\n\n* NRGU\tMicroSectors U S Big Oil Index 3X Leveraged ETN\n* DIG\tProShares Ultra Oil &amp; Gas\n* CSRA\tCisadane Sawit Raya PT\n\nMaybe:\n\n* GUSH\tDirexion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Bl 2X Shs\n* ERX\tDirexion Daily Energy Bull 2x Shares\n* WTI\tW&amp;T Offshore, Inc.\n* BP\tBP plc\n* Aerospace &amp; Defense\tTDG\tTransDigm Group Incorporated\n* Diversified Banks\tWFC\tWells Fargo &amp; Co\n* Integrated Oil &amp; Gas\tHES\tHess Corp.\n* Oil &amp; Gas Equipment &amp; Services\tHAL\tHalliburton Company\n* Oil &amp; Gas Equipment &amp; Services\tFTI\tTechnipFMC PLC\n* Oil &amp; Gas Exploration &amp; Production\tDVN\tDevon Energy Corp\n* Oil &amp; Gas Exploration &amp; Production\tEOG\tEOG Resources Inc\n* WCG\tWebcentral Group Ltd\n* ADS\tAlliance Data Systems Corporation\n* RIG\tTransocean LTD\n* MAC\tMacerich Co\n* HP\tHelmerich &amp; Payne, Inc.\n* ARG\tArgos Resources Ltd\n\n&amp;#x200B;\n\n**Batch 2:**\n\n&amp;#x200B;\n\nCall:\n\n* Automatic Data Processing Inc\tADP\n* Fidelity National Information Servcs Inc\tFIS\n* Brown-Forman Corporation Class B\tBF.B\n* MarketAxess Holdings Inc.\tMKTX\n* S&amp;P Global Inc\tSPGI\n* Facebook, Inc. Common Stock\tFB\n* Twitter Inc\tTWTR\n* IHS Markit Ltd\tINFO\n* Kraft Heinz Co\tKHC\n* Coca-Cola Co\tKO\n* Hormel Foods Corp\tHRL\n* MarketAxess Holdings Inc.\tMKTX\n* Kraft Heinz Co\tKHC\n\n&amp;#x200B;\n\nPotential Call:\n\n* Air Transport Services Group Inc.\tATSG\n* Adobe Inc\tADBE\n* Paycom Software Inc\tPAYC\n* salesforce .com, inc.\tCRM\n* Las Vegas Sands Corp.\tLVS\n* Fiserv Inc\tFISV\n* Global Payments Inc\tGPN\n* Mastercard Inc\tMA\n* Paychex, Inc.\tPAYX\n* Cintas Corporation\tCTAS\n* Alliant Energy Corporation\tLNT\n* American Electric Power Company Inc\tAEP\n* Consolidated Edison, Inc.\tED\n* salesforce .com, inc.\tCRM\n* Msci Inc\tMSCI\n* SBA Communications Corporation\tSBAC\n* Dominion Energy Inc\tD\n* Entergy Corporation\tETR\n* WEC Energy Group Inc\tWEC\n* SBA Communications Corporation\tSBAC\n* Moody's Corporation\tMCO\n* Msci Inc\tMSCI\n* Atmos Energy Corporation\tATO\n* Church &amp; Dwight Co., Inc.\tCHD\n* Kimberly Clark Corp\tKMB\n* Roper Technologies Inc\tROP\n* W W Grainger Inc\tGWW\n* Verisign, Inc.\tVRSN\n* Ball Corporation\tBLL\n* Domino's Pizza, Inc.\tDPZ\n* Realty Income Corp\tO\n* Ameren Corp\tAEE\n* CenterPoint Energy Inc\tCNP\n* NiSource Inc.\tNI\n* Pinnacle West Capital Corporation\tPNW\n* Campbell Soup Company\tCPB\n* Domino's Pizza, Inc.\tDPZ\n* Paycom Software Inc\tPAYC\n* Las Vegas Sands Corp.\tLVS\n* Atmos Energy Corporation\tATO\n* General Mills, Inc.\tGIS\n* Kellogg Company\tK\n* Pfizer Inc.\tPFE\n* Alliant Energy Corporation\tLNT\n* Global Payments Inc\tGPN\n* Church &amp; Dwight Co., Inc.\tCHD\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Update:**\n\nIt will be posted on WSB approx one hour before open, and the prices at open will be added within the hour of open.\n\nI will update as I go. For feedback, live updates, backups throughout the day check /r/WallStreetTrader or my post history.\n\nClose Batch 1 added: 8:32 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nClose Batch 2 added: 8:41am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nWaiting for open sync.\n\nClose Batch 1 added: 9:52 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nClose Batch 2 added: 10:05 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA",
        "subreddit": "wallstreetbets",
        "title": "Post #5 Friday: I have a discount trading bot which gives out daily (well hourly discounts for the stock market). Here’s what the bot stated under discounted companies...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kxwbo6/post_5_friday_i_have_a_discount_trading_bot_which/",
        "created": 1610752028.0
    },
    {
        "author": "Torb231",
        "created_utc": 1611586752,
        "id": "l4pguq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n\n**Disclosure:** Own 10000 warrants, this is not financial advice, just my thoughts.\n\nAACQ (Artius Acquisition Corp) is a 525 million dollar blank check company targeting the fintech sector. The Spac consists of 52.5 million units at 10$ each, providing 1 common share and ⅓ warrant. It had an Ipo date of July 14th, 2020, which should give them until July 2022 to find a target. This Spac has very highly esteemed underwriters, with them consisting of Credit Suisse, and Goldman Sachs. \n\nCharles Drucker is a co-founder of this Spac. He has an extensive history in financials and fintech. He served as CEO and Executive Chairman at Worldpay, a U.K based payment processor with a focus on e-commerce and omni commerce. It works similarly to PayPal, but it is used by businesses only. In March 2019, Fidelity National Information Services ($FIS) acquired Worldpay in a part cash part equity buyout. This deal valued Worldpay at a whopping 43 Billion Dollars. Worldpay’s predecessor was Vantiv ($VNTV). Drucker served as Vantiv’s president for 5 years from 2004-2009, until in ‘09 he became the CEO. He led it through it’s IPO in 2012, and its merger with Worldpay, which resulted in the rebranding of the company. It became Worldpay ($WPY) from then until Worldpay’s buyout, and it outperformed the S&amp;P 500 nearly 7 fold from it’s IPO debut to buyout. Worldpay was responsible for processing over 40 billion transactions annually, supporting more than 300 payment types across 146 countries and 126 currencies. Drucker was also responsible for many landmark events during his time as CEO, as listed below.\n\n**2019 merger with FIS to create a global leader in financial and payments technology with approximately $12 billion in combined revenue and $5 billion in combined EBITDA at announcement;**\n\n**2017 acquisition of Worldpay Group plc, a leading global payments provider with the capability to deliver integrated omni-commerce solutions, for approximately $12 billion enterprise value;**\n\n**2017 acquisition of Paymetric Holdings, Inc., a provider of B2B payment workflow automation software within enterprise systems, for approximately $543 million enterprise value;**\n\n**2017 acquisition of Moneris Solutions, Inc.’s U.S. business, a provider of provider of payment processing solutions offering credit, debit, wireless and online payment services for merchants, for approximately $430 million enterprise value;**\n\n**2014 acquisition of Mercury Payment Systems, LLC, a provider of point-of-sale payments software across an extensive network of small and medium-sized businesses, for approximately $1.8 billion enterprise value; and**\n\n**2012 acquisition of Litle &amp; Co., LLC, a specialist in processing payments for internet retailers and direct marketers, for approximately $360 million enterprise value.**\n\nBoon Sim is the second, and last co-founder of this spac. Sim has a multi-decade career providing strategic advisory and investment services to boards and senior executives of multinational Fortune 500 corporations, governments and institutional investors. Sim also is the founder and managing partner of Artius Capital Partners, an investment firm focused on making private equity and growth investments in technology enabled businesses including software and fintech. This firm was founded in 2017, and prior to it, Sim served in many executive roles at Temasek International, an investment firm, owned by the Singaporean government. This firm manages roughly 230 billion dollars in assets, and Sim  had direct day-to-day responsibility for origination and investment of private equity and growth investments, public investments and buy-outs in North America. Prior to this, Sim was a senior executive at Credit Suisse, serving as the Global Head of Mergers &amp; Acquisitions. Credit Suisse also happens to be an underwriter for AACQ. \n\nAcquisition Criterium consist of, but are not limited to the following: \n\n**Have a large addressable market with a strong existing or potential customer base;**\n\n**Have a differentiated or unique product and technology offering with multiple avenues for growth and margin expansion;**\n\n**Have strong, experienced management teams, or provide a platform to assemble an effective management team with a track record of driving sustainable growth and profitability;**\n\n**Provide a platform for add-on acquisitions, which we believe will be an opportunity for our sponsor and its members and management team to deliver incremental shareholder value post-acquisition;**\n\n**Have a defensible market position, with demonstrated advantages when compared to their competitors and which create barriers to entry against new competitors;**\n\n**Are at an inflection point, such as requiring additional management expertise, or are able to innovate through new operational techniques, or where we believe we can drive improved financial performance;**\n\n**Have a recurring revenue model and generate high free cash flow;**\n\n**Are fundamentally sound companies that are underperforming their potential;**\n\n**Exhibit unrecognized value or other characteristics, desirable returns on capital, and a need for capital to achieve the company’s growth strategy, that we believe have been mis-valued by the marketplace based on our analysis and due diligence review;**\n\n**Will offer an attractive risk-adjusted return for our shareholders, potential upside from growth in the target business and an improved capital structure that will be weighed against any identified downside risks; and**\n\n**Can benefit from being publicly traded, are prepared to be a publicly traded company, and can utilize access to broader capital markets.**\n\nNon-Competition Agreement: \n\n**“Charles D. Drucker, our Co-Founder and Executive Chairman, is a party to a non-competition agreement that could limit the companies and businesses that we may target for an initial business combination. This could negatively impact our prospects for an initial business combination.**\n\n**Charles D. Drucker, our Co-Founder and Executive Chairman, is a party to an agreement (the “Non-Competition Agreement”) with FIS and Worldpay, which contains non-compete, non-solicitation, no-hire, confidentiality and non-disparagement provisions that are applicable until July 31, 2021. Among other things, the Non-Competition Agreement precludes Mr. Drucker from entering into an ownership, consulting or employment arrangement with, or rendering services for, any competing business of FIS or Worldpay, including businesses engaged in merchant processing services, gift, private label, stored value and prepaid card processing, electronic funds transfer services to business customers, payment and ATM network switching services, credit and debit card production, activation, replacement and related management services, certain payments-related reselling services, certain data processing services, and other value added services, promotional messaging and debit portfolio management services relating to the foregoing.**\n\n**It is Mr. Drucker’s and our intention that he observe all requirements of the Non-Competition Agreement, which may limit the companies or businesses that we may target for our initial business combination, make us a less attractive buyer to certain target companies, or limit Mr. Drucker’s role in a post initial business combination company.**\n\n**We may have a limited ability to assess the management of a prospective target business and, as a result, may affect our initial business combination with a target business whose management may not have the skills, qualifications or abilities to manage a public company, which could, in turn, negatively impact the value of our shareholders’ investment in us.”**\n\nWhile I don’t imagine this would be too big of an issue, it could limit the acquisition targets for AACQ. With this in mind, Drucker clearly is a smart guy who knows what he is doing, and I wouldn’t expect him to be on a spac’s team if he believed it would be a serious issue. \n\n**Pros:** \n\nBoth co-founders have extensive experience and history in financials/fintech. \n\nCo-founders have extensive experience in m&amp;a.\n\nGood underwriters (Credit Suisse and Goldman Sachs)\n\nWarrants and commons trade cheaper than other unannounced fintech spacs (Fuse, Gsah, Ajax, WPF.)\n\nGood amount of time to find a target.\n\n**Cons:** \n\nNon competition agreement could pose an issue.  \n\n\nTLDR:  \n\n\nSpacs only go up  🚀  🚀  🚀  🚀  🚀  🚀  🚀   \n\n\nSources:\n\n[https://fintel.io/doc/sec-artius-acquisition-inc-s1-2020-june-25-18592-710](https://fintel.io/doc/sec-artius-acquisition-inc-s1-2020-june-25-18592-710)\n\n[https://stockanalysis.com/stocks/aacq/](https://stockanalysis.com/stocks/aacq/)\n\n[https://theorg.com/org/worldpay/org-chart/charles-drucker](https://theorg.com/org/worldpay/org-chart/charles-drucker)\n\n[https://www.prnewswire.com/news-releases/vantiv-and-worldpay-complete-combination-to-form-worldpay-inc-300583008.html#:\\~:text=Payments%20and%20B2B.-,Worldpay%2C%20Inc.,and%20Worldpay%20Group%20plc](https://www.prnewswire.com/news-releases/vantiv-and-worldpay-complete-combination-to-form-worldpay-inc-300583008.html#:~:text=Payments%20and%20B2B.-,Worldpay%2C%20Inc.,and%20Worldpay%20Group%20plc).\n\n[https://www.forbes.com/sites/donnafuscaldo/2019/03/18/fis-buys-worldpay-for-35-billion-as-payment-consolidation-ensues/](https://www.forbes.com/sites/donnafuscaldo/2019/03/18/fis-buys-worldpay-for-35-billion-as-payment-consolidation-ensues/)",
        "subreddit": "SPACs",
        "title": "AACQ: A Comparatively Undervalued Fintech Spac",
        "url": "https://www.reddit.com/r/SPACs/comments/l4pguq/aacq_a_comparatively_undervalued_fintech_spac/",
        "created": 1611615552.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610717611,
        "id": "kxull1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon. \n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September. \n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products. \n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services.  Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally. \n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe. \n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50. \n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world? \n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future. \n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\n 🙏Thank you everyone for reading!🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "stocks",
        "title": "Amazon Stock 150% Upside?! |Amazon Stock Price Target Prediction &amp; Analysis | Buy or Sell [AMZN]?",
        "url": "https://www.reddit.com/r/stocks/comments/kxull1/amazon_stock_150_upside_amazon_stock_price_target/",
        "created": 1610746411.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1610717620,
        "id": "kxulpa",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Should you buy Amazon stock or has it run out of growth opportunities? What is my price prediction for Amazon? Read until the end of the post as I reveal my price target for Amazon and why I believe it can deliver insane returns!**\n\n**\\~Very Very Long Post\\~**\n\nHello everyone and welcome to another stock price prediction! Today we are going to talk about Amazon and what’s the upside for the company! So, let’s go over the company a little before moving on to some fundamental, technical analysis, predictions and my price target for the stock in the next years &amp; months.\n\nSo, let’s start by talking a little about [Amazon](https://ibb.co/47vPnY2), yeah, I know it’s one of the biggest companies in the world, but I believe Amazon is still undervalued &amp; underappreciated compared to some of the highflyers that have generate insane returns in the past months, though most of them are still far from profitability and don’t have the growth across all the board like Amazon. \n\nMaybe the market doesn't put as much attention in the numbers as I do but I would rather invest in a business which I consider to be healthy and growing rather than a what if stock like many of the recent inflated IPOs. Amazon is a trillion-dollar company growing at a double-digit pace as many companies that are a fraction of their size would kill for this numbers, but this hasn’t helped Amazon since September. \n\nOn a global scale e-commerce is expected to increase from 16% to 22% of retail sales by 2023. With the U.S. expected to increase its retail e-commerce sales from $374 billion to $476 billion by 2024.This is another thing that supports the growth that e-commerce has in front of it, both as total and as a % of the total retail sales. With the latest [report](https://ibb.co/jRMvB7x) showing a 24% increase in holiday e-commerce transactions and a 19% increase for the 2020 fiscal year.\n\nE-commerce is showing signs that it will continue to gain share of the total market as a recent report projects that digital sales during the Black Friday-to-Cyber Monday period will grow by about 35% YOY, reaching [penetration](https://ibb.co/3StWbwz) of around 32% and growing by more 10B, as this continues to eat up market share from more traditional B&amp;M retailers.\n\nI think one of the biggest problems the company has, it’s the actual share price of the company, not the value. We have seen that a stock split can and will attract more buyers and the share price would probably see an accelerated rate of growth, just look at what happened with Tesla and Apple [recently](https://ibb.co/GFqGsjV). By splitting the stock just like [Apple](https://ibb.co/d766wL5) has done a number of times, this allows more individual investors to invest in the company, as they will be attracted by the cheaper share price. [Amazon](https://ibb.co/XStd5Jf) hasn’t done a share split since the dot com era, and it might be time for the company to take advantage of this hot bull market to actually go ahead with something like at least a 5-10:1 split.\n\nSo, let’s go a little through the latest quarter [results](https://ibb.co/Y8JHWdc) and [guidance](https://ibb.co/mCT3T43). The company increased the operating cash flow by more than 55% to over $55B for the latest twelve months, with free cash flow also increasing by $6B, while they managed to avoid significant [dilution](https://ibb.co/6bYCLhx) of the company, with only 7M additional shares being outstanding.\n\nThe net sales also increased 37% in the last quarter to just over $96B, an increase of more than $26B over 2019, which is an insane 36% increase y/y yet again.\n\nThis year Amazon has also pushed their [Prime Day](https://ibb.co/1RPqhMv) ahead of schedule, which resulted in the two biggest days ever for third-party small &amp; medium sellers, which saw an increase in sales of over 60% over 2019, even bigger than Amazon own retail business.\n\nAmazon continues to expand into multiple revenue streams, with the first Amazon [Fresh](https://ibb.co/9ZBqwKM) grocery store opened in California, which is offering both in-store and online products. \n\nWe also saw Amazon’s more profitable revenue streams meaning the services revenues increasing, with Amazon Studios continuing to produce original movies and TV-series while also expanding their offering to live sport games.\n\nThe company is also seeking to expand into the red-hot Video Gaming market, as they launched a new service Prime Gaming, available for free for Prime Members and also announced Luna which will be a cloud gaming service that will allow customers to play high-quality games on previously owned devices, thus not requiring bigger investments for many customers. They also continued to improve their [devices](https://ibb.co/VVkyDXX) like the Echo, Alexa, Ring and FireTV line of products, which feature more &amp; more AI Improvements.\n\nAmazon has also announced an expansion into the pharmacy business which put a lot of pressure on traditional pharmacy companies like CVS &amp; Walgreens, while also announcing a new Halo service, aimed at helping customers improve their lifestyle.\n\nI like companies that make me a lot of money, but I also like that they are [involved](https://ibb.co/r7C6NXs) in projects aimed at helping poorer communities around the world, with their latest Project Kuiper, being a low-earth orbit satellite constellation that is aiming to provide reliable &amp; cheap internet access around the world.\n\nAnd last but not least, let’s not forget about the biggest income provider as margin goes, the Amazon Web Services ([AWS](https://ibb.co/MkHgG7d)). Amazon continued to see significant customer demand for this product with multiple big companies like Global Payments &amp; Moderna using their services.  Alongside these 2 companies we also saw AWS providing even more data services for the [NFL](https://ibb.co/zbYySCp) and many more other companies. AWS has been a terrific revenue stream for Amazon, with [AWS](https://ibb.co/87614m9) having 1/3 of the market share for cloud infrastructure in the first half of 2020, as the compound annual growth of AWS has been 40% in the recent years, just below the other profitable [services](https://ibb.co/0Byn2R7) they offer on subscriptions services, advertising &amp; payments, with the only revenue stream seeing a negative growth being the physical stores.\n\nOverall, the company has seen a 28% compound annual [growth](https://ibb.co/mCwDCTb) in revenues since 2016 and an even bigger 68% [growth](https://ibb.co/jk57Qq9) in earnings/share, which is incredible to say the least.\n\nSo, before even starting, you should now that I am bull on Amazon but I am willing to hear other opinions so don’t be afraid to leave a comment down below!\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nFirstly, let’s start with the Guidance that Amazon gave us for the 4th quarter, as they are expecting net sales between $112B and $121B implying a growth of between 28-38% over 2019. They also provided guidance for the operating income but this is heavily impacted by the problems we had in 2020 and that still continue to be around.\n\nThe company also is aiming to [optimize](https://ibb.co/0ZTfncc) the free cash flow which was up 26% y/y for Q3, as they are trying to dilute the shares as little as possible. The total net [SALES](https://ibb.co/7jsRCN5) for the last twelve months is nearing $348B which even adjusted for forex is still up 31%. Amazon has only 12% of their revenues coming the AWS right now, but this is by far the most profitable revenue for the company, as the increases in AWS sales have led to an over 90% [increase](https://ibb.co/ts6VKrb) in operating income from the previous year.\n\nLet’s take a look at the last quarter’s results. We saw a big [INCREASE](https://ibb.co/qrpk3wR) in all 3 big revenue streams for Amazon, with the first 9 months of 2020 brining over $160B in sales in North America, $67B from International sales and almost $33B from AWS. For my [projections](https://ibb.co/4FCPJ8N) I actually just added another quarter like this one to the end results, which actually is a conservative estimate of $96B compared to the guidance of $112B, and the growth rate that Amazon’s net sales has seen in the past year, with North America Sales rising by 37%, International by 31% and AWS by 30%.\n\nFor the cost of sales, I did pretty much the same, and with cost [margin](https://ibb.co/wcP1Wrj) standing at 75% of net sales for the last quarters I think this is pretty safe to say it will remain mostly the same if not even improve due to bigger revenues from the AWS. I also estimated the full yearly costs by adding another identical quarter, just like for the revenues, so that things stay even.\n\nFor the other operating expenses, I also took this from their financials as I expect both [SG&amp;A](https://ibb.co/QN7YWxQ) and [R&amp;D](https://ibb.co/DwmXmsK) expenses to start to normalize a little after the huge spending to ramp up capacity this year due to the increase in demand, while I also did the same thing for the [Capex](https://ibb.co/f0dSK7B) spending of Amazon, as they have invested massively in the last 12 months to ramp up things.\n\nMeanwhile for the interest [income](https://ibb.co/rdc1HRZ) and expenses I also just averaged things out for the full year while maintaining the other sources of income, but these have such a small impact that they don’t even matter.\n\nAmazon has had a pretty wild effective [TAX RATE](https://ibb.co/N3vtKJn) in the past decade, but I decided to see what the avg was for the last 4years, and that was 16%, but for safety and due to the change in administration in the US I decided to bump this up a little to 18%.\n\nAnd one last number that is important is [THE](https://ibb.co/SnQGLXT) earnings before interest, taxes, depreciation and amortization, which has seen a 36% increase y/y for since 2016.\n\nSo, let’s start with the Unleveraged discounted free cash flow [PROJECTIONS](https://ibb.co/89jHggN), though this is not my favorite type of projections we will get to that very soon.\n\nI used the trailing Twelve-month EBITA (which means Earnings before Interest, Tax, Depreciation &amp; Amortization) and assumed a growth starting from of 15% in 2021 and slightly lower each year ending with a 10% growth for EBITA in 2025. EBIT is calculate after subtracting the depreciation and amortization costs from the EBITA for which I implied an annual increase of 10% so it keeps the pace with the EBITA. I used my projection of the effective tax rate of the company of 18%, which is 2% above the last 4 years avg. NWC is the net working capital of the company and it can be summed up in 2 ways, the simpler method is current assets – current liabilities or you can use the more complex formula which I have used which is made up of the total amount of cash &amp; cash equivalents, market investments, trade accounts receivable and inventory from which you subtract the trade accounts payable, so this is the formula I used for this DCF. I also implied the same 10% growth for this, as the company will become even more solvent overtime I estimate. And last but not least I implied a 10% growth for Capital Expenditure as well, which seems pretty reasonable despite this level being very high due to the rapid growth of the company.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for this company I think the growth approach is better suited as you will see with my other method, which will show close results to growth approach.\n\nSo, this means we have an estimated $584B worth of FCF for a 10% discount rate, which I believe can be even lower for Amazon, but just to be conservative let’s use this 10% rate for the next 5 years. I also assumed the company will continue to grow at a 5% rate after 2025, and that would mean that Amazon will be worth over $3T by 2025, which is mind blowing. So, let’s do the math, with an estimated diluted share count of 531M, that would mean a stock price of $5732 and would imply a return of 83% by 2025. This are insanely huge numbers so let’s take a look at the EBITDA approach also. The nominal value for the EBITDA multiple is usually 25, so, with this multiple, the company would only be worth $3200, that would be only a 2.6% gain from where it is now. If you do want to be conservative you can also do an average of this and the average price would be $4470, with an average return of 43%, which would be pretty much in line with the annual SP500 growth. You can also check and do your own multiple valuation of the company, for example with Amazon right now has been trading at very high EBITDA multiple until recently, so if you use a 50x [multiple](https://ibb.co/VWDxGcg), the actual projections of the stock would be very close, with 71% return for the EBITDA approach and a 77% upside on average, but I think now is the time we move on to my favorite valuation approach, which is not the DCF method.\n\nI like to value companies based on multiples of future price earnings. So, let’s take a look at what Amazon earnings/share will be by 2025.\n\nI implied for the 3 main streams of [revenues](https://ibb.co/KVnYyqC) which are North American Sales, International Sales and AWS sales a rate of growth similar to the one we had this year but with gradual declines each subsequent year. I also used pretty much the same average [cost of sales](https://ibb.co/3sv40Sf) which includes the actual cost of sales and the fulfillment costs. This has stood at about 75% of the net revenues for the past years and might actually improve, but I do want to stay on the safe side. So, by 2025 the gross [REVENUES](https://ibb.co/xSdQX9P) should reach around $244B, assuming margins stay pretty much in line, though it’s likely they will improve margins, with International sales becoming a little more profitable and AWS brining more &amp; more money.\n\nWe also have to estimated what the Capex &amp; Operating [expenses](https://ibb.co/HHM0PfS) would be by 2025. I think Amazon should see somewhat of a slowdown of Capex, R&amp;D &amp; SG&amp;A spending, as they have seen a huge boost in the past year, and I think it should normalize, so I will imply an 8% annual growth for these, which is still very high.\n\n[Next](https://ibb.co/F75r4jN), we look at the interest income, expense and other losses or incomes for the company. This numbers are small compared to the vast cash flows of the company that they can even be ignored, but let’s assume they see a 10% decrease both in income and expenses related to interest while also not suffering losses but having a smaller other income by 10%/year. This would results in an almost $114B income pre-tax for 2025.\n\nAs I showed you earlier, the effective tax rate for Amazon has been around 16% in the past 4 years, despite the nominal US tax rate. For safety reasons I will use an 18% tax rate, though this should stay closers to 16% on the back of the International taxes. So, with an 18% tax rate, the [FINAL](https://ibb.co/d7ZCstY) income for the company after everything has been taken into consideration should be $93.25B.\n\nFor the outstanding [shares](https://ibb.co/x33HyxP), I will be conservative and imply a .5% increase in outstanding shares, as the company has been very careful in avoiding the dilution of the stock. So, with that increase by 2025, we should have around 531M shares.\n\nSo, [BASED](https://ibb.co/282sK42) on Price to Future Earnings/share we can see Amazon is currently trading at almost 18 times 2025 earnings/share, which compared to the 90 multiple it’s trading right now would be insanely low. I can see Amazon continuing to trade at very high P/E for the foreseeable future. So, with a 25 PE price the company should trade at 4400$, while with a 50 PE ratio, the stock should be close to 9000$/share, which is insane when you think about that number, but maybe Bezos will listen and split the shares finally. \n\n[Compare](https://ibb.co/ChhMP6Z) this to the [DCF](https://ibb.co/1TM7FWd) valuation and you see that the Perpetuity approach is similar to a 35 PE ratio, while the AVG approach is similar to a 25 PE Ratio, which I don’t expect Amazon to trade at, not even in 5 years.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/2d2KPV4) are my actual price targets… I think the bear case 2025 price we can see Amazon trade at is $4828 which would imply a return of over 54%, while my base case and my pretty safe assumption is that Amazon will trade at 6145$/share by the end of 2025, implying a 96.5% return on the [current price](https://ibb.co/FwrMhnY). My most bullish case though is $7900, which would imply a return of 152%, with that number being mind-blowing given the current valuation of the company… but I guess we do have to start getting used with such high numbers… I guess decades ago when we saw the first millionaire or billionaire, people would have also thought that it was crazy… but crazy is for the limited minds only I believe. \n\nSo yeah guys, here is my [OVERALL](https://ibb.co/XF5h87q) price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 40 PE’s with the most bullish case valuing the company between a PE of 40-50. \n\nSo [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/edit) is the full spreadsheet that I have projected for Amazon by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nKeep in mind, these targets might sound ridiculous, but just look at the growth Amazon has in the past. The company has increased in [value](https://ibb.co/QpDg4mp) by more 450% in just the past 5 years and is over 160.000% up since it started [trading](https://ibb.co/KyDzqWq). So yes, the valuation is mad right now for the company. So, are you willing to bet against one of the biggest and fastest growing companies in the world? \n\nThe company also has pristine [FINANCIALS](https://ibb.co/Bgxf91m), with more than $112B in current assets vs only $102B in current liabilities, with over $282B in total assets. So, the company is way more than solvable at any point in the near future. \n\nAnd let’s also take a look at what the estimates are from the analysts. We can see that the analysts expect a similar [EPS](https://ibb.co/R48nrDF) by 2025, of around $166 compared to $171/shares that my Growth Valuations are projecting. So, it seems that this could be a very reasonable upside for the company.\n\nSo, what do I expect in the next couple of days, weeks and months for Amazon?\n\nLet’s look at this [CHART](https://ibb.co/kHwWq4x), so starting with the high the stock made before the September sell-off. The stock has been trading in this wedge formation for the last couple of months with increasingly higher lows. The stock isn’t overbought and hasn’t been since it saw an RSI of 73 when it reached the all-time highs. I think with this wedge formation building up, with increasing higher lows and with the pattern of trading likely being an Elliot Theory 5 [WAVE](https://ibb.co/MBqPyc2) formation, I think it’s very likely we see a breakout in the near future, maybe just before earnings, and I expect this breakout to mimic the last run the stock had of about 23% up. So, with that 23% increase mirrored that would result the stock should peak around $[3900](https://ibb.co/VBpRv6j), which I expect to see by the end of the year.\n\nAnd let’s take a quick look at what 47 [analysts](https://ibb.co/YT0BPTP) on wall street are saying. They are mostly very bullish on the company with an average price target of $3800 and a high price target of $4600 which is insane for a return in the next 12 months, as 46 of the 47 analysts are either bullish or very bullish on Amazon. So yet again, the $3900 isn’t that out of possibilities even as Wall Street’s analysts expect\n\nSo, what would I do? Well, I own Amazon stock and I believe it still has tremendous room to grow, so I would start building a position as I expect the company to resume its uptrend sooner rather than later and the next catalyst may be just a couple of weeks away with the last quarter [earnings](https://ibb.co/nLhCJpk) expected to be announced by the end of January.\n\nAnd I shouldn’t forget to mention that I believe Amazon is one of the most stable stocks out with very good [leadership](https://ibb.co/7KS3yS6), and with large institutional [holders](https://ibb.co/8Dj1W3C) like Vanguard, BlackRock and Morgan Stanley owning huge amounts of the company.\n\nSo, [THIS](https://ibb.co/2d2KPV4) are my projections and my expectations for the company, and if you do want to check out the spreadsheets you can find the link [HERE](https://docs.google.com/spreadsheets/d/1O_rAl569qptpB1n1k6hpLLdOroX045_JDHrXLj81-u0/)\n\n 🙏Thank you everyone for reading!🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗",
        "subreddit": "StockMarket",
        "title": "Amazon Stock 150% Upside?! |Amazon Stock Price Target Prediction &amp; Analysis | Buy or Sell [AMZN]?",
        "url": "https://www.reddit.com/r/StockMarket/comments/kxulpa/amazon_stock_150_upside_amazon_stock_price_target/",
        "created": 1610746420.0
    },
    {
        "author": "ILikeMoney4561",
        "created_utc": 1609783016,
        "id": "kqdvz9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I am 20 years old hoping to have steady growth for my future. I'm a broke college student so not too much to play with.\n\nCurrently have around 5500$ in a robinhood account and 1200$ in a ROTH(VTI,VXUS,BND). Any input for changes I should make would be greatly appreciated\n\nIf it is helpful my robinhood portfolio is along the lines of:\n\nPercentages are really random, but they are calculated as follows:\n\nMSFT: 7.5%, V: 3.8%, TSLA: 7%, DIS: 10.6%, SAVE: 7.8%, WM: 3.6%, WMT: 2.7%, LMT: 7.2%, LW: 6.5%, GPN: 4%, RTX: 4.7%, UCO: 6.7%, MMM: 3.9%, DVN: 4%, C: 4%, O: 10%, ARKF: 5%, little bit of VGT",
        "subreddit": "investing",
        "title": "Unsure what to do with my money",
        "url": "https://www.reddit.com/r/investing/comments/kqdvz9/unsure_what_to_do_with_my_money/",
        "created": 1609811816.0
    },
    {
        "author": "AA92",
        "created_utc": 1610981995,
        "id": "kzw7r6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey Everyone! I am back with The Analyst Score today. I've posted about this score a couple of times on Reddit, but I've been having troubles gathering the needed data. Well, I got access to some new data, so it's back.\n\nI love this score because in the past it has shown great, market beating returns, while holding what I'd consider some great companies. Of course, the nature of the score and the data means that I cannot backtest, so I have no idea how this will eventually perform in a bear market.\n\n# How It Works\n\nI monitor the day-to-day changes in analyst recommendations for *almost* every stock. Why? Well because I wanted to know how analysts perform as a collective. The answer, it seems, is quite well.\n\nI store all of the analyst recommendations and then once a month bundle all the changes up together, weight all the companies against each other, and give them a letter grade (A+ through F). The stocks you'll see mentioned throughout this post are A+ rated stocks. To be an A+ rated stock, a company must have only had buy recommendations by at least five \"good\" (according to my model) analysts.\n\n# How Has The Score Performed?\n\nStocks meeting the top criteria in July 2020 have returned more than 70% since then (as a basket). Stocks in the November run (my last run) have performed admirably too. **All A+ rated stocks have returned 18.48%, while narrowing things down to larger firms (say over $2B) have returned 22.55%. The market (S&amp;P 500) during the same period has returned just 3.82%**. A link to the November data is below \\[0\\].\n\nTrying out different variants, I've looked at having higher-quality analysts only, and I've looked at different sectors. Health Technology, for example had just two companies score A+ that had market caps in excess of $5B (for safety of principal). **Those two companies have returned 32% and 68% since 11/24 when the score was run.**\n\nAnother variant, only using stocks covered by 10 analysts is where I've settled though for a trial run in a Public trading account. **There were 14 companies covered by 10 analysts in November and they have returned 22.56% since then.**\n\n# What Makes Up The Portfolio?\n\nToday, there are 17 and I've already made the investments via Public and will continue to update here on Reddit, and on my YouTube channel.\n\nHere are the 17 stocks that I invested in:\n\n* Microsoft Corporation\n* Enbridge Inc \n* Equinix Inc \n* Global Payments Inc \n* HCA Healthcare Inc \n* ConocoPhillips \n* RingCentral Inc \n* Phillips 66 \n* D. R. Horton Inc \n* Gaming and Leisure Properties Inc \n* Signature Bank \n* Builders FirstSource, Inc. \n* Lumentum Holdings Inc \n* Maravai Lifesciences Holdings Inc \n* Chart Industries, Inc. \n* Arena Pharmaceuticals, Inc. \n* Immunovant Inc\n\nEach month I will add new A+ stocks, and sell stocks that have dropped to B or below. Stock buys are for 5% of the portfolio.\n\nYou can see/track the portfolio on Public: [https://public.com/ashjanderson](https://public.com/ashjanderson)\n\n# Where Can I See The Data?\n\nI put the A+ companies up on Google Sheets. Google Sheets are a bit fickle, especially if something happens to the company (acquired etc.), but they work for quickly conveying the information.\n\nAbove, I promised the November data and that can be found here\n\n\\[0\\] [https://docs.google.com/spreadsheets/d/1OwlopOmSpdul\\_rtoDJ0B2Oov2nPbInHVIF\\_UQI6iMKw/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1OwlopOmSpdul_rtoDJ0B2Oov2nPbInHVIF_UQI6iMKw/edit?usp=sharing)\n\n**The current data (A+ rated stocks today) is here:** [https://docs.google.com/spreadsheets/d/1jEGkmtRhjAMY106V283poSXvtI\\_yImy8C9ZFOOZOUlk/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1jEGkmtRhjAMY106V283poSXvtI_yImy8C9ZFOOZOUlk/edit?usp=sharing)\n\nI am happy to answer any questions about the score, or any of my other scores if you've seen my other work. As with all the data I post, **this score is not the holy-grail**, it's probably not even a grail, honestly. For me it's another tool in the arsenal for finding great stocks.",
        "subreddit": "stocks",
        "title": "Are Analysts Ever Right? | The Analyst Score January 2021 Update",
        "url": "https://www.reddit.com/r/stocks/comments/kzw7r6/are_analysts_ever_right_the_analyst_score_january/",
        "created": 1611010795.0
    },
    {
        "author": "LeftWarthog5",
        "created_utc": 1611634216,
        "id": "l55uwq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SPACs",
        "title": "Foley Trasimene Acquisition Corp. II and Paysafe, A Leading Global Payments Provider Focused on Digital Commerce and iGaming, Announce Merger",
        "url": "https://www.paysafe.com/ca-en/paysafegroup/news/detail/foley-trasimene-acquisition-corp-ii-and-paysafe-a-leading-global-payments-provider-focused-on-digital-commerce-and-igaming-announce-merger/",
        "created": 1611663016.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1609689923,
        "id": "kpn2s9",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "What's up fellas at Options. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n&amp;#x200B;\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|WORK - Slack Technologies Inc - Class A|20.7B|$42.24|9%|\n|SPY - SSgA Active Trust - SSGA SPDR S&amp;P 500|330B|$373.88|16%|\n|VZ - Verizon Communications Inc|243B|$58.75|18%|\n|PEP - Pepsico Inc.|205B|$148.42|19%|\n|TM - Toyota Motor Corporation - ADR|252B|$154.57|20%|\n|COST - Costco Wholesale Corp|167B|$376.75|20%|\n|WMT - Walmart Inc|408B|$144.15|21%|\n|PG - Procter &amp; Gamble Co.|345B|$139.14|21%|\n|HD - Home Depot, Inc.|286B|$265.62|21%|\n|WM - Waste Management, Inc.|49.8B|$117.93|21%|\n|ORCL - Oracle Corp.|190B|$64.69|21%|\n|CSCO - Cisco Systems, Inc.|189B|$44.73|22%|\n|HSY - Hershey Company|31.7B|$152.33|22%|\n|MCD - McDonald\\`s Corp|160B|$214.58|22%|\n|KO - Coca-Cola Co|236B|$54.84|22%|\n|KR - Kroger Co.|24.2B|$31.76|23%|\n|QQQ - Invesco Capital Management LLC - Invesco QQQ Trust Series 1|153B|$314.19|23%|\n|NKE - Nike, Inc. - Class B|222B|$141.47|25%|\n|YUM - Yum Brands Inc.|32.7B|$108.56|25%|\n|MMM - 3M Co.|101B|$174.79|25%|\n|JNJ - Johnson &amp; Johnson|414B|$157.38|26%|\n|LOW - Lowe\\`s Cos., Inc.|118B|$160.51|26%|\n|T - AT&amp;T, Inc.|205B|$28.76|26%|\n|V - Visa Inc - Class A|482B|$218.73|26%|\n|MO - Altria Group Inc.|76.2B|$41.00|26%|\n|TGT - Target Corp|88.4B|$176.53|27%|\n|ABT - Abbott Laboratories|194B|$109.49|27%|\n|IWM - BlackRock Institutional Trust Company N.A. - BTC iShares Russell 2000|58.7B|$196.06|27%|\n|DE - Deere &amp; Co.|84.3B|$269.05|27%|\n|CVS - CVS Health Corp|89.4B|$68.30|27%|\n|BMY - Bristol-Myers Squibb Co.|140B|$62.03|27%|\n|DPZ - Dominos Pizza Inc|15.1B|$383.46|27%|\n|HSBC - HSBC Holdings plc - ADR|106B|$25.91|28%|\n|BX - Blackstone Group Inc (The) - Class A|43.7B|$64.81|28%|\n|DLTR - Dollar Tree Inc|25.4B|$108.04|28%|\n|ADBE - Adobe Inc|240B|$500.45|28%|\n|AZN - Astrazeneca plc - ADR|131B|$49.98|29%|\n|MSFT - Microsoft Corporation|1.68T|$222.83|29%|\n|SBUX - Starbucks Corp.|125B|$107.05|29%|\n|JPM - JPMorgan Chase &amp; Co.|387B|$127.07|29%|\n|HPQ - HP Inc|31.7B|$24.59|29%|\n|IBM - International Business Machines Corp.|112B|$125.88|29%|\n|UNH - Unitedhealth Group Inc|333B|$350.68|29%|\n|PFE - Pfizer Inc.|205B|$36.81|30%|\n|SNE - Sony Corporation. - ADR|127B|$101.10|30%|\n|DELL - Dell Technologies Inc - Class C|53.1B|$73.29|30%|\n|MA - Mastercard Incorporated - Class A|353B|$356.94|31%|\n|TXN - Texas Instruments Inc.|151B|$164.19|31%|\n|CRM - Salesforce.Com Inc|204B|$222.53|31%|\n|CAT - Caterpillar Inc.|98.9B|$182.02|31%|\n|BK - Bank Of New York Mellon Corp|37.6B|$42.44|31%|\n|BAC - Bank Of America Corp.|262B|$30.31|31%|\n|FDX - Fedex Corp|68.8B|$259.62|32%|\n|GS - Goldman Sachs Group, Inc.|90.7B|$263.71|32%|\n|ATVI - Activision Blizzard Inc|71.8B|$92.84|32%|\n|GOOGL - Alphabet Inc - Class A|1.18T|$1752.52|32%|\n|GOOG - Alphabet Inc - Class C|1.18T|$1753.86|32%|\n|WMB - Williams Cos Inc|24.3B|$20.05|32%|\n|UPS - United Parcel Service, Inc. - Class B|146B|$168.40|32%|\n|DIS - Walt Disney Co (The)|328B|$181.18|32%|\n|EA - Electronic Arts, Inc.|41.6B|$143.73|33%|\n|DD - DuPont de Nemours Inc|52.2B|$71.11|33%|\n|MS - Morgan Stanley|124B|$68.53|34%|\n|BKNG - Booking Holdings Inc|91.2B|$2224.35|34%|\n|GILD - Gilead Sciences, Inc.|73B|$58.27|34%|\n|NVDA - NVIDIA Corp|323B|$522.43|36%|\n|AMAT - Applied Materials Inc.|78.9B|$86.37|36%|\n|LULU - Lululemon Athletica inc.|43.5B|$348.13|36%|\n|AMZN - Amazon.com Inc.|1.63T|$3258.85|36%|\n|CMG - Chipotle Mexican Grill|38.8B|$1386.71|37%|\n|WDAY - Workday Inc - Class A|43.1B|$239.89|37%|\n|C - Citigroup Inc|128B|$61.66|37%|\n|GOLD - Barrick Gold Corp.|40.5B|$22.78|37%|\n|SPLK - Splunk Inc|27.5B|$169.99|37%|\n|EBAY - EBay Inc.|34.6B|$50.24|38%|\n|FOXA - Fox Corporation - Class A|17.3B|$29.12|38%|\n|TSM - Taiwan Semiconductor Manufacturing - ADR|565B|$109.04|38%|\n|AAPL - Apple Inc|2.26T|$132.65|38%|\n|BABA - Alibaba Group Holding Ltd - ADR|630B|$232.73|39%|\n|DB - Deutsche Bank AG|22.5B|$10.90|39%|\n|GM - General Motors Company|59.6B|$41.64|39%|\n|NOW - ServiceNow Inc|107B|$550.43|39%|\n|TTWO - Take-Two Interactive Software, Inc.|23.9B|$207.84|39%|\n|XOM - Exxon Mobil Corp.|174B|$41.22|40%|\n|F - Ford Motor Co.|34.3B|$8.79|40%|\n|QCOM - Qualcomm, Inc.|172B|$152.50|40%|\n|LOGI - Logitech International S.A.|16.8B|$97.21|40%|\n|LUV - Southwest Airlines Co|27.5B|$46.61|40%|\n|ARKF - ARK ETF Trust - ARK Fintech Innovation ETF|1.94B|$49.71|40%|\n|FB - Facebook Inc - Class A|780B|$273.59|40%|\n|ULTA - Ulta Beauty Inc|16.2B|$287.25|40%|\n|INTC - Intel Corp.|204B|$49.84|41%|\n|ARKW - ARK Investment Management LLC - ARK Next Generation Internet ETF|5.3B|$146.36|41%|\n|LVS - Las Vegas Sands Corp|45.5B|$59.60|41%|\n|WFC - Wells Fargo &amp; Co.|125B|$30.18|41%|\n|PZZA - Papa John\\`s International, Inc.|2.8B|$84.90|41%|\n|PYPL - PayPal Holdings Inc|274B|$234.58|41%|\n|MELI - MercadoLibre Inc|83.5B|$1673.23|41%|\n|WBA - Walgreens Boots Alliance Inc|34.5B|$39.88|41%|\n|ALLY - Ally Financial Inc|13.3B|$35.66|42%|\n|FIT - Fitbit Inc - Class A|1.67B|$6.80|42%|\n|TWTR - Twitter Inc|43.1B|$54.15|43%|\n|BP - BP plc - ADR|69.3B|$20.52|44%|\n|NFLX - NetFlix Inc|239B|$541.00|44%|\n|TEVA - Teva- Pharmaceutical Industries Ltd. - ADR|10.5B|$9.65|45%|\n|OKTA - Okta Inc - Class A|30.8B|$254.33|45%|\n|JD - JD.com Inc - ADR|137B|$87.96|45%|\n|RH - RH - Class A|9.13B|$447.52|45%|\n|PCG - PG&amp;E Corp.|24.7B|$12.46|45%|\n|EXPE - Expedia Group Inc|18B|$132.40|46%|\n|VALE - Vale S.A. - ADR|88.6B|$16.76|46%|\n|PBR - Petroleo Brasileiro S.A. Petrobras - ADR|23.5B|$11.23|46%|\n|UBER - Uber Technologies Inc|90B|$51.00|46%|\n|BA - Boeing Co.|121B|$214.06|47%|\n|ESTC - Elastic N.V|12.8B|$146.13|47%|\n|DBX - Dropbox Inc - Class A|7.01B|$22.18|48%|\n|SMAR - Smartsheet Inc - Class A|8.47B|$69.29|48%|\n|DOCU - DocuSign Inc|41.5B|$222.41|48%|\n|NOK - Nokia Corp - ADR|2.57B|$3.91|48%|\n|UAA - Under Armour Inc - Class A|7.22B|$17.17|48%|\n|TEAM - Atlassian Corporation Plc - Class A|30.9B|$234.14|49%|\n|SHAK - Shake Shack Inc - Class A|3.25B|$84.78|49%|\n|GE - General Electric Co.|94.6B|$10.80|49%|\n|MU - Micron Technology Inc.|84B|$75.19|49%|\n|YETI - YETI Holdings Inc|5.96B|$68.47|49%|\n|SHOP - Shopify Inc - Class A|136B|$1131.95|49%|\n|DAL - Delta Air Lines, Inc.|25.6B|$40.21|49%|",
        "subreddit": "options",
        "title": "Weekend IV Report - Tickers with low IV and cheap premiums",
        "url": "https://www.reddit.com/r/options/comments/kpn2s9/weekend_iv_report_tickers_with_low_iv_and_cheap/",
        "created": 1609718723.0
    },
    {
        "author": "VTX1800Riders",
        "created_utc": 1609567405,
        "id": "kos5bw",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "HPQ Silicon ($URAGF)announced that the major automobile manufacturer that demonstrated an interest in the Spherical Nano Silicon powders to be produced by the PUREVAP TM Nano Silicon Reactor (“NSiR ”) has submitted to HPQ NANO a formal Purchase Order for the material\nThis represents HPQ NANO first ever nanopowders order \nManufacturer is well aware that HPQ NANO will only fulfill this first order in December 2020 and, as such, this order is simply a way for them to guarantee to be first in queue for the material\nThe automobile manufacture’s name shall remain anonymous for competitive and confidential reasons.\n\nIf Elon did, it’s going to be a huge catalyst for this penny. Musk said Silicon will be the way for his next gen battery packs",
        "subreddit": "pennystocks",
        "title": "Did TESLA place the first order for HPQ NANO Silicon?",
        "url": "https://www.reddit.com/r/pennystocks/comments/kos5bw/did_tesla_place_the_first_order_for_hpq_nano/",
        "created": 1609596205.0
    },
    {
        "author": "vacuum_potential",
        "created_utc": 1609694904,
        "id": "kpombe",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Two questions about this stock. It trades on TSX, and I'm able to buy it on E\\*TRADE. Does E\\*TRADE regularly allow you to buy Canadian stocks, or is it only an option for some Canadian stocks? I thought I tried finding a previous Canadian stock on E\\*TRADE and it didn't work. \n\nMy second question is whether you think their nano-silicone technology is unique and whether this company has room to grow. Give me anything you got.",
        "subreddit": "pennystocks",
        "title": "URAGF HPQ Silicon Resources",
        "url": "https://www.reddit.com/r/pennystocks/comments/kpombe/uragf_hpq_silicon_resources/",
        "created": 1609723704.0
    },
    {
        "author": "stoxxxxx",
        "created_utc": 1609698418,
        "id": "kppt2c",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Silicon Battery company with a PUREVAP product that was completed in Dec 2020: [https://www.globenewswire.com/news-release/2020/11/05/2121653/0/en/CORRECTION-HPQ-NANO-on-Track-to-Start-of-Gen1-Reactor-in-December.html](https://www.globenewswire.com/news-release/2020/11/05/2121653/0/en/CORRECTION-HPQ-NANO-on-Track-to-Start-of-Gen1-Reactor-in-December.html)\n\n&amp;#x200B;\n\nBack in October they announced their first order from a \"Major Automobile Manufacturer\": [https://finance.yahoo.com/news/hpq-nano-receives-first-order-190300952.html](https://finance.yahoo.com/news/hpq-nano-receives-first-order-190300952.html)\n\n&amp;#x200B;\n\nOn December 29th, they also filed a patent for a by-product created by their PUREVAP process as material for lithium ion batteries: [https://hpqsilicon.com/press-release/hpq-files-provisional-patent-application-for-silicon-by-product-created-by-purevap-qrr/](https://hpqsilicon.com/press-release/hpq-files-provisional-patent-application-for-silicon-by-product-created-by-purevap-qrr/)\n\n&amp;#x200B;\n\nThis is their company website: [https://hpqsilicon.com/](https://hpqsilicon.com/)",
        "subreddit": "pennystocks",
        "title": "Anybody Keeping an Eye on HPQ Silicon ($URAGF)?",
        "url": "https://www.reddit.com/r/pennystocks/comments/kppt2c/anybody_keeping_an_eye_on_hpq_silicon_uragf/",
        "created": 1609727218.0
    },
    {
        "author": "Letsearnmoney18",
        "created_utc": 1609524954,
        "id": "kofym1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Gonna throw another 6k in what’s your plays?? \nCan’t play penny’s except HPQ 🇨🇦 🍁",
        "subreddit": "CanadianInvestor",
        "title": "Monday is tsfa top up of 6k!",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/kofym1/monday_is_tsfa_top_up_of_6k/",
        "created": 1609553754.0
    }
]