[
    {
        "author": "VMP85",
        "created_utc": 1623815398,
        "id": "o0w0dz",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I am looking to gain additional exposure to semiconductors (beyond what I already have with FSKAX, VTIAX and VXUS) and am looking to get feedback or suggestions on the best way to go about doing this. This is in a taxable account. My first thought was to buy SMH as TSM and NVDA are the two largest holdings. However, it lacks any AAPL and MSFT. Would the best choice be to buy SMH and also both AAPL and MSFT? Or, would it be best to buy AMD, NVDA, TSM, AMAT, TXN, AAPL and MSFT individually?",
        "subreddit": "stocks",
        "title": "Exposure to semiconductors suggestions",
        "url": "https://www.reddit.com/r/stocks/comments/o0w0dz/exposure_to_semiconductors_suggestions/",
        "created": 1623844198.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623332540,
        "id": "nwnysp",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "As usual for me, I took some of my adderall prescription and it drove me to write a DD on my most watched stocks at the moment.\n\nApplied Matterials Inc ($AMAT) is a large-cap stock, and I base my play upon it's high quality and strong momentum; as well as confidence in semi-conductor stocks. AMAT provides manufacturing equipment, services and software to the semiconductor, display and related industries.\n\nApplied Materials is the leading producer of equipment and materials for producing microchips, TV's (OLED's/LCD's), and solar panels. They also have their services business which offers manufacturing consulting and automation software. They are based in California, but have factories around the world, with Asian customers accounting for 80% of it's revenue.\n\nTo summarise:\n\n- Semi-conductor systems make 60% of revenue, this is for equipment used to manufacture semiconductor devices such as microprocessors and memory.\n\n- Applied global services provide a quarter of revenue. This is for integrated solutions to optimise equipment, performance and productivity,\n\n- And the display markets account for 10% of it's revenue. Providing products for manufacturing LCD's and OLED displays.\n\n- It's customers include Apple, HP and Dell.\n\nWith the current silicon shortage, I expect the stock to surge further when this shortage slows down.\n\n- AMAT has been stair stepping higher in the recent bull trend, as a leader in one of the stronger industry groups in tech (semiconductors), I believe it among other semi-conductor stocks are a great buy for a long right now.\n\n- AMAT's 5-year return on Capital Employed is 25.1%, which is a strong indicator that it has the power to grow profitably. AMAT's share price has had a 72.1% return relative to the market over the past 12 months.\n\n- Furthermore, it's earnings outlook is improving. Analysts are still raising their earnings estimates for the company. For the year, the stock currently has an earnings estimate of $6.53 per share, up 56.59% from a year ago.\n\n- AMAT is testing the 10 week line on the weekly chart, after declining recently. This has formed a handle, and if you rebound from here to get above the handle, there could be a breakout.\n\n- As Nvidia recently broke out we could see other semiconductor stocks such as TSM, AMAT, LCRX, and ASML following this pattern.\n\n- ASML is also in the buy range after finding support at the 10-week line.\n\nWhy semi-conductor stocks are a good play: \n- The Innovator IBD Breakout Oppurtunities Index (BOUT) jumped 152% from March 2020 lows before pulling back in February. This ETF is now integrating leading components manufacturers such as DELL, ZBRA, AMAT, LRCX, UCTT, and TER.\n\nJim Cramer himself is now looking at AMAT, TSM and AMD.\n\n\"Cramer recently said that if investors think chips are truly in short supply and we need capital equipment, then the company they most need is Lam Research (LRCX), other than Taiwan Semiconductor Manufacturing (TSM)\"\n\n\"Jim Cramer recently named chip equipment major Applied Materials (AMAT), as one of the stocks that got away.\n\nHe called out the bull market in semiconductor equipment. We need to make more chips, he said, and companies like Applied Materials can make that happen.\n\nThe semiconductor equipment major reported mixed fiscal-second-quarter earnings and received a number of positive reviews and price-target upgrades from Wall Street analysts.\"\n\nAnyway, aside from Cramer there are many other reasons to own semi-conductor stocks.\n\nOne of my primary reasons is the growth in data centre demand. This was why I bought NVDA calls at $620, aside from the stock-split. AMD is also bringing out new data-centre GPUs.\n\n- There has been a huge growth in demand for data centre equipment, due to the rise in work-from-home driving data centre's to increase their cloud-storage capacities. This has fuelled demand for data-centre chips from data centre operators.\n\n- The data centre market is expected to grow to $519.34 billion during 2021-2025, driven by the growing clout of cloud services and digitization. Further, increase in adoption of multi-cloud and network upgrade to support 5G is fueling growth.\n\n- New semiconductor manufacturing processes from 10nm, 7nm, to 5nm and 3nm has opened new business avenues.\n\n- 5G deployment is spuring further sector growth.\n\n- VR and AR devices, gaming, wearables and drones, have grown in use due to Coronavirus - hence leading to a increase in usage of online services globablly.\n\n- Improvements in DRAM and NAND pricing are fueling semi-conductor stocks catering to the memory market.\n\n- AMD, and TSM delivered good performance in the first quarter driven by data centre demand.\n\nI think my adderall has worn off now, but I will update with a part 2 later on. I'm going to open a position in TSMC, AMAT, LCRX, and ASML today. I will look at AMD also.",
        "subreddit": "wallstreetbets",
        "title": "$AMAT DD and why semi-conductor stocks are a great play right now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nwnysp/amat_dd_and_why_semiconductor_stocks_are_a_great/",
        "created": 1623361340.0
    },
    {
        "author": "TheMacroDrip",
        "created_utc": 1622736430,
        "id": "nrh2hj",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "The global semi-conductor shortage, aka chip shortage, has been crippling many industries. Demand for chips is continuing to outstrip supply and the car industry is longer the only one feeling the pain. Many auto-makers are actually limiting the amount of cars produced in 2021, including Ford recently who announced they will be canceling weeks worth of production of the F-150.\n\n**Overview**\n\nThere are a few factors at play giving analysts the impression that this shortage may last until early 2022. There’s a few KEY points that come to mind:\n\n* Most chips are produced overseas: Covid-related delays in shipping ports have effected supply coming into the United States.\n* China has been stock-piling chips: Chinese businesses have bought an absurd amount of chip-producing equipment (roughly $32 billion) in an effort to protect themselves from further US sanctions.\n* Demand for electronic products have soared.\n* Often over-looked, consumers don’t realize the amount of chips it takes to build cars in 2021. The trend is continuing in the same direction as many analysts expect the automative industry to begin predominantly developing cars with network connectivity.\n\nThis leaves an opportunity for those willing to look past the hardship some of these companies are experiencing of being unable to meet demand. The semi-conductor industry is expected to grow at CAGR of roughly \\~9% over the next 7-8 years. I see this as a relatively conservative number and it is my opinion that we are heading into a super-cycle of chip upgrades, processing power, and memory devices. Here are a few reasons:\n\n1. We are already seeing noticeable shift in demand and the way consumers are interacting in a new digital world.\n2. These electronics are becoming faster and more powerful, which simply requires a larger quantity &amp; quality of chips.\n3. More and more devices rely on connectivity and the car industry is now making it’s way onto a similar path.\n4. Following Nvidia’s earnings call we are seeing a large rise in trends for AI and machine-learning which is leading to increased demand for the required components.\n5. The rise of crypto mining will also play a role in the increased demand.\n\n**The Players**\n\nMany of the chip-related plays have already seen convincing growth over the last 12 months. However, several names have recently followed the markets to the downside and currently pose a potential good entry point. This secular trend in semi-conductor demand over the next several years is here to stay.\n\nMy semis watchlist is holding some familiar names: Applied Materials (AMAT), ASML Holdings (ASML), Skyworks Solutions (SWKS), Nvidia (NVDA), Intel (INTC), Advanced Micro Devices (AMD), Qualcomm (QCOM), and Taiwan Semiconductors (TSM).\n\nThe ones that make my shortlist are the following: NVDA, AMD, TSM, and AMAT. Here’s a look at the 2-year chart for the 4 tickers mentioned above. \n\nhttps://preview.redd.it/xr0kge6rq2371.png?width=2380&amp;format=png&amp;auto=webp&amp;s=c4beece1276b8c383ed5a2c0cca07bf40f42da11\n\n&amp;#x200B;\n\nIt is clear the secular trend in computer chips and processors have contributed greatly to the growth of these companies. Let’s take a look at a shorter time-frame. Here’s the 3-month chart for the same list of tickers. \n\nhttps://preview.redd.it/pip83wxqq2371.png?width=2388&amp;format=png&amp;auto=webp&amp;s=b353b714f1958233646a57ee5680bf2385ee2a3d\n\n&amp;#x200B;\n\nLooking at it from another angle we see AMD and TSM have been lagging behind the performance of AMAT and NVDA, who are on a nearly identical path. TSM is a leading manufacturer of chips and actually supplies most of AMD’s chips. They are based in Taiwan and there have been some concerns over the potential invasion of China. Setting those concerns aside these companies may still experience strong growth. My plays right now are in AMD and TSM and I will feel comfortable adding to any of the names I mentioned in this article if the right entry point shows itself.\n\n**Final Thoughts**\n\nI would love to say here’s why “x” company is in a better financial position than company “y”, but in this case I believe the high demand for semiconductors will benefit most names participating in this industry. Of course, not every company is made equal so please do your own research before investing in any stocks. In my opinion, this industry is in an upward secular trend and demand remains in-tact, providing tailwinds to the participants.\n\nKeep an eye on earnings reports and financial data of companies that BUY these products. Look at phone, tablet, computer manufacturers (Apple), cloud server providers, Google server expansion (also server chip REPLACEMENT rates, which is a thing), and AI/Machine learning projects (autonomous driving, video analysis, big-data processors). It may be years before the growth slows in this industry and these players will stand to largely benefit.",
        "subreddit": "StockMarket",
        "title": "The global chip shortage and how I'll be taking advantage of the semi's dip: NVDA, AMD, AMAT, TSM",
        "url": "https://www.reddit.com/r/StockMarket/comments/nrh2hj/the_global_chip_shortage_and_how_ill_be_taking/",
        "created": 1622765230.0
    },
    {
        "author": "JamesGBoswell",
        "created_utc": 1624124542,
        "id": "o3lhk0",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Which semiconductor companies will be most likely to receive funds after the bill is signed into law? Here are my thoughts and assumptions. Please correct any mistakes. Disclaimer: I own positions in Intel, Micron, and Applied Materials.\n\nMy understanding is that the bill is largely meant to support and consolidate semiconductor manufacturing and semi cap manufacturing in the U.S. Thus, U.S.-based companies with facilities in the U.S. and that want to develop their semiconductor manufacturing capabilities in the U.S. will be the most likely to receive funding from this law as well as future support from the U.S. government which is aligned with rare bipartisanship to address and neutralize the threat of China’s growing global technological dominance. Those companies will have a competitive advantage in the marketplace after receiving these funds, regardless of other fundamental or technical factors.\n\nHowever, the funds will come in the form of grants and tax credits. My understanding, and here's where I'm making big assumptions, is that companies must apply to receive the funds and that this is an involved and competitive process. The law won’t be signed until toward the end of this year at the earliest. Then, companies will apply for grants to fund projects to build fabs, improve supply chains, etc.\n\nINTC and MU seem like clear favorites to receive funds because they’re U.S.-based IDMs with facilities primarily in the U.S., and they’re often included in news stories related to the bill. TSM and Samsung are outside the U.S., though that doesn’t mean they couldn’t hypothetically receive funds to build a fab in the U.S. But if grants are competitive, then how likely would TSM or Samsung be to receive funds to build a new fab if they were competing with Intel or MU for the same funding, based purely on the intent of the law being to support U.S.-based semiconductor business?\n\nAMAT also seems like a favorite to receive funds even though ASML has a monopoly on the most advanced semi cap equipment. ASML is based in the Netherlands and only has two facilities in the U.S. Also, I speculate that AMAT could use funds from the law to put toward R&amp;D to compete with ASML, but my knowledge in that area is lacking.\n\nIt won’t be until next year before companies can even start applying for funds. There probably won’t be any winners for projects until at least a year from now.\n\nCatalysts:\n\n* Bill gets signed by the end of this year.\n* Companies submit applications for projects and winners are announced.\n* Winners start receiving funds and investing them in projects.\n\nThis isn't advice. I'm not a financial advisor.",
        "subreddit": "investing",
        "title": "U.S. Innovation and Competition Act - which semis will receive funds?",
        "url": "https://www.reddit.com/r/investing/comments/o3lhk0/us_innovation_and_competition_act_which_semis/",
        "created": 1624153342.0
    },
    {
        "author": "Kamikaze_Cash",
        "created_utc": 1623445643,
        "id": "nxq9s8",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**tl;dr:** LRCX will benefit tremendously from the US push to produce semiconductors. Buy shares and LEAPS. \n\n**Position:** 103x LRCX shares with DRIP (dividend reinvestment) and 1x 1/2023 $500c.\n\n**The DD:** \n\n* The push within the US to produce semiconductors (microchips) inside American borders has encouraged companies like INTC, TSMC, and Samsung to commit to building multi-million dollar fab plants (semiconductor factories). \n* The semiconductor shortage in general indicates there is demand for more semis.\n* The 5G and IoT rollouts means semiconductor demand will remain high and manufactories are likely to expand further.\n\nLRCX is well-positioned to make money off this. LRCX builds the machines and does the research that these other companies need to make microchips. Without LRCX, there are no manufactories. And after the fab plants are built, the machines need maintenance. LRCX provides this maintenance at 30%+ margins.\n\n**Fundamentals:**\n\n&amp;#x200B;\n\n[Beats Earnings](https://preview.redd.it/t67m821yap471.png?width=407&amp;format=png&amp;auto=webp&amp;s=37ee8d9b94a3a0f5bfcb12d1fb6317bb5747c0fa)\n\nLRCX has beat earnings 4/4 of the last quarters. It has the growth potential to continue beating earnings.\n\nAt a 27 P/E ratio, its valuation is average in its industry and has room to climb.\n\n**Technicals:** \n\n&amp;#x200B;\n\n[Up and to the right](https://preview.redd.it/xwr8epatap471.png?width=559&amp;format=png&amp;auto=webp&amp;s=cc38dae385b63dcd764d4509061508a2cf9206ed)\n\nLRCX goes up and to the right. It has the fundamental backing to continue. Demand for shares increases as the stock gets down to $600.\n\n&amp;#x200B;\n\n[RSI, MACD, Moving Averages](https://preview.redd.it/85xb9jk9bp471.png?width=898&amp;format=png&amp;auto=webp&amp;s=e471b714290c3175f09ac20a21b391f4e2ea7b88)\n\nMACD looks like shit, but RSI is positive and LRCX travels along its 50-DMA pretty well. Look to start DCAing into shares around this level and buy more shares or LEAPS as we approach $600.\n\n**Competition:**\n\nAMAT competes with LRCX in most industry segments. However LRCX stands out as the best wafer developer. If you cannot afford LRCX at $600, AMAT is $136. AMAT is also more diversified and is a good alternative choice.\n\nThere are some others including a Dutch company, but AMAT and LRCX are the main competitors in this industry, and they both have a wide moat.",
        "subreddit": "wallstreetbets",
        "title": "LRCX is the semiconductor play for 2021-2022",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nxq9s8/lrcx_is_the_semiconductor_play_for_20212022/",
        "created": 1623474443.0
    },
    {
        "author": "JamesGBoswell",
        "created_utc": 1624214129,
        "id": "o4byc8",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Which semiconductor companies will be most likely to receive funds after the bill is signed into law? Here are my thoughts and assumptions. Please correct any mistakes. Disclaimer: I own positions in Intel, Micron, and Applied Materials.\n\nMy understanding is that the bill is largely meant to support and consolidate semiconductor manufacturing and semi cap manufacturing in the U.S. Thus, U.S.-based companies with facilities in the U.S. that want to develop their semiconductor manufacturing capabilities in the U.S. will be the most likely to receive funding from this law as well as future support from the U.S. government which is aligned with rare bipartisanship to address and neutralize the threat of China’s growing global technological dominance. Those companies will have a competitive advantage in the marketplace after receiving these funds, regardless of other fundamental or technical factors.\n\nHowever, the funds will come in the form of grants and tax credits. My understanding, and here's where I'm making big assumptions, is that companies must apply to receive the funds and that this is an involved and competitive process. The law won’t be signed until toward the end of this year at the earliest. Then companies will apply for grants to fund projects to build fabs, improve supply chains, etc.\n\nINTC and MU seem like clear favorites to receive funds because they’re U.S.-based IDMs with facilities primarily in the U.S., and they’re often included in news stories related to the bill. TSM and Samsung are outside the U.S., though that doesn’t mean they couldn’t hypothetically receive funds to build a fab in the U.S. But if grants are competitive, then how likely would TSM or Samsung be to receive funds to build a new fab if they were competing with Intel or MU for the same funding, based purely on the intent of the law being to support U.S.-based semiconductor business?\n\nAMAT also seems like a favorite to receive funds even though ASML has a monopoly on the most advanced semi cap equipment. ASML is based in the Netherlands and only has two facilities in the U.S. Also, I speculate that AMAT could use funds from the law to put toward R&amp;D to compete with ASML, but my knowledge in that area is lacking.\n\nIt won’t be until next year before companies can even start applying for funds. There probably won’t be any winners for projects until at least a year from now.\n\nCatalysts:\n\n* Bill gets signed by the end of this year.\n* Companies submit applications for projects and winners are announced.\n* Winners start receiving funds and investing them in projects.\n\nThis isn't advice. I'm not a financial advisor.",
        "subreddit": "stocks",
        "title": "US Innovation and Competition Act - which semis will receive funds?",
        "url": "https://www.reddit.com/r/stocks/comments/o4byc8/us_innovation_and_competition_act_which_semis/",
        "created": 1624242929.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1623712332,
        "id": "nzzqex",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "$SOXX (semiconductor ETF) has broken out of its wedge after ~4 months of consolidation. $AMAT $LRCX $NVDA $AMD, etc are primed to breakout if tomorrow's economic data reports sends tech flying!",
        "url": "https://i.redd.it/tvl73o88cb571.png",
        "created": 1623741132.0
    },
    {
        "author": "JamesGBoswell",
        "created_utc": 1624124096,
        "id": "o3lbc3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Which semiconductor companies will be most likely to receive funds after the bill is signed into law? Here are my thoughts and assumptions. Please correct any mistakes. Disclaimer: I own positions in Intel, Micron, and Applied Materials.\n\nMy understanding is that the bill is largely meant to support and consolidate semiconductor manufacturing and semi cap manufacturing in the U.S. Thus, U.S.-based companies with facilities in the U.S. that want to develop their semiconductor manufacturing capabilities in the U.S. will be the most likely to receive funding from this law as well as future support from the U.S. government which is aligned with rare bipartisanship to address and neutralize the threat of China’s growing global technological dominance. Those companies will have a competitive advantage in the marketplace after receiving these funds, regardless of other fundamental or technical factors.\n\nHowever, the funds will come in the form of grants and tax credits. My understanding, and here's where I'm making big assumptions, is that companies must apply to receive the funds and that this is an involved and competitive process. The law won’t be signed until toward the end of this year at the earliest. Then companies will apply for grants to fund projects to build fabs, improve supply chains, etc.\n\nINTC and MU seem like clear favorites to receive funds because they’re U.S.-based IDMs with facilities primarily in the U.S., and they’re often included in news stories related to the bill. TSM and Samsung are outside the U.S., though that doesn’t mean they couldn’t hypothetically receive funds to build a fab in the U.S. But if grants are competitive, then how likely would TSM or Samsung be to receive funds to build a new fab if they were competing with Intel or MU for the same funding, based purely on the intent of the law being to support U.S.-based semiconductor business?\n\nAMAT also seems like a favorite to receive funds even though ASML has a monopoly on the most advanced semi cap equipment. ASML is based in the Netherlands and only has two facilities in the U.S. Also, I speculate that AMAT could use funds from the law to put toward R&amp;D to compete with ASML, but my knowledge in that area is lacking.\n\nIt won’t be until next year before companies can even start applying for funds. There probably won’t be any winners for projects until at least a year from now.\n\nCatalysts:\n\n* Bill gets signed by the end of this year.\n* Companies submit applications for projects and winners are announced.\n* Winners start receiving funds and investing them in projects.\n\nThis isn't advice. I'm not a financial advisor.",
        "subreddit": "StockMarket",
        "title": "U.S. Innovation and Competition Act - which semis will receive funds?",
        "url": "https://www.reddit.com/r/StockMarket/comments/o3lbc3/us_innovation_and_competition_act_which_semis/",
        "created": 1624152896.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1622815758,
        "id": "ns60d8",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "Wallstreetbetsnew",
        "title": "The global chip shortage and how I'll be taking advantage of the semi's dip: NVDA, AMD, AMAT, TSM",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/ns60d8/the_global_chip_shortage_and_how_ill_be_taking/",
        "created": 1622844558.0
    },
    {
        "author": "Pdiddy143",
        "created_utc": 1623238270,
        "id": "nvtjsy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "HOW TF IS THIS SHIT LEGAL?!? Senate passes a tech manufacturing bill to counter China. Numerous senators/ house members purchased semi-conductor stock BEFOREHAND. For example, Nancy Wyden bought $AAPL, $AMAT, $AVGO, $KLAC &amp; $NVDA BEFORE the legislation. https://unusualwhales.com/i_am_the_senate/semi",
        "url": "https://i.redd.it/5rdr8c9978471.jpg",
        "created": 1623267070.0
    },
    {
        "author": "inverse_action",
        "created_utc": 1622962516,
        "id": "ntfsf0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Please let me know what you think. I am in my late 30s and started to invest last year. :D Thanks\n\n**NVDA** 24.92%\n\n**SQ** 11.36%\n\n**TSLA** 7.79%\n\n**ILMN** 7.41%\n\n**MSFT** 5.93%\n\n**AAPL** 5.65%\n\n**ISRG** 3.93%\n\n**OPEN** 2.90%\n\n**U** 2.81%\n\n**VRTX** 2.48%\n\n**AVGO** 2.24%\n\n**EDIT** 2.15%\n\n**BNGO** 2.03%\n\n**MU** 1.98%\n\n**TWST** 1.82%\n\n**AMAT** 1.65%\n\n**QCOM** 1.59%\n\n**GDOT** 1.47%\n\n**SKLZ** 1.44%\n\n**PLTR** 1.42%\n\n**BIDU** 1.37%\n\n**ABBV** 1.33%\n\n**EXAS** 1.26%\n\n**CRSP** 1.07%\n\n**NVTA** 0.97%\n\n**BDSI** 0.85%",
        "subreddit": "investing_discussion",
        "title": "Feedback for my portfolio!",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ntfsf0/feedback_for_my_portfolio/",
        "created": 1622991316.0
    },
    {
        "author": "stocks-in-demand",
        "created_utc": 1623180912,
        "id": "nvcchf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMAT trading bearish",
        "url": "https://i.redd.it/fqhqsx2cg3471.png",
        "created": 1623209712.0
    },
    {
        "author": "Minimum-Mood3347",
        "created_utc": 1623802080,
        "id": "o0s637",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "AMAT. Thoughts on taking a short position.",
        "url": "https://www.reddit.com/r/stocks/comments/o0s637/amat_thoughts_on_taking_a_short_position/",
        "created": 1623830880.0
    },
    {
        "author": "prostockadvice",
        "created_utc": 1622605436,
        "id": "nqcjrt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " It is going to be a short trading week and shortened weeks tend to be choppy. The Nasdaq and S&amp;P came under selling pressure yesterday as the Dow Jones barely finished positive. Oil and energy performed exceedingly well.  \n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Waiting for set ups to trigger on the following before entering options:*  \n\n$DFS\n\n$V\n\n$OKTA\n\n$GPS\n\n$BHP\n\n$AMAT\n\n$TTWO\n\n$MS\n\n$NAIL\n\n$BABA\n\n$VRSK\n\n$SPY\n\n$TRV  \n\nPatience for a good entry is key.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n **New Alerts Added:** \n\n&amp;#x200B;\n\nAlibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others.\n\nAlthough BABA is still in a bearish pattern, it is hard to find an analyst that doesn't have a 'buy' rating for the e-commerce goliath of Asia. There are major resistances that it is hovering around right now which it has rejected 4 times since its ATH in last October. More so now, the 50 day MA is here as well. Overall, I am bullish on BABA and if we can have another buying opportunity at the bottom support (purple line), I will be getting into calls around $220. \n\n*Processing img stuk135axr271...*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n \n\nVerisk Analytics, Inc. provides data analytics solutions in the United States and internationally. It provides predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, commercial banking and finance, and various other fields. The company operates through three segments: Insurance, Energy and Specialized Markets, and Financial Services.\n\nCurrently, VRSK is possibly bouncing on major support dating back to the March 2019 lows. I will wait until today to confirm a 'bounce' and if true, I like the $180 monthly calls.\n\nhttps://preview.redd.it/s39tca7dxr271.png?width=1156&amp;format=png&amp;auto=webp&amp;s=082858553e3354a0344b80abe0f2c2000958a6d3\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n Next, I've back tested data on a multi factor alert strategy on $SPY. Once the Stochastic RSI forms a bull cross on the day candles and only if the RSI is less than a constant value of 20. This has returned almost a 90% success rate in a little over a year. Once this triggers again, I will buy SPY weekly calls and only taking profit after 2-3 days.  \n\nhttps://preview.redd.it/954ou9mexr271.png?width=1156&amp;format=png&amp;auto=webp&amp;s=2b929f2be8714b46823df5b865ef52d3ef3353b3\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n \n\nThe Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United states and internationally. The company operates through three segments: Business Insurance, Bond &amp; Specialty Insurance, and Personal Insurance.\n\n$TRV has been doing rather well and has found strong support along the 50 day MA. If it pulls back to this support, I believe calls up to $170 will work well here. TRV has been trading within a paralell channel since May of last year. \n\nhttps://preview.redd.it/xad3g2bgxr271.png?width=1156&amp;format=png&amp;auto=webp&amp;s=86ec7c94e2da33f7d521365ef3d7916f9eef80cd\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\nDisclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations. Prostockadvice.com is not responsible or liable in any way for opinions expressed here. This is not meant to be financial advice as we are not a licensed financial advisor.",
        "subreddit": "options",
        "title": "4 Options Set Ups w/ Back Tested Data",
        "url": "https://www.reddit.com/r/options/comments/nqcjrt/4_options_set_ups_w_back_tested_data/",
        "created": 1622634236.0
    },
    {
        "author": "MrCoil",
        "created_utc": 1624384002,
        "id": "o5su63",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi all, so I’m a bit of a space geek and I genuinely think in my lifetime the development of space travel and tourism will be huge. I used trading 212’s PIE features which allows me to make my own say mini ETF. I made one using space stocks I knew as well as researching online and ARK’s space ETF.\n\nI’ve listed below the stocks I’m in and what % and so far I’ve been given 15% returns on my investment which i can’t complain about. I was wondering if anyone has feedback on Space stocks to add/remove or adjusting my % per stock. I personally really believe this collection will be very valuable in 10+ years \n\nVirgin Galactic - 10%\nLockheed Martin - 10%\nIridium communications - 10%\nTrimble - 10%\nAerojet Rocketdybe 10%\nMaxar Technologies - 9%\nNorthrop Grumman - 9%\nL3 harris - 8%\nThales - 6%\nBoeing - 5%\nAirbus - 4%\nTeradyne - 3.5%\nDassault systems 3.3%\nRaven industries 2.2%",
        "subreddit": "stocks",
        "title": "My own Space collection",
        "url": "https://www.reddit.com/r/stocks/comments/o5su63/my_own_space_collection/",
        "created": 1624412802.0
    }
]