[
    {
        "author": "psychotrader00",
        "created_utc": 1615239549,
        "id": "m0qv3d",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Stocks were mixed on Monday as Treasury yields rose amid stimulus optimism. The Dow Jones (DIA) gained close to 1% while the S&amp;P 500 (SPY) and Nasdaq (QQQ) pulled back. The tech-heavy Nasdaq (QQQ) is officially in correction territory, falling more than 10% from its recent highs. \n\nOver the weekend, the Senate approved the $1.9 trillion stimulus package. The bill, which includes $300 per week in enhanced federal unemployment benefits through early September, $350 billion in state and local aid and $1,400 stimulus checks to Americans who qualify is set for a vote in the House of Representatives tomorrow before being sent to President Biden’s for signature. The bill is likely to pass before the March 14 deadline where enhanced federal unemployment benefits expire. \n\nThe prospect of a strong economic recovery post-pandemic, enabled by the rollout of vaccines and supportive fiscal and monetary policy, have simultaneously pushed estimates for growth higher while stoking fears of inflation. As a result, Treasury yields have turned sharply higher, hovering near 1.6%,  making bonds more attractive and capital more expensive to borrow. Rising yields hurt high-growth companies, like tech stocks, the most because these companies generate most of their revenue and earnings years down the road. The future value of that capital decreases in today’s dollar value as the yield increases. As a result, market participants are increasingly rotating out of high-flying stocks that led 2020 into stocks that will benefit from economic reopening. \n\nHighlights\nThe ARKK Innovation ETF (ARKK), which counts Tesla as its top holding by market value, has plunged by 22% over the past two weeks, as Tesla and other high-flying tech names like Square and Roku gave back some of their 2020 gains. This was the best performing ETF last year.\n\nShares of Apple (AAPL) and other tech giants are near 3-month lows. Could be a good time to get in as a safe, long term investment.\n\nShares of Gamestop (GME) and AMC surged again today, very interesting. As usual, exercise extreme caution around these plays, no one knows what could possibly happen.\n\nRoblox's IPO is set to take place on the New York Stock Exchange on Wednesday under the ticker symbol \"RBLX.\" \n\n*Please note that current stock price was written in the morning premarket and does not reflect intraday movement*\n \n\nAccenture (ACN) target raised by Susquehanna from $267 to $290 at Positive. Stock currently around $250\n\nC3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $95\n\nAmbarella (AMBA) target raised by Morgan Stanley from $125 to $136 at Overweight. Stock currently around $113\n\nDigital Turbine (APPS) target raised by Roth Capital from $87 to $100 at Buy. Stock currently around $74\n\nBroadcom (AVGO) target raised by Morgan Stanley from $521 to $538 at Overweight. Stock currently around $450\n\nCitigroup (C) target raised by Wells Fargo from $74 to $82 at Overweight. Stock currently around $70\n\nCRISPR Therapeutics (CRSP) target raised by Barclays from $113 to $140 at Overweight. Stock currently around $114\n\nDraftKings (DKNG) target raised by Cannaccord Genuity from $65 to $80 at Buy. Stock currently around $59\n\nJazz Pharma (JAZZ) target raised by UBS Group from $174 to $228 at Buy. Stock currently around $165\n\nLogitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $95\n\nMicron Technology with three target raises. Consensus price target is $107 at Overweight. Stock currently around $89\n\nNovoCure (NVCR) target raised by Mizuho from $150 to $175 at Buy. Stock currently around $130\n\nOracle (ORCL) target raised by Cowen from $70 to $77 at Outperform. Stock currently around $70\n\nPersonalis (PSNL) target raised by Morgan Stanley from $27 to $38 at Overweight. Stock currently around $24\n\nSarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $85\n\nTwitter (TWTR) target raised by Morgan Stanley from $54 to $75 at Equal-Weight. Stock currently around $67.\n\nWestern Digital (WDC) with two target raises. Stock currently around $68\n\nDeutsche Bank from $65 to $80 at Buy\n\nMorgan Stanley from $58 to $84 at Overweight. \n\nZoom (ZM) target raised by Morgan Stanely from $390 to $420 at Equal-Weight. Stock currently around $338",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, March 8, 2021.",
        "url": "https://www.reddit.com/r/StockMarket/comments/m0qv3d/here_is_a_market_recap_for_today_monday_march_8/",
        "created": 1615268349.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1615728824,
        "id": "m4v3h3",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Good Sunday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 15th, 2021.\n\n# **The Fed could be a catalyst for bonds, and that could drive growth stocks in week ahead - [(Source)](https://www.cnbc.com/2021/03/12/the-fed-could-be-a-catalyst-for-bonds-and-that-could-drive-growth-stocks-in-week-ahead.html)**\n*****\n&gt; Bonds could be volatile in the week ahead. If yields go higher, that could make it difficult for big tech and other growth stocks to gain traction.\n*****\n&gt; Rising bond yields have been challenging growth stocks. Names like Apple, Tesla, and Amazon have been lagging as investors move to cyclical groups that do well in an economic recovery. Even so, the S&amp;P 500 and the Dow both closed at record highs Friday, while the Nasdaq Composite was lower.\n*****\n&gt; The Nasdaq, home to big tech, did gain 3% in the past week, but it is down 5.5% over the last month.\n*****\n&gt; The bond market in the coming week will likely take its cues from the Federal Reserve, which meets Tuesday and Wednesday.\n*****\n&gt; The central bank is expected to give a nod to much better growth. Bond pros are also watching to see whether Fed officials will tweak their interest rate outlook, which now does not include any rate hikes through 2023.\n*****\n&gt; # Fed ahead\n&gt; “The markets have way too high expectations around what the Fed is going to do or say,” said Gregory Peters, head of multi-sector and strategy at PGIM Fixed Income. “I think the message is going to be consistent.”\n*****\n&gt; He said Fed Chairman Jerome Powell is likely to sound dovish and is unlikely to give any time frames on when the central bank will change its bond-buying program or other policy.\n*****\n&gt; Bond yields, which move opposite price, have been rising on an improving outlook for the economy.\n*****\n&gt; That trade also showed up in the stock market, with the Dow up 4% for the week to end Friday at a record 32,778. Consumer discretionary stocks, which include retail, were among the best performers, up 5.7%, boosted by optimism that individuals will spend their $1,400 stimulus checks.\n*****\n&gt; Yields were higher Friday after President Joe Biden said all adults would be eligible for a vaccine by May 1. The 10-year Treasury yield touched a high of 1.642% — its highest level in more than a year.\n*****\n&gt; It is the key rate to watch since it affects mortgages and other consumer and business loans.\n*****\n&gt; “The economy is going to be unbelievably strong this year — deficit spending, reopening, vaccines,” said Peters of PGIM.\n*****\n&gt; “It looks like for next year, all the numbers are being revised higher,” he said. “So this thing could have some sustainable growth, so I think there’s going to be pressure on rates moving higher.”\n*****\n&gt; Bond yields rose sharply over the past month. The rapid pace of the move has made stocks jittery as investors adjust to higher rates. The 10-year Treasury yield was at 1.16% on Feb. 12.\n*****\n&gt; # Growth vs. cyclicals\n&gt; Over the last month, energy stocks have risen nearly 20%, financial stocks are up 10.2%, and industrials are up 7%. The S&amp;P technology sector is down 5.4% over the last month, and communications services, which includes internet names was up 0.8%.\n*****\n&gt; Higher rates are a challenge for tech and other growth stocks because those shares are expensive and have high price-earnings ratios.\n*****\n&gt; “When rates are very low, valuations don’t matter to people,” said Peter Boockvar, chief investment officer at Bleakley Global Advisors.\n*****\n&gt; “If rates are low, there’s no penalty,” he said. “If rates start to go up, people become much more sensitive to valuations, and that’s what we’ve seen here.”\n*****\n&gt; Scott Redler, partner with T3live.com, follows short-term stock market technicals and trades many of the growth stocks. Lately, however, he’s found himself sitting in many value names and cyclicals.\n*****\n&gt; “The names that I’m in — Visa, GM, Ford, Macy’s, 3M. Those have been my biggest winners this week,” he said. “It’s been really hard to make money in Apple, Facebook and Tesla.”\n*****\n&gt; The Nasdaq has been hardest hit by the rise in interest rates. Apple was down 0.3% in the past week but down 10.6% in the past month. The S&amp;P 500 finished at a record 3,943 and was up 2.6% in the past week, but is flattish over the last month, up just 0.2%.\n*****\n&gt; “Rate volatility could cause another inflection point in tech,” Redler said. “Last week, tech hit its reactionary low, and this [past] week it had an oversold bounce. The question is, ‘Was that it?’”\n*****\n&gt; “Next Wednesday, Powell could be the determining factor,” he said. “Rates made higher highs and tech is way off last Friday’s lows so maybe the market is getting more comfortable.”\n*****\n&gt; Apple’s stall out is unusual for the tech bellwether. It helped power the market’s gains last year.\n*****\n&gt; “Watch Apple because it’s a little bit of everything. Apple is growth, tech, retail. If anything is doing well, it should be Apple,” Redler said.\n*****\n&gt; # Bond volatility\n&gt; There is some important data in the coming week, including February’s retail sales and industrial production, both on Tuesday. There is also a $24 billion 20-year Treasury note auction on Tuesday.\n*****\n&gt; The biggest catalyst for the bond market remains the Fed.\n*****\n&gt; The bond market has been speculating about something the Fed may not discuss after its meeting Wednesday afternoon. In one of its moves to shore up the economy during the pandemic, the Fed allowed banks to hold Treasury bonds without counting them against the bank’s leverage ratio. This strategy allowed institutions to have more flexibility to use their balance sheet for activities like lending.\n*****\n&gt; The program expires March 31.\n*****\n&gt; “This is a huge issue basically because you have so much Treasury supply coming and reinstating [the rule] basically makes it highly punitive for banks to own Treasurys,” Peters of PGIM said.\n*****\n&gt; “The markets are kind of divided on what’s going to happen,” he said. “I think most experts believe an extension is the appropriate path. You have not heard anything from the Fed on the matter.”\n*****\n&gt; Peters expects the Treasury market to remain volatile.\n*****\n&gt; “I think you’re going to see more volatility in a high pressure growth economy with extremely large deficits and an accommodative Fed,” he said. “I think you’re going to see these whippy moves.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/fkwT5RT.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/MuJ7SlC.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/lQiMjAN.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/hvH8uj8.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/AUV1ojJ.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ojOPNgp.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OtOIN5B.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/AUXbpnZ.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sptpE1X.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/1a03fHd.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/hb2eNGo.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/YPDtJd7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/XOhfVX4.png))**\n\n*****\n\n&gt; # March Quarterly Options Expiration Week Historically Bullish: DJIA, S&amp;P 500 &amp; NASDAQ Up 10 of Last 13\n\n&gt; Stock options, index options, index futures, and single-stock/ETF futures all expire at the same time four times each year, March, June, September and December. This event is often referred to as Quadruple Witching or as we prefer to call it in the Stock Trader’s Almanac (2021 page 106), Triple Witching.\n\n&gt; March’s option expiration week performance is second only to December’s and has a bullish bias. DJIA and S&amp;P 500 have recorded weekly gains in about twice the number of weeks as declines. NASDAQ’s track record since 1983 is slightly softer with 23 advances and 15 declines, but all three indices have logged gains in options expiration week in ten of the last thirteen years. However, the week after is bearish for DJIA, S&amp;P 500 and NASDAQ. S&amp;P 500 is weakest, down eight of the last nine. Last year as covid-19 began spreading globally and economies began to shut down, DJIA and S&amp;P 500 suffered their worst weekly declines during March’s quarterly options expiration.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/6ef1d4cbdd86a8efa09b8c2942d48517/32ed3896b2fe9623-1a/s500x750/f4254e1e0edf858dbfd4e67344757c69c48d30b6.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/81d51a4dd39b5941b831de20b28314c7/32ed3896b2fe9623-0e/s500x750/3ef3515466260a5660a9ec6eadb8a91cd697cf96.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/92b861530dfd9673b236fb0cd7af89c0/32ed3896b2fe9623-3c/s500x750/23c07978c0f660d7070cc8e2dd6c81aa392a92b7.jpg))**\n\n*****\n\n&gt; # Signs of Life in Europe?\n\n&gt; Few equity sectors on earth have been as poor as European financials since the Global Financial Crisis. The sector still sits more than 50% below its 2007 all-time highs, hampered by regulations, low to negative interest rates, and all around slow growth in the Eurozone. However, despite those headwinds, the sector has benefitted from a recent rotation to value, and has certainly been assisted by rising interest rates, a phenomenon we discussed earlier this week.\n\n&gt; Not only is performance for European financials improving in absolute terms, as global equities continue to recover from the worst of the ongoing COVID-19 pandemic, but since early October the sector has outperformed the S&amp;P 500 by more than 20 percentage points. As shown in the LPL Chart of the Day, the pattern relative to the S&amp;P 500 appears to be on the verge of breaking out of a nearly year-long technical base, similar to where US financials stood just two months ago.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/03/Picture-3.12.21.png?ssl=1))**\n\n&gt; While we don’t think European financials are going back to all-time highs anytime soon, remember, the sector still needs to gain 12% from current levels just to eclipse its 2020 pre-pandemic highs, a bar that certainly now seems attainable in 2021. “We remain broadly skeptical of foreign developed equities compared to their U.S. counterparts,” explained LPL Chief Market Strategist Ryan Detrick. “However, financials are the largest sector within Europe and improving performance and the continued rotation to cyclical value stocks make this a development to keep an eye on.”\n\n&gt; For now, we recommend sticking with US financials, which we recently upgraded in our latest Global Portfolio Strategy report, and is now the second best performing sector year to date, trailing only energy.\n\n*****\n\n&gt; # NASDAQ Bounces Off Support As Dow, S&amp;P 500 &amp; Russell 2K Log Record Highs, But Beware the Ides of March\n\n&gt; We’ve been tracking the NASDAQ 100 Index ($^NDX) (represented by the ETF Invesco QQQ Trust ($QQQ) as a proxy for the market’s technical picture. It contains many of the tech stocks that have been driving the economy and market for the past year through these Covid times as well as for quite a while prior – and likely to do so for some time to come.\n\n&gt; There has definitely been some rotation out of this sector of late as DJIA, S&amp;P 500 and Russell 2000 logged new highs today. But we would like to see confirmation with new highs in NASDAQ and NDX.\n\n&gt; The NAS and NDX are still lagging, but today’s stronger rally in the techs is encouraging. In this updated technical picture you can see that as the NDX logged a 10% correction from its February 12 closing high of 13807.70 to its closing low on Monday March 8 of 12299.08 it bounced off key support just above 12200 (intraday low on Friday March 5 was 12208.39). Check last week’s technical analysis post for reference to previous support levels that were broken.\n\n&gt; This 12200-level lines up with the October high which is also the high of that W-123 swing bottom pattern we mentioned last week. Back then it was key resistance that we cleared in late-November and early December. It now forms key support and lines up with the uptrend line from the September and October lows we discussed in our Almanac Investor December eNewsletter Outlook just before Thanksgiving.\n\n&gt; However, as the Ides of March are upon us, we must remind you that the end of March has a propensity to decline, sometimes rather precipitously as noted in the 2021 Stock Trader’s Almanac in the March Almanac and several places on pages 30-39. The Week After Triple Witching is often prone to weakness with DJIA down 22 of last 33 and the last few days often succumb to end-of-Q1 selling pressure. If any late-March weakness materializes it should be a solid buying opportunity for top-ranked April, the last month of the Best Six Months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/264401d95b5a55c592a6f8f10df22c5e/24ec511e4e033f88-38/s500x750/fe7be5042338b6e7e7b428a0f8fd5208691e48d7.jpg))**\n\n*****\n\n&gt; # Versatile Outperformers\n\n&gt; There's still a lot of time left in the day, but the tone of the equity market has been much different today compared to Monday. Whereas Monday saw tech stocks get creamed while cyclical areas of the market rallied, today we're seeing tech stocks rebound while cyclicals lag. To illustrate, within the entire S&amp;P 500 there are just 14 stocks that have so far managed to outperform the index by at least one percentage point both yesterday and today. The table below lists each of those stocks, and looking through them, they aren't the flashy, high-profile names that you always see discussed in the media. Who said boring is a bad thing? In terms of sector representation, there's also no clear trend as eight of the eleven sectors are represented by the list of just fourteen names!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308-Table.png))**\n\n&gt; Below we show six-month price charts of each of the 14 names listed above from our Chart Scanner tool. Here again, no clear technical theme links the stocks together. While stocks like AES, Global Payments (GPN), McKesson (MCK), and Ross Stores (ROST) remain close to six-month highs, others like Ball (BLL), Domino's (DPZ), and Market Axess (MKTX) aren't far from six-month lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308a-768x515.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308b-768x509.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308c-768x253.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending March 12th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=5fg64QYPl48))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 3.14.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=8ttI9inNJ90))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$FDX** \n&gt; * **$CRWD** \n&gt; * **$SNDL** \n&gt; * **$FCEL** \n&gt; * **$NKE** \n&gt; * **$GEVO** \n&gt; * **$DG** \n&gt; * **$VFF** \n&gt; * **$HQY** \n&gt; * **$VUZI** \n&gt; * **$PDD** \n&gt; * **$HEXO** \n&gt; * **$NFE** \n&gt; * **$RESN** \n&gt; * **$CRBP** \n&gt; * **$CSIQ** \n&gt; * **$NBEV** \n&gt; * **$DM** \n&gt; * **$WPRT** \n&gt; * **$OCGN** \n&gt; * **$LEN** \n&gt; * **$FIVE** \n&gt; * **$QFIN** \n&gt; * **$ACN** \n&gt; * **$AGEN** \n&gt; * **$ACRX** \n&gt; * **$COUP** \n&gt; * **$PD** \n&gt; * **$FLNT** \n&gt; * **$WSM** \n&gt; * **$AOUT** \n&gt; * **$FUTU** \n&gt; * **$CTAS** \n&gt; * **$BL** \n&gt; * **$FTEK** \n&gt; * **$ACEL** \n&gt; * **$SIC** \n&gt; * **$BEKE** \n&gt; * **$MP** \n&gt; * **$WB** \n&gt; * **$SIG** \n&gt; * **$RDHL**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/1a03fHd.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/QfVfqx2.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/Is3mMmC.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/k2c0t0O.png))\n\n&gt; # ***Monday 3.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/VKvrx46.png))\n\n*****\n\n&gt; # ***Tuesday  3.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/eoFBwOW.png))\n\n&gt; # ***Tuesday 3.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ujRMr7q.png))\n\n*****\n\n&gt; # ***Wednesday 3.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/myM4TrG.png))\n\n&gt; # ***Wednesday 3.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jVQLr1k.png))\n\n*****\n\n&gt; # ***Thursday 3.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/AWKlUdJ.png))\n\n&gt; # ***Thursday 3.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SWuSo8l.png))\n\n*****\n\n&gt; # ***Friday 3.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VyDOWFI.png))\n\n*****\n\n&gt; # ***Friday 3.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # FedEx Corp. $270.20\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, March 18, 2021. The consensus earnings estimate is $3.17 per share on revenue of $19.86 billion and the Earnings Whisper ® number is $4.12 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 124.82% with revenue increasing by 13.57%. Short interest has decreased by 10.4% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 17.9% above its 200 day moving average of $229.16. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, March 4, 2021 there was some notable buying of 1,400 contracts of the $115.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 7.1% move on earnings and the stock has averaged a 8.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CrowdStrike, Inc. $199.00\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 16, 2021. The consensus earnings estimate is $0.08 per share on revenue of $250.44 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of $0.08 to $0.09 per share on revenue of $245.50 million to $250.50 million. Consensus estimates are for year-over-year earnings growth of 300.00% with revenue increasing by 64.65%. Short interest has decreased by 27.0% since the company's last earnings release while the stock has drifted higher by 24.7% from its open following the earnings release to be 32.3% above its 200 day moving average of $150.39. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, March 5, 2021 there was some notable buying of 4,634 contracts of the $190.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.0% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Sundial Growers Inc. $1.42\n**Sundial Growers Inc. (SNDL)** is confirmed to report earnings at approximately 4:30 PM ET on Wednesday, March 17, 2021. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Short interest has increased by 2,440.8% since the company's last earnings release while the stock has drifted higher by 311.6% from its open following the earnings release to be 120.0% above its 200 day moving average of $0.65. On Friday, March 5, 2021 there was some notable buying of 24,454 contracts of the $1.50 call expiring on Friday, January 20, 2023. The stock has averaged a 25.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNDL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # FuelCell Energy, Inc. $18.16\n**FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 16, 2021. The consensus estimate is for a loss of $0.04 per share on revenue of $20.25 million and the Earnings Whisper ® number is ($0.02) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 33.33% with revenue increasing by 24.51%. Short interest has decreased by 39.0% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 146.4% above its 200 day moving average of $7.37. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, March 10, 2021 there was some notable buying of 24,783 contracts of the $15.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 19.1% move on earnings and the stock has averaged a 18.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Nike Inc $140.45\n**Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 18, 2021. The consensus earnings estimate is $0.75 per share on revenue of $11.05 billion and the Earnings Whisper ® number is $0.82 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.85% with revenue increasing by 9.36%. Short interest has decreased by 26.1% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 15.4% above its 200 day moving average of $121.72. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 9, 2021 there was some notable buying of 10,985 contracts of the $140.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Gevo Inc $10.10\n**Gevo Inc (GEVO)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, March 17, 2021. The consensus estimate is for a loss of $0.04 per share on revenue of $750.00 thousand. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.00% with revenue decreasing by 89.11%. Short interest has increased by 57.3% since the company's last earnings release while the stock has drifted higher by 900.0% from its open following the earnings release to be 196.3% above its 200 day moving average of $3.41. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, March 5, 2021 there was some notable buying of 2,278 contracts of the $7.50 call expiring on Friday, March 19, 2021. Option traders are pricing in a 26.2% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GEVO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Dollar General Corporation $191.96\n**Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, March 18, 2021. The consensus earnings estimate is $2.69 per share on revenue of $8.29 billion and the Earnings Whisper ® number is $2.72 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 28.10% with revenue increasing by 15.82%. Short interest has increased by 2.8% since the company's last earnings release while the stock has drifted lower by 10.1% from its open following the earnings release to be 4.6% below its 200 day moving average of $201.20. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 9, 2021 there was some notable buying of 3,169 contracts of the $190.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Village Farms International $16.68\n**Village Farms International (VFF)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, March 16, 2021. The consensus earnings estimate is $0.05 per share on revenue of $41.63 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 135.71% with revenue increasing by 25.94%. Short interest has decreased by 36.1% since the company's last earnings release while the stock has drifted higher by 163.1% from its open following the earnings release to be 93.1% above its 200 day moving average of $8.64. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 8, 2021 there was some notable buying of 3,755 contracts of the $18.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 16.9% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=VFF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HealthEquity, Inc. $79.17\n**HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 15, 2021. The consensus earnings estimate is $0.42 per share on revenue of $183.92 million and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.33% with revenue decreasing by 8.59%. Short interest has decreased by 44.8% since the company's last earnings release while the stock has drifted higher by 15.6% from its open following the earnings release to be 23.8% above its 200 day moving average of $63.94. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 10.4% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Vuzix Corporation $22.12\n**Vuzix Corporation (VUZI)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 15, 2021. The consensus estimate is for a loss of $0.11 per share on revenue of $4.01 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 64.52% with revenue increasing by 105.33%. Short interest has increased by 7.0% since the company's last earnings release while the stock has drifted higher by 506.0% from its open following the earnings release to be 188.8% above its 200 day moving average of $7.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, March 1, 2021 there was some notable buying of 2,681 contracts of the $25.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 22.0% move on earnings and the stock has averaged a 11.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=VUZI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week and month ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning March 15th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/m4v3h3/wall_street_week_ahead_for_the_trading_week/",
        "created": 1615757624.0
    },
    {
        "author": "spenceholla",
        "created_utc": 1615784531,
        "id": "m5d7xp",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "# Summary\n\nAdobe’s powerful position in the professional design and media production ecosystem has given them a valuable foothold in helping their clients get things done. Synergies between Digital Media and Digital Experience will allow Adobe to grow existing accounts as their solutions evolve to support customer operations far beyond creative and marketing.\n\n# Profile\n\nAdobe views its business in two key segments, Digital Media and Digital Experience.\n\nDigital Media (\\~75% of revenue) – what you probably think of when you hear the name Adobe. Products, services and solutions that enable individuals, teams and enterprises to create, publish and promote their content anywhere and accelerate their productivity by modernizing how they view, share and engage with documents and creative content. Things like Creative Cloud and Document Cloud.\n\nDigital Experience (\\~25% of revenue) – a comprehensive and integrated platform and set of applications and services through Adobe Experience Cloud that enable brands and businesses of all sizes to create, manage, execute, measure, monetize and optimize customer experiences that span from analytics to commerce. Spoiler: this is where my bull case lies.\n\nIn Adobe’s own words [(Form 10-K)](https://www.adobe.com/content/dam/cc/en/investor-relations/pdfs/ADBE-10K-FY20-FINAL.pdf):\n\n&gt;*“By integrating products from each of these areas, our customers are able to utilize a comprehensive suite of solutions and services that no other company currently offers. In addition, our ability to deliver innovation and productivity improvements across customer workflows involving the creation, management, delivery, measurement and optimization of engaging content favorably positions Adobe as our customers continue to invest in delivering digital experiences.”*\n\n# Fundamentals\n\n|Next Earnings Date|March 23rd (no time given)|\n|:-|:-|\n|Market Cap|$213B|\n|Forward P/E|41.02|\n|Shares|479M (Outstanding), 403.5M ( \\~85% Institutionally owned)|\n|Previous Close (3/12)|$444.30|\n|52WK Range|$255.13 - $536.88|\n|Average Volume|2.6M, so liquid enough.|\n|TAM|Adobe considers its TAM to be $147B by 2023|\n|Revenue Expectations|Plans to surpass $15B of revenue in FY21|\n\n**Inside activity** – only two small sales in the last 3 months that weren’t automatic or scheduled. Net activity is \\~300K shares sold (mostly automatic)\n\n**Buybacks** – Adobe has accelerated buybacks and recently increased the board’s share buyback authorization to $15B, as their original $8B repurchase is expected to be exhausted by mid-FY21.\n\n# Climate\n\nAdobe has a formidable moat around its Digital Media business segment, with very few competitors to its creative workflow management solutions. With many offices continuing to work virtually, and companies continuing to invest in their creative infrastructure for remote employees, strong growth in Digital Media should continue. **Whether they love or hate it, every creative professional knows they need proficiency in the Creative Cloud suite, and probably a subscription to it too.**\n\nAs Adobe says in their 10-K and [Annual Shareholder letter](https://www.adobe.com/content/dam/cc/en/investor-relations/pdfs/AdobeStockholderLetter2021.pdf), *“every business is a digital business, and the imperative for customer experience management has never been more real.”* Organizations and brands of every shape and size are wisely looking to improve their digital presence and customer experiences. Whether it's look and feel, project management tools, or e-commerce buy flow – Adobe has a solution for it. The pandemic only accelerated the trend, when nearly every opportunity to engage audiences went digital. To that end, the **Digital Experience segment stands to become a larger contributor to future revenue growth.** Adobe will successfully cross-sell Digital Experience solutions to existing Digital Media customers (think e-commerce, marketing and analytics tools, project management tools, etc.).\n\nAdobe will also generate new revenue streams from [recently-announced public sector use cases](https://news.adobe.com/news/news-details/2021/Adobe-Partners-With-All-50-US-States-to-Modernize-Digital-Experiences-for-Citizens/default.aspx). These federal, state, and local government partnerships will serve as lighthouse accounts for future growth within government, [healthcare](https://www.adobe.com/customer-success-stories/walgreens-boots-alliance-case-study.html), and other public impact sectors. These are reliable customers that are reluctant to switch solution providers due to baked-in opex approvals – which makes a SaaS offering incredibly sticky with large institutions.\n\nWhile we're discussing government and healthcare customers, it's really worth mentioning third party resellers. Again, from the [Form 10-K](https://www.adobe.com/content/dam/cc/en/investor-relations/pdfs/ADBE-10K-FY20-FINAL.pdf):\n\n&gt;*\"We also distribute certain products and services through a network of distributors, value-added resellers (VARs), systems integrators (SIs), independent software vendors (ISVs), retailers, software developers and original equipment manufacturers (OEMs). In addition, we license our technology to hardware manufacturers, software developers and service providers for use in their products and solutions.”*\n\nTypical multi-channel, large software company strategy. But these third party solutions providers become incredibly important in highly regulated spaces like government and healthcare. With Adobe's [recent acquisitions](https://news.adobe.com/news/news-details/2020/Adobe-Completes-Acquisition-of-Workfront/default.aspx) and [getting FedRAMP approval in 2019](https://blog.adobe.com/en/publish/2019/09/20/adobe-obtains-new-fedramp-authorizations-enhancing-its-digital-government-services-in-the-cloud.html#gs.vn62be), they’ve shown they’re serious about becoming a bigger government and institutional player. These are highly regulated industries, with long and bureaucratic procurement processes. **Often, government and healthcare buyers are only authorized to do business with a handful of pre-approved vendors.** As Adobe continues to integrate and white-label their Experience products to third party partners, they become an increasingly available, attractive option for customers in highly regulated verticals. Inside these organizations, it’s very difficult for buyers at big enterprise and government customers to win large appropriations approvals (to switch or rebuild systems), and much easier to lock in software solutions as a monthly \"cost of doing business.\" As organizations move to opex models like SaaS, there’s even more stickiness than there used to be.\n\n# Technicals\n\nP/E ratio of \\~41.02 seems high, but looking at Adobe’s closest competitors shows they’re not the highest.\n\n|Autodesk (ADSK)|49.28|\n|:-|:-|\n|PayPal (PYPL)|70.72|\n|Salesforce (CRM)|48.45|\n|DocuSign (DOCU)|N/A|\n|SAP (SAP)|29.92|\n|Accenture (ACN)|32.61|\n\nIt’s difficult to find a direct comparison, but I think Adobe’s marketing, analytics and e-commerce ambitions make their P/E getting closer to Salesforce very plausible. Part of Adobe's strength is that there's nobody that directly competes with them on all fronts.\n\n**Analyst Sentiment** – solid buy sentiment from 23+ analysts, which has gone mostly unchanged in the last few months. Lowest price target is $500, with the average around $560-$570. I have yet to see a sell rating. ([Source](https://money.cnn.com/quote/forecast/forecast.html?symb=ADBE))\n\n**Moving Averages and Technical Indicators** – I’ll let others chime in here, because this is my weakest area of knowledge. From what I can see, monthly moving averages and technical indicators suggest ADBE is a semi-strong buy and slightly oversold, respectively. I expect positive momentum to accelerate due to trading at 6-month lows leading up to earnings, BidenBux coming through, and the market forgetting about the 10yr Treasury Yield. ([Yahoo Finance](https://finance.yahoo.com/quote/ADBE?p=ADBE))\n\nRemember, this was trading at $500 a month ago. While I think this is worth a long term hold, I also think we'll see it pop when they post yet another earnings beat.\n\n# Conclusion\n\nCombined with Adobe’s well-known lock-in for professional design and content production workflows in their Media segment, growing competency in their Experience segment will make Adobe extremely competitive as an end-to-end SaaS provider for public and institutional customers. **Simply put, I believe Adobe’s Digital Experience segment will  grow to be at least half the size of Digital Media, with large enterprise and government partnerships being a sleeping giant in their pipeline.**\n\nPlanning to purchase 4/19 $490c at open tomorrow.",
        "subreddit": "wallstreetbets",
        "title": "Adobe ($ADBE) DD – A Growing SaaS Powerhouse",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m5d7xp/adobe_adbe_dd_a_growing_saas_powerhouse/",
        "created": 1615813331.0
    },
    {
        "author": "Interesting_Spirit28",
        "created_utc": 1615924471,
        "id": "m6hsey",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " \n\nC3 AI is a fraud. I am from AI industry, it’s not a AI company. They changed their name from C3 energy to C3 IOT to C3.ai to fool dumb investor who don’t understand AI.\n\nThis stock in not worth $30, the C3 to leaders and [Insiders ](https://finance.yahoo.com/news/c3-ai-inc-ai-ceo-031501653.html) already “Sell” on this stock at $80  . My advice exit before you loose 50% from here in next 3 months.\n\nFor intelligent readers here is why C3 is not a Datadog or Snowflake\n\n&amp;#x200B;\n\n* C3 is not a product company, it doesn’t have a rockstart product like Snowflake and Datadog . It uses AWS/Azure cloud to deliver most of it’s services with it’s staff sitting in California. So the margin is very thin and it can’t compete for long with well entraced services companies like Accenture, Cognizant etc..\n* C3 customer base is not Unicorn next generation startups growing 50% but outdated companies which are discovering that they should use technology. So it builds a custom product for each of it’s customer which is not repeatable or salable to other customers as the customer paid for the project\n* The business model is not subscription based. So, deal like a service company is closed with manpower and material cost and maintenance at the end. \n\nAlways remember C3 is not a AI company, it is not a Product company and it caters to companies which have no growth.\n\nGet out before this shit hit’s the Fan.",
        "subreddit": "wallstreetbets",
        "title": "C3 AI is a Fraud",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m6hsey/c3_ai_is_a_fraud/",
        "created": 1615953271.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1615239429,
        "id": "m0qthm",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "correction territory, falling more than 10% from its recent highs. \n\nOver the weekend, the Senate approved the $1.9 trillion stimulus package. The bill, which includes $300 per week in enhanced federal unemployment benefits through early September, $350 billion in state and local aid and $1,400 stimulus checks to Americans who qualify is set for a vote in the House of Representatives tomorrow before being sent to President Biden’s for signature. The bill is likely to pass before the March 14 deadline where enhanced federal unemployment benefits expire. \n\nThe prospect of a strong economic recovery post-pandemic, enabled by the rollout of vaccines and supportive fiscal and monetary policy, have simultaneously pushed estimates for growth higher while stoking fears of inflation. As a result, Treasury yields have turned sharply higher, hovering near 1.6%,  making bonds more attractive and capital more expensive to borrow. Rising yields hurt high-growth companies, like tech stocks, the most because these companies generate most of their revenue and earnings years down the road. The future value of that capital decreases in today’s dollar value as the yield increases. As a result, market participants are increasingly rotating out of high-flying stocks that led 2020 into stocks that will benefit from economic reopening. \n\nHighlights\n\nThe ARKK Innovation ETF (ARKK), which counts Tesla as its top holding by market value, has plunged by 22% over the past two weeks, as Tesla and other high-flying tech names like Square and Roku gave back some of their 2020 gains. This was the best performing ETF last year.\n\nShares of Apple (AAPL) and other tech giants are near 3-month lows. Could be a good time to get in as a safe, long term investment.\n\nShares of Gamestop (GME) and AMC surged again today, very interesting. As usual, exercise extreme caution around these plays, no one knows what could possibly happen.\n\nRoblox's IPO is set to take place on the New York Stock Exchange on Wednesday under the ticker symbol \"RBLX.\" \n\n*Please note that current stock price was written in the morning premarket and does not reflect intraday movement*\n \nAccenture (ACN) target raised by Susquehanna from $267 to $290 at Positive. Stock currently around $250\n\nC3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $95\n\nAmbarella (AMBA) target raised by Morgan Stanley from $125 to $136 at Overweight. Stock currently around $113\n\nDigital Turbine (APPS) target raised by Roth Capital from $87 to $100 at Buy. Stock currently around $74\n\nBroadcom (AVGO) target raised by Morgan Stanley from $521 to $538 at Overweight. Stock currently around $450\n\nCitigroup (C) target raised by Wells Fargo from $74 to $82 at Overweight. Stock currently around $70\n\nCRISPR Therapeutics (CRSP) target raised by Barclays from $113 to $140 at Overweight. Stock currently around $114\n\nDraftKings (DKNG) target raised by Cannaccord Genuity from $65 to $80 at Buy. Stock currently around $59\n\nJazz Pharma (JAZZ) target raised by UBS Group from $174 to $228 at Buy. Stock currently around $165\n\nLogitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $95\n\nMicron Technology with three target raises. Consensus price target is $107 at Overweight. Stock currently around $89\n\nNovoCure (NVCR) target raised by Mizuho from $150 to $175 at Buy. Stock currently around $130\n\nOracle (ORCL) target raised by Cowen from $70 to $77 at Outperform. Stock currently around $70\n\nPersonalis (PSNL) target raised by Morgan Stanley from $27 to $38 at Overweight. Stock currently around $24\n\nSarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $85\n\nTwitter (TWTR) target raised by Morgan Stanley from $54 to $75 at Equal-Weight. Stock currently around $67.\n\nWestern Digital (WDC) with two target raises. Stock currently around $68\n\nDeutsche Bank from $65 to $80 at Buy\n\nMorgan Stanley from $58 to $84 at Overweight. \n\nZoom (ZM) target raised by Morgan Stanely from $390 to $420 at Equal-Weight. Stock currently around $338\n\n\"In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock price not risk, but it is an opportunity. Where else do you look for cheap stocks?\" -Li Lu",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, March 8, 2021.",
        "url": "https://www.reddit.com/r/stocks/comments/m0qthm/here_is_a_market_recap_for_today_monday_march_8/",
        "created": 1615268229.0
    },
    {
        "author": "TheTrueMarketMaker",
        "created_utc": 1615723780,
        "id": "m4u5rt",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**#Earnings for 15 March 2021**\n\n***Pre-Market***\n\n$ACEL $AGEN $AMR $CINR $CRBP $DM $IIP.UN $JP $NRP $OCC $RESN $SIC $STRS $YALA $ZEPP\n\n***After Hours***\n\n$ACRX $AMPH $ASLE $BEKE $CEPU $CPRX $EML $ENZ $FENG $FTEK $HPK $HQY $ISUN $MDWT $MHLD $MOR $NOAH $PANL $PAR $QFIN $SHLS $SRT $VUZI $WPRT $ZDGE\n\n&amp;#x200B;\n\n**#Earnings for 16 March 2021**\n\n***Pre-Market***\n\n$BTB.UN $CNF $CTRN $DBI $FCEL $FREE $FTK $FUTU $IMOS $JBL $JILL $NBEV $NEW $NFE $NYC $TOUR $VFF $XNET\n\n***After Hours***\n\n$ADV $AFN $ASPU $BDSX $CAL $CALA $CLPR $COUP $CRIS $CRWD $DLNG $ERO $ETON $FANH $FF $FLNT $HIL $IDN $INFI $ISV $KIN $KODK $LEN $MOTS $OCX $ORGO $OTEL $PFMT $PRTH $REDU $REI $RMED $SHSP $SMAR $SRGA $STKS $SUMR $VEL $VOLT $XGN $YTEN\n\n&amp;#x200B;\n\n**#Earnings for 17 March 2021**\n\n***Pre-Market***\n\n$ARCO $AXLA $BMWYY $CTAS $FPH $IMV $INFU $KC $LE $MURGY $PDD\n\n***After Hours***\n\n$AOUT $AP $ATD.A $CTIC $ELP $EVOL $FIVE $FPI $GEVO $GTBIF $IPWR $LGO $MLHR $ONTF $PD $POW $PWCDF $RIDE $SGBX $SMTC $SNDL $STEP $TPZ $UPST $VINP $WSM $ZTO\n\n&amp;#x200B;\n\n**#Earnings for 18 March 2021**\n\n***Pre-Market***\n\n$ACN $ADCT $CMC $CSIQ $DG $DLTH $DXLG $EDV $EMAN $ENTX $FSZ $GLMD $GOL $HDELY $HEXO $HHR $HLS $HOOK $JG $LAZY $LEGN $MTCR $OCGN $PDSB $PHO $RDHL $SIG $STG $SYPR $TITN $URGN $UTZ $VIRI $WB $WOOF $YI\n\n***After Hours***\n\n$AFIB $ALPN $ALTG $BSQR $CNE $CPH $CVSI $DCM $FDX $JOBS $KBL $KINS $LX $MP $NKE $NVGS $OCDX $OLLI $PAX $PROG $SCHL $SHLE $SLRX $VIVE $XOG\n\n&amp;#x200B;\n\n**#Earnings for 19 March 2021**\n\n***Pre-Market***\n\n$CLSN $KRR $LITB $TEDU $WTT\n\n&amp;#x200B;\n\n**Expected Biotech News (Subject to Change)**\n\n$SRPT SRP-9003-101 Phase 1/2 Data 15-18 March 2021\n\n$SLDB SGT-001 Phase 1/2 Presentation 15 March 2021\n\n$RUBY RTX-240 Phase 1/2 Data 15 March 2021\n\n$ARAV AVB-500 Phase 1B Presentation 19 March 2021\n\n$LPTX DKN-01 Phase 2 Additional Data 19-25 March 2021\n\n$BBIO Encaleret Phase 2 Data Presentation 20 March 2021\n\n$RYTM Setmelanotide Presentation 20 March 2021\n\n$SPRB Tildacerfont Phase 2 Presentation 20 March 2021\n\n$SBBP COR-003 Phase 3 Presentation 20-23 March 2021\n\n&amp;#x200B;\n\n**#PDUFA List for 21 March 2021 to 28 April 2021**\n\n21 March 2021 $KNSA Rilonacept ∙ 22 March 2021 $PCRX EXPAREL\n\n27 March 2021 $ZEAL Dasiglucagon ∙ 27 March 2021 $BLUE $BMY KarMMa\n\n29 March 2021 $MRK Keytruda KN-522 ∙ 31 March 2021 $AVEO Tivozanib\n\n1 April 2021 $ABBV Upadacitinib ∙ 8 April 2021 $SUPN SPN-812\n\n12 April 2021 $FBIO $ATXI Tramadol ∙ 13 April 2021 $MRK KEYNOTE-590\n\n16 April 2021 $UTHR Tyvaso ∙ 26 April 2021 $SLGL VERED\n\n27 April 2021 $PLX PRX-102 ∙ 27 April 2021 $PFE Abrocitinib\n\n28 April 2021 $ARDX Tenapanor\n\n&amp;#x200B;\n\n***Content from (Slightly Edited By Me)***\n\nhttps://preview.redd.it/7r3mhm07izm61.jpg?width=476&amp;format=pjpg&amp;auto=webp&amp;s=294351c53c98692daf2a26382ebf826589239b93",
        "subreddit": "wallstreetbets",
        "title": "Earnings for 15 to 19 March 2021, Expected Biotech News 15 to 23 March 2021 and PDUFA List 21 March to 28 April 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m4u5rt/earnings_for_15_to_19_march_2021_expected_biotech/",
        "created": 1615752580.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1615726270,
        "id": "m4usd7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning March 15th, 2021.\n\n# **The Fed could be a catalyst for bonds, and that could drive growth stocks in week ahead - [(Source)](https://www.cnbc.com/2021/03/12/the-fed-could-be-a-catalyst-for-bonds-and-that-could-drive-growth-stocks-in-week-ahead.html)**\n*****\n&gt; Bonds could be volatile in the week ahead. If yields go higher, that could make it difficult for big tech and other growth stocks to gain traction.\n*****\n&gt; Rising bond yields have been challenging growth stocks. Names like Apple, Tesla, and Amazon have been lagging as investors move to cyclical groups that do well in an economic recovery. Even so, the S&amp;P 500 and the Dow both closed at record highs Friday, while the Nasdaq Composite was lower.\n*****\n&gt; The Nasdaq, home to big tech, did gain 3% in the past week, but it is down 5.5% over the last month.\n*****\n&gt; The bond market in the coming week will likely take its cues from the Federal Reserve, which meets Tuesday and Wednesday.\n*****\n&gt; The central bank is expected to give a nod to much better growth. Bond pros are also watching to see whether Fed officials will tweak their interest rate outlook, which now does not include any rate hikes through 2023.\n*****\n&gt; # Fed ahead\n&gt; “The markets have way too high expectations around what the Fed is going to do or say,” said Gregory Peters, head of multi-sector and strategy at PGIM Fixed Income. “I think the message is going to be consistent.”\n*****\n&gt; He said Fed Chairman Jerome Powell is likely to sound dovish and is unlikely to give any time frames on when the central bank will change its bond-buying program or other policy.\n*****\n&gt; Bond yields, which move opposite price, have been rising on an improving outlook for the economy.\n*****\n&gt; That trade also showed up in the stock market, with the Dow up 4% for the week to end Friday at a record 32,778. Consumer discretionary stocks, which include retail, were among the best performers, up 5.7%, boosted by optimism that individuals will spend their $1,400 stimulus checks.\n*****\n&gt; Yields were higher Friday after President Joe Biden said all adults would be eligible for a vaccine by May 1. The 10-year Treasury yield touched a high of 1.642% — its highest level in more than a year.\n*****\n&gt; It is the key rate to watch since it affects mortgages and other consumer and business loans.\n*****\n&gt; “The economy is going to be unbelievably strong this year — deficit spending, reopening, vaccines,” said Peters of PGIM.\n*****\n&gt; “It looks like for next year, all the numbers are being revised higher,” he said. “So this thing could have some sustainable growth, so I think there’s going to be pressure on rates moving higher.”\n*****\n&gt; Bond yields rose sharply over the past month. The rapid pace of the move has made stocks jittery as investors adjust to higher rates. The 10-year Treasury yield was at 1.16% on Feb. 12.\n*****\n&gt; # Growth vs. cyclicals\n&gt; Over the last month, energy stocks have risen nearly 20%, financial stocks are up 10.2%, and industrials are up 7%. The S&amp;P technology sector is down 5.4% over the last month, and communications services, which includes internet names was up 0.8%.\n*****\n&gt; Higher rates are a challenge for tech and other growth stocks because those shares are expensive and have high price-earnings ratios.\n*****\n&gt; “When rates are very low, valuations don’t matter to people,” said Peter Boockvar, chief investment officer at Bleakley Global Advisors.\n*****\n&gt; “If rates are low, there’s no penalty,” he said. “If rates start to go up, people become much more sensitive to valuations, and that’s what we’ve seen here.”\n*****\n&gt; Scott Redler, partner with T3live.com, follows short-term stock market technicals and trades many of the growth stocks. Lately, however, he’s found himself sitting in many value names and cyclicals.\n*****\n&gt; “The names that I’m in — Visa, GM, Ford, Macy’s, 3M. Those have been my biggest winners this week,” he said. “It’s been really hard to make money in Apple, Facebook and Tesla.”\n*****\n&gt; The Nasdaq has been hardest hit by the rise in interest rates. Apple was down 0.3% in the past week but down 10.6% in the past month. The S&amp;P 500 finished at a record 3,943 and was up 2.6% in the past week, but is flattish over the last month, up just 0.2%.\n*****\n&gt; “Rate volatility could cause another inflection point in tech,” Redler said. “Last week, tech hit its reactionary low, and this [past] week it had an oversold bounce. The question is, ‘Was that it?’”\n*****\n&gt; “Next Wednesday, Powell could be the determining factor,” he said. “Rates made higher highs and tech is way off last Friday’s lows so maybe the market is getting more comfortable.”\n*****\n&gt; Apple’s stall out is unusual for the tech bellwether. It helped power the market’s gains last year.\n*****\n&gt; “Watch Apple because it’s a little bit of everything. Apple is growth, tech, retail. If anything is doing well, it should be Apple,” Redler said.\n*****\n&gt; # Bond volatility\n&gt; There is some important data in the coming week, including February’s retail sales and industrial production, both on Tuesday. There is also a $24 billion 20-year Treasury note auction on Tuesday.\n*****\n&gt; The biggest catalyst for the bond market remains the Fed.\n*****\n&gt; The bond market has been speculating about something the Fed may not discuss after its meeting Wednesday afternoon. In one of its moves to shore up the economy during the pandemic, the Fed allowed banks to hold Treasury bonds without counting them against the bank’s leverage ratio. This strategy allowed institutions to have more flexibility to use their balance sheet for activities like lending.\n*****\n&gt; The program expires March 31.\n*****\n&gt; “This is a huge issue basically because you have so much Treasury supply coming and reinstating [the rule] basically makes it highly punitive for banks to own Treasurys,” Peters of PGIM said.\n*****\n&gt; “The markets are kind of divided on what’s going to happen,” he said. “I think most experts believe an extension is the appropriate path. You have not heard anything from the Fed on the matter.”\n*****\n&gt; Peters expects the Treasury market to remain volatile.\n*****\n&gt; “I think you’re going to see more volatility in a high pressure growth economy with extremely large deficits and an accommodative Fed,” he said. “I think you’re going to see these whippy moves.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/fkwT5RT.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/MuJ7SlC.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/lQiMjAN.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/hvH8uj8.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/AUV1ojJ.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ojOPNgp.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OtOIN5B.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/AUXbpnZ.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/sptpE1X.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/1a03fHd.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/hb2eNGo.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/YPDtJd7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/XOhfVX4.png))**\n\n*****\n\n&gt; # March Quarterly Options Expiration Week Historically Bullish: DJIA, S&amp;P 500 &amp; NASDAQ Up 10 of Last 13\n\n&gt; Stock options, index options, index futures, and single-stock/ETF futures all expire at the same time four times each year, March, June, September and December. This event is often referred to as Quadruple Witching or as we prefer to call it in the Stock Trader’s Almanac (2021 page 106), Triple Witching.\n\n&gt; March’s option expiration week performance is second only to December’s and has a bullish bias. DJIA and S&amp;P 500 have recorded weekly gains in about twice the number of weeks as declines. NASDAQ’s track record since 1983 is slightly softer with 23 advances and 15 declines, but all three indices have logged gains in options expiration week in ten of the last thirteen years. However, the week after is bearish for DJIA, S&amp;P 500 and NASDAQ. S&amp;P 500 is weakest, down eight of the last nine. Last year as covid-19 began spreading globally and economies began to shut down, DJIA and S&amp;P 500 suffered their worst weekly declines during March’s quarterly options expiration.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/6ef1d4cbdd86a8efa09b8c2942d48517/32ed3896b2fe9623-1a/s500x750/f4254e1e0edf858dbfd4e67344757c69c48d30b6.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/81d51a4dd39b5941b831de20b28314c7/32ed3896b2fe9623-0e/s500x750/3ef3515466260a5660a9ec6eadb8a91cd697cf96.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/92b861530dfd9673b236fb0cd7af89c0/32ed3896b2fe9623-3c/s500x750/23c07978c0f660d7070cc8e2dd6c81aa392a92b7.jpg))**\n\n*****\n\n&gt; # Signs of Life in Europe?\n\n&gt; Few equity sectors on earth have been as poor as European financials since the Global Financial Crisis. The sector still sits more than 50% below its 2007 all-time highs, hampered by regulations, low to negative interest rates, and all around slow growth in the Eurozone. However, despite those headwinds, the sector has benefitted from a recent rotation to value, and has certainly been assisted by rising interest rates, a phenomenon we discussed earlier this week.\n\n&gt; Not only is performance for European financials improving in absolute terms, as global equities continue to recover from the worst of the ongoing COVID-19 pandemic, but since early October the sector has outperformed the S&amp;P 500 by more than 20 percentage points. As shown in the LPL Chart of the Day, the pattern relative to the S&amp;P 500 appears to be on the verge of breaking out of a nearly year-long technical base, similar to where US financials stood just two months ago.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/03/Picture-3.12.21.png?ssl=1))**\n\n&gt; While we don’t think European financials are going back to all-time highs anytime soon, remember, the sector still needs to gain 12% from current levels just to eclipse its 2020 pre-pandemic highs, a bar that certainly now seems attainable in 2021. “We remain broadly skeptical of foreign developed equities compared to their U.S. counterparts,” explained LPL Chief Market Strategist Ryan Detrick. “However, financials are the largest sector within Europe and improving performance and the continued rotation to cyclical value stocks make this a development to keep an eye on.”\n\n&gt; For now, we recommend sticking with US financials, which we recently upgraded in our latest Global Portfolio Strategy report, and is now the second best performing sector year to date, trailing only energy.\n\n*****\n\n&gt; # NASDAQ Bounces Off Support As Dow, S&amp;P 500 &amp; Russell 2K Log Record Highs, But Beware the Ides of March\n\n&gt; We’ve been tracking the NASDAQ 100 Index ($^NDX) (represented by the ETF Invesco QQQ Trust ($QQQ) as a proxy for the market’s technical picture. It contains many of the tech stocks that have been driving the economy and market for the past year through these Covid times as well as for quite a while prior – and likely to do so for some time to come.\n\n&gt; There has definitely been some rotation out of this sector of late as DJIA, S&amp;P 500 and Russell 2000 logged new highs today. But we would like to see confirmation with new highs in NASDAQ and NDX.\n\n&gt; The NAS and NDX are still lagging, but today’s stronger rally in the techs is encouraging. In this updated technical picture you can see that as the NDX logged a 10% correction from its February 12 closing high of 13807.70 to its closing low on Monday March 8 of 12299.08 it bounced off key support just above 12200 (intraday low on Friday March 5 was 12208.39). Check last week’s technical analysis post for reference to previous support levels that were broken.\n\n&gt; This 12200-level lines up with the October high which is also the high of that W-123 swing bottom pattern we mentioned last week. Back then it was key resistance that we cleared in late-November and early December. It now forms key support and lines up with the uptrend line from the September and October lows we discussed in our Almanac Investor December eNewsletter Outlook just before Thanksgiving.\n\n&gt; However, as the Ides of March are upon us, we must remind you that the end of March has a propensity to decline, sometimes rather precipitously as noted in the 2021 Stock Trader’s Almanac in the March Almanac and several places on pages 30-39. The Week After Triple Witching is often prone to weakness with DJIA down 22 of last 33 and the last few days often succumb to end-of-Q1 selling pressure. If any late-March weakness materializes it should be a solid buying opportunity for top-ranked April, the last month of the Best Six Months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/264401d95b5a55c592a6f8f10df22c5e/24ec511e4e033f88-38/s500x750/fe7be5042338b6e7e7b428a0f8fd5208691e48d7.jpg))**\n\n*****\n\n&gt; # Versatile Outperformers\n\n&gt; There's still a lot of time left in the day, but the tone of the equity market has been much different today compared to Monday. Whereas Monday saw tech stocks get creamed while cyclical areas of the market rallied, today we're seeing tech stocks rebound while cyclicals lag. To illustrate, within the entire S&amp;P 500 there are just 14 stocks that have so far managed to outperform the index by at least one percentage point both yesterday and today. The table below lists each of those stocks, and looking through them, they aren't the flashy, high-profile names that you always see discussed in the media. Who said boring is a bad thing? In terms of sector representation, there's also no clear trend as eight of the eleven sectors are represented by the list of just fourteen names!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308-Table.png))**\n\n&gt; Below we show six-month price charts of each of the 14 names listed above from our Chart Scanner tool. Here again, no clear technical theme links the stocks together. While stocks like AES, Global Payments (GPN), McKesson (MCK), and Ross Stores (ROST) remain close to six-month highs, others like Ball (BLL), Domino's (DPZ), and Market Axess (MKTX) aren't far from six-month lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308a-768x515.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308b-768x509.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/03/030921-0308c-768x253.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending March 12th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=5fg64QYPl48))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 3.14.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=8ttI9inNJ90))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$FDX** \n&gt; * **$CRWD** \n&gt; * **$SNDL** \n&gt; * **$FCEL** \n&gt; * **$NKE** \n&gt; * **$GEVO** \n&gt; * **$DG** \n&gt; * **$VFF** \n&gt; * **$HQY** \n&gt; * **$VUZI** \n&gt; * **$PDD** \n&gt; * **$HEXO** \n&gt; * **$NFE** \n&gt; * **$RESN** \n&gt; * **$CRBP** \n&gt; * **$CSIQ** \n&gt; * **$NBEV** \n&gt; * **$DM** \n&gt; * **$WPRT** \n&gt; * **$OCGN** \n&gt; * **$LEN** \n&gt; * **$FIVE** \n&gt; * **$QFIN** \n&gt; * **$ACN** \n&gt; * **$AGEN** \n&gt; * **$ACRX** \n&gt; * **$COUP** \n&gt; * **$PD** \n&gt; * **$FLNT** \n&gt; * **$WSM** \n&gt; * **$AOUT** \n&gt; * **$FUTU** \n&gt; * **$CTAS** \n&gt; * **$BL** \n&gt; * **$FTEK** \n&gt; * **$ACEL** \n&gt; * **$SIC** \n&gt; * **$BEKE** \n&gt; * **$MP** \n&gt; * **$WB** \n&gt; * **$SIG** \n&gt; * **$RDHL**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/1a03fHd.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/QfVfqx2.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/Is3mMmC.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 3.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/k2c0t0O.png))\n\n&gt; # ***Monday 3.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/VKvrx46.png))\n\n*****\n\n&gt; # ***Tuesday  3.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/eoFBwOW.png))\n\n&gt; # ***Tuesday 3.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ujRMr7q.png))\n\n*****\n\n&gt; # ***Wednesday 3.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/myM4TrG.png))\n\n&gt; # ***Wednesday 3.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jVQLr1k.png))\n\n*****\n\n&gt; # ***Thursday 3.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/AWKlUdJ.png))\n\n&gt; # ***Thursday 3.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SWuSo8l.png))\n\n*****\n\n&gt; # ***Friday 3.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VyDOWFI.png))\n\n*****\n\n&gt; # ***Friday 3.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # FedEx Corp. $270.20\n**FedEx Corp. (FDX)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, March 18, 2021. The consensus earnings estimate is $3.17 per share on revenue of $19.86 billion and the Earnings Whisper ® number is $4.12 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 124.82% with revenue increasing by 13.57%. Short interest has decreased by 10.4% since the company's last earnings release while the stock has drifted lower by 4.7% from its open following the earnings release to be 17.9% above its 200 day moving average of $229.16. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, March 4, 2021 there was some notable buying of 1,400 contracts of the $115.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 7.1% move on earnings and the stock has averaged a 8.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FDX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CrowdStrike, Inc. $199.00\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 16, 2021. The consensus earnings estimate is $0.08 per share on revenue of $250.44 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of $0.08 to $0.09 per share on revenue of $245.50 million to $250.50 million. Consensus estimates are for year-over-year earnings growth of 300.00% with revenue increasing by 64.65%. Short interest has decreased by 27.0% since the company's last earnings release while the stock has drifted higher by 24.7% from its open following the earnings release to be 32.3% above its 200 day moving average of $150.39. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, March 5, 2021 there was some notable buying of 4,634 contracts of the $190.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.0% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Sundial Growers Inc. $1.42\n**Sundial Growers Inc. (SNDL)** is confirmed to report earnings at approximately 4:30 PM ET on Wednesday, March 17, 2021. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Short interest has increased by 2,440.8% since the company's last earnings release while the stock has drifted higher by 311.6% from its open following the earnings release to be 120.0% above its 200 day moving average of $0.65. On Friday, March 5, 2021 there was some notable buying of 24,454 contracts of the $1.50 call expiring on Friday, January 20, 2023. The stock has averaged a 25.6% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNDL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # FuelCell Energy, Inc. $18.16\n**FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 16, 2021. The consensus estimate is for a loss of $0.04 per share on revenue of $20.25 million and the Earnings Whisper ® number is ($0.02) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 33.33% with revenue increasing by 24.51%. Short interest has decreased by 39.0% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 146.4% above its 200 day moving average of $7.37. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, March 10, 2021 there was some notable buying of 24,783 contracts of the $15.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 19.1% move on earnings and the stock has averaged a 18.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Nike Inc $140.45\n**Nike Inc (NKE)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, March 18, 2021. The consensus earnings estimate is $0.75 per share on revenue of $11.05 billion and the Earnings Whisper ® number is $0.82 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.85% with revenue increasing by 9.36%. Short interest has decreased by 26.1% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 15.4% above its 200 day moving average of $121.72. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 9, 2021 there was some notable buying of 10,985 contracts of the $140.00 call expiring on Friday, April 16, 2021. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NKE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Gevo Inc $10.10\n**Gevo Inc (GEVO)** is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, March 17, 2021. The consensus estimate is for a loss of $0.04 per share on revenue of $750.00 thousand. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.00% with revenue decreasing by 89.11%. Short interest has increased by 57.3% since the company's last earnings release while the stock has drifted higher by 900.0% from its open following the earnings release to be 196.3% above its 200 day moving average of $3.41. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, March 5, 2021 there was some notable buying of 2,278 contracts of the $7.50 call expiring on Friday, March 19, 2021. Option traders are pricing in a 26.2% move on earnings and the stock has averaged a 8.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GEVO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Dollar General Corporation $191.96\n**Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, March 18, 2021. The consensus earnings estimate is $2.69 per share on revenue of $8.29 billion and the Earnings Whisper ® number is $2.72 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 28.10% with revenue increasing by 15.82%. Short interest has increased by 2.8% since the company's last earnings release while the stock has drifted lower by 10.1% from its open following the earnings release to be 4.6% below its 200 day moving average of $201.20. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, March 9, 2021 there was some notable buying of 3,169 contracts of the $190.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 5.4% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Village Farms International $16.68\n**Village Farms International (VFF)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, March 16, 2021. The consensus earnings estimate is $0.05 per share on revenue of $41.63 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 135.71% with revenue increasing by 25.94%. Short interest has decreased by 36.1% since the company's last earnings release while the stock has drifted higher by 163.1% from its open following the earnings release to be 93.1% above its 200 day moving average of $8.64. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, February 8, 2021 there was some notable buying of 3,755 contracts of the $18.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 16.9% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=VFF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # HealthEquity, Inc. $79.17\n**HealthEquity, Inc. (HQY)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 15, 2021. The consensus earnings estimate is $0.42 per share on revenue of $183.92 million and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 43% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.33% with revenue decreasing by 8.59%. Short interest has decreased by 44.8% since the company's last earnings release while the stock has drifted higher by 15.6% from its open following the earnings release to be 23.8% above its 200 day moving average of $63.94. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 10.4% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HQY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Vuzix Corporation $22.12\n**Vuzix Corporation (VUZI)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, March 15, 2021. The consensus estimate is for a loss of $0.11 per share on revenue of $4.01 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 64.52% with revenue increasing by 105.33%. Short interest has increased by 7.0% since the company's last earnings release while the stock has drifted higher by 506.0% from its open following the earnings release to be 188.8% above its 200 day moving average of $7.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, March 1, 2021 there was some notable buying of 2,681 contracts of the $25.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 22.0% move on earnings and the stock has averaged a 11.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=VUZI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week and month ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning March 15th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/m4usd7/wall_street_week_ahead_for_the_trading_week/",
        "created": 1615755070.0
    },
    {
        "author": "5612625773",
        "created_utc": 1617028024,
        "id": "mfqq3n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Accenture plc (ACN), Chief Operating officer, Deblaere Johan, Filled Form 4, on 03/26/2021, Disposed 8000 shares, at Price $280.00 worth $2,240,000 Follow https://www.instagram.com/money_insider_stocknews/ Facebook, https://www.facebook.com/Earnegy/ For Stocks Inside News and Details.",
        "url": "https://v.redd.it/6wwd2khz8zp61",
        "created": 1617056824.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1615262649,
        "id": "m0yb8n",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Watchlist 3-9-21 👀\n\nThe Dow surged to reach a record intraday high before paring some gains to end about 300 points, or 1%, higher on the day. The Nasdaq declined by 2%, adding to recent losses after the index closed out its third straight weekly decline last week amid a drawdown in tech and growth stocks.\n\nTreasury yields resurged across the curve, and the benchmark 10-year yield spiked to a one-year high of more than 1.61%.\n\nThe U.S. House of Representatives is poised to vote Tuesday on the Senate's version of the stimulus bill, which includes $300 per week in enhanced federal unemployment benefits through early September, $350 billion in state and local aid and $1,400 stimulus checks to most Americans, to be signed by President Joe Biden before a March 14 deadline, so as to renew pandemic-era federal unemployment benefits from mid-March through early September.\n\nThe prospects of a strong recovery enabled by both the ongoing vaccine rollout as well as the historic levels of fiscal and monetary policy stimulus have simultaneously pushed growth forecasts sharply higher, while also stoking concerns over an overly rapid rise in inflation.\n\nHOT SECTORS:\n\n1. Passenger Transportation \\^MESA \\^JBLU \\^SAVE \\^UAL \\^LUV \\^ALGT \\^AAL \\^HA\n2. Media &amp; Publishing \\^AHC \\^SALM \\^GAIA \\^DLPN \\^CIDM \\^UONE \\^UONEK\n3. Speciality Retailers \\^EXPR \\^GME \\^CHS \\^JAN \\^SBH \\^BBBY\n4. Household Goods \\^MWK \\^ETH \\^NTZ \\^FLXS \\^TILE\n5. Containers/Packaging \\^WRK \\^GPK \\^GEF \\^DNMR\n6. Homebuilding/ Household Goods \\^AFI \\^TGLS \\^CNR \\^CHCI\n\nAH RUNNERS TURN POTENTIAL PM GAPPERS: $INVO $GTBP $ACST $OPGN $AYTU $CYTH $HGBL $CCNC\n\nCRYPTO/BLOCKCHAIN PLAYS: (BITCOIN TRADING OVER $53,000 TONIGHT)\n\nSympathy/Related: #MOGO #SOS #NXTD #MGI #EQOS #BRQS #AIKI4 #IZEA #AEHL #DPW #PBTS #MARA #PHUN #RIOT #EBON #HIVE #BRQS #IPDN\n\nSPACS:\n\n$NHIC – 10X the average daily volume today! This company provides touchless security that identifies weapons and other items with a method that is 10 times faster than metal detectors, according to the company.The company’s screeners can process 3,600 visitors per minute and lower the physical footprint and reduce the costs of additional security guards at entrances. The company has a deal with Six Flags Entertainment. Evolv's stadium partners include the Chicago Cubs, Chicago White Sox and Manchester City. The company listed the United States Department of Defense as a customer in its presentation. Evolv sees the touchless security market growing from a $20-billion addressable market to $100 billion. Future growth segments include bitometrics, health screening and ticketing, according to Evolv. The PIPE includes Peyton Manning, Andre Agassi, Steffi Graf, Joe Torre, Theo Epstein, Tony Ressler, Mark Attanasio and Bennett Rosenthal.The existing investors in Evolv Technology include Bill Gates, Lux Capital, General Catalyst and Motorola Solutions.\n\n$HZON – 5x the average daily volume. A sports data company is reportedly in talks to go public via a SPAC deal that could value the company at more than $10 billion. Sportradar is in talks to go public via a SPAC merger with Horizon Acquisition Corp II. Sportradar provides data from sports contests to sports betting providers. The company had deals in place with the big four U.S. sports last year with MLB, NBA, NFL and NHL. Sportradar also has a deal with the International Tennis Federation. Investors in Sportradar include the Canada Pension Plan Investment, Michael Jordan, Mark Cuban and Revolution Growth. Sportradar could be valued at between $10 billion and $12 billion, according to SportsHandle.\n\n    \t\tSympathy/Related: #CCIV #DKNG #IPOE #BFT #DMYI #PSTH #IPOF  \n\nTECHNICALS/VOLUME PLAYS:\n\n$OPGN - Over 374 million shares trades today. Using the 200 MA ($2.62) as a support base on the daily chart.\n\n$EYES - Volume of 320 million shares trades today. Based on the 4hr, the candles' small body shows a pullback may be near, looking for that $9.12 set up before making an entry.\n\n$EARS - 19 million shares traded - seems small compared to the above tickers, but when the average is around one million, then you have to scalp on the momentum.\n\n$GLSI -Over 7 million shares traded when the avg. is 250k +/- again watch for the setup around $33.37 for a scalp.\n\n$WKHS - House oversight panel examining postal service award to Oshkosh Corp. (OSK) - Bloomberg. Base on the daily chart made a breakthrough my resistance line $15.33, just to pull back in what I am calling a consolidation spot ($15.33 to 13.37). News will move this stock to so keep an eye for scalping slowly back to the 200 ma at $19.97.\n\nWSB STONKS BACK IN PLAY:\n\n$SNDL - One of WSB favorite to keep on your eye on for the next few days. E/R 3/17 could have a run-up back to 1.34 20 MA based on the daily chart. Stocks with CRAZY Volume. Looking for entry for a quick scalp.\n\n$AMC $CTRM $NAKD $F $NOK $KOSS\n\n$GME $BBBY $BB $NNDM $EXPR $NETE\n\nBEARISH PLAYS:\n\n$UVXY – In a scary market, buy the fear index. VIX plays always help to hedge your bullish plays. Buy this on a bullish day when the price is low, and hold for down days to even you out or make you profitable. Great swing too or call options with exp. dates into next year.\n\n$GDX – Stock is at lows. This is a Gold mining ETF. Gold looks ready to pop as inflation worries are becoming more real in investor’s eyes and a bear market looms nearer. Getting into ETF’s like this one limits risk of picking an individual company.\n\n    \tSympathy/Related: #SQQQ #VXX #SOXS #BZQ #YANG #SSG #WEBS #FNGZ #EDZ   \n\nBack Burners: \\^SALM \\^BYFC \\^UONEK \\^UONE \\^CARV \\^IMTE \\^OPTT \\^PHUN \\^CREG \\^RAVE \\^PIXY",
        "subreddit": "smallstreetbets",
        "title": "Watchlist 3-9-21 👀",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/m0yb8n/watchlist_3921/",
        "created": 1615291449.0
    },
    {
        "author": "LeRumba",
        "created_utc": 1615486315,
        "id": "m2wqlm",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n**MicroVision: $150 stock when acquired for $20 Billion?**\n\nI can’t tell you what people expect from the 4th Qtr CC, but I wouldn't look for an announcement that the company was sold. I wouldn’t look for an announcement that someone took an equity stake. I wouldn't look for an announcement that Lidar A-Sample is already done. In my opinion these are not realistic expectations and may not happen at the 4th Qtr Earnings CC.\n\nHowever, I would look for an update on all of the relevant topics with a positive spin… that’s the new MicroVision where the minor dilution of (2.5 million shares sold for $50 million) was done before the 4th Qtr Earnings CC, and not afterwards as has been the case over the past 15 years.\n\nI expect MVIS stock to move forward and not backwards. I would NOT expect that everything is status quo. MicroVision of today is an energetic, vibrant and a wealthy company with a market cap of over $2.5 billion… a historical high.\n\nSo if you own the stock now at the current price and we find out that things are improving and progressing well, why would you sell?\n\nI would look for a mention that we have 50 million more going into 4th Qtr Earnings CC, that we didn't have a few weeks ago. I would expect that the Lidar A-Sample is on target for April and some key specs have improved. I would expect that we have multiple companies conducting due diligence toward acquiring the company.\n\n**MicroVision: Why a $150 stock when acquired for $20 Billion?**\n\nReal billion dollar ideas have trillion dollar market size, they are scalable, and leverage the drivers of growth to go viral or global.\n\nIn my last [research on MicroVision ](https://www.lerumba.com/Directory/microvision-holds-the-keys-to-the-future-3000-profit-potential-in-over-10-billion-ma-article-132.aspx#.YEpP3Z1KjIU)(NASDAQ: MVIS), I introduced this 20 year old high-tech company that is at the cusp of acquisition by a major technology company. In the last few weeks, MVIS stock price has gone up by 60-fold \\[from 25 cents to over $15\\] on well qualified speculations. Now it is trading in the $14 to $24 range giving new investors the opportunity to take position; for the future of $70 to $150 dollar trading range in the next 12-months or so... depending on the acquisition price of $10 billion or $20 billion.\n\n**Here's the short answer...**\n\nEach of the Six LBS core technology verticals can spawn Trillion dollar markets of the future. Considering the diversity of its product line, built around the LBS core technology over the last 20 years, and protected by it's IP and 500 patents, each core vertical can spawn markets worth trillions, and be worth billions in an acquisition or a merger.\n\n**Why sell the company or merge with a deep pocket Tier 1 Technology partner...**\n\nAt low volumes, the cost of components that MicroVision sells to its Tier 1 partners is 5 to 10 times higher than what it is sold for in anticipation of large quantities... and loosing money on each component sold is what has shaped the company's past blunders loosing millions of dollars each quarter for the last 15 years.\n\nFinally, to sell the company, or to sell one or all of its 6 core vertical engines that can spawn trillion dollar markets, is the right decision. Under the leadership and stewardship of a deep pocket Tier 1 technology partner from the FAMGA gang can truly realize the potential of MicroVision technology, and bring hundred of products to the market that will be sold in billion units per year.\n\nIn the last few weeks, MVIS stock price has gone up by 60-fold \\[from 25 cents to over $14.95\\] on qualified speculations. Now it is trading in the $14 to $24 range giving new investors the opportunity to take position; for the future of $70 to $150 dollar trading range in the next 12- months or so... depending on the acquisition price of $10 billion or $20 billion.\n\n[**What to expect from sale or merger of MicroVision...**](https://www.lerumba.com/Directory/microvision-30-stock-when-acquired-for-5-billion-article-127.aspx#.Xz3sPchKjIX)\n\nOver the last 3 decades, the FAMGA tech giants — Facebook, Amazon, Microsoft, Google, and Apple — have collectively made [770 acquisitions](https://www.cbinsights.com/search/deals/?invs=1038%2C1167%2C10160%2C12103%2C19786&amp;comStatusIds=2&amp;invStages=M%26A&amp;limit=25&amp;offset=0&amp;displayType=table). Even amid the Covid-19 pandemic, some have continued to write checks, with Apple being the [most active acquirer in 2020 to date](https://www.cbinsights.com/search/deals/?sdate=2020-01-01&amp;edate=2020-05-05&amp;invs=1038%2C1167%2C10160%2C12103%2C19786&amp;comStatusIds=2&amp;invStages=M%26A&amp;limit=25&amp;offset=0&amp;displayType=table) among them.\n\nThis FAMGA group of acquirers has deep pockets. Some of their biggest checks have been written for high-profile companies such as career platform [LinkedIn](https://www.cbinsights.com/company/linkedin) (acquired by Microsoft for $26.2B), chat app [WhatsApp](https://www.cbinsights.com/company/whatsapp) (Facebook for $22B), and video-sharing platform[YouTube](https://www.cbinsights.com/company/youtube) (Google for $1.7B).\n\nLuminar Technologies ([LAZR](http://finance.yahoo.com/quote/LAZR?p=LAZR)) went public and the stock price at $40 dollars more than doubled in two days as a public company, with a market cap of over $14 billion… and made its co-founder CEO Austin Russell a billionaire ─ at the age of 25. Luminar specializes in making Lidar sensors for the [automotive sector](http://www.fool.com/investing/stock-market/market-sectors/consumer-discretionary/automotive-stocks/) that will be used in the development of autonomous vehicles.\n\nHowever, the keys to several future technologies are being held by an older company MicroVision that was always ahead of its time. [MicroVision](http://www.microvision.com/) (MVIS), founded in 1993, is most famous for their Micro Electro Mechanical systems (MEMs) and Laser Beam Scanning (LBS) technology that is protected by over 500 patents.\n\nMicroVision’s automotive Lidar will be packaged in a solid-state module that is smaller, cheaper and more versatile than potential competitors like Luminar and Velodyne.\n\nAutonomous vehicles of the future will utilize MicroVision’s Lidar because it is a superior “Best in Class” technology compared to Luminar and Velodyne; and due to its small size, 280M range, and point cloud density of 20 million points per second.\n\nT**OP 5 ACQUISITIONS BY COMPANY**\n\nBelow, we break down each of these companies’ top 5 acquisitions by value. Read more about these deals in the posts linked below.\n\n**Facebook**\n\n1. [WhatsApp](https://www.cbinsights.com/company/whatsapp) ($22B, 2014)\n2. [Oculus VR](https://www.cbinsights.com/company/oculus-vr) ($2B, 2014)\n3. [Instagram](https://www.cbinsights.com/company/instagram) ($1B, 2012)\n4. [CTRL-labs](https://www.cbinsights.com/company/ctrl-labs) ($1B, 2019)\n5. [LiveRail](https://www.cbinsights.com/company/liverail) ($500M, 2014)\n\n**Amazon**\n\n1. [Whole Foods](https://www.cbinsights.com/company/whole-foods-market) ($13.7B, 2017)\n2. [Ring](https://www.cbinsights.com/company/bot-home-automation) ($1.2B, 2018)\n3. [Zappos](http://www.cbinsights.com/company/zappos) ($1.2B, 2009)\n4. [PillPack](https://www.cbinsights.com/company/pillpack) ($1B, 2018)\n5. [Twitch Interactive](https://www.cbinsights.com/company/justintv) ($970M, 2014)\n\n**Microsoft (Top 10)**\n\n1. [LinkedIn](https://www.cbinsights.com/company/linkedin) ($26.2B, 2016)\n2. [Skype](https://www.cbinsights.com/company/skype) ($8.5B, 2011)\n3. [GitHub](https://www.cbinsights.com/company/github) ($7.5B, 2018)\n4. [Nokia’s Devices &amp; Services Business](https://www.cbinsights.com/company/nokia) ($7.2B, 2014)\n5. [aQuantive](https://www.cbinsights.com/company/aquantive) ($6.3B, 2007)\n6. [Mojang](https://www.cbinsights.com/company/mojang) ($2.5B, 2014)\n7. [Affirmed Networks](https://www.cbinsights.com/company/affirmed-networks) ($1.4B, 2020)\n8. [Visio Corporation](http://www.cbinsights.com/company/visio-corporation) ($1.4B, 1999)\n9. [Navision](http://www.cbinsights.com/company/navision) ($1.3B, 2002)\n10. [Yammer](http://www.cbinsights.com/company/yammer) ($1.2B, 2012)\n\n**Google (Top 6)**\n\n1. [Motorola Mobility](https://www.cbinsights.com/company/motorola-mobility) ($12.5B, 2012)\n2. [Nest Labs](https://www.cbinsights.com/company/nest-labs) ($3.2B, 2014)\n3. [DoubleClick](https://www.cbinsights.com/company/doubleclick) ($3.1B, 2007)\n4. [Looker](https://www.cbinsights.com/company/looker-data-sciences) ($2.6B, 2019)\n5. [Fitbit](https://www.cbinsights.com/company/fitbit) ($2.1B, 2019)\n6. [YouTube](https://www.cbinsights.com/company/youtube) ($1.7B, 2006)\n\n**Apple (Top 7)**\n\n1. [Beats Electronics](https://www.cbinsights.com/company/beats-electronics) ($3B, 2014)\n2. [Intel — Smartphone Modem Business](https://www.cbinsights.com/company/intel-smartphone-modem-business) ($1B, 2019)\n3. [Dialog Semiconductor](https://www.cbinsights.com/company/dialog-semiconductor-chip-power-management-unit) ($600M, 2018)\n4. [Anobit Technologies](https://www.cbinsights.com/company/anobit-technologies) ($500M, 2011)\n5. [Texture](https://www.cbinsights.com/company/next-issue-media) ($485M, 2018)\n6. [Shazam](https://www.cbinsights.com/company/shazam) ($400M, 2017)\n7. [NeXT Computer](https://www.cbinsights.com/company/next-computer) ($400M, 1996)\n\nAs an investor you know change equals opportunity… the bigger the change, the bigger the opportunity. The next few years are going to be either the most interesting, exciting, and lucrative years for you or you’re going to be left behind.\n\n**Change can mean big profits for investors getting in on the biggest changes early.**\n\nThese two sectors -- artificial intelligence and TaaS -- are all seeing massive changes and we’re just starting to see their impact in the world.\n\nHistorically, when you just start to see these changes is the best time to buy.\n\nAnd it’s why in a few years you’ll be kicking yourself for not jumping on them when you had the chance.\n\nSome of the best, most direct, and highest-potential ways to jump on them are with **Microsoft (MSFT), MicroVision (MVIS) and Tesla (TSLA)**\n\nBest regards,",
        "subreddit": "wallstreetbets",
        "title": "MicroVision: $150 stock when acquired for $20 Billion?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2wqlm/microvision_150_stock_when_acquired_for_20_billion/",
        "created": 1615515115.0
    }
]