[
    {
        "author": "apan-man",
        "created_utc": 1617416944,
        "id": "mizhbi",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "I posted this a few months ago on my twitter and wanted to share with everyone here after several weeks of brutality!  A few words of wisdom and thoughts on investing in SPACs.  Hope some of these are helpful.\n\n&amp;#x200B;\n\n1. Something an old boss told me once when I first started public investing and lost a lot of money on a position: \"If you're not losing money somewhere in the portfolio, you're not taking enough risk.\"\n2. If you’re sweating every tick up or down in a position, you’re TOO BIG. You can’t make clear-headed decisions if you’re overextending in a position. \n3. SPAC asymmetry with a $10 pre-merger floor is your best friend. A 30% move in a SPAC from $10 -&gt; $13 is FAR superior than in a SPAC from $45 -&gt; $60.  Risking $0 to make $3 way better than risking $35 to make $15. ALWAYS be cognizant of risk/reward. \n4. SPACs are event-driven trades rich in catalysts before merger closing featuring a $10 hard floor. SPACs post merger become fundamental investments with no $10 hard floor dependent on very different factors, such as earnings, research coverage, future liquidity from PIPE/sponsors/insiders, etc. The amount of research and thought that goes into a fundamental investment is on orders of magnitude greater than an event-driven bet. Know the difference and size your positions accordingly.\n5. The ability to take advantage of SPAC asymmetry and event-driven catalysts coupled with COMPOUNDING is very powerful. Making 10-100% a trade and recycling that capital 4-8x a year is how you make outsized, unparalleled risk adjusted returns.\n6. Never FOMO or regret missed trades. Your mental state is the most important thing when it comes to making trading decisions. Sulking is a huge opportunity cost and has zero value. Spend that energy finding new SPAC teams or overlooked quality announced deals. Remind yourself, there’s always a new quality SPAC situation just around the corner.\n7. Sizing? When you're in a SPAC near $10 floor (predeal or announced) that you like, SIZE THE F UP.  You’ll never have a better risk/reward opportunity as the price gets closer to $10. As people recognize the quality of the situation and the SPAC trades higher, your ONLY MOVE IS TO TRIM/SELL. As it trades higher, never buy more. Stay disciplined. \n8. Find it hard to trim/sell as it moves up?  Just remember, you're a renter and not an owner of SPACs. Never fall in love with winners or marry a loser. Trim/sell your winners as they perform.  Have a losing trade, lock in that loss!  There is an opportunity and mental cost for “hoping” that the trade will go your way. Locking in losses can be a clearing event for your mind to get right footed\n9. Concerned about record market valuations? The asymmetry of SPACs has you covered. When a market correction eventually does come, that pre-merger hard floor of $10 will be your best friend. You may experience a 10-20% drawdown, but if ur doing it right it'll be from a monster ATH.  Keep some portion of your book in low price pre-deal &amp; post-deal SPACs and you’ll ride out these storms really well.\n10. Another beautiful thing about SPACs is that you can use ones near $10 as cash alternatives that feature upside optionality. If there is a market correction, it's nice to be able to sell low price SPACs, raise cash and buy other quality SPACs that have gotten pummeled. \n11. NEVER be fully invested on margin. If you're using margin w/ SPACs, that's just being greedy and taking on unneeded risk. Maintain some cash/margin/low price SPACs as a credit line ready for times of dislocation. There have been and will continue to be these periods like Sep/Oct 2020, GME-driven hedge fund unwind and NOW the 2H Feb/March 2021 rising rate / IPO oversupply derisk.\n12. In 2008/2009 several hedge funds ran large SPAC books on margin and when the liquidity crisis hit, they had to offload them at big discounts. RH raised margin requirements on SPACs in Sep 2020 causing a huge retail unwind. Be positioned to take advantage! \n13. RISK MANAGEMENT: SPACs as an asset class are HIGHLY correlated. They all move together since the same hedge funds, retail investors, etc. all own some combination of the same names. There will be times of deleveraging / risk off, which is why point #11 is important!\n14. Take advantage of SPAC hard floors to upgrade in a period of dislocation. A big selloff happens and a SPAC you own has traded from $14 to $10.50, however a high flyer you missed before has gone from $20 to $11. Lock in that loss and upgrade your position!\n15. Undertaking this upgrade just improved your risk/reward materially and positioned your portfolio for a stronger recovery in the market rebounds. This is a simplified example and there are other factors to consider such as industry, deal close timing, valuation, etc. \n16. Following investor sentiment is critical. When everyone is high fiving and talking about meeting up in Vegas, it’s time to trim winners and build up some cash or low priced commons/units. \n17. When a major derisking occurs in SPACs, it can be fast and violent as the entire asset class is highly correlated. You’ll know a bottom is in when others have completely lost hope - “SPACS ARE DED!” That is the time to aggressively trade up your portfolio.\n18. Don’t forget your own feeling of pain and fear as it will come in handy the next time there’s a major derisking in SPACs… you’ll be better prepared to not only survive, but recognize when a bottom is in and take advantage of it.",
        "subreddit": "SPACs",
        "title": "SPAC Investing Words of Wisdom",
        "url": "https://www.reddit.com/r/SPACs/comments/mizhbi/spac_investing_words_of_wisdom/",
        "created": 1617445744.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1617654798,
        "id": "mku6oi",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "**Dow +1.13%, S&amp;P 500 +1.44%, Nasdaq +1.67%, Russell 2000 +0.49%**  \n\n\n* **Synopsis**\n   * US equities rallied Monday with S&amp;P 500 and Dow both setting new record closes. Growth outperformed value, though both factors saw good gains. Consumer discretionary was the leader with travel and leisure names faring well. Communications services performed well with FB and GOOGL strength. Tech was boosted by AAPL and MSFT. Energy was the only sector lower on the day. Treasuries were mostly firmer led by the five year point of the curve after rates saw some upward pressure on Good Friday when equities were closed. 10s finished above 1.70% again. Dollar weakened vs both yen and euro. Gold finished fractionally higher. WTI crude ended down 4.6%.\n   * **Market was largely supported by combination of upbeat recovery sentiment following better March employment data and fairly well behaved bond yields**. Nonfarm payrolls surged 916K, well above the 660K consensus, while net upward revisions to prior months totaled 156K. Economist takeaways were positive, highlighting the broad-based job creation, the room for further recovery over the next few months in the industries most adversely impacted by the pandemic and the lack of upward pressure on wages. Fits with broader reopening momentum seen in high-frequency indicators surrounding mobility, card spending, air travel and dining out.\n   * **ISM services hit record high** in March. **Biden said not worried about a tax increase hurting economy** amid heightened debate about how to best fund infrastructure stimulus. **Manchin reiterated corporate tax rate should settle at 25%**, **not 28%**, and more money should come from high earners. **Yellen said US working with G20 on global minimum tax**. Also called on other nations to avoid pre-emptive fiscal tightening. **US vaccine outperformance continues** with seven-day average of 3M+ doses per day, seemingly overshadowing some concerns about a **potential fourth wave**. Multiple reports discussed **dampened momentum behind retail investors**.\n   * **GOOGL** secured favorable ruling from SCOTUS in Android copyright infringement case. **TSLA** Q1 deliveries hit a new record high and beat consensus expectations. **PLTR** boosted by \\~$90M NNSW contract. **PINS** has reportedly held talks to acquire photography app VSCO. **PXD** to acquire DoublePoint Energy in a cash and stock deal with an EV of $6.4B. **DAL** forced to cancel \\~100 flights due to a staffing shortage. **GME** announced 3.5M share secondary offering. **NVTA** higher on Softbank-led investment. **TPCO** board blessed higher takeover bid. **BVH** announced intent to acquire the 7% of **BXG** it does not already own. **LEAF** to be acquired by **GHC** for $323M in cash.\n\n&amp;#x200B;\n\n* **Digest**\n   * **Most sectors finished higher, with growth groups outperforming:**\n      * **Consumer discretionary** led the market with strength from AMZN, auto names, and travel/leisure names (NCLH submitted plans to CDC for cruise resumptions). The megacap internets were stronger in **communication services**. MSFT and AAPL helped boost **tech**, with the semi space mostly higher as well. **Consumer staples** were a touch behind on food losses though good gains among drug stores, grocers, and beverages. **Industrials** trailed a bit though transports, A&amp;D, and multis performed well. **Materials** **lagged somewhat with packaging performing well while precious metal miners lagged. Financials** lagged with banks mixed and tech lending lower. **Healthcare** was a relative underperformer. MedTech stocks were generally better but there was some scattered weakness in biotech and pharma. **Energy** was the only sector lower, with E&amp;Ps and oil-services firms weaker alongside crude oil.\n   * **Big beat for March payrolls:**\n      * Nonfarm payrolls surged 916K in March, the biggest gain since last August and well above the 660K consensus. In addition, the net upward revision to prior months totaled 156K. The unemployment rate fell by 0.2pp to 6.0%, in line with expectations. Household employment increased 609K, the participation rate rose 0.1pp to 61.5% and the employment-population ratio increased 0.2pp to 57.8%. Average hourly earnings fell 0.1% m/m vs expectations for a 0.1% gain, with compositional changes flagged as an overhang. Economist takeaways were positive, highlighting the broad-based job creation (Goldman Sachs said industry breadth hit a 9-month high) and the further room for recovery over the next few months in the industries most adversely impacted by the pandemic. There was some discussion about a return to the pre-pandemic level of jobs by year-end.\n   * **ISM non-manufacturing index posted record high:**\n      * **ISM non-manufacturing index** for March soared to 63.7, beating 58.5 estimate and up from prior month 55.3. Highest reading in series history (from 1997). Business activity index up 13.9 at 69.4, new orders index up 15.3 at 67.2, employment index up 4.5 at 57.2. Prices index rose 2.2 to 74. Respondents noted lifting of Covid restrictions has unleashed pent-up demand while capacity constraints remain a challenge. Elsewhere, March **Markit services PMI** at 60.4, up 0.4% from flash; above Feb's 59.8. Highest since Jul-14. New orders, input, output cost series up sharply. Production, employment, expectations also rose. February **factory orders** were -0.8% as expected following +2.7% in the prior month, while durable goods orders revised down a tenth to -1.2% for the month. Thursday's **initial claims** (719K prior) and Friday's March **producer price index** (cons 0.5%, prior 0.5%) are the only other major data releases this week.\n\n&amp;#x200B;\n\n* **Afternoon headlines:**\n* **Markets:**\n   * Equity market growing less concerned about rising Treasury yields ([Bloomberg](https://www.bloomberg.com/news/articles/2021-04-05/yield-scare-that-shocked-stocks-in-february-barely-registers-now?sref=J9GPLx1B))\n   * Q1 M&amp;A financing hit highest level since 2018 ([Bloomberg](https://bloom.bg/3rTkrQf))\n* **Economic policy/stimulus:**\n   * Manchin says he won't support raising corporate tax to 28%, but could see 25% ([Bloomberg](https://bloom.bg/2PVjcTe))\n   * Treasury Secretary Yellen calls for global minimum corporate tax rate ([WSJ](https://on.wsj.com/3fJPBqQ))\n   * New York lawmakers reach agreement to raise taxes on wealthiest residents to highest combined rate in US ([Bloomberg](https://bloom.bg/3uleVaH))\n   * Democrats prepare plan to tax multinational corporations (NY Times)\n* **Corporate:**\n   * Supreme Court rules Alphabet didn't commit copyright infringement in using Oracle code in Android OS ([Bloomberg](https://bloom.bg/2PASSxW))\n   * UBS estimates one in 11 retail stores will close in the next five years ([Bloomberg](https://bloom.bg/3dDjkPo))\n* **Crypto:**\n   * Cryptocurrency market capitalization hits record $2T, with bitcoin at $1.1T ([Reuters](https://reut.rs/3mkXioB))\n\n&amp;#x200B;\n\n* **Notable Gainers:**\n   * \\+21.3% **LEAF** (Leaf Group): Agreed to be acquired by Graham Holdings Company (GHC) for $8.50 a share in cash in a deal valued at $323M; represents a \\~21% premium to prior close.\n   * \\+13.5% **AMC** (AMC Entertainment Holdings): Upgraded to buy from neutral at B. Riley; has been impressed with management's response to Covid headwinds and strengthening balance sheet; elsewhere noted strong weekend performance of Godzilla vs Kong demonstrates pent-up demand.\n   * \\+7.2% **NCLH** (Norwegian Cruise Line Holdings): Submitted plans to CDC to resume cruise operations from US ports in July; said it would recommence operations with 100% vaccinated guests and crew, operate with reduce capacity initially.\n   * \\+5.1% **RBLX** (Roblox): Initiated buy/overweight at Morgan Stanley, Goldman Sachs, Bank of America, Truist; analysts noted strong user growth runway for kids in gaming/social networking while already leading in engagement; also opportunities through subscription tier launch, expansion into China, branded content, education, ecommerce.\n   * \\+4.4% **TSLA** (Tesla): Reported Q1 deliveries of 184,800 vehicles, ahead of 168,000 consensus and representing a new a record high; upside came despite some concerns about a miss stemming from supply chain challenges that have impacted the global auto industry.\n   * \\+4.2% **GOOGL** (Alphabet): SCOTUS ruled 6-2 Alphabet did not commit copyright infringement over software in Android devices; at issue was whether Google's use of Oracle's (ORCL) Java programming language constituted a \"fair use\" and was thus protected from copyright infringement claims.\n   * \\+3.9% **JBLU** (JetBlue Airways): Upgraded to outperform from market perform at Raymond James. Cited recovery in near-international market, opportunity for margin expansion through Northeast alliance with AAL and new cost controls.\n   * \\+3.4% **FB** (Facebook): Barron's cover story positive; noted stickiness of both consumers and advertisers; also cited valuation with shares at 26x forward earnings vs historical average of 32x, and only largely in line with S&amp;P 500; innovation and hidden assets another positive; noted investors already cognizant of risks.\n   * \\+3.1% **NVTA** (Invitae): Confirmed a group led by Softbank Group (9984.JP) will make an investment of $1.15B in convertible senior notes to support future growth initiatives; initial conversion price of $43.18/sh represents a \\~10% premium to Friday's close.\n   * \\+2.3% **PINS** (Pinterest): Company has held talks to buy photography app VSCO, according to NY Times report; noted VSCO was last valued at $550M.\n   * \\+1.6% **PLTR** (Palantir Technologies): Announced it has been selected by the National Nuclear Security Administration for 5-year, $89.9M contract for Safety Analytics, Forecasting, and Evaluation Reporting (SAFER) project that will\n   * \\+1.4% **CZR** (Caesars Entertainment): Upgraded to overweight from equal weight at Morgan Stanley; argued market grossly underestimating recovery in Las Vegas gaming; noted promising booking trends and increasing pricing power; also positive on sports betting exposure.\n* **Notable Decliners:**\n   * \\-17.2% **ACAD** (Acadia Pharmaceuticals): FDA said application for pimavanserin in dementia-related psychosis cannot be approved in its current form; cited multiple flaws with Phase 2 and 3 studies; analysts noted FDA criticisms worse than feared.\n   * \\-7.6% **PXD** (Pioneer Natural Resources): To acquire Double Point Energy in a $6.4B cash and stock deal; Pioneer shareholders to own \\~89% of combined company, DoublePoint owners remaining 11%; downgraded to sector weight from overweight at KeyBanc, saying it is one of the highest purchase prices in years.\n   * \\-2.4% **GME** (Gamestop): Announced ATM equity offering program for up to 3.5M shares; proceeds to help further accelerate its transformation and strengthen balance sheet; stock up over 900% ytd and 6,700% in last 12 months.\n* **S&amp;P 500 Sector Performance**\n   * **Outperformers:** Consumer Disc. +2.28%, Tech +2.02%, Communication Svcs. +2.27%\n   * **Underperformers:** Energy (2.41%), REITs +0.59%, Healthcare +0.66%, Financials +0.74%, Utilities +1.09%, Materials +1.22%, Industrials +1.27%, Consumer Spls. +1.28%\n* **Data**\n* DXY: 92.6, (0.45)\n* €-$ +0.0055 or +0.47% to 1.1812\n* £-$ +0.0079 or +0.57% to 1.3904\n* $-¥ (0.47) or (0.42%) to 110.20\n* €-¥ +0.04 or +0.03% to 130.15\n* 2-year yield (2) bps to 0.16%\n* 10-year yield (1) bps to 1.71%\n* 30-year yield (0) bps to 2.36%\n* WTI Crude (May 21): ($2.69) or (4.38%) to $58.76\n* Gold (Jun 21): +$0.40 or +0.02% to $1728.8\n* Breadth on the NYSE is positive 1.57:1; breadth on the Nasdaq is positive 1.29:1\n* Index Performance\n   * Month/Quarter-to-date: Dow +1.65%, S&amp;P +2.64%, Nasdaq +3.46%, Russell +2.00%\n   * Year-to-date: Dow +9.54%, S&amp;P +8.57%, Nasdaq +6.34%, Russell +14.69%",
        "subreddit": "stocks",
        "title": "U.S. Market Recap - Monday, April 5, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mku6oi/us_market_recap_monday_april_5_2021/",
        "created": 1617683598.0
    },
    {
        "author": "Safe-Astronomer3020",
        "created_utc": 1618774376,
        "id": "mtjoln",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Tl/dr: Squeeze is coming, Dominos are falling, be patient and trust in your fellow apes to HODL the line 🦧 🤚💎🚀\n\nIt seems the last few days have been quiet on the news front with no new regulations coming out/passing from the DTCC/SEC/OCC and no news catalyst for AMC after a slew of new regulations dropped and the amazing Trey’s Trades interview with the Silverback himself, Adam Aron the prior week or so🍿🙌🏻 Luckily it looks as though reinforcements are coming in the form of large investors and more good news on the regulations front 💎🤚\n\nWith the above said, the reason they seem to be making more of an asserted effort to cover looks to be an article from October of 2020 with a 6 month deadline, Aka April 22 (Thursday). Article is below:\n\n[SEC October 2020](https://www.sec.gov/news/public-statement/staff-fully-paid-lending)\n\nLink to letter from October further breaking down the need to more collateral from these large funds on their highly leveraged trades. The letter was written by Elizabeth Baird, Deputy Director, Division of Trading &amp; Markets, U.S. Securities &amp; Exchange Commission to MS Kris Dailey, VP Office of financial and operational risk policy.\n\n[October Letter](https://www.sec.gov/divisions/marketreg/mr-noaction/2020/finra-fpl-20201022-15c3-3.pdf)\n\nTo see the finance industry starting to scramble all in unison is something to be cognizant of...  Bank of America (ticker: BAC) sold $15 billion of bonds across six tranches, the biggest sale ever for a bank, according to Bloomberg. On Thursday, JPMorgan Chase &amp; Co . (JPM) sold $13 billion of bonds across five tranches, which was the largest on record until Bank of America’s Friday offering. Goldman Sachs (GS) sold $6 billion of bonds in two tranches. Goldman’s bonds were fixed rate, and the others had a mix of fixed- and floating-rate (and fixed-to-floating) debt.  *Article below* not to mention RBC had a massive 66% drop after hours Friday (link to @JoshuaJammes post below)... and guess who one of their biggest investors is?? You guessed it, the one and only... CITADEL 💩 Oh, heard they were hard at work in the wee hours of the night last night as well, of course trying to make the world a better and safer place I would assume 😂😂😂😏🤦🏻‍♂️\n\n[Massive Bond Sales: JP Morgan &amp; B of A](https://www.barrons.com/articles/goldman-sachs-bank-america-jpmorgan-bonds-dividends-51618602441)\n\n[Via @JoshuaJammes](https://twitter.com/joshuajammes/status/1383515800678457360?s=21) \n\nThe SEC is making moves as well, Gary Gensler was finally sworn in as a member of the SEC. Gensler is very pro the retail investor so I would not be surprised if he aides in regulations to potentially start a squeeze or make it more possible. He wants the market back on track, the manipulation isn’t helping anyone...\n\n[Gensler Sworn- In](https://thehill.com/policy/finance/548827-new-sec-chair-gary-gensler-sworn-into-office)\n\nThere is also more Bullish buying news out of larger funds, Vanguard has once again stepped in and upped their position in AMC by a whopping 18.9 million more shares making Blackrock and Vanguard the 2 largest funds invested in AMC 😳🍿🙌🏻 \n\n[Via @wormfallJim on Twitter](https://twitter.com/wormfalljim/status/1383533194155216903?s=21)\n\nMatt Kohrs also has been doing a killer job keeping everyone updated on the Ortex numbers, appreciate you not having us all spend $500 a year. He updates daily on Twitter and all day on his live stream. Last time AMC utilization hit 100% we jumped to $20+ the next day... that was when we were at $4.50-$5 and shares shorted were less than half of current numbers..... not saying To the moon BUT I like this stonk 😏\n\n[Via @Matt_khors Twitter](https://twitter.com/matt_kohrs/status/1383028490505760769?s=21)\n\nThe Fintel short interest borrow rate has also been steadily increasing the past week, while shares available have stayed relatively low 2,000,000 or less, the rate has gone from single digits to over 18% at the close of business Friday. I would not be surprised to see utilization eclipse 100% by Tuesday abd borrow rate to surpass 20% 😳🤑\n\n[Fintel Numbers for AMC](https://fintel.io/ss/us/amc)   \n\nRegarding the short interest, Ihor from S3 partners does a nice job providing updates. Current numbers are:\n\n#AMC short interest is $893M\n90.22M shares shorted\n21.60% SI% of Float\n17.77% S3 SI% Float\n4.31% fee.\nShares shorted up +15.6 million shares, worth $155 million, +21.0%, last week.\nShorts down -$397 million in 2021 mark-to-market losses; up +$61 million on today's -6.77% move\n\n[Ihor from S3 AMC Update ](https://twitter.com/ihors3/status/1383135182237093889?s=21)\n\nHow does a small brained ape like me feel about all of this? More confident than I did last week. The squeeze is coming, the dominos are falling into place. We just need to continue to HODL and we will all be watching movies on the moon 🌙 Stay the course, hopefully this has brought you some more confidence for the upcoming week as something is definitely churning up 😳💎🤚🚀\n\nSincerely, \nThe dude HODL’ing 8700 shares that my wife’s boyfriend has no idea about... neither does she 😏🦧💎🤚🚀\n\n\nPS: First post, not sure if I went full retard enough or not with the DD for my fellow apes 🦍  Was hesitant to post, but have been a HODLer since January, never sold, and been doing my own DD along the way... #sharingiscaring #tothemoon #thisistheway #AMC",
        "subreddit": "Wallstreetbetsnew",
        "title": "Selloff + Bond Sales = Start of MOASS?!?!",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mtjoln/selloff_bond_sales_start_of_moass/",
        "created": 1618803176.0
    },
    {
        "author": "Rmogo21",
        "created_utc": 1619372065,
        "id": "myd54z",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\nI had the chance to interview Mark this past weekend and discuss his trading background, daily and weekly routines, entry setups, sell rules, risk management rules, and advice for new traders.\n\nMark is a veteran trader with over 35 years of experience on wall street. Over his career, he has yielded incredible performance including a 5 and a half year period where he averaged a 220 percent annual return with only one losing quarter for a total compounded return of over 33,500% \n\nHe is also the author of fantastic trading books including Trade Like A Stock Market Wizard, Think And Trade Like And Champion, and Mindset Secrets For Winning as well as being featured in Market Wizards by Jack Schwager \n\nFinally, he is the US Investing Champion of 1997 and currently leads the 2021 money manager division with a gain of 111% in just 3 Months: [https://financial-competitions.com/](https://financial-competitions.com/)\n\nIn the interview, we spend the latter half going through charts and discussing how he interprets price action. Below I've put the video timestamps so you can see exactly what we cover: \n\nLink: [https://youtu.be/-hBsPtBnZKQ](https://youtu.be/-hBsPtBnZKQ)\n\nTimestamps\n\n[0:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ) Introductions\n\n[1:04](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=64s) Aha Moments That Changed Mark's Trading \n\n[1:25](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=85s) Reading How to Trade in Stocks by Jesse Livermore \n\n[2:13](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=133s) What Historical Traders and Books did Minervini Study \n\n[3:20](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=200s) Rules and Discipline are Essential for Super-Performance \n\n[4:04](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=244s) Its like being a Great Athlete- You have to be focused and Disciplined \n\n[4:34](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=274s) Mark Ritchie \n\n[4:49](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=289s) How to structure your goals to achieve Superperformance \n\n[5:15](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=315s) You accomplish what is on top of your priorities list \n\n[5:45](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=345s) Ed Seykota- Everyone gets what they want out of the market. \n\n[6:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=360s) You don't get to be an Olympic Athlete without putting that goal above all else \n\n[6:30](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=390s) The Mark Minervini Volatility Contraction Pattern VCP \n\n[7:33](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=453s) The VCP is a Characteristic, Its the Effect not the Cause \n\n[8:12](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=492s) It's not because of the chart that it works, it's Supply and Demand \n\n[8:35](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=515s) Supply has Stopped coming to market \n\n[9:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=540s) VCPs have been occurring since the 1800s, Nothing has changed \n\n[9:45](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=585s) Marks Daily Routine - Mindset and Preparing to Trade \n\n[10:08](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=608s) Breathing Exercises - Visualizing Outcome - How will I deal with it \n\n[10:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=650s) All work is done the night before - Ideas, Pivots, Position Management \n\n[11:30](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=690s) Marks Weekly Routine, Scanning for Ideas \n\n[11:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=710s) Searching for Ideas \n\n[12:24](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=744s) Non Negotiable Criteria - Minervini Trend Template \n\n[12:40](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=760s) 98% of the Greatest Winning stocks were in Stage 2 Uptrends \n\n[13:16](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=796s) You don't have to get in early, wait for the uptrend \n\n[13:28](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=808s) Tips for people to Find VCPs - Train your Eye and Build your own Model Books \n\n[14:45](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=885s) Study past great winners \n\n[14:54](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=894s) Always looking for the Fundamentals Great Earnings, Sales, Margins, But it has to has the technicals \n\n[15:54](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=954s) Does mark look for Group Moves? \n\n[16:25](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=985s) Sometimes the Leaders Take Off Before a Group Moves Develops \n\n[17:09](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1029s) Golden Nugget - Focus on Stocks then the groups then the market \n\n[17:30](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1050s) How does Mark screen for Leaders during a Correction \n\n[17:58](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1078s) Focus on Stocks with High RS, Near Highs, Rebounding the fastest \n\n[18:06](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1086s) In a Late-stage bull market then a correction scan for RS during the Correction - Utility Screen [18:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1130s) What is a Pivot point - What are you are looking for to buy \n\n[19:25](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1165s) The Key is you are trading in a way that you know what to expect. Master a few setups \n\n[19:54](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1194s) Golden Nugget - Know when something is acting normal or abnormal \n\n[20:13](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1213s) How Jesse Livermore Used Pivot Points \n\n[20:35](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1235s) O'Neil Buy Points \n\n[20:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1250s) Surgical Buy Points - Pradeep Blonde and David Ryan \n\n[21:15](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1275s) Study the Past Greats and Refine using the Tools available \n\n[21:45](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1305s) How Mark Uses different timeframes near Pivot points \n\n[22:20](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1340s) Buying Pullbacks - Waiting for the stock to turn up \n\n[22:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1370s) Where does Mark Put his Stop Losses - Obvious and Non-Obvious Levels \n\n[23:40](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1420s) The Main thing is the math behind it. What is my risk \n\n[24:17](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1457s) How many Stocks doe Mark Hold- How does he set Position Sizing \n\n[24:49](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1489s) Trading in the US Investing Championship \n\n[25:23](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1523s) During his best years focused on 4-8 Names 25% Positions and no more than 10-12 \n\n[25:55](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1555s) How does Mark decide when to sell? Adapting to the Market \n\n[27:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1620s) Golden Nugget - It does not matter what happens after you sell. Turn over your edge Coin Example \n\n[28:35](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1715s) Golden Nugget - When do you sell into strength versus into weakness \n\n[30:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1800s) How does Mark use Progressive Exposure to bend with the market \n\n[30:30](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1830s) If you buy 2 stocks and they work, those profits finance your forward risk \n\n[31:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1910s) If your last few trades have not worked, you should be lowering position sizing \n\n[32:09](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1929s) Progressive exposure is one of the most important things to protect against drawdowns and to be exposed when things are going well \n\n[32:54](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=1974s) What does make consider when we are extended? Market Indicators. \n\n[33:40](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2020s) Momentum trumps Sentiment. It comes down to the individual stocks \n\n[34:10](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2050s) The best indicator is individual stocks- Setting up before a bull market and rolling over before a correction. \n\n[34:25](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2065s) Going through Charts \n\n[34:35](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2075s) NMM Stock Analysis \n\n[35:15](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2115s) Golden Nugget You want to be knocked out quickly if you are wrong. Don't waste time. \n\n[36:05](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2165s) Entering Failure Resets - Avoiding Volatility - Megaphone \n\n[37:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2220s) Changing Tactics Within an Overall Strategy \\_ Adapting to Results \n\n[38:55](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2335s) How long does the base- contraction have to be \n\n[39:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2340s) Powerplay - Hight Tight Flags \n\n[40:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2400s) Snap Chart Analysis - Relative Strength During a Correction \n\n[40:30](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2430s) Cushion Before Earnings \n\n[41:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2460s) Snap was setting up during a correction \n\n[41:39](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2499s) Snap Pulled in less than the market and Broke out of the base \n\n[43:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2580s) Taking Responsibility for your Trading - Versus Blaming Algos \n\n[44:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2690s) Playing a portion for the larger move \n\n[45:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2750s) The time you should play for the larger move is coming out of a major correction \n\n[46:30](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2790s) 50 Day Rule \n\n[46:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2810s) BOYD Gaming BYD - Respect for the 10 Week MA \n\n[47:50](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2870s) In Post-Analysis how do you determine a good trade or a bad trade. Did you follow your rules \n\n[49:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=2940s) How important is Keeping track of Summary Statistics - Batting Average, Average Gain, Average Loss. \n\n[50:15](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=3015s) Golden Nugget: You should be cognizant of your statistics and use that to determine where to cut losses and take gains \n\n[52:15](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=3135s) How does Mark come back from a big loss or poor trading performance \n\n[54:22](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=3262s) How does Mark Know when to Sell into Strength \n\n[55:00](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=3300s) What matter is what happens between the buy and the sell. \n\n[56:30](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=3390s) General Selling ruling of thumb \n\n[57:17](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=3437s) What can new traders do to shorten their learning curves. \n\n[58:14](https://www.youtube.com/watch?v=-hBsPtBnZKQ&amp;t=3494s) You can't force experience, put in the work, and make a commitment.",
        "subreddit": "StockMarket",
        "title": "Interview with Mark Minvervini. Featured in Market Wizards by Jack Schwager | 33,554% Return over 5 years",
        "url": "https://www.reddit.com/r/StockMarket/comments/myd54z/interview_with_mark_minvervini_featured_in_market/",
        "created": 1619400865.0
    },
    {
        "author": "RogerBrutus",
        "created_utc": 1618945899,
        "id": "muxx11",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Ask &amp; You Shall Receive - As someone in my earlier post inspired by saying that I should share from \"the bible of Green Apes\" Chapter 1 of ??\n\n(This is a long one, so for TLDR purposes, you can skip down to the bottom for brass tacks &amp; bulletpoints; my sources that you guys asked for will also be below)\n\nI know it goes without saying, but I'm not an expert, professional, advisor or anything, I just developed methods over the past few months that worked for me, and I found that my system is \\*consistent, profitable, and more importantly\\* \\*\\*stable\\*\\* .\n\nI traded stocks for a while, since back in college. Buying dumb things like Domino's pizza stock for $40 just because I tried their cheesy bread and liked it.\n\nI only got into options about 10 months ago, after a burglary where scumbags stole literally everything I owned, except clothing. They took everything &amp; anything electronic, if it plugged in or ran on electricity they stole it. I lost literally everything: brand new phone waiting to be set up, my go-to laptop that I had for 8+ years, a new laptop that I had just got and was waiting to transfer files from my old laptop, nintendo switch, PC, gaming consoles, games, dvds, literally everything. \"Insurance\" told me they would cover me up to exactly $0 (ZERO) because I wasn't home and so it wasn't considered \"comprehensive\" so f me... it was an extraordinarily demoralizing low point in my year and very, very depressing.\n\nPolice couldn't/wouldn't do anything because this was peak pandemic 2020 and something like 100 officers and \\*every\\* detective was out of commission with Covid-positive infections. The only thing worse than the $10-15,000 worth of my property vanishing overnight was losing \\*all of my data\\* ; my laptop had files, resumes, school work, personal documents I needed, photos of relatives and my old dog that passed away, everything. They even stole my external hard drives where I backed up all the data that was now lost forever (why? a 1TB drive is like $50 bro, they wouldn't even let me at least have that). \\*Felt bad man\\* ...\n\nFortunately, I had my old cell phone (was in my pocket at the time of the burglary) and I knew that I had to keep my head up and keep it moving. Around late summer, I was going through a lot of trial and error with Options, and I finally hit my first big lick with $15 NIO Calls expiring in December... which went very well (the first time I saw a comma in my return percentage). At the time, I was working in my office job, and I would see a week's worth of wages show up in my daily returns, everyday for months, which made me question why I was wasting my time at that job (I'm not there anymore).\n\n\\-----\n\nSo Here are 2 of my \"Rules\" and a little info on my Method:\n\nRule 1: \\*Don't Lose Money\\*\n\nSomething so simple to say, yet so complex to execute. I identified 4 key things that inevitably lead to losses, and once I identified them, I steered clear:\n\na. Trying to catch a falling knife - rather than trying to time the \"perfect entry\", I was okay with sacrificing \"maximum gainz\" and began to wait to enter in after a good healthy bounce.\n\nb. Living off of YOLOs - Yolos only have 2 outcomes: you either make A LOT of juicy tendies, or you ride down into the 7th layer of hell holding worthless options at 4pm. on a Friday with -99% loss and a solid +95% chance of having a terrible weekend. In my experience yolos are more deadly than covid, 9 out of 10 times you just end up losing your shirt on it. (This is not to say to never use a YOLO, I treat myself to a YOLO every once in a while, usually on something I am fairly sure will profit, but I treat it the same way I would enjoy an icecream cone as a reward after a 3mile run.)\n\nc. BuY HiGh SeLl LoW - THIS is probably the most common issue I've seen. Remember: chances are when you first see a stock shoot up to da moon, there are people that got on and were waiting at the launch pad for months and are ready to jump off the ride. (I will share how/where I get my picks below)\n\nd. Not Respecting Stop Losses - We've all been there where we see -20% and think \"it'll get back up there...\" and then -25%, -32%... Set thresholds where comfortable with cutting losses + \\*\\*respect\\*\\* \\*\\*them\\*\\* and stay disciplined. (I can hear it already: \"diamond hands\" - but here's the misconception, it's only diamond hands when you're actually holding a diamond... When you're up +50, +70, +80 or +100%, it takes alpha strength to hold onto a Rocket ship with the heavy balls of steel you're towing behind.\n\nThese 4 Vices are things I try to stay cognizant of, and avoid. Now that you're in a better position to not lose money, you can move forward and build on it.\n\n&amp;#x200B;\n\nRule 2: \\*Take Profits, and Remember to PAY YOURSELF\\*\n\nAnother concept that sounds simple enough, yet it took a while to implement it. Just like setting stop losses and following them, I set thresholds where I'm comfortable exiting a position, locking in those gains, and \\*\\*realizing those profits\\*\\* to pay myself.\n\nRelated: \\*Do not get greedy\\* it will cut into your gains and sometimes wipe them out. I have a formula I use to take profits, where I perform a cost/benefit balancing test to scale out. \n\nE.g. If a Call that I'm in is up +30%, I will say \"okay I'm good setting a sell limit order to lock in only 20% gain, in exchange for me giving the Call a little \"wiggle room\" to \\*fluctuate\\* between 21-30% and have the potential to go up higher than 30%\". In this same example, if it goes up further to +50%, then I will recalibrate and adjust the order to set a trigger to sell at +40%, giving it room to fluctuate between 41%-50% and potentially move higher than 50%, and repeat.\n\n\\*Now that you're not losing money, and you're actually taking profits and getting paid, re-assess what your goals are. Everyones different. When I first got up to $30k+ I decided that I would buy stocks that I liked, and sell Calls on them (OTM) and collect modest premiums and then have those calls expire worthless, still keeping my shares.\\*\n\nFirst tip, switch to Heiken Ashi candles. I use Trading View, using HA candlesticks. They are much more abstract but are key in showing you trends, both ascending and descending. There's a video on YT that helps explain it really well, I'll put the vid names down below.\n\n&amp;#x200B;\n\nAs this has gotten very long, I'll stop here, maybe continue another time but brass tacks:\n\n1. Stay away from money traps that include trying to guess the bottom; yolo'ing all day everyday (if you only live once, it makes sense that you can't repeat forever if you mess up); be weary of all time high points in stocks (maybe wait for weakness and buy puts, but \\*always\\* flow with the trend, my friend; and more importantly, \\*respect stop limits both stop losses, and taking profits\\*\n2. Don't get greedy, remember when your eyes are lighting up and drool is salivating from the corner of your lips, so are the other 20,000 people invested, and some of the people bagholding for months are ready to end the pain and sell. Remember to take your profits, and PAY YOURSELF! You deserve it. The work is done, now enjoy the fruits of your labor.\n\nThe first step of my credo is to mitigate and manage  risk to prevent loss, then use stable footing to build on it and move forward. Be patient. Slowly but surely \\*you\\* \\*\\*will\\*\\* \\*make it\\*. Also remember that there are things out of your control - you can time a move just right, predict the flow perfectly, and then all it takes is the whole market to take a dump because some controversy or a dumb politician/official said something stupid. Stay patient. \n\nOhh, and \\*\\*RUN YOUR\\*\\* \\*OWN\\* \\*\\*RACE\\*\\* - do not pace yourself or compare yourself to what someone else is doing, you're on your own mission with your own specific goals, stay true to that and be kind to yourself, you will get there.\n\nYT channels, video names:\n\nI watch several different guys on YT, (I canvassed through a lot of honeytraps that are either worthless or just useless view-collectors), but these 3 are my go-to's in no particular order, I like them all. I see a little bit of myself in all of them, they're all very chill, humble guys, can read charts like a MF and have good watchlist picks consistently. I don't just jump into something I see/read about. I'll add it to my watchlist, run my Due Diligence and then wait for a breakout, analyze the Heiken Ashi sticks, look for my shadows to disappear to confirm, and finally enter on the upswing:\n\n\\*ZipTrader (Channel) Charlie is a pretty entertaining guy who discusses everything from specific particular stocks up to entire general market trends and movements.\n\n\\*Paul NGumah (Channel) for Patternology Labs: Paul is like some savant, this guy identifies and analyzes patterns arguably better than anyone I've ever seen. I mean it, this guy has literally called stocks \\*down to the penny\\* a few times actually. Now he's not a fortune teller, and of course everything is subject to market movements and other catalysts, but he is consistently on the money. He usually does 2 videos a day, one post market close, and one pre-market with the futures.\n\n\\*TradeLikeGates (Channel): This guy is very similar to Paul, reads and analyses patterns and movements incredibly well. In contrast to Paul (who usually does analysis of 3-5 stocks per video), TLG often streams hour long segments going over loads of different stocks. (also in contrast to Paul, TLG usually does videos once a week or so).\n\n\\*Heikein Ashi candlestick refresher: Data Trader (Channel) - BEST Heiken Ashi Strategy (video)\n\n\\*\\*For ALL of the dozens of people who DM'd about learning more about Options, that could be a ten page discussion on its own, and there are better people than me to explain. I highly recommend Adam from the YT channel \"In the Money\" for his Options tutorials\n\nnotes: there were a few irrelevant comments that I can address here -\n\na. \"Meh Robinhood\"... I get it, trust me I get it. I have a severe disdain for Robinhood. But I hold zero (0) stock in RH, I have 2 other brokerages where I hold stock, but I only use RH for really quick Option scalps. My other brokerage I use to buy &amp;hold stock for long term investing (Also turned off share lending) and use the other one to Sell OTM Calls on the shares that I do hold to generate regular weekly income (way more than my old paychecks).\n\nb. there were some other comments that when I read, I nearly had a stroke and felt like if I kept reading, I would catch the brain worms. Like one guy \"told\" me that I was \"using margin, and that I don't own the stocks\"... First of all, I don't have any margin accounts, period. Second of all, I am primarily an Options/Derivatives trader, and I don't have any shares in RH.",
        "subreddit": "wallstreetbets",
        "title": "🌟Proverbs From a Green Ape 🌟",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/muxx11/proverbs_from_a_green_ape/",
        "created": 1618974699.0
    },
    {
        "author": "Safe-Astronomer3020",
        "created_utc": 1618774334,
        "id": "mtjo2u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Tl/dr: Squeeze is coming, Dominos are falling, be patient and trust in your fellow apes to HODL the line 🦧 🤚💎🚀\n\nIt seems the last few days have been quiet on the news front with no new regulations coming out/passing from the DTCC/SEC/OCC and no news catalyst for AMC after a slew of new regulations dropped and the amazing Trey’s Trades interview with the Silverback himself, Adam Aron the prior week or so🍿🙌🏻 Luckily it looks as though reinforcements are coming in the form of large investors and more good news on the regulations front 💎🤚\n\nWith the above said, the reason they seem to be making more of an asserted effort to cover looks to be an article from October of 2020 with a 6 month deadline, Aka April 22 (Thursday). Article is below:\n\n[SEC October 2020](https://www.sec.gov/news/public-statement/staff-fully-paid-lending)\n\nLink to letter from October further breaking down the need to more collateral from these large funds on their highly leveraged trades. The letter was written by Elizabeth Baird, Deputy Director, Division of Trading &amp; Markets, U.S. Securities &amp; Exchange Commission to MS Kris Dailey, VP Office of financial and operational risk policy.\n\n[October Letter](https://www.sec.gov/divisions/marketreg/mr-noaction/2020/finra-fpl-20201022-15c3-3.pdf)\n\nTo see the finance industry starting to scramble all in unison is something to be cognizant of...  Bank of America (ticker: BAC) sold $15 billion of bonds across six tranches, the biggest sale ever for a bank, according to Bloomberg. On Thursday, JPMorgan Chase &amp; Co . (JPM) sold $13 billion of bonds across five tranches, which was the largest on record until Bank of America’s Friday offering. Goldman Sachs (GS) sold $6 billion of bonds in two tranches. Goldman’s bonds were fixed rate, and the others had a mix of fixed- and floating-rate (and fixed-to-floating) debt.  *Article below* not to mention RBC had a massive 66% drop after hours Friday (link to @JoshuaJammes post below)... and guess who one of their biggest investors is?? You guessed it, the one and only... CITADEL 💩 Oh, heard they were hard at work in the wee hours of the night last night as well, of course trying to make the world a better and safer place I would assume 😂😂😂😏🤦🏻‍♂️\n\n[Massive Bond Sales: JP Morgan &amp; B of A](https://www.barrons.com/articles/goldman-sachs-bank-america-jpmorgan-bonds-dividends-51618602441)\n\n[Via @JoshuaJammes](https://twitter.com/joshuajammes/status/1383515800678457360?s=21) \n\nThe SEC is making moves as well, Gary Gensler was finally sworn in as a member of the SEC. Gensler is very pro the retail investor so I would not be surprised if he aides in regulations to potentially start a squeeze or make it more possible. He wants the market back on track, the manipulation isn’t helping anyone...\n\n[Gensler Sworn- In](https://thehill.com/policy/finance/548827-new-sec-chair-gary-gensler-sworn-into-office)\n\nThere is also more Bullish buying news out of larger funds, Vanguard has once again stepped in and upped their position in AMC by a whopping 18.9 million more shares making Blackrock and Vanguard the 2 largest funds invested in AMC 😳🍿🙌🏻 \n\n[Via @wormfallJim on Twitter](https://twitter.com/wormfalljim/status/1383533194155216903?s=21)\n\nMatt Kohrs also has been doing a killer job keeping everyone updated on the Ortex numbers, appreciate you not having us all spend $500 a year. He updates daily on Twitter and all day on his live stream. Last time AMC utilization hit 100% we jumped to $20+ the next day... that was when we were at $4.50-$5 and shares shorted were less than half of current numbers..... not saying To the moon BUT I like this stonk 😏\n\n[Via @Matt_khors Twitter](https://twitter.com/matt_kohrs/status/1383028490505760769?s=21)\n\nThe Fintel short interest borrow rate has also been steadily increasing the past week, while shares available have stayed relatively low 2,000,000 or less, the rate has gone from single digits to over 18% at the close of business Friday. I would not be surprised to see utilization eclipse 100% by Tuesday abd borrow rate to surpass 20% 😳🤑\n\n[Fintel Numbers for AMC](https://fintel.io/ss/us/amc)   \n\nRegarding the short interest, Ihor from S3 partners does a nice job providing updates. Current numbers are:\n\n#AMC short interest is $893M\n90.22M shares shorted\n21.60% SI% of Float\n17.77% S3 SI% Float\n4.31% fee.\nShares shorted up +15.6 million shares, worth $155 million, +21.0%, last week.\nShorts down -$397 million in 2021 mark-to-market losses; up +$61 million on today's -6.77% move\n\n[Ihor from S3 AMC Update ](https://twitter.com/ihors3/status/1383135182237093889?s=21)\n\nHow does a small brained ape like me feel about all of this? More confident than I did last week. The squeeze is coming, the dominos are falling into place. We just need to continue to HODL and we will all be watching movies on the moon 🌙 Stay the course, hopefully this has brought you some more confidence for the upcoming week as something is definitely churning up 😳💎🤚🚀\n\nSincerely, \nThe dude HODL’ing 8700 shares that my wife’s boyfriend has no idea about... neither does she 😏🦧💎🤚🚀\n\n\nPS: First post, not sure if I went full retard enough or not with the DD for my fellow apes 🦍  Was hesitant to post, but have been a HODLer since January, never sold, and been doing my own DD along the way... #sharingiscaring #tothemoon #thisistheway #AMC",
        "subreddit": "wallstreetbets",
        "title": "Sell off + Bond Sales = Start of MOASS?!?!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mtjo2u/sell_off_bond_sales_start_of_moass/",
        "created": 1618803134.0
    }
]