[
    {
        "author": "darkfiber-",
        "created_utc": 1619631553,
        "id": "n0kaye",
        "num_comments": 331,
        "num_crossposts": 0,
        "selftext": " See my previous AMD DDs: [https://www.reddit.com/r/wallstreetbets/comments/mkljmv/amd\\_increasing\\_production\\_by\\_20\\_in\\_q2\\_buy\\_before/](https://www.reddit.com/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/)[https://www.reddit.com/r/wallstreetbets/comments/mdwvby/the\\_amd\\_boom\\_is\\_still\\_coming\\_heres\\_why/](https://www.reddit.com/r/wallstreetbets/comments/mdwvby/the_amd_boom_is_still_coming_heres_why/)\n\nEverything there came true, except the stock is down today. Why? Well take a look at the short interest. AMD is the most heavily shorted stock in the semi industry. The latest there shows 82.7M shares sold short on 4/15 with price at $85.21. That means they need to keep the stock under $85 to make their precious profit. They also want to keep the stock down in order to get a good buy-in for the Xilinx deal. Which means it seems they're trying to keep the stock down for the entire year until the Xilinx deal closes, that's a long time to keep up negative pressure. Meanwhile, AMD is going to continue to get upgrades and price target increases. Analysts are already saying to buy, and buy aggressively at this price.\n\nI know everyone hates Jim Cramer but this is what he said in regards to AMD on the AAP call this morning:  \n\"This is just a buy. I mean, you gotta buy it very aggressively here. Because if it weren't for the Xilinx arbitrage, it would probably be up. But remember, it has to be shorted if you want to buy Xilinx and that's what's killing them. Because people just keep shorting it all day. There's 51M shares traded, which is rather remarkable.\"\n\nOne could speculate that Intel is coming in to steal AMD's thunder but in yesterday's earnings call, AMD put that to rest. Intel's datacenter sales were down 20% QoQ which Intel last week said was NOT due to competition but due to customers \"digesting\" existing purchases and that this is a slow time of year for data center sales. AMD's Dr. Lisa Su shows 100% growth in datacenter sales QoQ saying customer demand is strong and accelerating, basically calling Intel liars and that AMD is taking all that market share with no slow down in sight.\n\nOne could speculate that Nvidia is going to challenge AMD in the datacenter but Su Bae dismissed it in the earnings call saying customers are not asking for ARM chips, and AMD would build them if they were. Basically saying that building an ARM processor for the datacenter would be like building a solution to a problem no one has, and no one is asking for, there's no money in it.\n\nOne could speculate that the \"chip shortage\" will negatively impact AMD. But the good doctor put that to rest yesterday as well confirming rumors that AMD is increasing production by 20% in Q2 which reflected in them raising guidance for 50% growth in 2021! By contrast, Intel is expecting 0% growth this year.\n\nAll of this positive growth and lack of industry competition means AMD is going to continue killing in quarter after quarter which will push analysts to keep upgrading the stock and price targets which will make it harder and harder for hedge funds to keep up the negative pressure throughout the year.\n\nWith AMD, there's no need for individual investors to try to turn it around on the short sells, it's going to happen naturally due to continued analyst upgrades, we don't have to do anything. I recommend getting on board now and being patient, because when it pops and the short sellers give up/move on, when the negative pressure cannot contain the buying from institutions and individual investors on analyst upgrades, it's going to explode.\n\nAMD Positions: 550 shares, various call options with expirations from June 2021 to June 2022.",
        "subreddit": "wallstreetbets",
        "title": "AMD: This is why it's down after earnings but will eventually rocket",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0kaye/amd_this_is_why_its_down_after_earnings_but_will/",
        "created": 1619660353.0
    },
    {
        "author": "AstronautCurrent408",
        "created_utc": 1619180974,
        "id": "mwu5jy",
        "num_comments": 329,
        "num_crossposts": 0,
        "selftext": " \n\nOk Monkeys here is a short dd ( will make a more more detailed one if there is interest, let me know below)\n\nAMD   sells chips to a variety of sectors but you can mainly categorize it   into to two sectors: Computing&amp;Graphics and Enterprise ( Embedded   and Semi-Custom). Basically if there is a need for calculations they   make the chips.  As you might have noticed there has been a supply   shortage lately causing semi conductors prices to sky rocket- if you  have been trying to buy on lately you will know. So AMD is a part of a  mega trend and there is a clip of the psycho CEO mama who has been on Sir   hithouse aka Cramer telling him it is good for business ( cant post the video but you can google \"AMD CEO gives update on Xilinx acquisition and talks chip shortage impact\")  \n\n\nThe   CEO mama Su is nothing short of a genius. PhD in electro engineering   from MIT she has been running the show since 2014 where AMD was a mess. I   shall not go into the accounting details but basically she knows her   stuff and this the development of the stock price reflects just that\n\nFrom 4 dlls a share to now be around 80\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l7vgzaaq2xu61.png?width=1421&amp;format=png&amp;auto=webp&amp;s=b7c706926ec908bba980ad9b7cad7f9c93cb77e3\n\nIntel   came out yesterday with a great earnings report but more or less   explicitly saying they are losing market share despite the market is hit   by a supply shock. AMD will report on Tuesday and if you fancy a bet   you can buy calls for that or you can just like the stock, or if you   feel adventurous buy LEAPS.\n\nWhatever   the case AMD looks to be a long term winner with the best products,   best management in a sector that will thrive going forward. I dont   really consider it a long term risk and i hold it and have done so for   quite sometime",
        "subreddit": "wallstreetbets",
        "title": "$AMD earnings coming for at long term winner",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mwu5jy/amd_earnings_coming_for_at_long_term_winner/",
        "created": 1619209774.0
    },
    {
        "author": "gorays21",
        "created_utc": 1619479372,
        "id": "mzayi3",
        "num_comments": 95,
        "num_crossposts": 0,
        "selftext": "AMD, one of reddit's favorite stocks for the past 4 years has its earnings tomorrow! This company is currently wiping Intel off the menu and has arguably Reddit's fav CEO in Lisa Su. Their earrings are expected to do well so what do you guys think will happen this this week for AMD? Will it finally go past $100? Only time will tell. \n\nAMD actually looks pretty cheap as the Xilinx acquisition still doesn't appear to be fully reflected in the current share price.",
        "subreddit": "stocks",
        "title": "AMD - One of Reddit's fav stock has its earnings tomorrow!",
        "url": "https://www.reddit.com/r/stocks/comments/mzayi3/amd_one_of_reddits_fav_stock_has_its_earnings/",
        "created": 1619508172.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617826093,
        "id": "mmar4u",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 7, 2021**\n\nStocks traded largely flat on Wednesday, with the S&amp;P 500 (SPY) and Dow Jones (DIA) hovering near record highs, as market participants continue to consider the latest batch of strong economic data and commentary by FOMC members.\n\nThis week, market participants have digested a host of better-than-expected economic data, with the March job report blowing past consensus estimates, an index tracking activity in the service sector reached a record level, and The Institute for Supply Management (ISM) said on Thursday its index of national factory activity jumped to a reading of 64.7 last month from 60.8 in February, the highest level since December 1983. The International Monetary Fund upgraded its global growth forecast to 6% this year from the 5.5% rise seen previously, largely reflecting the expectation of quick recovery in the U.S. economy. Moreover, JP Morgan (JPM) CEO Jamie Dimon said the current US economic boom “could easily run into 2023” amid the massive fiscal and monetary policy support provided to people and businesses. \n\nThis week, the Federal Open Market Committee have shed light on how monetary policymakers are thinking about the current economic climate. Most important, market participants want to know what conditions would warrant an adjustment of the Fed’s current policy stance and their thoughts on potential inflation. FOMC members noted that the economy was “far from achieving the \\[FOMC’s\\] broad-based an inclusive goal of maximum employment” suggesting policymakers are willing to maintain their current accommodative stance for the foreseeable future, barring a sharp and unforeseen upturn in inflation or economic recovery.\n\nLooking ahead, we are eagerly awaiting first-quarter earnings season in the coming weeks, with the hope that the reports show corporate profits are growing strongly in tandem with strengthening economic conditions. Deutsche Bank Strategist Binky Chadha wrote in a note “Very near term, we expect equities to continue to be well supported by the acceleration in macro growth, and see buying by systematic strategies and buybacks driving a grind higher. But we expect a significant period of consolidation as growth peaks over the next three months.” \n\n**Highlights**\n\n* Shares of embattled EV-company Nikola (NKLA) sank further after the company said its head of fuel-cell development departed from the company. \n* An index tracking U.S. mortgage applications slid for a fifth straight week last week as mortgage rates climbed higher. Mortgage applications fell by 5.1% week-on-week, the Mortgage Bankers Association said Wednesday.\n* Both Instacart and DoorDash (DASH) plan to launch their own credit cards\n* JPMorgan may eventually move all its European operations from London following Brexit, according to multiple reports.\n* Advanced Micro Devices (AMD) and Xilinx (XLNX) shareholders voted to approve AMD’s acquisition of Xilinx, the companies said Wednesday. The deal needs to pass regulatory approvals and is expected to close by the end of 2021. \n* Nio said Wednesday its 100,000th mass-produced vehicle rolled out of the production line. It has taken Nio a little less than three years fro mthe rollout of their first vehicle to reach this milestone\n* BYD (BYDDY), a Chinese EV company that is backed by Berkshire Hathaway (BRK.B) sold 38,599 vehicles, a 113% year-on-year.\n* \\*\\***Please note that current stock price was written premarket and does not reflect intraday movement\\*\\***\n* Applied Materials (AMAT) with too many target raises to list. Consensus price target $150 at Buy. Stock currently around $140\n* Citigroup (C) target raised by Barclays from $77 to $84 at Equal-Weight. Stock currently around $73\n* Capital One Financial (COF) target raised by Barclays from $145 to $162 at Overweight. Stock currently around $132\n* Discovery (DISCA) target raised by Deutshce Bank from $35 to $60 at Buy. Stock currently around $43\n* Goldman Sachs (GS) target raised by Barclays from $392 to $420 at Overweight. Stock currently around $327\n* JP Morgan (JPM) target raised by Barclays from $172 to $187 at Overweight. Stock currently around $153\n* Paychex (PAYX) target raised by Argus from $103 to $105 at Buy. Stock currently around $95\n* SMART Global (SGH) with three target raises. Stock currently around $49\n   * Needham &amp; Co from $56 to $65 Buy\n   * Stifel Nicolaus from $55 to $62.50 Buy\n   * Deutsche Bank from $48 to $60 at Buy. \n* Tapestry (TPR) target raised by Piper Sandler from $45 to $54 at Overweight. Stock currently around $43\n* Voya Financial (VOYA) target raised by Royal Bank of Canada from $66 to $74 at Outperform. Stock currently around $66\n* Whirlpool (WHR) target raised by JP Morgan (JPM) from $258 to $261 at Overweight. Stock currently around $234\n\n“Success is not final, failure is not fatal: It is the courage to continue that counts.” - Winston Churchill",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, April 7, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mmar4u/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1617854893.0
    },
    {
        "author": "freetimeisthebest",
        "created_utc": 1617664751,
        "id": "mkxprj",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "XLNX is merging with AMD. When the merger is complete, every XLNX share will be turned into 1.7234 AMD shares.\n\nThe window for regulators to object the merger has passed. The last major hurdle for the merger is the shareholder meeting on April 7th.\n\nCurrently XLNX is trading at $130 while AMD is trading at $81. With the merger XLNX is 1.7234 * 81 = $139.6 versus $130 (current stock price). There's an arbitrage opportunity, and on April 7th the biggest threat to that arbitrage is very very likely going to be removed.\n\nSo what do you, an ape, do with this information? Well you buy XLNX calls expiring April 9th of course. It's mostly algos trading options at the moment, but it looks like right now you can buy calls at $132 strike price for $2 a pop, and $126 calls for $5 a pop, which are completely reasonably prices compared to their equivalent AMD options. But unlike AMD calls, you wouldn't need AMD to go up for this YOLO to pay out. If the valuation gap closes after the yes vote on April 7th, and AMD stays the same price, you make 350% and 160% returns respectively. And obviously , if AMD goes up a few percent over this week, you make even more.\n\nFull disclosure: I'm not a financial advisor. I lost 17k in a GME option play right when Vlad decided to stop trading on RH.\n\n...but I still went all in on this play. 137c on 4/9",
        "subreddit": "wallstreetbets",
        "title": "XLNX Arbitrage Merger with AMD on April 7th",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/",
        "created": 1617693551.0
    },
    {
        "author": "pman6",
        "created_utc": 1617697048,
        "id": "ml6tye",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "    ABMD\tABIOMED, INC.\n    AKAM\tAKAMAI TECHNOLOGIES, INC.\n    ALB\tALBEMARLE CORPORATION\n    AMD\tADVANCED MICRO DEVICES, INC.\n    APA\tAPA CORP (US)\n    BF/B\tBROWN-FORMAN CORPORATION\n    BIIB\tBIOGEN INC\n    BIO\tBIO RAD LABORATORIES INCORPORATED\n    BKR\tBAKER HUGHES CO\n    BLL\tBALL CORPORATION\n    CLX\tCLOROX CO\n    COG\tCABOT OIL &amp; GAS CORPORATION\n    CRM\tSALESFORCE.COM, INC.\n    CTLT\tCATALENT INC\n    CTXS\tCITRIX SYSTEMS, INC.\n    DISCA\tDISCOVERY INC\n    DISCK\tDISCOVERY INC\n    DXCM\tDEXCOM, INC.\n    ED\tCONSOLIDATED EDISON, INC.\n    EQIX\tEQUINIX, INC.\n    ETSY\tETSY INC\n    FE\tFIRSTENERGY CORPORATION\n    FOX\tFOX CORP\n    FOXA\tFOX CORP\n    FTI\tTechnipFMC\n    GILD\tGILEAD SCIENCES, INC.\n    ILMN\tILLUMINA, INC.\n    INCY\tINCYTE CORP.\n    IPGP\tIPG PHOTONICS CORP\n    JKHY\tJACK HENRY &amp; ASSOCIATES, INC.\n    LLY\tELI LILLY AND COMPANY\n    LUMN\tLUMEN TECHNOLOGIES INC\n    MKC\tMCCORMICK &amp; COMPANY, INCORPORATED\n    MRO\tMARATHON OIL CORPORATION\n    NOV\tNOV INC\n    OXY\tOCCIDENTAL PETROLEUM CORPORATION\n    PAYC\tPAYCOM SOFTWARE INC\n    PFE\tPFIZER INC.\n    PKI\tPERKINELMER INCORPORATED\n    PRGO\tPERRIGO COMPANY PLC\n    PYPL\tPAYPAL HOLDINGS INC\n    QCOM\tQUALCOMM INCORPORATED\n    REGN\tREGENERON PHARMACEUTICALS INCORPORATED\n    ROL\tROLLINS, INC.\n    SIVB\tSVB FINANCIAL GROUP\n    TSLA\tTESLA INC\n    TWTR\tTWITTER INC\n    VIAC\tVIACOMCBS INC\n    VRTX\tVERTEX PHARMACEUTICALS INC\n    VTRS\tVIATRIS INC\n    XLNX\tXILINX, INC.",
        "subreddit": "stocks",
        "title": "50 tickers in the S&amp;P 500 are at least 15% below their 52w highs. If you put equal capital in all of them, you'd probably be green",
        "url": "https://www.reddit.com/r/stocks/comments/ml6tye/50_tickers_in_the_sp_500_are_at_least_15_below/",
        "created": 1617725848.0
    },
    {
        "author": "AntikytheraMachines",
        "created_utc": 1618766095,
        "id": "mtgze9",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I'm interested in AMD long term. Can I buy Xilinx shares now and at some point in the future they will all become AMD shares? This is what the following article seems to say. https://www.nytimes.com/2020/10/27/technology/amd-xilinx-35-billion-stock-deal.html\n\nIs the exchange between the two fixed at 1.7234 AMD shares for each Xilinx share or will this be only set on the transfer day?\n\nDoes the transfer event have capital gains tax implications?\n\nI currently hold AMD.",
        "subreddit": "stocks",
        "title": "Can someone ELI5 the AMD purchase of Xilinx?",
        "url": "https://www.reddit.com/r/stocks/comments/mtgze9/can_someone_eli5_the_amd_purchase_of_xilinx/",
        "created": 1618794895.0
    },
    {
        "author": "GearheadGaming",
        "created_utc": 1617468869,
        "id": "mjccll",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "XLNX is merging with/being acquired by AMD.  When the merger is complete, [**every XLNX share will be turned into 1.7234 AMD shares**.](https://www.sec.gov/Archives/edgar/data/2488/000119312520309831/d83168ds4.htm)\n\nThe window for regulators to object to the merger has passed.  The last major hurdle for the merger is the shareholder meeting on **April 7th**.\n\nCurrently XLNX is trading at 129 while AMD is trading at 81.  But **1.7234 * 81 = 139.6, not 129**.  There's an arbitrage opportunity, and on April 7th the biggest threat to that arbitrage is very very likely going to be removed.\n\nSo what do you, a degenerate gambler, do with this information?  Well you buy XLNX calls expiring April 9th, of course.  It's mostly algos trading the options at the moment, but it looks like right now you can buy calls at a **$132 strike price for $2 a pop, and $126 calls for $5 a pop**, which are completely reasonably prices compared to their equivalent AMD options.  But unlike the AMD calls, you wouldn't need AMD to go up for this YOLO to pay out-- if the valuation gap closes after the yes vote on April 7th, and AMD stays the same price, you make 350% and 160% returns respectively.  And obviously, if AMD goes up a few percent over the next week, you make even more.\n\nFull disclosure: I'm not making this play because I'm bearish on AMD and don't do weeklies anyway.",
        "subreddit": "wallstreetbets",
        "title": "A YOLO suggestion for the degenerates out there: XLNX 4/9 calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mjccll/a_yolo_suggestion_for_the_degenerates_out_there/",
        "created": 1617497669.0
    },
    {
        "author": "pilotplater",
        "created_utc": 1617815440,
        "id": "mm6vha",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD and Xilinx Stockholders Overwhelmingly Approve AMD's Acquisition of Xilinx",
        "url": "https://leaderpost.com/globe-newswire/amd-and-xilinx-stockholders-overwhelmingly-approve-amds-acquisition-of-xilinx",
        "created": 1617844240.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617826131,
        "id": "mmaro3",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 7, 2021**\n\nStocks traded largely flat on Wednesday, with the S&amp;P 500 (SPY) and Dow Jones (DIA) hovering near record highs, as market participants continue to consider the latest batch of strong economic data and commentary by FOMC members.\n\nThis week, market participants have digested a host of better-than-expected economic data, with the March job report blowing past consensus estimates, an index tracking activity in the service sector reached a record level, and The Institute for Supply Management (ISM) said on Thursday its index of national factory activity jumped to a reading of 64.7 last month from 60.8 in February, the highest level since December 1983. The International Monetary Fund upgraded its global growth forecast to 6% this year from the 5.5% rise seen previously, largely reflecting the expectation of quick recovery in the U.S. economy. Moreover, JP Morgan (JPM) CEO Jamie Dimon said the current US economic boom “could easily run into 2023” amid the massive fiscal and monetary policy support provided to people and businesses. \n\nThis week, the Federal Open Market Committee have shed light on how monetary policymakers are thinking about the current economic climate. Most important, market participants want to know what conditions would warrant an adjustment of the Fed’s current policy stance and their thoughts on potential inflation. FOMC members noted that the economy was “far from achieving the \\[FOMC’s\\] broad-based an inclusive goal of maximum employment” suggesting policymakers are willing to maintain their current accommodative stance for the foreseeable future, barring a sharp and unforeseen upturn in inflation or economic recovery.\n\nLooking ahead, we are eagerly awaiting first-quarter earnings season in the coming weeks, with the hope that the reports show corporate profits are growing strongly in tandem with strengthening economic conditions. Deutsche Bank Strategist Binky Chadha wrote in a note “Very near term, we expect equities to continue to be well supported by the acceleration in macro growth, and see buying by systematic strategies and buybacks driving a grind higher. But we expect a significant period of consolidation as growth peaks over the next three months.” \n\n**Highlights**\n\n* Shares of embattled EV-company Nikola (NKLA) sank further after the company said its head of fuel-cell development departed from the company. \n* An index tracking U.S. mortgage applications slid for a fifth straight week last week as mortgage rates climbed higher. Mortgage applications fell by 5.1% week-on-week, the Mortgage Bankers Association said Wednesday.\n* Both Instacart and DoorDash (DASH) plan to launch their own credit cards\n* JPMorgan may eventually move all its European operations from London following Brexit, according to multiple reports.\n* Advanced Micro Devices (AMD) and Xilinx (XLNX) shareholders voted to approve AMD’s acquisition of Xilinx, the companies said Wednesday. The deal needs to pass regulatory approvals and is expected to close by the end of 2021. \n* Nio said Wednesday its 100,000th mass-produced vehicle rolled out of the production line. It has taken Nio a little less than three years fro mthe rollout of their first vehicle to reach this milestone\n* BYD (BYDDY), a Chinese EV company that is backed by Berkshire Hathaway (BRK.B) sold 38,599 vehicles, a 113% year-on-year.\n* \\*\\***Please note that current stock price was written premarket and does not reflect intraday movement\\*\\***\n* Applied Materials (AMAT) with too many target raises to list. Consensus price target $150 at Buy. Stock currently around $140\n* Citigroup (C) target raised by Barclays from $77 to $84 at Equal-Weight. Stock currently around $73\n* Capital One Financial (COF) target raised by Barclays from $145 to $162 at Overweight. Stock currently around $132\n* Discovery (DISCA) target raised by Deutshce Bank from $35 to $60 at Buy. Stock currently around $43\n* Goldman Sachs (GS) target raised by Barclays from $392 to $420 at Overweight. Stock currently around $327\n* JP Morgan (JPM) target raised by Barclays from $172 to $187 at Overweight. Stock currently around $153\n* Paychex (PAYX) target raised by Argus from $103 to $105 at Buy. Stock currently around $95\n* SMART Global (SGH) with three target raises. Stock currently around $49\n   * Needham &amp; Co from $56 to $65 Buy\n   * Stifel Nicolaus from $55 to $62.50 Buy\n   * Deutsche Bank from $48 to $60 at Buy. \n* Tapestry (TPR) target raised by Piper Sandler from $45 to $54 at Overweight. Stock currently around $43\n* Voya Financial (VOYA) target raised by Royal Bank of Canada from $66 to $74 at Outperform. Stock currently around $66\n* Whirlpool (WHR) target raised by JP Morgan (JPM) from $258 to $261 at Overweight. Stock currently around $234\n\n“Success is not final, failure is not fatal: It is the courage to continue that counts.” - Winston Churchill",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, April 7, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mmaro3/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1617854931.0
    },
    {
        "author": "pilotplater",
        "created_utc": 1617814351,
        "id": "mm6grw",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "So the merger proposal for AMD/Xilinx passed just now, still pending regulatory approval but the shareholders voted for the merger. I'm thinking a moon shot is imminent.",
        "subreddit": "wallstreetbets",
        "title": "AMD special meeting - proposal passes",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mm6grw/amd_special_meeting_proposal_passes/",
        "created": 1617843151.0
    },
    {
        "author": "floodmayhem",
        "created_utc": 1617836552,
        "id": "mmeaww",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD, Xilinx, shareholders approve acquisition",
        "url": "https://www.marketwatch.com/story/amd-xilinx-shareholders-approve-acquisition-11617816203",
        "created": 1617865352.0
    },
    {
        "author": "darkfiber-",
        "created_utc": 1619629900,
        "id": "n0jp09",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "See my previous AMD DDs:  \n[https://www.reddit.com/r/wallstreetbets/comments/mkljmv/amd\\_increasing\\_production\\_by\\_20\\_in\\_q2\\_buy\\_before/](https://www.reddit.com/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/)  \n[https://www.reddit.com/r/wallstreetbets/comments/mdwvby/the\\_amd\\_boom\\_is\\_still\\_coming\\_heres\\_why/](https://www.reddit.com/r/wallstreetbets/comments/mdwvby/the_amd_boom_is_still_coming_heres_why/)  \nAnd Meme:  \n[https://www.reddit.com/r/wallstreetbets/comments/mzy4qn/never\\_bet\\_against\\_the\\_doctor/](https://www.reddit.com/r/wallstreetbets/comments/mzy4qn/never_bet_against_the_doctor/)  \n\n\nEverything I said came true, except the stock is down today. Why? Well take a look at the short interest:  \n[https://www.marketbeat.com/stocks/NASDAQ/AMD/short-interest/](https://www.marketbeat.com/stocks/NASDAQ/AMD/short-interest/)  \nAMD is the most heavily shorted stock in the semi industry. The latest there shows 82.7M shares sold short on 4/15 with price at $85.21. That means hedge funds need to keep the stock under $85 to make their precious profit or else they'll have to cover. They also want to keep the stock down in order to get a good buy-in for the Xilinx deal. Which means it seems they're trying to keep the stock down for the entire year until the Xilinx deal closes, that's a long time to keep up negative pressure. Meanwhile, AMD is going to continue to get upgrades and price target increases. Analysts are already saying to buy, and buy aggressively at this price.\n\nOne could speculate that Intel is coming in to steal AMD's thunder but in yesterday's earnings call, AMD put that to rest. Intel's datacenter sales were down 20% QoQ which Intel last week said was NOT due to competition but due to customers \"digesting\" existing purchases and that this is a slow time of year for data center sales. AMD's Dr. Lisa Su shows 100% growth in datacenter sales QoQ saying customer demand is strong and accelerating, basically calling Intel liars and that AMD is taking all that market share with no slow down in sight.\n\nOne could speculate that Nvidia is going to challenge AMD in the datacenter but Su Bae dismissed it in the earnings call saying customers are not asking for ARM chips, and AMD would build them if they were. Basically saying that building an ARM processor for the datacenter would be like building a solution to a problem no one has, and no one is asking for, there's no money in it. \n\nOne could speculate that the \"chip shortage\" will negatively impact AMD. But the good doctor put that to rest yesterday as well confirming rumors that AMD is increasing production by 20% in Q2 which reflected in them raising guidance for 50% growth in 2021! By contrast, Intel is expecting 0% growth this year.\n\nAll of this positive growth and lack of industry competition means AMD is going to continue killing in quarter after quarter which will push analysts to keep upgrading the stock and price targets which will make it harder and harder for hedge funds to keep up the negative pressure throughout the year. \n\nWith GME, it was over shorted and WSB turned it around all on their own. With AMD, there's no need for WSB or individual investors to try to turn it around on the short selling hedge funds, it's going to happen naturally due to continued analyst upgrades, we don't have to do anything. I recommend getting on board now and being patient, diamond hands, because when it pops and the short sellers give up/move on, when the negative pressure cannot contain the buying from institutions and individual investors on analyst upgrades, it's going to explode.\n\nAMD Positions: 550 shares, various call options with expirations from June 2021 to June 2022. My price target is $120. Though a short squeeze would send it to $200.",
        "subreddit": "wallstreetbets",
        "title": "Why is AMD down today? 82.7M Short Shares at $85, Hedge Funds need it to be under that!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0jp09/why_is_amd_down_today_827m_short_shares_at_85/",
        "created": 1619658700.0
    },
    {
        "author": "darkfiber-",
        "created_utc": 1619630894,
        "id": "n0k22g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "See my previous AMD DDs: [https://www.reddit.com/r/wallstreetbets/comments/mkljmv/amd\\_increasing\\_production\\_by\\_20\\_in\\_q2\\_buy\\_before/](https://www.reddit.com/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/)[https://www.reddit.com/r/wallstreetbets/comments/mdwvby/the\\_amd\\_boom\\_is\\_still\\_coming\\_heres\\_why/](https://www.reddit.com/r/wallstreetbets/comments/mdwvby/the_amd_boom_is_still_coming_heres_why/)  \nAnd Meme: [https://www.reddit.com/r/wallstreetbets/comments/mzy4qn/never\\_bet\\_against\\_the\\_doctor/](https://www.reddit.com/r/wallstreetbets/comments/mzy4qn/never_bet_against_the_doctor/)\n\nEverything I said came true, except the stock is down today. Why? Well take a look at the short interest: [https://www.marketbeat.com/stocks/NASDAQ/AMD/short-interest/](https://www.marketbeat.com/stocks/NASDAQ/AMD/short-interest/) AMD is the most heavily shorted stock in the semi industry. The latest there shows 82.7M shares sold short on 4/15 with price at $85.21. That means hedge funds need to keep the stock under $85 to make their precious profit or else they'll have to cover. They also want to keep the stock down in order to get a good buy-in for the Xilinx deal. Which means it seems they're trying to keep the stock down for the entire year until the Xilinx deal closes, that's a long time to keep up negative pressure. Meanwhile, AMD is going to continue to get upgrades and price target increases. Analysts are already saying to buy, and buy aggressively at this price.\n\nI know everyone hates Jim Cramer but this is what he said in regards to AMD on the AAP call this morning:  \n\"This is just a buy. I mean, you gotta buy it very aggressively here. Because if it weren't for the Xilinx arbitrage, it would probably be up. But remember, it has to be shorted if you want to buy Xilinx and that's what's killing them. Because people just keep shorting it all day. There's 51M shares traded, which is rather remarkable.\"\n\nOne could speculate that Intel is coming in to steal AMD's thunder but in yesterday's earnings call, AMD put that to rest. Intel's datacenter sales were down 20% QoQ which Intel last week said was NOT due to competition but due to customers \"digesting\" existing purchases and that this is a slow time of year for data center sales. AMD's Dr. Lisa Su shows 100% growth in datacenter sales QoQ saying customer demand is strong and accelerating, basically calling Intel liars and that AMD is taking all that market share with no slow down in sight.\n\nOne could speculate that Nvidia is going to challenge AMD in the datacenter but Su Bae dismissed it in the earnings call saying customers are not asking for ARM chips, and AMD would build them if they were. Basically saying that building an ARM processor for the datacenter would be like building a solution to a problem no one has, and no one is asking for, there's no money in it.\n\nOne could speculate that the \"chip shortage\" will negatively impact AMD. But the good doctor put that to rest yesterday as well confirming rumors that AMD is increasing production by 20% in Q2 which reflected in them raising guidance for 50% growth in 2021! By contrast, Intel is expecting 0% growth this year.\n\nAll of this positive growth and lack of industry competition means AMD is going to continue killing in quarter after quarter which will push analysts to keep upgrading the stock and price targets which will make it harder and harder for hedge funds to keep up the negative pressure throughout the year.\n\nWith AMD, there's no need for WSB or individual investors to try to turn it around on the short selling hedge funds, it's going to happen naturally due to continued analyst upgrades, we don't have to do anything. I recommend getting on board now and being patient, diamond hands, because when it pops and the short sellers give up/move on, when the negative pressure cannot contain the buying from institutions and individual investors on analyst upgrades, it's going to explode.\n\nAMD Positions: 550 shares, various call options with expirations from June 2021 to June 2022. My price target is $120 which is more conservative than even some analysts.",
        "subreddit": "wallstreetbets",
        "title": "AMD: This is why it's down today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0k22g/amd_this_is_why_its_down_today/",
        "created": 1619659694.0
    },
    {
        "author": "elsasso24",
        "created_utc": 1619795358,
        "id": "n1vvex",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Debating which one to dump money into before the merger is completed. See tremendous upside for both of these companies as they continue to gain share away from Intel. Thoughts?",
        "subreddit": "wallstreetbets",
        "title": "AMD vs Xilinx",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n1vvex/amd_vs_xilinx/",
        "created": 1619824158.0
    }
]