[
    {
        "author": "johnn_andreass",
        "created_utc": 1614857809,
        "id": "lxijpz",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Can yall rate my dividend portfolio? Is there any I should add or remove from it? Ive had this for about 7-8 months now, and I was thinking if it needed some changes. I have another portfolio for growth though just in case youre wondering.\n(From most to least)\n       JNJ,\n       JPM,\n       PG,\n       VZ,\n       WMT,\n       T,\n       INTC,\n       PEP,\n       ABBV,\n       CSCO,\n       MCD,\n       NEE,\n       AMGN,\n       UPS,\n       MMM,\n       CAT,\n       BA,\n       TGT,\n       DUK,\n       PGR,\n       WM",
        "subreddit": "ValueInvesting",
        "title": "Dividend Portfolio",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/lxijpz/dividend_portfolio/",
        "created": 1614886609.0
    },
    {
        "author": "spade883",
        "created_utc": 1617153592,
        "id": "mguvv1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "If you all are investing in Vanguard Information Technology ETF (VGT) I would highly encourage you to look into Fidelity MSCI Information Technology Index ETF (FTEC). FTEC has virtually the same portfolio composition as VGT but with a lower expense ratio. FTEC expense ratio is 0.08% while VGT is 0.10%.. To make this post even better FTEC has a dividend yield of 1.01% while VGT's is 0.76%. Let me know your thoughts!\n\n&amp;#x200B;\n\nThe top ten companies for FTEC are:\n\nAAPL Apple Inc  19.66%\n\nMSFT Microsoft Corp  15.83%\n\nV Visa Inc Class A  3.39%\n\nNVDA NVIDIA Corp  3.21%\n\nMA Mastercard Inc A 3.00%\n\nPYPL PayPal Holdings Inc 2.75%\n\nINTC Intel Corp  2.45%\n\nADBE Adobe Inc  2.09%\n\nCRM Salesforce.com Inc 1.87%\n\nCSCO Cisco Systems Inc 1.80%\n\n&amp;#x200B;\n\nThe top ten companies for VGT are (couldn’t find the breakdown):\n\nApple Inc.\n\nMicrosoft Corp.\n\nNVIDIA Corp.\n\nVisa Inc.\n\nMastercard Inc.\n\nPayPal Holdings Inc.\n\nIntel Corp.\n\nAdobe Inc.\n\nsalesforce.com Inc.\n\nBroadcom Inc.",
        "subreddit": "investing",
        "title": "A better ETF than VGT.... FTEC!",
        "url": "https://www.reddit.com/r/investing/comments/mguvv1/a_better_etf_than_vgt_ftec/",
        "created": 1617182392.0
    },
    {
        "author": "Minimum_Finish_5436",
        "created_utc": 1615995580,
        "id": "m7372u",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n\n**This isnt a meme stock and there is no discussion of short interest.**\n\nIteris ITI is a global leader in smart mobility infrastructure management – the foundation for a new era of mobility. Using cloud computing, artificial intelligence, advanced sensors, advisory services and managed services to achieve safe, efficient and sustainable mobility to help ensure that roads are safe, travel is efficient, and communities thrive.\n\nObligatory company statement out of the way. Iteris is a player in traffic opimization, smart infrastructure, traffic data, both roadway and vehicle sensors.\n\n[Link](https://www.businesswire.com/news/home/20210301005595/en/Iteris-Board-of-Directors-Unanimously-Rejects-Unsolicited-Proposal-from-Rekor-Systems) 1 March they annouced a rejection of unsolicited buyout offer from Rekor Systems which was valued between 8-8.50 per ITI share and a stock/cash split of 83:17. Following the announcement ITI announced hiring a firm to help it \"consider strategic alternatives\". [Link](https://seekingalpha.com/news/3670200-iteris-hires-advisor-to-consider-strategic-alternatives-sending-shares-up-7-percent)\n\nMoelis is a well known firm for acquisitions and mergers. [Link](https://www.moelis.com/transactions/) to the recent transaction arcives for Moelis. Everything from $100M to multi $billion deals.\n\n[Link](https://www.iteris.com/news/iteris-delivers-connected-communities-infrastructure-cisco-support) Iteris partners with Cisco transportation to include Cisco offereing Iteris technology (and associated patents) through Cisco transportation. Iteris is also a direct reseller of Cisco products as part of his suite of traffic solutions.\n\n**Bottom line**: Iteris is profitable over the last 12-18 months and a leader in traffic management and data. Both are important to autonomous driving technology. They have partnered with Cisco on a traffic project in Las Vegas since 2019. Cisco has a transportation division. The unsolicited offer from Rekor at 8.00-8.50 sets a floor for other offers to include from much larger Cisco who Iteris already partners with. Moelis is a known merger/acquisition firm.\n\n**Bold prediction** \\- Iteris will announce they are getting acquired (Cisco?) this year and the price will be above $8.50 per share in an all cash or cash/stock deal. 26% or more above the current price of 6.29 per share.",
        "subreddit": "pennystocks",
        "title": "Iteris ITI merger bold prediction",
        "url": "https://www.reddit.com/r/pennystocks/comments/m7372u/iteris_iti_merger_bold_prediction/",
        "created": 1616024380.0
    },
    {
        "author": "Paradox68",
        "created_utc": 1615308824,
        "id": "m1aohq",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I’ve been in the networking and data center business long enough to know that DATTO is becoming a serious player in the field. Listed on the exchange just October of last year only, only a few short months ago, this stock hasn’t seen much growth.\n\nI have a feeling their earnings release will come with some great news and the stock is severely undervalued due to the obscure nature of complex computing and how DATTO comes into play with quality products at modest prices compared to Cisco, Brocade, and Ruckus.\n\nThey have a large network of Managed Service Providers (MSPs) using their DaaS and SaaS verticals. No major breakthroughs for the technology or their software but it’s an easy, intuitive, and manageable interface they offer for complete control of an IT environment and they sell almost anything that goes on your stack. I’d say they’re the “Zoom” of actual IT work but that would be an oversimplification. What do you guys think about Datto?",
        "subreddit": "wallstreetbets",
        "title": "A very professional and educated discussion about DATTO networks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1aohq/a_very_professional_and_educated_discussion_about/",
        "created": 1615337624.0
    },
    {
        "author": "Awkward_Flow3642",
        "created_utc": 1615573223,
        "id": "m3nm74",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Y’all apes gotta start thinking like an investor not like a gambler anymore , there is no more stimulus coming our way , let’s just take a fucking look at some real value stocks like GLW,NOK,CSCO, MU,ON and PLTR.. invest now thank me later !!!!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m3nm74/yall_apes_gotta_start_thinking_like_an_investor/",
        "created": 1615602023.0
    },
    {
        "author": "photorph",
        "created_utc": 1617012404,
        "id": "mfm6zq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "BAIDU, Volkwagen, adobe, Cisco, or others? Where would you put $5-10k today?",
        "url": "https://www.reddit.com/r/stocks/comments/mfm6zq/baidu_volkwagen_adobe_cisco_or_others_where_would/",
        "created": 1617041204.0
    },
    {
        "author": "NeitherMedicine4327",
        "created_utc": 1615865209,
        "id": "m5zxhn",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "- SIFY (Top 500 Fortune in India)\n\nCurrently trade at $4.00\n-1 year chart •426,32%\n-3 month chart •257,14%\n-1 months chart •(17,86%) * we all remember the crash\n-1 week chart •19,40%\n-1 day chart •4.74%\n\nSify Technologies is India’s most comprehensive ICT service &amp; solution provider. With Cloud at the core of their solutions portfolio, Sify is focussed on the changing ICT requirements of the emerging Digital economy and the resultant demands from large, mid and small-sized businesses.\n\nPartner with Microsoft, McAfee, Cisco, Oracle, Amazon, Google, Verizon, HP, Hitachi, Tata and more\n\nHas historically seen an increase in volume and share price leading up into earnings (next May 5). \n\nOn Oct 23rd, SIFY was sitting at $1.15, and on Dec 28th, the run started and SIFY PPS doubled by the time earnings reported last quarter. This type of upward movement has happened several times; check the charts. \n\nSIFY will look to close out the 4th quarter strong. Let’s gear up for that run that will take SIFY into the range (and maybe beyond) where they want the valuation for the Blackstone minority stake.\n\n- SIFY is looking for $1-1.2 billion valuation in the transaction, which would put the share price around $6-$10\n\nThe chairman selling some of his stake would go a long way towards investor confidence as well as the extra needed capital to expand the data center \ncapacity. \n\n-Blackstone interest on Bloomberg News:\n\nhttps://www.bloomberg.com/news/articles/2021-03-05/blackstone-said-in-talks-to-buy-minority-stake-in-india-s-sify\n\nAlso India is expected to grow GDP by 12.6% in the coming fiscal year. China is a distant second at 7.8%.  (From CNN). \n\nPast investments and recent events have setup nicely for SIFY to grow exponentially over the next couple of years.\n\nThis is a step in the right direction. Let’s hope it all comes to fruition.\n\nYou are welcome.\nPeace.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "NAS: SIFY - Undetected Indian Gem",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/m5zxhn/nas_sify_undetected_indian_gem/",
        "created": 1615894009.0
    },
    {
        "author": "FoulFumes",
        "created_utc": 1615951678,
        "id": "m6r3da",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "CSCO Short",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m6r3da/csco_short/",
        "created": 1615980478.0
    },
    {
        "author": "dankantspelle",
        "created_utc": 1615507851,
        "id": "m34mpr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "\n\n🚀🚀🚀: The market for services like Slack is emerging, rapidly evolving, and fragmented. \nAs a result, Slack principally competes against collaboration and communication tools and products from \nestablished vendors, such as Microsoft; productivity tool and email providers, such as Google; unified \ncommunications providers, such as Cisco; and consumer application companies that have entered the \nbusiness software market, such as Facebook. It also competes with smaller companies that offer niche or \npoint products that attempt to address certain problems that Slack addresses. These smaller companies \ninclude companies that specialize in voice or video communication, instant messaging, email filtering, and \nemail inbox organization, business workflows, team-based collaboration, intranet creation and \nmaintenance, and other functionality.\n\n\n\n🚀🚀🚀: In September 2018, Slack completed its acquisition of Astro Technology \nInc. for $43.3 million in cash. Astro created Astrobot, a Slack app that uses integrates email and calendars \ndirectly into the chat platform, while also using artificial intelligence to reduce inbox clutter. \n\n\n\n🚀🚀🚀: Revenue increased 57.4% in FY 20 (Jan.) following 81.6% growth in FY 19. The increase \nin revenue was primarily due to expansion within its existing Paid Customers, as reflected by its Net Dollar \nRetention Rate of 132% as of January 31, 2020, and the addition of new Paid Customers, as the number of \nPaid Customers increased by 25%. As of January 31, 2020, Slack had $768.6 million in total cash and short-\nterm investments with no long-term debt.\n\n\n\n🚀🚀🚀 Slack is a leading channels-based messaging platform, used by millions to align \ntheir teams, unify their systems, and drive their businesses forward. Slack offers a secure, enterprise-grade \nenvironment that can scale with the largest organizations in the world. It is a new layer of the business \ntechnology stack where people can work together more effectively, connect all their other software tools and \nservices, and find the information they need to do their best work.\nSlack has both a self-service offering and a direct sales force to address customers who do not want to buy \nthrough the self-serve model or who need the additional capabilities of its enterprise products. Slack offers \nfour subscription plans to serve the varying needs of its users: Free, Standard, Plus, and Enterprise Grid. \nEnterprise Grid allows paid customers to create and manage an unlimited set of connected workspaces and \nchannels, search across multiple workspaces, access centralized controls, and integrate with third-party e-\nDiscovery and data loss prevention tools to help meet security and compliance requirements. As of January \n31, 2020, Slack had more than 660,000 organizations with three or more users, comprised of more than \n550,000 organizations on its Free subscription plan and more than 110,000 paid customers. The number of \norganizations on Slack is highly diversified, and during the years ended January 31, 2018, 2019, and 2020, \nno Paid Customer accounted for more than 3% of revenue.",
        "subreddit": "wallstreetbets",
        "title": "$WORK from 🏡 favorite Slack is set to 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m34mpr/work_from_favorite_slack_is_set_to/",
        "created": 1615536651.0
    }
]