[
    {
        "author": "Engineer_Economist",
        "created_utc": 1634611227,
        "id": "qb24e1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Three ETF's per winner (when available)  \n\n\n**ETF Ticker | % invested in Winner | ETF Full Name**  \n\n\n**Industrials**: ETFs investing in Generac Holdings Inc.  \nIVDG-- 3.44%  Invesco Focused Discovery Growth ETF  \nPRN-- 3.42%  Invesco DWA Industrials Momentum ETF  \nFFND-- 3.32%  Future Fund Active ETF  \n\n\n**Health Care**: ETFs investing in Moderna Inc  \nBBH-- 10.19%  VanEck Biotech ETF  \nIBB-- 7.71%  iShares Biotechnology ETF  \nIPO-- 7.67%  Renaissance IPO ETF  \n\n\n**Information Technology**: ETFs investing in CDW common stock  \nQQQA-- 4.64%  ProShares Nasdaq-100 Dorsey Wright Momentum ETF  \nUTRN-- 4.01%  Vesper U.S. Large Cap Short-Term Reversal Strategy ETF  \nVSL-- 3.92%  Volshares Large Cap ETF  \n\n\n**Communication Services**: ETFs investing in Twitter Inc  \nFNGS-- 12.89%  MicroSectors FANG+ ETN  \nSOCL-- 6.32%  Global X Social Media ETF  \nVPOP-- 5.73%  Simplify Volt Pop Culture Disruption ETF  \n\n\n**Consumer Discretionary**: ETFs investing in Gap Inc  \nN/A--    \n   \n   \n\n\n**Utilities**: ETFs investing in Exelon Corporation  \nUTES-- 6.91%  Virtus Reaves Utilities ETF  \nNLR-- 6.85%  VanEck Uranium + Nuclear Energy ETF  \nXLU-- 5.30%  Utilities Select Sector SPDR Fund  \n\n\n**Financials**: ETFs investing in Wells Fargo &amp; Co  \nKBWB-- 7.92%  Invesco KBW Bank ETF  \nDWLD-- 6.57%  Davis Select Worldwide ETF  \nDUSA-- 6.01%  Davis Select U.S. Equity ETF  \n\n\n**Materials**: ETFs investing in Albemarle Corporation  \nLIT-- 14.30%  Global X Lithium &amp; Battery Tech ETF  \nQCLN-- 7.54%  First Trust NASDAQ Clean Edge Green Energy Index Fund  \nVCAR-- 4.75%  Simplify Volt RoboCar Disruption and Tech ETF  \n\n\n**Real Estate**: ETFs investing in Simon Property Group Inc  \nICF-- 5.21%  iShares Cohen &amp; Steers REIT ETF  \nXLRE-- 4.67%  Real Estate Select Sector SPDR Fund  \nRWR-- 4.49%  SPDR Dow Jones REIT ETF  \n\n\n**Consumer Staples**: ETFs investing in Costco Wholesale Corporation  \nFSTA-- 7.12%  FIDELITY COVINGTON TRUST MSCI CONSUMER STAPLES INDEX ETF  \nVDC-- 7.10%  Vanguard Consumer Staples ETF  \nJHMS-- 6.00%  John Hancock Multifactor Consumer Staples ETF  \n\n\n**Energy**: ETFs investing in Occidental Petroleum Corporation  \nPXE-- 4.84%   Invesco Dynamic Energy Exploration &amp; Production ETF  \nRYE-- 4.67%   Invesco S&amp;P 500® Equal Weight Energy ETF  \nFCG-- 4.23%   First Trust Natural Gas ETF  \n\n\nHappy investing!",
        "subreddit": "StockMarket",
        "title": "ETFs with Investments in SP500 Winners of 10/18/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qb24e1/etfs_with_investments_in_sp500_winners_of_10182021/",
        "created": 1634640027.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1634611208,
        "id": "qb2468",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | Generac Holdings Inc. | **GNRC** | 4.05%  \n2. **Health Care** | Moderna Inc | **MRNA** | 3.28%  \n3. **Information Technology** | CDW common stock | **CDW** | 4.79%  \n4. **Communication Services** | Twitter Inc | **TWTR** | 3.30%  \n5. **Consumer Discretionary** | Gap Inc | **GPS** | 4.61%  \n6. **Utilities** | Exelon Corporation | **EXC** | 0.16%  \n7. **Financials** | Wells Fargo &amp; Co | **WFC** | 2.23%  \n8. **Materials** | Albemarle Corporation | **ALB** | 3.56%  \n9.  **Real Estate** | Simon Property Group Inc | **SPG** | 3.07%  \n10. **Consumer Staples** | Costco Wholesale Corporation | **COST** | 2.11%  \n11. **Energy** | Occidental Petroleum Corporation | **OXY** | 4.01%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **United Airlines Holdings Inc** | UAL | **-1.73%**  \n2. Health Care | **Medtronic PLC** |  MDT | **-5.50%**  \n3. Information Technology | **NetApp Inc.** | NTAP | **-4.32%**  \n4.  Communication Services | **Walt Disney Co** | DIS | **-3.01%**  \n5. Consumer Discretionary | **BorgWarner Inc.** | BWA | **-2.38%**  \n6. Utilities | **AES Corp** | AES | **-2.29%**  \n7. Financials | **Chubb Ltd** | CB | **-1.99%**  \n8. Materials | **PPG Industries, Inc.** | PPG | **-1.81%**  \n9. Real Estate | **Equinix Inc** | EQIX | **-1.74%**  \n10. Consumer Staples | **Clorox Co** | CLX | **-1.65%**  \n11. Energy | **Hess Corp.** | HES | **-1.11%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 10/18/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qb2468/sp500_winners_and_losers_10182021/",
        "created": 1634640008.0
    },
    {
        "author": "TheLifeandTimesofTim",
        "created_utc": 1633199490,
        "id": "q00nqh",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "# Altus’ Business and Competitive Position \n\nAltus is a clean electrification company that develops, owns, and operates solar systems and energy storage for commercial customers, communities, and residential customers. Altus has been profitable for years, with 50-60% EBITDA margins, and expects to grow EBITDA by \\~77% annually through 2024.\n\n**Altus is led by highly capable, seasoned founders**:\n\n* Lars Norell (co-founder and co-CEO) was previously a Principal and Managing Director at Cohen &amp; Company where he served as Head of Capital Markets and subsequently led the Alternative Assets effort. Before joining Cohen &amp; Company, Norell was an MD and Co-Head of US Structured Credit Products at Merrill Lynch. \n* Greg Felton (co-founder and co-CEO) was a partner at Goldman Sachs and the Chief Investment Officer of the Credit Alternatives platform at Goldman Sachs Asset Management.\n\n**Altus is ahead of the pack and expanding its service offerings; capital from + partnership with CBRE should put it even further ahead**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3zg3h3pvw2r71.png?width=1420&amp;format=png&amp;auto=webp&amp;s=b6e5189474922c2f4a25224c172c5b81d299cfce\n\n*Two of the largest players in commercial real estate are on Altus’ side* \n\n* CBAH was formed by CBRE and Blackstone has been a long-time investor in Altus (its ownership is currently 17%). \n* Through Blackstone, Altus has access to the most efficient debt and tax equity financing within a fragmented industry where others do not. \n* CBRE is the world’s largest commercial real estate services firm. CBRE manages 7 billion square feet of commercial real estate and $8 billion of energy spend annually.  \n   * (More detail on CBRE’s ability to directly add value on p.3)\n* CBRE also currently possesses over 20 billion data points stored in its Enterprise Data Platform for the CRE assets it operates; CBRE plans to leverage its Data &amp; Analytic capabilities to create a new software tool capable of analyzing client portfolios to aid in identifying attractive opportunities for Altus Power and for clients.\n* CBRE and Blackstone give Altus a considerable edge over competitors.\n\n*Altus’ customers are highly reliable*\n\n* Not a single payment default in its history of more than a decade\n\n*Multiple additional growth opportunities*\n\n* Altus is beginning to build out EV charging stations at office buildings, which are an ideal place to install EV chargers given that employee cars sit idle all day long. And unlike most charging stations, users can actually see that their electricity is coming directly from a clean source.\n* U.S. cumulative **installed battery storage** is anticipated to **grow at \\~49% annually** to 54 GWh2 by 2030.\n\n## The CBAH Transaction and Valuation\n\n**Interests between all stakeholders are aligned to an exceptional degree and CBRE is in a position to add substantial value**\n\n* Existing investors and management are not only rolling 100% but are also investing $25M in the PIPE.\n* CBRE is investing $75M in the PIPE and has provided a commitment to backstop up to $150M of SPAC redemptions at the same terms as the PIPE.\n* Moreover, CBAH agreed to the “SAIL” promote structure from the get-go, which means the entire promote (which is already capped at 15%) is earned over time as share price appreciates. \n   * The first sponsor shares are earned when shares reach $12.\n\n*\\* Notes regarding CBAH warrants: $11.00 strike price and ¼ warrant coverage \\**\n\n**Altus is valued at an EBITDA multiple discount to** ***qualitatively*** **comparable (residential) solar companies, which have inferior financials and growth** \n\n[\\*as of 10\\/01](https://preview.redd.it/fsx37cetx2r71.png?width=2328&amp;format=png&amp;auto=webp&amp;s=718bd491723d2aa7595c037b6f29160c3cf85a79)\n\n**Altus’ projections are conservative and CBRE can meaningfully add value** \n\n* Their current 900+ MW pipeline represents a \\~2.0x coverage over the 445 MW required to achieve 2022 annualized EBITDA\n* Further, the projections do *not* include the potentially massive windfall from their partnership with CBRE.\n* Unlike the vast majority of SPAC sponsors, CBRE is not only highly incentivized to add value, they are actually in a position to do so in a direct and substantial way.\n\n**CBRE Direct Value Add**\n\n[Note: 2023 EV is conservative given that SPWR is currently valued at \\~28 x 2022 EBITDA.](https://preview.redd.it/033etx89y2r71.png?width=1244&amp;format=png&amp;auto=webp&amp;s=f9d465df62327901b831ad144e7871e400dd036e)\n\n# Potential Risks and Concerns Identified and Addressed\n\n**Altus’ employee count to market cap ratio is dramatically low than peers**\n\nAlthough the comps cited in the investor presentation appear to be *truly comparable* in terms of the quality of leadership, product offering, market position, scale, etc., Altus currently employs far fewer people than its peers (according to LinkedIn).\n\nhttps://preview.redd.it/ux2htm2my2r71.png?width=944&amp;format=png&amp;auto=webp&amp;s=901e6a9348875cc7822ceca069e0d710999d8ee6\n\nThis difference is eye-catching; and it’s possibly indicative of a less robust and capable company. To the extent that meeting projections will require increased hiring efforts, both recruiting and integrating capable employees could prove to be a major hurdle. \n\nThere is reason to think this might *not* be cause for concern, though. This low ratio could very well be a result of Altus operating predominantly in the commercial, industrial, and community solar markets – where customer offtake is much larger and a far smaller salesforce is needed compared to the residential marketplace. Indeed, Altus cites a low customer acquisition cost as a positive differentiator between it and residential solar companies and its margins are significantly higher. (Altus is compared to residential solar companies since there are no public commercial solar companies.) Relatedly, Altus states in the presentation that they rely on contractors and third parties for both installation and sales sourcing. So Altus may employ a relatively high number of contract workers and/or manual workers who do not show up in online searches. \n\n**Public comps are volatile and are now considerably lower (\\~10-15%) than they were when the CBAH deal was announced**\n\nThere is risk of this downward trend extending to the date of the merger (Q4 2021). With that said, this is already factored into the valuation math on p.2, which demonstrates Altus’ discount to comps relative to both 2022 and 2023 EBITDA. And volatility is a double-edged sword, especially with respect to the value of warrants, which should benefit from higher volatility (theoretically, at least). \n\n**Altus lacks a significant technological moat**\n\nAltus does not produce its panels, nor does it have sophisticated proprietary energy storage technology like Stem. Altus does, however, have some software technology IP and data. Here’s what Norell said about this during the analyst day presentation:\n\n&gt;Two years ago \\[we built\\] our own monitoring software, which we named Gaia, and since that time we have also built asset registries and stored all the data coming out of our designs and systems and equipment choices and added the functionalities described on this page... what we were planning to do next is to scale Gaia in two directions... for asset servicing, predictive maintenance of our solar assets using machine learning and AI, and for origination of new customers and assets, develop a customer interface that we can use to originate both commercial and community solar customers. We’ve started collaborating with CBRE on both of these initiatives.\n\nNevertheless, the ultimate benefit of this software and data is not all that clear. So it’s reasonable to assign it little to no value at this point. However, where Altus may have an underappreciated moat is in financing and managing its projects. Unlike residential solar, which has standardized financing, each commercial solar project has a high degree of customization and complexity. Often the work and expense involved in acquiring a customer and securing financing makes deals with commercial customers unworkable. ([Forbes](https://www.google.com/search?q=untpped+comercial+and+industrial+solar&amp;oq=un&amp;aqs=chrome.0.69i59l2j0i67j35i39j69i60j69i61j69i60l2.839j0j7&amp;sourceid=chrome&amp;ie=UTF-8)) As mentioned on p.1, Altus is run by executives with deep expertise in structuring complex financial agreements. And Altus’ partnership with Blackstone Credit increases this edge.  \n\nFurther, there are plenty of companies that have achieved significant growth and outperformance despite lacking a technological or consumer brand moat. The most relevant example that jumps to mind is Public Storage (PSA). In the past 20 years, PSA has doubled the S&amp;P 500’s performance – outpacing the S&amp;P by \\~500%. ([WSJ](https://www.wsj.com/articles/wall-streets-hidden-gem-is-in-public-storage-1455556303)) In the past 10 and 5 years, PSA has outperformed by \\~130% and 60% respectively. This shows the value creation of companies that have exceptional management and execution, especially when such companies are operating in an industry with strong secular growth. There is good reason to believe that Altus is such a company.\n\nDisclaimers: I'm not a financial advisor and this is not financial advice.\n\nDisclosure: I hold 110,000 CBAH warrants.",
        "subreddit": "SPACs",
        "title": "The Unique CBAH/Altus Opportunity",
        "url": "https://www.reddit.com/r/SPACs/comments/q00nqh/the_unique_cbahaltus_opportunity/",
        "created": 1633228290.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1633987894,
        "id": "q66co5",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "So the news has been consistent for some time now, well since the beginning of the pandemic really, that the supply chains will be interrupted.\n\nThe way I imagine it is similar to a traffic even where a disruption in flow will cause a chain react to the process of smooth traffic.\n\nSo we are here now. We saw the disruption ahead, and it is time that traffic, or supply chains, are slowing down as a result of this interruption.\n\n\nMy view is that business expense software will likely shine in the next year or two. So companies like Coupa Software and Autodesk will see a relative tailwind, while other systems like Oracle, SAP, and Salesforce will see a stress test.\n\nWhat are your thoughts on the supply chain crunch? Are you playing around that economic element? I've been considering it lately.",
        "subreddit": "wallstreetbets",
        "title": "how to play the supply chain crunch",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q66co5/how_to_play_the_supply_chain_crunch/",
        "created": 1634016694.0
    },
    {
        "author": "jeff9331",
        "created_utc": 1634536582,
        "id": "qagkhn",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Basically i am very bullish on $KPLT at this price $4.85, here's why\n\n1) When u look at the number of buys from insider and institutional holders when this one crash in august due to removal of their guidance, they show smart money actually think the stock price around $3\\~5 is a steal. (The highest buy from insider is $4.42, which means CEO actually didnt expect market can be way overreacting that the price can drop to \\~$3)\n\nhttps://preview.redd.it/l67gnekm35u71.png?width=2359&amp;format=png&amp;auto=webp&amp;s=31097b2cf6f1af83d980b53e27291377b875b1c1\n\n[https://fintel.io/so/us/318085206](https://fintel.io/so/us/318085206)\n\n&amp;#x200B;\n\n2) Their revenue multiple now is absurdly low compared to other BNPL growth stock. with the stock trading at this range basically means that market expect KPLT with no growth in the coming years or going bankrupt soon which is ridiculous. if they can show some slight revenue growth and give us some full year guidance in the upcoming Q3 earning call (11/9), this one will surely be back at least $8. \n\nhttps://preview.redd.it/f9it5tsta5u71.png?width=1376&amp;format=png&amp;auto=webp&amp;s=674f626600b66b1e536179b0dcbfa6b3dd2db0b4\n\n3) One of the main concern people worry about this stock in their last Q2 earning is that `their LTO origination was down 17% YOY.` but i think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is one time surge only which made their `LTO origination` in Q2 2021 looks really bad, but when compared to Q1 2021 is still up 1%, so it is actually not that bad.\n\nhttps://preview.redd.it/w1foazc685u71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=b5163b155a819fc728d209059d1a385ce3ba1d98\n\n4) Recent great direct partnership with Salesforce and Adobe\n\n[https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html](https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html)\n\n[https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html](https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html)\n\n5) Recent indirect waterfall partnership from Affirm with (amazon, target, walmart). The amazon - affirm deal actually sent $KPLT all the way up to $7\\~$8 in september.\n\n6) High short interest makes it a good short squeeze candidate if more good news coming\n\nhttps://preview.redd.it/6rbfbkjs95u71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=044671cd44465dfa867285c48ce6af6b75be4cbf\n\n7) Their fail to deliver going into power this week, with this 2.6 million shares fail to deliver, and last friday the Market maker shorted more just to make the 5$ call expire worthless, this one has high chance to take off today or Tuesday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/axjtad99a5u71.png?width=2389&amp;format=png&amp;auto=webp&amp;s=63a3f4a7d0a31dff9336d2b23e1a0aee9e0269f7\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5viw9d1aa5u71.png?width=960&amp;format=png&amp;auto=webp&amp;s=5ba5fc12d433a9cc3d496d1261c080a54b872aab\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWhat are your thought about $KPLT? \n\n&amp;#x200B;\n\nPosition: 200 11/19 $6 call",
        "subreddit": "SPACs",
        "title": "who are here the holder of $KPLT ? some thoughts about $KPLT",
        "url": "https://www.reddit.com/r/SPACs/comments/qagkhn/who_are_here_the_holder_of_kplt_some_thoughts/",
        "created": 1634565382.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "created_utc": 1633663461,
        "id": "q3pc8x",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Gentlemen, I hope you have been making the most of the opportunity my dear friend, Moscow Mitch has provided you. ie I **HOPE YOU BOUGHT THE DIP F%\\*%\\*#\\*@**\n\nWhile I still have your attention, I would like to introduce you to a company that me and some fellows have been bag holding (in the red) for a while.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3jmjge40a5s71.png?width=1379&amp;format=png&amp;auto=webp&amp;s=cc941bbcf643c78cefe803ee9ce4174b8f8e5889\n\n**Payoneer, the Paypal for** **~~Shithole~~** **Developing Countries**\n\n**Payoneer** is Paypal for B2B global commerce, particularly outside North American and Europe. The company provides B2B services for millions of SMB and enterprises around the world\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qn847nz0a5s71.png?width=1759&amp;format=png&amp;auto=webp&amp;s=d05be8973c4bfefe00396c250fb92fe123c5f0ae\n\nThe ideal customer is a small but growing SMB doing business all over the world which needs currency, compliance and business services. Payoneer is an obvious candidate to handles these needs given its global network.\n\n· Payoneer offers vendors the ability to move money with a U.S. bank account and pay suppliers, without having to deal with too many banking hurdles or red tape.\n\n· A lot of freelancers on Upwork.com use Payoneer because many of them live in countries that Upwork.com can't wire money to.\n\n· Once vendors receive funds into their Payoneer account they can either withdraw the cash using their Payoneer provided Master Card or do a direct bank transfer from Payoneer to their local bank. Usually funds arrive within 1-2 business days.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cjzym5w1a5s71.png?width=1764&amp;format=png&amp;auto=webp&amp;s=e77f88b654fe44aca54902b8a4f1d18bb7c519b9\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins.\n\nSay a consumer wants to rent an airbnb. They use a credit card (or other payment method) to pay airbnb, a payment gateway facilitates payment acceptance. The payment is then processed and Airbnb ends up with the money from the transaction. Airbnb has now gathered cash through its acquirers (e.g., Adyen, ACI). Airbnb now needs to distribute funds to its SMB sellers. Airbnb uses payoneer to disburse funds to sellers. From this example, you can see Payoneer isn't competing with companies like Adyen or other acquirers/ processors, even though they are processing payments.\n\nPayoneer signs up individual sellers, which allows the sellers to use payoneer across platforms (e.g., facebook marketplace and amazon). Hyperwallet (owned by PayPal) is one of their competitors, but Hyperwallet operates completely differently, they sign up users via the platform, but this means you can't use hyperwallet for your business on both amazon and fb marketplace without going through the onboarding process again. Given the trend towards SMB sellers operating across multiple marketplaces, this is a huge benefit for payoneer, and makes PayPal's offering a lot less competitive. It also means Payoneer owns the seller relationship in a way that PayPal doesn't do as effectively, and makes it easier for them to package other offerings (e.g., working capital). These other offerings provide a two-fold benefit - their customer relationships become stronger, so revenue is seen as more recurring and investors will pay a higher multiple; and they'll make more money per customer.\n\nMy view is that Payoneer should see an S-type growth curve, where they'll hit a critical mass of users and see exponential growth, like cashapp, or venmo. Their investor presentation projects 25% revenue growth over the next couple years, I think this is super conservative, especially considering that 25% growth rate doesn't account for the two travel related marketplaces that got screwed by covid. Once they hit that critical mass of users, they'll pop off, sales &amp; marketing expenses will drop, and they'll become profitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5xuonwi2a5s71.png?width=1556&amp;format=png&amp;auto=webp&amp;s=b57e5a829bbcb5d58f51cbdc2e426ceca0ccd2a3\n\nThe company’s focus on investing for future services is actually what gets me most excited as it may ward off near-term investor interest and improves its competitive position. It’s also a sign of a mature management team. The opportunity to provide additional services such as working capital, compliance and tax services seems like an obvious strategic move to drive growth. Specifically, working capital is far and away the most important service and something SMBs are desperate for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zi2sl613a5s71.png?width=1664&amp;format=png&amp;auto=webp&amp;s=e959a0115d4cbb201b531f77ae5276a31026a7d1\n\nWho are their customers and where are they know? 5 million businesses in 190 countries. Customers include Amazon, Wish, Lazada (owned by Alibaba) Shopee, and Ebay. Weird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r1kinxk3a5s71.png?width=1631&amp;format=png&amp;auto=webp&amp;s=74cd5a7bdb3d3934ce730e1dd9aa9204ff72b259\n\n# Payoneer vs PayPal\n\nThe growth of Payoneer’s global network included a move into India in April 2016, following a partnership with Pune-based IndusInd Bank and expressions of interest in its services from more than 10,000 freelancers and small businesses across the country. \n\n2018 PayPal study suggest that India’s freelancers represent around one quarter of the world’s gig workforce.\n\n**In August 2019, Payoneer announced a year-on-year increase of 400% in its customer base and a threefold increase in payment volumes processed in India.**\n\n*“PayPal says to shut domestic payments business in India” \\~ Reuters*\n\nNEW DELHI (Reuters) - PayPal Holdings Inc will wind down its domestic payments business in India from April 1,2021 the company said in a statement on Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gcipi9b4a5s71.png?width=1743&amp;format=png&amp;auto=webp&amp;s=c3b20d766db9f0b8302c16582755758489bc479e\n\nB2B global marketplace. The attractiveness of FinTech can be summarized in a few words, namely, “scale” and “network effects”. From the metrics Payoneer shared, it looks like they’re benefitting from these dynamics. Analysts estimate the global B2B market at tens of trillions $ and cross-border payments at $300bn. Obviously the pandemic only accelerated these trends. (From the presentation, it looks like company B2B AR/AP volume more than doubled at 140% in 2020 although the CFO later cited a 53% increase in volumes so not sure exactly how to interpret that.)\n\nVolume and customer growth drives revenues. Volumes grew over 53% in 2020 (67% adjusted for the pandemic) and are expected to grow at 44% and 33% in 2021 and 2022, respectively, which translates into 25% annual revenue growth per year for the next two years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ghmjbjt4a5s71.png?width=1721&amp;format=png&amp;auto=webp&amp;s=4c9dcfa310f5e6a4bc90b66fbf9fc8b018377aa7\n\nThe benefits of network effects cannot be overstated as Paypal has proven. As a company acquires more customers, the value of its network increases. Payoneer’s business model leverages this same dynamic. Moreover, its network would be very difficult to replicate. The company’s global platform includes over 80 banks and clearing partners in over 100 countries. The company also provides customers data about its transactions, which I believe will be increasingly useful and sticky.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z9x3x8b5a5s71.png?width=1797&amp;format=png&amp;auto=webp&amp;s=caa49b84156468b94a9f50b9a23ffb208340eba3\n\nWhat do I think the future holds for Payoneer? I actually think there are several exits for this company.\n\n**Growth:**\n\nNote that Payoneer currently doesn’t do B2C, hence it may be quite common for retail to never even have heard of it, unless they are a business or in the gig economy. That is one of the problems for the stock, no one has heard of it (yet) because it works quietly behind the scenes. Given enough funding, who knows, Payoneer may well expand to B2C. Alibaba initially started as B2B as well but has since expanded to B2C (Taobao).\n\nWe just need Payoneer to be 5% of PayPal (ie. $15B market cap) in order for stock price to be in the $30-$40 range. ($6B market cap corresponds to around $13-$15 stock price.) \n\n&amp;#x200B;\n\nhttps://preview.redd.it/95silwp5a5s71.png?width=1748&amp;format=png&amp;auto=webp&amp;s=f10a138995c52367baa00ed4a10e9287c5da04ee\n\n**Acquisition:**  \n Large international payments processer buys them. Could be Paypal, Square, Stripe, First Data, etc. consolidation WILL happen in this space and I think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n\nWildcard: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be storage, and legal transactions then it will be financial transaction. They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\n&amp;#x200B;\n\nThis is not financial advice, i am not a financial advisor. I have a long position with the warrants that i purchased in February and are therefore in the red.",
        "subreddit": "wallstreetbets",
        "title": "$PAYO Baby Momma, so she can feed the kids",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q3pc8x/payo_baby_momma_so_she_can_feed_the_kids/",
        "created": 1633692261.0
    },
    {
        "author": "gorays21",
        "created_utc": 1634344990,
        "id": "q91cnm",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Here are some of Reddit's favorite stocks with upcoming earnings dates:\n\n&amp;#x200B;\n\n* **Tesla** \\- October 20th\n* **Facebook** October 25th\n* **Microsoft** \\- October 26th\n* Alphabet  - October 26th\n* **AMD** \\- October 26th\n* **Apple** \\- October 28th\n* **Paypal** \\- November 1st\n* **Etsy** \\- November 3rd\n* **Square** \\- November 4th\n* **Alibaba** \\- November 4th\n* **Couldflare** \\- November 4th\n* **Amazon** \\- November 4th\n* **Coinbase** \\- November 9th\n* **Disney** \\- November 10th\n* **Airbnb** \\- November 11th\n* **Palantir** \\- November 11th\n* **Draftkings** \\- November 12th\n* **Sea Limited** \\- November 16th\n* **Nvidia** \\- November 17th\n* **Crowdstrike** \\- December 1st\n* **Salesforce**\\- December 7th",
        "subreddit": "stocks",
        "title": "Upcoming Earnings Dates!",
        "url": "https://www.reddit.com/r/stocks/comments/q91cnm/upcoming_earnings_dates/",
        "created": 1634373790.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1633728753,
        "id": "q47cqi",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Friday, October 8, 2021**\n\nStocks closed the day modestly in the red but capped off the first week of October in the green as market participants digested the Labor Department’s September Job Report. The move to the upside earlier in the week came after Senate came to an agreement to raise the debt ceiling into early December, helping avoid a catastrophic government default. The S&amp;P 500 (SPY) closed the day 0.18% lower but the week 1.12% higher, the Nasdaq (QQQ) closed the day 0.5% lower but the week 0.69% higher, and the Dow Jones (DIA) closed the day even and the week 1.41% higher.\n\nAfter the first negative month all year, the move higher in equities came after the Senate came to an agreement to raise the debt ceiling until early December, preventing a catastrophic government that would’ve taken place around Oct 18. On Thursday, the chamber voted to raise the debt limit by $480 billion. \n\nWith concerns over a government default dissipating, market participants turned their attention to the latest monthly jobs report from the Labor market, which showed the second consecutive month of payroll gains greatly lagging behind estimates. Non-farm payrolls rose by only 194,000 in September versus the 500,000 expected. The unemployment rate fell more than expected to 4.8%, though this positive development came alongside a disappointing drop in the labor force participation rate to 61.6%, versus 61.7% in August. And the size of the civilian labor force actually contracted in September, with the gap between the size of the labor force in February 2020 and last month topping 3 million. \n\nThough employers added just 194,000 jobs in September, the economy has now regained half of the jobs deficit it faced in December, compared with pre-pandemic employment levels. Fed Chair Jerome Powell said last month that he'd only need to see a \"decent\" September U.S. jobs report to be ready to begin to taper in November. It is very likely the tapering of quantitative easing will be announced this month and commence in November. \n\nFriday's jobs report stood in stark contrast to other, stronger-than-expected data on the state of the labor market in the U.S. New weekly jobless claims came in at their second-lowest since March 2020. Here are the numbers \n\n* **Initial unemployment claims:** 326,000 vs. 348,000 expected and an upwardly revised 364,000 during prior week\n* **Continuing claims:** 2.714 million vs. 2.766 million expected and an upwardly revised 2.811 million during prior week \n\n**Highlights**\n\n* The[ Organisation for Economic Cooperation and Development said Friday that it reached a deal ](https://finance.yahoo.com/news/global-minimum-corporate-tax-rate-162842722.html)among 136 countries to ensure major companies pay a minimum corporate tax rate of 15%. \"The landmark deal, agreed by 136 countries and jurisdictions representing more than 90% of global GDP, will also reallocate more than USD 125 billion of profits from around 100 of the world’s largest and most profitable MNEs to countries worldwide, ensuring that these firms pay a fair share of tax wherever they operate and generate profits,\" the OECD said in a statement\n* Facebook (FB) said some users were once again having trouble accessing its product on Friday, another disruption following the hours-long one earlier this week and another blow to the already beleaguered company. “We’re aware that some people are having trouble accessing our apps and products,” Facebook [said in a post](https://twitter.com/Facebook/status/1446556732977778695) on Twitter. “We’re working to get things back to normal as quickly as possible and we apologize for any inconvenience.” \n* Elon Musk announced Tesla is moving its headquarters from Silicon Valley to Austin, Texas. He said that Tesla plans to expand its activities in California but that the company’s ability to scale up in the San Francisco Bay Area is limited.\n* EU antitrust regulators are following up on a complaint by Slack Technologies, which is owned by Salesforce (CRM) by asking Microsoft's rivals if its Teams app integrated with its Office product is anti-competitive. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AON target raised by Wells Fargo from $306 to $321 at Ovoverweight. Stock currently around $294\n* Caesars Entertainment (CZR) target raised by Stifel Nicolaus from $130 to $138 at Buy. Stock currently around $114\n* LPL Financial (LPLA) target raised by Morgan Stanley from $202 to $208 at Overweight. Stock currently around $167\n* Merck (MRK) target raised by Barclays from $87 to $92 at Overweight. Stock currently around $80\n* Charles Schwab (SCHW) target raised by Morgan Stanley from $86 to $97 at Overweight\n* Atlassian (TEAM) target raised by Mizuho from $370 to $440 at Buy. Stock currently around $390\n* Tesla (TSLA) target raised by Canaccord Genuity from $768 to $940 at Buy. Stock currently around $785\n* Warner Music Group (UMG) target raised by Morgan Stanley from $46 to $53 at Overweight. Stock currently around $45\n\n“The secret to getting started is to quit talking and start doing” - Walt Disney",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, October 8, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/q47cqi/here_is_a_market_recap_for_today_friday_october_8/",
        "created": 1633757553.0
    },
    {
        "author": "AppleGingerTequila",
        "created_utc": 1633396720,
        "id": "q1k63c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hi im 20 years old and i wont be needing money i put into the stock market for at least the next 10-15 years. Basically i dont mind letting my stocks sit idle and will keep investing without pulling out. My current portfolio is:\n\nETFS:-\n\nQQQ-20%\n\nVUG-10%\n\nVOO-20%\n\nSOXX-20% \n\nTOTAL ETF%= 70%\n\n&amp;#x200B;\n\nStocks:-\n\nDIS- 6%\n\nASTS- 4%\n\nSoFi- 3%\n\nSQ- 7%\n\nCRWD-5%\n\nCRM-5%\n\nTOTAL STOCK%=30%\n\n&amp;#x200B;\n\nAny advice on whether i should change things around or suggestions of other stocks/etfs would be greatly appreciated. Also pls let me know if my % allocations are alright. Thanks!",
        "subreddit": "StockMarket",
        "title": "New to investing so i would love to hear your feedback on my portfolio!",
        "url": "https://www.reddit.com/r/StockMarket/comments/q1k63c/new_to_investing_so_i_would_love_to_hear_your/",
        "created": 1633425520.0
    },
    {
        "author": "mike_oc23",
        "created_utc": 1633486381,
        "id": "q2ayen",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Ticker: ACN  \nCurrent Price: $325.12  \nDividend Yield: 1.08%  \nDividend Frequency: Paid Quarterly\n\n**Background**  \n[Accenture](https://www.accenture.com/us-en?c=acn_glb_brandexpressiongoogle_11607915&amp;n=psgs_1020&amp;&amp;c=ad_usadfy17_10000001&amp;n=psgs_Brand-%7c-US-%7c-Exact_accenture&amp;gclid=CjwKCAjw7--KBhAMEiwAxfpkWLS_UJeHUUiIaKtOXPfMbCM5iGXkVYNhXkr9H1ErSKEW9pc35OHVkRoCqkgQAvD_BwE&amp;gclsrc=aw.ds) is a multinational business services company that specializes in IT services. The company was founded in 1989 and is headquartered in Dublin, Ireland. Accenture has 624,000 employees, owns 7,900 patents worldwide, and rank among the [largest](https://www.marketbeat.com/stocks/sectors/business-services/) business service companies with a market cap over $200 billion. Accenture is a member of the [S&amp;P 100](https://markets.businessinsider.com/index/components/s&amp;p_100) and [Fortune Global 500](https://fortune.com/global500/2021/search/). Accenture's clients make up [91 of the Fortune Global 100 and more than three-quarters of the Fortune Global 500](https://newsroom.accenture.com/fact-sheet/), including key players such as Microsoft, SAP, Oracle, Salesforce, and Workday.\n\n**Financials**\n\n* Revenue: $50.53 Billion\n* Net Income: $5.91 Billion\n* Profit Margin: 11.69%\n* Total Cash: $8.17 Billion\n* Total Debt: $3.51 Billion\n* Current Ratio: 1.25\n* PE Ratio: 37.47\n* [More Key Statistics Here](https://finance.yahoo.com/quote/ACN/key-statistics?p=ACN)\n\n**Growth &amp; Dividends**  \n[Here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=true&amp;showYield=false&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is performance dating back to 2005 with dividends reinvested compared to the S&amp;P 500 index, and [here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=false&amp;showYield=true&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is with dividends held as income. The investor's dividend yield grew from 1.11% in 2005 to 12.15% in 2020. There was a dip in dividend income in 2019 when Accenture transitioned from semi annual dividends to quarterly payments. See [here](https://www.nasdaq.com/market-activity/stocks/acn/dividend-history) for dividend history. Accenture has a dividend payout ratio of around 40% showing signs of sustainability for future payments.",
        "subreddit": "stocks",
        "title": "Dividends Plus Growth - Accenture (ACN)",
        "url": "https://www.reddit.com/r/stocks/comments/q2ayen/dividends_plus_growth_accenture_acn/",
        "created": 1633515181.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633317202,
        "id": "q0x5kq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Sorry to be another person posting about $KPLT but this squeeze is going to last because there are 14 MILLION shares shorted. 12,000,000! Stocks NEED to be covered. 32%&gt; CTB. Insiders keep buying. New deal with Salesforce for their commerce cloud. Intagrated partner with $AFRM (AFFIRM),maybe Amazon",
        "url": "https://www.reddit.com/gallery/q0x5kq",
        "created": 1633346002.0
    },
    {
        "author": "prostockadvice",
        "created_utc": 1633485205,
        "id": "q2amno",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "We are officially in October and it is proving to be rather turbulent. Coming off of one of the worst days all year, the major indices did rebound and take back some of the losses. Today is a write up where I go through all the old alerts, push a reset, and create many new ones. \n\nIt was no surprise that we the S&amp;P had its first red month all year last month. The question is will our portfolios keep being drug down by inflation and debt ceiling woes. If you are not already, now is the time to dollar cost average on your long term positions, and pick yourself out some new mid term positions that you think will perform well in the winter months. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  First let's take a look at some of my favorites.\n\n**TQQQ** has given up a lot of ground since it's all time high on September 7th. It is now approaching the 180MA, and the RSI is really low. It could be a great time to average into this position. If you prefer options, a bounce of the 180 alerts has been set. \n\nhttps://preview.redd.it/6ceb8y1sjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3611585e424b757718c9dba3f0afefadb634c9a8\n\n **UPRO** is not as bad as **TQQQ**, and that is quite normal according to Trend Spider's seasonality. Usually this time of year, the Nasdaq does worse out of all the indices. Now we see that tech is getting hammered. I'd also DCA into this one.  \n\nhttps://preview.redd.it/vh23d1szjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0a31491eb4a487f24f2f872db5e11f32ca41e89e\n\n **UDOW** is probably a great pick up right now for your buy and hold portfolio. It is riding along the 180MA, and if you can get an entry there, start to DCA.  \n\nhttps://preview.redd.it/o66oyzrzjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3dc213a55397d60bda38aba21253948b96b66579\n\n **SOXL** is notorious in our community for money printing swings. I'd say it might have bottomed out of now. There seems to be a 50/50 chance over the past decade that SOXL is up/down in October. Since it is already down, I'd say grab some, and continue to as long as it is going down. Red day buy; green day hold. Let it run until mid November. Hope you are paying attention :D \n\nhttps://preview.redd.it/j6vay1szjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=514b94aa0482e335d9bb7f44031b54edef361497\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Crypto \n\n **CRO**, the native Crypto.com token and one of my favorites right now has made a wonderful recovery bounce off of the 180MA. It is now back at 18 cents. Don't sleep on this one. They are now the sponsors of the UFC and the Philadelphia 76ers. I think this is a 10x play. I think the right play here is buy what you can afford: $400, $4000 or $40000. Stake those in their app (for up to 14%apy), since it is a long term play anyways we don't need to use this money. After, you will unlock their metal Visa card. My recommendation is run all your monthly expenses through it and you'll be getting 2-5% back in **CRO** which you continue holding.  \n\nhttps://preview.redd.it/wowtpr22kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=6294fca8217fde87067615877a990b4f57565db3\n\n \n\n**BTC** has made a huge recovery this week, and if you are already diversified with BTC exposure congratulate yourself. If not, maybe its time to start considering it. If traditional equity markets are not doing well, money sometimes flows to crypto - and vice versa. \n\nhttps://preview.redd.it/4g8tbdb3kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=c1fcc81b846310ed2c490c7dd4498fc90d0cda68\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Alerts \n\n A **WMT** opportunity found by my VIP Discord members. First of all, the seasonality improves a lot in November and the RSI looks way to over sold. I like a bounce off of the the lower support of a paralell channel that it seems to be trading in. This could be a good chance for some EOY calls either now, or wait for bounce.  \n\nhttps://preview.redd.it/qztvc4h8kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=012816a5a8ba2a561beaadecb7a9fee4cc4d3b7a\n\n **XHB**, a homebuilders ETF, LEAPS look ripe for the picking. This would be a long term position with exposure to the US new homes sector, which I don't think will slow down any time soon.  \n\nhttps://preview.redd.it/d3sallk9kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=09d918825aedf4ff92ceb2917309b12ba69ccba8\n\n Here is an interesting opportunity for some puts on **CRM** I believe to have found. We are close to all time high, and the seasonality starts to suck going into December. I can't really say the exact point where we buy the puts, but I think maybe around $280. We can even buy vertical spreads for $270/$260 with a December expiration. \n\nhttps://preview.redd.it/kctpebkakqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=e3d15a26bfe10680a774553e53c78204b3a97a3e\n\n **NKE** has also taken a beating and will probably have decent holiday sales as always. Actually, this alert was already set and expired before it triggered. It is basically riding along the 180MA and the YTD VWAP. Could be a good pick up now, or wait for a confirmation bounce.  \n\nhttps://preview.redd.it/nu6sb4jbkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=d8f911359729ed6031498e5aae401a786bf2ff98\n\n Same with my **HD** alert. It triggered last week but I was on vacation and missed it. If you bought, you'd be making money. I'll be resetting the alerts for a VWAP bounce and trying again.  \n\nhttps://preview.redd.it/tb2uejeckqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=985ad4ea1a62d29579da96945a756cc0da8a614c\n\n I'm still liking these **SPOT** puts as I don't believe in the long term growth of this company. It seems like the resistance drawn out is true and is holding. If continues, there is an opportunity to arb calls and puts between the resistance and glass bottom (yellow). \n\nhttps://preview.redd.it/hcie2cgdkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=10f8bd58cebd73066512ce8e675a98095ac1cdae\n\n Still continue to play **DIS** on its yoyo like bounce on the glass bottom. Usually **DIS's** seasonality improves in the winter months, especially in November. I still like EOY calls, probably taking profit in November.  \n\nhttps://preview.redd.it/2lclpzaekqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=329098a02d6d7b241e153cb149a12cb84693ba8a\n\n It is interesting that this time, when BTC ran, **EBON** didn't. One of my highest conviction plays, I'll wait for the bounce down from the 50MA as usual. **EBON** is a crap company, with crap products, that industry insiders joke about.  \n\nhttps://preview.redd.it/ozpj252fkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3bb701f35e2d14a8945e771a8787425fc8698885\n\n **MCB** is a tricky play, but, like I thought, it is holding resistance. I think its a matter of time before it pulls back. If we see it break the resistance, then I'll cut. Go small here.  \n\nhttps://preview.redd.it/vf7usk4gkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=d18e08d1ea0c8c33cbfbf1fc788e3566e3ec7ffb\n\n **SBUX** is around major supports and has somewhat of a nice volume shelf propping it up. Seasonality is good for October and November as cold caffeine addicted shoppers go out and need warm pick-me-uppers. I like calls off of the volume shelf expiring EOY and taking profits possibly in November.  \n\nhttps://preview.redd.it/n2lkvt0hkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=bfe6ac15beda08ad064d92c429436c65b943e2f0\n\n Lastly for today, I still like **T** puts off of the 50MA. Another company that I don't believe in long term growth; this is a good opportunity to continue the ride down. I would keep positions small and take profits quick, although it seems that there is more than a 50% chance that month over month is negative.  \n\nhttps://preview.redd.it/rpqh90yhkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0dca69da6cd687c47ad06854a75b9fa5779f1ccd\n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n    Disclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.",
        "subreddit": "options",
        "title": "15 Excellent Options Set Ups for Q4",
        "url": "https://www.reddit.com/r/options/comments/q2amno/15_excellent_options_set_ups_for_q4/",
        "created": 1633514005.0
    },
    {
        "author": "TheBreadMakerr",
        "created_utc": 1634516264,
        "id": "qab71f",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I'm sure some of you have heard a little bit about the ORB Strategy whether that be through different online communities or educational content. This is a very simple, easy to use strategy that allows you to see when breakouts or breakdowns are happening on a specific stock. I am going to show you how the strategy works and how to use it as well as give you the studies to put on your ThinkorSwim charts, give you the scanners to scan for stocks that had a breakout or breakdown, and give you an easy to read column to add to your watchlist to see what stocks are breaking up or down. Let’s jump into it!\n\n### How It Works\n\nThere are several ways to trade this strategy but first let's talk real quick about how it works. The way the opening range strategy works is it takes the highest price of a stock within the first 30 minutes of the day and the low of the first 30 minutes of the day and draws lines for both. So let's breakdown a quick example. Say TSLA opens the day at $575, then within the first 30 minutes it has a high of $578 and a low of $571 within that first 30 minutes of the market being open. This strategy will draw a line at $278 and a line at $271 on your chart. Then you can play the chart multiple ways off of those lines, let’s take a look at the most common strategies.\n\nThe strategy will also create a grey box highlighting the first 30 minutes of the day. It will also draw a line at the \"midpoint\" or the middle of the opening range high and low.\n\nYou can check out the full article and other useful stock information here: [https://thebreadmakerr.com](https://thebreadmakerr.com)\n\n### Opening Range Breakout\n\n[TGT Orb Breakout Chart Example](https://preview.redd.it/psb4y7bsp3u71.jpg?width=1456&amp;format=pjpg&amp;auto=webp&amp;s=1e9c4b29019dc108da2c1f3d126ff4c5afc04324)\n\nAs you can see from the chart above, all the lines and data are already drawn out for you. You can also see the stock break above the red line, that would ideally be your entry for a long or call position. You can then see the stock has a nice run-up after the breakout. This is the most common way to play the ORB strategy.\n\n### Opening Range Breakdown\n\n&amp;#x200B;\n\n[CRM Orb Breakdown Chart Example](https://preview.redd.it/zrqpxizwp3u71.jpg?width=1456&amp;format=pjpg&amp;auto=webp&amp;s=69695c894ee8168537b4f6e4f652c3ec171df4ae)\n\nThe second most common is the Opening Range Breakdown, this is essentially the opposite of the breakout, you are watching for the stock to break the bottom ORB line and then you would enter a short or put position and as you can see the stock continues to dive lower.\n\n### Opening Range - Support/Resistance\n\n[AIG Orb Support\\/Resistance Chart Example](https://preview.redd.it/n0tutez4q3u71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=a4dfebb4e620b2cbdbcda3cce62e5381a55adda1)\n\nThe final way to play this is as an intraday Support/Resistance channel. AIG chart above is a good example of that. You can see how the stock just traded a little sideways right on that bottom ORB and then bounced up off of it. You can play this the reverse way as well if the stock trades sideways up at the top of the ORB.\n\n***Important Tips:***\n\n* When playing this strategy make sure you are utilizing the 5 minute chart.\n* When using the breakout or breakdown strategy, DO NOT enter the trade until the 5 minute candle has closed above or below the top or bottom orb.\n\n### Scanners\n\nI will also provide a scanner that will scan for all the stocks that are above the top ORB as well as all the stocks that are below the bottom ORB. This is great because maybe you don't have a lot of stocks on your watchlist, well this will scan the whole market for stocks and pull all the ones that have a breakout or breakdown. The possibilities of finding a trade everyday are endless! This scanner always finds a bunch of stocks everyday for you to trade.\n\nHere are all the studies you can add to your ThinkorSwim platform to get started with trading the ORB strategy:\n\n#### Opening Range Breakout Chart Study:\n\n[**http://tos.mx/U3wNJQ**](http://tos.mx/U3wNJQ)\n\n**Opening Range Breakout(Above Top ORB) Scanner:**\n\n[**http://tos.mx/OfhG4K**](http://tos.mx/OfhG4K)\n\n**Opening Range Breakdown(Below Bottom ORB) Scanner:**\n\n[**http://tos.mx/yHriZl**](http://tos.mx/yHriZl)\n\nHopefully you find this information helpful and it makes trading easier for you. If you found this information helpful or have any questions, feel free to reach out to me on Twitter @ TheBreadMakerr.",
        "subreddit": "pennystocks",
        "title": "Trading the Opening Range Breakout (ORB) Strategy",
        "url": "https://www.reddit.com/r/pennystocks/comments/qab71f/trading_the_opening_range_breakout_orb_strategy/",
        "created": 1634545064.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633407733,
        "id": "q1n9zy",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "AS REQUESTED - $KPLT: Untapped Short Squeeze Data Galore. CTB MAX 75%, Avg 37%. Dark pool = 55% of volume. FTD : Heavy, AMZN + AFRM rumor, New partnership with Salesforce, 96m Outstanding shares, .5 days to cover. Multiple sources of info, but relatively close data.",
        "url": "https://www.reddit.com/gallery/q1n9zy",
        "created": 1633436533.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "created_utc": 1634165940,
        "id": "q7mtx7",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " Gentlemen, I hope you have been making the most of the opportunity my dear friend, Moscow Mitch has provided you. ie I **HOPE YOU BOUGHT THE DIP F%\\*%\\*#\\*@**\n\nWhile I still have your attention, I would like to introduce you to a company that me and some fellows have been bag holding (in the red) for a while.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9ecowds0sat71.png?width=1811&amp;format=png&amp;auto=webp&amp;s=b4a5ed3a19fbed01166b3060210d4219f1129aea\n\n[ME - Bagholder 50k Warrants](https://preview.redd.it/rbxc7fs0sat71.png?width=515&amp;format=png&amp;auto=webp&amp;s=84f504b352b09bc6db00be73bec73d32896f9034)\n\n# Payoneer vs PayPal\n\n&gt;*Payoneer, the Paypal for Shithole Developing Countries*\n\nPayoneer is Paypal for B2B global commerce, particularly outside North American and Europe. The company provides B2B services for millions of SMB and enterprises around the world\n\nThe growth of Payoneer’s global network included a move into India in April 2016, following a partnership with Pune-based IndusInd Bank and expressions of interest in its services from more than 10,000 freelancers and small businesses across the country.\n\n2018 PayPal study suggest that India’s freelancers represent around one quarter of the world’s gig workforce.\n\n**In August 2019, Payoneer announced a year-on-year increase of 400% in its customer base and a threefold increase in payment volumes processed in India.**\n\n*“PayPal says to shut domestic payments business in India” \\~ Reuters*\n\nNEW DELHI (Reuters) - PayPal Holdings Inc will wind down its domestic payments business in India from April 1,2021 the company said in a statement on Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9rrj0833sat71.png?width=1743&amp;format=png&amp;auto=webp&amp;s=ad4715120c225a20fd5da5d8da4fb89bbc4b83b5\n\n&amp;#x200B;\n\nhttps://preview.redd.it/uowbl3v8sat71.png?width=1759&amp;format=png&amp;auto=webp&amp;s=a560d2142e3760e7d89d193d6b62955c6893bed8\n\nThe ideal customer is a small but growing SMB doing business all over the world which needs currency, compliance and business services. Payoneer is an obvious candidate to handles these needs given its global network.\n\n· Payoneer offers vendors the ability to move money with a U.S. bank account and pay suppliers, without having to deal with too many banking hurdles or red tape.\n\n· A lot of freelancers on Upwork.com use Payoneer because many of them live in countries that Upwork.com can't wire money to.\n\n· Once vendors receive funds into their Payoneer account they can either withdraw the cash using their Payoneer provided Master Card or do a direct bank transfer from Payoneer to their local bank. Usually funds arrive within 1-2 business days.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/o40qgu9asat71.png?width=1764&amp;format=png&amp;auto=webp&amp;s=d5596b4dd2c17be9682661b158ef44b1c333e3cd\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins.\n\nSay a consumer wants to rent an airbnb. They use a credit card (or other payment method) to pay airbnb, a payment gateway facilitates payment acceptance. The payment is then processed and Airbnb ends up with the money from the transaction. Airbnb has now gathered cash through its acquirers (e.g., Adyen, ACI). Airbnb now needs to distribute funds to its SMB sellers. Airbnb uses payoneer to disburse funds to sellers. From this example, you can see Payoneer isn't competing with companies like Adyen or other acquirers/ processors, even though they are processing payments.\n\nPayoneer signs up individual sellers, which allows the sellers to use payoneer across platforms (e.g., facebook marketplace and amazon). Hyperwallet (owned by PayPal) is one of their competitors, but Hyperwallet operates completely differently, they sign up users via the platform, but this means you can't use hyperwallet for your business on both amazon and fb marketplace without going through the onboarding process again. Given the trend towards SMB sellers operating across multiple marketplaces, this is a huge benefit for payoneer, and makes PayPal's offering a lot less competitive. It also means Payoneer owns the seller relationship in a way that PayPal doesn't do as effectively, and makes it easier for them to package other offerings (e.g., working capital). These other offerings provide a two-fold benefit - their customer relationships become stronger, so revenue is seen as more recurring and investors will pay a higher multiple; and they'll make more money per customer.\n\nMy view is that Payoneer should see an S-type growth curve, where they'll hit a critical mass of users and see exponential growth, like cashapp, or venmo. Their investor presentation projects 25% revenue growth over the next couple years, I think this is super conservative, especially considering that 25% growth rate doesn't account for the two travel related marketplaces that got screwed by covid. Once they hit that critical mass of users, they'll pop off, sales &amp; marketing expenses will drop, and they'll become profitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4f5p7p4bsat71.png?width=1556&amp;format=png&amp;auto=webp&amp;s=8fdc4fe48c2b315e52e72f9f2298774b25797e44\n\nThe company’s focus on investing for future services is actually what gets me most excited as it may ward off near-term investor interest and improves its competitive position. It’s also a sign of a mature management team. The opportunity to provide additional services such as working capital, compliance and tax services seems like an obvious strategic move to drive growth. Specifically, working capital is far and away the most important service and something SMBs are desperate for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qf2jitgcsat71.png?width=1664&amp;format=png&amp;auto=webp&amp;s=fa1c99eea1a28ffd6daea019c3487fd5cb81d491\n\nWho are their customers and where are they know? 5 million businesses in 190 countries. Customers include Amazon, Wish, Lazada (owned by Alibaba) Shopee, and Ebay. Weird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2pnuk7qdsat71.png?width=1631&amp;format=png&amp;auto=webp&amp;s=9b8660ceffe034f8b7498e9ecbbcff125319603f\n\nB2B global marketplace. The attractiveness of FinTech can be summarized in a few words, namely, “scale” and “network effects”. From the metrics Payoneer shared, it looks like they’re benefitting from these dynamics. Analysts estimate the global B2B market at tens of trillions $ and cross-border payments at $300bn. Obviously the pandemic only accelerated these trends. (From the presentation, it looks like company B2B AR/AP volume more than doubled at 140% in 2020 although the CFO later cited a 53% increase in volumes so not sure exactly how to interpret that.)\n\nVolume and customer growth drives revenues. Volumes grew over 53% in 2020 (67% adjusted for the pandemic) and are expected to grow at 44% and 33% in 2021 and 2022, respectively, which translates into 25% annual revenue growth per year for the next two years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/od34rmcfsat71.png?width=1721&amp;format=png&amp;auto=webp&amp;s=ccf0f50c53f232f0aba3f9fa8c991bf7ca57bebf\n\nThe benefits of network effects cannot be overstated as Paypal has proven. As a company acquires more customers, the value of its network increases. Payoneer’s business model leverages this same dynamic. Moreover, its network would be very difficult to replicate. The company’s global platform includes over 80 banks and clearing partners in over 100 countries. The company also provides customers data about its transactions, which I believe will be increasingly useful and sticky.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/v11jgevfsat71.png?width=1797&amp;format=png&amp;auto=webp&amp;s=fa74e5f35fab8445965b808f51c9ffc127c9b996\n\nWhat do I think the future holds for Payoneer? I actually think there are several exits for this company.\n\n**Growth:**\n\nNote that Payoneer currently doesn’t do B2C, hence it may be quite common for retail to never even have heard of it, unless they are a business or in the gig economy. That is one of the problems for the stock, no one has heard of it (yet) because it works quietly behind the scenes. Given enough funding, who knows, Payoneer may well expand to B2C. Alibaba initially started as B2B as well but has since expanded to B2C (Taobao).\n\nWe just need Payoneer to be 5% of PayPal (ie. $15B market cap) in order for stock price to be in the $30-$40 range. ($6B market cap corresponds to around $13-$15 stock price.)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wmk4m3ahsat71.png?width=1748&amp;format=png&amp;auto=webp&amp;s=2750ff0f2636323c20a686f11243fc2af5fbd085\n\n\\*\\*Acquisition:\\*\\*Large international payments processer buys them. Could be Paypal, Square, Stripe, First Data, etc. consolidation WILL happen in this space and I think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n\nWildcard: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be storage, and legal transactions then it will be financial transaction. They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\nThis is not financial advice, i am not a financial advisor. I have a long position with the warrants that i purchased in February and are therefore in the red.",
        "subreddit": "wallstreetbets",
        "title": "Payoneer ($PAYO) - Bet on Emerging Markets recovering and ready to fly.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q7mtx7/payoneer_payo_bet_on_emerging_markets_recovering/",
        "created": 1634194740.0
    },
    {
        "author": "jeff9331",
        "created_utc": 1634297824,
        "id": "q8mlwn",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Katapult is a company provides BNPL options for non-prime E-commerce customers. Katapult is the only pure-play financing platform dedicated to E-commerce\n\nWhy i think they are the most undervalued BNPL stock in the market?\n\n* When compare katapult to other growth stock in BNPL space. For today's price, it is just trading \\~2x revenue vs the BNPL industry standard 28x revenue. They have a good growth record from 2018\\~2020 shown as below.\n\nhttps://preview.redd.it/a17yuix4blt71.png?width=950&amp;format=png&amp;auto=webp&amp;s=4fd1b5e7262b6f7d364920f9b834a15f45df7a37\n\n* They are the only player in the nonprime and e-commerce area. and nonprime customers are the most underserved customers in US.\n\nhttps://preview.redd.it/3l59fforblt71.png?width=950&amp;format=png&amp;auto=webp&amp;s=9bcdcbe1db74438faf24a9092e33c6bfab99df2c\n\n* There is a waterfall partnership for katapult to gain customers from Affirm, when customers are denied financing with Affirm. So recent great partnerships of Affirm with \\[Amazon, Target and Walmart\\] could translate a big gain to katapult.\n* They have \\~100 millions in hand and have been profitable in 2020\n\nhttps://preview.redd.it/drmb3cikhlt71.png?width=950&amp;format=png&amp;auto=webp&amp;s=98d792f0b25936c31f5433f87a24e99f043cae42\n\n* Recent great direct partnership with Salesforce and Adobe \n\n[https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html](https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html)\n\n[https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html](https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html)\n\nThe reason they went down from 10$ to $3 when they removed the full year guidance in their last earning call.\n\nBut with the insiders kept buying around $3.4\\~4.42 range right after that massive sell-off,  i think it is just way overreacting to the earning call. Right now should be a great buying opportunity when the stock is just trading \\~$5 range, when they are about to report their Q3 result on 11/9.\n\nhttps://preview.redd.it/wg4n3gwmelt71.png?width=2116&amp;format=png&amp;auto=webp&amp;s=6d1c5343797008ba217cb288b1f1024b5407e489\n\nOne of the main concern people worry about this stock in their last Q2 earning is that their LTO origination was down 17% YOY. but i think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is one time surge only which made their Q2 2021 looks really bad, but when compared to Q1 2021 is still up 1%, so it is actually not bad.\n\nhttps://preview.redd.it/wtljix8qklt71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=aee83ec73add7b87618f58ab7f24fb77706141f2\n\nAnd it doesn't not only have great *fundamentals, it also has great short squeeze potential.*\n\n26.18% float shorted \n\nhttps://preview.redd.it/p5dy35k9glt71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=1492b7db208fb9c28566f467f4ee5b0fd760fa14\n\nThe shorts have been trying to push the price down so that 19316 10/15 6$ call options can expire worthless today. \n\nhttps://preview.redd.it/wl7oqei8glt71.png?width=2096&amp;format=png&amp;auto=webp&amp;s=a850428ff80dd5100e9c85e78977714fb0705337\n\nbut with the lots of Fail to deliver going into power this week, i think $KPLT have really high chance taking off today. \n\nhttps://preview.redd.it/j2lgu7onllt71.png?width=2389&amp;format=png&amp;auto=webp&amp;s=b893d842eb1c6cff993ce7fdcdfed92dc62ae656\n\nhttps://preview.redd.it/w0bx93ntglt71.png?width=960&amp;format=png&amp;auto=webp&amp;s=c4c2e88fd61b50598cb0ffe46076be9d2fc044ac\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPosition: 200 11/19 $6 call",
        "subreddit": "wallstreetbets",
        "title": "(Nonprime version of $AFRM) $KPLT Katapult is dirty cheap right now, the most undervalued stock in BNPL space",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q8mlwn/nonprime_version_of_afrm_kplt_katapult_is_dirty/",
        "created": 1634326624.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "created_utc": 1634302124,
        "id": "q8nqap",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I would like to introduce you to a company that me and some fellows have been bag holding (in the red) for a while.\n\n📷📷\n\nhttps://preview.redd.it/2wrkh4n91mt71.png?width=1811&amp;format=png&amp;auto=webp&amp;s=2aa10d262452a88a375eac5bfc78dffccccde827\n\n[ME - Bagholder 50k Warrants](https://preview.redd.it/2051dlo91mt71.png?width=515&amp;format=png&amp;auto=webp&amp;s=27f0a8bda933ef51f2a34961cc50f5cfa460cd87)\n\n&amp;#x200B;\n\n# Payoneer vs PayPal\n\n&gt;*Payoneer, the Paypal for Shithole Developing Countries*\n\nPayoneer is Paypal for B2B global commerce, particularly outside North American and Europe. The company provides B2B services for millions of SMB and enterprises around the world\n\nThe growth of Payoneer’s global network included a move into India in April 2016, following a partnership with Pune-based IndusInd Bank and expressions of interest in its services from more than 10,000 freelancers and small businesses across the country.\n\n2018 PayPal study suggest that India’s freelancers represent around one quarter of the world’s gig workforce.\n\n**In August 2019, Payoneer announced a year-on-year increase of 400% in its customer base and a threefold increase in payment volumes processed in India.**\n\n*“PayPal says to shut domestic payments business in India” \\~ Reuters*\n\nNEW DELHI (Reuters) - PayPal Holdings Inc will wind down its domestic payments business in India from April 1,2021 the company said in a statement on Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2jpn0g1g1mt71.png?width=1743&amp;format=png&amp;auto=webp&amp;s=8a1a64476a3317afae3108fef508fcbb30e82334\n\nhttps://preview.redd.it/dznwfh1g1mt71.png?width=1759&amp;format=png&amp;auto=webp&amp;s=f5124881de74bd5776ffa602093e2fb4b0dc1a33\n\nThe ideal customer is a small but growing SMB doing business all over the world which needs currency, compliance and business services. Payoneer is an obvious candidate to handles these needs given its global network.\n\n· Payoneer offers vendors the ability to move money with a U.S. bank account and pay suppliers, without having to deal with too many banking hurdles or red tape.\n\n· A lot of freelancers on Upwork.com use Payoneer because many of them live in countries that Upwork.com can't wire money to.\n\n· Once vendors receive funds into their Payoneer account they can either withdraw the cash using their Payoneer provided Master Card or do a direct bank transfer from Payoneer to their local bank. Usually funds arrive within 1-2 business days.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ursv3xni1mt71.png?width=1764&amp;format=png&amp;auto=webp&amp;s=416a02f6f69d40160a25368aa5b52412a43dc03f\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins.\n\nSay a consumer wants to rent an airbnb. They use a credit card (or other payment method) to pay airbnb, a payment gateway facilitates payment acceptance. The payment is then processed and Airbnb ends up with the money from the transaction. Airbnb has now gathered cash through its acquirers (e.g., Adyen, ACI). Airbnb now needs to distribute funds to its SMB sellers. Airbnb uses payoneer to disburse funds to sellers. From this example, you can see Payoneer isn't competing with companies like Adyen or other acquirers/ processors, even though they are processing payments.\n\nPayoneer signs up individual sellers, which allows the sellers to use payoneer across platforms (e.g., facebook marketplace and amazon). Hyperwallet (owned by PayPal) is one of their competitors, but Hyperwallet operates completely differently, they sign up users via the platform, but this means you can't use hyperwallet for your business on both amazon and fb marketplace without going through the onboarding process again. Given the trend towards SMB sellers operating across multiple marketplaces, this is a huge benefit for payoneer, and makes PayPal's offering a lot less competitive. It also means Payoneer owns the seller relationship in a way that PayPal doesn't do as effectively, and makes it easier for them to package other offerings (e.g., working capital). These other offerings provide a two-fold benefit - their customer relationships become stronger, so revenue is seen as more recurring and investors will pay a higher multiple; and they'll make more money per customer.\n\nMy view is that Payoneer should see an S-type growth curve, where they'll hit a critical mass of users and see exponential growth, like cashapp, or venmo. Their investor presentation projects 25% revenue growth over the next couple years, I think this is super conservative, especially considering that 25% growth rate doesn't account for the two travel related marketplaces that got screwed by covid. Once they hit that critical mass of users, they'll pop off, sales &amp; marketing expenses will drop, and they'll become profitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fpkfaeej1mt71.png?width=1556&amp;format=png&amp;auto=webp&amp;s=271bbdbdf04feb827fb0328d559a6c35f712fe83\n\nThe company’s focus on investing for future services is actually what gets me most excited as it may ward off near-term investor interest and improves its competitive position. It’s also a sign of a mature management team. The opportunity to provide additional services such as working capital, compliance and tax services seems like an obvious strategic move to drive growth. Specifically, working capital is far and away the most important service and something SMBs are desperate for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/46ucpp0l1mt71.png?width=1664&amp;format=png&amp;auto=webp&amp;s=fa8f9ebe61044697e9d25ce87d60dbfff21ac5b4\n\nWho are their customers and where are they know? 5 million businesses in 190 countries. Customers include Amazon, Wish, Lazada (owned by Alibaba) Shopee, and Ebay. Weird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8xllcnxl1mt71.png?width=1631&amp;format=png&amp;auto=webp&amp;s=cd07935b0b199fd61526d416977a3356edeee74a\n\nB2B global marketplace. The attractiveness of FinTech can be summarized in a few words, namely, “scale” and “network effects”. From the metrics Payoneer shared, it looks like they’re benefitting from these dynamics. Analysts estimate the global B2B market at tens of trillions $ and cross-border payments at $300bn. Obviously the pandemic only accelerated these trends. (From the presentation, it looks like company B2B AR/AP volume more than doubled at 140% in 2020 although the CFO later cited a 53% increase in volumes so not sure exactly how to interpret that.)\n\nVolume and customer growth drives revenues. Volumes grew over 53% in 2020 (67% adjusted for the pandemic) and are expected to grow at 44% and 33% in 2021 and 2022, respectively, which translates into 25% annual revenue growth per year for the next two years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/485pmwpm1mt71.png?width=1721&amp;format=png&amp;auto=webp&amp;s=c8daa57cf167cfc5c1b01a8aa204a423591962be\n\nThe benefits of network effects cannot be overstated as Paypal has proven. As a company acquires more customers, the value of its network increases. Payoneer’s business model leverages this same dynamic. Moreover, its network would be very difficult to replicate. The company’s global platform includes over 80 banks and clearing partners in over 100 countries. The company also provides customers data about its transactions, which I believe will be increasingly useful and sticky.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kvevrmgn1mt71.png?width=1797&amp;format=png&amp;auto=webp&amp;s=8cdb86125b0e06bde979bcaf48804903e0de4d98\n\nWhat do I think the future holds for Payoneer? I actually think there are several exits for this company.\n\n**Growth:**\n\nNote that Payoneer currently doesn’t do B2C, hence it may be quite common for retail to never even have heard of it, unless they are a business or in the gig economy. That is one of the problems for the stock, no one has heard of it (yet) because it works quietly behind the scenes. Given enough funding, who knows, Payoneer may well expand to B2C. Alibaba initially started as B2B as well but has since expanded to B2C (Taobao).\n\nWe just need Payoneer to be 5% of PayPal (ie. $15B market cap) in order for stock price to be in the $30-$40 range. ($6B market cap corresponds to around $13-$15 stock price.)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3cqivcao1mt71.png?width=1748&amp;format=png&amp;auto=webp&amp;s=5cc3a4a9e6fe91197b98a14a09dc2f053fd8ce0d\n\n\\*\\*Acquisition:\\*\\*Large international payments processer buys them. Could be Paypal, Square, Stripe, First Data, etc. consolidation WILL happen in this space and I think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n\nWildcard: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be storage, and legal transactions then it will be financial transaction. They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\nThis is not financial advice, i am not a financial advisor. I have a long position with the warrants that i purchased in February and are therefore in the red.",
        "subreddit": "wallstreetbets",
        "title": "Payoneer ($PAYO) - Emerging Markets are BACK!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q8nqap/payoneer_payo_emerging_markets_are_back/",
        "created": 1634330924.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1633728774,
        "id": "q47cz2",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Friday, October 8, 2021**\n\nStocks closed the day modestly in the red but capped off the first week of October in the green as market participants digested the Labor Department’s September Job Report. The move to the upside earlier in the week came after Senate came to an agreement to raise the debt ceiling into early December, helping avoid a catastrophic government default. The S&amp;P 500 (SPY) closed the day 0.18% lower but the week 1.12% higher, the Nasdaq (QQQ) closed the day 0.5% lower but the week 0.69% higher, and the Dow Jones (DIA) closed the day even and the week 1.41% higher.\n\nAfter the first negative month all year, the move higher in equities came after the Senate came to an agreement to raise the debt ceiling until early December, preventing a catastrophic government that would’ve taken place around Oct 18. On Thursday, the chamber voted to raise the debt limit by $480 billion. \n\nWith concerns over a government default dissipating, market participants turned their attention to the latest monthly jobs report from the Labor market, which showed the second consecutive month of payroll gains greatly lagging behind estimates. Non-farm payrolls rose by only 194,000 in September versus the 500,000 expected. The unemployment rate fell more than expected to 4.8%, though this positive development came alongside a disappointing drop in the labor force participation rate to 61.6%, versus 61.7% in August. And the size of the civilian labor force actually contracted in September, with the gap between the size of the labor force in February 2020 and last month topping 3 million. \n\nThough employers added just 194,000 jobs in September, the economy has now regained half of the jobs deficit it faced in December, compared with pre-pandemic employment levels. Fed Chair Jerome Powell said last month that he'd only need to see a \"decent\" September U.S. jobs report to be ready to begin to taper in November. It is very likely the tapering of quantitative easing will be announced this month and commence in November. \n\nFriday's jobs report stood in stark contrast to other, stronger-than-expected data on the state of the labor market in the U.S. New weekly jobless claims came in at their second-lowest since March 2020. Here are the numbers \n\n* **Initial unemployment claims:** 326,000 vs. 348,000 expected and an upwardly revised 364,000 during prior week\n* **Continuing claims:** 2.714 million vs. 2.766 million expected and an upwardly revised 2.811 million during prior week \n\n**Highlights**\n\n* The[ Organisation for Economic Cooperation and Development said Friday that it reached a deal ](https://finance.yahoo.com/news/global-minimum-corporate-tax-rate-162842722.html)among 136 countries to ensure major companies pay a minimum corporate tax rate of 15%. \"The landmark deal, agreed by 136 countries and jurisdictions representing more than 90% of global GDP, will also reallocate more than USD 125 billion of profits from around 100 of the world’s largest and most profitable MNEs to countries worldwide, ensuring that these firms pay a fair share of tax wherever they operate and generate profits,\" the OECD said in a statement\n* Facebook (FB) said some users were once again having trouble accessing its product on Friday, another disruption following the hours-long one earlier this week and another blow to the already beleaguered company. “We’re aware that some people are having trouble accessing our apps and products,” Facebook [said in a post](https://twitter.com/Facebook/status/1446556732977778695) on Twitter. “We’re working to get things back to normal as quickly as possible and we apologize for any inconvenience.” \n* Elon Musk announced Tesla is moving its headquarters from Silicon Valley to Austin, Texas. He said that Tesla plans to expand its activities in California but that the company’s ability to scale up in the San Francisco Bay Area is limited.\n* EU antitrust regulators are following up on a complaint by Slack Technologies, which is owned by Salesforce (CRM) by asking Microsoft's rivals if its Teams app integrated with its Office product is anti-competitive. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AON target raised by Wells Fargo from $306 to $321 at Ovoverweight. Stock currently around $294\n* Caesars Entertainment (CZR) target raised by Stifel Nicolaus from $130 to $138 at Buy. Stock currently around $114\n* LPL Financial (LPLA) target raised by Morgan Stanley from $202 to $208 at Overweight. Stock currently around $167\n* Merck (MRK) target raised by Barclays from $87 to $92 at Overweight. Stock currently around $80\n* Charles Schwab (SCHW) target raised by Morgan Stanley from $86 to $97 at Overweight\n* Atlassian (TEAM) target raised by Mizuho from $370 to $440 at Buy. Stock currently around $390\n* Tesla (TSLA) target raised by Canaccord Genuity from $768 to $940 at Buy. Stock currently around $785\n* Warner Music Group (UMG) target raised by Morgan Stanley from $46 to $53 at Overweight. Stock currently around $45\n\n“The secret to getting started is to quit talking and start doing” - Walt Disney",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, October 8, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q47cz2/here_is_a_market_recap_for_today_friday_october_8/",
        "created": 1633757574.0
    },
    {
        "author": "BestbuyBull",
        "created_utc": 1634315274,
        "id": "q8s0ly",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "$QFIN Best Discount Value &amp; Growth Buy amongst 99.99% of $NASDAQ. 3.99 PE, Virtually Debt Free, EPS :  $5.27 TTM  ,  Huge Cash : $1.21 Bil (7.83 RMB) ,  Profit Margin : 62.61 %  Net income increased by 76.6% . Book Value Per Share (mrq) 81.38 RMB . Consistent Profitability &amp; Growth every Quarter . $200 Mil Shares Buyback. $TIGR, $FUTU, $QFIN, $GME, $TSLA, $NIO, $F, $BABA, $AMZN ,$CRM, $AAPL, $MSFT, $GE not even Closer on Value. Similar $UPST trading at $393 ( 427 PE ) with Fundamentals not even closer to $QFIN. \n\nBenjamin Graham Value Formula : \n\nV= EPS\\*(8.5+2g)\n\nQFIN Value  = 5.27 \\* (8.5 + 2\\*0.15)  =  $46.37 \n\nCurrent Price  : $20.57 \n\nQFIN will sky rocket to $25  to $30 within days just based on its Fundamentals. \n\n&amp;#x200B;\n\nIts time to load QFIN before it sky rockets or a Short Squeeze is triggered. \n\nSuper Bullish on 360 DigiTech, Inc. (QFIN).",
        "subreddit": "wallstreetbets",
        "title": "$QFIN Best Deep Value Buy in 99.99 % of Nasdaq : 3.99 PE , Vir Debt Free, 62% Profit Margin . Show be Better if u can",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q8s0ly/qfin_best_deep_value_buy_in_9999_of_nasdaq_399_pe/",
        "created": 1634344074.0
    },
    {
        "author": "RelativeSquare0",
        "created_utc": 1634236316,
        "id": "q85qpx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Honestly I’m not even sure about $XIGM but the more it drops the more I feel like at SOME POINT it should go up. Or not. And that's the point. I'm deep in it and I can't stop checking. Need advice or maybe some analysis (I’m not good at it). \n\n**Things that give me hope** and I think it will start to rise: \n\n* When they will announce revenue, promised in Q3-Q4, because their financials and zero debt are supposed to look good; \n* When they will release iAgent app (testing with clients) because they have nice patents or it, it’s in development, it’s potentially a good CRM competitor that will solve a lot of problems (at least that businesses face in Canada now); \n* When they will release the SME ready-to-use version of the Xigem Platform (iAgent’s other name) because they will get more media attention and things like that; \n* When they’ll gain volume or go big on some news, they already tripled in the past once, after a similar drop, but it was in the start. \n\n**Things that don’t give me hope:** \n\nTo keep it short: this, starting in September. \n\nhttps://preview.redd.it/ihslbn8blgt71.png?width=837&amp;format=png&amp;auto=webp&amp;s=81813bbeb5c349d6b31f864ec41b14ff61698bf3\n\n**MAYBE** the drop is coming from their OTC affair that ended with them leaving it. Bad timing, now things will go up. Maybe. \n\n**MAYBE** it’s at the bottom now and I will hate myself for not spending my kids college money on it now somewhere in December or deeper in Q4. Doubt, but still. \n\n**MAYBE** I should’ve sold it long ago and none of the catalysts I see will play out. Maybe. Doubt, again.\n\nLike I said — not even sure about it and seriously lack patience, admit it. Potentially a good long game but all the red days fill my heart with doubt.",
        "subreddit": "pennystocks",
        "title": "Xigem Technologies $XIGM - turning point and doubt",
        "url": "https://www.reddit.com/r/pennystocks/comments/q85qpx/xigem_technologies_xigm_turning_point_and_doubt/",
        "created": 1634265116.0
    },
    {
        "author": "Tomkila",
        "created_utc": 1633364187,
        "id": "q18pbd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "“Subscription/Recurring Billing Management Market Research Report by Industry, by Deployment, by Payment Mode, by Region - Global Forecast to 2025 - Cumulative Impact of COVID-19”\nTweet this\nThe Global Subscription/Recurring Billing Management Market size was estimated at USD 5,122.88 Million in 2020 and expected to reach USD 5,941.43 Million in 2021, at a Compound Annual Growth Rate (CAGR) 16.02% to reach USD 10,772.14 Million by 2025.\n\nCompetitive Strategic Window:\n\nThe Competitive Strategic Window analyses the competitive landscape in terms of markets, applications, and geographies to help the vendor define an alignment or fit between their capabilities and opportunities for future growth prospects. It describes the optimal or favorable fit for the vendors to adopt successive merger and acquisition strategies, geography expansion, research &amp; development, and new product introduction strategies to execute further business expansion and growth during a forecast period.\n\nFPNV Positioning Matrix:\n\nThe FPNV Positioning Matrix evaluates and categorizes the vendors in the Subscription/Recurring Billing Management Market based on Business Strategy (Business Growth, Industry Coverage, Financial Viability, and Channel Support) and Product Satisfaction (Value for Money, Ease of Use, Product Features, and Customer Support) that aids businesses in better decision making and understanding the competitive landscape.\n\nMarket Share Analysis:\n\nThe Market Share Analysis offers the analysis of vendors considering their contribution to the overall market. It provides the idea of its revenue generation into the overall market compared to other vendors in the space. It provides insights into how vendors are performing in terms of revenue generation and customer base compared to others. Knowing market share offers an idea of the size and competitiveness of the vendors for the base year. It reveals the market characteristics in terms of accumulation, fragmentation, dominance, and amalgamation traits.\n\nThe report provides insights on the following pointers:\n\n1. Market Penetration: Provides comprehensive information on the market offered by the key players\n\n2. Market Development: Provides in-depth information about lucrative emerging markets and analyze penetration across mature segments of the markets\n\n3. Market Diversification: Provides detailed information about new product launches, untapped geographies, recent developments, and investments\n\n4. Competitive Assessment &amp; Intelligence: Provides an exhaustive assessment of market shares, strategies, products, certification, regulatory approvals, patent landscape, and manufacturing capabilities of the leading players\n\n5. Product Development &amp; Innovation: Provides intelligent insights on future technologies, R&amp;D activities, and breakthrough product developments\n\nThe report answers questions such as:\n\n1. What is the market size and forecast of the Global Subscription/Recurring Billing Management Market?\n\n2. What are the inhibiting factors and impact of COVID-19 shaping the Global Subscription/Recurring Billing Management Market during the forecast period?\n\n3. Which are the products/segments/applications/areas to invest in over the forecast period in the Global Subscription/Recurring Billing Management Market?\n\n4. What is the competitive strategic window for opportunities in the Global Subscription/Recurring Billing Management Market?\n\n5. What are the technology trends and regulatory frameworks in the Global Subscription/Recurring Billing Management Market?\n\n6. What is the market share of the leading vendors in the Global Subscription/Recurring Billing Management Market?\n\n7. What modes and strategic moves are considered suitable for entering the Global Subscription/Recurring Billing Management Market?\n\nMarket Dynamics\n\nDrivers\n\nRising Penetration of Electronic Media and Devices Coupled with Advanced Subscription &amp; Billing Software\nGrowing Demand for Integrated Subscription and Billing Platform\nIncreasing Customer Awareness and Subscription Base\nGrowing Adoption of Subscription and Billing Solutions across Various Industries\nRestraints\n\nComplex Customization &amp; ROI Risk for Businesses and Customer Concern Regarding Security\nOpportunities\n\nScalability of SaaS Business Model\nUpgradation of Legacy System and Scalability Associated with SaaS Business Model\nAdoption of Emerging Technologies and the Economic Growth of Countries such as India and China\nThe Need to Systemize Management is Facilitated by Integration of Back-End Systems\nChallenges\n\nLimited Technical Skills and Expertise\nAdvanced Cost Associated with System Transformation\nCompanies Mentioned\n\n2Checkout.com, Inc. by VeriFone Holdings, Inc.\nActivePlatform\nAmazon.com, Inc.\nAria Systems, Inc.\nBluSynergy\nBraintree by PayPal Holdings, Inc.\nCerillion PLC\nCleverbridge AG\nConga\nDXC Technology Company\nFastSpring\nFreshBooks\nLogiSense Corporation\nOracle Corporation\nRecurly, Inc.\nSalesforce.com, Inc.\nSAP SE\nStripe\nTransverse, LLC\nZoho Corporation Pvt. Ltd.\nZuora, Inc.",
        "subreddit": "StockMarket",
        "title": "Insights on the Subscription/Recurring Billing Management Global Market to 2025 - Featuring ActivePlatform, Amazon and FastSpring Among Others - ResearchAndMarkets.com",
        "url": "https://www.reddit.com/r/StockMarket/comments/q18pbd/insights_on_the_subscriptionrecurring_billing/",
        "created": 1633392987.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633408432,
        "id": "q1nga8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Ring the alarm- AS REQUESTED - $KPLT: Untapped Short Squeeze Data Galore. CTB MAX 75%, Avg 37%. Dark pool = 55% of volume. FTD : Heavy, AMZN + AFRM rumor, New partnership with Salesforce, 96m Outstanding shares, .5 days to cover. Multiple sources of info, but relatively close data.",
        "url": "https://www.reddit.com/gallery/q1nga8",
        "created": 1633437232.0
    },
    {
        "author": "mike_oc23",
        "created_utc": 1633486476,
        "id": "q2azcu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Ticker: ACN  \nCurrent Price: $325.12  \nDividend Yield: 1.08%  \nDividend Frequency: Paid Quarterly\n\n**Background**  \n[Accenture](https://www.accenture.com/us-en?c=acn_glb_brandexpressiongoogle_11607915&amp;n=psgs_1020&amp;&amp;c=ad_usadfy17_10000001&amp;n=psgs_Brand-%7c-US-%7c-Exact_accenture&amp;gclid=CjwKCAjw7--KBhAMEiwAxfpkWLS_UJeHUUiIaKtOXPfMbCM5iGXkVYNhXkr9H1ErSKEW9pc35OHVkRoCqkgQAvD_BwE&amp;gclsrc=aw.ds) is a multinational business services company that specializes in IT services. The company was founded in 1989 and is headquartered in Dublin, Ireland. Accenture has 624,000 employees, owns 7,900 patents worldwide, and rank among the [largest](https://www.marketbeat.com/stocks/sectors/business-services/) business service companies with a market cap over $200 billion. Accenture is a member of the [S&amp;P 100](https://markets.businessinsider.com/index/components/s&amp;p_100) and [Fortune Global 500](https://fortune.com/global500/2021/search/). Accenture's clients make up [91 of the Fortune Global 100 and more than three-quarters of the Fortune Global 500](https://newsroom.accenture.com/fact-sheet/), including key players such as Microsoft, SAP, Oracle, Salesforce, and Workday.\n\n**Financials**\n\n* Revenue: $50.53 Billion\n* Net Income: $5.91 Billion\n* Profit Margin: 11.69%\n* Total Cash: $8.17 Billion\n* Total Debt: $3.51 Billion\n* Current Ratio: 1.25\n* PE Ratio: 37.47\n* [More Key Statistics Here](https://finance.yahoo.com/quote/ACN/key-statistics?p=ACN)\n\n**Growth &amp; Dividends**  \n[Here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=true&amp;showYield=false&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is performance dating back to 2005 with dividends reinvested compared to the S&amp;P 500 index, and [here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=false&amp;showYield=true&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is with dividends held as income. The investor's dividend yield grew from 1.11% in 2005 to 12.15% in 2020. There was a dip in dividend income in 2019 when Accenture transitioned from semi annual dividends to quarterly payments. See [here](https://www.nasdaq.com/market-activity/stocks/acn/dividend-history) for dividend history. Accenture has a dividend payout ratio of around 40% showing signs of sustainability for future payments.",
        "subreddit": "StockMarket",
        "title": "Dividends Plus Growth - Accenture (ACN)",
        "url": "https://www.reddit.com/r/StockMarket/comments/q2azcu/dividends_plus_growth_accenture_acn/",
        "created": 1633515276.0
    },
    {
        "author": "TheLifeandTimesofTim",
        "created_utc": 1633199490,
        "id": "q00nqh",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "# Altus’ Business and Competitive Position \n\nAltus is a clean electrification company that develops, owns, and operates solar systems and energy storage for commercial customers, communities, and residential customers. Altus has been profitable for years, with 50-60% EBITDA margins, and expects to grow EBITDA by \\~77% annually through 2024.\n\n**Altus is led by highly capable, seasoned founders**:\n\n* Lars Norell (co-founder and co-CEO) was previously a Principal and Managing Director at Cohen &amp; Company where he served as Head of Capital Markets and subsequently led the Alternative Assets effort. Before joining Cohen &amp; Company, Norell was an MD and Co-Head of US Structured Credit Products at Merrill Lynch. \n* Greg Felton (co-founder and co-CEO) was a partner at Goldman Sachs and the Chief Investment Officer of the Credit Alternatives platform at Goldman Sachs Asset Management.\n\n**Altus is ahead of the pack and expanding its service offerings; capital from + partnership with CBRE should put it even further ahead**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3zg3h3pvw2r71.png?width=1420&amp;format=png&amp;auto=webp&amp;s=b6e5189474922c2f4a25224c172c5b81d299cfce\n\n*Two of the largest players in commercial real estate are on Altus’ side* \n\n* CBAH was formed by CBRE and Blackstone has been a long-time investor in Altus (its ownership is currently 17%). \n* Through Blackstone, Altus has access to the most efficient debt and tax equity financing within a fragmented industry where others do not. \n* CBRE is the world’s largest commercial real estate services firm. CBRE manages 7 billion square feet of commercial real estate and $8 billion of energy spend annually.  \n   * (More detail on CBRE’s ability to directly add value on p.3)\n* CBRE also currently possesses over 20 billion data points stored in its Enterprise Data Platform for the CRE assets it operates; CBRE plans to leverage its Data &amp; Analytic capabilities to create a new software tool capable of analyzing client portfolios to aid in identifying attractive opportunities for Altus Power and for clients.\n* CBRE and Blackstone give Altus a considerable edge over competitors.\n\n*Altus’ customers are highly reliable*\n\n* Not a single payment default in its history of more than a decade\n\n*Multiple additional growth opportunities*\n\n* Altus is beginning to build out EV charging stations at office buildings, which are an ideal place to install EV chargers given that employee cars sit idle all day long. And unlike most charging stations, users can actually see that their electricity is coming directly from a clean source.\n* U.S. cumulative **installed battery storage** is anticipated to **grow at \\~49% annually** to 54 GWh2 by 2030.\n\n## The CBAH Transaction and Valuation\n\n**Interests between all stakeholders are aligned to an exceptional degree and CBRE is in a position to add substantial value**\n\n* Existing investors and management are not only rolling 100% but are also investing $25M in the PIPE.\n* CBRE is investing $75M in the PIPE and has provided a commitment to backstop up to $150M of SPAC redemptions at the same terms as the PIPE.\n* Moreover, CBAH agreed to the “SAIL” promote structure from the get-go, which means the entire promote (which is already capped at 15%) is earned over time as share price appreciates. \n   * The first sponsor shares are earned when shares reach $12.\n\n*\\* Notes regarding CBAH warrants: $11.00 strike price and ¼ warrant coverage \\**\n\n**Altus is valued at an EBITDA multiple discount to** ***qualitatively*** **comparable (residential) solar companies, which have inferior financials and growth** \n\n[\\*as of 10\\/01](https://preview.redd.it/fsx37cetx2r71.png?width=2328&amp;format=png&amp;auto=webp&amp;s=718bd491723d2aa7595c037b6f29160c3cf85a79)\n\n**Altus’ projections are conservative and CBRE can meaningfully add value** \n\n* Their current 900+ MW pipeline represents a \\~2.0x coverage over the 445 MW required to achieve 2022 annualized EBITDA\n* Further, the projections do *not* include the potentially massive windfall from their partnership with CBRE.\n* Unlike the vast majority of SPAC sponsors, CBRE is not only highly incentivized to add value, they are actually in a position to do so in a direct and substantial way.\n\n**CBRE Direct Value Add**\n\n[Note: 2023 EV is conservative given that SPWR is currently valued at \\~28 x 2022 EBITDA.](https://preview.redd.it/033etx89y2r71.png?width=1244&amp;format=png&amp;auto=webp&amp;s=f9d465df62327901b831ad144e7871e400dd036e)\n\n# Potential Risks and Concerns Identified and Addressed\n\n**Altus’ employee count to market cap ratio is dramatically low than peers**\n\nAlthough the comps cited in the investor presentation appear to be *truly comparable* in terms of the quality of leadership, product offering, market position, scale, etc., Altus currently employs far fewer people than its peers (according to LinkedIn).\n\nhttps://preview.redd.it/ux2htm2my2r71.png?width=944&amp;format=png&amp;auto=webp&amp;s=901e6a9348875cc7822ceca069e0d710999d8ee6\n\nThis difference is eye-catching; and it’s possibly indicative of a less robust and capable company. To the extent that meeting projections will require increased hiring efforts, both recruiting and integrating capable employees could prove to be a major hurdle. \n\nThere is reason to think this might *not* be cause for concern, though. This low ratio could very well be a result of Altus operating predominantly in the commercial, industrial, and community solar markets – where customer offtake is much larger and a far smaller salesforce is needed compared to the residential marketplace. Indeed, Altus cites a low customer acquisition cost as a positive differentiator between it and residential solar companies and its margins are significantly higher. (Altus is compared to residential solar companies since there are no public commercial solar companies.) Relatedly, Altus states in the presentation that they rely on contractors and third parties for both installation and sales sourcing. So Altus may employ a relatively high number of contract workers and/or manual workers who do not show up in online searches. \n\n**Public comps are volatile and are now considerably lower (\\~10-15%) than they were when the CBAH deal was announced**\n\nThere is risk of this downward trend extending to the date of the merger (Q4 2021). With that said, this is already factored into the valuation math on p.2, which demonstrates Altus’ discount to comps relative to both 2022 and 2023 EBITDA. And volatility is a double-edged sword, especially with respect to the value of warrants, which should benefit from higher volatility (theoretically, at least). \n\n**Altus lacks a significant technological moat**\n\nAltus does not produce its panels, nor does it have sophisticated proprietary energy storage technology like Stem. Altus does, however, have some software technology IP and data. Here’s what Norell said about this during the analyst day presentation:\n\n&gt;Two years ago \\[we built\\] our own monitoring software, which we named Gaia, and since that time we have also built asset registries and stored all the data coming out of our designs and systems and equipment choices and added the functionalities described on this page... what we were planning to do next is to scale Gaia in two directions... for asset servicing, predictive maintenance of our solar assets using machine learning and AI, and for origination of new customers and assets, develop a customer interface that we can use to originate both commercial and community solar customers. We’ve started collaborating with CBRE on both of these initiatives.\n\nNevertheless, the ultimate benefit of this software and data is not all that clear. So it’s reasonable to assign it little to no value at this point. However, where Altus may have an underappreciated moat is in financing and managing its projects. Unlike residential solar, which has standardized financing, each commercial solar project has a high degree of customization and complexity. Often the work and expense involved in acquiring a customer and securing financing makes deals with commercial customers unworkable. ([Forbes](https://www.google.com/search?q=untpped+comercial+and+industrial+solar&amp;oq=un&amp;aqs=chrome.0.69i59l2j0i67j35i39j69i60j69i61j69i60l2.839j0j7&amp;sourceid=chrome&amp;ie=UTF-8)) As mentioned on p.1, Altus is run by executives with deep expertise in structuring complex financial agreements. And Altus’ partnership with Blackstone Credit increases this edge.  \n\nFurther, there are plenty of companies that have achieved significant growth and outperformance despite lacking a technological or consumer brand moat. The most relevant example that jumps to mind is Public Storage (PSA). In the past 20 years, PSA has doubled the S&amp;P 500’s performance – outpacing the S&amp;P by \\~500%. ([WSJ](https://www.wsj.com/articles/wall-streets-hidden-gem-is-in-public-storage-1455556303)) In the past 10 and 5 years, PSA has outperformed by \\~130% and 60% respectively. This shows the value creation of companies that have exceptional management and execution, especially when such companies are operating in an industry with strong secular growth. There is good reason to believe that Altus is such a company.\n\nDisclaimers: I'm not a financial advisor and this is not financial advice.\n\nDisclosure: I hold 110,000 CBAH warrants.",
        "subreddit": "SPACs",
        "title": "The Unique CBAH/Altus Opportunity",
        "url": "https://www.reddit.com/r/SPACs/comments/q00nqh/the_unique_cbahaltus_opportunity/",
        "created": 1633228290.0
    },
    {
        "author": "AppleGingerTequila",
        "created_utc": 1633396720,
        "id": "q1k63c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hi im 20 years old and i wont be needing money i put into the stock market for at least the next 10-15 years. Basically i dont mind letting my stocks sit idle and will keep investing without pulling out. My current portfolio is:\n\nETFS:-\n\nQQQ-20%\n\nVUG-10%\n\nVOO-20%\n\nSOXX-20% \n\nTOTAL ETF%= 70%\n\n&amp;#x200B;\n\nStocks:-\n\nDIS- 6%\n\nASTS- 4%\n\nSoFi- 3%\n\nSQ- 7%\n\nCRWD-5%\n\nCRM-5%\n\nTOTAL STOCK%=30%\n\n&amp;#x200B;\n\nAny advice on whether i should change things around or suggestions of other stocks/etfs would be greatly appreciated. Also pls let me know if my % allocations are alright. Thanks!",
        "subreddit": "StockMarket",
        "title": "New to investing so i would love to hear your feedback on my portfolio!",
        "url": "https://www.reddit.com/r/StockMarket/comments/q1k63c/new_to_investing_so_i_would_love_to_hear_your/",
        "created": 1633425520.0
    },
    {
        "author": "mike_oc23",
        "created_utc": 1633486381,
        "id": "q2ayen",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Ticker: ACN  \nCurrent Price: $325.12  \nDividend Yield: 1.08%  \nDividend Frequency: Paid Quarterly\n\n**Background**  \n[Accenture](https://www.accenture.com/us-en?c=acn_glb_brandexpressiongoogle_11607915&amp;n=psgs_1020&amp;&amp;c=ad_usadfy17_10000001&amp;n=psgs_Brand-%7c-US-%7c-Exact_accenture&amp;gclid=CjwKCAjw7--KBhAMEiwAxfpkWLS_UJeHUUiIaKtOXPfMbCM5iGXkVYNhXkr9H1ErSKEW9pc35OHVkRoCqkgQAvD_BwE&amp;gclsrc=aw.ds) is a multinational business services company that specializes in IT services. The company was founded in 1989 and is headquartered in Dublin, Ireland. Accenture has 624,000 employees, owns 7,900 patents worldwide, and rank among the [largest](https://www.marketbeat.com/stocks/sectors/business-services/) business service companies with a market cap over $200 billion. Accenture is a member of the [S&amp;P 100](https://markets.businessinsider.com/index/components/s&amp;p_100) and [Fortune Global 500](https://fortune.com/global500/2021/search/). Accenture's clients make up [91 of the Fortune Global 100 and more than three-quarters of the Fortune Global 500](https://newsroom.accenture.com/fact-sheet/), including key players such as Microsoft, SAP, Oracle, Salesforce, and Workday.\n\n**Financials**\n\n* Revenue: $50.53 Billion\n* Net Income: $5.91 Billion\n* Profit Margin: 11.69%\n* Total Cash: $8.17 Billion\n* Total Debt: $3.51 Billion\n* Current Ratio: 1.25\n* PE Ratio: 37.47\n* [More Key Statistics Here](https://finance.yahoo.com/quote/ACN/key-statistics?p=ACN)\n\n**Growth &amp; Dividends**  \n[Here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=true&amp;showYield=false&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is performance dating back to 2005 with dividends reinvested compared to the S&amp;P 500 index, and [here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=false&amp;showYield=true&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is with dividends held as income. The investor's dividend yield grew from 1.11% in 2005 to 12.15% in 2020. There was a dip in dividend income in 2019 when Accenture transitioned from semi annual dividends to quarterly payments. See [here](https://www.nasdaq.com/market-activity/stocks/acn/dividend-history) for dividend history. Accenture has a dividend payout ratio of around 40% showing signs of sustainability for future payments.",
        "subreddit": "stocks",
        "title": "Dividends Plus Growth - Accenture (ACN)",
        "url": "https://www.reddit.com/r/stocks/comments/q2ayen/dividends_plus_growth_accenture_acn/",
        "created": 1633515181.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633317202,
        "id": "q0x5kq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Sorry to be another person posting about $KPLT but this squeeze is going to last because there are 14 MILLION shares shorted. 12,000,000! Stocks NEED to be covered. 32%&gt; CTB. Insiders keep buying. New deal with Salesforce for their commerce cloud. Intagrated partner with $AFRM (AFFIRM),maybe Amazon",
        "url": "https://www.reddit.com/gallery/q0x5kq",
        "created": 1633346002.0
    },
    {
        "author": "prostockadvice",
        "created_utc": 1633485205,
        "id": "q2amno",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "We are officially in October and it is proving to be rather turbulent. Coming off of one of the worst days all year, the major indices did rebound and take back some of the losses. Today is a write up where I go through all the old alerts, push a reset, and create many new ones. \n\nIt was no surprise that we the S&amp;P had its first red month all year last month. The question is will our portfolios keep being drug down by inflation and debt ceiling woes. If you are not already, now is the time to dollar cost average on your long term positions, and pick yourself out some new mid term positions that you think will perform well in the winter months. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  First let's take a look at some of my favorites.\n\n**TQQQ** has given up a lot of ground since it's all time high on September 7th. It is now approaching the 180MA, and the RSI is really low. It could be a great time to average into this position. If you prefer options, a bounce of the 180 alerts has been set. \n\nhttps://preview.redd.it/6ceb8y1sjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3611585e424b757718c9dba3f0afefadb634c9a8\n\n **UPRO** is not as bad as **TQQQ**, and that is quite normal according to Trend Spider's seasonality. Usually this time of year, the Nasdaq does worse out of all the indices. Now we see that tech is getting hammered. I'd also DCA into this one.  \n\nhttps://preview.redd.it/vh23d1szjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0a31491eb4a487f24f2f872db5e11f32ca41e89e\n\n **UDOW** is probably a great pick up right now for your buy and hold portfolio. It is riding along the 180MA, and if you can get an entry there, start to DCA.  \n\nhttps://preview.redd.it/o66oyzrzjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3dc213a55397d60bda38aba21253948b96b66579\n\n **SOXL** is notorious in our community for money printing swings. I'd say it might have bottomed out of now. There seems to be a 50/50 chance over the past decade that SOXL is up/down in October. Since it is already down, I'd say grab some, and continue to as long as it is going down. Red day buy; green day hold. Let it run until mid November. Hope you are paying attention :D \n\nhttps://preview.redd.it/j6vay1szjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=514b94aa0482e335d9bb7f44031b54edef361497\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Crypto \n\n **CRO**, the native Crypto.com token and one of my favorites right now has made a wonderful recovery bounce off of the 180MA. It is now back at 18 cents. Don't sleep on this one. They are now the sponsors of the UFC and the Philadelphia 76ers. I think this is a 10x play. I think the right play here is buy what you can afford: $400, $4000 or $40000. Stake those in their app (for up to 14%apy), since it is a long term play anyways we don't need to use this money. After, you will unlock their metal Visa card. My recommendation is run all your monthly expenses through it and you'll be getting 2-5% back in **CRO** which you continue holding.  \n\nhttps://preview.redd.it/wowtpr22kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=6294fca8217fde87067615877a990b4f57565db3\n\n \n\n**BTC** has made a huge recovery this week, and if you are already diversified with BTC exposure congratulate yourself. If not, maybe its time to start considering it. If traditional equity markets are not doing well, money sometimes flows to crypto - and vice versa. \n\nhttps://preview.redd.it/4g8tbdb3kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=c1fcc81b846310ed2c490c7dd4498fc90d0cda68\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Alerts \n\n A **WMT** opportunity found by my VIP Discord members. First of all, the seasonality improves a lot in November and the RSI looks way to over sold. I like a bounce off of the the lower support of a paralell channel that it seems to be trading in. This could be a good chance for some EOY calls either now, or wait for bounce.  \n\nhttps://preview.redd.it/qztvc4h8kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=012816a5a8ba2a561beaadecb7a9fee4cc4d3b7a\n\n **XHB**, a homebuilders ETF, LEAPS look ripe for the picking. This would be a long term position with exposure to the US new homes sector, which I don't think will slow down any time soon.  \n\nhttps://preview.redd.it/d3sallk9kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=09d918825aedf4ff92ceb2917309b12ba69ccba8\n\n Here is an interesting opportunity for some puts on **CRM** I believe to have found. We are close to all time high, and the seasonality starts to suck going into December. I can't really say the exact point where we buy the puts, but I think maybe around $280. We can even buy vertical spreads for $270/$260 with a December expiration. \n\nhttps://preview.redd.it/kctpebkakqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=e3d15a26bfe10680a774553e53c78204b3a97a3e\n\n **NKE** has also taken a beating and will probably have decent holiday sales as always. Actually, this alert was already set and expired before it triggered. It is basically riding along the 180MA and the YTD VWAP. Could be a good pick up now, or wait for a confirmation bounce.  \n\nhttps://preview.redd.it/nu6sb4jbkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=d8f911359729ed6031498e5aae401a786bf2ff98\n\n Same with my **HD** alert. It triggered last week but I was on vacation and missed it. If you bought, you'd be making money. I'll be resetting the alerts for a VWAP bounce and trying again.  \n\nhttps://preview.redd.it/tb2uejeckqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=985ad4ea1a62d29579da96945a756cc0da8a614c\n\n I'm still liking these **SPOT** puts as I don't believe in the long term growth of this company. It seems like the resistance drawn out is true and is holding. If continues, there is an opportunity to arb calls and puts between the resistance and glass bottom (yellow). \n\nhttps://preview.redd.it/hcie2cgdkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=10f8bd58cebd73066512ce8e675a98095ac1cdae\n\n Still continue to play **DIS** on its yoyo like bounce on the glass bottom. Usually **DIS's** seasonality improves in the winter months, especially in November. I still like EOY calls, probably taking profit in November.  \n\nhttps://preview.redd.it/2lclpzaekqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=329098a02d6d7b241e153cb149a12cb84693ba8a\n\n It is interesting that this time, when BTC ran, **EBON** didn't. One of my highest conviction plays, I'll wait for the bounce down from the 50MA as usual. **EBON** is a crap company, with crap products, that industry insiders joke about.  \n\nhttps://preview.redd.it/ozpj252fkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3bb701f35e2d14a8945e771a8787425fc8698885\n\n **MCB** is a tricky play, but, like I thought, it is holding resistance. I think its a matter of time before it pulls back. If we see it break the resistance, then I'll cut. Go small here.  \n\nhttps://preview.redd.it/vf7usk4gkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=d18e08d1ea0c8c33cbfbf1fc788e3566e3ec7ffb\n\n **SBUX** is around major supports and has somewhat of a nice volume shelf propping it up. Seasonality is good for October and November as cold caffeine addicted shoppers go out and need warm pick-me-uppers. I like calls off of the volume shelf expiring EOY and taking profits possibly in November.  \n\nhttps://preview.redd.it/n2lkvt0hkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=bfe6ac15beda08ad064d92c429436c65b943e2f0\n\n Lastly for today, I still like **T** puts off of the 50MA. Another company that I don't believe in long term growth; this is a good opportunity to continue the ride down. I would keep positions small and take profits quick, although it seems that there is more than a 50% chance that month over month is negative.  \n\nhttps://preview.redd.it/rpqh90yhkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0dca69da6cd687c47ad06854a75b9fa5779f1ccd\n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n    Disclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.",
        "subreddit": "options",
        "title": "15 Excellent Options Set Ups for Q4",
        "url": "https://www.reddit.com/r/options/comments/q2amno/15_excellent_options_set_ups_for_q4/",
        "created": 1633514005.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633407733,
        "id": "q1n9zy",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "AS REQUESTED - $KPLT: Untapped Short Squeeze Data Galore. CTB MAX 75%, Avg 37%. Dark pool = 55% of volume. FTD : Heavy, AMZN + AFRM rumor, New partnership with Salesforce, 96m Outstanding shares, .5 days to cover. Multiple sources of info, but relatively close data.",
        "url": "https://www.reddit.com/gallery/q1n9zy",
        "created": 1633436533.0
    },
    {
        "author": "Tomkila",
        "created_utc": 1633364187,
        "id": "q18pbd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "“Subscription/Recurring Billing Management Market Research Report by Industry, by Deployment, by Payment Mode, by Region - Global Forecast to 2025 - Cumulative Impact of COVID-19”\nTweet this\nThe Global Subscription/Recurring Billing Management Market size was estimated at USD 5,122.88 Million in 2020 and expected to reach USD 5,941.43 Million in 2021, at a Compound Annual Growth Rate (CAGR) 16.02% to reach USD 10,772.14 Million by 2025.\n\nCompetitive Strategic Window:\n\nThe Competitive Strategic Window analyses the competitive landscape in terms of markets, applications, and geographies to help the vendor define an alignment or fit between their capabilities and opportunities for future growth prospects. It describes the optimal or favorable fit for the vendors to adopt successive merger and acquisition strategies, geography expansion, research &amp; development, and new product introduction strategies to execute further business expansion and growth during a forecast period.\n\nFPNV Positioning Matrix:\n\nThe FPNV Positioning Matrix evaluates and categorizes the vendors in the Subscription/Recurring Billing Management Market based on Business Strategy (Business Growth, Industry Coverage, Financial Viability, and Channel Support) and Product Satisfaction (Value for Money, Ease of Use, Product Features, and Customer Support) that aids businesses in better decision making and understanding the competitive landscape.\n\nMarket Share Analysis:\n\nThe Market Share Analysis offers the analysis of vendors considering their contribution to the overall market. It provides the idea of its revenue generation into the overall market compared to other vendors in the space. It provides insights into how vendors are performing in terms of revenue generation and customer base compared to others. Knowing market share offers an idea of the size and competitiveness of the vendors for the base year. It reveals the market characteristics in terms of accumulation, fragmentation, dominance, and amalgamation traits.\n\nThe report provides insights on the following pointers:\n\n1. Market Penetration: Provides comprehensive information on the market offered by the key players\n\n2. Market Development: Provides in-depth information about lucrative emerging markets and analyze penetration across mature segments of the markets\n\n3. Market Diversification: Provides detailed information about new product launches, untapped geographies, recent developments, and investments\n\n4. Competitive Assessment &amp; Intelligence: Provides an exhaustive assessment of market shares, strategies, products, certification, regulatory approvals, patent landscape, and manufacturing capabilities of the leading players\n\n5. Product Development &amp; Innovation: Provides intelligent insights on future technologies, R&amp;D activities, and breakthrough product developments\n\nThe report answers questions such as:\n\n1. What is the market size and forecast of the Global Subscription/Recurring Billing Management Market?\n\n2. What are the inhibiting factors and impact of COVID-19 shaping the Global Subscription/Recurring Billing Management Market during the forecast period?\n\n3. Which are the products/segments/applications/areas to invest in over the forecast period in the Global Subscription/Recurring Billing Management Market?\n\n4. What is the competitive strategic window for opportunities in the Global Subscription/Recurring Billing Management Market?\n\n5. What are the technology trends and regulatory frameworks in the Global Subscription/Recurring Billing Management Market?\n\n6. What is the market share of the leading vendors in the Global Subscription/Recurring Billing Management Market?\n\n7. What modes and strategic moves are considered suitable for entering the Global Subscription/Recurring Billing Management Market?\n\nMarket Dynamics\n\nDrivers\n\nRising Penetration of Electronic Media and Devices Coupled with Advanced Subscription &amp; Billing Software\nGrowing Demand for Integrated Subscription and Billing Platform\nIncreasing Customer Awareness and Subscription Base\nGrowing Adoption of Subscription and Billing Solutions across Various Industries\nRestraints\n\nComplex Customization &amp; ROI Risk for Businesses and Customer Concern Regarding Security\nOpportunities\n\nScalability of SaaS Business Model\nUpgradation of Legacy System and Scalability Associated with SaaS Business Model\nAdoption of Emerging Technologies and the Economic Growth of Countries such as India and China\nThe Need to Systemize Management is Facilitated by Integration of Back-End Systems\nChallenges\n\nLimited Technical Skills and Expertise\nAdvanced Cost Associated with System Transformation\nCompanies Mentioned\n\n2Checkout.com, Inc. by VeriFone Holdings, Inc.\nActivePlatform\nAmazon.com, Inc.\nAria Systems, Inc.\nBluSynergy\nBraintree by PayPal Holdings, Inc.\nCerillion PLC\nCleverbridge AG\nConga\nDXC Technology Company\nFastSpring\nFreshBooks\nLogiSense Corporation\nOracle Corporation\nRecurly, Inc.\nSalesforce.com, Inc.\nSAP SE\nStripe\nTransverse, LLC\nZoho Corporation Pvt. Ltd.\nZuora, Inc.",
        "subreddit": "StockMarket",
        "title": "Insights on the Subscription/Recurring Billing Management Global Market to 2025 - Featuring ActivePlatform, Amazon and FastSpring Among Others - ResearchAndMarkets.com",
        "url": "https://www.reddit.com/r/StockMarket/comments/q18pbd/insights_on_the_subscriptionrecurring_billing/",
        "created": 1633392987.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633408432,
        "id": "q1nga8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Ring the alarm- AS REQUESTED - $KPLT: Untapped Short Squeeze Data Galore. CTB MAX 75%, Avg 37%. Dark pool = 55% of volume. FTD : Heavy, AMZN + AFRM rumor, New partnership with Salesforce, 96m Outstanding shares, .5 days to cover. Multiple sources of info, but relatively close data.",
        "url": "https://www.reddit.com/gallery/q1nga8",
        "created": 1633437232.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1633393520,
        "id": "q1j7l6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | Snap-on Incorporated | **SNA** | 1.95%  \n2. **Health Care** | Merck &amp; Co., Inc. | **MRK** | 2.09%  \n3. **Information Technology** | Hewlett Packard Enterprise Co | **HPE** | 1.57%  \n4. **Communication Services** | Lumen Technologies Inc | **LUMN** | 1.97%  \n5. **Consumer Discretionary** | Aptiv PLC | **APTV** | 3.27%  \n6. **Utilities** | Eversource Energy | **ES** | 3.76%  \n7. **Financials** | Bank of America Corp | **BAC** | 0.60%  \n8. **Materials** | Newmont Corporation | **NEM** | 2.09%  \n9.  **Real Estate** | Equity Residential | **EQR** | 1.77%  \n10. **Consumer Staples** | Altria Group Inc | **MO** | 1.42%  \n11. **Energy** | Ciputra Development Tbk PT | **CTRA** | 8.95%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Quanta Services Inc** | PWR | **-3.03%**  \n2. Health Care | **Edwards Lifesciences Corp** |  EW | **-5.26%**  \n3. Information Technology | **Enphase Energy Inc** | ENPH | **-6.65%**  \n4.  Communication Services | **Twitter Inc** | TWTR | **-5.79%**  \n5. Consumer Discretionary | **Penn National Gaming, Inc** | PENN | **-4.39%**  \n6. Utilities | **NRG Energy Inc** | NRG | **-0.81%**  \n7. Financials | **Msci Inc** | MSCI | **-3.83%**  \n8. Materials | **International Flavors &amp; Fragrances Inc** | IFF | **-2.20%**  \n9. Real Estate | **CBRE Group Inc** | CBRE | **-1.40%**  \n10. Consumer Staples | **Costco Wholesale Corporation** | COST | **-1.83%**  \n11. Energy | **Marathon Petroleum Corp** | MPC | **-0.85%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 10/4/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q1j7l6/sp500_winners_and_losers_1042021/",
        "created": 1633422320.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1633560889,
        "id": "q2vl39",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | CSX Corporation | **CSX** | 3.53%  \n2. **Health Care** | Steris PLC | **STE** | 2.21%  \n3. **Information Technology** | Enphase Energy Inc | **ENPH** | 4.19%  \n4. **Communication Services** | Twitter Inc | **TWTR** | 2.39%  \n5. **Consumer Discretionary** | Etsy Inc | **ETSY** | 2.89%  \n6. **Utilities** | Consolidated Edison, Inc. | **ED** | 2.15%  \n7. **Financials** | Intercontinental Exchange Inc | **ICE** | 3.84%  \n8. **Materials** | Vulcan Materials Company | **VMC** | 3.21%  \n9.  **Real Estate** | Realty Income Corp | **O** | 2.26%  \n10. **Consumer Staples** | PepsiCo, Inc. | **PEP** | 2.56%  \n11. **Energy** | Valero Energy Corporation | **VLO** | 1.44%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **American Airlines Group Inc** | AAL | **-4.33%**  \n2. Health Care | **Moderna Inc** |  MRNA | **-8.94%**  \n3. Information Technology | **Seagate Technology Holdings PLC** | STX | **-5.33%**  \n4.  Communication Services | **Electronic Arts Inc.** | EA | **-6.95%**  \n5. Consumer Discretionary | **PVH Corp** | PVH | **-3.74%**  \n6. Utilities | **No losers** | |  \n7. Financials | **MarketAxess Holdings Inc.** | MKTX | **-4.43%**  \n8. Materials | **FMC Corp** | FMC | **-3.43%**  \n9. Real Estate | **CBRE Group Inc** | CBRE | **-2.79%**  \n10. Consumer Staples | **Molson Coors Beverage Co Class B** | TAP | **-1.93%**  \n11. Energy | **Devon Energy Corp** | DVN | **-3.49%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 10/6/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q2vl39/sp500_winners_and_losers_1062021/",
        "created": 1633589689.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1633560924,
        "id": "q2vlge",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Three ETF's per winner (when available)  \n\n\n**ETF Ticker | % invested in Winner | ETF Full Name**  \n\n\n**Industrials**: ETFs investing in CSX Corporation  \nIYT-- 8.26%  iShares US Transportation ETF  \nFTXR-- 5.78%  First Trust Nasdaq Transportation ETF  \nINFR-- 4.31%  Legg Mason Global Infrastructure ETF  \n\n\n**Health Care**: ETFs investing in Steris PLC  \nBOUT-- 3.67%  Innovator IBD Breakout Opportunities ETF  \nRYH-- 1.64%  Invesco S&amp;P 500® Equal Weight Health Care ETF  \n   \n\n\n**Information Technology**: ETFs investing in Enphase Energy Inc  \nTAN-- 10.03%  Invesco Solar ETF  \nRAYS-- 6.89%  Global X Solar ETF  \nQCLN-- 6.10%  First Trust NASDAQ Clean Edge Green Energy Index Fund  \n\n\n**Communication Services**: ETFs investing in Twitter Inc  \nFNGS-- 12.89%  MicroSectors FANG+ ETN  \nSOCL-- 6.20%  Global X Social Media ETF  \nVPOP-- 5.70%  Simplify Volt Pop Culture Disruption ETF  \n\n\n**Consumer Discretionary**: ETFs investing in Etsy Inc  \nEBIZ-- 4.89%  Global X E-commerce ETF  \nKNGS-- 4.07%  UPHOLDINGS Compound Kings ETF  \nPEZ-- 3.13%  Invesco DWA Consumer Cyclicals Momentum ETF  \n\n\n**Utilities**: ETFs investing in Consolidated Edison, Inc.  \nFXU-- 4.22%  First Trust Utilities AlphaDEX Fund  \nUTRN-- 4.03%  Vesper U.S. Large Cap Short-Term Reversal Strategy ETF  \nVSL-- 3.98%  Volshares Large Cap ETF  \n\n\n**Financials**: ETFs investing in Intercontinental Exchange Inc  \nIAI-- 4.42%  iShares U.S. Broker-Dealers &amp; Securities Exchanges ETF  \nCRPT-- 4.10%  First Trust SkyBridge Crypto Industry and Digital Economy ETF  \nCWS-- 3.80%  AdvisorShares Focused Equity ETF  \n\n\n**Materials**: ETFs investing in Vulcan Materials Company  \nPKB-- 4.81%  Invesco Dynamic Building &amp; Construction ETF  \nAMER-- 3.58%  Emles Made in America ETF  \nPAVE-- 2.83%  Global X US Infrastructure Development ETF  \n\n\n**Real Estate**: ETFs investing in Realty Income Corp  \nNETL-- 7.81%  NETLease Corporate Real Estate ETF  \nREIT-- 4.20%  ALPS Active REIT ETF  \nICF-- 2.91%  iShares Cohen &amp; Steers REIT ETF  \n\n\n**Consumer Staples**: ETFs investing in PepsiCo, Inc.  \nIECS-- 10.46%  iShares Evolved U.S. Consumer Staples ETF  \nIYK-- 10.26%  iShares U.S. Consumer Staples ETF  \nXLP-- 9.80%  Consumer Staples Select Sector SPDR Fund  \n\n\n**Energy**: ETFs investing in Valero Energy Corporation  \nCRAK-- 6.72%   VanEck Oil Refiners ETF  \nRYE-- 4.85%   Invesco S&amp;P 500® Equal Weight Energy ETF  \nPXE-- 4.42%   Invesco Dynamic Energy Exploration &amp; Production ETF  \n\n\nHappy investing!",
        "subreddit": "StockMarket",
        "title": "ETFs with Investments in SP500 Winners of 10/6/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q2vlge/etfs_with_investments_in_sp500_winners_of_1062021/",
        "created": 1633589724.0
    }
]