[
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "anti-resonance",
        "created_utc": 1614429689,
        "id": "ltnc32",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "Very long post summarising hundreds of years worth of short squeezes.  Edited for formatting.\n\nPositions: GME 65 shares @ $105.\n\nhttps://globalfinancialdata.com/eddie-gilbert-the-boy-wonder-of-wall-street#:~:text=On%20June%2012%2C%201958%2C%20the,remaining%2050%25%20of%20Bruce%20stock.\n\nGilbert began buying up shares of Bruce in February 1958 at 16.875 to acquire majority ownership of the company. As Gilbert bought more and more shares, Bruce’s stock price rose, and short sellers entered into the market believing that an underperforming company like Bruce wasn’t worth the price it was trading at. In the process, Gilbert was acquiring all the float in Bruce’s stock. As the price of Bruce stock rose further, the shorts were forced to cover their positions. On June 12, 1958, the American Stock Exchange suspended trading in E. L. Bruce Stock when the stock soared to $77 a share. Shares were in short supply because the management of E. L. Bruce owned 50% of the outstanding shares and Gilbert had taken control over the remaining 50% of Bruce stock. The shares that were sold short represented the balance between Bruce and Gilbert. Typically, in a situation like this, the exchange would step in, negotiate a fair price for the shorts to cover their position, and settle outstanding short contracts for cash, but Gilbert didn’t want to do this. Gilbert wanted the shares the shorts had borrowed because getting those few extra shares meant the difference between who owned E. L. Bruce Corp. Although the American Stock Exchange required that all shorts cover their positions, the stock no longer traded on the ASE, and the shorts had to find shares over-the-counter. This led to a mad scramble among the shorts, and the stock reportedly traded as high as $190 as shorts desperately tried to cover their positions. Short interest in the stock gradually declined from 16,134 shares on May 15 to 6,440 shares by August 15 and to 3,500 shares by September 4.\n\nThe remaining shorts simply could not find the shares to cover their position, so they filed suit to avoid having to cover their positions claiming there was no “fair market” in the stock and refused to have their shares bought in until a fair market was established; however, in Aronson v. McCormick, the court denied their preliminary injunction and the shorts were required to cover their shares.\n\nhttps://globalfinancialdata.com/the-piggly-crisis\n\nSaunders vs. the Shorts\nClarence Saunders also became part of the last stock corner on the New York Stock Exchange in 1923. The corner became so prominent, that the whole affair became known as the Piggly Crisis. Clarence Saunders was generous, determined, stubborn, and well-known in Memphis. Saunders became known as the home boy who faced off the financiers of Wall Street who were using a bear raid to try and profit from a decline in Piggly Wiggly stock. The goal of shorting a stock is to borrow shares from someone who owns them and sell them. When the stock declines in price, the shorts buy the shares back at a lower price, make a profit, and then return the stock to the person they borrowed it from. In a bear raid, several shorts make a concerted effort to drive the price of a stock down so they can profit from the decline. The bulls, on the other hand, can try and beat the shorts by forcing the price of the stock up, squeezing the shorts and forcing them to sell at a loss. If the bulls can buy up the existing float, the stock is cornered. The shorts have no choice but to buy the stock from the bulls at whatever price they demand. Of course, creating a corner is risky for the bulls as well because it takes a lot of resources to buy up the float in the stock. Once the corner is completed and the shorts have covered their positions at the inflated price, little demand is left for the stock. The price of the stock can collapse, leaving the bulls with a burdensome load of debt. The whole process can end up bankrupting both the shorts and the bulls. Piggly Wiggly shares started trading over-the-counter in July 1920 and listed on the New York Stock Exchange (NYSE) in June 1922. In November, 1922, several of the independently-owned Piggly Wiggly stores in New York, New Jersey and Connecticut failed and went into receivership. Although Saunders’ corporation operated independently of these stores and was profitable, some Wall Street operators saw this as a reason to begin a bear raid on Piggly Wiggly stock. The bear raiders began selling PIggly Wiggly short and spread rumors that the company was in poor shape. Saunders took this challenge personally. He had created Piggly Wiggly stores, created the concept of self-shopping, was spreading his stores across the country, and some bears were trying to create profits by spreading lies about his stores. Saunders decided to “beat the Wall Street professionals at their own game.” Saunders not only used his own money to battle the shorts, but he borrowed ten million dollars from a group of bankers in Memphis, Nashville, New Orleans, Chattanooga and St. Louis to buy up the existing float. In the Wall Street of the 1920s, bear raids came and went. Companies didn’t go bankrupt because of bear raids, and if the fundamentals of the company were sound, the stock would bounce back after the bear raid was over. Nevertheless, Saunders refused to give in to the Wall Street city slickers. Saunders hired Jesse L. Livermore, the most famous bear on Wall Street, to help him break the back of the bear raiders. Within a week, Livermore had bought 105,000 shares of Piggly Wiggly, over half the float of 200,000 shares. The bears had shorted Piggly Wiggly stock in the 40 range, but by January, Saunders’ bull campaign had pushed the price of shares past 60. The shorts were losing money.  \nThe Shorts Are Cornered\nPiggly shares were traded on both the Chicago and New York Stock Exchanges. In January, the Chicago Exchange announced that the stock had been cornered, though the NYSE denied that a corner existed. So Saunders decided to try a new tack. He announced that he would issue 50,000 shares of Piggly Wiggly shares at $55 each. Saunders regularly advertised his stores in the newspapers, and he used some of these ads to offer shares to small investors. Saunders pointed out that Piggly Wiggly stock paid a $1 per quarter dividend, yielding 7% to investors. Since this occurred before the S.E.C. came into existence, Saunders could promise that this was a “once in a lifetime opportunity,” and get away with it. Since Piggly stock was then trading at $70, why would Saunders offer shares at $55, leaving $15 on the table for each of the 50,000 shares? The reason is that Saunders knew that once the shorts had been cornered, the demand for Piggly stock would dry up. Saunders’ stock distribution created a market where he could distribute his shares to new investors. Saunders even allowed investors to buy new shares on the payment plan, put $25 down and pay $10 a month for three months. Since the new shareholders couldn’t sell their shares until they were paid for, this would keep the shorts from obtaining these newly minted shares to cover their positions. On March 19, Saunders let it be known that he controlled all but 1,128 shares of Piggly Wiggly’s outstanding shares. He had cornered the shorts. On Tuesday, March 20, Saunders called on the shorts to deliver their shares to him. By the rules of the exchange, the shorts were required to produce the shares by 2:15 on March 21. The stock opened on the March 20 at 75½, moved up to 124 by noon, but then dropped to 82 on the rumor that the Exchange planned to suspend trading in Piggly and postpone the delivery deadline for the shorts. It was no rumor. The NYSE did suspend trading in the stock. Saunders responded by saying that he expected settlement on Thursday the 22nd by 3 p.m. at $150 per share. Thereafter, his price would be $250 per share. The exchange permanently halted trading in Piggly and gave the shorts until 5 p.m. on Monday the 26th to settle with Saunders. With this ruling, the NYSE saved the shorts. This postponement tipped the scales in favor of the shorts because it gave them several extra days to find some of the 1,128 outstanding shares to settle their accounts without having to come begging to Saunders. Was it right for the Exchange to change the rules in the middle of the game to prevent a corner similar to the one that had occurred in Northern Pacific in 1901? Or should the Exchange have left the shorts to their fate? The NYSE justified their actions on the grounds that the demoralizing effect of the corner could have spread to the rest of the market.  \nSaunders Wins a Pyrrhic Victory\nOn Friday, the 23rd, Saunders offered to settle at $100 per share. In the meantime, the shorts were able to find enough shares floating around in Iowa or New Mexico to cover their positions. Shareholders in Sioux City who knew nothing of the Piggly Crisis were happy to double their money by selling to the shorts while the shorts were happy to get the shares at a mere $100. Saunders now had complete control of Piggly stock, but he was also deeply in debt. It is estimated that Saunders made half-a-million dollars out of his corner, but that proved insufficient to cover his costs. After Saunders paid off the banks with his proceeds, he found that he was five million dollars short, half of which was due on September 1, 1923 and the balance on January 1, 1924. Since Piggly shares could no longer trade on the NYSE, Saunders was forced to sell shares directly to the public and advertised in the newspapers once again, offering Piggly Wiggly shares at $55. Although the public was sympathetic toward Saunders and his battle against the Wall Street bears, the public was unwilling to put their money where their sympathies lay. Saunders took out another newspaper advertisement saying that if Piggly Wiggly were ruined, it would “shame the whole South.” Memphis’s newspaper, The Commercial Appeal, lined themselves behind Saunders and helped lead a campaign to convince Memphians to buy Piggly Wiggly shares and save their local boy. The newspaper planned a three-day campaign to sell 50,000 shares to Memphians at $55 a share. This was to be an all or nothing proposition. If they were unable to sell all 50,000 shares, none would be sold. The campaign began on May 8, and soon 23,698 shares had been subscribed. Despite this, skeptics began to raise questions about who was the true beneficiary of this campaign, Saunders or the public. They asked for a spot audit of Piggly Wiggly to reassure potential investors that the company was a good investment. Saunders refused the audit, but offered to step down and let a committee run the company. Skeptics also asked why Saunders was still building his million-dollar Pink Palace when Piggly Wiggly was possibly in its last throes. The Pink Palace was a huge house built using pink Georgia marble. The Palace was to include a pipe organ, Roman atrium, indoor swimming pool, ballroom, bowling alley, its own golf course, and other luxuries. Saunders promised to board up the Pink Palace and stop construction. Unfortunately, the campaign was unable to sell even 25,000 shares, and the campaign soon fizzled. Saunders responded by selling Piggly Wiggly stores, rather than stock, to raise money. Despite selling stores in Chicago, Denver, Kansas City and elsewhere, Saunders failed to raise enough money to meet the September 1 payment of $2.5 million. Saunders turned over his Piggly Wiggly Stock, the Pink Palace (which was sold to the city of Memphis for $150,000 and opened as a museum in 1930. Today, it includes a replica of the first Piggly Wiggly store, a planetarium, a natural history museum and a museum of twentieth-century Memphis) and other property to his creditors and defaulted on the loan. By Spring, Saunders was in formal bankruptcy proceedings. If Saunders had never launched his campaign against the shorts, he would not have had to borrow the money that drove him into bankruptcy. Pride went before the fall. \n\nhttps://www.americanheritage.com/jacob-schiff-and-northern-pacific-corner#2\n\nIn 1901 James J. Hill, who controlled the Great Northern Railroad and was the largest stockholder in the Northern Pacific, used the latter to seize control of the Chicago, Burlington and Quincy, a smaller road that threatened the Union Pacific’s territory. When Hill refused to address Harriman’s concerns, Harriman determined to get control of the Burlington by seizing control of the Northern Pacific. Morgan was Hill’s banker, so an attack on Hill was a direct attack on Morgan. Before long Schiff had quietly purchased a majority of the preferred stock (which had equal voting rights) in Northern Pacific and held enough common stock to have an overall majority. Morgan and Hill had been caught napping.\n\nMorgan was in Europe and received a frantic cable asking for authority to buy 150,000 common shares of Northern Pacific at the opening of the market on Monday morning, May 6, 1901. If Hill could get a majority of the common, he might be able to delay things until he could retire the preferred and retain control. The cost, at the very least, would be well in excess of fifteen million dollars. Morgan cabled his immediate approval, and the battle was joined between the titans. Those caught in the middle would have to look out for themselves.\n\nOn Monday morning Harriman and Morgan held between them 630,000 of the 800,000 shares of Northern Pacific common in existence. By the close of the market on Tuesday, the Morgan bank had purchased 124,000 shares more. That left only 46,000 shares un- accounted for. But the volume of Northern Pacific for those two days totaled 539,000 shares. The vast majority of these, of course, had been sold “short.” When, too late, the short sellers realized what was really happening, panic swept the Street.\n\nSuddenly the shorts were desperate to close out their positions and willing to pay whatever price was necessary. As they liquidated their other assets to buy Northern Pacific, stocks and bonds plunged. Morgan’s new U.S. Steel, which had been at 54¾ only a few days earlier, skidded from 40 to 26 on Thursday morning, while Northern Pacific ratcheted upward minute by minute. One broker hired a special train just to bring a single certificate for 500 shares down from Albany. Another, incautiously admitting he had 10,000 shares to sell, was stripped virtually naked on the floor of the Exchange itself as the shorts clawed at him in their desperation to buy at any price. That morning the firm of Street and Norton sold 300 shares to one of the shorts at one thousand dollars a share, ten times what the price had been a week earlier.\n\nBy noon the panic was threatening to engulf in ruin not just the shorts but the Street itself. The Morgan bank and Kuhn, Loeb called a hasty truce. They would buy no more Northern Pacific for their own accounts or for those of their customers and would allow the shorts to settle at $150 a share. Calm began to return to Wall Street.\n\nKuhhn, Loeb had fought the Morgan bank to a standstill. This allowed Harriman to get what he really wanted, which was not control of the Northern Pacific but attention to his interests from the Northern Pacific and its newly acquired subsidiary, the Chicago, Burlington and Quincy Railroad. Harriman was soon on the board.\n\nThe New York Times likened the affair to so many “cowboys on a spree, shooting wildly at each other in entire disregard of the safety of the bystanders.” It is ironic that Morgan and Schiff, so instrumental in reforming the bad old ways of American business, were among the principal antagonists in Wall Street’s last great railroad war, so reminiscent of the wild and woolly days of the Civil War era.\n\nhttps://www.ft.com/content/0a58b63a-4294-3e07-8390-c3aabef39a26\nhttps://www.reuters.com/article/us-volkswagen-idUSTRE49R3I920081028\n\nFRANKFURT (Reuters) - Volkswagen VOWG.DE briefly became the world's biggest company by market value on Tuesday, as short sellers caught betting on a price drop with borrowed stock scrambled to find shares after a buying spree by Porsche PSHG_p.DE.\n\nShort sellers desperate to close their positions paid as much as 1,005 euros a share during the session following Sunday’s news that there was less than 6 percent of VW voting stock still floating in the market.\n\nAt that price Volkswagen's voting stock was worth 296 billion euros ($370 billion), or more than the $343 billion market capitalization of Exxon Mobil XOM.N.\n\nVW shares later closed trading on Tuesday up 82 percent at 945 euros.\n\nThe share price has rocketed since Porsche revealed in a surprise announcement on Sunday that it had effectively gained control of 74 percent of Volkswagen’s voting shares.\n\nIn March, when Porsche was still sitting on a long-held 31 percent direct stake, it said it was not seeking to increase its holding to 75 percent, bearing in mind that the state of Lower Saxony holds a 20 percent stake in VW.\n\n“The speculation of going to 75 percent overlooks the realities of the shareholder structure of VW, Porsche said at the time.\n\n“In view of the fact that Lower Saxony as second largest shareholder owns 20 percent of VW, the probability of acquiring the necessary shares in freefloat is extremely low.”\n\nMeanwhile on Tuesday a spokesman for German market regulator BaFin said it was looking into the VW share price movement for any sign of insider trading or market manipulation.\n\nPorsche denied it was manipulating the market and said that the market had mixed up cause with effect.\n\n“We vehemently reject the accusation of share price manipulation,” a spokesman for Porsche said. “The ones responsible are those that speculated with huge sums of money on a falling Volkswagen share price.”\n\nPorsche’s statement on Sunday revealed that it had raised its direct stake to 42.6 percent, held a further 31.5 percent in cash-settled stock options and that it intended to increase its holding in the world’s third largest carmaker to 75 percent next year.\n\nIt said it was announcing its plans because the number of short positions in VW were considerably higher than it expected and it consequently wanted to give investors the chance to unwind their bets “without haste and without greater risk.”\n\nAround 12.8 percent of Volkswagen’s entire market capitalization was on loan as of October 25, the most recent day for which data was available, according to financial market data consultant dataexplorers.com. This compared with an average 5 percent for all DAX stocks.\n\nThe “mother of all short squeezes,” as one analyst phrased it, led to an investor outcry alleging that they were duped by Porsche.\n\nDealers said those traders who had sold borrowed VW shares in the hope of buying them back at lower prices had been panicked by the announcement of Porsche’s holding.\n\n“Someone must have been very desperate to get a hold of the stock, so there will be a big surprise at some point who will have all these losses -- because someone must have lost a lot of money,” said Christian Schick, head of portfolio management in Germany for Fortis Investments.\n\nShares in Morgan Stanley MS.N, Goldman Sachs Group Inc GS.N and France's Societe Generale SOGN.PA all tumbled on Tuesday with traders saying there was speculation that the banks might be caught on the wrong side of trades involving Volkswagen.\n\nGoldman declined to comment, but people inside the company said it had no Volkswagen losses, while a Morgan Stanley spokesman said that the company has no exposure to the automaker. SocGen could not immediately be reached for comment, but earlier on Tuesday said it was sticking with its third-quarter earnings forecast.\n\nVOLKSWAGEN DAX WEIGHTING?\nShares in VW were up 45 percent at 689.9 euros by 1604 GMT, after tripling at one point in the previous session.\n\nThis meant they were trading at around 63 times expected earnings for 2009, at a massive premium to rivals such as Toyota Motor Corp 7203.T and Daimler DAIGn.DE.\n\nAnalysts and traders said the stampede was historic for German large caps, but they could foresee VW shares continuing to rise or stay at current levels.\n\n“The problem is, from a fundamental point of view, shares are really overvalued. But when the short squeeze comes to an end, there are not enough shares available to bring the share price back down,” said one Frankfurt-based analyst.\n\nDespite the massive rise in VW shares and talk of little free float remaining, the Frankfurt Stock Exchange said it did not plan any changes in the German blue-chip DAX index.\n\nBut Wolfgang Gerke, a member of the Frankfurt Stock Exchange’s Exchange Council, told manager magazin’s online portal that VW stock should be reweighted on the German DAX bluechip index as soon as possible.\n\nWhen asked about the current, nearly 17 percent weighting that Volkswagen’s stock has on the gauge, Gerke said: “Deutsche Boerse needs to act now and reduce VW’s weighting on the basis of its considerably lowered freefloat.”\n\nThe Finance Ministry declined to comment on the rise in the Volkswagen share price and the Economy Ministry did not respond to multiple calls seeking comment.\n\nhttps://www.marketwatch.com/story/squeeze-on-goldman-put-falcone-in-penalty-box-2013-08-21\n\nPhilip Falcone, the billionaire hedge-fund manager who must actually admit wrongdoing in a regulatory settlement, did something many people on Wall Street wish they could do.\n\nHe put a short squeeze on the Vampire Squid.\n\nIn 2006, Goldman Sachs GS, -2.53%  , as the great cephalopod is officially known, was shorting distressed high-yield bonds from a bathroom-fixtures manufacturer called MAAX Holdings Inc. Goldman, one of the most powerful investment banks in the world, was also encouraging its customers to do the same.\n\nPoor MAAX. The company was just trying to make shower doors, sinks and other products people need to wash themselves clean. Poor Falcone. His Harbinger Capital owned a ton of these MAAX bonds and Goldman was flushing them right down the drain.\n\nIt is an awful thing to learn Goldman is betting against a security when you are betting for it. People often respond to such news in crazy ways. You might remember a firm called Lehman Brothers, back in 2008, blaming the entire financial crisis on short-sellers — including a short-selling cabal led by Goldman. Lehman fired back by getting the Securities and Exchange Commission, to put a temporary ban on shorting certain stocks.\n\nAs for Falcone, well, he responded in his own way. He grew up playing hockey in a dying Minnesota mining town not far from the Canadian border. He made it to the pros in Sweden and now owns a piece of the NHL’s Minnesota Wild. In hockey, if another player smacks you against the wall, you find a way to rip off his helmet and pound his face.\n\nIn hockey, this is called sportsmanship.\n\nFalcone, according to his confessional settlement with the SEC, sought revenge against his opponent.\n\nFalcone bought up every piece of the MAAX bond offering there was. He even bought more than there was. According to the SEC, he purchased 22 million more bonds than had ever been issued (because on Wall Street, you can always buy stuff that doesn’t actually exist.)\n\nThis move to corner the market more than doubled the price of the bonds that Goldman was trying to short and it put Goldman right up against the wall. Goldman now had to buy these bonds to cover its short position.\n\nThat’s when Falcone said something like, “Hey, squid. You want some MAAX bonds? I got your MAAX bonds, right here,” and then demanded that Goldman pay significantly more than face value for the bonds.\n\nNow, I am certain that this play can righteously be labeled illegal market manipulation the same way punching someone in the head can be considered assault. This call doesn’t happen very often, though, in an arena where such violations occur all the time.\n\nThe SEC came down on Falcone a lot harder than it ever came down on the squid, forcing not just an $18 million settlement, and a five-year ban from the industry, but a rare admission that he actually did something wrong.\n\n“Today’s charges read like the final exam in a graduate-school course in how to operate a hedge fund unlawfully,” said Robert Khuzami, in 2012, when he was then director of the SEC’s enforcement division and announced the charges against Falcone.\n\nI, very naively, had no idea business schools taught such courses. Perhaps now that Falcone has been banned from his industry, he can go back to his alma mater, Harvard University, and teach them.\n\n“Clients and market participants alike were victimized as Falcone … manipulated the market for certain bonds … and violated trading rules intended to prohibit manipulative short sales,” Khuzami added.\n\nhttps://moxreports.com/kbio-infinity-squeeze/\n\n[Removed to keep within character limit]\n\nhttps://nypost.com/2017/11/01/ackman-has-bailed-out-of-his-short-position-on-herbalife/\n\nAfter nearly five years of punishing paper losses and mockery on Wall Street, Bill Ackman has finally given up his $1 billion short bet against Herbalife.\n\nThe embattled hedge-fund tycoon still insists that the giant supplements distributor is a “pyramid scheme,” and has spent heavily on a new batch of put options that will pay off if Herbalife’s stock falls.\n\nBut Ackman also admitted Wednesday that the big, bold short bet his hedge fund Pershing Square Capital made against Herbalife in 2012 now looks too risky to stomach any longer.\n\nHerbalife shares are up more than 50 percent this year, due in part to a stock buyback completed last month by the company, which vehemently denies Ackman’s allegations that it practices a predatory business model.\n\nThe rally has likewise been driven by investors anticipating a “short-squeeze,” in which short sellers would have quickly buy back the stock they’ve sold to make their bearish bets — a move that also drives up the price.\n\nAmong those who have bet directly against Ackman on Herbalife is his nemesis, billionaire Carl Icahn, who now owns nearly a quarter of Herbalife shares.\n\n“There is no longer an opportunity to squeeze Pershing Square,” Ackman said in a Wednesday interview with CNBC.\n\nInstead of shorting Herbalife, Ackman is now shelling out cash for put options, which will pay off if Herbalife shares drop but which don’t pose the risk of a short squeeze.\n\nUnlike holding shares short, where Pershing Square’s losses could be unlimited, Ackman said losses would now be capped at 3 percent of capital — what he called “modest investment.”\n\nNevertheless, “They’re going to charge Ackman a premium … for the privilege of him owning a put,” Ihor Dusaniwsky, head of predictive analytics at financial analytics firm S3 Partners told The Post.\n\nAckman’s dealer — who sold the put option — now holds the short position, according to Dusaniwksy.\n\n“Ackman has increased his expenses but he has increased his safety,” Dusaniwsky said, estimating that this year alone Ackman has faced an estimated $455 million paper loss on Herbalife.\n\nPershing Square declined to comment on its Herbalife paper losses, or the premiums it has paid to drop its short bet, or the terms on the new put options it has purchased.\n\nBut that didn’t stop Ackman on Wednesday from continuing to defend his costly war against the company.\n\n“We’ve been entirely right on our Herbalife investment in terms of the fundamentals of the business. We’ve been wrong on the share price,” Ackman told CNBC.\n\nHerbalife’s stock has more than doubled since Ackman announced his short position. An investigation by the Federal Trade Commission that concluded last year tore into Herbalife’s business practices but stopped short of calling it a pyramid scheme and shutting it down.\n\nPershing Square is down 5.8 percent through the end of September.\n\nReps from Herbalife did not respond to requests to comment.\n\nHerbalife shares were down 2.4 percent at $70.85 Wednesday.\n\nhttps://medium.com/@KeithAkre/vanderbilt-and-the-greatest-corner-never-told-12f1bffe4d1d\n\nThe Harlem and the Hudson were both poorly run, lightly traveled rail lines that were not thought of as highly valuable. Vanderbilt saw that these lines were the only rails allowed to come directly onto Manhattan island. Sensing an opportunity, he started to accumulate shares in Harlem.\n\nAt the same time Vanderbilt was buying, there was a large contingent of players who were selling the shares short. That is, they were borrowing shares, and selling, with the hope to buy them back at a lower price, netting the difference. This group of sellers (bears, in Wall Street parlance) included members of the New York City council as well as members of the board of directors for Harlem rail! One of those board members was long-time Vanderbilt rival, Daniel Drew.\n\nWith all these inside interests betting on the price of Harlem to go down, there had to be something going on. Sure enough, a franchise bill that authorized Harlem to lay a double track was suddenly rescinded. The price dropped suddenly on the news and all the short sellers expected to clean up and declare victory — except that Mr. Vanderbilt was still on the other side, buying everything that was being sold. Not only did the stock stop going down, but it started to rise quickly.\n\nNow for those that do not know, shorting a stock can be a dangerous business. When you buy a stock (go long) you only have your investment to lose. If you pay $100 for a stock, it can only go to $0, thereby wiping out your investment. However, if you borrow a stock and sell it short, there is technically no limit to high it could go before you must buy it back to cover your borrowing. If you borrow shares and sell them at $100 and the price goes to $200, you have lost your entire investment. But if the price goes to $300 or $400, you would be on the hook for more multiple times your initial position.\n\nNow imagine one person owns the entire supply of stock. If you sold it short at $100, and now you have to buy it back to cover your position, what price does the owner set? This is the danger of being caught short when someone has ‘cornered’ the market. As John Brooks explains in his classic “Once in Golconda:\n“Since a successful cornerer may theoretically set an infinite price, any finite one is a theoretically a bargain.”\nThis is what happened to the short sellers of Harlem stock. Vanderbilt and his allies had purchased the entire supply and had them at their mercy. In order to escape complete ruin, the city council gave back Harlem’s franchise which now Vanderbilt owned outright.\n\nAlready, this was one of the most successful corners of a market in history and made the Commodore a ton of money in the process. However, this was just the beginning.\n\nWatching this epic battle unfold, some Wall Street speculators decided to attack the neighboring Hudson rail line. This group thought that Vanderbilt must be short of cash (after all that buying) and attention, and so went heavily short hoping to drive the price down and make themselves a tidy profit. What they did not know, was that Vanderbilt was already one step ahead and actually perpetuated the rumor that he was short on cash by weakly buying Hudson shares using futures. This was a common strategy for buyers short on cash because it was merely a promise to buy at a later date. The intermediaries Vanderbilt used were actually part of the short-selling group, who would gladly accept the options from the Commodore and then turned around and sold the stock into the market.\n\nLittle did the bears know, they were selling this stock to allies of Vanderbilt, who far from being short on cash, still had plenty of powder left. When, finally, he demanded delivery of the stock he purchased, the sellers had to go into the market to buy it back and found no sellers except Vanderbilt himself. Mercifully, instead of raising the price to infinity, Vanderbilt let the short-sellers off relatively easy. They weren’t ruined, merely badly burned.\nWithin the span of a couple months, Cornelius Vanderbilt acquired full control of the only two railways with access to Manhattan and made a substantial fortune in the process.\n\nDaniel Drew, still stung from his losses in the failed Harlem short, decided he wanted one more crack. He convinced a few law makers in the state capitol of Albany to revoke the franchise for Harlem, overriding the city council. If they revoked the license and shorted Harlem stock, they could make a bit of money as well. This turned out to be a fateful mistake.\n\nFrom The Great Game:\n\n“Drew’s scheme was, of course, a carbon copy of what cost the members of the city council so dearly the previous spring. One is at a loss to explain how they could have been tempted. ‘The statesmen at Albany,’ E.C. Stedman, a veteran of Wall Street in the 1860’s, wrote at the turn of the century, ‘in the spring of 1864, were well aware of the misfortune into which the statesmen at New York had plunged themselves, less than a year before, by their bear campaign against this stock. Yet they rushed fatuously into a similar attempt, as if Vanderbilt has proved an easy victim.’”\n\nInterestingly, the timing on this second attempt to ‘bear raid’ Harlem stock was in favor of the shorts. The price went from $140 down to $101. The greed of speculators who always hope to make more money was on full display here. Instead of covering at a net profit of almost $40 per share, the shorts tried to press their advantage. “They held on, hoping to see it drop to $50”\n\nDespite really not being very liquid this time around, the Commodore was still not easily defeated. He rallied his allies and raised cash to buy up the last remaining supply of the stock. The price rose to $109, then to $125, and by the end of April was all the way to $224. Feeling less charitable than the last time, Vanderbilt was asked by his brokers where to set the price. “Asked what to do, he bellowed, ‘Put it to a thousand!’”\n\nFortunately for the shorts, (and their brokerage houses, who also would have been decimated at that price), Vanderbilt relented and settled at $285.\n\n“The second Harlem corner was over and there would not be another. Indeed, for a full generation on Wall Street, the phrase, ‘short of Harlem’, meant much the same thing as ‘up the creek’”",
        "subreddit": "wallstreetbets",
        "title": "History of short squeezes and corners",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ltnc32/history_of_short_squeezes_and_corners/",
        "created": 1614458489.0
    },
    {
        "author": "jamesonc92",
        "created_utc": 1613184398,
        "id": "lirggf",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "**TLDR: Buy $CMPS. Huge untapped market about to explode.**\n\n**INTRODUCTION**\n\n1. CMPS is a biotech company that has received breakthrough therapy status from the FDA and is using a patented synthetic version of psilocybin (i.e., the active agent in “magic mushrooms”) to target the treatment-resistant depression (TRD) market of &gt;100 million people who have tried two or more existing treatments without success.\n2. To be clear, COMPASS Pathways is a biotech/pharma company with world-class thinkers and investors. This is not about recreational drug use.\n3. Thiel is an investor, owning 7.5% of this, along with other big names.\n\n**THE TEAM**\n\n4. CMPS’ stacked board of directors and scientific advisory board includes:• David Norton – former Chairman of Global Pharmaceuticals giant Johnson &amp; Johnson• Tom Insel – former Director of the US National Institute of Mental Health (NIMH) and co-founder of Mindstrong Health• Thomas Lonngren – former executive director of the EMA (i.e., the European FDA)• Professor Alan Schatzberg – Director at the Stanford Mood Disorders Center and Professor of Psychiatry at the Department of Psychiatry and Behavioural Sciences at Stanford University School of Medicine• Professor David Nutt – Neuropsychopharmacology chair at the Imperial College London, President of the The European Brain Council• Chief Development Officer Trevor Mill who spent the past 25 years at Biogen, Pfizer and Johnson &amp; Johnson leads the CMPS R&amp;D department.\n\n**PRICE TARGET**\n\n“You get paid in direct proportion to the difficulty of problems you solve” ― Elon Musk\n\n5. The TAM for people with depression who have failed two or more previous treatments is over 100 million people. There has not been much innovation in mental health since the invention of Prozac in 1988.\n\n6. Tom Insel, former Director of the US National Institute of Mental Health (NIMH) stated: \"Mental healthcare needs innovation… The COMPASS medication-assisted psychotherapy strategy is innovative in that it integrates medication and psychotherapy. And it is disruptive by offering patients a treatment that many people prefer.”\n\n7. At a current market cap of 1.6B, the PT is to reach the same market cap as Tilray during the weed boom; implying a **10x** valuation to $500 a share.\n\n**CATALYST**\n\n8. Biden Administration. With the push for weed legilisation, the next step would be psychedelics, where the results have been astounding for depression (also many other uses, like reduced smoking, binge drinking, etc)\n\n9. FDA Approval - Expected 2022 - 2023. Phase 2b trial data available late this year. Expecting a huge pop when the data shows late this year. Phase 1a trial showed an incredible efficiency of 4/5 patients with significant improvement (No data collected on the 1/5 patients).\n\n**FUNDAMENTALS**\n\n10. Looking at the 4H chart, the resistance SMA has become the support for current price action, with a clear bounce off the SMA line. RSI showing a reversal. (can't post photos on this thread, go look yourself)\n\n11. Current market cap of only $1.6B.\n\n**CONS**\n\n12. Biggest drawback is that the company only has one drug (as far as the public knows). You are essentially banking it all on this one drug.\n\n13. Company makes $0 revenue now. Its all R&amp;D.\n\n**CONCLUSION**\n\nEarly mover's advantage from CMPS, pioneering the use of psychedelics to combat mental illnesses. My personal 10 bagger stock, with 250 shares in.",
        "subreddit": "investing",
        "title": "$CMPS Psychedelics - the new weed",
        "url": "https://www.reddit.com/r/investing/comments/lirggf/cmps_psychedelics_the_new_weed/",
        "created": 1613213198.0
    },
    {
        "author": "Suspicious__Man",
        "created_utc": 1612743164,
        "id": "lezexx",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "This is a biotech stock and also my first DD here so there may be some stuff I'm not seeing, hoping people can help fill in the blanks if I'm missing anything you lot normally provide in DDs or at least question me on stuff I may have missed.\n\nMVMDF is the holding company for Mountain Valley MD Inc, a Canadian biotech company which is focused on innovative delivery methods for pharmaceuticals. They have a few different technologies, Quicksome and Quicksol. They're listed now on Pink but they've applied to OTCQB (here's a link to the application: https://backend.otcmarkets.com/otcapi/company/financial-report/270079/content)\n\nFrom their website:\nQuicksome:\n&gt;Patented Quicksome™ liposome technology utilizes an advanced 2-step encapsulation and desiccation process to formulate normally highly un-bioavailable active ingredients into highly effective oral dissolving product formats.\n\nQuicksol:\n&gt;Patented Quicksol™ technology for macrocyclic lactones, including Ivermectin and Selamectin, to enable injection or liquid application of poorly soluble drugs to enhance bioavailability orally and transdermally.\n\n\n\nIt looks like they're going to try to leverage this tech by licensing it to other pharmacutical companies. Essentially, take other companies drugs and make them more effective, increase dosing precision, simplify storage/transporation/production and reduce production costs, and reduce the need for drugs to be injected or even swallowed in some cases. Right now it looks like they're working primarily with the polio vaccine and ivermectin (an antiparisite medication).\n\n\n\nThe polio vaccine is being tested with an adjuvant they invented which decreases the amount of vaccine needed, they have a study which starts this month and which they think will take 60 days under the direction of Dr. Elisabeth Norton at Tulane. I looked her up on researchgate, 27 publications and 567 citations, her expertise is vaccines and immune response, and it looks like she's been doing research on dose sparing and polio in the past so this seems right up her alley. Here's the press release for that study from 5 days ago: https://www.newswire.ca/news-releases/mountain-valley-md-contracts-tulane-university-for-adjuvant-ipv-study-858231690.html\n\n\n\nThe ivermectin they're testing with their technology to see if it will actually stop Covid. Turns out ivermectin might have antiviral properties as well as being an antiparisite medication, but seems like it isn't feasible to use because of how much you have to take... MVMD's technology supposedly will remedy this. I'm more skeptical of this than I am of the polio work just because of all the hype there is for covid cures, but it looks like there have been a number of studies on it, and MVMD apparently got greenlit to use a BSL-4 lab to test if their quicksol solubilized ivermectin clears up covid. Study starts later this month and results are anticipated in April. The study design was apparently done by Dr. John Clements, and he seems like sort of a big deal in immunology/vaccines. He's got 152 research works and 8,008 citations on researchgate and is an Emeritus Professor of Microbiology and Immunology at Tulane. Here's the press release for that study: https://www.newswire.ca/news-releases/mountain-valley-md-proceeding-with-covid-19-clearance-trial-in-level-4-biohazard-facility-885458971.html\n\n\n\nAfter looking at what the company was doing, the next thing I did was look to see if it was getting pushed a bunch on reddit. I found an account that looked like they were shilling for it a bunch and I think they got some stuff wrong in their DD, but they disclosed their position and it wasn't getting spammed by a bunch of 2 week old accts, so I think that it's just an enthusiastic investor and not some group pumping the stock. The stock itself has been pretty flat for the past week too, though it has gone up about $1 in the last month. Market Cap for the company is ~336M, and I generally feel comfortable with anything &gt;250M so I'm OK with that, volume isn't too irregular but does seem to be up a bit since the end of January. Public float is ~70%. We're in a bit of a dip now for the last few days so I'm not too worried about entering as a bagholder on monday for some pump and dump.\n\n\n\nOnce I was satisfied there I went to check the company out a bit more and dig around a bit. They have a website:\nhttps://www.mountainvalleymd.com/\nWhich looks like it's pretty marketing focused, but I think at this point in the game that isn't necessarily a bad thing, they're trying to raise money/license their product after all. It's well put together, and there are a bunch of press and media updates regarding their moves.\n\n\n\nTheir head office is listed as 260 Edgeley Blvd. - Unit 4, Concord, Ontario, Canada L4K 3Y4. Looking at it on google maps, it looks like the location is a Lab Works International office as of 2019, the last time google updated the street view. That raised a red flag so I went on Lab Works International website, but it seems like they've moved relatively recently (https://labworksinternational.com/moving.php). Going through all of the press releases on MVMDF's website revealed that they were releasing them from Vancouver up into December 2020, and then switched to Tornoto, so I think it's a recent move and everything is probably OK on that front. I'm not sure how to go about checking canadian business/property records, but there potentially is an avenue there to double check.\n\n\n\n\nI don't have as much financial information as I'd like because I'm not familiar with Canadian regulatory requirements, but I did have luck tracking down some disclosures here:\n\nhttps://www.otcmarkets.com/stock/MVMDF/disclosure\n\nmost of it seems like it's somewhat out of date, the stuff from Sept. 20 seems most relevant. I looked through their financial report from September (here: https://backend.otcmarkets.com/otcapi/company/financial-report/269950/content) and through the management guidance docs (here: https://backend.otcmarkets.com/otcapi/company/financial-report/269951/content). It looks like they're working on discussions to license already, and they did mention in their January 11 press release that “Mountain Valley MD has zero debt and our incredibly strong cash position enables us to continue our focus on execution with minimal financial distraction.” The fact that they have no debt is encouraging. They also apparently just got a binding letter of intent to enter into a license agreement for their Quicksome technology, which gives them a bit of revenue to extend their runway. That said I kind of expect them to have to raise more capital at some point so we'll see what happens there, that's definitely one of the risks of investing this early.\n\n\n\n\nNo idea what a good price target is for this, if they are successful with their trials and have encouraging results from the Covid study in April I'd expect to make $$$, because that means ivermectin could be used as an antiviral using their technology which seems like a huge upside. If their vaccine dosing technology trial also works then even more $$$ because they've essentially changed the whole supply chain for pharmacuteicals at that point. \n\n\n\n\nDownside:\nIf the results from the trials are bad then no $$$. Boo. Doesn't look like they have a long runway either so if they can't license with other companies they will have to raise more cash which probably means dilution. Could also just be that they go belly up but obviously that's always a risk with these small fry.\n\n\n\n\nThis DD is definitely not comprehensive and is not financial advice, I wouldn't even say it's a particularly great DD given that it's my first one written up like this, it's just a learning exercise for myself mostly. Do your own DD obviously. I didn't even intend on doing this but I started researching after the other person posting about MVMDF claimed there was a BSL-4 lab at Tulane and I wanted to prove them wrong (there isn't, but the actual press release didn't say there was either, he just misread it I guess). Figured I'd post it and see what else people could pick apart.\n\n\nPosition: Currently 500 @ 1.34, probably more next week assuming someone doesn't shake my confidence in the comments here haha",
        "subreddit": "pennystocks",
        "title": "$MVMDF - Biotech stock with some potential upsides in April",
        "url": "https://www.reddit.com/r/pennystocks/comments/lezexx/mvmdf_biotech_stock_with_some_potential_upsides/",
        "created": 1612771964.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "jamesonc92",
        "created_utc": 1613209773,
        "id": "lixo45",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " \n\n**TLDR: Buy $CMPS. Huge untapped market about to explode.**\n\n**INTRODUCTION**\n\n1. CMPS is a biotech company that has received breakthrough therapy status from the FDA and is using a patented synthetic version of psilocybin (i.e., the active agent in “magic mushrooms”) to target the treatment-resistant depression (TRD) market of &gt;100 million people who have tried two or more existing treatments without success.\n2. To be clear, COMPASS Pathways is a biotech/pharma company with world-class thinkers and investors. This is not about recreational drug use.\n3. Thiel is an investor, owning 7.5% of this, along with other big names.\n\n**THE TEAM**\n\n4. CMPS’ stacked board of directors and scientific advisory board includes:  \n• David Norton – former Chairman of Global Pharmaceuticals giant Johnson &amp; Johnson  \n• Tom Insel – former Director of the US National Institute of Mental Health (NIMH) and co-founder of Mindstrong Health  \n• Thomas Lonngren – former executive director of the EMA (i.e., the European FDA)  \n• Professor Alan Schatzberg – Director at the Stanford Mood Disorders Center and Professor of Psychiatry at the Department of Psychiatry and Behavioural Sciences at Stanford University School of Medicine  \n• Professor David Nutt – Neuropsychopharmacology chair at the Imperial College London, President of the The European Brain Council  \n• Chief Development Officer Trevor Mill who spent the past 25 years at Biogen, Pfizer and Johnson &amp; Johnson leads the CMPS R&amp;D department.\n\n**PRICE TARGET**\n\n“You get paid in direct proportion to the difficulty of problems you solve” ― Elon Musk\n\n5. The TAM for people with depression who have failed two or more previous treatments is over 100 million people. There has not been much innovation in mental health since the invention of Prozac in 1988.\n\n6. Tom Insel, former Director of the US National Institute of Mental Health (NIMH) stated: \"Mental healthcare needs innovation… The COMPASS medication-assisted psychotherapy strategy is innovative in that it integrates medication and psychotherapy. And it is disruptive by offering patients a treatment that many people prefer.”\n\n7. At a current market cap of 1.6B, the PT is to reach the same market cap as Tilray during the weed boom; implying a **10x** valuation to $500 a share.\n\n**CATALYST**\n\n8. Biden Administration. With the push for weed legilisation, the next step would be psychedelics, where the results have been astounding for depression (also many other uses, like reduced smoking, binge drinking, etc)\n\n9. FDA Approval - Expected 2022 - 2023. Phase 2b trial data available late this year. Expecting a huge pop when the data shows late this year. Phase 1a trial showed an incredible efficiency of 4/5 patients with significant improvement (No data collected on the 1/5 patients).\n\n**FUNDAMENTALS**\n\n[4H CMPS Chart](https://preview.redd.it/18hnx7ebv7h61.jpg?width=1671&amp;format=pjpg&amp;auto=webp&amp;s=c7495739d281ab169f4baa5926e2e9ead927d98f)\n\n&amp;#x200B;\n\n10. Looking at the 4H chart, the resistance SMA has become the support for current price action, with a clear bounce off the SMA line. RSI showing a reversal.\n\n11. Current market cap of only $1.6B.\n\n**CONS**\n\n12. Biggest drawback is that the company only has one drug (as far as the public knows). You are essentially banking it all on this one drug.\n\n13. Company makes $0 revenue now. Its all R&amp;D.\n\n**CONCLUSION**\n\nEarly mover's advantage from CMPS, pioneering the use of psychedelics to combat mental illnesses. My personal 10 bagger stock, with 250 shares in.",
        "subreddit": "pennystocks",
        "title": "$CMPS Psychedelics - the new weed.",
        "url": "https://www.reddit.com/r/pennystocks/comments/lixo45/cmps_psychedelics_the_new_weed/",
        "created": 1613238573.0
    },
    {
        "author": "FikerGaming",
        "created_utc": 1613766331,
        "id": "lnplr1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " So hedge funds use alot time and money to find what stocks are trending on WSB sub pages. so here are some to help them out. They need our help, you are welcome hedge funds.\n\nfeel free to copy this and spread it.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The hedge funds need our Help.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lnplr1/the_hedge_funds_need_our_help/",
        "created": 1613795131.0
    },
    {
        "author": "royt17",
        "created_utc": 1613143035,
        "id": "lid2d7",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Yo get in these tenders @NLOK",
        "url": "https://i.redd.it/7012j4xxc2h61.jpg",
        "created": 1613171835.0
    },
    {
        "author": "jamesonc92",
        "created_utc": 1613210117,
        "id": "lixqlq",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\n**TLDR: Buy $CMPS. Huge untapped market about to explode.**\n\n**INTRODUCTION**\n\n1. CMPS is a biotech company that has received breakthrough therapy status from the FDA and is using a patented synthetic version of psilocybin (i.e., the active agent in “magic mushrooms”) to target the treatment-resistant depression (TRD) market of &gt;100 million people who have tried two or more existing treatments without success.\n2. To be clear, COMPASS Pathways is a biotech/pharma company with world-class thinkers and investors. This is not about recreational drug use.\n3. Thiel is an investor, owning 7.5% of this, along with other big names.\n\n**THE TEAM**\n\n4. CMPS’ stacked board of directors and scientific advisory board includes:  \n• David Norton – former Chairman of Global Pharmaceuticals giant Johnson &amp; Johnson  \n• Tom Insel – former Director of the US National Institute of Mental Health (NIMH) and co-founder of Mindstrong Health  \n• Thomas Lonngren – former executive director of the EMA (i.e., the European FDA)  \n• Professor Alan Schatzberg – Director at the Stanford Mood Disorders Center and Professor of Psychiatry at the Department of Psychiatry and Behavioural Sciences at Stanford University School of Medicine  \n• Professor David Nutt – Neuropsychopharmacology chair at the Imperial College London, President of the The European Brain Council  \n• Chief Development Officer Trevor Mill who spent the past 25 years at Biogen, Pfizer and Johnson &amp; Johnson leads the CMPS R&amp;D department.\n\n**PRICE TARGET**\n\n“You get paid in direct proportion to the difficulty of problems you solve” ― Elon Musk\n\n5. The TAM for people with depression who have failed two or more previous treatments is over 100 million people. There has not been much innovation in mental health since the invention of Prozac in 1988.\n\n6. Tom Insel, former Director of the US National Institute of Mental Health (NIMH) stated: \"Mental healthcare needs innovation… The COMPASS medication-assisted psychotherapy strategy is innovative in that it integrates medication and psychotherapy. And it is disruptive by offering patients a treatment that many people prefer.”\n\n7. At a current market cap of 1.6B, the PT is to reach the same market cap as Tilray during the weed boom; implying a **10x** valuation to $500 a share.\n\n**CATALYST**\n\n8. Biden Administration. With the push for weed legilisation, the next step would be psychedelics, where the results have been astounding for depression (also many other uses, like reduced smoking, binge drinking, etc)\n\n9. FDA Approval - Expected 2022 - 2023. Phase 2b trial data available late this year. Expecting a huge pop when the data shows late this year. Phase 1a trial showed an incredible efficiency of 4/5 patients with significant improvement (No data collected on the 1/5 patients).\n\n**FUNDAMENTALS**\n\n*Processing img 2tbyz46ew7h61...*\n\n&amp;#x200B;\n\n10. Looking at the 4H chart, the resistance SMA has become the support for current price action, with a clear bounce off the SMA line. RSI showing a reversal.\n\n11. Current market cap of only $1.6B.\n\n**CONS**\n\n12. Biggest drawback is that the company only has one drug (as far as the public knows). You are essentially banking it all on this one drug.\n\n13. Company makes $0 revenue now. Its all R&amp;D.\n\n**CONCLUSION**\n\nEarly mover's advantage from CMPS, pioneering the use of psychedelics to combat mental illnesses. My personal 10 bagger stock, with 250 shares in.",
        "subreddit": "shroomstocks",
        "title": "$CMPS the new weed",
        "url": "https://www.reddit.com/r/shroomstocks/comments/lixqlq/cmps_the_new_weed/",
        "created": 1613238917.0
    },
    {
        "author": "royt17",
        "created_utc": 1613226850,
        "id": "lj1lcx",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "NLOK, the self-hatred is mutual, bro. Come get these tendies before I hoard them at .01",
        "url": "https://i.redd.it/oxhfljz5a9h61.jpg",
        "created": 1613255650.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "royt17",
        "created_utc": 1613153051,
        "id": "ligqtv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "BUY NLOK, look at all these numbers!",
        "url": "https://i.redd.it/q0uts81q63h61.jpg",
        "created": 1613181851.0
    },
    {
        "author": "royt17",
        "created_utc": 1613226700,
        "id": "lj1jrf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "NLOK, guess what? YOU CANT HATE ME MORE THAN I HATE MYSELF! HAH",
        "url": "https://i.redd.it/kioq0ivp99h61.jpg",
        "created": 1613255500.0
    },
    {
        "author": "Beginning-Leather-98",
        "created_utc": 1612226230,
        "id": "laiz0k",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "NLOK quicky",
        "url": "https://www.reddit.com/r/investing/comments/laiz0k/nlok_quicky/",
        "created": 1612255030.0
    },
    {
        "author": "royt17",
        "created_utc": 1613072444,
        "id": "lhsqri",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I really don’t know what I’m doing, NLOK 187 @.07 2/19",
        "url": "https://i.redd.it/de6bjmb1jwg61.jpg",
        "created": 1613101244.0
    },
    {
        "author": "JaytotheEnny",
        "created_utc": 1613762830,
        "id": "lno8kc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I heard about all of the hedge funds working really, really hard on building these trackers that crawl through all of our posts looking for the next big hit. I feel so bad for those little-widdle hedgie funds and wanted to put together a great list for them. \n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JAP, JAP, JAP JAP, JAP JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TATE, TATE, TATE, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Here are some stocks that I like- for all those trackers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lno8kc/here_are_some_stocks_that_i_like_for_all_those/",
        "created": 1613791630.0
    },
    {
        "author": "danhoeg",
        "created_utc": 1613660829,
        "id": "lmos70",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "February 17, 2021 02:44 PM ET (BZ Newswire) -- News     \n\nThe latest round of 13F filings from institutional investors is out,        revealing to the world the stocks that some of the richest and most        successful investors have been buying and selling.     \n\n**Takeaways From 13F Season:** Investors who follow        particular fund managers can easily look up what each was buying and        selling in the quarter, but other investors may be more interested in        overall themes from 13F filings. The fourth quarter of 2020 was a big        quarter for the S&amp;P 500, and investors were likely interested in what        top managers were buying and selling heading into 2021.     \n\nGoogle parent Alphabet has the attention of fund managers in Q4, with        Tepper and Klarman selling and Soros buying.     \n\nAuto stocks have been hot in the market, and Cooperman was buying        General Motors on the strength while Soros was taking profits.     \n\nBuffett took huge new positions in Verizon and Chevron, both of which        pay dividend yields above 4.4%. Buffett also reduced exposure to bank        stocks in the quarter, selling Wells Fargo, JPMorgan, M&amp;T and PNC.     \n\nSeveral fund managers traded ETFs to play particular themes. Tepper bet        on the Energy Sector by buying the XLE fund while Soros made a big bet        on emerging markets by buying the EEM fund.     \n\nHere’s a rundown of how the smart money was playing some of the most        popular stocks last quarter.     \n\n*Related Link:* [*What        Warren Buffett Says About High-Profile IPOs Like Airbnb, DoorDash*](https://www.benzinga.com/analyst-ratings/analyst-color/20/12/18755198/what-warren-buffett-says-about-high-profile-ipos-like-airbnb-doordash)  \n\n**David Einhorn’s Greenlight Capital**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Danimer Scientific Inc** (NYSE:[DNMR](https://www.benzinga.com/stock/DNMR#NYSE))       \n* **Fubotv Inc** (NYSE:[FUBO](https://www.benzinga.com/stock/FUBO#NYSE))       \n* **Concentrix Corp** (NASDAQ:[CNXC](https://www.benzinga.com/stock/CNXC#NASDAQ))       \n* **Dillard's, Inc.** (NYSE:[DDS](https://www.benzinga.com/stock/DDS#NYSE))       \n* **Sonos Inc** (NASDAQ:[SONO](https://www.benzinga.com/stock/SONO#NASDAQ))       \n* **Consol Energy Inc** (NYSE:[CEIX](https://www.benzinga.com/stock/CEIX#NYSE))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **Intel Corporation** (NASDAQ:[INTC](https://www.benzinga.com/stock/INTC#NASDAQ))       \n* **Jack in the Box Inc.** (NASDAQ:[JACK](https://www.benzinga.com/stock/JACK#NASDAQ))       \n* **AerCap Holdings N.V.** (NYSE:[AER](https://www.benzinga.com/stock/AER#NYSE))       \n\n**David Tepper’s Appaloosa Management**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Amazon.com, Inc.** (NASDAQ:[AMZN](https://www.benzinga.com/stock/AMZN#NASDAQ))       \n* **Occidental Petroleum Corporation** (NYSE:[OXY](https://www.benzinga.com/stock/OXY#NYSE))       \n* **Energy Select Sector SPDR Fund** (NYSE:[XLE](https://www.benzinga.com/stock/XLE#NYSE))       \n* **QUALCOMM, Inc.** (NASDAQ:[QCOM](https://www.benzinga.com/stock/QCOM#NASDAQ))       \n* **Facebook, Inc.** (NASDAQ:[FB](https://www.benzinga.com/stock/FB#NASDAQ))       \n* **Microsoft Corporation** (NASDAQ:[MSFT](https://www.benzinga.com/stock/MSFT#NASDAQ))       \n* **Twitter Inc** (NYSE:[TWTR](https://www.benzinga.com/stock/TWTR#NYSE))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **PG&amp;E Corporation** (NYSE:[PCG](https://www.benzinga.com/stock/PCG#NYSE))       \n* **Micron Technology, Inc.** (NASDAQ:[MU](https://www.benzinga.com/stock/MU#NASDAQ))       \n* **AT&amp;T Inc.** (NYSE:[T](https://www.benzinga.com/stock/T#NYSE))       \n* **Alibaba Group Holding Ltd - ADR** (NYSE:[BABA](https://www.benzinga.com/stock/BABA#NYSE))       \n* **Alphabet, Inc.** (NASDAQ:[GOOG](https://www.benzinga.com/stock/GOOG#NASDAQ))          (NASDAQ:[GOOGL](https://www.benzinga.com/stock/GOOGL#NASDAQ))       \n* **Netflix Inc** (NASDAQ:[NFLX](https://www.benzinga.com/stock/NFLX#NASDAQ))       \n\n**Leon Cooperman’s Omega Advisors**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Mp Materials Corp** (NYSE:[MP](https://www.benzinga.com/stock/MP#NYSE))       \n* **General Motors Company** (NYSE:[GM](https://www.benzinga.com/stock/GM#NYSE))       \n* **Barings BDC Inc** (NYSE:[BBDC](https://www.benzinga.com/stock/BBDC#NYSE))       \n* **Energy Transfer LP Unit** (NYSE:[ET](https://www.benzinga.com/stock/ET#NYSE))       \n* **Comcast Corporation** (NASDAQ:[CMCSA](https://www.benzinga.com/stock/CMCSA#NASDAQ))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **AMC NETWORKS INC** (NASDAQ:[AMCX](https://www.benzinga.com/stock/AMCX#NASDAQ))       \n\n**Barry Rosenstein’s Jana Partners**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Laboratory Corp. of America Holdings** (NYSE:[LH](https://www.benzinga.com/stock/LH#NYSE))       \n* **W R Grace &amp; Co** (NYSE:[GRA](https://www.benzinga.com/stock/GRA#NYSE))       \n* **Tegna Inc.** (NYSE:[TGNA](https://www.benzinga.com/stock/TGNA#NYSE))       \n* **TreeHouse Foods Inc.** (NYSE:[THS](https://www.benzinga.com/stock/THS#NYSE))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **Callaway Golf Co** (NYSE:[ELY](https://www.benzinga.com/stock/ELY#NYSE))       \n\n**Jeff Smith’s Starboard Value**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **ON Semiconductor** (NASDAQ:[ON](https://www.benzinga.com/stock/ON#NASDAQ))       \n* **ACI Worldwide** (NASDAQ:[ACIW](https://www.benzinga.com/stock/ACIW#NASDAQ))       \n* **Corteva** (NYSE:[CTVA](https://www.benzinga.com/stock/CTVA#NYSE))       \n* **NortonLifeLock** (NASDAQ:[NLOK](https://www.benzinga.com/stock/NLOK#NASDAQ))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **Advance Auto Parts** (NYSE:[AAP](https://www.benzinga.com/stock/AAP#NYSE))       \n* **ComScore** (NASDAQ:[SCOR](https://www.benzinga.com/stock/SCOR#NASDAQ))       \n\n**Warren Buffett’s Berkshire Hathaway**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Verizon Communications Inc.** (NYSE:[VZ](https://www.benzinga.com/stock/VZ#NYSE))       \n* **Merck &amp; Co., Inc.** (NYSE:[MRK](https://www.benzinga.com/stock/MRK#NYSE))       \n* **AbbVie Inc** (NYSE:[ABBV](https://www.benzinga.com/stock/ABBV#NYSE))       \n* **T-Mobile Us Inc** (NASDAQ:[TMUS](https://www.benzinga.com/stock/TMUS#NASDAQ))       \n* **Chevron Corporation** (NYSE:[CVX](https://www.benzinga.com/stock/CVX#NYSE))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **Apple Inc** (NASDAQ:[AAPL](https://www.benzinga.com/stock/AAPL#NASDAQ))       \n* **Wells Fargo &amp; Co** (NYSE:[WFC](https://www.benzinga.com/stock/WFC#NYSE))       \n* **Barrick Gold Corp** (NYSE:[GOLD](https://www.benzinga.com/stock/GOLD#NYSE))       \n* **M&amp;T Bank Corporation** (NYSE:[MTB](https://www.benzinga.com/stock/MTB#NYSE))       \n* **PNC Financial Services Group Inc** (NYSE:[PNC](https://www.benzinga.com/stock/PNC#NYSE))       \n* **Pfizer Inc.** (NYSE:[PFE](https://www.benzinga.com/stock/PFE#NYSE))       \n* **JPMorgan Chase &amp; Co.** (NYSE:[JPM](https://www.benzinga.com/stock/JPM#NYSE))       \n\n**George Soros’ Soros Fund Management**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Quantumscape Corp** (NYSE:[QS](https://www.benzinga.com/stock/QS#NYSE))       \n* **iShares MSCI Emerging Markets ETF** (NYSE:[EEM](https://www.benzinga.com/stock/EEM#NYSE))       \n* **Walt Disney Co** (NYSE:[DIS](https://www.benzinga.com/stock/DIS#NYSE))       \n* **Amazon.com, Inc.** (NASDAQ:[AMZN](https://www.benzinga.com/stock/AMZN#NASDAQ))       \n* **Nike Inc** (NYSE:[NKE](https://www.benzinga.com/stock/NKE#NYSE))       \n* **Uber Technologies Inc** (NASDAQ:[UBER](https://www.benzinga.com/stock/UBER#NASDAQ))       \n* **Alphabet Inc** (NASDAQ:[GOOG](https://www.benzinga.com/stock/GOOG#NASDAQ))          (NASDAQ:[GOOGL](https://www.benzinga.com/stock/GOOGL#NASDAQ))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **Draftkings Inc** (NASDAQ:[DKNG](https://www.benzinga.com/stock/DKNG#NASDAQ))       \n* **General Motors Company** (NYSE:[GM](https://www.benzinga.com/stock/GM#NYSE))       \n\n**Carl Icahn’s Icahn Capital**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Icahn Enterprises LP Common Stock** (NYSE:[IEP](https://www.benzinga.com/stock/IEP#NYSE))       \n* **Bausch Health Companies Inc** (NYSE:[BHC](https://www.benzinga.com/stock/BHC#NYSE))       \n* **Dana Inc** (NYSE:[DAN](https://www.benzinga.com/stock/DAN#NYSE))       \n* **Xerox Holdings Corp** (NYSE:[XRX](https://www.benzinga.com/stock/XRX#NYSE))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **Cheniere Energy, Inc.** (NYSE:[LNG](https://www.benzinga.com/stock/LNG#NYSE))       \n* **Tenneco Inc** (NYSE:[TEN](https://www.benzinga.com/stock/TEN#NYSE))       \n\n**Bill Ackman’s Pershing Square Capital**  \nNotable        Q4 Buys/Increases:  \n(none)  \nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **Starbucks Corporation** (NASDAQ:[SBUX](https://www.benzinga.com/stock/SBUX#NASDAQ))       \n* **Restaurant Brands International Inc** (NYSE:[QSR](https://www.benzinga.com/stock/QSR#NYSE))       \n* **Lowe’s Companies Inc** (NYSE:[LOW](https://www.benzinga.com/stock/LOW#NYSE))       \n* **Agilent Technologies Inc** (NYSE:[A](https://www.benzinga.com/stock/A#NYSE))       \n* **Hilton Hotels Corporation** (NYSE:[HLT](https://www.benzinga.com/stock/HLT#NYSE))       \n\n**Seth Klarman’s Baupost Group**  \nNotable Q4        Buys/Increases:     \n\n&amp;#x200B;\n\n* **Intel Corporation** (NASDAQ:[INTC](https://www.benzinga.com/stock/INTC#NASDAQ))       \n* **Marathon Petroleum Corp** (NYSE:[MPC](https://www.benzinga.com/stock/MPC#NYSE))       \n* **Facebook, Inc.** (NASDAQ:[FB](https://www.benzinga.com/stock/FB#NASDAQ))       \n* **eBay Inc** (NASDAQ:[EBAY](https://www.benzinga.com/stock/EBAY#NASDAQ))       \n\nNotable Q4 Sells/Reductions:     \n\n&amp;#x200B;\n\n* **CBS Corporation** (NASDAQ:[VIAC](https://www.benzinga.com/stock/VIAC#NASDAQ))       \n* **HP Inc** (NYSE:[HPQ](https://www.benzinga.com/stock/HPQ#NYSE))       \n* **Fox Corp** (NASDAQ:[FOXA](https://www.benzinga.com/stock/FOXA#NASDAQ))       \n* **Alphabet, Inc.** (NASDAQ:[GOOG](https://www.benzinga.com/stock/GOOG#NASDAQ))          (NASDAQ:[GOOGL](https://www.benzinga.com/stock/GOOGL#NASDAQ))       \n\nCopyright © 2021 Benzinga (BZ Newswire,        http://www.benzinga.com/licensing). Benzinga does not provide        investmentadvice. All rights reserved.  \nWrite to        editorial@benzinga.com with any questions about this content. Subscribe        to Benzinga Pro (http://pro.benzinga.com).",
        "subreddit": "wallstreetbets",
        "title": "Q4 13F Roundup - Buffet, Einhorn (etc.) Portfolio Changes (2/17/21)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lmos70/q4_13f_roundup_buffet_einhorn_etc_portfolio/",
        "created": 1613689629.0
    },
    {
        "author": "United-Revolution-11",
        "created_utc": 1612895206,
        "id": "lg9t7d",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "NortonLifeLock is making a move let’s get in before it’s too late",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lg9t7d/nortonlifelock_is_making_a_move_lets_get_in/",
        "created": 1612924006.0
    },
    {
        "author": "United-Revolution-11",
        "created_utc": 1612895751,
        "id": "lga0ky",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "$NLok is about to get real",
        "url": "https://www.reddit.com/r/StockMarket/comments/lga0ky/nlok_is_about_to_get_real/",
        "created": 1612924551.0
    },
    {
        "author": "royt17",
        "created_utc": 1613071680,
        "id": "lhsgb1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "NLOK cheap contracts, guaranteed",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lhsgb1/nlok_cheap_contracts_guaranteed/",
        "created": 1613100480.0
    },
    {
        "author": "Beginning-Leather-98",
        "created_utc": 1612224943,
        "id": "laiitj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "NLOK - A buy before Thurs earnings?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laiitj/nlok_a_buy_before_thurs_earnings/",
        "created": 1612253743.0
    }
]