[
    {
        "author": "Realguyme",
        "created_utc": 1628188728,
        "id": "oyorqa",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "We all know that AMD is a great company. Its last earning surprise and its great growth guidance led the price to go 30% up. Additional bullish news about MacPro is also boosting this price up with 4x higher volume. \n\nHowever, we all gotta know that we always need to \"sell the news\", and \"sell the greed\" in order to make profits(especially options) because realistically, institutions and big hands have better models, connections, business relationships, and platforms which bring the fastest and newest information to them so they can take their profits out faster than one another. Most stocks are already priced in when its bullish news comes out, and I think AMD would not be an exception.\n\nReasons:\n\n1. The price is already too high, Quarterly RSI:82, 350.55 P/E, (Remember, Nvidia is still strong enough to keep their #1 position for a while).\n2. 76% owned by institutions (most of us can't buy or sell faster than them. Too risky to fight with them. That is why \"sell the news\", and \"sell the greed\" became quotes for retail investors aka ants). \n3. The current market sentiment is not bullish enough. We all know that the whole market went up too much since the COVID due to low interest rate and stimulus checks. Institutions and big hands all perceive that there will be a huge correction before the end of this year, but they can't start a big sell off now because thankfully the Fed and retail investors are helping them to take little more profits before they eventually start selling off. Therefore, I think AMD's current price rise was high enough to be the peak before it drops. \n\n[sourced by \\\\\"forecasts.org\\\\\"](https://preview.redd.it/anekyswaykf71.png?width=1222&amp;format=png&amp;auto=webp&amp;s=6e680a785d30f55216511aeee2fa0a035c548b55)\n\nAs you can see by this forecasts, S&amp;P 500 index keeps decreasing from August 2021 to January 2022, and then bouncing back from February 2022. It is just a forecast, but if the Fed says they will actually start considering about tapering in next year or something, there will be a high chance that the market goes down like this forecast values. \n\n4. AMD needs a healthy correction before it goes up again. Every stock needs a correction in order to prevent its froth. \n\nI hope that Bulls do not hate me by this DD because I love AMD too! \n\nI used to kept my long position until yesterday and sold at $119 and bought some puts with a small amount.\n\nI just want to do both ways to maximize my profits though. Indeed, I am going to buy Calls again later when it dips.\n\nOh btw, I'm the one who wrote Micron DD if anyone saw it lol Let's go Micron too!! It is a solid stock. \n\nThis is not a financial advice, just a DD. Thank you guys :D\n\nBless all you investors aka ants!!!!!!!! Let's do this!!!!!!!",
        "subreddit": "wallstreetbets",
        "title": "AMD PUT DD (Sell the NEWS, Sell the GREED before it TANKSS)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyorqa/amd_put_dd_sell_the_news_sell_the_greed_before_it/",
        "created": 1628217528.0
    },
    {
        "author": "LegendaryHODLer",
        "created_utc": 1627856532,
        "id": "ow1qpf",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "# Last Week's Review\n\nWe hit some home-runs last week with AMD, CLF, and TLRY. All of which were up over 20% at one point. The other names are not doing too bad either and IMO still “consolidating” with their charts &amp; technicals. Here’s a snapshot of the ticker performance from the last two weeks. In the same time-period SPY has gone up 3%.\n\nhttps://preview.redd.it/b0g8wtx6mte71.png?width=774&amp;format=png&amp;auto=webp&amp;s=28e727f9ead432e46e22074c9489e03a8fbc44f0\n\n&amp;#x200B;\n\nI exited my position on CLF as I felt it was beginning to get into the “red zone” I talk about. The ticker has been on an unbelievable uptrend since the start of the year and the chart is beautiful. However, I highlighted below a short-term risk area after the stock has shot up 30% in 7 days (due to good earnings as well). It’s nearing the top of the trend channel and could potentially see a reversal. Either way, I protected my trade.\n\n&amp;#x200B;\n\nBefore we get into the tickers for this week here's a breakdown of some of my charting rules and terminology.\n\n# Chart Guidelines &amp; Terms\n\nI use the term \"meme stock\" loosely as these aren't necessarily meme companies. I really mean that the ticker has a HIGH PROBABILITY to trend on social media and the stock price could be affected by social sentiment. The watchlist I give is usually comprised of tickers that have taken a breather after getting too hot from a social aspect.\n\n&amp;#x200B;\n\nMoving along, I like to look at my charts from a risk-reward perspective.\n\n\"Red Zones\" are high-risk lotto plays.\n\n\"Orange Zones\" are a bit of a mixed bag between being too hot or early in the trend.\n\n\"Green Zone\" is where I try to buy. These trades are never guaranteed (nothing in life is), but from a risk-to-reward point of view they are in my favor.\n\n&amp;#x200B;\n\nAs always, this is not financial advice or a recommendation to buy or sell a stock. Please do your own research before entering any positions.\n\n&amp;#x200B;\n\n# The Meme List\n\n&amp;#x200B;\n\n**Skillz Inc (SKLZ)**\n\nI categorize this play on the meme stock list because SKLZ has been known to trend on various social media outlets and gain momentum through retail traders. This is a lucrative play and considered a YOLO with earnings coming up on Tuesday after the close. Looking at the chart the stock price is back to 3-month lows and where it was trading last December.\n\nIt’s current valuation at $14 is still pretty rich (5b market cap off 270m in sales), but should the stock continue to drop it might become quite favorable. This ticker traded at $45 back in February and is down 60% since.\n\nThere are many doubters in the viability of this company’s business model, but for a high-risk, high-reward play I like it at this current price. Having said that, ARK ETFs currently hold about 20 million shares of SKLZ.\n\nhttps://preview.redd.it/j7ns8wfcnte71.png?width=2558&amp;format=png&amp;auto=webp&amp;s=98f2044dc2a34e2b8b1df98f8b2a8a22f5a98070\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Peloton (PTON)**\n\nPTON chart looks ready for another break-out to the upside. This could be a potential “fear of lockdown” play and any news of Covid variants will cause this to pop. Glancing at the fundamentals the company has quite a strong balance sheet with very little debt, and strong growth. Most analyst’s concerns on this name are regarding if the growth is actually sustainable for the long-term.\n\nAt $118 per share the stock is nearing the bottom of the channel for it’s most recent trend over the last 3 months.\n\nhttps://preview.redd.it/xlljgnkdnte71.png?width=2558&amp;format=png&amp;auto=webp&amp;s=377b626ef469edf1bef1f1e57f63bb872cb7ad39\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**FuboTV (FUBO)**\n\nLast, but not least on the meme’s list we have FUBO. Remember the meme’s list are tickers that have the potential to gain momentum through retail traders and popularity. This can sometimes be a driving force and the truth is you need to be in on these names BEFORE the hype-train leaves the station.\n\nFUBO had exceptionally strong performance back in December last year when it hit $60 per share. Concerns over the company’s growth and sustainability have knocked the share price down by 60% and currently sits at $26. IMO we could be entering a green zone as the stock has traded sideways for a month now. FUBO reports earnings August 10.\n\nhttps://preview.redd.it/hhhr705ente71.png?width=2554&amp;format=png&amp;auto=webp&amp;s=1a63ee2d3908f955b45ee2ad8afdee4fc882da56\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# The BTFD List\n\n&amp;#x200B;\n\n**Teladoc (TDOC)**\n\nTDOC is one of the leaders in the “tele-health” industry. It gained momentum and popularity throughout lockdowns, but as the world-reopened the stock price has tumbled. In March, Amazon also announced their entry into the tele-health services and investors did not like this increase in competition.\n\nThis is a risky play and is potentially reliant on the lockdown catalyst, but at $148 per share and a 50% haircut from it’s 52-week high, I will be looking to enter this position.\n\nhttps://preview.redd.it/mu0ufnpfnte71.png?width=2556&amp;format=png&amp;auto=webp&amp;s=19e074e533d51665dd9a9273c59bb3dcc5acb142\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**American Airlines (AAL)**\n\nAmerican airlines is a re-opening play. Travel is nearly back to pre-pandemic levels and most “re-opening” stocks are still trading at a discount due to future uncertainties.\n\nThe chart for most airlines will be quite similar to each other, and in my opinion the worst is behind us. I’m looking for short-term upside on this one before the trend breaks down again.\n\nhttps://preview.redd.it/urudccegnte71.png?width=2554&amp;format=png&amp;auto=webp&amp;s=94cac360b0279142c64e47042c42fdd996f85c07\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Micron Technology (MU)**\n\nOut of all the semi-conductor plays it always seems like MU gets no love. AMD and NVDA are performing very strong, but MU seems to be the laggard. MU is trading at a PE of 21 while NVDA and AMD trade at 92 and 37, respectively.\n\nMU just posted very solid earnings and the macro environment should be a strong driver of growth for semi-conductors in general. There has been a chip-shortage for some time now affecting many industries and all this pent up demand will last into 2022.\n\nI thought this stock was going to continue it’s breakout at $95 a share, but it broke down starting in April and may have found a bottom at $77. I like MU here and might enter a position.\n\nhttps://preview.redd.it/oegg5jwgnte71.png?width=2550&amp;format=png&amp;auto=webp&amp;s=eb72bd73ec1eedbeebad5b81c17168db4c370d16\n\n&amp;#x200B;\n\n# Closing Thoughts\n\nThat’s the end for this week. Remember, investing is about PAYtience because it pays to be patient. There are A LOT of uncertainties in this market right now which means it is not the time for crazy YOLOs. We have risks from inflation, covid, rates &amp; QE tapering, re-opening risk (or lack of going back to “normal”).\n\nThe VIX might not be close to the highs, but volatility is STILL HERE. We are seeing 2-5% daily swings in a lot of stocks right now. If anyone remembers before the pandemic you would be lucky to see a 2% move in most names.\n\nHope you all had a great weekend and I’ll be back next week. Just FYI I might start adding a mid-week update some of the weeks to spot existing up-trends, down-trends, or tickers hyped on social media.",
        "subreddit": "options",
        "title": "I scanned over 150 charts this weekend. Here are some good setups I found to BTD (or sell CSPs): SKLZ, PTON, FUBO, TDOC, AAL, MU",
        "url": "https://www.reddit.com/r/options/comments/ow1qpf/i_scanned_over_150_charts_this_weekend_here_are/",
        "created": 1627885332.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1627822959,
        "id": "ovrq37",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\n\tHow did Intel's co-founder predict the semiconductor chip shortage of 2020-21? Intel has been making some big moves these past few months. CEO Patrick Gelsinger is doing everything from building infrastructure and acquiring companies to signing contracts and securing partnerships. Intel is on track to stay ahead of the competition.  \n\n**Moore's Law**\n\nMoore's Law states three things:\n\n* The number of transistors on a microchip doubles every two years\n* Research and development increase the speed and capability of technology\n* The growth of microprocessors is exponential. \n\nWho created Moore's Law? Gordon E. Moore, co-founder of Intel... Learn more about Moore's Law \\[here.\\](https://www.investopedia.com/terms/m/mooreslaw.asp)\n\n**Government Intervention Timeline**\n\n*March 31, 2021* \\[Source\\](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/)\n\n* White House proposes a $50B subsidy plan for research and development to strengthen the U.S supply chain under the CHIPS Act.\n   * The CHIPS Act *(June 11, 2020)* offers a tax income credit for semiconductor equipment and manufacturing.\n\n*April 12, 2021* \\[Source 1\\](https://www.youtube.com/watch?v=sWAa10ljxLA) \\[Source 2\\](\\[Source\\](https://www.ttnews.com/articles/biden-reassures-chip-summit-bipartisan-support-new-funds)\n\n* Biden joins the Virtual CEO Summit on \"Semiconductor Supply Chain Resilience.\"\n* Biden states that this plan is a \"once-in-a-generation investment in America's future.\"\n* CEOs who attended the meeting include General Motors CEO Mary Barra, Ford Motor CEO James D. Farley, and Alphabet and Google CEO Sundar Pichai.\n* Companies invited to join the call were Dell, Intel, Medtronic Plc, Northrop Grumman, HP, Micron Technology Inc., Taiwan Semiconductor Manufacturing Co., AT&amp;T, and Samsung.\n\n*TL;DR-* The semiconductor chip shortage has emphasized securing U.S global chip supply. The White House has laid out a $50B subsidy plan to help boost research and development in the semiconductor industry. The White House met with top CEOs from around the globe who seek a piece of the pie. \n\n**Intel Major News Timeline**\n\n*March 9, 2021* \\[Source\\](https://itpeernetwork.intel.com/ibm-hybrid-cloud/)\n\n* Intel partners with IBM\n\n*March 23, 2021* \\[Source\\](https://www.reuters.com/world/asia-pacific/intel-doubles-down-chip-manufacturing-plans-20-billion-new-arizona-sites-2021-03-23/)\n\n* Intel plans to spend $20B in development in Arizona\n\n*April 12, 2021*\n\n* Intel is in talks with Ford (F) and General Motors (GM) \n\n*May 2, 2021* \\[Source\\]*(*https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Intel plans to spend $3.5B on development in New Mexico\n* Intel plans to spend $10B on development in Israel \n\n*June 22, 2021* \\[Source\\](https://www.reuters.com/technology/sifive-aims-challenge-arm-with-new-tech-pairs-with-intel-effort-2021-06-22/)\n\n* Intel in talks to buy SiFive\n\n*July 15, 2021* \\[Source\\](https://www.wsj.com/articles/intel-is-in-talks-to-buy-globalfoundries-for-about-30-billion-11626387704)\n\n* Intel in talks to buy GlobalFoundries\n\n*July 28, 2021* \\[Source\\]*(*https://finance.yahoo.com/news/intel-ceo-we-have-100-companies-that-want-us-to-make-their-chips-120023723.html)\n\n* Intel secures Qualcomm contract\n* Intel partners with Amazon\n\n**General Motors Contract**\n\n*May 6, 2021* \\[Source\\](https://gmauthority.com/blog/2021/05/general-motors-is-stockpiling-unfinished-vehicles-due-to-microchip-shortage/)\n\n1. General Motors has a stockpile of tens of thousands of unfinished vehicles without semiconductor chips\n2. The unfinished vehicles are stored in Mexico, Texas, Missouri, Indiana, and Illinois\n\n**Ford Contract**\n\n*July 16, 2021* \\[Source\\](https://www.caranddriver.com/news/a37050732/ford-dealerships-chip-supply-shortage/)\n\n1. Ford also has a huge stockpile of unfinished cars that lack semiconductor chips\n2. Ford is running low on storage space\n3. Ford plans to ship unfinished vehicles to Dealerships\n4. Ford will pay for the training and labor costs at dealerships\n\n**Key Financial Metrics (Current)**\n\n* Market Cap (MKT Cap)- 215B\n* EPS (Dilution)- $4.50\n* Return on Equity (ROE)- 23.15\n* Return on Assets (ROA)- 12.30\n* Return on Investment (ROI)- 16.29\n* Dividend Yield- 2.59%\n\n**Financial Statement Highlights (Current)**\n\n* *Total Revenue (TR)-* 77.7B\n* *EBITDA Margin- 32*.06%\n* Gross Margin- 55.6%\n* Price to Earnings Ratio (PE)- 11.93\n* Price to Sales Ratio (PS)- 2.84\n* Price to Book Ratio (PB)- 2.56\n\n**Balance Sheet Highlights (Current)**\n\n* Total Liabilities- 69.39B\n* Long Term Debt (LTD)- 31.71B\n* Debt to Equity Ratio (DE)- 0.37\n\n**Competitors**\n\n* Taiwan Semiconductor Manufacturer (TSM)\n* Samsung\n* Advanced Micro Devices (AMD) Fabless\n* Nvidia (NVDA) Fabless\n\n\\*Fabless means they don't produce their semiconductor chips\n\n**Taiwan Semiconductor Manufacturing (TSM)**\n\n*May 2, 2021* \\[Source\\](https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Taiwan Semiconductor Manufacturing (TSM) plans to spend $100B on-chip research and manufacturing\n* TSM plans to build a new factory in Arizona\n\n*May 31, 2021* \\[Source\\](https://fortune.com/2021/05/31/amd-tesla-contract-chips-infotainment-system-lisa-su/)\n\n* AMD partners with Tesla\n\n**Samsung**\n\nFebruary 10, 2021 \\[Source\\]https://www.anandtech.com/show/16483/samsung-in-the-usa-a-17-billion-usd-fab-by-late-2023)\n\n* Samsung to invest $17B in development in the U.S\n* Potential sites include Texas, Arizona, and New York\n* Samsung has since lost key U.S customers like IBM and Qualcomm to Intel and Nvidia and Tesla to TSM.\n\nMay 13, 2021 \\[Source\\](https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo)\n\n* Samsung to invest $101B in research and development in the semiconductor market\n\n**Bullish Case:**\n\n* Strong demand for semiconductor chips\n* U.S $50B semiconductor industry subsidy plan\n* Intel's Recent acquisitions, partnerships, and contracts\n\n**Bearish Case:**\n\n* Asia is the current \"epicenter\" of global chip production\n* The U.S is playing catch up\n* Competition from TSM and Samsung\n\n**Conclusion**\n\n\t CEO Patrick Gelsinger has been making some big moves these past couple of months. Intel is securing its foothold in the semiconductor industry by building infrastructure, acquiring companies, and signing contracts. \n\n\tIntel wants to increase chip output and drive down its average costs to stay ahead of the competition. Intel is expanding into the automotive, consumer electronics, and foundries industry. Intel faces stiff competition from Taiwan Semiconductor Manufacturing (TSM) and Samsung. All three companies have announced plans to increase research development by 2023-24.\n\n\tMoore's Law is key to understanding how the chip shortage occurred and how to prevent it from happening again. Intel, TSM, and Samsung have all announced multibillion-dollar research and development plans in the U.S. The market for semiconductor chips is increasing exponentially.\n\n\tThe U.S has been falling behind countries like Asia in the global semiconductor market. The U.S aims to secure global chip supply through its U.S $50B subsidy plan. The subsidy plan will boost the research and development of semiconductors in the U.S. Companies like Intel, TSM, and Samsung are now chomping at the bits.\n\n\tThe global market for semiconductors is growing exponentially. The recent semiconductor chip shortage is proof of Moore's law. The U.S plans to expand into the global market through a $50B subsidy plan to attract research development to the U.S. Chips are as essential to our everyday lives as water. You control the chips, you control the future.\n\n*\\*\\*This is not investment advice. I am not an expert. Do your research.\\*\\**",
        "subreddit": "investing",
        "title": "Intel Due Diligence (INTC)",
        "url": "https://www.reddit.com/r/investing/comments/ovrq37/intel_due_diligence_intc/",
        "created": 1627851759.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1630025956,
        "id": "pccqus",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": " Most great semi stocks are already priced in or overvalued, and we smart experienced apes know that you never buy overvalued stocks because its potential gain is small and its potential loss is too big.\n\nTherefore, we need to buy the stock that is undervalued but eventually goes up to meet its price target later because of its strong fundamentals and future growth (which is MU). And why do we need to pick semi stocks for this? Because Semiconductor business is one of the most potential and profitable business in the whole industry; we simply think that everything is turning to digital and AI systems, and all those devices, platforms, and servers need memory chips. Biden's infrastructure bills and his willingness to support semi industry are also tailwinds of semi stocks.\n\nOk, so why MU is the most undervalued stock among all semiconductors now?\n\nBecause it is ridiculously cheap! 7x forward price to earnings multiple now, and even though it actually have a slowdown in memory chip industry, it is still 10-12x forward earnings which is still ridiculously cheap compared to other semi stocks. (According to Quint Tatro, Joule Financial founder at CNBC).\n\nMU's 52 week high is 96.96, and its current price is 72.77. It showed some high volatility and corrections after its ATH because it went up too fast in short time (52 week low is 43.67). The last large correction made MU's price down from 83 to 68.80 which was 17% down in 4 days. This correction happened because of Morgan Stanley's report that says 'winter is coming' for semis. However, all other institutions and investors, including Goldman Sachs, Bofa, Jim Cramer, think that MU is way undervalued, and its price is at the bottom now. Vanguard Group, Sanders Capital, and State Street, top 5 MU shareholders, added MU positions between August 6 to August 16 . Since many institutions and large investors start to buy MU back, its price went up from 68 to 77, and then it dropped to 73 today due to the red market and some sell offs.\n\nReasons why this is a great timing to buy MU now\n\n1. The sentiment turned to bullish. It kept going up since it hit its bottom price 68, and yesterday, August 25th, it pumped from 73 to 77 in few minutes, closed at 74, and the current price is 72.77 now. Great buying point before it keeps pumping after this Jackson Hole meeting.\n2. Too CHEAP compared to ALL other semis. Here is the picture.\n\n[As you can see, MU is -23.64&amp;#37; from 52 week High on August 25, it has a more discount today since it dropped to 72.77. Ok, then we might doubt about its fundamentals and its future growth. Don't worry, here is why most analysts and institutions think MU is super undervalued and it is time to buy now.](https://preview.redd.it/dlkwd2twtsj71.png?width=1522&amp;format=png&amp;auto=webp&amp;s=320db86cfa01137884d5738472075d85b9f5bc78)\n\n[Its FY1 is 12.13 which is already great, but its FY2 and 3 is 6.36 and 6.34 which is too great compared to others. So, it is a great time to buy it before all those number soar later.](https://preview.redd.it/4o837srxtsj71.png?width=1233&amp;format=png&amp;auto=webp&amp;s=021afd568ab356ba677378e791f117c4bedef258)\n\nTheir EPS and Revenue growth are also great too (beating all estimates for over 2 years).\n\nhttps://preview.redd.it/j65bzmrytsj71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=76f6143cca80476247088955c96ff2d31d03e2b6\n\n3. Morgan Stanley, aka sneaky bitches, revealed a report 'winter is coming' or whatever, saying that DRAM memory chip price was already at the peak and it is going down now which will lead all DRAM company's profit to go down due to its historical data. However, most institutions and investors still believe that DRAM's demand is still too strong enough to cover that DRAM price drop, because all PCs, Servers, Laptops, smartphones, tablets, robots, cars, and anything that has automated computer system needs 'memory chip'. Semi industry has a bright future, and I think Morgan Stanley's report was just a manipulation in order to short the stock and buying it back at discounted price. This asshole bought SK hynix (2nd largest DRAM company) shares back after its correction in Korea. Its price was 120,000 Won before MS's report, and it dropped to 98,000 after its report and they started buying back from 100,000 now. I still strongly believe that this stock will keep going up before tapering. (I hope the Fed does not mention about tapering at Jackson Hole).\n\n4. RSI number is important because we can know if the stock is overbought or not. The current market sentiment is unstable due to upcoming tapering, interest rates, inflation, national debts, infrastructure, etc. and most overbought stock have a high chance to meet its huge corrections later. Ok, so MU's current monthly RSI is 57. It is still in the middle which is a great number for tech growth stock. For example, Nvidia's monthly RSI is 86, AMD's monthly RSI is 85, AMAT is 75, TSM is 76, Qualcomm is 65, and ASML is 93. RSI does not explain everything, but it helps you to know that MU is pretty undervalued.\n\n5. Most great investors always say 'being simple is the best strategy'. I also believe that. Simply, we will make the money if we buy the GOOD stock in cheap way and sell it in expensive way. And simply, MU, a GOOD stock, is cheap now.\n\n6. Here is a better explanation about MU itself (my first MU DD) that shows why MU is a GOOD stock. [https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron\\_will\\_eventually\\_rally\\_5080\\_upside\\_potential/](https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron_will_eventually_rally_5080_upside_potential/)\n\nThere is a high chance that the Fed will not mention about tapering at Jackson Hole meeting because of Delta variant problems and slower than expected economy recovery. If they don't, tech stocks have a higher chance to get pumped for a while, and indeed, undervalued stocks have the highest chance to soar. So I personally strongly believe that few more tailwinds can drive MU price up to 20-30% before its next earnings (Sep 27), and 60-100% in 3-6 months depending on market sentiment.\n\nIts current price targets are: Yahoo avg 115.59, Seeking Alpha avg 111.76, Marketwatch avg 115.85,  \nTip Ranks: 112.64, Marketbeat: 112.07, CNN: 112.50. Total Average PT: 113.40.\n\nIt is simple, but actually not easy. Buy it now since it is turning to bullish, and sell the news before it actually tanks again. If the tapering is coming? Buy the PUTs or wait until the price became cheap again with healthy correction. And then we get in the ride again when it starts pumping again. I think that is how you can survive in this stupid unpredictable market. I sometimes use option straddle strategy during this unpredictable market because all you need to do is choosing high volatility stocks (I might use this strategy for MU later since it has a high volatility, and the current market is unpredictable).\n\nMy positions: 24 Sep 72c x 7 , 24 Sep 68c x 10, owning 100 shares.\n\nIndeed, this is just my DD, no financial advice.\n\nThank you guys.",
        "subreddit": "wallstreetbets",
        "title": "MU, the most undervalued semi stock, has 20-30% upside potential in a month, 70-100% upside potential in 3-6 months. The sentiment has been changed to bullish this week, a GREAT TIME TO BUY.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pccqus/mu_the_most_undervalued_semi_stock_has_2030/",
        "created": 1630054756.0
    },
    {
        "author": "id10tsandwich",
        "created_utc": 1628695662,
        "id": "p2fb14",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "MU. More like FU. Bye chicken tendies",
        "url": "https://i.redd.it/q59kcvwvyqg71.jpg",
        "created": 1628724462.0
    },
    {
        "author": "DuckieBasileus",
        "created_utc": 1628436414,
        "id": "p0go61",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Micron Technology(NASDAQ:MU) is the 4th largest distributor of semiconductors in the world leading in production of DRAM and NAND. Analysts predict a one year stock value median of $120  compared to current $82. My own calculation, which skews more conservative, has them at 118.12% with a 30.6 Margin of Safety. \n\nLooking at valuation, they consistently surprise EPS expectations. Last quarter they beat an expected 1.72 at 1.88 and have an expected EPS of 2.32 for Q3. Their PE of 22.63 is below the industry's 31.97x, has P/B of 2.17 compared to industry's 14.2x, P/S is 3.62 compared to Industry's 12.18, PEG Ratio is .36 compared to industry's .12. Altogether, a great start. \n\nFundamentally, looking at their financials they did take a big hit in 2019 because of the semiconductor supply shortage. Look up price of GPU from 2019 to today and you'll quickly see what I mean. This impacted their sales and earnings. In 2018 their high was 31B Revenue and 14B in earnings. With COVID and that stock shortage already there, 2020 earnings had tumbled to 21.43 B and a meager 2.69B. If you go to quarterlies though, they're currently smashing it. They're last quarterly was simply phenomenal. Revenue of 7.42 B, and earnings of 1.74B. Year to Year and Year to quarterly is just fantastic from where they were. Next year they're predicting an EBIDA growth of 20%. Very ambitious estimate and while definitely not sustainable for 5 year period, a one year 20% EBIDA prediction is still very good.\n\nMany things in their favor is they're buying back shares. They're starting to buy back shares. Its not much, but last quarter saw the first decrease in ordinary share number and increase in treasury shares. This is course change from previous quarters of a slight dilution they've had. Its not as intense as Intel's buyback, but it shows management's belief that they're undervalued. They also just announced a dividend. Its small, 10 cents a share, but you don't do that unless you're confident. It also gets on the radar of intuitions that require a dividend. They're domestic so there is no concentration on foreign crackdowns. In fact, in 2019 Huawei was 14% of their business and the USA restriction already had that hit. \n\nSome hits against them are that there are other competitors. Multiple companies have the cash to to invest in hyper expansion like Intel and Ti. Since the start of the shortage, MU has had decreased earnings and revenue seeing shrinkage of about 28% from their 2018 high. Until recently, they weren't  that cash flow positive and have been taking on more debt to power expansion. This may effect DCF calculations. Its more held by institutions than insiders so while the board has an obligation to share holders, it won't keep them up at night. I\n\nSome insight to the semiconductors as a whole. US Gov passed a bill a couple months back approving funding for domestic semicondutor chip development of 50B. So they're not prone to the infrastructure bill may or may not passing, they already have increased federal funding. Also, DRAM and NAND are respectively dynamic memory and logic gates necessary for computers to function. DRAM is expected to increase 16% in sales and NAND is expected to go  up 30%. DRAM makes up a larger portion of sales for MU to NAND. However, none of these things are going away. These are core components of any development and are only looking to increase in demand.\n\nAnother competitor you might want to look at is Western Digital (WDC). They have similar fundamentals and potential for growth. However, Micron has better ratios at the moment  so that's why I chose to focus on it. Either one I think is a greatly undervalued stock with MU just being better.",
        "subreddit": "ValueInvesting",
        "title": "Micron Technology: Semiconductor Giant on Verge of Swing",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/p0go61/micron_technology_semiconductor_giant_on_verge_of/",
        "created": 1628465214.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1628730472,
        "id": "p2qjxz",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "Hello Apes :) In my opinion, Micron Technology is one of the best stocks among the whole semiconductor market with great fundamentals that has a high chance to go 60-100% up easily whenever its momentum starts up.\n\nWhen I posted my first MU DD 16 days ago, the opening price was $75.80 and closing price was $76.30. After my DD, it went up to $83.10, and then it dropped again to $75 until today because of bearish news about DRAM price forecasts. I sold my positions (100 shares at $78.50, and 27 Aug 75c x 10) at $82 on August 6th because I assured that $83.10 on August 4th was the peak before it drops again and the price upward movement was getting weakened since that date. \n\nHere is my first DD that shows the reasons why it has a great upside potential with great fundamentals and great growth guidance.\n\n[https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron\\_will\\_eventually\\_rally\\_5080\\_upside\\_potential/](https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron_will_eventually_rally_5080_upside_potential/)\n\nNow, its price went down again to $73.30 in after-market which is discounted A LOT. $72-74 is the best entry point with the lowest risk and the greatest upside potentials since MU is a strong enough to rally and consolidate in the price range of 85-90 once it starts have some more good news, better earnings and growth guidance. I thought yesterday (August 10)'s drop was good enough to be the support line so I bought some 24 Sept 72 Calls since I expect to see $80-90 price range before its next earnings date (Sept 29). One trading tip for Micron is 'Never be too Greedy'. There are too many big hands who are playing their own game with this stock, and we need to sell the greed to make good profits from it before its massive sell offs come first. But then, why would I take a risk to play this intense game with these big hands? Because MU is too good and strong stock that makes its price keeps rallying and it will eventually keeps going up crazily when it starts to gain its momentum. We all know that we must buy GOOD stocks whenever its price drops more that its value. You always buy GOOD stocks when its is undervalued, and before it becomes more popular and becomes a meme stock later. And that is the time to sell when other people finally start to talk about MU and it becomes a MEME stock. Don't be like those kind of people who bought AMD at $115-120, but be like those kind of people who bought AMD at less than $78, or at least at less than $94. Yeah, so the whole point is \"Buying MU at $73.30 is a great choice I think\".\n\nRemember, 86.61% of MU stock is owned by institutions, which means that there will be always a huge sell offs whenever they think it is priced in because institutions need to sell faster than one another to make more profits before it tanks hard. But good thing is that those institutions keep buying it back at the support line which is $72-75 so it eventually rallies back; it means that it has a pretty high volatility, and we can use this high volatility to keep printing our profits if we know when to buy and when to sell without the greed and panicking. And I strongly believe that once it starts to get its momentum back, it has a high chance to break through its ATH $96 and go up to $150-180 in next year.\n\n&amp;#x200B;\n\nAdditional News after my first DD\n\n**Bullish**\n\n\\- Micron launched world's first 176-Layer NAND in mobile solutions to power lightning-fast 5G Experiences. (Now they just need to start running their EUV fab in order to be more competitive with their rivals).\n\n\\- Micron declared 10 cent a share Quarterly Dividend (Make big hands feel more secure which can lead to have a less turnover %).\n\n**Bearish**\n\n\\- Forecasts of weakening DRAM prices in the fourth quarter. (However, most MU investors perceived this news which means it was already priced in).\n\n[Sourced by Benzinga](https://preview.redd.it/0g9tun8zstg71.png?width=1420&amp;format=png&amp;auto=webp&amp;s=bc6bfc2571be3e2c7214ddc32acb26b81a3d944e)\n\nAccording to Benzinga, they set MU's support line at $74.68 and the resistance line at $95.02. Once it breaks its resistance point at $95, it will be another AMD which will soar rapidly with its crazy momentum.\n\n&amp;#x200B;\n\nMy previous positions:  100 shares at $78.50, 27 Aug $75c x 10. (Closed at $82 on August 6th).\n\nMy new position: 24 Sep $72c x 7. (PT= $80-85).\n\n&amp;#x200B;\n\nThanks for reading my second MU DD apes!!!!!!\n\nBless all of our positions :) Let's make some money!!!!!!!!!!!!!!!!!!!!! yay",
        "subreddit": "wallstreetbets",
        "title": "My second Micron(MU) DD with its great entry for buying point NOW (60-100% UPSIDE potential). Buy at its cheapest buy point before it gets too late!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2qjxz/my_second_micronmu_dd_with_its_great_entry_for/",
        "created": 1628759272.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1627823623,
        "id": "ovrw2l",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\n\tHow did Intel's co-founder predict the semiconductor chip shortage of 2020-21? Intel has been making some big moves these past few months. CEO Patrick Gelsinger is doing everything from building infrastructure and acquiring companies to signing contracts and securing partnerships. Intel is on track to stay ahead of the competition.  \n\n**Moore's Law**\n\nMoore's Law states three things:\n\n* The number of transistors on a microchip doubles every two years\n* Research and development increase the speed and capability of technology\n* The growth of microprocessors is exponential. \n\nWho created Moore's Law? Gordon E. Moore, co-founder of Intel... Learn more about Moore's Law \\[here.\\](https://www.investopedia.com/terms/m/mooreslaw.asp)\n\n**Government Intervention Timeline**\n\n*March 31, 2021* \\[Source\\](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/)\n\n* White House proposes a $50B subsidy plan for research and development to strengthen the U.S supply chain under the CHIPS Act.\n   * The CHIPS Act *(June 11, 2020)* offers a tax income credit for semiconductor equipment and manufacturing.\n\n*April 12, 2021* \\[Source 1\\](https://www.youtube.com/watch?v=sWAa10ljxLA) \\[Source 2\\](\\[Source\\](https://www.ttnews.com/articles/biden-reassures-chip-summit-bipartisan-support-new-funds)\n\n* Biden joins the Virtual CEO Summit on \"Semiconductor Supply Chain Resilience.\"\n* Biden states that this plan is a \"once-in-a-generation investment in America's future.\"\n* CEOs who attended the meeting include General Motors CEO Mary Barra, Ford Motor CEO James D. Farley, and Alphabet and Google CEO Sundar Pichai.\n* Companies invited to join the call were Dell, Intel, Medtronic Plc, Northrop Grumman, HP, Micron Technology Inc., Taiwan Semiconductor Manufacturing Co., AT&amp;T, and Samsung.\n\n*TL;DR-* The semiconductor chip shortage has emphasized securing U.S global chip supply. The White House has laid out a $50B subsidy plan to help boost research and development in the semiconductor industry. The White House met with top CEOs from around the globe who seek a piece of the pie. \n\n**Intel Major News Timeline**\n\n*March 9, 2021* \\[Source\\](https://itpeernetwork.intel.com/ibm-hybrid-cloud/)\n\n* Intel partners with IBM\n\n*March 23, 2021* \\[Source\\](https://www.reuters.com/world/asia-pacific/intel-doubles-down-chip-manufacturing-plans-20-billion-new-arizona-sites-2021-03-23/)\n\n* Intel plans to spend $20B in development in Arizona\n\n*April 12, 2021*\n\n* Intel is in talks with Ford (F) and General Motors (GM) \n\n*May 2, 2021* \\[Source\\]*(*https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Intel plans to spend $3.5B on development in New Mexico\n* Intel plans to spend $10B on development in Israel \n\n*June 22, 2021* \\[Source\\](https://www.reuters.com/technology/sifive-aims-challenge-arm-with-new-tech-pairs-with-intel-effort-2021-06-22/)\n\n* Intel in talks to buy SiFive\n\n*July 15, 2021* \\[Source\\](https://www.wsj.com/articles/intel-is-in-talks-to-buy-globalfoundries-for-about-30-billion-11626387704)\n\n* Intel in talks to buy GlobalFoundries\n\n*July 28, 2021* \\[Source\\]*(*https://finance.yahoo.com/news/intel-ceo-we-have-100-companies-that-want-us-to-make-their-chips-120023723.html)\n\n* Intel secures Qualcomm contract\n* Intel partners with Amazon\n\n**General Motors Contract**\n\n*May 6, 2021* \\[Source\\](https://gmauthority.com/blog/2021/05/general-motors-is-stockpiling-unfinished-vehicles-due-to-microchip-shortage/)\n\n1. General Motors has a stockpile of tens of thousands of unfinished vehicles without semiconductor chips\n2. The unfinished vehicles are stored in Mexico, Texas, Missouri, Indiana, and Illinois\n\n**Ford Contract**\n\n*July 16, 2021* \\[Source\\](https://www.caranddriver.com/news/a37050732/ford-dealerships-chip-supply-shortage/)\n\n1. Ford also has a huge stockpile of unfinished cars that lack semiconductor chips\n2. Ford is running low on storage space\n3. Ford plans to ship unfinished vehicles to Dealerships\n4. Ford will pay for the training and labor costs at dealerships\n\n**Key Financial Metrics (Current)**\n\n* Market Cap (MKT Cap)- 215B\n* EPS (Dilution)- $4.50\n* Return on Equity (ROE)- 23.15\n* Return on Assets (ROA)- 12.30\n* Return on Investment (ROI)- 16.29\n* Dividend Yield- 2.59%\n\n**Financial Statement Highlights (Current)**\n\n* *Total Revenue (TR)-* 77.7B\n* *EBITDA Margin- 32*.06%\n* Gross Margin- 55.6%\n* Price to Earnings Ratio (PE)- 11.93\n* Price to Sales Ratio (PS)- 2.84\n* Price to Book Ratio (PB)- 2.56\n\n**Balance Sheet Highlights (Current)**\n\n* Total Liabilities- 69.39B\n* Long Term Debt (LTD)- 31.71B\n* Debt to Equity Ratio (DE)- 0.37\n\n**Competitors**\n\n* Taiwan Semiconductor Manufacturer (TSM)\n* Samsung\n* Advanced Micro Devices (AMD) Fabless\n* Nvidia (NVDA) Fabless\n\n\\*Fabless means they don't produce their semiconductor chips\n\n**Taiwan Semiconductor Manufacturing (TSM)**\n\n*May 2, 2021* \\[Source\\](https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Taiwan Semiconductor Manufacturing (TSM) plans to spend $100B on-chip research and manufacturing\n* TSM plans to build a new factory in Arizona\n\n*May 31, 2021* \\[Source\\](https://fortune.com/2021/05/31/amd-tesla-contract-chips-infotainment-system-lisa-su/)\n\n* AMD partners with Tesla\n\n**Samsung**\n\nFebruary 10, 2021 \\[Source\\]https://www.anandtech.com/show/16483/samsung-in-the-usa-a-17-billion-usd-fab-by-late-2023)\n\n* Samsung to invest $17B in development in the U.S\n* Potential sites include Texas, Arizona, and New York\n* Samsung has since lost key U.S customers like IBM and Qualcomm to Intel and Nvidia and Tesla to TSM.\n\nMay 13, 2021 \\[Source\\](https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo)\n\n* Samsung to invest $101B in research and development in the semiconductor market\n\n**Bullish Case:**\n\n* Strong demand for semiconductor chips\n* U.S $50B semiconductor industry subsidy plan\n* Intel's Recent acquisitions, partnerships, and contracts\n\n**Bearish Case:**\n\n* Asia is the current \"epicenter\" of global chip production\n* The U.S is playing catch up\n* Competition from TSM and Samsung\n\n**Conclusion**\n\n\t CEO Patrick Gelsinger has been making some big moves these past couple of months. Intel is securing its foothold in the semiconductor industry by building infrastructure, acquiring companies, and signing contracts. \n\n\tIntel wants to increase chip output and drive down its average costs to stay ahead of the competition. Intel is expanding into the automotive, consumer electronics, and foundries industry. Intel faces stiff competition from Taiwan Semiconductor Manufacturing (TSM) and Samsung. All three companies have announced plans to increase research development by 2023-24.\n\n\tMoore's Law is key to understanding how the chip shortage occurred and how to prevent it from happening again. Intel, TSM, and Samsung have all announced multibillion-dollar research and development plans in the U.S. The market for semiconductor chips is increasing exponentially.\n\n\tThe U.S has been falling behind countries like Asia in the global semiconductor market. The U.S aims to secure global chip supply through its U.S $50B subsidy plan. The subsidy plan will boost the research and development of semiconductors in the U.S. Companies like Intel, TSM, and Samsung are now chomping at the bits.\n\n\tThe global market for semiconductors is growing exponentially. The recent semiconductor chip shortage is proof of Moore's law. The U.S plans to expand into the global market through a $50B subsidy plan to attract research development to the U.S. Chips are as essential to our everyday lives as water. You control the chips, you control the future.\n\n*\\*\\*This is not investment advice. I am not an expert. Do your research.\\*\\**",
        "subreddit": "smallstreetbets",
        "title": "Intel Due Diligence (INTC)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ovrw2l/intel_due_diligence_intc/",
        "created": 1627852423.0
    },
    {
        "author": "jqdaddy2020",
        "created_utc": 1628776913,
        "id": "p30g1s",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Oh well, fxxk Morgan Stanley. My MU 82.5 oct 15 call is screwed!",
        "url": "https://i.redd.it/84wmom1vmxg71.jpg",
        "created": 1628805713.0
    },
    {
        "author": "Magma_Rager",
        "created_utc": 1628888798,
        "id": "p3u6vb",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "This week was a bloodbath for MU stock. Dropping 16% on no substantial news. Yes, Morgan Stanley downgraded the stock to $75, but even going off that price target, the lowest price target out, the the stock is still slightly undervalued. If you look at the average price target the stock has at least 50% upside. In fact, there is not a single firm that recommends sell on MU. MU is ridiculously cheap right now with a price to book ratio of 2, and forward PE of 6. \n\nThe reason Morgan Stanley cited in their downgrade was reduced DRAM prices as well as a projected over supply of DRAM by the end of Q4. But  do you know what else is on the horizon in the coming months? DDR5. In case you are not familiar with RAM, DDRx refers to the generation of the memory, with each  generation having more capacity and being faster than the last. Micron is set to start mass production of DDR5 later this year. Of course DDR4 prices will start to decline. DDR5 Is almost here. \n\nMany people also argue that DRAMs are a commodity and no one really cares about who makes the chips. While that is true, there are only 3 manufactures. Samsung, Hynix, and Micron with Micron being the only one based in the USA. The DRAM business is an Oligarchy, all members of which are keenly aware not to overproduce memory in order to keep the tendy train rolling. \n\nDRAM demand is also projected to explode next year as a result of a number of factors. 5g inferstucture, automotive, cell phones, and of course computers all need DRAMs. This is of course is one reason why MU only has a forward PE of 6. They are projected to make a ton of money next year. \n\nIn my 5 years working for a RAM distribution company. RAM volume always goes up during the fall as a result of Holiday demand. Guess what? October, November, and December are right around the corner. \n\nDon't fall for MS's fall tactics! It's time to load up!",
        "subreddit": "wallstreetbets",
        "title": "It's time for 90c MU calls🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p3u6vb/its_time_for_90c_mu_calls/",
        "created": 1628917598.0
    },
    {
        "author": "Mr_XooX",
        "created_utc": 1628189344,
        "id": "oyozf5",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": " \n\n[SMH\\(SemiConductor Industry\\)](https://preview.redd.it/osps3eo95lf71.png?width=2400&amp;format=png&amp;auto=webp&amp;s=74b27d05c0611d9d4ed39d097b963a76cfe0f87e)\n\nSemi-Conductor Industry past 10-year returns.\n\nSemi-Conductor Industry has been the best-outperforming industry in the past 10 years and will still remain to outperform other industries because of its high demand globally varying from its uses in Computers to its major uses in the auto sector.\n\n**Global Forecast for the Semi-Conductor Industry**\n\n* The global semiconductor chip shortage is likely to continue till 2022 before it eases gradually.\n* The global shortage of semiconductor chips has triggered concerns as companies around the world fail to meet the rising demand for a wide range of essential as well as modern tech products.\n* The shortage has intensified over the past couple of months.\n* A recent analysis by Goldman Sachs suggested that at least 169 industries have been impacted by the global chip supply shortage.\n\nIn 2020, the global semiconductor industry reported revenue growth of 6.5% to reach US$440 bn.\n\nCheck out the full article: [https://blog.quantale.io/what-is-next-for-the-semi-conductor-industry-tsmc-intel-qualcomm-micron-technologies/](https://blog.quantale.io/what-is-next-for-the-semi-conductor-industry-tsmc-intel-qualcomm-micron-technologies/)",
        "subreddit": "smallstreetbets",
        "title": "What is next for the Semi-Conductor Industry: TSMC, INTEL, QUALCOMM, Micron Technologies",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/oyozf5/what_is_next_for_the_semiconductor_industry_tsmc/",
        "created": 1628218144.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628023018,
        "id": "oxccbz",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, August 3, 2021**\n\nStocks rose today, reversing from yesterday’s losses and extending the current run of day-to-day volatility. Like I said yesterday, I expect a lot of choppiness moving forward as the market participants continue to balance record corporate earnings and expectations for economic expansion with concerns surrounding the coronavirus Delta variant and inflation. Looking ahead, market participants wait for the July Jobs Report, set to be released on Friday.\n\nConcerns surrounding the highly contagious coronavirus Delta variant continue to rise, with Florida now emerging as the US’ new epicenter for the disease. Cases in Florida have jumped dramatically, going from 2432 on July 1 to 38,776 on July 30 and have so far had three consecutive days of record infections. Thankfully, however, despite the surge in cases, the death rate has so far remained stable and relatively low, a sign that the vaccines are very effective at preventing hospitalizations and serious death. \n\nIn the US, despite roughly 50% of the population being vaccinated, in the past two weeks, infections across the country have roughly doubled, with new cases jumping from 13,200 on July 4 to 78,433 as of July 31, according to data compiled by John Hopkins University. However, it is important to note, despite the surge the 7-day average of deaths is 360, once again according to John Hopkins University. However, it is very important to understand that cases remain highly concentrated in areas with high vaccine hesitancy, among other factors. For example, last week 1 in 3 new COVID infections came from just two states: Texas and Florida, according to the White House. While one always has to understand the risks present in the market, in my humble opinion, I don’t think the Delta variant will weigh too heavily on the US economy as a whole. \n\nAccording to data from the CDC, 97% of people who have died or been hospitalized with COVID-19 since the vaccine became widely available are unvaccinated. Dr Rochelle Walensky, Director of CDC said of the rising cases, “There is a clear message that is coming through. This is becoming a pandemic of the unvaccinated. Our biggest concern is we are going to continue to see preventable cases, hospitalizations, and sadly deaths among the unvaccinated.” Sadly, despite the widespread availability of the vaccine in the US, hesitancy in certain places remains very high.\n\nSo far, 59% of the companies in the S&amp;P 500 (SPY) have reported Q2 earnings, with 88% of these beating analyst expectations, according to FactSet. This quarter is shaping up to be another record-breaking one, with corporate earnings growth rate expected to accelerate 85%, which would be the biggest jump since the Q4 2009. \n\nHowever, it is important to note that, despite beating earnings expectations, a number of these companies have pulled back, with tepid outlooks moving forward overshadowing strong results. Moving forward, given that most companies have so far exceeded pre-pandemic levels and the current quarter has an easy comparison to last year, expectations for growth are inevitably going to moderate. This said, I think the pullback in some stocks following earnings is an overreaction. \n\n**Highlights**\n\n* General Motors (GM) said it will be closing three of its North American assembly plants next week due to the global shortage in semiconductors.\n* Shares of Tencent (TCEHY) fell 10% after a state-media called video games \"spiritual opium\". This prompted Tencent to say it will limit gaming time for minors and may even ban those under 12 from its platform. Looks like the regulatory crackdown in China continues…\n* After a disappointing IPO, shares of Robinhood (HOOD) gapped up more than 25% today. Stock is now roughly 27% above it’s IPO price of $38 \n* French pharma giant Sanofi bought Translate Bio, a biotech company focused on using mRNA to develop other vaccines and therapeutics. Paul Hudson, Sanofi CEO, said of the acquisition, “Translate Bio adds an mRNA technology platform and strong capabilities to our research, further advancing our ability to explore the promise of this technology to develop both best-in-class vaccines and therapeutics.”\n* Yesterday, semiconductor company Micron Technology announced it was starting a $0.10 dividend, a great sign that company operations are strong. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Arista Networks (ANET) with a host of target raises. Consensus price target $420 at Buy. Stock currently around $380\n* Amphenol (APH) target raised by Cowen from $75 to $80 at Outperform. Stock currently around $74\n* Digital Realty Trust (DLR) target raised by Deutsche Bank from $167 to $175 at Buy. Stock currently around $155\n* Global Payments (GPN) Target raised by Morgan Stanley from $216 to $219 at Outperform. Stock currently around $170\n* Linde (LIN) target raised by Wells Fargo from $340 to $360 at Overweight. Stock currently around $303\n* MercadoLibre (MELI) target raised by Credit Suisse from $1824 to $2050 at Outperform. Stock currently around $1575\n* ON Semiconductors (ON) with a host of target raises. Consensus price target $60 at Buy. Stock currently around $45\n* Restaurant Brands International (QSR) with two target raises. Stock currently around $66\n   * Credit Suisse from $74 to $76 at Outperform\n   * Royal Bank of Canada from $73 to $80 at Outperform\n* SolarEdge Technologies (SEDG) with two target raises. Stock currently around $300\n   * Piper Sandler from $342 to $351 at Overweight\n   * Goldman Sachs from $322 to $368 at Buy\n* Square (SQ) with a host of target raises. Consensus price target $320 at Buy. Stock currently around $270\n* Take-Two Interactive (TTWO) target raised by Wedbush from $212 to $222 at Outperform. Stock currently around $160\n* ZoomInfo Technologies (ZI) with a host of target raises. Consensus price target $75 at Buy. Stock currently around $56\n\n“If the plan doesn’t work, change the plan but never the goal.” - Unknown",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, August 3, 2021v",
        "url": "https://www.reddit.com/r/stocks/comments/oxccbz/here_is_a_market_recap_for_today_tuesday_august_3/",
        "created": 1628051818.0
    },
    {
        "author": "CapitalDesk",
        "created_utc": 1629006396,
        "id": "p4nw4t",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "We have been in a bull market the past year or so. MU has consistently posted good results. The fundamentals are strong. So why does MU keep going sideways, with no major movements? What could be some of the factors at play here?",
        "subreddit": "stocks",
        "title": "Why does the MU price keep going sideways?",
        "url": "https://www.reddit.com/r/stocks/comments/p4nw4t/why_does_the_mu_price_keep_going_sideways/",
        "created": 1629035196.0
    },
    {
        "author": "zatrades",
        "created_utc": 1629062167,
        "id": "p51yn3",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Not all chip stocks are trending up. Charts of some of the largest components in SMH. ( NVDA, ASML, INTC, MU ) These are all 6 months charts. I will be looking for swing trades if they drop due to overall market weakness.  Which would you buy, if any? Please share your thoughts. Charts from stockcharts.\n\nASML up 32% in 6 months.\n\n[ ASML up 32&amp;#37; in 6 months ](https://preview.redd.it/p7xd3uov7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=51fe8a4afbd11959cbe14078cad9466445dd33de)\n\n&amp;#x200B;\n\nIntel down 13.5% in 6 months.\n\n&amp;#x200B;\n\n[ Intel down 13.5&amp;#37; in 6 months ](https://preview.redd.it/u1vy9jvw7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=c768d0458bf6d24a50ea667654737aa9501c5d20)\n\nNvidia up 35%.\n\n&amp;#x200B;\n\n[ Nvidia up 35&amp;#37; ](https://preview.redd.it/i2zsujpx7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=57ee5355c833158225818ff7fb8e08a1372a8005)\n\nMicron down 19.5%.\n\n&amp;#x200B;\n\n[ Micron down 19.5&amp;#37; ](https://preview.redd.it/0vi9wruy7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=95f836972bc6d1d1b1608ad2a506bd7594fe88f5)\n\nWhich would you buy, if any? Please share your thoughts.",
        "subreddit": "StockMarket",
        "title": "Chip stocks SMH. ( NVDA, ASML, INTC, MU )",
        "url": "https://www.reddit.com/r/StockMarket/comments/p51yn3/chip_stocks_smh_nvda_asml_intc_mu/",
        "created": 1629090967.0
    },
    {
        "author": "jqdaddy2020",
        "created_utc": 1628776481,
        "id": "p30b6c",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "My poor MU 82.5 call!!!",
        "url": "https://i.redd.it/j58gmu87nxg71.jpg",
        "created": 1628805281.0
    },
    {
        "author": "jjbrady22",
        "created_utc": 1628669698,
        "id": "p28rhe",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Walgreens, i buy mu cigarettes here and have noticed how undervalued they are\n1. MyWalgreens: One of the largest Retail/Healthcare rewards system in the world, in order to access many BOGOs and sales at Walgreens u need to be a rewards member(free to sign up) this shit tracks all your info, what u buy, where u buy, how much u buy. This information is insanely valuable and if HIPPA laws change they can Sell your health info=🚀🚀🚀🚀\n2. Vaccine/Flu Shot. Booster shots may be priced in however, mRNA vaccines will allow for tons of ailments to be solved with a single vaccine. Dick can’t get hard? There will be a vaccine at Walgreens for that(Effects will only be temporary ;)  )\n3. New Credit card releasing later this month. Boomers love this place and if they are able to get 1% cash back on their adult diapers they buy every month,u can bet they are gonna fucking sign up, you can also pay for the insulin you can’t afford with it!\n4. Replaced Greasy Italian Stefano Pessina with Ebony Goddess Rosalind Brewer(WOKE AF). Pessina is a stupid 🐒 sauce monkey who’s careless acquisitions pissed off investor (AIDS) Brewer actually has experience in corporate retail leadership as she was like manager at Walmart or something .👸🏿\n5. Curbside/Prescription delivery. A partnership with DoorDash allows them to deliver Xanax straight to ur mouth awhile your on the couch. 🌙\n6. They are selling ad space on cooler screen now🚀🚀🚀\nPositions : Jan 2022 45c, Jan 2023 60c 65c 75c 80c🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "$WBA Boomer stock with double bagger potential",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p28rhe/wba_boomer_stock_with_double_bagger_potential/",
        "created": 1628698498.0
    },
    {
        "author": "Javen_t23",
        "created_utc": 1629800848,
        "id": "pakm32",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi everyone. One of my favourite investors is Seth Klarman and I've recently been trying to transition more of my portfolio to Value. Going through his last reported holding I noted that MU was in his top 10 and is also the Largest holding of Mohnish Pabrai. They both bought in the mid 80s and the stock is now trading in the low 70s. \n\nThere has already been some discussion on the company on the sub recently but I wanted to ask what you guys think these 2 investors (in particularly a strict value one like Seth) see in the company to buy in the 80s. I would assume that both will have averaged down during this dip. \n\nThanks",
        "subreddit": "ValueInvesting",
        "title": "Micron technology - Owned by two of my favourite investors",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/pakm32/micron_technology_owned_by_two_of_my_favourite/",
        "created": 1629829648.0
    },
    {
        "author": "theredpreacher",
        "created_utc": 1628870960,
        "id": "p3o5zo",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": " Quarterly Results\n\n**Micron reported positive Q3 2021 earnings in early July, with revenue coming in at $7.4 billion, up from $5.4 billion in Q3 2020.**\n\n**“Micron set multiple markets and product revenue records in our third quarter and achieved the largest sequential earnings improvement in our history,” said Micron Technology President and CEO Sanjay Mehrotra.**\n\n**Further, he said: “Our industry-leading 1α DRAM and 176-layer NAND now represent a meaningful portion of our production, and Micron is in the best position ever to capitalize on the long-term demand trends across the data center, intelligent edge, and user devices.”**\n\n**The majority of the revenue coming in from the sale of DRAM and NAND, DRAM constitutes about 73% of the revenue and NAND to about 24% of the revenue.**\n\n**For DRAM the revenue was up by 23% QoQ and up 52% YoY**\n\n**For NAND the revenue was up by 10% QoQ and up 9% YoY**\n\n&amp;#x200B;\n\n[Revenue Breakdown](https://preview.redd.it/kmheubhuf5h71.png?width=600&amp;format=png&amp;auto=webp&amp;s=d22f73cc6b350a0eacb242a57e39f40f126c6bc2)\n\n **Technical Analysis**\n\n[Trading view](https://preview.redd.it/uto1y6z0g5h71.png?width=1432&amp;format=png&amp;auto=webp&amp;s=e9a4ebfd3854addf714008c84f92de32f81311c7)\n\n \n\n**We noticed some unusual things with both fundamentals and technicals of the company. The demand for semi-conductor products is likely to continue growing till 2030, and as seen earlier, due to supply disruptions in semi conductor manufacturing companies, all major industries like the auto industry, electronics, large appliances etc. were impacted..**\n\n**Looking at the technicals of the company, the outlook has remained bearish for some time. The day started with huge sell orders and 200 day Moving Average (MA200) crossing  over MA50 on the daily chart., Also known as the infamous “death cross”, it is said to signal a down-trend. However, there are a few analysts who argue that it is a lagging indicator and happens after the selloff has already happened. In either case, there should be a relief rally soon to test the previous breakdown of support. The next major support for this stock is in the $50s range, which if you’re a bull, you would want to hold.**\n\n**At the moment, it seems like there is no end in sight for this sell-off for $MU.**",
        "subreddit": "wallstreetbets",
        "title": "What’s next for $MU? A huge correction?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p3o5zo/whats_next_for_mu_a_huge_correction/",
        "created": 1628899760.0
    },
    {
        "author": "Bigtime11691",
        "created_utc": 1629323804,
        "id": "p71793",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "  \n\nMy broker at xxx had me buy MU on July 2.\n\nIt has done poorly since then, along with many other semiconductor and tech stocks.\n\nNow I see **tremendous insider** **selling** by several officers within 2 weeks before and 2 weeks after my purchase.\n\nI looked at their SEC Form 4 which details the date and number of shares traded. \n\nBut the broker is not listed on that form.\n\nSo...I want to know if xxx Broker was involved in these insider transactions, and if he was encouraged or rewarded by having me and other clients purchase this stock.\n\nDoes anyone in the Reddit universe know how I can find that out?",
        "subreddit": "wallstreetbets",
        "title": "I need help: Broker says Buy when insiders are selling",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p71793/i_need_help_broker_says_buy_when_insiders_are/",
        "created": 1629352604.0
    },
    {
        "author": "abrahamlincoln20",
        "created_utc": 1628853558,
        "id": "p3ldqu",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Hi all,\n\nThought I'd share some stocks that I intend to buy in the very near future for the long hold. I'll give a short reasoning why I like them, and I'd like to hear your thoughts on them as well (pros, cons, any insights at all).\n\nMicron: Has a stellar track record, huge earnings, great financials and low valuation. Is about to start paying dividends, and management is optimistic about the future. The market seems to disagree, based on DRAM downturn speculation. I wouldn't worry about that, as the possibility of a small dip for a few years compared to 2-3x upside potential in the mid-long term, is negligible.\n\nGazprom: Biggest and lowest cost producer of natural gas,  which the world and especially Europe can't seem to live without. All that coal and nuclear energy production that is about to be closed will have to be replaced by natural gas. Nordstream 2 pipeline is almost finished. Valuation is still cheap despite recent gains.\n\nSpotify: One of few tech companies thats valuation isn't in the clouds. Has been beaten up recently (40% from highs), but is steadily growing and on its way to profitability.\n\nAT&amp;T: Unjustifiably low valuation on what is still a free cash flow machine. A history of failed acquisitions still weighs heavily on this one, but they are history now. The deal with Discovery will result in a telecom with a strong balance sheet and a streaming/entertainment company with a large potential for growth. Their combined value is much more than $28/share. Just needs a little patience. A low risk pick to balance the volatility of my other picks.\n\nBonus: Uranium miners. These are bound to rocket if the world decides to stop its madness regarding nuclear power. These complement Gazprom, either nuclear or natural gas will play an increasingly large role in global energy production, since renewables alone won't suffice.\n\nDisclaimer: I own stock in all of the companies mentioned and have held most of them for some years. Most have been good picks (and I like to think they are all great picks right now).",
        "subreddit": "stocks",
        "title": "Favorite stock picks: MU, T, GAZP, SPOT",
        "url": "https://www.reddit.com/r/stocks/comments/p3ldqu/favorite_stock_picks_mu_t_gazp_spot/",
        "created": 1628882358.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628802845,
        "id": "p391q5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, August 12, 2021**\n\nStocks largely finished higher, with all three major indexes managing to close out the day in the green. The S&amp;P 500 (SPY) and Dow Jones (DIA) once again recorded fresh intraday highs.  The Nasdaq (QQQ) broke two consecutive red days and finished higher today. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed relative to the major indexes, closing the day 0.26% down. It seems a pattern has emerged in the last week or so, in which the market pulls back early in the morning before reversing to the upside. Market participants continue to weigh new economic data and corporate earnings with concerns around the coronavirus Delta variant and potential inflationary pressures. \n\nYesterday, The Labor Department reported Wednesday that its consumer price index (CPI) rose 5.4% in July from a year earlier, in line with June’s figure and matching the largest jump since August 2008. The government said CPI increased 0.5% on a month-over-month basis, matching a consensus forecast from economists surveyed by Dow Jones.\n\nCore CPI which excludes energy and food, rose by 0.3% last month, shy of a forecasted 0.4% increase and well below June’s rise of 0.9%. The core figure is up 4.3% over the last year, a slight deceleration from June’s 4.5%. Economists often consider core CPI to be a more reliable indicator since it’s insulated from the frequent swings in petroleum and food prices. It’s encouraging to see prices slowly moderate as the economic recovery continues to mature and pent-up consumer demand is increasingly released. \n\nThe US Senate gave surprisingly bipartisan approval to a $1 trillion infrastructure bill. The bill appropriates money to rebuild the nation’s roads and bridges, fund climate initiatives, and bolster the nation’s broadband infrastrucutre. The vote, 69-30, was uncommonly bipartisan given the seeming contention the Republicans had for the initial drafts of the infrastructure bill. President Biden said, “This historic investment in infrastructure is what I believe you, the American people, want, what you’ve been asking for for a long, long time.” Mitch McConnell, who earlier in the year publicly declared “100% of my focus is on stopping this new administration” said of the deal, “I was proud to support today’s historic  bipartisan infrastructure and prove that both sides of the political aisle can still come together around common-sense solutions.” The bill appropriates money to rebuild the nation’s roads and bridges, bolster public transportation, fund climate initiatives, and bolster the nation’s broadband and 5G infrastrucutre. Here is a full list of what is included: [https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/](https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/)\n\n**Highlights**\n\n* A slew of corporate earnings continues, with notable names like ContextLogic (WISH), SoFi Technologies (SOFI), Disney (DIS), Rocket Mortgage (RKT) and Airbnb (ABNB) reporting\n   * WISH and SOFI both plummeted after earnings\n* Shares of Micron Technology (MU) continued its steep pullback, falling more than 7% today after analysts at Morgan Stanley downgraded the stock citing fears of deceleration in DRAM sales. Worse day in the stock since March 2020\n* Financial stocks continued their rally as the benchmark 10-year Treasury yield continues its rebound from six month lows. \n* Producer prices rose 1.0% month-on-month in July, the Labor Department reported Thursday. This matched June's monthly rise, and came in ahead of the 0.6% rise expected. \n* U.K. antitrust officials said they could call on Facebook Inc. to unwind its acquisition of Giphy, a provider of popular animated images, after provisionally finding that the deal would harm competition between social-media platforms and in the display advertising market.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices**\n* Chipotle (CMG) target raised by Piper Sandler from $2100 to $2235 at Overweight. Stock currently around $1875\n* Deckers Outdoor (DECK) target raised by the UBS Group from $470 to $540 at Buy. Stock currently around $430\n* Nvidia (NVDA) with three target raises. Stock currently around $198\n   * UBS Group from $184 to $230 at Buy\n   * Wells Fargo from $219 to $245 at Overweight\n   * Evercore ISI from $187.5 v $250 at Outperform\n* Maravai Lifesciences (MRVI) target raised by Morgan Stanley from $54 to $62 at Overweight. Stock currently around $55\n* Synopsys (SNPS) target raised by Wells Fargo from $310 to $325 at Overweight. Stock currently around $292\n\n“To Bear Trials with a Calm Mind Robs Misfortune of its strength and burden.” — Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, August 12, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p391q5/here_is_a_market_recap_for_today_thursday_august/",
        "created": 1628831645.0
    },
    {
        "author": "Micas1001",
        "created_utc": 1629675434,
        "id": "p9nnvd",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "What is your intrinsic value and what method did you use? Thoughts/your opinion about this company?\n\nI used DCF \nMy intrinsic value is 171$",
        "subreddit": "ValueInvesting",
        "title": "Is Micron Technology undervalued?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/p9nnvd/is_micron_technology_undervalued/",
        "created": 1629704234.0
    },
    {
        "author": "Mr_XooX",
        "created_utc": 1628189205,
        "id": "oyoxni",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[SMH\\(SemiConductor Industry\\)](https://preview.redd.it/v5jnz1ts4lf71.png?width=2400&amp;format=png&amp;auto=webp&amp;s=fdeb32436b041e2dae8bc4af50d2379adda003ef)\n\nSemi-Conductor Industry past 10-year returns.\n\nSemi-Conductor Industry has been the best-outperforming industry in the past 10 years and will still remain to outperform other industries because of its high demand globally varying from its uses in Computers to its major uses in the auto sector. \n\n **Global Forecast for the Semi-Conductor Industry**\n\n* The global semiconductor chip shortage is likely to continue till 2022 before it eases gradually.\n* The global shortage of semiconductor chips has triggered concerns as companies around the world fail to meet the rising demand for a wide range of essential as well as modern tech products.\n* The shortage has intensified over the past couple of months.\n* A recent analysis by Goldman Sachs suggested that at least 169 industries have been impacted by the global chip supply shortage.\n\n In 2020, the global semiconductor industry reported revenue growth of 6.5% to reach US$440 bn. \n\nCheck out the full article: [https://blog.quantale.io/what-is-next-for-the-semi-conductor-industry-tsmc-intel-qualcomm-micron-technologies/](https://blog.quantale.io/what-is-next-for-the-semi-conductor-industry-tsmc-intel-qualcomm-micron-technologies/)",
        "subreddit": "StockMarket",
        "title": "What is next for the Semi-Conductor Industry: TSMC, INTEL, QUALCOMM, Micron Technologies",
        "url": "https://www.reddit.com/r/StockMarket/comments/oyoxni/what_is_next_for_the_semiconductor_industry_tsmc/",
        "created": 1628218005.0
    },
    {
        "author": "ahududumuz",
        "created_utc": 1628694959,
        "id": "p2f2v3",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I wanted to make this post after seeing the guy lost tons of money on Moderna. I lost (still losing) money on MU call options. I only lost around 500-550 dollars but that amount is like my 20-25 percent of my portfolio so I'm pretty sad. Feeling sick to my stomach. Just ranting... I hope everyone is doing better than I do.",
        "subreddit": "options",
        "title": "MU calls",
        "url": "https://www.reddit.com/r/options/comments/p2f2v3/mu_calls/",
        "created": 1628723759.0
    },
    {
        "author": "Smartinvestor007",
        "created_utc": 1628138599,
        "id": "oyabga",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Pls select your options\n\n[View Poll](https://www.reddit.com/poll/oyabga)",
        "subreddit": "Wallstreetbetsnew",
        "title": "What do you guys think about micron and Uber ?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/oyabga/what_do_you_guys_think_about_micron_and_uber/",
        "created": 1628167399.0
    },
    {
        "author": "MutuallyAssuredBOOP",
        "created_utc": 1628775709,
        "id": "p302uj",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Shorted 75p and 72p 8/13 exp. Think I’ll have of a buying opp to close even/positive? If not, I guess I’ll be writing calls on this for a bit.",
        "subreddit": "options",
        "title": "Oof MU short puts smarting right now w/ MS downgrade",
        "url": "https://www.reddit.com/r/options/comments/p302uj/oof_mu_short_puts_smarting_right_now_w_ms/",
        "created": 1628804509.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1628786948,
        "id": "p33sq7",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/micron-falls-memory-concerns-even-153903684.html\n\nThe stock dropped nearly 8% in its biggest intraday decline since March. It has lost more than 15% so far this week, putting it on track for its biggest one-week decline since March 2020.\n\nThe day’s slump came after Morgan Stanley downgraded the stock to equal weight from overweight as a part of a broadly negative call on the market for the DRAM category of memory chips, Micron’s largest product in terms of revenue, according to data compiled by Bloomberg.\n\nThese few day stocks decline are not reasonable. Mu, amat and lrcx these are all valuation reasonable and quality stocks. They dropped for 10% or more for the past few days. Chip shortages and 5G trend are still ongoing, these stocks should still have a lot of growth potential, so investors should start to adding positions here.",
        "subreddit": "stocks",
        "title": "Micron Falls on Memory Concerns Even as Some Analysts See Bottom",
        "url": "https://www.reddit.com/r/stocks/comments/p33sq7/micron_falls_on_memory_concerns_even_as_some/",
        "created": 1628815748.0
    },
    {
        "author": "whyshw",
        "created_utc": 1628778499,
        "id": "p30yg4",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Reminder to self: stay disciplined and lock in gains. Sharing my mistake with MU calls",
        "url": "https://www.reddit.com/r/options/comments/p30yg4/reminder_to_self_stay_disciplined_and_lock_in/",
        "created": 1628807299.0
    },
    {
        "author": "theredpreacher",
        "created_utc": 1628871187,
        "id": "p3o943",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": " **Quarterly Results**\n\n**Micron reported positive Q3 2021 earnings in early July, with revenue coming in at $7.4 billion, up from $5.4 billion in Q3 2020.**\n\n**“Micron set multiple markets and product revenue records in our third quarter and achieved the largest sequential earnings improvement in our history,” said Micron Technology President and CEO Sanjay Mehrotra.**\n\n**Further, he said: “Our industry-leading 1α DRAM and 176-layer NAND now represent a meaningful portion of our production, and Micron is in the best position ever to capitalize on the long-term demand trends across the data center, intelligent edge, and user devices.”**\n\n**The majority of the revenue coming in from the sale of DRAM and NAND, DRAM constitutes about 73% of the revenue and NAND to about 24% of the revenue.**\n\n**For DRAM the revenue was up by 23% QoQ and up 52% YoY**\n\n**For NAND the revenue was up by 10% QoQ and up 9% YoY**\n\n&amp;#x200B;\n\n[Revenue Breakdown](https://preview.redd.it/wd3dprsjg5h71.png?width=600&amp;format=png&amp;auto=webp&amp;s=fc5708be8e1557b43f61bd1e16d312d714bedb5f)\n\n **Technical Analysis**\n\n&amp;#x200B;\n\n[Trading view chart](https://preview.redd.it/es95lfupg5h71.png?width=1432&amp;format=png&amp;auto=webp&amp;s=dc2be5cd5e1a00e80a23d181ba4edca77d3ca457)\n\n \n\nWe noticed some unusual things with both fundamentals and technicals of the company. The demand for semi-conductor products is likely to continue growing till 2030, and as seen earlier, due to supply disruptions in semi conductor manufacturing companies, all major industries like auto industry, electronics, large appliances etc. were impacted..\n\nLooking at the technicals of the company, the outlook has remained bearish for some time. The day started with huge sell orders and 200 day Moving Average (MA200) crossing  over MA50 on the daily chart., Also known as the infamous “death cross”, it is said to signal a down-trend. However, there are a few analysts who argue that it is a lagging indicator and happens after the selloff has already happened. In either case, there should be a relief rally soon to test the previous breakdown of support. The next major support for this stock is in the $50s range, which if you’re a bull, you would want to hold.\n\n**At the moment, it seems like there is no end in sight for this sell-off for $MU.**",
        "subreddit": "StockMarket",
        "title": "What’s next for $MU? A huge correction?",
        "url": "https://www.reddit.com/r/StockMarket/comments/p3o943/whats_next_for_mu_a_huge_correction/",
        "created": 1628899987.0
    },
    {
        "author": "comaye",
        "created_utc": 1629629440,
        "id": "p9aeba",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Disclaimer: My entire portfolio is on MU options, it rose to 450k in June, then slammed to120k, then back up to 300k, then tumbled to 90k recently. I plan on holding and rolling out my calls until the stock hits the $85-$95 range (maybe more if momentum is significant).\n\nWhy I Think Stonk Going to Go Up:\n\nLiterally every single segment of the DRAM and NAND industry is going to increase fairly significantly in all forecasts I have seen. The company is expected to experience significant demand from 5G, AI, and servers. Total quantity of DRAM and NAND demanded per segment is going to increase YOY, even if total PCs and smartphones produced decreases YOY. You have a well positioned company in an industry that's going to have huge growth for the next few years (minimum). My personally favorite signal, was the CEO saying to expect repurchasing in 4Q 2021 to increase significantly, and he likes the price ($82-85 when he said this) for repurchasing the stock, meaning he perceives the fundamental/fair value of Micron to be significantly more than that. If repurchasing is significant 4Q, then this confirms the signal since the CEO is putting his money where his mouth is.\n\nEPS for 2022 is Expected to be $11+, and EPS for 2023 is expected to be $12+. Even with a cyclical downturn, it can't be significant because of the sheer growing demand for Micron's products is going to continue to grow. These forecasts are upheld with the company signals (dividend and share repurchase price comments by the CEO) make me pretty confident in the company. Furthermore, I will always weigh company signals and industry insider comments over the word of a bearish analyst.\n\nWhy the Bear Argument Sucks:\n\nRecently, the stonk reversed its downwards trend when the company kicked off a dividend, which was an insignificant amount but a pretty significant signal as it shows the company believes the cyclicality will stabilize. However, shortly after it rallied I got a bunch of notifications for puts being bought at a fat volume. A day later, Morgan Stanley releases a dramatic \"Winter is Coming\" and slashes its PT of MU from $105 (I think they called it a buy with a PT $105 8 days before slashing it) to $75. The report itself is pretty poorly put together, but I'm not going pick it apart here. There’s an article on Seeking Alpha by Robert Castellano that does a decent job explaining why the report was doodoo (I’d link it if I was allowed to). The combination of unusual options activity with the huge cut of a PT right after (and right after the same analyst had put a big PT on it) led to a some people on this site and others to be suspicious of price manipulation ([like Morgan Stanley has done in the past](https://www.reuters.com/article/us-france-amf-morgan-stanley-idUSKBN1YE0N6)).\n\nOther than that, there's concerns that supply chain difficulties are going to leave money on the table for Micron because they can't fulfill all the demand (which isn't that big of a deal because whatever can be supplied is going to go for a large premium in their contract market). However, any effort by the company to rectify the supply issue gets punished, as people fear it'll decrease pricing power (despite higher sales). So for this part, either way Micron can't do anything that pleases the market but it doesn't change the fact they making a ton of money over the next couple years (which is the time period these concerns are looking at). I don't find these concerns to be really significant and they have been around for quite a while.\n\nFinally, technical traders think stock going down because there's a huge amount of put open interest (I think put-call ratio is 1.5) and moving average indicators are negative. This might be true in the short term, but puts don't dictate fundamental company performance (Tesla).\n\nPrice Target:\n\nI don't really have a price target. If a rally stalls out significantly in the $85-$95 range I'll probably take profits or roll out my calls another quarter. However, I think if momentum is strong enough it could trade in the $95-$105 range. This range comes from looking at the historical discount Micron has had in the past between average price target (currently $115 with the recent cuts) and the market price. Historically, the difference is 10-20% in periods where there wasn't hype nor fears.\n\n&amp;amp;#x200B;\n\nWhile I'm only looking at calls for this stock, this stock should be appealing for holders as the 1yr upside potential is 60% (70-&amp;gt;115). For me, the biggest signal to look at is going to be the repurchase activity they disclose in the upcoming earnings call. Since the CEO said 82-$85 is a good price to repurchase at, then the firm has had plenty of repurchase opportunities with the huge recent sell offs. If they meet their 50% FCF payback goal this quarter, then I think there will be a strong rally as analysts will expect that trend to continue in 2022 and 2023 (with the significantly higher FCFs the company will have in those periods).",
        "subreddit": "wallstreetbets",
        "title": "Micron Is Disgustingly Undervalued",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p9aeba/micron_is_disgustingly_undervalued/",
        "created": 1629658240.0
    },
    {
        "author": "MutuallyAssuredBOOP",
        "created_utc": 1628619061,
        "id": "p1uued",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Looks like some support at that level and put premiums are creeping up. Fits my budget and plan. Wouldn’t mind owning underlying at that price either. Yea or nay?",
        "subreddit": "options",
        "title": "MU 8/13 and 8/20 short 74 str puts for theta?",
        "url": "https://www.reddit.com/r/options/comments/p1uued/mu_813_and_820_short_74_str_puts_for_theta/",
        "created": 1628647861.0
    },
    {
        "author": "LegendaryHODLer",
        "created_utc": 1627856830,
        "id": "ow1tr9",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "# Last Week's Review\n\nWe hit some home-runs last week with AMD, CLF, and TLRY. All of which were up over 20% at one point. The other names are not doing too bad either and IMO still “consolidating” with their charts &amp; technicals. Here’s a snapshot of the ticker performance from the last two weeks. In the same time-period SPY has gone up 3%.\n\nhttps://preview.redd.it/2nincqfdote71.png?width=774&amp;format=png&amp;auto=webp&amp;s=9ff5b1cf77e59cbb1c84c622c8ad5fdcebbc5de7\n\n&amp;#x200B;\n\nI exited my position on CLF as I felt it was beginning to get into the “red zone” I talk about. The ticker has been on an unbelievable uptrend since the start of the year and the chart is beautiful. However, I highlighted below a short-term risk area after the stock has shot up 30% in 7 days (due to good earnings as well). It’s nearing the top of the trend channel and could potentially see a reversal. Either way, I protected my trade.\n\n&amp;#x200B;\n\nBefore we get into the tickers for this week here's a breakdown of some of my charting rules and terminology.\n\n# Chart Guidelines &amp; Terms\n\nI use the term \"meme stock\" loosely as these aren't necessarily meme companies. I really mean that the ticker has a HIGH PROBABILITY to trend on social media and the stock price could be affected by social sentiment. The watchlist I give is usually comprised of tickers that have taken a breather after getting too hot from a social aspect.\n\n&amp;#x200B;\n\nMoving along, I like to look at my charts from a risk-reward perspective.\n\n\"Red Zones\" are high-risk lotto plays.\n\n\"Orange Zones\" are a bit of a mixed bag between being too hot or early in the trend.\n\n\"Green Zone\" is where I try to buy. These trades are never guaranteed (nothing in life is), but from a risk-to-reward point of view they are in my favor.\n\n&amp;#x200B;\n\nAs always, this is not financial advice or a recommendation to buy or sell a stock. Please do your own research before entering any positions.\n\n&amp;#x200B;\n\n# The Meme List\n\n&amp;#x200B;\n\n**Skillz Inc (SKLZ)**\n\nI categorize this play on the meme stock list because SKLZ has been known to trend on various social media outlets and gain momentum through retail traders. This is a lucrative play and considered a YOLO with earnings coming up on Tuesday after the close. Looking at the chart the stock price is back to 3-month lows and where it was trading last December.\n\nIt’s current valuation at $14 is still pretty rich (5b market cap off 270m in sales), but should the stock continue to drop it might become quite favorable. This ticker traded at $45 back in February and is down 60% since.\n\nThere are many doubters in the viability of this company’s business model, but for a high-risk, high-reward play I like it at this current price. Having said that, ARK ETFs currently hold about 20 million shares of SKLZ.\n\nhttps://preview.redd.it/ov63q66eote71.png?width=2558&amp;format=png&amp;auto=webp&amp;s=2ffc1f8da6a7e8dbadde81baafa4652e995fc653\n\n&amp;#x200B;\n\n**Peloton (PTON)**\n\nPTON chart looks ready for another break-out to the upside. This could be a potential “fear of lockdown” play and any news of Covid variants will cause this to pop. Glancing at the fundamentals the company has quite a strong balance sheet with very little debt, and strong growth. Most analyst’s concerns on this name are regarding if the growth is actually sustainable for the long-term.\n\nAt $118 per share the stock is nearing the bottom of the channel for it’s most recent trend over the last 3 months.\n\nhttps://preview.redd.it/gur9i0weote71.png?width=2558&amp;format=png&amp;auto=webp&amp;s=35ffeb15132ea44c3f29d1a960e58f785f217171\n\n&amp;#x200B;\n\n**FuboTV (FUBO)**\n\nLast, but not least on the meme’s list we have FUBO. Remember the meme’s list are tickers that have the potential to gain momentum through retail traders and popularity. This can sometimes be a driving force and the truth is you need to be in on these names BEFORE the hype-train leaves the station.\n\nFUBO had exceptionally strong performance back in December last year when it hit $60 per share. Concerns over the company’s growth and sustainability have knocked the share price down by 60% and currently sits at $26. IMO we could be entering a green zone as the stock has traded sideways for a month now. FUBO reports earnings August 10.\n\nhttps://preview.redd.it/z66t32nfote71.png?width=2554&amp;format=png&amp;auto=webp&amp;s=33c369e04882f29d5db69df663bccaa7700b78bf\n\n&amp;#x200B;\n\n# The BTFD List\n\n&amp;#x200B;\n\n**Teladoc (TDOC)**\n\nTDOC is one of the leaders in the “tele-health” industry. It gained momentum and popularity throughout lockdowns, but as the world-reopened the stock price has tumbled. In March, Amazon also announced their entry into the tele-health services and investors did not like this increase in competition.\n\nThis is a risky play and is potentially reliant on the lockdown catalyst, but at $148 per share and a 50% haircut from it’s 52-week high, I will be looking to enter this position.\n\nhttps://preview.redd.it/v3kny7ngote71.png?width=2556&amp;format=png&amp;auto=webp&amp;s=7709c634abc65d3fd164c5082a6cb9d1d163ffb9\n\n&amp;#x200B;\n\n**American Airlines (AAL)**\n\nAmerican airlines is a re-opening play. Travel is nearly back to pre-pandemic levels and most “re-opening” stocks are still trading at a discount due to future uncertainties.\n\nThe chart for most airlines will be quite similar to each other, and in my opinion the worst is behind us. I’m looking for short-term upside on this one before the trend breaks down again.\n\nhttps://preview.redd.it/8zeibk4hote71.png?width=2554&amp;format=png&amp;auto=webp&amp;s=bb8727e73d29eedb2c9134a3b588cb1986ea5bfd\n\n&amp;#x200B;\n\n**Micron Technology (MU)**\n\nOut of all the semi-conductor plays it always seems like MU gets no love. AMD and NVDA are performing very strong, but MU seems to be the laggard. MU is trading at a PE of 21 while NVDA and AMD trade at 92 and 37, respectively.\n\nMU just posted very solid earnings and the macro environment should be a strong driver of growth for semi-conductors in general. There has been a chip-shortage for some time now affecting many industries and all this pent up demand will last into 2022.\n\nI thought this stock was going to continue it’s breakout at $95 a share, but it broke down starting in April and may have found a bottom at $77. I like MU here and might enter a position.\n\nhttps://preview.redd.it/bya2xywhote71.png?width=2550&amp;format=png&amp;auto=webp&amp;s=e6f3b1453ae52c152d07f5a0de245e5d4227142f\n\n&amp;#x200B;\n\n**Closing Thoughts**\n\nThat’s the end for this week. Remember, investing is about PAYtience because it pays to be patient. There are A LOT of uncertainties in this market right now which means it is not the time for crazy YOLOs. We have risks from inflation, covid, rates &amp; QE tapering, re-opening risk (or lack of going back to “normal”).\n\nThe VIX might not be close to the highs, but volatility is STILL HERE. We are seeing 2-5% daily swings in a lot of stocks right now. If anyone remembers before the pandemic you would be lucky to see a 2% move in most names.\n\nHope you all had a great weekend and I’ll be back next week. Just FYI I might start adding a mid-week update some of the weeks to spot existing up-trends, down-trends, or tickers hyped on social media.",
        "subreddit": "StockMarket",
        "title": "I scanned over 150 charts this weekend. Here are some good setups I found to BTD: SKLZ, PTON, FUBO, TDOC, AAL, MU",
        "url": "https://www.reddit.com/r/StockMarket/comments/ow1tr9/i_scanned_over_150_charts_this_weekend_here_are/",
        "created": 1627885630.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1628619701,
        "id": "p1v23r",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "W￼ith Apple‘s iPhone typical fall launch is fast approaching, details about the device’s new capabilities have started to leak out.\n\nAs consumers and gadget fans pore over the tidbits for taste of what Apple’s (ticker: AAPL) latest pocket computetr will have in store, chip investors too are scrutinizing the trickle of information. In a Tuesday report, Bloomberg News said the new Apple phones will feature new video and camera features, a faster Apple-designed chip to power the gadget, and new screen technology. Apple will keep the same iPhone dimensions and designs as last year’s models, the report said.\n\nBased on the scarce available details, the exact makeup of the guts of the next line of iPhones is highly speculative at this point. But, investors know a few things already based on past designs and the bare-bones description. \n\nOne of the biggest changes in recent memory was the iPhone’s adoption of 5G technology, requiring a batch of new chips to support the fast uplink speed. For many phones, including Apple’s, that tended to mean much more silicon overall, which was good news for the chip makers that supply Apple with parts.\n\nFor the 5G modems themselves, the iPhone 12 contained chips made by Qualcomm (QCOM), which suggests it too will likely supply the iPhone’s 5G wireless chip—at least for now. Apple has reportedly launched its own effort to design wireless radios, so that may change in the future. The chip giant has made other chips for the iPhones such as power modules. \n\nSkyworks Solutions (SWKS) and Qorvo (QRVO) make radio-related iPhone components, too, and have both been historic suppliers. Broadcom (AVGO) also has made wireless chips and other iPhone components. Barclays chip analyst Blayne Curtis has staked Qorvo has his favorite of the batch of Apple suppliers he watches.\n\nFor the new camera, it’s possible Texas Instruments (TXN) could play a role, as it has supplied the power-management chip for previous iterations of the iPhone camera. Its chips that help with battery-charging have also been spotted in past phones.\n\nMemory-wise, according to an iFixit teardown, the last iPhone used random access memory made by Micron Technology (MU). Micron has said the 5G upgrade cycle has benefited it because new generation phones typically carry more RAM than their 4G counterparts. The iPhone 12’s flash storage was produced by closely held Kioxia Holdings, a Japanese memory maker that has been considering an initial public offering in recent months.\n\nWe know Apple is designing the chips that power its phones, and has for several generations, effectively cutting out Qualcomm from the processor part of iPhone revenue. Taiwan \nSemiconductor Manufacturing (TSM), has made the chip in the past, and it is all but certain to be making the latest iPhone processors.\n\nSource: Barron's\n\nSome of the semi stocks mentioned in this article are still worth to buy. qcom, tsm, mu, skws and qrvo are all trading between 20 to 30 pe. The revenue growth for these stocks are still attractive. With apple releasing the new iphones at September, these stocks will definitely benefit from the ongoing 5G trend.",
        "subreddit": "stocks",
        "title": "Apple Suppliers That Could Benefit New iPhone Models",
        "url": "https://www.reddit.com/r/stocks/comments/p1v23r/apple_suppliers_that_could_benefit_new_iphone/",
        "created": 1628648501.0
    },
    {
        "author": "babbldev",
        "created_utc": 1629161316,
        "id": "p5t7nn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " Weekend Sentiment Review (8/14-8/15)\n\nTickers with most optimistic / pessimistic sentiment in this weekend's news coverage:  \n\nMost optimistic: \n\n1. [$AMD](https://twitter.com/search?q=%24AMD&amp;src=cashtag_click) \n2. [$PFE](https://twitter.com/search?q=%24PFE&amp;src=cashtag_click)\n3. [$ABNB](https://twitter.com/search?q=%24ABNB&amp;src=cashtag_click) \n4. [$MU](https://twitter.com/search?q=%24MU&amp;src=cashtag_click)\n5. [$MRNA](https://twitter.com/search?q=%24MRNA&amp;src=cashtag_click)\n6. ...\n\nMost pessimistic: \n\n1. [$AMAT](https://twitter.com/search?q=%24AMAT&amp;src=cashtag_click)\n2. [$WISH](https://twitter.com/search?q=%24WISH&amp;src=cashtag_click)\n3. [$PTON](https://twitter.com/search?q=%24PTON&amp;src=cashtag_click)\n4. [$TMUS](https://twitter.com/search?q=%24TMUS&amp;src=cashtag_click)\n5. [$INTC](https://twitter.com/search?q=%24INTC&amp;src=cashtag_click)\n6. ...\n\n [\\#StocksToWatch](https://twitter.com/hashtag/StocksToWatch?src=hashtag_click) full top 10 lists below:\n\n*Sources: 1,468 articles published by Benzinga, Yahoo Finance, Seeking Alpha, and 50+ others*\n\nhttps://preview.redd.it/q6fesuthfth71.jpg?width=835&amp;format=pjpg&amp;auto=webp&amp;s=4243c8f031ba9fae764c892452e9708e7f4a83f2\n\nhttps://preview.redd.it/8ck2kvthfth71.jpg?width=839&amp;format=pjpg&amp;auto=webp&amp;s=856a1a142e5538908917f7f2b0b872db5bd656d2",
        "subreddit": "StockMarket",
        "title": "Tickers with the most optimistic / pessimistic sentiment in this weekend's news coverage:",
        "url": "https://www.reddit.com/r/StockMarket/comments/p5t7nn/tickers_with_the_most_optimistic_pessimistic/",
        "created": 1629190116.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1630025059,
        "id": "pcchyc",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Most great semi stocks are already priced in or overvalued, and we smart experienced apes know that you never buy overvalued stocks because its potential gain is small and its potential loss is too big.\n\nTherefore, we need to buy the stock that is undervalued but eventually goes up to meet its price target later because of its strong fundamentals and future growth (which is MU). And why do we need to pick semi stocks for this? Because Semiconductor business is one of the most potential and profitable business in the whole industry; we simply think that everything is turning to digital and AI systems, and all those devices, platforms, and servers need memory chips. Biden's infrastructure bills and his willingness to support semi industry are also tailwinds of semi stocks.\n\nOk, so why MU is the most undervalued stock among all semiconductors now?\n\nBecause it is ridiculously cheap! 7x forward price to earnings multiple now, and even though it actually have a slowdown in memory chip industry, it is still 10-12x forward earnings which is still ridiculously cheap compared to other semi stocks. (According to Quint Tatro, Joule Financial founder at CNBC).\n\nMU's 52 week high is 96.96, and its current price is 72.77. It showed some high volatility and corrections after its ATH because it went up too fast in short time (52 week low is 43.67). The last large correction made MU's price down from 83 to 68.80 which was 17% down in 4 days. This correction happened because of Morgan Stanley's report that says 'winter is coming' for semis. However, all other institutions and investors, including Goldman Sachs, Bofa, Jim Cramer, think that MU is way undervalued, and its price is at the bottom now. Vanguard Group, Sanders Capital, and State Street, top 5 MU shareholders, added MU positions between August 6 to August 16 ([https://whalewisdom.com/stock/mu](https://whalewisdom.com/stock/mu)). Since many institutions and large investors start to buy MU back, its price went up from 68 to 77, and then it dropped to 73 today due to the red market and some sell offs. \n\nReasons why this is a great timing to buy MU now\n\n1. The sentiment turned to bullish. It kept going up since it hit its bottom price 68, and yesterday, August 25th, it pumped from 73 to 77 in few minutes, closed at 74, and the current price is 72.77 now. Great buying point before it keeps pumping after this Jackson Hole meeting.\n2. Too CHEAP compared to ALL other semis. Here is the picture. (seekingalpha)\n\n[As you can see, MU is -23.64&amp;#37; from 52 week High on August 25, it has a more discount today since it dropped to 72.77. Ok, then we might doubt about its fundamentals and its future growth. Don't worry, here is why most analysts and institutions think MU is super undervalued and it is time to buy now.](https://preview.redd.it/debopnsz9sj71.png?width=1522&amp;format=png&amp;auto=webp&amp;s=2c8ed55ed03c8aea5fd0f96ca1658ec3c3c174b7)\n\n[Its FY1 is 12.13 which is already great, but its FY2 and 3 is 6.36 and 6.34 which is too great compared to others. So, it is a great time to buy it before all those number soar later.](https://preview.redd.it/j8azt162bsj71.png?width=1233&amp;format=png&amp;auto=webp&amp;s=240e36d04a518463049c783da3419a4fa7e969f1)\n\n[Their EPS and Revenue growth are also great too \\(beating all estimates for over 2 years\\). ](https://preview.redd.it/5puxp7macsj71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=86d8874f3047b816923bddb20285c12d75a0622c)\n\n3. Morgan Stanley, aka sneaky bitches, revealed a report 'winter is coming' or whatever, saying that DRAM memory chip price was already at the peak and it is going down now which will lead all DRAM company's profit to go down due to its historical data. However, most institutions and investors still believe that DRAM's demand is still too strong enough to cover that DRAM price drop, because all PCs, Servers, Laptops, smartphones, tablets, robots, cars, and anything that has automated computer system needs 'memory chip'. Semi industry has a bright future, and I think Morgan Stanley's report was just a manipulation in order to short the stock and buying it back at discounted price. This asshole bought SK hynix (2nd largest DRAM company) shares back after its correction in Korea. Its price was 120,000 Won before MS's report, and it dropped to 98,000 after its report and they started buying back from 100,000 now. ([https://finance.naver.com/item/main.nhn?code=000660#](https://finance.naver.com/item/main.nhn?code=000660#)). I still strongly believe that this stock will keep going up before tapering. (I hope the Fed does not mention about tapering at Jackson Hole).\n\n4. RSI number is important because we can know if the stock is overbought or not. The current market sentiment is unstable due to upcoming tapering, interest rates, inflation, national debts, infrastructure, etc. and most overbought stock have a high chance to meet its huge corrections later. Ok, so MU's current monthly RSI is 57. It is still in the middle which is a great number for tech growth stock. For example, Nvidia's monthly RSI is 86, AMD's monthly RSI is 85, AMAT is 75, TSM is 76, Qualcomm is 65, and ASML is 93. RSI does not explain everything, but it helps you to know that MU is pretty undervalued.\n\n5. Most great investors always say 'being simple is the best strategy'. I also believe that. Simply, we will make the money if we buy the GOOD stock in cheap way and sell it in expensive way. And simply, MU, a GOOD stock, is cheap now. \n\n6. Here is a better explanation about MU itself (my first MU DD) that shows why MU is a GOOD stock.  [https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron\\_will\\_eventually\\_rally\\_5080\\_upside\\_potential/](https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron_will_eventually_rally_5080_upside_potential/)\n\nThere is a high chance that the Fed will not mention about tapering at Jackson Hole meeting because of Delta variant problems and slower than expected economy recovery. If they don't, tech stocks have a higher chance to get pumped for a while, and indeed, undervalued stocks have the highest chance to soar. So I personally strongly believe that few more tailwinds can drive MU price up to 20-30% before its next earnings (Sep 27), and 60-100% in 3-6 months depending on market sentiment.\n\nIts current price targets are: Yahoo avg 115.59, Seeking Alpha avg 111.76, Marketwatch avg 115.85,    \n Tip Ranks: 112.64, Marketbeat: 112.07, CNN: 112.50.  Total Average PT: 113.40.\n\nIt is simple, but actually not easy. Buy it now since it is turning to bullish, and sell the news before it actually tanks again. If the tapering is coming? Buy the PUTs or wait until the price became cheap again with healthy correction. And then we get in the ride again when it starts pumping again. I think that is how you can survive in this stupid unpredictable market. I sometimes use option straddle strategy during this unpredictable market because all you need to do is choosing high volatility stocks (I might use this strategy for MU later since it has a high volatility, and the current market is unpredictable).\n\nMy positions:  24 Sep 72c x 7 , 24 Sep 68c x 10, owning 100 shares.\n\nIndeed, this is just my DD, no financial advice. \n\nThank you guys.",
        "subreddit": "wallstreetbets",
        "title": "MU, the most undervalued semi stock, has 20-30% upside potential in a month, 60-100% in 6 months (Sentiment turned to bullish this week, TIME TO BUY)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pcchyc/mu_the_most_undervalued_semi_stock_has_2030/",
        "created": 1630053859.0
    },
    {
        "author": "JEJEJEJEJEJEJE888888",
        "created_utc": 1629484164,
        "id": "p8b12z",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$MU being pinned under $70 on light volume today. If we all buy in last 1.5 hours it will explode to the upside. It is also a great long term company to own. Super cheap and lots of growth ahead! Let’s do this!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p8b12z/mu_being_pinned_under_70_on_light_volume_today_if/",
        "created": 1629512964.0
    },
    {
        "author": "robin_rocket",
        "created_utc": 1629136332,
        "id": "p5l9hm",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Today we are analyzing the chipmaker's share, which sank -13% over the past week. How relevant is it to buy a company now and what are the prospects for the business? Let's watch. \n\n1) 🔥Multipliers:\nP / E: 19.21\nP / S: 3.11\nROА: 7.38%\nROE: 9.78%\n\n▫️Comment: Multipliers remain at acceptable levels and the stock is one of the cheapest in the entire sector. It is important to note the decline in business profitability in the last 2-3 years. In terms of EV/EBITDA, the company is the least overbought among all AMD $AMD, Nvidia $NVDA and Qualcomm $QCOM peers.\n\n2) 🔥Business structure and fundamentals:\n\n ▪️We look at financial indicators. Pure Growth stock. Revenues and profits over the past 10 years are impressive, but there is a turning point in 2017-2018, from there stagnation began. Earnings per share (EPS) is at an acceptable level of $3.68. Net profitability fell to 16.2% The company has a low debt burden: the debt/equity ratio is less than 20%. Net debt is negative, but unfortunately it won't last long! The company is now increasing capital expenditures. Also in America is actively being stimulated the semiconductor industry as one of the growth drivers of the entire economy, but there is still not enough capacity to meet demand. Micron's manufacturing inventories were down 8.9% quarter-on-quarter.\n\n ▪️Now there is an obvious shortage of semiconductors all over the world. Apple $AAPL, Volkswagen $VOW and others cannot increase production without additional components. The decision of Micron to sell one of the factories remains unclear. The deal was valued at $1.5 billion, of which only $900 million was in cash. Intel $INTC and Taiwan Semiconductor $TSM will build 2 plants over several years, expanding market share in the long term. According to Bloomberg forecasts, the chip market will grow by 7-8% yoy. More questions than answers...\n\n\n 3) 🔥 Company's report\n\n ▫️Let's go over specific numbers.  Micron's quarterly revenue rose by 38% to $7.42 billion from $5.44 billion. Revenue for 2021 increased by +27.3% to $19.431 billion against $15.38 billion a year earlier. Net income for the first 9 months of fiscal year 2021 was $3.141 billion, an increase of +82.6% over 2020.\n\n ▫️But the forecasts of the company are much more important. For the forthcoming 4th quarter, the company forecasts earnings per share (EPS) in the range of $2.2-2.4 and revenues of ~$8 billion. In the long term (next 4-5 years) EPS is expected to increase ~ +61% yoy.\n\n 🏆Conclusion by company:\n\nThe stock breaks through one by one support levels, the previous one was at around $76.5. The stock is currently trading at $70-71. The cheapest and most promising company in the sector with a huge queue of buyers. And Morgan Stanley $MS decides to revise its goals and forecasts for the company. This is how Wall Street inside information works.\nAlready on the horizon of several months, the company has excellent prospects, so I keep the shares in the portfolio! I would like to increase the share even if they give a little lower.\n\n🔥What to do if you\n1) ♟Speculator: not your paper!  For you, papers in an uptrend are more suitable. For example Qualcomm, Square $SQ or Nvidia $NVDA.\n2) ♟Medium-term investor: be sure to add the company to the watch list and take a closer look at it! As reports are released, there are many opportunities in the marketplace. \n3) ♟Long-term investor: You can put a notification at $60-65 and take a closer look at the stock on the market correction. For now, you should focus on increasing your cash position. I would like to buy Taiwan Semiconductor, but still wait for it below to enter.\n\nIf you like my analysis of $MU, press upvote!",
        "subreddit": "StockMarket",
        "title": "🧠Micron $MU analysis: bet on chips?",
        "url": "https://www.reddit.com/r/StockMarket/comments/p5l9hm/micron_mu_analysis_bet_on_chips/",
        "created": 1629165132.0
    },
    {
        "author": "comaye",
        "created_utc": 1629626873,
        "id": "p99x5w",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Micron is Disgustingly Undervalued",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p99x5w/micron_is_disgustingly_undervalued/",
        "created": 1629655673.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1629916295,
        "id": "pbh9xq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "https://www.marketwatch.com/story/western-digitals-stock-soars-after-wsj-report-of-talks-on-20-billion-merger-deal-with-japans-kioxia-2021-08-25?mod=mw_quote_news\n\nShares of Western Digital Corp. WDC, +10.50% soared 11.7% in afternoon trading Wednesday, to pace the S&amp;P 500's SPX, +0.30% gainers, after The Wall Street Journal reported that the data storage company was in merger talks with Japan-based Kioxia Holdings Corp., in a deal that could be valued at more than $20 billion. Citing people familiar with the matter, the WSJ report said the long-running talks have heated up in the past few weeks, with a deal possible as early as the middle of September. Western Digital would use stock to pay for the deal, and the combined company would likely be run by David Goeckeler, its chief executive, the WSJ report said. The stock has now gained 22.5% year to date, while the SPDR Technology Select Sector ETF XLK, -0.17% has rallied 21.0% and the S&amp;P 500 has advanced 19.8%.\n\nThis is definitely a positive news for WDC and MU. MU is been down after the earning report and the winter coming warning from Morgan Stanley. MU should be continue to benefit from the current chip shortage trend and the iphone 13 release by apple on September.",
        "subreddit": "stocks",
        "title": "Western Digital's stock soars after WSJ report of talks on $20+ billion merger deal with Japan's Kioxia",
        "url": "https://www.reddit.com/r/stocks/comments/pbh9xq/western_digitals_stock_soars_after_wsj_report_of/",
        "created": 1629945095.0
    },
    {
        "author": "JEJEJEJEJEJEJE888888",
        "created_utc": 1629483945,
        "id": "p8ayhy",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Buy $MU now! Great long term investment and super cheap, but right now being pinned under $70 with light volume. If buys come in it will explode up!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p8ayhy/buy_mu_now_great_long_term_investment_and_super/",
        "created": 1629512745.0
    },
    {
        "author": "lijijil",
        "created_utc": 1628717901,
        "id": "p2msch",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Price target for micron?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2msch/price_target_for_micron/",
        "created": 1628746701.0
    },
    {
        "author": "ErikaNYC007",
        "created_utc": 1629057117,
        "id": "p50f2v",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "What do you guys think about buying by Micron technology now?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p50f2v/what_do_you_guys_think_about_buying_by_micron/",
        "created": 1629085917.0
    },
    {
        "author": "RuggstoRiches",
        "created_utc": 1629138115,
        "id": "p5lv0p",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Micron",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p5lv0p/micron/",
        "created": 1629166915.0
    },
    {
        "author": "ErikaNYC007",
        "created_utc": 1628799267,
        "id": "p37uwa",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Micron tanked today. Thoughts on buying MU?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p37uwa/micron_tanked_today_thoughts_on_buying_mu/",
        "created": 1628828067.0
    },
    {
        "author": "lijijil",
        "created_utc": 1628717714,
        "id": "p2mq17",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Is micron going to $50?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2mq17/is_micron_going_to_50/",
        "created": 1628746514.0
    },
    {
        "author": "zimm522",
        "created_utc": 1628779665,
        "id": "p31c57",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Any thoughts on $MU?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p31c57/any_thoughts_on_mu/",
        "created": 1628808465.0
    },
    {
        "author": "AdLeading4503",
        "created_utc": 1630184370,
        "id": "pdhtrn",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Price Target For $MU in the next week?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdhtrn/price_target_for_mu_in_the_next_week/",
        "created": 1630213170.0
    },
    {
        "author": "LifeguardAltruistic9",
        "created_utc": 1628693928,
        "id": "p2eqly",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "MU 🚀🚀to 🌛?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2eqly/mu_to/",
        "created": 1628722728.0
    },
    {
        "author": "neckislife",
        "created_utc": 1630440095,
        "id": "pfdli8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "MU dip buy?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfdli8/mu_dip_buy/",
        "created": 1630468895.0
    },
    {
        "author": "ErikaNYC007",
        "created_utc": 1628798966,
        "id": "p37rb9",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Buy Micron? Thoughts?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p37rb9/buy_micron_thoughts/",
        "created": 1628827766.0
    },
    {
        "author": "GoodUnhappy",
        "created_utc": 1628805139,
        "id": "p39smx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Shorts destroyed MU and WDC..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p39smx/shorts_destroyed_mu_and_wdc/",
        "created": 1628833939.0
    },
    {
        "author": "AdLeading4503",
        "created_utc": 1630184657,
        "id": "pdhx5d",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on $MU? I think it’s oversold due to the MS Downgrade + Report. I think it should be rebounding to 77-79 next week. What y’all think?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdhx5d/thoughts_on_mu_i_think_its_oversold_due_to_the_ms/",
        "created": 1630213457.0
    },
    {
        "author": "AdLeading4503",
        "created_utc": 1630184917,
        "id": "pdhzxv",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Any thoughts on $MU (Micron Technology)? I think it has been oversold due to the MS downgrade + Report. I think it will be running to 77-79 by next week. It has a very low forward p/e and a average price target of $113. What do you think about it?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdhzxv/any_thoughts_on_mu_micron_technology_i_think_it/",
        "created": 1630213717.0
    },
    {
        "author": "mktscalper",
        "created_utc": 1628264540,
        "id": "oz97ic",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Micron (MU) will soon make its run to $100 just like AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oz97ic/micron_mu_will_soon_make_its_run_to_100_just_like/",
        "created": 1628293340.0
    },
    {
        "author": "theredpreacher",
        "created_utc": 1628871581,
        "id": "p3oee7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "What’s next for $MU? A huge correction?",
        "url": "https://www.reddit.com/r/investing/comments/p3oee7/whats_next_for_mu_a_huge_correction/",
        "created": 1628900381.0
    },
    {
        "author": "Magma_Rager",
        "created_utc": 1628813957,
        "id": "p3cetg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "It's time to buy the dip MU to the MUUUUN🚀🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/gallery/p3cetg",
        "created": 1628842757.0
    },
    {
        "author": "theredpreacher",
        "created_utc": 1628871726,
        "id": "p3ogf5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "smallstreetbets",
        "title": "What’s next for $MU? A huge correction?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/p3ogf5/whats_next_for_mu_a_huge_correction/",
        "created": 1628900526.0
    },
    {
        "author": "ErikaNYC007",
        "created_utc": 1628799348,
        "id": "p37vwj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Micron Falls on Memory Concerns Even as Some Analysts See Bottom",
        "url": "https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/micron-falls-memory-concerns-analysts-153903256.html",
        "created": 1628828148.0
    },
    {
        "author": "Pooh_Shmoo",
        "created_utc": 1629951285,
        "id": "pbrzmo",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Friday Aug , 20th  Went full retard and opened $2Mil+ YOLO put spread on Micron with expiration Aug 27th. If closes over $77 on Friday it will be my first $1MIl gain on single spread.\n\n\\#1 I closed 240 MU Aug27t $71 short put contracts for a total gain of $44K today ( the other leg is still open )\n\n\\#2 TTWO 20 contracts are there because I just like the stonk\n\n\\#3 My wife doesn't know I'm millionaire.\n\n\\#4 Looking for girlfriend to tell her that.\n\n\\#5 Fuck you too",
        "subreddit": "wallstreetbets",
        "title": "Micron ( MU ) $2Mil+ YOLO put spread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pbrzmo/micron_mu_2mil_yolo_put_spread/",
        "created": 1629980085.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1630025585,
        "id": "pccn95",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " Most great semi stocks are already priced in or overvalued, and we smart experienced apes know that you never buy overvalued stocks because its potential gain is small and its potential loss is too big.\n\nTherefore, we need to buy the stock that is undervalued but eventually goes up to meet its price target later because of its strong fundamentals and future growth (which is MU). And why do we need to pick semi stocks for this? Because Semiconductor business is one of the most potential and profitable business in the whole industry; we simply think that everything is turning to digital and AI systems, and all those devices, platforms, and servers need memory chips. Biden's infrastructure bills and his willingness to support semi industry are also tailwinds of semi stocks.\n\nOk, so why MU is the most undervalued stock among all semiconductors now?\n\nBecause it is ridiculously cheap! 7x forward price to earnings multiple now, and even though it actually have a slowdown in memory chip industry, it is still 10-12x forward earnings which is still ridiculously cheap compared to other semi stocks. (According to Quint Tatro, Joule Financial founder at CNBC).\n\nMU's 52 week high is 96.96, and its current price is 72.77. It showed some high volatility and corrections after its ATH because it went up too fast in short time (52 week low is 43.67). The last large correction made MU's price down from 83 to 68.80 which was 17% down in 4 days. This correction happened because of Morgan Stanley's report that says 'winter is coming' for semis. However, all other institutions and investors, including Goldman Sachs, Bofa, Jim Cramer, think that MU is way undervalued, and its price is at the bottom now. Vanguard Group, Sanders Capital, and State Street, top 5 MU shareholders, added MU positions between August 6 to August 16 . Since many institutions and large investors start to buy MU back, its price went up from 68 to 77, and then it dropped to 73 today due to the red market and some sell offs.\n\nReasons why this is a great timing to buy MU now\n\n1. The sentiment turned to bullish. It kept going up since it hit its bottom price 68, and yesterday, August 25th, it pumped from 73 to 77 in few minutes, closed at 74, and the current price is 72.77 now. Great buying point before it keeps pumping after this Jackson Hole meeting.\n2. Too CHEAP compared to ALL other semis. Here is the picture. \n\n[As you can see, MU is -23.64&amp;#37; from 52 week High on August 25, it has a more discount today since it dropped to 72.77. Ok, then we might doubt about its fundamentals and its future growth. Don't worry, here is why most analysts and institutions think MU is super undervalued and it is time to buy now.](https://preview.redd.it/ukiud4jlssj71.png?width=1522&amp;format=png&amp;auto=webp&amp;s=55d2fafe95240732779838488b931141d4da000f)\n\n[Its FY1 is 12.13 which is already great, but its FY2 and 3 is 6.36 and 6.34 which is too great compared to others. So, it is a great time to buy it before all those number soar later.](https://preview.redd.it/nvwzxklnssj71.png?width=1233&amp;format=png&amp;auto=webp&amp;s=54c8b095a81474a901030f03901d1bf9cfbe1791)\n\nTheir EPS and Revenue growth are also great too (beating all estimates for over 2 years).\n\nhttps://preview.redd.it/kqyog9xpssj71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=e9b57343b4c82f4737d38eebb958ca559997c3de\n\n3. Morgan Stanley, aka sneaky bitches, revealed a report 'winter is coming' or whatever, saying that DRAM memory chip price was already at the peak and it is going down now which will lead all DRAM company's profit to go down due to its historical data. However, most institutions and investors still believe that DRAM's demand is still too strong enough to cover that DRAM price drop, because all PCs, Servers, Laptops, smartphones, tablets, robots, cars, and anything that has automated computer system needs 'memory chip'. Semi industry has a bright future, and I think Morgan Stanley's report was just a manipulation in order to short the stock and buying it back at discounted price. This asshole bought SK hynix (2nd largest DRAM company) shares back after its correction in Korea. Its price was 120,000 Won before MS's report, and it dropped to 98,000 after its report and they started buying back from 100,000 now. ([https://finance.naver.com/item/main.nhn?code=000660#](https://finance.naver.com/item/main.nhn?code=000660#)). I still strongly believe that this stock will keep going up before tapering. (I hope the Fed does not mention about tapering at Jackson Hole).\n\n4. RSI number is important because we can know if the stock is overbought or not. The current market sentiment is unstable due to upcoming tapering, interest rates, inflation, national debts, infrastructure, etc. and most overbought stock have a high chance to meet its huge corrections later. Ok, so MU's current monthly RSI is 57. It is still in the middle which is a great number for tech growth stock. For example, Nvidia's monthly RSI is 86, AMD's monthly RSI is 85, AMAT is 75, TSM is 76, Qualcomm is 65, and ASML is 93. RSI does not explain everything, but it helps you to know that MU is pretty undervalued.\n\n5. Most great investors always say 'being simple is the best strategy'. I also believe that. Simply, we will make the money if we buy the GOOD stock in cheap way and sell it in expensive way. And simply, MU, a GOOD stock, is cheap now.\n\n6. Here is a better explanation about MU itself (my first MU DD) that shows why MU is a GOOD stock. [https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron\\_will\\_eventually\\_rally\\_5080\\_upside\\_potential/](https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron_will_eventually_rally_5080_upside_potential/)\n\nThere is a high chance that the Fed will not mention about tapering at Jackson Hole meeting because of Delta variant problems and slower than expected economy recovery. If they don't, tech stocks have a higher chance to get pumped for a while, and indeed, undervalued stocks have the highest chance to soar. So I personally strongly believe that few more tailwinds can drive MU price up to 20-30% before its next earnings (Sep 27), and 60-100% in 3-6 months depending on market sentiment.\n\nIts current price targets are: Yahoo avg 115.59, Seeking Alpha avg 111.76, Marketwatch avg 115.85,  \nTip Ranks: 112.64, Marketbeat: 112.07, CNN: 112.50. Total Average PT: 113.40.\n\nIt is simple, but actually not easy. Buy it now since it is turning to bullish, and sell the news before it actually tanks again. If the tapering is coming? Buy the PUTs or wait until the price became cheap again with healthy correction. And then we get in the ride again when it starts pumping again. I think that is how you can survive in this stupid unpredictable market. I sometimes use option straddle strategy during this unpredictable market because all you need to do is choosing high volatility stocks (I might use this strategy for MU later since it has a high volatility, and the current market is unpredictable).\n\nMy positions: 24 Sep 72c x 7 , 24 Sep 68c x 10, owning 100 shares.\n\nIndeed, this is just my DD, no financial advice.\n\nThank you guys.",
        "subreddit": "wallstreetbets",
        "title": "MU, the most undervalued semi stock, has 20-30% upside potential in a month, and has 60-100% upside potential in 3-6 months. (The sentiment has been changed to bullish this week, a GREAT TIME TO BUY).",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pccn95/mu_the_most_undervalued_semi_stock_has_2030/",
        "created": 1630054385.0
    },
    {
        "author": "capples3",
        "created_utc": 1628766387,
        "id": "p2xlcz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "MU is fresh off a downgrade from Morgan Stanley with a $75 pt. You buying puts here keeping in mind its down $10 in a week or are you buying looking for a rebound. I’m all in on a short term rebound",
        "subreddit": "wallstreetbets",
        "title": "Where does MU go from here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2xlcz/where_does_mu_go_from_here/",
        "created": 1628795187.0
    },
    {
        "author": "aguilepino",
        "created_utc": 1628120077,
        "id": "oy58jx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Micron Technology (MU) got a positive adjustment today, trading at $82.32 p/sh.\n\n🦧 My shitty conservative forecast stock price is $90 to $95 within the next weeks matching their 52 week high.\n\n🚨 Grab your calls right now!! Position yourself to secure the bagzzzz easily \n\n🤑 Micron just killed their ER and for the first time they declared a dividend. They has posted rising EPS growth in each of the last two reports. \n\n🚀 Revenue gains have also moved higher during the same period. Last quarter, its EPS shot up 129% to $1.88 on a 36% jump in revenue to $7.42 billion \n\n📈 For those with Benzinga Pro, go and check their financials (super strong numbers)!! \n\n😎 I’m into Sept 17 $92.50c",
        "subreddit": "wallstreetbets",
        "title": "$MU 💰Secure your next Bag 🤑",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oy58jx/mu_secure_your_next_bag/",
        "created": 1628148877.0
    },
    {
        "author": "FED365",
        "created_utc": 1629050301,
        "id": "p4ybwx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Micron Technology had 4 days of selling, culminating on Thursday with the announcement of Morgan Stanley downgrading the stock to equal-weight finishing the week just above 70$. Technically the price action for the past few weeks is a falling wedge and on Thursday the lower bound of the wedge was tested with a high amount of volume. I think it's time to buy into it. The stock has been battered badly but considering that the future for memory long term with Big data. Analysts are saying that the semiconductor industry's strong growth might be subsiding. I am definitely not buying into that and considering that Micron produces the best memory and its GDDR6X is used in RTX3080 and RTX3090 with RTX3080 offering the best performance to price ratio for Machine Learning in my opinion. I would be buying the 78$ calls that expire on 2021-09-24 with my line of thought that the price action for the past week was a long squeeze so that big institutional investors can buy for the long term.",
        "subreddit": "wallstreetbets",
        "title": "Micron Technology (MU)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4ybwx/micron_technology_mu/",
        "created": 1629079101.0
    },
    {
        "author": "AdLeading4503",
        "created_utc": 1630184510,
        "id": "pdhvgp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey everyone, what are your thoughts on $Micron Technology? I think it’s oversold due to the FUDS and the MS downgrade + Report. I think next week my pt will be around 77-79? What y’all think?",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on $MU?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdhvgp/thoughts_on_mu/",
        "created": 1630213310.0
    },
    {
        "author": "Pooh_Shmoo",
        "created_utc": 1629951449,
        "id": "pbs15s",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nhttps://preview.redd.it/jpo5x2nsomj71.jpg?width=1632&amp;format=pjpg&amp;auto=webp&amp;s=baf0aaf19d477efb5526ec27fa394e09c874d60b\n\nFriday Aug , 20th went full retard and opened $2Mil+ YOLO put spread on Micron with expiration Aug 27th. If closes over $77 on Friday it will be my first $1MIl gain on single spread.\n\n\\#1 I closed 240 MU Aug27t $71 short put contracts for a total gain of $44K today ( the other leg is still open )\n\n\\#2 TTWO 20 contracts are there because I just like the stonk\n\n\\#3 My wife doesn't know I'm millionaire.\n\n\\#4 Looking for girlfriend to tell her that.\n\n\\#5 Fuck you too",
        "subreddit": "wallstreetbets",
        "title": "Micron (MU) $2Mil+ YOLO spread",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pbs15s/micron_mu_2mil_yolo_spread/",
        "created": 1629980249.0
    },
    {
        "author": "korea_oldtrader1994",
        "created_utc": 1628776956,
        "id": "p30gij",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I am a Korean investor. The KOSPI recently hit an all-time high, resulting in a bubble in many stocks\nIn particular, in the Korean stock market, the speed of information dissemination is very fast and the characteristic hasty nature makes the range of stock price fluctuations very large\nIn particular, Micron and SK Hynix have peaked in the meantime, and the recent decline is very large.\nHow do you usually rate these companies? I'm Korean, so I can only get information about Koreans, so I'm asking here.",
        "subreddit": "stocks",
        "title": "What do you think of this stock?",
        "url": "https://www.reddit.com/r/stocks/comments/p30gij/what_do_you_think_of_this_stock/",
        "created": 1628805756.0
    },
    {
        "author": "robin_rocket",
        "created_utc": 1629136650,
        "id": "p5ld4n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "🧠Micron $MU analysis: bet on chips?",
        "url": "https://www.reddit.com/r/stocks/comments/p5ld4n/micron_mu_analysis_bet_on_chips/",
        "created": 1629165450.0
    },
    {
        "author": "Magma_Rager",
        "created_utc": 1628813525,
        "id": "p3cakw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "It's time to buy the dip MU to the MUUUUUUN🚀🚀🚀🚀🚀🚀",
        "url": "https://i.redd.it/p68rmvpcp0h71.jpg",
        "created": 1628842325.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1627823286,
        "id": "ovrt1v",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Some of you may know me from my educational and due diligence posts at r/DoctorStock. I've been covering Intel for weeks now, these are my compiled findings. Before we get started, I've added a section on Moore's Law and Government Intervention. These are critical to understanding the semiconductor market as a whole. So don't skip them. Let's begin.\n\n**Introduction**\n\n\tHow did Intel's co-founder predict the semiconductor chip shortage of 2020-21? Intel has been making some big moves these past few months. CEO Patrick Gelsinger is doing everything from building infrastructure and acquiring companies to signing contracts and securing partnerships. Intel is on track to stay ahead of the competition.  \n\n**Moore's Law**\n\nMoore's Law states three things:\n\n* The number of transistors on a microchip doubles every two years\n* Research and development increase the speed and capability of technology\n* The growth of microprocessors is exponential. \n\nWho created Moore's Law? Gordon E. Moore, co-founder of Intel... Learn more about Moore's Law \\[here.\\](https://www.investopedia.com/terms/m/mooreslaw.asp)\n\n**Government Intervention Timeline**\n\n*March 31, 2021* \\[Source\\](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/)\n\n* White House proposes a $50B subsidy plan for research and development to strengthen the U.S supply chain under the CHIPS Act.\n   * The CHIPS Act *(June 11, 2020)* offers a tax income credit for semiconductor equipment and manufacturing.\n\n*April 12, 2021* \\[Source 1\\](https://www.youtube.com/watch?v=sWAa10ljxLA) \\[Source 2\\](\\[Source\\](https://www.ttnews.com/articles/biden-reassures-chip-summit-bipartisan-support-new-funds)\n\n* Biden joins the Virtual CEO Summit on \"Semiconductor Supply Chain Resilience.\"\n* Biden states that this plan is a \"once-in-a-generation investment in America's future.\"\n* CEOs who attended the meeting include General Motors CEO Mary Barra, Ford Motor CEO James D. Farley, and Alphabet and Google CEO Sundar Pichai.\n* Companies invited to join the call were Dell, Intel, Medtronic Plc, Northrop Grumman, HP, Micron Technology Inc., Taiwan Semiconductor Manufacturing Co., AT&amp;T, and Samsung.\n\n*TL;DR-* The semiconductor chip shortage has emphasized securing U.S global chip supply. The White House has laid out a $50B subsidy plan to help boost research and development in the semiconductor industry. The White House met with top CEOs from around the globe who seek a piece of the pie. \n\n**Intel Major News Timeline**\n\n*March 9, 2021* \\[Source\\](https://itpeernetwork.intel.com/ibm-hybrid-cloud/)\n\n* Intel partners with IBM\n\n*March 23, 2021* \\[Source\\](https://www.reuters.com/world/asia-pacific/intel-doubles-down-chip-manufacturing-plans-20-billion-new-arizona-sites-2021-03-23/)\n\n* Intel plans to spend $20B in development in Arizona\n\n*April 12, 2021*\n\n* Intel is in talks with Ford (F) and General Motors (GM) \n\n*May 2, 2021* \\[Source\\]*(*https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Intel plans to spend $3.5B on development in New Mexico\n* Intel plans to spend $10B on development in Israel \n\n*June 22, 2021* \\[Source\\](https://www.reuters.com/technology/sifive-aims-challenge-arm-with-new-tech-pairs-with-intel-effort-2021-06-22/)\n\n* Intel in talks to buy SiFive\n\n*July 15, 2021* \\[Source\\](https://www.wsj.com/articles/intel-is-in-talks-to-buy-globalfoundries-for-about-30-billion-11626387704)\n\n* Intel in talks to buy GlobalFoundries\n\n*July 28, 2021* \\[Source\\]*(*https://finance.yahoo.com/news/intel-ceo-we-have-100-companies-that-want-us-to-make-their-chips-120023723.html)\n\n* Intel secures Qualcomm contract\n* Intel partners with Amazon\n\n**General Motors Contract**\n\n*May 6, 2021* \\[Source\\](https://gmauthority.com/blog/2021/05/general-motors-is-stockpiling-unfinished-vehicles-due-to-microchip-shortage/)\n\n1. General Motors has a stockpile of tens of thousands of unfinished vehicles without semiconductor chips\n2. The unfinished vehicles are stored in Mexico, Texas, Missouri, Indiana, and Illinois\n\n**Ford Contract**\n\n*July 16, 2021* \\[Source\\](https://www.caranddriver.com/news/a37050732/ford-dealerships-chip-supply-shortage/)\n\n1. Ford also has a huge stockpile of unfinished cars that lack semiconductor chips\n2. Ford is running low on storage space\n3. Ford plans to ship unfinished vehicles to Dealerships\n4. Ford will pay for the training and labor costs at dealerships\n\n**Key Financial Metrics (Current)**\n\n* Market Cap (MKT Cap)- 215B\n* EPS (Dilution)- $4.50\n* Return on Equity (ROE)- 23.15\n* Return on Assets (ROA)- 12.30\n* Return on Investment (ROI)- 16.29\n* Dividend Yield- 2.59%\n\n**Financial Statement Highlights (Current)**\n\n* *Total Revenue (TR)-* 77.7B\n* *EBITDA Margin- 32*.06%\n* Gross Margin- 55.6%\n* Price to Earnings Ratio (PE)- 11.93\n* Price to Sales Ratio (PS)- 2.84\n* Price to Book Ratio (PB)- 2.56\n\n**Balance Sheet Highlights (Current)**\n\n* Total Liabilities- 69.39B\n* Long Term Debt (LTD)- 31.71B\n* Debt to Equity Ratio (DE)- 0.37\n\n**Competitors**\n\n* Taiwan Semiconductor Manufacturer (TSM)\n* Samsung\n* Advanced Micro Devices (AMD) Fabless\n* Nvidia (NVDA) Fabless\n\n\\*Fabless means they don't produce their semiconductor chips\n\n**Taiwan Semiconductor Manufacturing (TSM)**\n\n*May 2, 2021* \\[Source\\](https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Taiwan Semiconductor Manufacturing (TSM) plans to spend $100B on-chip research and manufacturing\n* TSM plans to build a new factory in Arizona\n\n*May 31, 2021* \\[Source\\](https://fortune.com/2021/05/31/amd-tesla-contract-chips-infotainment-system-lisa-su/)\n\n* AMD partners with Tesla\n\n**Samsung**\n\nFebruary 10, 2021 \\[Source\\]https://www.anandtech.com/show/16483/samsung-in-the-usa-a-17-billion-usd-fab-by-late-2023)\n\n* Samsung to invest $17B in development in the U.S\n* Potential sites include Texas, Arizona, and New York\n* Samsung has since lost key U.S customers like IBM and Qualcomm to Intel and Nvidia and Tesla to TSM.\n\nMay 13, 2021 \\[Source\\](https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo)\n\n* Samsung to invest $101B in research and development in the semiconductor market\n\n**Bullish Case:**\n\n* Strong demand for semiconductor chips\n* U.S $50B semiconductor industry subsidy plan\n* Intel's Recent acquisitions, partnerships, and contracts\n\n**Bearish Case:**\n\n* Asia is the current \"epicenter\" of global chip production\n* The U.S is playing catch up\n* Competition from TSM and Samsung\n\n**Conclusion**\n\n\t CEO Patrick Gelsinger has been making some big moves these past couple of months. Intel is securing its foothold in the semiconductor industry by building infrastructure, acquiring companies, and signing contracts. \n\n\tIntel wants to increase chip output and drive down its average costs to stay ahead of the competition. Intel is expanding into the automotive, consumer electronics, and foundries industry. Intel faces stiff competition from Taiwan Semiconductor Manufacturing (TSM) and Samsung. All three companies have announced plans to increase research development by 2023-24.\n\n\tMoore's Law is key to understanding how the chip shortage occurred and how to prevent it from happening again. Intel, TSM, and Samsung have all announced multibillion-dollar research and development plans in the U.S. The market for semiconductor chips is increasing exponentially.\n\n\tThe U.S has been falling behind countries like Asia in the global semiconductor market. The U.S aims to secure global chip supply through its U.S $50B subsidy plan. The subsidy plan will boost the research and development of semiconductors in the U.S. Companies like Intel, TSM, and Samsung are now chomping at the bits.\n\n\tThe global market for semiconductors is growing exponentially. The recent semiconductor chip shortage is proof of Moore's law. The U.S plans to expand into the global market through a $50B subsidy plan to attract research development to the U.S. Chips are as essential to our everyday lives as water. You control the chips, you control the future.\n\n*\\*\\*This is not investment advice. I am not an expert. Do your research.\\*\\**",
        "subreddit": "investing_discussion",
        "title": "Intel Due Diligence (INTC)",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ovrt1v/intel_due_diligence_intc/",
        "created": 1627852086.0
    },
    {
        "author": "abrahamlincoln20",
        "created_utc": 1628852792,
        "id": "p3l7ew",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Favorite stock picks for the long hold: MU, T, OGZPY, GORO, SPOT",
        "url": "https://www.reddit.com/r/stocks/comments/p3l7ew/favorite_stock_picks_for_the_long_hold_mu_t_ogzpy/",
        "created": 1628881592.0
    },
    {
        "author": "briefds",
        "created_utc": 1628698808,
        "id": "p2gda0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL;DR**: Semiconductor, cryptocurrency, and interest rates are the central theme\n\nFor 15 day ahead forecast horizon, the top drivers are\n\n1. Intel INTC\n2. Litecoin LTCUSD\n3. [12-Month LIBOR on Swiss franc CHF](https://www.global-rates.com/en/interest-rates/libor/swiss-franc/chf-libor-interest-rate-12-months.aspx)\n4. [US 10-Year Real Interest](https://fred.stlouisfed.org/series/DFII10) (from TIPS bonds[^(1)](https://tsterm.substack.com/p/top-driving-factors-as-of-2021-08-2f2?justPublished=true#footnote-1))\n5. [Balance on Capital Account](https://fred.stlouisfed.org/series/IEABCPN)[^(2)](https://tsterm.substack.com/p/top-driving-factors-as-of-2021-08-2f2?justPublished=true#footnote-2) (of United States)\n\nCollectively, they are most predictive of\n\n1. Micron Technology, Inc. MU\n2. Advanced Micro Devices, Inc. AMD\n3. iShares MSCI Emerging Markets ETF EEM\n4. [10-Year Government Bond Yield for India](https://fred.stlouisfed.org/series/INDIRLTLT01STM)\n5. iShares MSCI China ETF MCHI\n6. Invesco Nasdaq-100 ETF QQQ\n7. Occidental Petroleum OXY\n8. The Coca-Cola Company KO\n9. iShares MSCI United Kingdom ETF EWU\n10. [3-Month Treasury Bill rate](https://fred.stlouisfed.org/series/DTB3)\n\nIt is the first time a cryptocurrency appears as a top driving factor. If one searches for Litecoin on [Time Series Terminal](https://tsterm.com/) one could see its No. 1 predictor (aka driver) at 1 day ahead horizon is the 3-Month Treasury Bill rate: given all the results, one could picture in the mind that, on Day 0, Litecoin is predictive of the 3-Month Treasury Bill rate on Day 15, which in turn is predictive of Litecoin on Day 16 — they act upon each other, according to what the computation finds.\n\n[1](https://tsterm.substack.com/p/top-driving-factors-as-of-2021-08-2f2?justPublished=true#footnote-anchor-1)\n\nTreasury Inflation-Protected Securities (TIPS): [https://www.investopedia.com/terms/t/tips.asp](https://www.investopedia.com/terms/t/tips.asp)\n\n[2](https://tsterm.substack.com/p/top-driving-factors-as-of-2021-08-2f2?justPublished=true#footnote-anchor-2)\n\nCapital Account: [https://en.m.wikipedia.org/wiki/Capital\\_account](https://en.m.wikipedia.org/wiki/Capital_account)",
        "subreddit": "StockMarket",
        "title": "Top Driving Factors as of 2021-08-09",
        "url": "https://www.reddit.com/r/StockMarket/comments/p2gda0/top_driving_factors_as_of_20210809/",
        "created": 1628727608.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628802871,
        "id": "p391zw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, August 12, 2021**\n\nStocks largely finished higher, with all three major indexes managing to close out the day in the green. The S&amp;P 500 (SPY) and Dow Jones (DIA) once again recorded fresh intraday highs.  The Nasdaq (QQQ) broke two consecutive red days and finished higher today. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed relative to the major indexes, closing the day 0.26% down. It seems a pattern has emerged in the last week or so, in which the market pulls back early in the morning before reversing to the upside. Market participants continue to weigh new economic data and corporate earnings with concerns around the coronavirus Delta variant and potential inflationary pressures. \n\nYesterday, The Labor Department reported Wednesday that its consumer price index (CPI) rose 5.4% in July from a year earlier, in line with June’s figure and matching the largest jump since August 2008. The government said CPI increased 0.5% on a month-over-month basis, matching a consensus forecast from economists surveyed by Dow Jones.\n\nCore CPI which excludes energy and food, rose by 0.3% last month, shy of a forecasted 0.4% increase and well below June’s rise of 0.9%. The core figure is up 4.3% over the last year, a slight deceleration from June’s 4.5%. Economists often consider core CPI to be a more reliable indicator since it’s insulated from the frequent swings in petroleum and food prices. It’s encouraging to see prices slowly moderate as the economic recovery continues to mature and pent-up consumer demand is increasingly released. \n\nThe US Senate gave surprisingly bipartisan approval to a $1 trillion infrastructure bill. The bill appropriates money to rebuild the nation’s roads and bridges, fund climate initiatives, and bolster the nation’s broadband infrastrucutre. The vote, 69-30, was uncommonly bipartisan given the seeming contention the Republicans had for the initial drafts of the infrastructure bill. President Biden said, “This historic investment in infrastructure is what I believe you, the American people, want, what you’ve been asking for for a long, long time.” Mitch McConnell, who earlier in the year publicly declared “100% of my focus is on stopping this new administration” said of the deal, “I was proud to support today’s historic  bipartisan infrastructure and prove that both sides of the political aisle can still come together around common-sense solutions.” The bill appropriates money to rebuild the nation’s roads and bridges, bolster public transportation, fund climate initiatives, and bolster the nation’s broadband and 5G infrastrucutre. Here is a full list of what is included: [https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/](https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/)\n\n**Highlights**\n\n* A slew of corporate earnings continues, with notable names like ContextLogic (WISH), SoFi Technologies (SOFI), Disney (DIS), Rocket Mortgage (RKT) and Airbnb (ABNB) reporting\n   * WISH and SOFI both plummeted after earnings\n* Shares of Micron Technology (MU) continued its steep pullback, falling more than 7% today after analysts at Morgan Stanley downgraded the stock citing fears of deceleration in DRAM sales. Worse day in the stock since March 2020\n* Financial stocks continued their rally as the benchmark 10-year Treasury yield continues its rebound from six month lows. \n* Producer prices rose 1.0% month-on-month in July, the Labor Department reported Thursday. This matched June's monthly rise, and came in ahead of the 0.6% rise expected. \n* U.K. antitrust officials said they could call on Facebook Inc. to unwind its acquisition of Giphy, a provider of popular animated images, after provisionally finding that the deal would harm competition between social-media platforms and in the display advertising market.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices**\n* Chipotle (CMG) target raised by Piper Sandler from $2100 to $2235 at Overweight. Stock currently around $1875\n* Deckers Outdoor (DECK) target raised by the UBS Group from $470 to $540 at Buy. Stock currently around $430\n* Nvidia (NVDA) with three target raises. Stock currently around $198\n   * UBS Group from $184 to $230 at Buy\n   * Wells Fargo from $219 to $245 at Overweight\n   * Evercore ISI from $187.5 v $250 at Outperform\n* Maravai Lifesciences (MRVI) target raised by Morgan Stanley from $54 to $62 at Overweight. Stock currently around $55\n* Synopsys (SNPS) target raised by Wells Fargo from $310 to $325 at Overweight. Stock currently around $292\n\n“To Bear Trials with a Calm Mind Robs Misfortune of its strength and burden.” — Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, August 12, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/p391zw/here_is_a_market_recap_for_today_thursday_august/",
        "created": 1628831671.0
    },
    {
        "author": "hivincentc",
        "created_utc": 1630329030,
        "id": "pehs09",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey everyone! I've been sharing my morning briefs for a few weeks now and thought you would find them helpful here too.\n\nA little background: I post quick briefs every morning that can be digested in 1 to 2 minutes. They're essentially highlights of the most important market/economic news that you should know for that day.\n\nIf you have any suggestions or feedback, I'm all ears! Let me know how I can improve the briefs for you.\n\n&amp;#x200B;\n\n**📰 Top News**\n\n* S&amp;P 500 Futures are +.09%; Dow Futures are +.05%; NASDAQ Futures are +.10%\n* **US stock futures are slowly moving higher after the S&amp;P 500 and NASDAQ closed at record highs on Friday**. This comes after Jerome Powell said monetary tapering could start in 2021 depending on the labor market but emphasized increasing rates would come later. *Note: Eyes are on this Friday's unemployment report to see if the labor market recovered enough to start tapering efforts*\n* **China's crackdown on tech companies is causing investors to look for opportunities in other parts of Asia** (e.g. India and South Korea). *Note: Tech companies from these regions raised $8B in share sales which is much higher than previous annual numbers*\n* **The Delta variant continues to impact recovery efforts across the world**: Australia reported new daily infection records; New Zealand extended lockdown orders; Southern states in the US are running low on oxygen; The EU is expected to recommend reinstating travel restrictions and stop nonessential travel from the US\n\n**🎯 Price Target Updates**\n\n* Barclays raised Affirm Holdings, Inc. (NASDAQ: AFRM) price target from $85 to $115\n* RBC Capital raised the price target for CrowdStrike Holdings, Inc. (NASDAQ: CRWD) from $259 to $300\n* Wolfe Research lifted Workday, Inc. (NASDAQ: WDAY) price target from $270 to $300\n* Deutsche Bank cut the price target on Micron Technology, Inc. (NASDAQ: MU) from $110 to $95\n\n**📻 In Other News**\n\n* New Orleans and the Louisana coast were hit by Hurricane Ida overnight leading to power outages and floods\n* **Rivian filed for IPO and aiming to go public around Thanksgiving**. *Note: Rivian is looking for an $80B valuation - compare this to a $27.6B valuation when it raised funds earlier in the year*",
        "subreddit": "StockMarket",
        "title": "Here's Your Daily Market Brief For August 30th",
        "url": "https://www.reddit.com/r/StockMarket/comments/pehs09/heres_your_daily_market_brief_for_august_30th/",
        "created": 1630357830.0
    }
]