[
    {
        "author": "mat_raymond",
        "created_utc": 1620241564,
        "id": "n5nszk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Drone Delivery Canada – FLT.V (DD)\n\n**tldr;** Drone Delivery Canada isn’t here to replace postal workers in the next 10 years but has many use cases and a lot of revenue potential. It is currently an unprofitable growth stock that seems very promising. At $1.33 (CAD) this is a buy and I have a price target of $6.87 5 years out based on a 10 price to sales ratio.\n\n&amp;#x200B;\n\n*All numbers are in Canadian Dollars unless mentioned otherwise*\n\n**Basic Stats: - (as of May 4, 2021)**\n\nPrice: $1.33\n\nMarket Cap: 279.38M\n\nEPS: -0.08\n\nFloat: 209.61M\n\n&amp;#x200B;\n\n**Description**\n\nDrone Delivery Canada (DDC) provides a drone delivery platform targeted towards various corporations including retailers, service organizations and government agencies and are capable of transporting up to 180kg over 200kms. They have a patented hardware/software platform. DDC has been developing its drone delivery technology since 2014. They are currently trading on the TSX.V Exchange under the symbol FLT, on the U.S. OTC Q B market with Nasdaq International Designation under the symbol TAKOF. As a venture company that is not profitable it is a risky investment but there are many upsides to investing in this innovative technology.\n\n&amp;#x200B;\n\n**Financials**\n\nThe company has reported assets worth $29M and $2.27M worth of liabilities so there is currently little worry of insolvency. With $23.4M in cash and yearly operating expenses of $14.5M, assuming no change, the company can operate with no financing for 1.6 years. This isn’t much of a worry due to increasing revenue and ease of financing.\n\n2020 revenue was $265k and their total operating expenditure was $14.5M totaling a loss of $0.08 per share in 2020. Operating expense dropped in 2020, some key differences is an increase in advertising and marketing spend, a reduction in consulting expenditure, and an increase in personnel expenses. Research and development expenditure was almost the same which is good to see as they are still investing heavily in their technology.\n\nAnalyst estimate 2021 revenue of $6.59M which is over 2000% increase. While it is also expected for operating expenses to increase it’s good to see extreme revenue growth to match their high valuation of 271M. The current price/sales ratio is 1,021, assuming the same stock price and sales of $6.59M the price/sales ratio decreases to 41 which is much more reasonable, though realistically share price will increase this year. But even at twice the share price the price/sales ratio is 82 (which is still very high but much more reasonable than current, goes to show markets value future earnings). 2021 estimated EPS is -0.05 and profitability is expected in 2022.\n\nThe last thing to point out in DDC’s financial statements in they continue to invest heavily in patents. $140k in spent on patenting and trademarks in 2020 and $221k in 2019. With patents worth $750k as of December 31, 2020.\n\n&amp;#x200B;\n\n**Ownership and Leadership**\n\n0.2% of shares are held by private companies, 0.48% by individual insiders, 7.08% by institutions and the rest by the general public. The low insider holding is often seen as a bearish factor, but the low institutional holding can hold potential upside as once the stock is up listed, we can see large purchases as companies start adding shares to funds.\n\nLeadership:\n\nThe CEO Michael Zahra has been the President of Staples Business Advantage (B2B supplies), the president of Yahoo, and has been on the board of directors for Oak Ridges Moraine Land Trust and on the board of governors for North York General Hospital. So, while this is a start-up, they have a veteran leader. They have a strong lineup of C-Suite executives with experienced CFO and CTO. On top of this their board of advisors include the VP of Cargo at Air Canada, and a medical director for Sunnybrook Centre for Prehospital Medicine which is an important strategic piece. The downside of their leadership is they have very high salaries for a company not making any profit.\n\n&amp;#x200B;\n\n**Current Factors**\n\nThese are 3 current small factors that are worth mentioning\n\nPartnership with DSV:\n\nDDC entered in an agreement with DSV through its sales agent Air Canada that provides its drone delivery platform back in October 2019. The program became operational in March which was big for DDC as it is their first source of revenue. In which customers pay DDC a monthly fee for each drone route deployed. DSV provides and manages supply chain solutions for thousands of corporations. Which is a perfect partner for DDC. The initial agreement is for 15 months, with additional 1-year terms following the success of the first agreement.\n\nPartnership with Edmonton Airport:\n\nThis partnership creates the world’s first airport drone delivery hub at Edmonton Airport using DDC’s platform. DDC and Edmonton airport will implement promote and market DDC’s delivery services. The agreement is for 5 years initially with the possibility of an extension unless the agreement is terminated\n\nPatents:\n\nDDC currently holds two US patents, one for its “FLYTE management” and one that covers aspects of its drone delivery technology and processes relating to controlled access zones for UAV landing and takeoff\n\n&amp;#x200B;\n\n**Future Use Cases and Catalysts**\n\nMedical Response:\n\nIn 2019 researchers tested the speed of drones vs the speed of ambulances to respond to a 911 call. The drone carried an AED to the location which was approx. 8km away. The drone was allowed to fly at speeds of 80km/hr and arrived at the scene an average of three to four minutes before the ambulance. Those few minutes could make a life or death difference in a cardiac arrest patient’s outcome. This is why having the medical director for Sunnybrook Centre for Prehospital Medicine on the board of advisors could be a key to implementing their services to the medical field in the future.\n\nUS Expansion:\n\nDDC has expressed their intention to expand to the United States in the past, which is in line with them filing US patents. Expanding into the US will open tons of new opportunities for them but will also be a large challenge.\n\nPotential to move to TSX:\n\nMoving up from the venture exchange to the TSX can pose many benefits. A big one that we care about is increase in share price. “An observation of 34 companies that graduated between October 14, 2005 and August 10, 2006, found that almost sixty per cent of the companies had an average share price over the thirty trading days post-graduation that was higher than the thirty trading days preceding graduation. On average, the share price of all 34 issuers went up over three per cent in that time frame, with four companies showing an increase of over 25 per cent”.\n\nSource: [https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx](https://www.mondaq.com/canada/charges-mortgages-indemnities/44708/movin-on-up-the-costs-and-benefits-of-graduating-to-the-tsx)\n\n&amp;#x200B;\n\n**Market Size**\n\nIn Ark Invest’s *BIG IDEAS 2021* report they talked about the delivery drone market. They predict that drone delivery platforms will generate nearly USD50 billion in revenues, USD14 billion in hardware sales, and USD3 billion in mapping revenues by 2025. And by 2030 drone delivery platforms will generate nearly USD275 billion in revenues, USD50 billion in hardware sales, and USD12 billion in mapping revenues.\n\nFor a total market cap of $67B USD by 2025 and $337B USD by 2030.\n\n&amp;#x200B;\n\n**Air Canada Cargo Partnership**\n\nIn Canada, 150K routes have been identified with their partner Air Canada Cargo. DDC’s revenue per route is $10,000/month. They are not even close to operating 150K routes so let’s start with 100 routes and build up.\n\n|**Routes**|**Revenue/month**|**Yearly Revenue**|\n|:-|:-|:-|\n|100|$1M|$12M|\n|1,000|$12M|$144M|\n|10,000|$120M|$1.44B|\n|25,000|$250M|$3B|\n|150,000|$1.5B|$18B|\n\n&amp;#x200B;\n\n**Valuation**\n\nNow let’s take that estimated yearly revenue and calculate share price based off price/sales ratio (assuming a 10x p/s which is a lot lower than current p/s).\n\n|**Yearly Revenue**|**Market Cap**|**Share Price**|\n|:-|:-|:-|\n|$12M| 120M|$0.57|\n|$144M|1.44B|$6.87|\n|$1.44B|$7.2B\\*|$34.35|\n|$3B|$15B\\*|$71.56|\n|$18B|36B\\*\\*|$171.74|\n\n^(\\*reduced P/S ratio to 5)\n\n^(\\*\\*reduced P/S ratio to 2)\n\nIt’s important to note that the bottom 3 numbers are highly unrealistic in the next 5-10 years and require perfect execution and market factors to reach that point even past 10 years. A more realistic target would be a share price of $6.87 5 years out (furthest out analyst prediction is $116.8M of revenue 4 years from now). This is assuming a 10x p/s which aligns for an emerging technology company. A 5 year prediction of 120M in revenue is also falls in line with the previously mentioned $67B drone delivery market size by 2025 predicted by Ark Invest.\n\nA $6.87 price estimate 5 years out at present value, assuming an 8% return found in index funds, equals $4.61.\n\n&amp;#x200B;\n\n**Bear Case(s)**\n\nCurrently DDC is fitted for serving remote areas as there is a lot of regulation surrounding flying drones in urban areas. It’s also unrealistic to have dozens of drones flying around a city anywhere in the near future We need to see a shift in regulation for this to really take off. Big players such as Amazon and FedEx have been investing in delivery drone technology for years and most likely have very developed technology and infrastructure too. This does leave potential for a buyout if a company is trying to catch up to its competitors who have been investing in drone delivery. While financing will be relatively simple for this company this poses the risk of share dilution as they continue to spend money on research, patents, and other the expenses the company will need to sell more shares for cash flow.Lastly, their technology currently only allows delivery on predetermined routes that are from point A to point B and require a launch and landing pad so more technological development needs to happen.\n\n&amp;#x200B;\n\nThis technology isn’t here to replace postal workers in the next 10 years but has a lot of different use cases now and will have more in the future.\n\n&amp;#x200B;\n\nIf you've read this far let me know what you think of the stock and would love some feedback on my DD (also let me know if the formatting needs changing). Thanks!",
        "subreddit": "stocks",
        "title": "Drone Delivery Canada – FLT.V (DD)",
        "url": "https://www.reddit.com/r/stocks/comments/n5nszk/drone_delivery_canada_fltv_dd/",
        "created": 1620270364.0
    }
]