[
    {
        "author": "Robert-De_Niro",
        "created_utc": 1627425773,
        "id": "osx2e7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "$HPIL is under new management and has alot of projects underway.  Potential partnership with Ansys for automated driving AI, and much more.",
        "subreddit": "wallstreetbets",
        "title": "Look into this upcoming catalysts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/osx2e7/look_into_this_upcoming_catalysts/",
        "created": 1627454573.0
    },
    {
        "author": "Robert-De_Niro",
        "created_utc": 1627425934,
        "id": "osx45n",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "$HPIL is under new management and has alot of projects in the works.  Including a potential partnership with Ansys for automated driving AI and much more. Do some research and look into them beginning of August should be very good.",
        "subreddit": "wallstreetbets",
        "title": "Look I to this upcoming catalysts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/osx45n/look_i_to_this_upcoming_catalysts/",
        "created": 1627454734.0
    },
    {
        "author": "Robert-De_Niro",
        "created_utc": 1627425773,
        "id": "osx2e7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "$HPIL is under new management and has alot of projects underway.  Potential partnership with Ansys for automated driving AI, and much more.",
        "subreddit": "wallstreetbets",
        "title": "Look into this upcoming catalysts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/osx2e7/look_into_this_upcoming_catalysts/",
        "created": 1627454573.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1625970134,
        "id": "ohvzti",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "I've collected 150 stocks, I know it's too many, so I would appreciate some help disqualifying the obvious mistakes. Most of these are either tech stocks, especially cloud, or on some list, like Dividend Kings, or Aristocrats. My goal is to have the absolute best growth stocks, then also growth stocks that also pay increasing dividends, a combination approach, plus a few spec on the side. I have a medium-high risk tolerance and 15 year + Horizon. \n\n* I will keep APL ADBE BABA BIDU COST HD HON INTC KO MA MSFT NVDA O PEP PYPL T TCEHY TGT TXN UNH V \n\n* but I am less certain on others like ABB ABM ACN ADP AMAT APPH APPN ARCC ASML AVGO BAC BLK CMCSA COIN CRM CRWD CSCO DD DDOG DOCU DPZ DUK ENPH ETSY FDX FSLY GILT HVBT IRDM ISRG JMIA JPM LOGI LRCX LSCC MELI MP MRVL MU NEE NET NIO NOW ORA ORCL PAYX PG PLUG PNR PSA QCOM RNG ROKU ROP SE SEDG SNOW SPCE SPLK SQ SWKS TDOC TTD TTWO UPS VSAT WELL XEL ZEN ZG ZM ZS \n\n* and others on those dividend lists such as: ADI AIZ AMT ANTM APD ATO ATR AWK AWR BANF BMI BRO CAT CB CBU CFR CHD CINF CL CLX CME CMI CSL CSX CTBI DCI DOV EMR ESS EXPD FAST FELE GPC HTD ITW JKHY LANC LECO LIN MCHP MCO MGRC NDSN NUE PH RPM SPGI TROW UNP WEC WM",
        "subreddit": "stocks",
        "title": "Way too many stocks to choose from...",
        "url": "https://www.reddit.com/r/stocks/comments/ohvzti/way_too_many_stocks_to_choose_from/",
        "created": 1625998934.0
    },
    {
        "author": "Someshun",
        "created_utc": 1626402264,
        "id": "ol7jkj",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "I watch the level 2 daily as well as dark pool and can see the accumulation on the buy side. It's also had recent PT upgrades and press keeps coming up . The s20 has finally caught up with and overtaken the s50, thats a bullish sign for any beaten down stock. \n\n&amp;#x200B;\n\nDon't get faked out by the bear traps liek this week - it was always gonna happen on OpEX week combined with a huge move in big caps tech over the past month. There is another leg up coming for the reopening plays and for some of tech like MSFT, NFLX, few semiconductors (NVDA too extended but AMAT, AVGO). \n\n&amp;#x200B;\n\nPlay your cards right. Listen to the badass with 6 monitors and not the random pumpers. \n\nPrice under 140 is wholesale , oncei t gets to 156  I would start scaling out if you have a big position, some resistance there short term.",
        "subreddit": "wallstreetbets",
        "title": "ABNB will be exploding next 6 weeks",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ol7jkj/abnb_will_be_exploding_next_6_weeks/",
        "created": 1626431064.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1626209120,
        "id": "ojojxn",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, July 13, 2021**\n\nToday was quite action-packed, with both the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) once again recording a fresh intraday high for the second time this week before turning lower towards the end of the session. The Russell 2000 (IWM), which tracks the performance of small-caps, performed the worst, falling 1.75% at the time of writing. Market participants are digesting the beginning of Q2 earning season and a new report that showed in June, consumer prices have surged by the most since 2008.\n\nThe Labor Department’s June Consumer Price Index (CPI), which measures changes in the prices of consumer goods, rose 0.9% in June, accelerating from May’s 0.6%. Year-on-year, the CPI is up 5.4%, exceeding the 4.9% expected by economists and the fastest rate of growth since 2008. Core CPI, which excludes the volatile price energy and food and is therefore considered a more accurate representation of general price inflation, was up 4.5% year-on-year as prices bounced from last year’s pandemic-era lows.\n\nWhile the CPI print is not ideal, the market’s somewhat muted reaction (though there was a little volatility) seems to confirm that market participants are increasingly pricing in higher-than-expected inflationary data and are buying into the Federal Reserve’s argument that current pressures are transitory and due to pandemic-related disruptions. Moreover, it is very important to consider that current inflationary data is calculated on a year-on-year basis, so base effects are very much inflating the current numbers. In other words, inflationary readings are high because they are being measured using numbers from June 2020 when prices across the board collapsed as lockdowns and social distancing policies were implemented across the world. As I have said many times in the past, I am personally not yet worried about current inflationary pressures translating into a prolonged cycle of higher prices, though one always has to acknowledge the risks in the market and be prepared to act. \n\nIn other news, Q2 earnings seasons kicked off today, with two of the largest banks in the US, JP Morgan Chase (JPM) and Goldman Sachs (GS) both reporting today, as well as Pepsi (PEP). JP Morgan, which is often considered a bellwether for the US economy given its sheer size, reported great results, driven in part by the release of $3 billion the bank had set aside to protect against potential losses from default loans during the pandemic, a sign that consumers held up better than the bank expected. JPM recorded revenues of $31.4 billion and profits of $11.948 billion, a staggering improvement from profits of $4.687 billion a year ago. One downside from the earnings report is a sharp reduction in revenues produced from trading, which is not surprising given the insane run by the market in 2020. \n\nThis quarter, earnings for companies in the SPY are expected to grow by 64% year-on-year, according to FactSet, which would mark the fastest rate of earnings growth since the fourth quarter of 2009, when the US was emerging from the 11.948 housing-bubble induced recession. \n\nA big part of the strong Q2 earnings growth is easy comparisons to Q2 2020, a period that represented the bottom of the Covid-19 earnings impact. But Q2 2021 estimates also reflect genuine growth, with total index earnings expected to be up +8.8% compared to the pre-Covid 2019 Q2 period. In other words, even when compared to an earnings season 2 years ago, well before the coronavirus pandemic, this earnings season is expected to show very strong growth. Estimates for Q2 and beyond have been steadily going up, with the current +60.5% earnings growth rate up from +50.6% at the end of March and +41.6% at the start of January 2021.\n\nGoldman Sachs strategist David Kosting said that market participants should focus on three questions heading into this earnings season: (1) How will companies deal with rising material costs and supply chain disruptions? (2) How are companies planning to prioritize cash spending? (3) How will companies deal with policy uncertainties, especially surrounding a potential tax hike?\n\nIn addition to earnings season, market participants are also looking forward to Federal Reserve Chair Jerome Powell giving his semi-annual Monetary Policy Report to Congress Wednesday and Thursday of this week. Analysts are expecting Powell to once again strike a dovish tone (meaning unlikely to take aggressive action against inflation and instead favor employment), given the mixed June Job Report, which saw a better than expected number of jobs added to the economy but the unemployment rate tick higher and last week’s meeting minutes which showed an increasing divide between members regarding the timeline to begin tapering quantitative easing. In my view, Powell is trying to do three things in the upcoming meeting: (1) reiterate his view that the recovery of the economy is not yet complete, (2) inflation is a result of pandemic-era disruptions, and (3) prevent a repeat of the 2013 Taper Tantrum, a unwarranted, silly, collective market-panic that triggered a spike in U.S. Treasury yields after investors learned that the Federal Reserve was slowly putting the brakes on its quantitative easing program passed during the height of the 2008-09 recession. Moving ahead, further economic reports on consumer price inflation and retail sales out this week are expected to once again underscore that the pace of economic recovery in the US remains limited by supply chain disruptions and labor market imbalances.\n\n**Highlights**\n\n* Shares of Disney (DIS) outperformed the market again today thanks to the great success of Marvel’s “Black Widow”, which generated $80 billion in theater sales and $60 billion in streaming sales, the best domestic opening for a movie since the pandemic began. \n* Tesla (TSLA) Chief Executive Elon Musk defended the electric-vehicle maker's purchase of SolarCity Corp. in court, telling a Delaware judge that he didn't act improperly during the negotiating process. This comes in response to a lawsuit filed by TSLA shareholders that allege Musk forced the company to buy SolarCity, a solar-cell manufacturer, in order to save his investment in the company.\n* Netflix and Universal have reached a licensing deal that will see more Universal movies, including animated pictures from DreamWorks, available on its streaming platform. \n* Despite successfully completing the company's first trip with Richard Branson as a passenger, shares of Virgin Galactic (SPCE) remain under pressure after the company announced it planned to take advantage of the elevated stock price by selling $500 million in stock, with the stock down roughly 25% from Friday’s prices. \n* Broadcom (AVGO) is reportedly in talks to buy the SAS Institute, a software company with upwards of $3 billion a year in revenue in a deal valued between $15-$20 billion. This is yet another acquisition by one of the world’s largest semiconductor companies.\n* Microsoft (MSFT) announced it was acquiring cybersecurity firm RiskIQ to help reduce risk amid “the increasing sophistication and frequency of cyberattacks”.\n* SolarWinds says that unknown hackers exploited a previously unknown flaw in two of its programs to go after \"a limited, targeted set of customers.\" The company went on to say the hack was “completely unrelated” to last year’s attack” and that the company was still “unaware of the identity of the potentially affected customers”. Seems like hackers find it easy to attack this company. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AutoDesk (ADSK) target raised by Mizuho from $335 to $355 at Buy. Stock currently around $296\n* Activision Blizzard (ATVI) target raised by Berenberg Bank from $105 to $110 at Buy. Stock currently around $93\n* DuPont (DD) target raised by Wells Fargo from $95 to $97 at Overweight. Stock currently around $79\n* Danaher (DHR) target raised by Barclays from $300 to $310 at Overweight. Stock currently around $277\n* Electronic Arts (EA) target raised by Berenberg Bank from $160 to $170 at Buy. Stock currently around $143\n* EOG Resources (EOG) target raised by Citigroup from $92 to $98 at Buy. Stock currently around $83\n* Elastic (ESTC) target raised by Jefferies Financial from $150 to $175 at Buy. Stock currently around $149\n* Hess (HESS) target raised by Citigroup from $98 to $102 at Buy. Stock currently around $84\n* IQVIA (IQV) target raised by Barclays from $260 to $285 at Overweight. Stock currently around $250\n* JB Hunt Transport Services (JBHT) target raised by Wells Fargo from $192 to $203 at Overweight. Stock currently around $167\n* Zscaler (ZS) target raised by Needham &amp; Co from $245 to $280 at Strong-Buy. Stock currently around $227\n\n“Be sure you put your feet in the right place, then stand firm.” - Abraham Lincoln",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, July 13, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/ojojxn/here_is_a_market_recap_for_today_tuesday_july_13/",
        "created": 1626237920.0
    },
    {
        "author": "Trading-Resources",
        "created_utc": 1626410069,
        "id": "ol9lx3",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Semiconductor Expected Earnings Dates\n\nIf you are investing in semiconductor stocks it’s always nice to see how other stocks perform in the same sector before earnings. If I’m missing any or mistaken the dates please let me know and I will correct them. Enjoy! \n\n07/15PM $TSM \n\nTaiwan Semiconductor (NYSE:TSM): Q2 GAAP EPS of $0.93 beats by $0.02. Revenue of $13.29B (+28.0% Y/Y) misses by $20M.\n\n07/21PM ASML\n\n07/21AH TXN\n\n07/22AH INTC\n\n07/26AH CDNS\n\n07/27AH AMD\n\n07/27AH TER\n\n07/28PM UMC\n\n07/28AH QCOM\n\n07/28AH LRCX\n\n07/28AH XLNX\n\n07/29AH SWKS\n\n08/02AH NXPI\n\n08/03AH MCHP\n\n08/03AH LSCC\n\n08/05PM HIMX\n\n08/09PM ON\n\n08/10PM VSH 👈👍 (Hidden Value+Growth Surprise Play)\n\n08/10PM IMOS\n\n08/10AH INDI\n\n08/18PM ADI\n\n08/18AH NVDA\n\n08/17AH CREE\n\n08/18AH SNPS\n\n08/19AH AMAT\n\n08/19AH KEYS\n\n08/29AH KLAC\n\n09/02AH AVGO\n\n09/29AH MU",
        "subreddit": "wallstreetbets",
        "title": "Semiconductor Expected Earnings Dates",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ol9lx3/semiconductor_expected_earnings_dates/",
        "created": 1626438869.0
    },
    {
        "author": "NonchalantOffguard",
        "created_utc": 1625970403,
        "id": "ohw25f",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "My goal with my current holdings is to pick stocks that I can reasonably expect to 4x or 5x over the next five years - there's no way they all will, but enough of them will. I view none as gambles unlike certain speculative stocks - I'm betting on the future. Portion 1 (Growth, 80%)\n\nAAPL 11.3%, MSFT 11%, SQ 11%, LRCX 10%, AMD 9%, MTCH 8.5%, TTD 7.6% \n\nDOCU 4.3%, TSLA 4%, NXPI 4%, ETSY 4%, ARKK 4%, ARKQ 3%, ARKG 2.4%, LABU 1.9% ARKF 1%, AVGO 1%, QQQJ 1%, DDD 0.6%, ARKX 0.3%, ICLN 0.1% \n\n\nA small portion of the portfolio is allocated to insurance/banks that I think can outperform their own sector - a bit based of fundamental valuations, and are present should the day that the inflation attack comes hit growth and boost banks. This stabilizes the portfolio through a period that I may want to retain my growth stocks amidst them being a little underwater or lagging i.e. this is the enabler. Portion 2 (11%): \n\nPRU 21%, ALLY 21%, BMO 21%, PNC 21%, AXP 16% \n\n\nA smaller portion of the portfolio is dedicated to low-volatility and drawdown components - save for a few days/events here and there. This allows me to invest as much cash as possible and withdraw it either from that or something else in the portfolio if I suddenly need the money - also if it dips the growth may have dipped more, enabling me to add money to growth stocks. The underperformance of this component is addressed by the growth portion. Portion 3 (9%): \n\nSPY 40%, VYM 17.5%, WMT 12.5%, QYLD 10%, XLRE 10%, NEE 8%\n\nI'm in my low to mid-20s, but I have it so bad with medical issues that there's no way my time horizon is until the age of 50, for I'm not sure how long I can or should live past then when my symptoms will worsen. I need to grow this now and then save my body for whatever life I have left. Goals aside, there's the portfolio for ratings and viewings.",
        "subreddit": "investing",
        "title": "Growth Portfolio - Good business, Great Returns, Diversified Exponential Growth",
        "url": "https://www.reddit.com/r/investing/comments/ohw25f/growth_portfolio_good_business_great_returns/",
        "created": 1625999203.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1625969497,
        "id": "ohvu7r",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I've collected 150 stocks, I know it's too many, so I would appreciate some help disqualifying the obvious mistakes. Most of these are either tech stocks, especially cloud, or on some list, like Dividend Kings, or Aristocrats. My goal is to have the absolute best growth stocks, then also growth stocks that also pay increasing dividends, a combination approach, plus a few spec on the side. I have a medium-high risk tolerance and 15 year + Horizon. \n\n* I will keep APL ADBE BABA BIDU COST HD HON INTC KO MA MSFT NVDA O PEP PYPL T TCEHY TGT TXN UNH V \n\n* but I am less certain on others like ABB ABM ACN ADP AMAT APPH APPN ARCC ASML AVGO BAC BLK CMCSA COIN CRM CRWD CSCO DD DDOG DOCU DPZ DUK ENPH ETSY FDX FSLY GILT HVBT IRDM ISRG JMIA JPM LOGI LRCX LSCC MELI MP MRVL MU NEE NET NIO NOW ORA ORCL PAYX PG PLUG PNR PSA QCOM RNG ROKU ROP SE SEDG SNOW SPCE SPLK SQ SWKS TDOC TTD TTWO UPS VSAT WELL XEL ZEN ZG ZM ZS \n\n* and others on those dividend lists such as: ADI AIZ AMT ANTM APD ATO ATR AWK AWR BANF BMI BRO CAT CB CBU CFR CHD CINF CL CLX CME CMI CSL CSX CTBI DCI DOV EMR ESS EXPD FAST FELE GPC HTD ITW JKHY LANC LECO LIN MCHP MCO MGRC NDSN NUE PH RPM SPGI TROW UNP WEC WM",
        "subreddit": "StockMarket",
        "title": "Help me disqualify these stocks",
        "url": "https://www.reddit.com/r/StockMarket/comments/ohvu7r/help_me_disqualify_these_stocks/",
        "created": 1625998297.0
    },
    {
        "author": "thyxxes",
        "created_utc": 1626313583,
        "id": "okirfx",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "\nMMAT is a semi-conductor company!\n\nJust to show some other semi-conductor stocks!———————————————-\n\n1. TSM.    ($124.39)\n2. AVGO  ( $481.59)\n3. NVDA. ($793.66)\n4. ASML. ($716.51)\n5. AMD.   ($89.05)\n6. MU.     ($78.49)\n7. NXDI.  ($203.55)\n8. KLAC. ($309.12)\n\nYES the future is bright for MMAT but their could be a massive rip Thursday and Friday! \n\nYES tomorrow is a big cataclyst for this stock just with the “Virtual Investor Meeting” get in right at open and SLAP that ask!!!\n\nYES TESLA has bought 18M+ shares which was finalized Monday of this week!!!\n\nYES the owner/founder/chairman owns over 10% of the company, while his spouse owns about 5% as well! \n\nYES META is a unicorn stock and will perform as such!!!\n\nYES everyone should be JACKED TO THE TITS about this company!!!\n\nSee you all tomorrow at the bell!!🔔        \n\n\n🦄🦄🍇🍇🦄🦄🏹🧨🦄🦄🍇🍇🦄🦄",
        "subreddit": "wallstreetbets",
        "title": "MMAT 🦄🦄🦄🦄",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/okirfx/mmat/",
        "created": 1626342383.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1626123887,
        "id": "oj0f6m",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, July 12, 2021**\n\nAfter a spurt in volatility last Thursday, stocks have shaken off any jitteriness, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) once again powering to fresh intraday records today. Looking ahead, market participants are waiting for Q2 earnings season to begin tomorrow, with two of the largest banks in the US, JP Morgan (JPM) and Goldman Sachs (GS), reporting results and Jerome Powell’s testimony before Congress later this week.\n\nWith Q2 earnings are fast approaching, market participants are gearing up for what is expected to be a repeat of Q1 record-setting season, with earnings expected to continue being super-charged by stronger than expected demand from savings-loaden consumers and the continued reopening of the US economy thanks to effective distribution of the coronavirus vaccine. So far, analysts are looking for S&amp;P 500 earnings to grow by 61.9% year-on-year in aggregate, according to FactSet data – an estimate UBS's Head of Equity Derivatives Research Stuart Kaiser said may still be \"need to be revised higher.\" This would represent a sharp acceleration from the 50% year-on-year growth recorded during Q1’s earnings season.\n\nA big part of the strong Q2 earnings growth is easy comparisons to the year-earlier period that represented the bottom of the Covid-19 earnings impact. But Q2 estimates also reflect genuine growth, with total index earnings expected to be up +8.8% compared to the pre-Covid 2019 Q2 period. In other words, even when compared to an earnings season 2 years ago, well before the coronavirus pandemic, this earnings season is expected to show very strong growth. Estimates for Q2 and beyond have been steadily going up, with the current +60.5% earnings growth rate up from +50.6% at the end of March and +41.6% at the start of January 2021.\n\nGoldman Sachs strategist David Kosting said that market pariticpants should focus on three questions heading into this earnings season: (1) How will companies deal with rising material costs and supply chain disruptions? (2) How are companies planning to prioritize cash spending? (3) How will companies deal with policy uncertainties, especially surrounding a potential tax hike?\n\nIn addition to earnings season, market participants are also looking forward to Federal Reserve Chair Jerome Powell giving his semi-annual Monetary Policy Report to Congress Wednesday and Thursday of this week. Analysts are expecting Powell to once again strike a dovish tone (meaning unlikely to take aggressive action against inflation and instead favor employment), given the mixed June Job Report, which saw a better than expected number of jobs added to the economy but the unemployment rate tick higher and last week’s meeting minutes which showed an increasing divide between members regarding the timeline to begin tapering quantitative easing. In my view, Powell is trying to do three things in the upcoming meeting: (1) reiterate his view that the recovery of the economy is not yet complete, (2) inflation is a result of pandemic-era disruptions, and (3) prevent a repeat of the 2013 Taper Tantrum, an unwarranted, silly, collective market-panic that triggered a spike in U.S. Treasury yields after investors learned that the Federal Reserve was slowly putting the brakes on its quantitative easing program passed during the height of the 2008-09 recession. Moving ahead, further economic reports on consumer price inflation and retail sales out this week are expected to once again underscore that the pace of economic recovery in the US remains limited by supply chain disruptions and labor market imbalances.\n\nKathy Jones, chief fixed income strategist at Charles Schwab said, “I think the recovery is on track, it’s really just the rate of change that has slowed. We couldn’t continue to grow at 9-10% GDP growth every quarter, so obviously it’s going to slow down. I think one of the things that got into markets that got \\[Treasury\\] yields tumbling was maybe the fact that the Fed was going to hike rates sooner than anticipated. That sends a signal to the long end of the bond market that maybe the Fed isn;t going to tolerate higher inflation for longer and that they’re going to step on the brakes sooner rather than later ... we don't think that's going to be the case though. We think the economy is doing well, yields will probably bounce back.\" I agree with this sentiment. \n\n**Highlights**\n\n* Over the weekend, Richard Branson became the first civilian to go to space with his own company Virgin Galactic (SPCE), a remarkable milestone as companies like Bezos’ Blue Origin and Musk’s SpaceX intensify competition in space tourism.\n* Despite successfully completing the trip, shares of Virgin Galactic (SPCE) fell more than 10% after the company announced it planned to take advantage of the elevated stock price by selling $500 million in stock.\n* Tesla (TSLA) Chief Executive Elon Musk on Monday defended the electric-vehicle maker's purchase of SolarCity Corp. in court, telling a Delaware judge that he didn't act improperly during the negotiating process. This comes in response to a lawsuit filed by TSLA shareholders that allege Musk forced the company to buy SolarCity, a solar-cell manufacturer, in order to save his investment in the company. Frankly, this lawsuit seems a little ridiculous to me given SolarCity has proven a smart acquisition.\n* Walt Disney (DIS) said on Sunday that “Black Widow”, the newest Marvel movie, made $80 million in theater sales, the largest domestic opening weekend since “Star Wars: The Rise of Skywalker” in 2019, a strong sign that appetite to go to the movies remains high among Americans. Comparatively, “Black Widow” made $60 million through streaming purchases.\n* In yet another crackdown of big-tech companies, Chinese regulators are reportedly set to order Tencent (TCEHY) to give up their exclusive rights to music labels and pay a small fine.\n* Broadcom (AVGO) is reportedly in talks to by SAS Institute, a software company with upwards of $3 billion a year in revenue in a deal valued between $15-$20 billion. This is yet another acquisition by one of the world’s largest semiconductor companies.\n* Microsoft (MSFT) announced it was acquiring cybersecurity firm RiskIQ to help reduce risk amid “the increasing sophistication and frequency of cyberattacks”.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Abbott Laboratories (ABT) target raised by Wells Fargo from $125 to $135 at Overweight. Stock currently around $119\n* Apollo Global Management (APO) target raised by Citigroup from $72 to $76 at Buy. Stock currently around $61\n* American Express (AXP) with two target raises. Stock currently around $174\n   * Deutsche Bank from $158 to $185 at Buy\n   * Wells Fargo from $185 to $200 at Overweight\n* BlackRock (BLK) target raised by Citigroup from $1000 to $1050 at Buy. Stock currently around $918\n* Comcast (CMCSA) target raised by Benchmark from $70 to $72 at Buy. Stock currently around $1615\n* Chipotle (CMG) target raised by Royal Bank of Canada from $1750 to $1800 at Outperform. Stock currently around $1615\n* Capital One Financial (COF) target raised by Wells Fargo from $155 to $180 at Overweight. Stock currently around $165\n* CrowdStrike (CRWD) target raised by Mizuho from $255 to $295 at Buy. Stock currently around $262\n* Domino’s Pizza (DPZ) target raised by $466 to $515 at Outperform. Stock currently around $480 \n* Etsy (ETSY) target raised by Oppenheimer from $200 to $225 at Outperform. Stock currently around $194\n* L Brands (LB) target raised by JP Morgan Chase from $93 to $100 at Overweight. Stock currently around $77\n* Palo Alto Networks (PANW) target raised by Deutsche Bank from $410 to $490 at Buy. Stock currently around $388\n* Charles Schwab (SCHW) target raised by Citigroup from $93 to $94 at Buy. Stock currently around $72\n* Twilio (TWLO) target raised by Wolfe Research from $440 to $480 at Outperform. Stock currently around $393. \n\n\"It is the mark of an educated mind to be able to entertain a thought without accepting it.\" - Aristotle",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, July 12, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/oj0f6m/here_is_a_market_recap_for_today_monday_july_12/",
        "created": 1626152687.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1625257358,
        "id": "ociku0",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, July 2, 2021**\n\nStocks rose once again, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) both recording new intraday highs amid the continued push by technology stocks. The Dow Jones (DIA) rose as well, but continued to lag behind the other two indexes. Market participants are encouraged by the June Jobs Report, which showed payroll gains rise more than expected. \n\nToday, the US Department of Labor released the Job June report, which showed a stronger-than-expected acceleration in hiring, with non-farm payrolls rising by 850,000, the sixth straight month of gains. The unemployment rate however, ticked slightly higher to 5.9%. Here are the numbers\n\n* **Change in non-farm payrolls:** 850,000 vs. 720,000 expected and an upwardly revised 583,000 in May\n* **Unemployment rate:** 5.9% vs. 5.6% expected and 5.8% in May \n* **Average hourly earnings, month-over-month:** 0.3% vs. 0.3% expected and a downwardly revised 0.4% in May\n* **Average hourly earnings, year-over-year:** 3.6% vs. 3.6% expected and a downwardly revised 1.9% in May\n\nPresident Biden said of the report, “This is historic progress, pulling our economy out of the worst crisis in 100 years, driven in part by our dramatic progress in vaccinating our nation and beating back the pandemic. Today, the US is the only major advanced economy where the OECD (Organization for Economic Cooperation and Development) projections of future output are higher today than they were in January 2020 before the pandemic hit.”\n\nEmily Roland, co-Chief Investment Strategist at John Hancock Investment Management said of the report, “This is the Goldilocks Report that the market was looking for today. You had a nice print here of 850,000 jobs being added, wage pressure remaining – I wouldn't call them necessarily contained – but surprising here on the downside versus consensus estimates. So this is telling us right now that economic growth is continuing to accelerate here, the jobs market is continuing to heal. We're making progress here in terms of what the Fed has set out to do, which is in order to get unemployment down, they're going to let inflation run a little bit hot here. Not too hot, not too cold – this is just what the market wants.\"\n\nThis Job Report will give market participants a better idea as to the timing of the Federal Reserve’s next monetary policy. For now, the Fed has so far kept in place both of its key pandemic-era policies - quantitative easing at a clip of $120 billion a month and near-zero interest rates. However, the Fed has consistently said they are looking for a “string” of strong jobs reports, like the one this month before any adjustments to the current policy is made. If the Jobs Report continues being especially strong in the months ahead, it could force the Fed to taper quantitative easing earlier than originally telegraphed. I have said  before in the past I expect the Fed to begin tapering QE towards the end of the year and am not worried about that at all. For starters, the market has historically reacted very little to changes in QE ([see the 2013 Taper Tantrum here)](https://www.investopedia.com/terms/t/taper-tantrum.asp), it’s changes in the interest rate that really drive the market, and second, the Fed is expected to taper slowly, making any changes gradual.\n\n**Highlights**\n\n* Shares of AMC pulled back slightly after financial firm Iceberg Research announced they have opened a short position. Honestly, I have no idea why they did this, only opening themselves up to becoming WSB's next target. Will be interesting to see what happens moving forward.\n* More bad news for Lordstown Motors, who have already been the subject of a short report that saw the company admit they had inflated the importance of preorders for the electric pickup truck and forced the CEO to leave. Now, the Justice Department has announced it is opening a probe into the company to investigate comments made by executives and the way the company represented its pre orders to shareholders. The whole EV market was down today in sympathy. \n* Tesla (TSLA) recorded its fifth straight quarter of vehicle delivery growth. In Q2, the company delivered 201,250 vehicles, missing expectations for 204,160, according to Bloomberg consensus data**,** but more than double the 90,891 vehicles delivered in the same period a year ago.\n* The U.S. Federal Trade Commission filed a proposed consent order to settle antitrust charges against semiconductor maker Broadcom Inc, the agency said in a statement on Friday. The consent order requires Broadcom to stop demanding that its customers buy components mostly or only from Broadcom. The company responded, “While we disagree that our actions violated the law and disagree with the FTC’s characterizations of our business, we look forward to putting this matter behind us.\"\n* Jeff Bezos is officially stepping down as Amazon CEO on Monday. Amazon Web Services CEO Andy Jassey will be taking over for him. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Anthem (ANTM) target raised by Morgan Stanley from $454 to $459. Stock currently around $387\n* Capital One (COF) with two target raises. Stock currently around $157\n   * Piper Sandler from $175 to $182 \n   * Credit Suisse from $175 to $182\n* Enphase Energy (ENPH) target raised by Goldman Sachs from $187 to $202 at Buy. Stock currently around $186\n* GoodRx (GDRX) target raised by Morgan Stanley from $36 to $38. Stock currently around $33.8\n* JD.com (JD) target raised by Goldman Sachs from $119 to $130 at Conviction-Buy. Stock currently around $76\n* Eli Lilly (LLY) target raised by Truist Securities from $225 to $262 at Buy. Stock currently around $234\n* SolarEdge Technologies (SEDG) target raised by Goldman Sachs from $290 to $322 at Buy. Stock currently around $277\n* Xpeng (XPEV) target raised by Citigroup from $50 to $56.30 at Buy. Stock currently around $44\n* Zscaler (ZS) target raised by BTIG Research from $240 to $253 at Buy. Stock currently around $214\n\n“To bear trials with a calm mind robs misfortune of its strength and burden”. — Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, July 2, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/ociku0/here_is_a_market_recap_for_today_friday_july_2/",
        "created": 1625286158.0
    },
    {
        "author": "HSeldon2020",
        "created_utc": 1626392700,
        "id": "ol4vlv",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n**TSLA** and **AMZN** saved my ass today, otherwise I seriously doubt I would have been in profit, nor did I deserve to be in profit. Still have some bad habits I need to get rid of – including, but not limited to – vaping, pharmaceuticals, gambling, a messiah complex, a love of Barry Manilow songs, and a new addiction to chocolate pudding (more on that later).\n\nI entered the day today holding several low float stocks that just slowly suck the life out of you. I really wanted to get rid them – I was somewhat successful at that.\n\nAs usual, all trades were posted live, here is the link to today’s “play-by-play”:\n\n[https://www.reddit.com/r/RealDayTrading/comments/oksy42/time\\_to\\_go\\_to\\_work\\_trades\\_715/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/RealDayTrading/comments/oksy42/time_to_go_to_work_trades_715/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\n***All times are in PST, West Coast of the U.S.***\n\nMy first trade of the day was a *Put Debit Spread* on **WDAY**. Why do a *PDS* instead of straight Puts? Because the day had just started, and while I wanted to capitalize on the bearish price action in the stock, I also did not know what **SPY** was planning to do or how **WDAY** would react to any changes in the market. Besides, it seems really fancy to start with an option spread. \n\n**WDAY –** CDS 230/225 (6:46am) for a $2 Debit –/ Closed for $2.55 Credit (7:45am) – *Profit of .55 per contract.*\n\n*At this point (6:53am) I added to* ***ATOS****, a stock I was still holding. At 6:53am I added more shares for $6.67, bring my average price on* ***ATOS*** *to $6.46.* *This turned out to be a brilliant move on my part as* ***ATOS*** *continued to drop.* \n\nNext up was **AZN** the vaccine that protects against everything except the dominant variant out right now apparently. Stock was weak to the market, but had what I thought to be support at $57.55 (the SMA 50), I thought wrong, as **AZN** blew right through that level later in the day. Should have stuck with this one.\n\n**AZN –** Short $58.08 (7:23am) / Closed at $57.88 (7:52am) – *Profit of .20 cents* *per share.*\n\n*Managed to scratch my* ***AAPL*** *calls from yesterday at 7:32am.* *Even though I could have taken profit on these calls at the open, I am still happy that I got out at breakeven.*\n\nI was missing the cheap stocks, and **VERB** caught my eye, and once those cheap stocks catch my eye, I am probably buying something, and a lot of it. This once is not a “low float” stock, and actually has a decent daily chart on it. So don’t be lumping **VERB** in with all those other harlots! **VERB** is better than that! \n\n**VERB –** Long $3.05 (7:36am) / Closed at $3.14 (8:03am) – *Profit of .06 cents per share.*\n\nI broke my rule with **RIDE** and when you break your own rules in Day Trading you usually pay for it (literally). This was no exception. **RIDE** has a terrible looking daily chart, and as such, I should not have taken the trade. And then to make matters worse, I averaged down, repeatedly. And now I have to live with myself as I sit here and think about what I’ve done.\n\n**RIDE** \\- Long $9.02 (7:58am, 8:06am, 8:58am, 10:51am) / Closed at $8.84 – *Loss of .28 cents per share.*\n\nNow I am looking at red day due to all the bags I am holding, not happy with myself over the **RIDE** trade, and going into a dark place where all I wanted was to put on some Barry Manilow and eat chocolate pudding cups. But did I? No! Because along came **TSLA** dropping through its’ SMA 100 like a spoon through the before-mentioned pudding**!**\n\n**TSLA** – Short $653.52 – Puts (8:04am) / Closed at $644.85 – *Profit of $4.15 per contract.*\n\nOut of my temporary funk and ready to make more money, I notice that nobody wants toys anymore! Or rather, nobody can get the toys out of China anymore! Either way, **HAS** was dropping fast.\n\n**HAS –** Short 95.59 (8:14am) / Closed at $95.34 (8:41am) – *Profit of .25 cents per share.* \n\nClearly, I was in way too good of a mood because my next trade might as well be called, “How can I give some of this back, quickly?” **AMKR** pops on a takeover rumor, but I did not wait to see if the green bar would hold. Literally Day Trading 101 and I screwed it up. Back to singing Mandy, and chocolate pudding for me.\n\n**AMKR –** Long $23.44 (8:39am) / Closed at $22.38 (10:06am) – *Loss of $1.06*\n\nWelcome to the first bag-holder of the day section of this update. Although I do not mind holding this bag – **RCL**. The stock is very bearish, weak against **SPY** on the daily chart, but for some reason found some late day strength. I am staying with this trade until it turns green because it will.\n\n**RCL –** Short $73.23 (10:04am) / Still holding – Stock currently at $74.21\n\nWe are not done with the bag-holders – so here is another one – **UNH.** Once again, I do not mind this one. Great response to earnings, through resistance and closing in on its all-time-high, which means there are not many traders holding bags on this ticker, except me of course.\n\n**UNH –** Long $421.30 – Calls (10:24am) / Still holding – Stock currently at $420.05\n\n*Add some, lose some – decided to get rid of one of my losers from the other day,* ***WHLM****, which I average to $6.70 (10:28am) and then finally closed it.* *Loss - .95 cents* \n\nHere is the trade of the day! **CIDM!!**\n\n**CIDM –** Long $1.44 (10:30am) / Scratched at $1.44 (10:30am)\n\nMoved on from the pudding, now I am eyeing a bag of marshmallows, Mandy is on repeat, things are getting dark again. And what do we do when things get dark? **TSLA!**\n\n**TSLA –** Short $644.21 - Puts (10:32am) / Closed $638.70 (11:02am) – *Profit $4.85 per contract*\n\nLooking for a short, I find **COIN**, sorry Aunt Cathie but your stock is looking sad. Sure, I am holding it, but like the other two, I do not mind, because **COIN** is bearish, and *extremely* weak to the market. **SPY** could be way up tomorrow, and **COIN** will still be red. \n\n**COIN –** Short $220.66 (10:44am) / Still Holding – Stock currently at $224.63\n\nHopped up on Snack Packs I needed a trade to bring me back down to earth, so that says **HD** to me! Maybe I’ll look at **BBBY** next, who knows, *I don’t know if I’ll have that kind of time!* Strong against SPY? Check. Good volume? Check. Looking to break out of Daily compression? Sure, why not.\n\n**HD –** Long $322.15 - Calls (11:06am) / Closed $322.65 – *Profit $.50 per contract.*\n\nFor some reason I thought I needed to short more cruise ships, which is stupid, because why would anyone have two cruise stocks at the same time? Well, you ignore basic cruise duplication rule, you pay the price. I did.\n\n**NCLH –** Short 23.80 (11:38am) / Closed at $24.20 (11:56am) – *Loss of .40 cents per share.*\n\nMy favorite stock to short is **AMZN**. I love using it as a hedge, and I love seeing it go down. It isn’t like I have something against **AMZN**, I don’t, I use them all the time actually. I just like shorting it, so when I can, I will – and I could, and I did.\n\n**AMZN –** Short $3636.99 (11:55am) / Closed at $3626.30 (12:45pm) – *Profit of $7.80 per contract.*\n\nAs the day began to wind down, I was able to take advantage of a play I missed earlier. And I missed it because I was screwing around with those cheap ass stocks while wallowing in my chocolate pudding! I did not miss it this time. **SAVA** was weak against the market all day, has a clear HA reversal on the daily charts, and a long way to go before it hits any kind of support.\n\n**SAVA –** Short $83.18 (12:26pm) / Closed at $81.78 (12:42pm) – *Profit of $1.40 per contract.*\n\nNaturally, I couldn’t help myself and took **VERB** again, but I really do like the stock and plan on holding it. I know, I know, don’t get attached, right? But I dunno, there’s something about **VERB**…..\n\n**VERB –** Long $3.21 (12:47pm) / Still Holding – Stock currently at $3.26\n\nI also jumped back into **RCAT**, I just felt it had more to give after I let it go so quickly before. Quick scalp to end the day.\n\n**RCAT –** Long $5.03 (12:48pm) / Closed at $5.11 (12:50pm) – *Profit of .08 cents per share.*\n\n***AAL*** *(12:47pm) – it was time to let it go.* *No reason other than I still had way too many positions on.* *Loss - .90 cents a share.*\n\n***NEGG,*** *I averaged down to a cost per share of $29.74, and it ended the day not doing a damn thing, but I plan on holding this until it pops back up again.*\n\n***In After Hours, I did two trades:***\n\n**FUBO –** Long $27.21 (1:13pm/1:30pm) / Closed at $27.38 (1:52pm) – *Profit of .17 cents per share.*\n\n**MRNA –** Long $274.63 (2:24pm, 2:31pm, 2:44pm) / Closed at $275.63 (3:22pm) – *Profit of $1 per share.*\n\n***For today:***\n\n*Wins:* ***12***\n\n*Losses:* ***3***\n\n*Scratches:* ***1***\n\n*Holds:* ***4***\n\n***For the past three days:***\n\n*Wins:* ***33***\n\n*Losses:* ***10***\n\n*Scratches:* ***11***\n\n*Holds:* ***8***\n\n***Profit:***\n\n*On Day 1 (Tuesday) my overall profit was:* ***1.3%***\n\n*On Day 2 (Wednesday) my overall profit was:* ***.8%***\n\n*Today my overall profit was:* ***2.8%*** \n\n***Current Holds:***\n\n**ATOS (long) - $6.46,** currently at $**5.67 –** ***down .69 cents per share.*** ***Mental Stop - $5.25***\n\n**RCL (short) - $73.23,** currently at **$74.21 –** ***down .98 cents per share, Mental Stop - $76.05***\n\n**UNH (long) - $421.30**, currently at **$420.05 –** ***down $1.25 per share, Mental Stop - $415.95***\n\n**COIN (short) - $220.66,** currently at **$224.63 –** ***down $3.97 per share, Mental Stop - $229.25***\n\n**VERB (long) - $3.21,** currently at **$3.26 –** ***up .05 cents per share, Mental Stop - $2.75***\n\n**NEGG (long) - $29.84,** currently at **$26.20 –** ***down $3.64 per share, Mental Stop - $19.75***\n\n**CRTD (long) - $5.03,** currently at **$3.50 -** ***down $1.53 per share, Mental Stop - $3.30***\n\n**WORX (long) - $3.68,** currently at **$2.41 –** ***down $1.27 per share, Mental Stop - $2.35*** \n\n**OSTK (long) - $102.05,** currently at *$****86.33 – down $15.72 per share, Mental Stop – None\\**** \n\n*\\*these are ITM calls that expire in August.*\n\n***I also have AMZN puts, PFE calls, and a useless AVGO Call Debit Spread that will expire tomorrow at Max Loss.***\n\n*Keep in mind, I trade for a living, therefore the “numbers” I care most about are the monthly averages for:*\n\n***Win Rate %, # of Trades Per Day and Profit Per Trade***\n\nEvery Professional Day Trader is different, some have a lower number of trades a day, but a much higher average profit for example. However, *Win Rate* typically needs to be above 80%, which is a consistent benchmark for everyone that depends on Day Trading for a living.\n\nTrade Well!",
        "subreddit": "wallstreetbets",
        "title": "How To Day Trade Like A Crazy Person",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ol4vlv/how_to_day_trade_like_a_crazy_person/",
        "created": 1626421500.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1626123913,
        "id": "oj0fhk",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, July 12, 2021**\n\nAfter a spurt in volatility last Thursday, stocks have shaken off any jitteriness, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) once again powering to fresh intraday records today. Looking ahead, market participants are waiting for Q2 earnings season to begin tomorrow, with two of the largest banks in the US, JP Morgan (JPM) and Goldman Sachs (GS), reporting results and Jerome Powell’s testimony before Congress later this week.\n\nWith Q2 earnings are fast approaching, market participants are gearing up for what is expected to be a repeat of Q1 record-setting season, with earnings expected to continue being super-charged by stronger than expected demand from savings-loaden consumers and the continued reopening of the US economy thanks to effective distribution of the coronavirus vaccine. So far, analysts are looking for S&amp;P 500 earnings to grow by 61.9% year-on-year in aggregate, according to FactSet data – an estimate UBS's Head of Equity Derivatives Research Stuart Kaiser said may still be \"need to be revised higher.\" This would represent a sharp acceleration from the 50% year-on-year growth recorded during Q1’s earnings season.\n\nA big part of the strong Q2 earnings growth is easy comparisons to the year-earlier period that represented the bottom of the Covid-19 earnings impact. But Q2 estimates also reflect genuine growth, with total index earnings expected to be up +8.8% compared to the pre-Covid 2019 Q2 period. In other words, even when compared to an earnings season 2 years ago, well before the coronavirus pandemic, this earnings season is expected to show very strong growth. Estimates for Q2 and beyond have been steadily going up, with the current +60.5% earnings growth rate up from +50.6% at the end of March and +41.6% at the start of January 2021.\n\nGoldman Sachs strategist David Kosting said that market pariticpants should focus on three questions heading into this earnings season: (1) How will companies deal with rising material costs and supply chain disruptions? (2) How are companies planning to prioritize cash spending? (3) How will companies deal with policy uncertainties, especially surrounding a potential tax hike?\n\nIn addition to earnings season, market participants are also looking forward to Federal Reserve Chair Jerome Powell giving his semi-annual Monetary Policy Report to Congress Wednesday and Thursday of this week. Analysts are expecting Powell to once again strike a dovish tone (meaning unlikely to take aggressive action against inflation and instead favor employment), given the mixed June Job Report, which saw a better than expected number of jobs added to the economy but the unemployment rate tick higher and last week’s meeting minutes which showed an increasing divide between members regarding the timeline to begin tapering quantitative easing. In my view, Powell is trying to do three things in the upcoming meeting: (1) reiterate his view that the recovery of the economy is not yet complete, (2) inflation is a result of pandemic-era disruptions, and (3) prevent a repeat of the 2013 Taper Tantrum, a unwarranted, silly, collective market-panic that triggered a spike in U.S. Treasury yields after investors learned that the Federal Reserve was slowly putting the brakes on its quantitative easing program passed during the height of the 2008-09 recession. Moving ahead, further economic reports on consumer price inflation and retail sales out this week are expected to once again underscore that the pace of economic recovery in the US remains limited by supply chain disruptions and labor market imbalances.\n\nKathy Jones, chief fixed income strategist at Charles Schwab said, “I think the recovery is on track, it’s really just the rate of change that has slowed. We couldn’t continue to grow at 9-10% GDP growth every quarter, so obviously it’s going to slow down. I think one of the things that got into markets that got \\[Treasury\\] yields tumbling was maybe the fact that the Fed was going to hike rates sooner than anticipated. That sends a signal to the long end of the bond market that maybe the Fed isn;t going to tolerate higher inflation for longer and that they’re going to step on the brakes sooner rather than later ... we don't think that's going to be the case though. We think the economy is doing well, yields will probably bounce back.\" I agree with this sentiment. \n\n**Highlights**\n\n* Over the weekend, Richard Branson became the first civilian to go to space with his own company Virgin Galactic (SPCE), a remarkable milestone as companies like Bezos’ Blue Origin and Musk’s SpaceX intensify competition in space tourism.\n* Despite successfully completing the trip, shares of Virgin Galactic (SPCE) fell more than 10% after the company announced it planned to take advantage of the elevated stock price by selling $500 million in stock.\n* Tesla (TSLA) Chief Executive Elon Musk on Monday defended the electric-vehicle maker's purchase of SolarCity Corp. in court, telling a Delaware judge that he didn't act improperly during the negotiating process. This comes in response to a lawsuit filed by TSLA shareholders that allege Musk forced the company to buy SolarCity, a solar-cell manufacturer, in order to save his investment in the company. Frankly, this lawsuit seems a little ridiculous to me given SolarCity has proven a smart acquisition.\n* Walt Disney (DIS) said on Sunday that “Black Widow”, the newest Marvel movie, made $80 million in theater sales, the largest domestic opening weekend since “Star Wars: The Rise of Skywalker” in 2019, a strong sign that appetite to go to the movies remains high among Americans. Comparatively, “Black Widow” made $60 million through streaming purchases.\n* In yet another crackdown of big-tech companies, Chinese regulators are reportedly set to order Tencent (TCEHY) to give up their exclusive rights to music labels and pay a small fine.\n* Broadcom (AVGO) is reportedly in talks to by SAS Institute, a software company with upwards of $3 billion a year in revenue in a deal valued between $15-$20 billion. This is yet another acquisition by one of the world’s largest semiconductor companies.\n* Microsoft (MSFT) announced it was acquiring cybersecurity firm RiskIQ to help reduce risk amid “the increasing sophistication and frequency of cyberattacks”.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Abbott Laboratories (ABT) target raised by Wells Fargo from $125 to $135 at Overweight. Stock currently around $119\n* Apollo Global Management (APO) target raised by Citigroup from $72 to $76 at Buy. Stock currently around $61\n* American Express (AXP) with two target raises. Stock currently around $174\n   * Deutsche Bank from $158 to $185 at Buy\n   * Wells Fargo from $185 to $200 at Overweight\n* BlackRock (BLK) target raised by Citigroup from $1000 to $1050 at Buy. Stock currently around $918\n* Comcast (CMCSA) target raised by Benchmark from $70 to $72 at Buy. Stock currently around $1615\n* Chipotle (CMG) target raised by Royal Bank of Canada from $1750 to $1800 at Outperform. Stock currently around $1615\n* Capital One Financial (COF) target raised by Wells Fargo from $155 to $180 at Overweight. Stock currently around $165\n* CrowdStrike (CRWD) target raised by Mizuho from $255 to $295 at Buy. Stock currently around $262\n* Domino’s Pizza (DPZ) target raised by $466 to $515 at Outperform. Stock currently around $480 \n* Etsy (ETSY) target raised by Oppenheimer from $200 to $225 at Outperform. Stock currently around $194\n* L Brands (LB) target raised by JP Morgan Chase from $93 to $100 at Overweight. Stock currently around $77\n* Palo Alto Networks (PANW) target raised by Deutsche Bank from $410 to $490 at Buy. Stock currently around $388\n* Charles Schwab (SCHW) target raised by Citigroup from $93 to $94 at Buy. Stock currently around $72\n* Twilio (TWLO) target raised by Wolfe Research from $440 to $480 at Outperform. Stock currently around $393. \n\n\"It is the mark of an educated mind to be able to entertain a thought without accepting it.\" - Aristotle",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, July 12, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/oj0fhk/here_is_a_market_recap_for_today_monday_july_12/",
        "created": 1626152713.0
    },
    {
        "author": "Zenny_100",
        "created_utc": 1626917803,
        "id": "op3x2x",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I would like some help and maybe some insight from people holding these positions in determining which ones to hold for long term. \n\nI can’t decide between $AVGO and $NVDA\n\nAnd the other is between $V and $MA. \n\nI don’t want to have all 4 seeing as I like keeping my portfolio to around 6-10 stocks/etfs.\n\nThank you. Any help/insight is appreciated.",
        "subreddit": "stocks",
        "title": "Looking for advice",
        "url": "https://www.reddit.com/r/stocks/comments/op3x2x/looking_for_advice/",
        "created": 1626946603.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1626095380,
        "id": "oiqxev",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/cmwq3ain6sa71.png?width=558&amp;format=png&amp;auto=webp&amp;s=64b623f01a6d291ffac3bf180644acbac5b1480f\n\n**Estimated due diligence reading time: 5 minutes** \n\nMarket Cap (MKT Cap)\n\n* 2016- 96.37B\n* 2017- 94.56B\n* 2018- 68.66B\n* 2019- 102.81B\n* 2020- 172.75B\n* Current- 160.24B\n\n\\*Mkt Cap has increased by 66% in five years\n\nEPS (Dilution)\n\n* 2016- $3.28\n* 2017- ($2.87)\n* 2018- $1.53\n* 2019- $3.52\n* 2020- $5.84\n* Current- $6.96\n\n\\*EPS has increased by 112% in five years\n\n&amp;#x200B;\n\n**Financial Statement Highlights (in billions)**\n\nTotal Revenue (TR)\n\n* 2016- $23.78B\n* 2017- $22.29B\n* 2018- $21.18B\n* 2019- $24.50\n* 2020- $26.69\n* Current- $29.41\n\n\\*TR has increased by 24% in five years\n\n* Gross Margin\n* 2016- 59.38%\n* 2017- 55.09%\n* 2018- 54.39%\n* 2019- 65.22%\n* 2020- 60.17%\n* Current- 59.99%\n\n\\*Gross Margin has increased by 1% in five years\n\nPrice to Earnings Ratio (PE)\n\n* 2016- 17.14\n* 2017- 0.00\n* 2018- 34.65\n* 2019- 24.20\n* 2020- 25.82\n* Current- 20.32\n\n\\*PE Ratio has increased by 19% in five years\n\nPrice to Sales Ratio (PS)\n\n* 2016- 3.53\n* 2017- 3.83\n* 2018- 3.50\n* 2019- 4.12\n* 2020- 6.50\n* Current- 5.53\n\n\\*PS Ratio has increased by 57% in five years\n\nPrice to Book Ratio (PB)\n\n* 2016- 2.66\n* 2017- 3.55\n* 2018- 17.74\n* 2019- 21.58\n* 2020- 23.21\n* Current- 21.51\n\n\\*PB Ratio has increased by 709% in five years\n\n&amp;#x200B;\n\n**Balance Sheet Highlights (in billions)**\n\nTotal Liabilities\n\n* 2016- $21.16B\n* 2017- $40.43B\n* 2018- $30.63B\n* 2019- $28.60B\n* 2020- $30.10B\n* Current- $29.74B\n\n\\*Total Liabilities have increased by 41% in five years\n\nLong Term Debt (LTD)\n\n* 2016- $9.94B\n* 2017- $19.38B\n* 2018- $15.39B\n* 2019- $13.43B\n* 2020- $15.23B\n* Current- $15.23B\n\n\\*LTD has increased by 53% in five years\n\nDebt to Equity Ratio (DE)\n\n* 2016- 0.32\n* 2017- 0.81\n* 2018- 4.25\n* 2019- 2.98\n* 2020- 2.06\n* Current- 2.05\n\n\\*DE Ratio has increased by 541% in five years\n\n&amp;#x200B;\n\n**Chip Uses** \n\n* Mobile\n* Laptops\n* Virtual and Augmented Reality (VR)\n* Automotive\n* Wearables\n* Audio\n* Networking\n* Industrial IoT\n* Cameras\n* Smart Home\n\n&amp;#x200B;\n\n**Global Chip War**\n\n\tThe U.S heavily relies on Asia to produce chips. This is a major issue because instead of building the infrastructure to produce our own chips, we end up spending billions on foreign products. To combat this problem, the Senate has approved a $52B subsidy plan to help semiconductor manufacturers in the U.S to help boost fabrication. However, it will take time to build the infrastructure. Read more \\[here\\]([https://www.washingtonpost.com/technology/2021/06/14/global-subsidies-semiconductors-shortage/](https://www.washingtonpost.com/technology/2021/06/14/global-subsidies-semiconductors-shortage/))\n\n&amp;#x200B;\n\n**Competitors**\n\n* IBM (IBM)\n* Taiwan Semiconductor Manufacturing Company (TSMC)\n* Advanced Micro Devices (AMD)\n* NXP Semiconductors (NXP)\n* ON Semiconductor (ON)\n* Intel (INTC)\n* NVIDIA (NVDA)\n* Hewlett-Packard (HPE)\n* Dell (DELL)\n* Broadcom (AVGO)\n* Texas Instruments (TXN)\n* Nokia (NOK)\n\nhttps://preview.redd.it/z3268lfp6sa71.png?width=1804&amp;format=png&amp;auto=webp&amp;s=1da8bad97f99edbcbbdf431fcd5ab42f0bddfef4\n\nhttps://preview.redd.it/oycrxmsq6sa71.png?width=1810&amp;format=png&amp;auto=webp&amp;s=4aee2eec769154d4d91d1d224efec47d826e733f\n\nhttps://preview.redd.it/a5xi10js6sa71.png?width=1810&amp;format=png&amp;auto=webp&amp;s=6c365c38517c9db57d95975e2e325face69abdad\n\n**Management**\n\n\tNew CEO Cristiano Amon has worked at Qualcomm since 1995. Amon has helped spearhead Qualcomm's 5G strategy and global markets. Before working at Qualcomm, Amon was the CTO of Vésper (wireless operator in Brazil). He also worked for NEC and Velocom. Amon has a good track record. He's been in the industry for a long time while holding multiple leadership roles. Qualcomm might be his biggest leadership role yet. I have no doubt that Cristiano Amon will use his prior knowledge to help guide QCOM into a bright future. \n\n&amp;#x200B;\n\n**Conclusion**\n\n\tWe've seen tremendous growth across the semiconductor industry over the past two years. The recent chip shortage caused by COVID-19 has been driving QCOM's stock price up. Semiconductor manufactures are having trouble keeping up with consumer demand. It is uncertain when the chip shortage will sort itself out. Some experts have said that it could take several years before supply catches up to demand. A few key takeaways from QCOM's financials are Gross Margin and Price/Book ratio. Gross Margin has remained consistent over the past five years. The average gross margin in the semiconductor industry is 33.76%. QCOM is leading the pack at 60% gross margin. The PB ratio seems a little high to me. QCOM currently has a PB ratio of 21.51. To put that into perspective, Taiwan Semiconductor Manufacturing (TSMC) has a PB ratio of 9.05. While Advanced Micro Devices (AMD) has a PB of 17.05. This tells me that QCOM might be overvalued at its current price. Overall, I'd say the company's financials are pretty average in the industry. \n\n&amp;#x200B;\n\n*Disclaimer:*\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "StockMarket",
        "title": "[DD] QUalcomm (QCOM)",
        "url": "https://www.reddit.com/r/StockMarket/comments/oiqxev/dd_qualcomm_qcom/",
        "created": 1626124180.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1626209148,
        "id": "ojokab",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, July 13, 2021**\n\nToday was quite action-packed, with both the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) once again recording a fresh intraday high for the second time this week before turning lower towards the end of the session. The Russell 2000 (IWM), which tracks the performance of small-caps, performed the worst, falling 1.75% at the time of writing. Market participants are digesting the beginning of Q2 earning season and a new report that showed in June, consumer prices have surged by the most since 2008.\n\nThe Labor Department’s June Consumer Price Index (CPI), which measures changes in the prices of consumer goods, rose 0.9% in June, accelerating from May’s 0.6%. Year-on-year, the CPI is up 5.4%, exceeding the 4.9% expected by economists and the fastest rate of growth since 2008. Core CPI, which excludes the volatile price energy and food and is therefore considered a more accurate representation of general price inflation, was up 4.5% year-on-year as prices bounced from last year’s pandemic-era lows.\n\nWhile the CPI print is not ideal, the market’s somewhat muted reaction (though there was a little volatility) seems to confirm that market participants are increasingly pricing in higher-than-expected inflationary data and are buying into the Federal Reserve’s argument that current pressures are transitory and due to pandemic-related disruptions. Moreover, it is very important to consider that current inflationary data is calculated on a year-on-year basis, so base effects are very much inflating the current numbers. In other words, inflationary readings are high because they are being measured using numbers from June 2020 when prices across the board collapsed as lockdowns and social distancing policies were implemented across the world. As I have said many times in the past, I am personally not yet worried about current inflationary pressures translating into a prolonged cycle of higher prices, though one always has to acknowledge the risks in the market and be prepared to act. \n\nIn other news, Q2 earnings seasons kicked off today, with two of the largest banks in the US, JP Morgan Chase (JPM) and Goldman Sachs (GS) both reporting today, as well as Pepsi (PEP). JP Morgan, which is often considered a bellwether for the US economy given its sheer size, reported great results, driven in part by the release of $3 billion the bank had set aside to protect against potential losses from default loans during the pandemic, a sign that consumers held up better than the bank expected. JPM recorded revenues of $31.4 billion and profits of $11.948 billion, a staggering improvement from profits of $4.687 billion a year ago. One downside from the earnings report is a sharp reduction in revenues produced from trading, which is not surprising given the insane run by the market in 2020. \n\nThis quarter, earnings for companies in the SPY are expected to grow by 64% year-on-year, according to FactSet, which would mark the fastest rate of earnings growth since the fourth quarter of 2009, when the US was emerging from the 11.948 housing-bubble induced recession. \n\nA big part of the strong Q2 earnings growth is easy comparisons to Q2 2020, a period that represented the bottom of the Covid-19 earnings impact. But Q2 2021 estimates also reflect genuine growth, with total index earnings expected to be up +8.8% compared to the pre-Covid 2019 Q2 period. In other words, even when compared to an earnings season 2 years ago, well before the coronavirus pandemic, this earnings season is expected to show very strong growth. Estimates for Q2 and beyond have been steadily going up, with the current +60.5% earnings growth rate up from +50.6% at the end of March and +41.6% at the start of January 2021.\n\nGoldman Sachs strategist David Kosting said that market participants should focus on three questions heading into this earnings season: (1) How will companies deal with rising material costs and supply chain disruptions? (2) How are companies planning to prioritize cash spending? (3) How will companies deal with policy uncertainties, especially surrounding a potential tax hike?\n\nIn addition to earnings season, market participants are also looking forward to Federal Reserve Chair Jerome Powell giving his semi-annual Monetary Policy Report to Congress Wednesday and Thursday of this week. Analysts are expecting Powell to once again strike a dovish tone (meaning unlikely to take aggressive action against inflation and instead favor employment), given the mixed June Job Report, which saw a better than expected number of jobs added to the economy but the unemployment rate tick higher and last week’s meeting minutes which showed an increasing divide between members regarding the timeline to begin tapering quantitative easing. In my view, Powell is trying to do three things in the upcoming meeting: (1) reiterate his view that the recovery of the economy is not yet complete, (2) inflation is a result of pandemic-era disruptions, and (3) prevent a repeat of the 2013 Taper Tantrum, a unwarranted, silly, collective market-panic that triggered a spike in U.S. Treasury yields after investors learned that the Federal Reserve was slowly putting the brakes on its quantitative easing program passed during the height of the 2008-09 recession. Moving ahead, further economic reports on consumer price inflation and retail sales out this week are expected to once again underscore that the pace of economic recovery in the US remains limited by supply chain disruptions and labor market imbalances.\n\n**Highlights**\n\n* Shares of Disney (DIS) outperformed the market again today thanks to the great success of Marvel’s “Black Widow”, which generated $80 billion in theater sales and $60 billion in streaming sales, the best domestic opening for a movie since the pandemic began. \n* Tesla (TSLA) Chief Executive Elon Musk defended the electric-vehicle maker's purchase of SolarCity Corp. in court, telling a Delaware judge that he didn't act improperly during the negotiating process. This comes in response to a lawsuit filed by TSLA shareholders that allege Musk forced the company to buy SolarCity, a solar-cell manufacturer, in order to save his investment in the company.\n* Netflix and Universal have reached a licensing deal that will see more Universal movies, including animated pictures from DreamWorks, available on its streaming platform. \n* Despite successfully completing the company's first trip with Richard Branson as a passenger, shares of Virgin Galactic (SPCE) remain under pressure after the company announced it planned to take advantage of the elevated stock price by selling $500 million in stock, with the stock down roughly 25% from Friday’s prices. \n* Broadcom (AVGO) is reportedly in talks to buy the SAS Institute, a software company with upwards of $3 billion a year in revenue in a deal valued between $15-$20 billion. This is yet another acquisition by one of the world’s largest semiconductor companies.\n* Microsoft (MSFT) announced it was acquiring cybersecurity firm RiskIQ to help reduce risk amid “the increasing sophistication and frequency of cyberattacks”.\n* SolarWinds says that unknown hackers exploited a previously unknown flaw in two of its programs to go after \"a limited, targeted set of customers.\" The company went on to say the hack was “completely unrelated” to last year’s attack” and that the company was still “unaware of the identity of the potentially affected customers”. Seems like hackers find it easy to attack this company. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AutoDesk (ADSK) target raised by Mizuho from $335 to $355 at Buy. Stock currently around $296\n* Activision Blizzard (ATVI) target raised by Berenberg Bank from $105 to $110 at Buy. Stock currently around $93\n* DuPont (DD) target raised by Wells Fargo from $95 to $97 at Overweight. Stock currently around $79\n* Danaher (DHR) target raised by Barclays from $300 to $310 at Overweight. Stock currently around $277\n* Electronic Arts (EA) target raised by Berenberg Bank from $160 to $170 at Buy. Stock currently around $143\n* EOG Resources (EOG) target raised by Citigroup from $92 to $98 at Buy. Stock currently around $83\n* Elastic (ESTC) target raised by Jefferies Financial from $150 to $175 at Buy. Stock currently around $149\n* Hess (HESS) target raised by Citigroup from $98 to $102 at Buy. Stock currently around $84\n* IQVIA (IQV) target raised by Barclays from $260 to $285 at Overweight. Stock currently around $250\n* JB Hunt Transport Services (JBHT) target raised by Wells Fargo from $192 to $203 at Overweight. Stock currently around $167\n* Zscaler (ZS) target raised by Needham &amp; Co from $245 to $280 at Strong-Buy. Stock currently around $227\n\n“Be sure you put your feet in the right place, then stand firm.” - Abraham Lincoln",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tuesday, July 13, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/ojokab/here_is_a_market_recap_for_today_tuesday_july_13/",
        "created": 1626237948.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1625410652,
        "id": "odm33s",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Law: FTC Settles Antitrust Case With Chipmaker Broadcom",
        "url": "https://www.thetechee.com/2021/07/law-ftc-brings-antitrust-case-against.html",
        "created": 1625439452.0
    },
    {
        "author": "Trading-Resources",
        "created_utc": 1626368010,
        "id": "okwvju",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Semiconductor Earnings Expected Dates\n\n07/15PM TSM\n07/21PM ASML\n07/22AH INTC\n07/27AH AMD\n07/28AH QCOM\n07/28AH LRCX\n07/28AH XLNX\n07/29AH SWKS\n08/03AH MCHP\n08/09PM ON\n08/10PM VSH 👈👍\n08/17AH CREE\n08/18AH NVDA\n08/18PM ADI\n08/19AH AMAT\n08/29AH KLAC\n09/02AH AVGO\n09/29AH MU",
        "subreddit": "wallstreetbets",
        "title": "Semiconductor Expected Earnings Dates",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/okwvju/semiconductor_expected_earnings_dates/",
        "created": 1626396810.0
    },
    {
        "author": "HSeldon2020",
        "created_utc": 1626392120,
        "id": "ol4pm0",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "  \n\n**TSLA** and **AMZN** saved my ass today, otherwise I seriously doubt I would have been in profit, nor did I deserve to be in profit. Still have some bad habits I need to get rid of – including, but not limited to – vaping, pharmaceuticals, gambling, a messiah complex, a love of Barry Manilow songs, and a new addiction to chocolate pudding (more on that later).\n\nI entered the day today holding several low float stocks that just slowly suck the life out of you. I really wanted to get rid them – I was somewhat successful at that.\n\nAs usual, all trades were posted live, here is the link to today’s “play-by-play”:\n\n[https://www.reddit.com/r/RealDayTrading/comments/oksy42/time\\_to\\_go\\_to\\_work\\_trades\\_715/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/RealDayTrading/comments/oksy42/time_to_go_to_work_trades_715/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\n***All times are in PST, West Coast of the U.S.***\n\nMy first trade of the day was a *Put Debit Spread* on **WDAY**. Why do a *PDS* instead of straight Puts? Because the day had just started, and while I wanted to capitalize on the bearish price action in the stock, I also did not know what **SPY** was planning to do or how **WDAY** would react to any changes in the market. Besides, it seems really fancy to start with an option spread. \n\n**WDAY –** CDS 230/225 (6:46am) for a $2 Debit –/ Closed for $2.55 Credit (7:45am) – *Profit of .55 per contract.*\n\n*At this point (6:53am) I added to* ***ATOS****, a stock I was still holding. At 6:53am I added more shares for $6.67, bring my average price on* ***ATOS*** *to $6.46.* *This turned out to be a brilliant move on my part as* ***ATOS*** *continued to drop.* \n\nNext up was **AZN** the vaccine that protects against everything except the dominant variant out right now apparently. Stock was weak to the market, but had what I thought to be support at $57.55 (the SMA 50), I thought wrong, as **AZN** blew right through that level later in the day. Should have stuck with this one.\n\n**AZN –** Short $58.08 (7:23am) / Closed at $57.88 (7:52am) – *Profit of .20 cents* *per share.*\n\n*Managed to scratch my* ***AAPL*** *calls from yesterday at 7:32am.* *Even though I could have taken profit on these calls at the open, I am still happy that I got out at breakeven.*\n\nI was missing the cheap stocks, and **VERB** caught my eye, and once those cheap stocks catch my eye, I am probably buying something, and a lot of it. This once is not a “low float” stock, and actually has a decent daily chart on it. So don’t be lumping **VERB** in with all those other harlots! **VERB** is better than that! \n\n**VERB –** Long $3.05 (7:36am) / Closed at $3.14 (8:03am) – *Profit of .06 cents per share.*\n\nI broke my rule with **RIDE** and when you break your own rules in Day Trading you usually pay for it (literally). This was no exception. **RIDE** has a terrible looking daily chart, and as such, I should not have taken the trade. And then to make matters worse, I averaged down, repeatedly. And now I have to live with myself as I sit here and think about what I’ve done.\n\n**RIDE** \\- Long $9.02 (7:58am, 8:06am, 8:58am, 10:51am) / Closed at $8.84 – *Loss of .28 cents per share.*\n\nNow I am looking at red day due to all the bags I am holding, not happy with myself over the **RIDE** trade, and going into a dark place where all I wanted was to put on some Barry Manilow and eat chocolate pudding cups. But did I? No! Because along came **TSLA** dropping through its’ SMA 100 like a spoon through the before-mentioned pudding**!**\n\n**TSLA** – Short $653.52 – Puts (8:04am) / Closed at $644.85 – *Profit of $4.15 per contract.*\n\nOut of my temporary funk and ready to make more money, I notice that nobody wants toys anymore! Or rather, nobody can get the toys out of China anymore! Either way, **HAS** was dropping fast.\n\n**HAS –** Short 95.59 (8:14am) / Closed at $95.34 (8:41am) – *Profit of .25 cents per share.* \n\nClearly, I was in way too good of a mood because my next trade might as well be called, “How can I give some of this back, quickly?” **AMKR** pops on a takeover rumor, but I did not wait to see if the green bar would hold. Literally Day Trading 101 and I screwed it up. Back to singing Mandy, and chocolate pudding for me.\n\n**AMKR –** Long $23.44 (8:39am) / Closed at $22.38 (10:06am) – *Loss of $1.06*\n\nWelcome to the first bag-holder of the day section of this update. Although I do not mind holding this bag – **RCL**. The stock is very bearish, weak against **SPY** on the daily chart, but for some reason found some late day strength. I am staying with this trade until it turns green because it will.\n\n**RCL –** Short $73.23 (10:04am) / Still holding – Stock currently at $74.21\n\nWe are not done with the bag-holders – so here is another one – **UNH.** Once again, I do not mind this one. Great response to earnings, through resistance and closing in on its all-time-high, which means there are not many traders holding bags on this ticker, except me of course.\n\n**UNH –** Long $421.30 – Calls (10:24am) / Still holding – Stock currently at $420.05\n\n*Add some, lose some – decided to get rid of one of my losers from the other day,* ***WHLM****, which I average to $6.70 (10:28am) and then finally closed it.* *Loss - .95 cents* \n\nHere is the trade of the day! **CIDM!!**\n\n**CIDM –** Long $1.44 (10:30am) / Scratched at $1.44 (10:30am)\n\nMoved on from the pudding, now I am eyeing a bag of marshmallows, Mandy is on repeat, things are getting dark again. And what do we do when things get dark? **TSLA!**\n\n**TSLA –** Short $644.21 - Puts (10:32am) / Closed $638.70 (11:02am) – *Profit $4.85 per contract*\n\nLooking for a short, I find **COIN**, sorry Aunt Cathie but your stock is looking sad. Sure, I am holding it, but like the other two, I do not mind, because **COIN** is bearish, and *extremely* weak to the market. **SPY** could be way up tomorrow, and **COIN** will still be red. \n\n**COIN –** Short $220.66 (10:44am) / Still Holding – Stock currently at $224.63\n\nHopped up on Snack Packs I needed a trade to bring me back down to earth, so that says **HD** to me! Maybe I’ll look at **BBBY** next, who knows, *I don’t know if I’ll have that kind of time!* Strong against SPY? Check. Good volume? Check. Looking to break out of Daily compression? Sure, why not.\n\n**HD –** Long $322.15 - Calls (11:06am) / Closed $322.65 – *Profit $.50 per contract.*\n\n*Managed to scratch BBIG (11:13am) from Tuesday, and of course it ran up right after I scratched it.*\n\nFor some reason I thought I needed to short more cruise ships, which is stupid, because why would anyone have two cruise stocks at the same time? Well, you ignore basic cruise duplication rule, you pay the price. I did.\n\n**NCLH –** Short 23.80 (11:38am) / Closed at $24.20 (11:56am) – *Loss of .40 cents per share.*\n\nMy favorite stock to short is **AMZN**. I love using it as a hedge, and I love seeing it go down. It isn’t like I have something against **AMZN**, I don’t, I use them all the time actually. I just like shorting it, so when I can, I will – and I could, and I did.\n\n**AMZN –** Short $3636.99 (11:55am) / Closed at $3626.30 (12:45pm) – *Profit of $7.80 per contract.*\n\nAs the day began to wind down, I was able to take advantage of a play I missed earlier. And I missed it because I was screwing around with those cheap ass stocks while wallowing in my chocolate pudding! I did not miss it this time. **SAVA** was weak against the market all day, has a clear HA reversal on the daily charts, and a long way to go before it hits any kind of support.\n\n**SAVA –** Short $83.18 (12:26pm) / Closed at $81.78 (12:42pm) – *Profit of $1.40 per contract.*\n\nNaturally, I couldn’t help myself and took **VERB** again, but I really do like the stock and plan on holding it. I know, I know, don’t get attached, right? But I dunno, there’s something about **VERB**…..\n\n**VERB –** Long $3.21 (12:47pm) / Still Holding – Stock currently at $3.26\n\nI also jumped back into **RCAT**, I just felt it had more to give after I let it go so quickly before. Quick scalp to end the day.\n\n**RCAT –** Long $5.03 (12:48pm) / Closed at $5.11 (12:50pm) – *Profit of .08 cents per share.*\n\n***AAL*** *(12:47pm) – it was time to let it go.* *No reason other than I still had way too many positions on.* *Loss - .90 cents a share.*\n\n***TPST,*** *I averaged down to a cost per share of $20.84, and it ended the day with a nice run, hoping to close this tomorrow.* \n\n***NEGG,*** *I averaged down to a cost per share of $29.74, and it ended the day not doing a damn thing, but I plan on holding this until it pops back up again.*\n\n***In After Hours, I did two trades:***\n\n**FUBO –** Long $27.21 (1:13pm/1:30pm) / Closed at $27.38 (1:52pm) – *Profit of .17 cents per share.*\n\n**MRNA –** Long $274.63 (2:24pm, 2:31pm, 2:44pm) / Closed at $275.63 (3:22pm) – *Profit of $1 per share.*\n\n***And I took the loss in HUSA for a .29 cent and TPST for $1.40 a share.***\n\n***For today:***\n\n*Wins:* ***12***\n\n*Losses:* ***3***\n\n*Scratches:* ***1***\n\n*Holds:* ***4***\n\n***For the past three days:***\n\n*Wins:* ***33***\n\n*Losses:* ***10***\n\n*Scratches:* ***11***\n\n*Holds:* ***8***\n\n***Profit:***\n\n*On Day 1 (Tuesday) my overall profit was:* ***1.3%***\n\n*On Day 2 (Wednesday) my overall profit was:* ***.8%***\n\n*Today my overall profit was:* ***2.8%*** \n\n***Current Holds:***\n\n**ATOS (long) - $6.46,** currently at $**5.67 –** ***down .69 cents per share.*** ***Mental Stop - $5.25***\n\n**RCL (short) - $73.23,** currently at **$74.21 –** ***down .98 cents per share, Mental Stop - $76.05***\n\n**UNH (long) - $421.30**, currently at **$420.05 –** ***down $1.25 per share, Mental Stop - $415.95***\n\n**COIN (short) - $220.66,** currently at **$224.63 –** ***down $3.97 per share, Mental Stop - $229.25***\n\n**VERB (long) - $3.21,** currently at **$3.26 –** ***up .05 cents per share, Mental Stop - $2.75***\n\n**NEGG (long) - $29.84,** currently at **$26.20 –** ***down $3.64 per share, Mental Stop - $19.75***\n\n**CRTD (long) - $5.03,** currently at **$3.50 -** ***down $1.53 per share, Mental Stop - $3.30***\n\n**WORX (long) - $3.68,** currently at **$2.41 –** ***down $1.27 per share, Mental Stop - $2.35*** \n\n**OSTK (long) - $102.05,** currently at *$****86.33 – down $15.72 per share, Mental Stop – None\\**** \n\n*\\*these are ITM calls that expire in August.*\n\n***I also have AMZN puts, PFE calls, and a useless AVGO Call Debit Spread that will expire tomorrow at Max Loss.***\n\n*Keep in mind, I trade for a living, therefore the “numbers” I care most about are the monthly averages for:*\n\n***Win Rate %, # of Trades Per Day and Profit Per Trade***\n\nEvery Professional Day Trader is different, some have a lower number of trades a day, but a much higher average profit for example. However, *Win Rate* typically needs to be above 80%, which is a consistent benchmark for everyone that depends on Day Trading for a living.\n\nTrade Well!",
        "subreddit": "wallstreetbets",
        "title": "How to Day Trade Like a Crazy Person",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ol4pm0/how_to_day_trade_like_a_crazy_person/",
        "created": 1626420920.0
    },
    {
        "author": "SavannahSmiles_",
        "created_utc": 1626354949,
        "id": "oksm90",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " [Chipmakers Like Nvidia Will Benefit from Taiwan Semiconductor's Strong Earnings - TheStreet](https://www.thestreet.com/investing/taiwan-semiconductor-tsm-earnings-nvidia-amd-apple-071521) \n\n [**M. COREY GOLDMAN**](https://www.thestreet.com/author/m-corey-goldman) \n\n JUL 15, 2021 6:55 AM EDT \n\nChip and graphics card makers including Nvidia  ([**NVDA**](https://www.thestreet.com/quote/nvda)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=NVDA), Applied Materials  ([**AMAT**](https://www.thestreet.com/quote/amat)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=AMAT) and Advanced Micro Devices  ([**AMD**](https://www.thestreet.com/quote/amd)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=AMD) are set to benefit from Taiwan Semiconductor’s  ([**TSM**](https://www.thestreet.com/quote/tsm)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=TSM) ongoing strong momentum, which has been driven by tight supply in the semiconductor market due to the ongoing chip shortage.\n\nTaiwan Semiconductor on Thursday [said it expects sales to rise more than 20% in 2021](https://www.thestreet.com/investing/dow-futures-dip-as-powell-tweaks-growth-concern-tech-stocks-gain), affirming its crucial role in helping alleviate a global chip shortage that’s slammed production of everything from cars and trucks to dishwashers and toys.\n\nTaiwan Semiconductor CEO C.C. Wei said the company expects semiconductor supply to remain tight into 2022, though it will ramp up production of microcontrollers by close to 60%, which will at least help reduce the chip shortage for its automobile clients, which include the likes of Ford  ([**F**](https://www.thestreet.com/quote/f)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=F), Tesla  ([**TSLA**](https://www.thestreet.com/quote/tsla)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=TSLA) and others.\n\nRevenue in the current quarter is expected to rise to between $14.6 billion and $14.9 billion, in line with the $14.7 billion average of analyst estimates. TSMC’s 2021 sales outlook is expected to surpass earlier estimates of 20% growth in full-year sales. \n\n That, in turn, is expected to benefit the likes of Apple  ([**AAPL**](https://www.thestreet.com/quote/aapl)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=AAPL), one of Taiwan Semiconductor’s biggest partners, as well as the likes of Nvidia, Applied Materials and AMD, [which could ride the coattails of continued strong semi demand and higher prices](https://www.thestreet.com/investing/chipmakers-taiwan-semiconductor-production-micron-nvidia-amd). \n\n “You know what is tiresome? The temporary decline of semis for no real reason just causes such angst as opposed to buying,” TheStreet’s Jim Cramer [noted in a recent Real Money column](https://realmoney.thestreet.com/jim-cramer/jim-cramer-there-s-no-real-reason-why-the-semi-s-have-declined-15707510?puc=tst_sfi). This fabulous group is a ball of confusion until you look where they come from.” \n\n Indeed, main chip and graphics cards makers as well as other semiconductor producers will continue to benefit from demand, particularly in computers and electronics, which Cramer noted make both semi makers and other peripheral computing equipment makers like Texas Instruments  ([**TXN**](https://www.thestreet.com/quote/txn)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=TXN), Analog Devices  ([**ADI**](https://www.thestreet.com/quote/adi)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=ADI), Broadcom  ([**AVGO**](https://www.thestreet.com/quote/avgo)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=AVGO) and Marvell Tech  ([**MRVL**](https://www.thestreet.com/quote/mrvl)) - [Get Report](https://secure2.thestreet.com/cap/prm.do?OID=033365&amp;ticker=MRVL) strong potential growth candidates.\n\nAnd not just lack of supply: Nvidia, which has been pegged a cryptocurrency play due its graphics cards being the equipment of choice for mining Ethereum, longer-term demand for advanced gaming, graphics and \"gamification\" of real-life applications used by consumers and businesses [make Nvidia an undervalued play](https://realmoney.thestreet.com/investing/stocks/jim-cramer-what-q2-s-strongest-stocks-tell-us-about-this-bull-market-15702829), Cramer said. \n\n\"Only one stock could possibly be called a perennial and that's the first and most obvious one, Nvidia, the artificial intelligence gaming platform company, two of the multiple ways I could have chosen to describe it.\"\n\nSeparately, Mizuho Securities on Thursday raised its one-year price target on Nvidia to $900 from $710. At last check, shares of Nvidia were up 0.15% at $794.85 in premarket trading.",
        "subreddit": "StockMarket",
        "title": "Chipmakers Like Nvidia Set to Ride Taiwan Semi's Coattails After Strong Earnings",
        "url": "https://www.reddit.com/r/StockMarket/comments/oksm90/chipmakers_like_nvidia_set_to_ride_taiwan_semis/",
        "created": 1626383749.0
    },
    {
        "author": "LittleManStan1",
        "created_utc": 1626104504,
        "id": "oitup9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "Broadcom in Talks to Buy Software Firm SAS",
        "url": "https://www.wsj.com/articles/broadcom-in-talks-to-buy-software-firm-sas-11626103731",
        "created": 1626133304.0
    },
    {
        "author": "thyxxes",
        "created_utc": 1626312802,
        "id": "okijjp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "MMAT the semi-conductor company!\n\nJust to show some other semi-conductor stocks!———————————————-\n\n1. TSM.    ($124.39)\n2. AVGO  ( $481.59)\n3. NVDA. ($793.66)\n4. ASML. ($716.51)\n5. AMD.   ($89.05)\n6. MU.     ($78.49)\n7. NXDI.  ($203.55)\n8. KLAC. ($309.12)\n\nYES the future is bright for MMAT but their could be a massive rip Thursday and Friday! \n\nYES tomorrow is a big cataclyst for this stock just with the “Virtual Investor Meeting” get in right at open and SLAP that ask!!!\n\nYES TESLA has bought 18M+ shares which was finalized Monday of this week!!!\n\nYES the owner/founder/chairman owns over 10% of the company, while his spouse owns about 5% as well! \n\nYES META is a unicorn stock and will perform as such!!!\n\nYES everyone should be JACKED TO THE TITS about this company!!!\n\nSee you all tomorrow at the bell!!🔔        \n\n*slap that ask*\n\n🦄🦄🍇🍇🦄🦄🏹🧨🦄🦄🍇🍇🦄🦄",
        "subreddit": "wallstreetbets",
        "title": "MMAT hype!!!! 🦄🦄🦄🦄🦄",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/okijjp/mmat_hype/",
        "created": 1626341602.0
    },
    {
        "author": "thyxxes",
        "created_utc": 1626312172,
        "id": "okid81",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Just to show some other semi-conductor stocks\n\n1. TSM.    ($124.39)\n2. AVGO  ( $481.59)\n3. NVDA. ($793.66)\n4. ASML. ($716.51)\n5. AMD.   ($89.05)\n6. MU.     ($78.49)\n7. NXDI.  ($203.55)\n8. KLAC. ($309.12)\n\nYes the future is bright for MMAT, tomorrow is a big cataclyst get in at right at open and SLAP that ask! Everyone should be JACKED TO THE TITS about this company! See you all tomorrow at the 🔔 \n\n🦄🦄🍇🍇🍇🦄🦄🦄🦄🏹🧨🧨",
        "subreddit": "wallstreetbets",
        "title": "MMAT the semi-conductor company!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/okid81/mmat_the_semiconductor_company/",
        "created": 1626340972.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1625257389,
        "id": "ocil6y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, July 2, 2021**\n\nStocks rose once again, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) both recording new intraday highs amid the continued push by technology stocks. The Dow Jones (DIA) rose as well, but continued to lag behind the other two indexes. Market participants are encouraged by the June Jobs Report, which showed payroll gains rise more than expected. \n\nToday, the US Department of Labor released the Job June report, which showed a stronger-than-expected acceleration in hiring, with non-farm payrolls rising by 850,000, the sixth straight month of gains. The unemployment rate however, ticked slightly higher to 5.9%. Here are the numbers\n\n* **Change in non-farm payrolls:** 850,000 vs. 720,000 expected and an upwardly revised 583,000 in May\n* **Unemployment rate:** 5.9% vs. 5.6% expected and 5.8% in May \n* **Average hourly earnings, month-over-month:** 0.3% vs. 0.3% expected and a downwardly revised 0.4% in May\n* **Average hourly earnings, year-over-year:** 3.6% vs. 3.6% expected and a downwardly revised 1.9% in May\n\nPresident Biden said of the report, “This is historic progress, pulling our economy out of the worst crisis in 100 years, driven in part by our dramatic progress in vaccinating our nation and beating back the pandemic. Today, the US is the only major advanced economy where the OECD (Organization for Economic Cooperation and Development) projections of future output are higher today than they were in January 2020 before the pandemic hit.”\n\nEmily Roland, co-Chief Investment Strategist at John Hancock Investment Management said of the report, “This is the Goldilocks Report that the market was looking for today. You had a nice print here of 850,000 jobs being added, wage pressure remaining – I wouldn't call them necessarily contained – but surprising here on the downside versus consensus estimates. So this is telling us right now that economic growth is continuing to accelerate here, the jobs market is continuing to heal. We're making progress here in terms of what the Fed has set out to do, which is in order to get unemployment down, they're going to let inflation run a little bit hot here. Not too hot, not too cold – this is just what the market wants.\"\n\nThis Job Report will give market participants a better idea as to the timing of the Federal Reserve’s next monetary policy. For now, the Fed has so far kept in place both of its key pandemic-era policies - quantitative easing at a clip of $120 billion a month and near-zero interest rates. However, the Fed has consistently said they are looking for a “string” of strong jobs reports, like the one this month before any adjustments to the current policy is made. If the Jobs Report continues being especially strong in the months ahead, it could force the Fed to taper quantitative easing earlier than originally telegraphed. I have said  before in the past I expect the Fed to begin tapering QE towards the end of the year and am not worried about that at all. For starters, the market has historically reacted very little to changes in QE ([see the 2013 Taper Tantrum here)](https://www.investopedia.com/terms/t/taper-tantrum.asp), it’s changes in the interest rate that really drive the market, and second, the Fed is expected to taper slowly, making any changes gradual.\n\n**Highlights**\n\n* Shares of AMC pulled back slightly after financial firm Iceberg Research announced they have opened a short position. Honestly, I have no idea why they did this, only opening themselves up to becoming WSB's next target. Will be interesting to see what happens moving forward.\n* More bad news for Lordstown Motors, who have already been the subject of a short report that saw the company admit they had inflated the importance of preorders for the electric pickup truck and forced the CEO to leave. Now, the Justice Department has announced it is opening a probe into the company to investigate comments made by executives and the way the company represented its pre orders to shareholders. The whole EV market was down today in sympathy. \n* Tesla (TSLA) recorded its fifth straight quarter of vehicle delivery growth. In Q2, the company delivered 201,250 vehicles, missing expectations for 204,160, according to Bloomberg consensus data**,** but more than double the 90,891 vehicles delivered in the same period a year ago.\n* The U.S. Federal Trade Commission filed a proposed consent order to settle antitrust charges against semiconductor maker Broadcom Inc, the agency said in a statement on Friday. The consent order requires Broadcom to stop demanding that its customers buy components mostly or only from Broadcom. The company responded, “While we disagree that our actions violated the law and disagree with the FTC’s characterizations of our business, we look forward to putting this matter behind us.\"\n* Jeff Bezos is officially stepping down as Amazon CEO on Monday. Amazon Web Services CEO Andy Jassey will be taking over for him. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Anthem (ANTM) target raised by Morgan Stanley from $454 to $459. Stock currently around $387\n* Capital One (COF) with two target raises. Stock currently around $157\n   * Piper Sandler from $175 to $182 \n   * Credit Suisse from $175 to $182\n* Enphase Energy (ENPH) target raised by Goldman Sachs from $187 to $202 at Buy. Stock currently around $186\n* GoodRx (GDRX) target raised by Morgan Stanley from $36 to $38. Stock currently around $33.8\n* JD.com (JD) target raised by Goldman Sachs from $119 to $130 at Conviction-Buy. Stock currently around $76\n* Eli Lilly (LLY) target raised by Truist Securities from $225 to $262 at Buy. Stock currently around $234\n* SolarEdge Technologies (SEDG) target raised by Goldman Sachs from $290 to $322 at Buy. Stock currently around $277\n* Xpeng (XPEV) target raised by Citigroup from $50 to $56.30 at Buy. Stock currently around $44\n* Zscaler (ZS) target raised by BTIG Research from $240 to $253 at Buy. Stock currently around $214\n\n“To bear trials with a calm mind robs misfortune of its strength and burden”. — Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, July 2, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/ocil6y/here_is_a_market_recap_for_today_friday_july_2/",
        "created": 1625286189.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625146568,
        "id": "oblzj8",
        "num_comments": 89,
        "num_crossposts": 0,
        "selftext": "Posting here to offer a little perspective on what some apes saw as a quick hype play.\n\nIt was evident that PSFE had finally found bottom last week after months of daily short attacks.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE long-term.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for the diamond handed apes who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\nhttps://preview.redd.it/1axvo1n3sl871.png?width=475&amp;format=png&amp;auto=webp&amp;s=ca4bb0678156d9737029ff6a3075728bd54e8940\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n&amp;#x200B;\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) see fintel or other source for institutional ownership. (bot mods won't allow link)\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)   [https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi](https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi)\n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "wallstreetbets",
        "title": "My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oblzj8/my_highconviction_bet_on_paysafe_psfe/",
        "created": 1625175368.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625147803,
        "id": "obmdbu",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "It was evident that PSFE had finally found bottom last week.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE for a long time.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for investors with a longer view who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) [https://fintel.io/so/us/psfe](https://fintel.io/so/us/psfe).\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)  Global Capital link removed due to forbidden word in the url. \n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "stocks",
        "title": "Connecting the Dots: My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/stocks/comments/obmdbu/connecting_the_dots_my_highconviction_bet_on/",
        "created": 1625176603.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1625145621,
        "id": "oblp63",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Posting here to offer a little perspective on what some apes saw as a quick hype play.\n\nIt was evident that PSFE had finally found bottom last week after months of daily short attacks.  For months, we saw all the tell-tale signs of market manipulators expertly shaking out retail shareholders with order flow, short volume, massive block trades and 13F’s showing institutions steadily loading up.  In this context, just as PSFE was to be officially added to the Russell 1000 and 3000 indexes, it seemed a little suspicious that Paysafe was suddenly being hyped and trending on WallStreetBets.  I had to wonder if this was an engineered event to generate more liquidity since market makers were clearly running out of sellers right when they had to fill a lot more institutional orders.\n\nThat’s all just monkey brain theory that ultimately doesn't matter because my plan is to hold PSFE long-term.  There is a clear strategy with this company that will take some time to come to fruition and I want to be in on the ground floor, before all the rosy ER’s come in.  With a fintech that does roughly as much transactional volume as Square and, despite recent reports, has similar growth to PayPal, it’s no surprise that institutions want to accumulate at levels so low that the stock is almost completely de-risked from a long-term perspective.\n\nThe comprehensive DD below is for the diamond handed apes who may have been caught in the recent hype. Know that you’re not alone. We saw the same thing right after CNBC’s Jim Cramer called Paysafe, “the ultimate stock for this moment” and market analyst Steve Grasso repeated his calls for it go to “$45/$50 and then settle in before moving higher from there.”  After initial spikes, deep-pocketed short-sellers methodically crushed retail holders, eventually bringing the price down to where it was last week.\n\nBut informed short sellers knew they couldn't push too far because that price was really not far from the price paid by noted fund managers like Dan Loeb (Third Point 41.5 million shares), David Tepper (Appaloosa Management, 10 million shares), Aaron Cohen (Survetta Capital, 13 million shares), Dipanjan Deb (Francisco Partners, 20 million shares) and Leon Cooperman (personally owns 1.1 million shares).  A price probably lower than paid by Wells Fargo’s several funds (12 million shares) and even by Blackstone when they raised their initial stake of 123 million shares to a total of 160 million shares.^(1)  Also, it’s worth noting that, since they all decided to invest, Paysafe has created significant value including securing new revenue streams in the US iGaming market and expanded partnerships with Coinbase, ESL Gaming, Luckbox, and Microsoft among others. ^(2)\n\nWith a presence in 120 countries, Paysafe is an extremely diversified global payment processor: #1 global leader in iGaming, #2 global digital wallet, #4 globally in integrated merchant processing. Ever since private equity groups Blackstone and CVC took Paysafe private, they’ve been going through a major restructuring to reduce risk, increase margins and profits. It's because they are still very much in the middle of that process that I like it so much as an investment opportunity. Here are a few key points:\n\n&amp;#x200B;\n\n* In 2017, private equity groups Blackstone and CVC raised their bid five times to ultimately to take Paysafe private for $3.9 billion.^(3)  Blackstone says their typical investment term is “upwards of 7-10 years” ^(4) which aligns with the investment time-frame implied by an inside source close to those negotiations who said, “There is a fundamental change in the way we pay for goods and services, away from the cash and cheques of our parents’ age,” adding that the private equity firms “have a decade-long thesis that this shift will only grow and grow and they want to get in now.” ^(5)\n* Under Blackstone/CVC’s stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion (28% CAGR pre-Covid). Last year, due to Covid-related brick-and-mortar business and sporting event closures, along with their long-standing strategic decision to exit specific high-risk Asian revenue channels, 2020 revenue stagnated.  This is the reason they recently reported only 5% YoY quarterly growth.  In their Q1 ER, management noted that, without those channel exits they would have reported growth in the “mid to high teens.”  But even if you include 2020’s stagnant growth, their overall revenue growth since 2017 was still 18% CAGR. This is roughly the same as PayPal’s current projected growth. ^(6,7)\n* A few months ago, Paysafe was brought public through a reverse merger transaction with acclaimed deal maker Bill Foley, Chairman of Fidelity. The deal paid down $1.2 billion in debt and gave Blackstone/CVC about $5.6 billion in cash and shares.^(8)  The fact that Blackstone's recent 13F shows they bought back 37 million shares, combined with statements from them and Paysafe's board, indicates that they did this deal, not for a mere 44% gain on a four year investment, but because Bill Foley is an extraordinarily successful and well-connected deal maker who has a proven track record for generating exponential growth.\n* Inorganic growth through M&amp;A is a major pillar of Paysafe’s strategy going forward.  Bill Foley, now Chairman of Paysafe and a major shareholder, is a proven M&amp;A synergy wizard, particularly in the financial services arena.  Foley took Fidelity National Financial from $3 million market cap to $10.8 billion. Yeah, that’s and “m” and a “b”.  Over just the last five years, Foley grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B).  Through his proven M&amp;A playbook, Foley also grew FIS from $2.5 billion to over $91 billion market cap. That’s a 36x return.  He says  “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” ^(6,9)\n\n**Deleveraging, increasing margins and profit**\n\n* Paysafe recently confirmed they are on track to meet 2021 projections of $1.53 billion in revenue, $930-$970 million in gross profit, double-digit growth and expanding 30-35% EBITDA margins, and $103 billion in transactional volume.  Paysafe’s already strong $362 million in 2020 free cash flow was reported to be on track for 29% growth in 2021.  Notably, their multi-year projections don’t include growth from their \"active M&amp;A pipeline\" and their ongoing US iGaming expansion (projected at 55% CAGR).\n* Q1's earnings disappointed some because, as part of their restructuring, they had $90 million in one-time non-recurring expenses associated with the merger and paying down $1.2 billion in debt. The company noted: “Results included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\"\n* Take away the $90 million in one-time expenses and, rather than reporting a $49 million loss, the company would have reported $41 million in quarterly net profit, thereby beating all analyst estimates. All signs indicate they are on track to beat estimates going forward, although I have noticed a few platforms raising those estimates recently.\n* In addition to paying down $1.2 billion in debt, an improved Moody’s credit rating has enabled the company to refinance roughly a billion at a 1.25% lower interest rate, with an option to reduce it another 25bp.^(10)  Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”  Notably, this Debt/EBITDA ratio is far better than the majority of their fintech peers, and the resulting improved margins stand to make it better still.\n* The combined effect of overall recent debt management will be a savings of around $92 million annually.  This secures higher margins, increased cash for M&amp;A and higher profits which, in my view, will lead to raised price targets and positive price action catalysts.\n* As part of their restructuring to cut down on operating expenses and further increase margins, Paysafe has recently forged agreements with Snowflake and AWS as they move to cloud-based integration for easier migration between their platforms, easier cross-border payments and planned expansion into global banking as a service, having identified a $58 trillion TAM.\n\n**Highly competitve**\n\n* Unlike other payment processors, Paysafecard enables those without basic ID metrics, credit cards, or even bank accounts (the 1.7 billion “unbanked” globally) to engage in eCommerce in over 50 countries. This segment grew 63% YoY.  Just today, Microsoft introduced Payesafecard to its Xbox platform in 22 countries.\n* In various segments, Paysafe has recently expanded their partnerships with FOX bet, Roblox, Fortnight, Coinbase, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Draftkings, Spotify, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, BetMGM, Ceasar’s, and Pointsbet among many others.\n* \\#4 globally in integrated merchant processing, Paysafe’s proprietary scalable electronic payment platform was voted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method.”\n* They are #2 globally in the digital wallet space with a presence in 120 countries. They own Neteller and Skrill, which was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n* People are usually more likely to leave reviews when a payment platform doesn’t meet their expectations. That said, Trustpilot rates Paysafecard as “Excellent” (4.7/5 stars-31,981 reviews), Paysafe’s digital wallet Skrill as “great” (4.1/5 stars-18,037 reviews) and Skrill Money Transfer as Excellent (4.8/5 stars - 8,349 reviews). ^(11)\n   * By contrast, Truspilot rates Stripe as “Average 3.4/5 stars- 6,208 reviews), Venmo as “bad” (1.2/5 starts - 222 reveiews), Zelle as “bad” (1.2/5 stars - 326 reviews) and PayPal as \"bad\" (1.2/5 stars-18,555 reviews). ^(12)\n\nhttps://preview.redd.it/2tce80abpl871.png?width=475&amp;format=png&amp;auto=webp&amp;s=32e78dde014d5edf387cd4f9f603fceb6ab6c4c7\n\n&amp;#x200B;\n\n**“At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”**\n\n**“It’s our job to be there first and to make sure we dominate.\"** \\- Bill Foley\n\n&amp;#x200B;\n\n* Paysafe is the #1 global leader in iGaming payment processing, a space that is extremely difficult to enter, due to managing risk and a very complex regulatory landscape. Paysafe’s advantage here is a large aspect of its MOAT, as discussed below.  Paysafe is often an integrated back-end payment processor so most don’t realize they are using it but they are already integrated with 75% of all US iGaming operators. Paysafe is actively laying the groundwork for their US expansion in the wake of a US Supreme Court decision allowing state-legalized sports betting.\n* Bill Foley says, \"It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else…we’re seeding the future growth right now by state and by operator... The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective... I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody... We’ve got a wide landscape we can attack. It’s pretty exciting”\n* In his letter to investors, fund manager Dan Loeb said, “We believe the US is poised to become the largest online gambling market globally as it begins to deregulate state by state and Paysafe is exceptionally positioned to capitalize as the global market leader.”\n* Compass Point analyst Michael Del Grosso, who initiated coverage with a $19 price target, noted, “PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States,” adding, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.” ^(13)\n   * Recent headlines since Del Grasso wrote that:\n      * \"New York State Legalizes Online Sports Wagering\"\n      * \"Maryland Online Sports Betting Bill Passes Legislature\"\n      * “New Hampshire sports betting deal approved overwhelmingly; Hogan likely to sign\"\n      * \"Arizona governor signs bill legalizing sports betting\"\n      * \"Wyoming Legalizes Sports Betting\"\n      * ”Delaware igaming revenue up 74.3% year-on-year in March\"\n      * \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n      * “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n      * “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n      * “Ohio legislators doubling down on legalized sports gambling”\n      * “Louisiana Begins The Process of Legalized Sports Betting”\n      * “Path to legalized Texas sports betting becomes more clear”\n      * “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n      * “Florida poised to offer sports betting under major gambling deal”\n      * “Legal Sports Betting Could Get To California Sooner Than You Think”\n      * “Canada legalizes single-game sports betting”\n\n&amp;#x200B;\n\n* Every analyst covering Paysafe rates it as a \"Buy\". A few quotes :\n   * RBC Capital 5-star analyst Daniel Perlin: “We believe PSFE offers a unique combination of digital wallet capabilities, accelerated cash conversion for consumers who would otherwise be out of the ecommrece loop, and integrated payments, all focused on specialized &amp; complex end-markets, which creates a competitive moat and pricing power.” “recent underperformance is largely due to the complex nature of PSFE’s business and the FTAC II transaction” and adds his view that Paysafe offers one of the best combinations of services in online payment space: “PSFE has created a unique two-sided network enabling merchants to accept online &amp; in-store payments (in specific niche verticals), while also offering consumers a digital wallet &amp; eCash solution, which converts cash-heavy users to digital users. We believe it’s this combination that enables PSFE to generate superior take rate economics vs. peers.” ^(14)\n   * BMO Capital, 5-star analyst, James Fotheringham: “PSFE is a global leader in iGaming (online betting related to sports, poker, and other casino games, as well as lotteries and bingo). Indeed, 36% of PSFE’s revenues are from global iGaming. That is far more than for any of its peers.” iGaming deposit volumes in the U.S. will grow “at more than five times the rate of growth elsewhere in the world” with a \"5-year CAGR (compound annual growth rate) of between 40% to 55%.\" ^(15)\n   * Evercore ISI analyst David Togut 'praised Paysafe for its “robust risk management operation,” and its high rankings in several key performance indictors globally, including cash network, stored digital wallet value, and amount of partnered independent merchants.' ^(16)\n\n&amp;#x200B;\n\n**MOAT:**  **“robust risk management operation”**\n\nSo why does Paysafe dominate iGaming and why how is it able offer eCommerce services to the 1.7 billion globally who can't even manage to have bank accounts or credit cards?\n\nTheir industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant or unwilling to enter. CEO Philip McHugh from transcript : “When we talk about a deep and a wide MOAT, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem. We bring unique ways to pay and access funds that a typical card processor certainly can’t do. When you have that two-sided network, you change the conversation. When we speak to some of our largest iGaming customers, we’re not only talking about take rates and comps, we’re talking about revenue-generation, we’re talking about attracting the types of customers that they want and they need in their ecosystem. That’s a really, really powerful position to have.” ^(9)\n\n&amp;#x200B;\n\n**Valuation:**\n\nA while back I looked at a basket of fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign.\n\n* Paysafe reports 30%+ EBITDA margin,  mid to high teen EBITDA growth, and $362 million in free cash flow (now on track to increase 29%),\n* By comparison, a third of the peer group reported negative EBITDA, half reported negative EBITDA growth, and a third negative free cash flow.\n* Paysafe also has better EPS than over half the group and better Debt/EBITDA ratio than 3/4 of them.\n* The group's collective growth rate of \\~12.5% is in the range of Paysafe's 10-13% projections but the company's estimates may be intentionally conservative as they do not take into account their current expansion into US iGaming nor do they factor in their \"active M&amp;A pipeline.\"  Foley is apparently known for under-promising and over-performing.\n* As noted above, Paysafe was growing 28% CAGR pre-Covid, but taking into account last years slow down due to Covid-related business closures and strategic channel exits, it grew at 18% CAGR, a rate on par with PayPal's projected growth.\n\nGiven all the above factors, it seems fair to look at Paysafe's potential price based on an average of peer multiples:\n\nPaysafe’s share price with average of sector peer multiples:\n\n* EV/EBITDA ratio : $122.09\n* EV/Rev ratio : $83.91\n* EV/FCF ratio : $87.86\n\nAverage: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\n* EV/EBITDA ratio : **$50.75**\n* EV/Rev ratio : **$44.64**\n* EV/FCF ratio : **$44.18**\n\n**Average : $46.52**\n\nIn a nutshell, the basket of sector peers has an average growth within Paysafe’s conservative projections yet they trade at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate. Either the entire field has to come down or Paysafe has to go up.  While I don't necessarily agree with his time frame, market analyst Steve Grasso's call for \"$45/55\" may actually be quite reasonable.\n\n&amp;#x200B;\n\n**Sources:**\n\n(1) [https://fintel.io/so/us/psfe](https://fintel.io/so/us/psfe).\n\n(2) [https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes\\_value\\_creation\\_trajectory\\_is\\_very\\_much/](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/)\n\n(3) [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(4) [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(5) [https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN](https://www.reuters.com/article/us-paysafe-group-m-a-idUSKBN1AK0KN)\n\n(6) [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(7) [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(8) [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(9)  [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311837/d18843d425.htm)\n\n(10)   [https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi](https://www.globalcapital.com/article/b1s344yyc1zccx/paysafe-preps-post-spac-refi)\n\n(11) [https://www.trustpilot.com/review/www.paysafecard.com](https://www.trustpilot.com/review/www.paysafecard.com)\n\n(12) [https://www.trustpilot.com/review/www.paypal.com](https://www.trustpilot.com/review/www.paypal.com)\n\n(13)  [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(14) [https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04](https://www.nasdaq.com/articles/billionaire-david-tepper-places-bet-on-3-strong-buy-stocks-2021-06-04)\n\n(15) [https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/](https://themoneymanifesto.com/2021/06/21/paysafe-is-ready-to-ride-the-igaming-wave-analyst-says-buy/)\n\n(16) [https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html](https://finance.yahoo.com/news/paysafe-poised-profit-085250018.html)",
        "subreddit": "wallstreetbets",
        "title": "My High-Conviction Bet on Paysafe (PSFE)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oblp63/my_highconviction_bet_on_paysafe_psfe/",
        "created": 1625174421.0
    }
]