[
    {
        "author": "psychotrader00",
        "created_utc": 1624306625,
        "id": "o54evi",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, June 21, 2021**\n\n***Please Note:*** *Hello friends! If you were wondering where the Daily Market has been the last two weeks, I have had a great few months in the market and decided, now that I am fully vaccinated and the US is reopening, to go on vacation to New York (I live in California). I am now back home and ready to get back to the regular schedule! The Recap will be posted every day again from now on.*\n\nStocks jumped today, with the three major indexes rising, looking to recover the losses after the volatility experienced last week after the Federal Reserve’s outlook was announced. If anything, last week’s volatility shows us that the game of tug-of-war between inflationary pressures spooking investors and the Federal Reserve reiterating it will maintain accommodative policies in place for the foreseeable future continues. As I have said in the past, while I acknowledge the risk posed by the elevated inflation readings, I too believe any pressure is transitory and remain extremely bullish moving forward. \n\nThe Federal Reserve in the United States has a dual mandate: maintaining inflation stable and maximum employment. In light of the pandemic and surge in unemployment following lockdown, its maximum employment mandate has broadened. The measures and tools for achieving these mandates differ and have also changed recently. On the upside, the Fed now has additional flexibility in providing and maintaining accommodative monetary policies, namely near-zero interest rates and quantitative easing, to support the economy. The downside is that as the economy continues to improve, policies may stay loose for too long, leading to inflation and forcing the Fed to respond by aggressively raising interest rates, which would pretty much tank equities. In my view, this is the fundamental risk hanging over the market moving forward: Is the Fed misinterpreting inflationary readings as transitory? In my view, they are not. \n\nLast week, the spotlight was squarely on the Federal Reserve meeting, with market participants anxious to see how the Fed interprets and plans to react to the higher-than-expected inflationary readings. Analysts broadly expected the Fed to discuss a timeline for tapering its asset purchase program and a potential timeline for interest rate hikes. Instead, the Fed made no mention of a taper timeline and signaled they anticipate the first interest rate hike to occur in 2023. Overall, the report was very positive for equities, which is why the SPY so quickly recovered after an initial dump on Wednesday. \n\nIn my opinion,  it seems the Fed’s decision to leave out a “taper timeline” in the latest meeting reinforces the view consistently reiterated by the members of the Fed that current inflationary readings are “transitory” (meaning not permanent) and largely reflects factors caused by the coronavirus pandemic and the subsequent economic shutdown, such as global supply chain disruptions, materials shortages, and labor market imbalances. Moreover, I suspect Jerome Powell wants to avoid another “Taper Tantrum” like the one in 2013 and intends to be as clear as possible about the Fed’s expectations in order to avoid mixed messages (Read more about the 2013 Taper Tantrum [here,](https://www.investopedia.com/terms/t/taper-tantrum.asp) but basically markets freaked out after the Fed announced it was tapering quantitative easing passed during the 2008 recession since the economy had largely recovered by that point). In the end, the market kept going unabated, something I find very likely to happen again when the Fed inevitably announces they are tapering. In the end, I expect taper talks to begin towards the end of this year, but the lack of its mention in this Fed outlook meeting is an encouraging sign the Fed is not concerned about the elevated inflation readings. \n\nMoreover, the median projection among Fed officials is now for two rate hikes in 2023 despite the Fed raising inflation expectation for 2021, another sign the central bank remains unconcerned with the current levels of inflation. While the 2023 timeline is sooner than originally predicted, the two year timeline signals that the Fed will continue to move slowly and deliberately when considering any policy adjustment. \n\nLater this week, investors will receive the latest update on core personal consumption expenditures (PCE), which serves as the Fed's preferred gauge of inflation. The report due for release on Friday is expected to register a 3.4% year-on-year increase for May, marking the fastest jump since 1992, albeit while still reflecting \"base effects\" as prices rebound after last year's pandemic-induced collapse in prices across the board.\n\n**Highlights**\n\n* Amblin Partners, a movie studio headed by famed director Steven Spielberg, announced a partnership with Netflix (NFLX) to produce future films.  \n* Apple became the fourth major digital company to face closer scrutiny from Germany's antitrust watchdog on Monday after the cartel office said it had launched an investigation into whether the tech giant is exploiting its market position.\n* Goldman Sachs (GS) said in a note Monday that households were the largest source of equity demand in the first quarter of 2021 after generating net purchases of $172 billion. “We estimate that households currently allocate 44% of their assets to equities, slightly below the all-time high allocation of 46% in 2000. But high cash balances and continued retail participation in equity markets should bolster household equity demand.\" \n* EU antitrust regulators will decide by July 26 whether to clear a $30 billion bid by AerCap (AER) to buy the aircraft leasing business of General Electric (GE).\n* Bank of America (BAC) said oil may surge to $100 a barrel by next year as travel demand rebounds. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing price\\*\\***\n* Ameriprise Financial (AMP) target raised by Citigroup from $265 to $290 at Buy. Stock currently around $242\n* Chubb (CB) target raised by Citigroup from $187 to $190 at Buy. Stock currently around $159\n* ConocoPhillips (COP) with two target raises. Stock currently around $60.4\n   * Sanford C Bernstein from $63 to $80 at Outperform\n   * Mizuho from $73 to $82 at Buy\n* Edison International (EIX) target raised by Morgan Stanley from $72 to $73 at Equal-Weight. Stock currently around $56\n* Equitable (EQH) target raised by Citigroup from $38 to $41 at Buy. Stock currently around $30.3\n* Equinix (EQIX) target raised by BMO Capital Markets from $850 to $910 at Outperform. Stock currently around $823\n* Guardant Health (GH) target raised by Wells Fargo from $145 to $160 at Overweight. Stock currently around $120\n* Hess (HESS) target raised by Sanford C Bernstein from $91 to $120 at Outperform. Stock currently around $90.5\n* Jazz Pharmaceuticals (JAZZ) target raised by HC Wainwright from $212 to $220 at Buy. Stock currently around $178\n* Teradyne (TER) target raised by Evercose ISI from %160 to $175 at Outperform. Stock currently around $126\n* Occidental Petroleum (OXY) target raised by Mizuho from $36 to $37 at Buy. Stock currently around $29.5\n\n“Common sense is genius dressed in its working clothes.” —Ralph Waldo Emerson",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, June 21, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/o54evi/here_is_a_market_recap_for_today_monday_june_21/",
        "created": 1624335425.0
    },
    {
        "author": "Radlerson",
        "created_utc": 1623480012,
        "id": "ny0i4n",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "\nHello everyone, \n\nA friend of mine has asked me for my opinion on investing money. \n\nI said to invest in a low TER global etf. Meaning Devloped+Emerging markets and large - small cap. \n\nNow my question, he is an eco guy so I am searching for an esg fund. \n\nAny suggestions? \n\nI found the vanguard global all cap esg etf. \n\nIt includes all the caps and all the Markets. Also there’s would be no need for rebalancing due to it being only one fund. \n\nDo you think that one alone is diversified enough? \n\nIn my optimism it looks like a good investment vehicle for a long time, even though I am not sure how strict the esg criteria really is, can anybody shed a light on this maybe? \n\nI am even thinking for myself to swap my investments to that funds. 0.20% TER all cap global just looks so juicy because you don’t have to do anything but safe money and throw it in there. \n\nAm I missing anything? Is there something else that is important? \n\n\nCheers! Have a nice day!",
        "subreddit": "investing",
        "title": "NEW ESG VANGUARD ETF as single investment",
        "url": "https://www.reddit.com/r/investing/comments/ny0i4n/new_esg_vanguard_etf_as_single_investment/",
        "created": 1623508812.0
    },
    {
        "author": "dryhole",
        "created_utc": 1623663304,
        "id": "nziz3z",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Guys, I was looking to compare ETFs that are exactly the same except their dividends distribution policy. Accumulating do not pay dividends, they claim they buy more underlying stocks with the dividends they collect form their holdings and this should be reflected in their NAV over time. By NAV I understand their asking price when you buy them.\n\nI was comparing on justeft \n\n1. iShares Core EURO STOXX 50 UCITS ETF EUR (Acc)\n2. iShares Core EURO STOXX 50 UCITS ETF EUR (Dist)\n\nTheir 1 year performance is 34.30% and 34.29% respectively. Okay, no much accumulation happened in one year.\n\nTheir 5 year performance is 66.64% &amp; 67.32% respectively. Wait what, why has the Distributing fund performed better, this doesn't make any sense to me. Can someone explain? I don't want to jump the gun and claim that accumulating funds are a scam and just buy distributing and reinvest the proceeds yourself, but this is what I think now...\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[https://www.justetf.com/en/find-etf.html?sortField=ter&amp;sortOrder=asc&amp;groupField=none&amp;cmode=compare&amp;tab=rollreturn](https://www.justetf.com/en/find-etf.html?sortField=ter&amp;sortOrder=asc&amp;groupField=none&amp;cmode=compare&amp;tab=rollreturn)",
        "subreddit": "investing",
        "title": "Accumulating vs Distributing ETF - prices do not seem to reflect the accumulation, are accumulating funds worse than distributing? Is accumulation a scam?",
        "url": "https://www.reddit.com/r/investing/comments/nziz3z/accumulating_vs_distributing_etf_prices_do_not/",
        "created": 1623692104.0
    },
    {
        "author": "MrCoil",
        "created_utc": 1624384002,
        "id": "o5su63",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi all, so I’m a bit of a space geek and I genuinely think in my lifetime the development of space travel and tourism will be huge. I used trading 212’s PIE features which allows me to make my own say mini ETF. I made one using space stocks I knew as well as researching online and ARK’s space ETF.\n\nI’ve listed below the stocks I’m in and what % and so far I’ve been given 15% returns on my investment which i can’t complain about. I was wondering if anyone has feedback on Space stocks to add/remove or adjusting my % per stock. I personally really believe this collection will be very valuable in 10+ years \n\nVirgin Galactic - 10%\nLockheed Martin - 10%\nIridium communications - 10%\nTrimble - 10%\nAerojet Rocketdybe 10%\nMaxar Technologies - 9%\nNorthrop Grumman - 9%\nL3 harris - 8%\nThales - 6%\nBoeing - 5%\nAirbus - 4%\nTeradyne - 3.5%\nDassault systems 3.3%\nRaven industries 2.2%",
        "subreddit": "stocks",
        "title": "My own Space collection",
        "url": "https://www.reddit.com/r/stocks/comments/o5su63/my_own_space_collection/",
        "created": 1624412802.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623332540,
        "id": "nwnysp",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "As usual for me, I took some of my adderall prescription and it drove me to write a DD on my most watched stocks at the moment.\n\nApplied Matterials Inc ($AMAT) is a large-cap stock, and I base my play upon it's high quality and strong momentum; as well as confidence in semi-conductor stocks. AMAT provides manufacturing equipment, services and software to the semiconductor, display and related industries.\n\nApplied Materials is the leading producer of equipment and materials for producing microchips, TV's (OLED's/LCD's), and solar panels. They also have their services business which offers manufacturing consulting and automation software. They are based in California, but have factories around the world, with Asian customers accounting for 80% of it's revenue.\n\nTo summarise:\n\n- Semi-conductor systems make 60% of revenue, this is for equipment used to manufacture semiconductor devices such as microprocessors and memory.\n\n- Applied global services provide a quarter of revenue. This is for integrated solutions to optimise equipment, performance and productivity,\n\n- And the display markets account for 10% of it's revenue. Providing products for manufacturing LCD's and OLED displays.\n\n- It's customers include Apple, HP and Dell.\n\nWith the current silicon shortage, I expect the stock to surge further when this shortage slows down.\n\n- AMAT has been stair stepping higher in the recent bull trend, as a leader in one of the stronger industry groups in tech (semiconductors), I believe it among other semi-conductor stocks are a great buy for a long right now.\n\n- AMAT's 5-year return on Capital Employed is 25.1%, which is a strong indicator that it has the power to grow profitably. AMAT's share price has had a 72.1% return relative to the market over the past 12 months.\n\n- Furthermore, it's earnings outlook is improving. Analysts are still raising their earnings estimates for the company. For the year, the stock currently has an earnings estimate of $6.53 per share, up 56.59% from a year ago.\n\n- AMAT is testing the 10 week line on the weekly chart, after declining recently. This has formed a handle, and if you rebound from here to get above the handle, there could be a breakout.\n\n- As Nvidia recently broke out we could see other semiconductor stocks such as TSM, AMAT, LCRX, and ASML following this pattern.\n\n- ASML is also in the buy range after finding support at the 10-week line.\n\nWhy semi-conductor stocks are a good play: \n- The Innovator IBD Breakout Oppurtunities Index (BOUT) jumped 152% from March 2020 lows before pulling back in February. This ETF is now integrating leading components manufacturers such as DELL, ZBRA, AMAT, LRCX, UCTT, and TER.\n\nJim Cramer himself is now looking at AMAT, TSM and AMD.\n\n\"Cramer recently said that if investors think chips are truly in short supply and we need capital equipment, then the company they most need is Lam Research (LRCX), other than Taiwan Semiconductor Manufacturing (TSM)\"\n\n\"Jim Cramer recently named chip equipment major Applied Materials (AMAT), as one of the stocks that got away.\n\nHe called out the bull market in semiconductor equipment. We need to make more chips, he said, and companies like Applied Materials can make that happen.\n\nThe semiconductor equipment major reported mixed fiscal-second-quarter earnings and received a number of positive reviews and price-target upgrades from Wall Street analysts.\"\n\nAnyway, aside from Cramer there are many other reasons to own semi-conductor stocks.\n\nOne of my primary reasons is the growth in data centre demand. This was why I bought NVDA calls at $620, aside from the stock-split. AMD is also bringing out new data-centre GPUs.\n\n- There has been a huge growth in demand for data centre equipment, due to the rise in work-from-home driving data centre's to increase their cloud-storage capacities. This has fuelled demand for data-centre chips from data centre operators.\n\n- The data centre market is expected to grow to $519.34 billion during 2021-2025, driven by the growing clout of cloud services and digitization. Further, increase in adoption of multi-cloud and network upgrade to support 5G is fueling growth.\n\n- New semiconductor manufacturing processes from 10nm, 7nm, to 5nm and 3nm has opened new business avenues.\n\n- 5G deployment is spuring further sector growth.\n\n- VR and AR devices, gaming, wearables and drones, have grown in use due to Coronavirus - hence leading to a increase in usage of online services globablly.\n\n- Improvements in DRAM and NAND pricing are fueling semi-conductor stocks catering to the memory market.\n\n- AMD, and TSM delivered good performance in the first quarter driven by data centre demand.\n\nI think my adderall has worn off now, but I will update with a part 2 later on. I'm going to open a position in TSMC, AMAT, LCRX, and ASML today. I will look at AMD also.",
        "subreddit": "wallstreetbets",
        "title": "$AMAT DD and why semi-conductor stocks are a great play right now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nwnysp/amat_dd_and_why_semiconductor_stocks_are_a_great/",
        "created": 1623361340.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1624306648,
        "id": "o54f6z",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, June 21, 2021**\n\n***Please Note:*** *Hello friends! If you were wondering where the Daily Market has been the last two weeks, I have had a great few months in the market and decided, now that I am fully vaccinated and the US is reopening, to go on vacation to New York (I live in California). I am now back home and ready to get back to the regular schedule! The Recap will be posted everyday again from now on.*\n\nStocks jumped today, with the three major indexes rising, looking to recover the losses after the volatility experienced last week after the Federal Reserve’s outlook was announced. If anything, last week’s volatility shows us that the game of tug-of-war between inflationary pressures spooking investors and the Federal Reserve reiterating it will maintain accommodative policies in place for the foreseeable future continues. As I have said in the past, while I acknowledge the risk posed by the elevated inflation readings, I too believe any pressure is transitory and remain extremely bullish moving forward. \n\nThe Federal Reserve in the United States has a dual mandate: maintaining inflation stable and maximum employment. In light of the pandemic and surge in unemployment following lockdown, its maximum employment mandate has broadened. The measures and tools for achieving these mandates differ and have also changed recently. On the upside, the Fed now has additional flexibility in providing and maintaining accommodative monetary policies, namely near-zero interest rates and quantitative easing, to support the economy. The downside is that as the economy continues to improve, policies may stay loose for too long, leading to inflation and forcing the Fed to respond by aggressively raising interest rates, which would pretty much tank equities. In my view, this is the fundamental risk hanging over the market moving forward: Is the Fed misinterpreting inflationary readings as transitory? In my view, they are not. \n\nLast week, the spotlight was squarely on the Federal Reserve meeting, with market participants anxious to see how the Fed interprets and plans to react to the higher-than-expected inflationary readings. Analysts broadly expected the Fed to discuss a timeline for tapering its asset purchase program and a potential timeline for interest rate hikes. Instead, the Fed made no mention of a taper timeline and signaled they anticipate the first interest rate hike to occur in 2023. Overall, the report was very positive for equities, which is why the SPY so quickly recovered after an initial dump on Wednesday. \n\nIn my opinion,  it seems the Fed’s decision to leave out a “taper timeline” in the latest meeting reinforces the view consistently reiterated by the members of the Fed that current inflationary readings are “transitory” (meaning not permanent) and largely reflects factors caused by the coronavirus pandemic and the subsequent economic shutdown, such as global supply chain disruptions, materials shortages, and labor market imbalances. Moreover, I suspect Jerome Powell wants to avoid another “Taper Tantrum” like the one in 2013 and intends to be as clear as possible about the Fed’s expectations in order to avoid mixed messages (Read more about the 2013 Taper Tantrum [here,](https://www.investopedia.com/terms/t/taper-tantrum.asp) but basically markets freaked out after the Fed announced it was tapering quantitative easing passed during the 2008 recession since the economy had largely recovered by that point). In the end, the market kept going unabated, something I find very likely to happen again when the Fed inevitably announces they are tapering. In the end, I expect taper talks to begin towards the end of this year, but the lack of its mention in this Fed outlook meeting is an encouraging sign the Fed is not concerned about the elevated inflation readings. \n\nMoreover, the median projection among Fed officials is now for two rate hikes in 2023 despite the Fed raising inflation expectation for 2021, another sign the central bank remains unconcerned with the current levels of inflation. While the 2023 timeline is sooner than originally predicted, the two year timeline signals that the Fed will continue to move slowly and deliberately when considering any policy adjustment. \n\nLater this week, investors will receive the latest update on core personal consumption expenditures (PCE), which serves as the Fed's preferred gauge of inflation. The report due for release on Friday is expected to register a 3.4% year-on-year increase for May, marking the fastest jump since 1992, albeit while still reflecting \"base effects\" as prices rebound after last year's pandemic-induced collapse in prices across the board.\n\n**Highlights**\n\n* Amblin Partners, a movie studio headed by famed director Steven Spielberg, announced a partnership with Netflix (NFLX) to produce future films.  \n* Apple became the fourth major digital company to face closer scrutiny from Germany's antitrust watchdog on Monday after the cartel office said it had launched an investigation into whether the tech giant is exploiting its market position.\n* Goldman Sachs (GS) said in a note Monday that households were the largest source of equity demand in the first quarter of 2021 after generating net purchases of $172 billion. “We estimate that households currently allocate 44% of their assets to equities, slightly below the all-time high allocation of 46% in 2000. But high cash balances and continued retail participation in equity markets should bolster household equity demand.\" \n* EU antitrust regulators will decide by July 26 whether to clear a $30 billion bid by AerCap (AER) to buy the aircraft leasing business of General Electric (GE).\n* Bank of America (BAC) said oil may surge to $100 a barrel by next year as travel demand rebounds. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing price\\*\\***\n* Ameriprise Financial (AMP) target raised by Citigroup from $265 to $290 at Buy. Stock currently around $242\n* Chubb (CB) target raised by Citigroup from $187 to $190 at Buy. Stock currently around $159\n* ConocoPhillips (COP) with two target raises. Stock currently around $60.4\n   * Sanford C Bernstein from $63 to $80 at Outperform\n   * Mizuho from $73 to $82 at Buy\n* Edison International (EIX) target raised by Morgan Stanley from $72 to $73 at Equal-Weight. Stock currently around $56\n* Equitable (EQH) target raised by Citigroup from $38 to $41 at Buy. Stock currently around $30.3\n* Equinix (EQIX) target raised by BMO Capital Markets from $850 to $910 at Outperform. Stock currently around $823\n* Guardant Health (GH) target raised by Wells Fargo from $145 to $160 at Overweight. Stock currently around $120\n* Hess (HESS) target raised by Sanford C Bernstein from $91 to $120 at Outperform. Stock currently around $90.5\n* Jazz Pharmaceuticals (JAZZ) target raised by HC Wainwright from $212 to $220 at Buy. Stock currently around $178\n* Teradyne (TER) target raised by Evercose ISI from %160 to $175 at Outperform. Stock currently around $126\n* Occidental Petroleum (OXY) target raised by Mizuho from $36 to $37 at Buy. Stock currently around $29.5\n\n“Common sense is genius dressed in its working clothes.” —Ralph Waldo Emerson",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, June 21, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/o54f6z/here_is_a_market_recap_for_today_monday_june_21/",
        "created": 1624335448.0
    }
]