[
    {
        "author": "DumplingGoddessTe",
        "created_utc": 1610723228,
        "id": "kxwbo6",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Friday, 15 January 2021\n\n*Live Updates*\n\n&amp;#x200B;\n\n**First Post:**\n\n[https://www.reddit.com/r/wallstreetbets/comments/kuwg1e/i\\_have\\_a\\_discount\\_trading\\_bot\\_which\\_gives\\_out/](https://www.reddit.com/r/wallstreetbets/comments/kuwg1e/i_have_a_discount_trading_bot_which_gives_out/)\n\n&amp;#x200B;\n\n**Background:**\n\n* My discount bot to help /r/wallstreetbets. It took me almost a year to develop it to my standard.\n* My private codes was used to develop it, and it's very unlikely I will sell it off to anyone or publish the code freely as it took me way too long to develop it. I rather post updates freely, at no cost to anyone than give out the code.\n* I will not be posting this hourly. It just too long to load everything up maybe in the future. I will post during open though.\n* Discord and telegram admins, don't try to monetize my bot suggestions to vulnerable people, when you don't even own the codes behind it.\n* There are a lot of SPY500/\"boomer\" companies within the bot, I thought about removing it but many people preferred that I kept it in there.\n* There won't be any sell signals, as stocks only go up, so I rather just do a discount algorithm.\n* Batch 1 = Algorithm/Bot + Human Judgement\n* Batch 2 = Algorithm/Bot Judgement Only\n* This is a one man bot.\n\n&amp;#x200B;\n\n**Bot Overview**:\n\nIt's showing an opportunity that you may have missed otherwise, so you can decide for yourself if you want to pursue the discount of a stock for potential profits. Backtesting has not been done, do not YOLO your life savings into whatever stated risking it all.  Rather use this as a side tool.\n\n&amp;#x200B;\n\n**Key:**\n\n* Pharma companies are very risky.\n* Meme/Hype stocks are very risky.\n* Companies that you don't know how they work are very risky.\n* Follower companies are very risky because they join the hype train (what NKLA is to TSLA).\n* I have a very low amount in options (less than $500), and I have 100k+ in shares and cash.\n* When doing options have a lot of collateral, so you don't hit margin call.\n* Take the \"Calls\" as very discounted, and \"Potentially A Call\" as somewhat discounted.\n* Old money companies are slow. While tech companies are fast-paced.\n* Only invest in companies that you do know and see potential in.\n* You don't have to invest every day, only when you see the potential.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;***At Close of Thursday***\n\n&amp;#x200B;\n\n**Batch 1:**\n\n* Data Processing &amp; Outsourced Services\tMA\tMastercard Inc\n* Financial Exchanges &amp; Data\tMKTX\tMarketAxess Holdings Inc.\n* Financial Exchanges &amp; Data\tMSCI\tMsci Inc\n* BMS\tBraemar Shipping Services plc\n* CSRA\tCisadane Sawit Raya PT\n\n*Maybe*:\n\n* CRSR\tCorsair Gaming Inc\n* TWTR\tTwitter Inc\n* Data Processing &amp; Outsourced Services\tFLT\tFleetCor Technologies, Inc.\n* Data Processing &amp; Outsourced Services\tGPN\tGlobal Payments Inc\n* Data Processing &amp; Outsourced Services\tJKHY\tJack Henry &amp; Associates, Inc.\n* Environmental &amp; Facilities Services\tROL\tRollins, Inc.\n* Financial Exchanges &amp; Data\tCME\tCME Group Inc\n* Health Care Equipment\tBDX\tBecton Dickinson and Co\n* Health Care Equipment\tDXCM\tDexCom, Inc.\n* Industrial Conglomerates\tROP\tRoper Technologies Inc\n* Interactive Media &amp; Services\tTWTR\tTwitter Inc\n* Internet Services &amp; Infrastructure\tVRSN\tVerisign, Inc.\n* Managed Health Care\tHUM\tHumana Inc\n* Pharmaceuticals\tPRGO\tPerrigo Company PLC\n* Restaurants\tDPZ\tDomino's Pizza, Inc.\n* Restaurants\tMCD\tMcdonald's Corp\n* Research &amp; Consulting Services\tINFO\tIHS Markit Ltd\n* TYL\tTyler Technologies, Inc.\n* DPZ\tDomino's Pizza, Inc.\n* DXCM\tDexCom, Inc.\n* JKHY\tJack Henry &amp; Associates, Inc.\n* GPN\tGlobal Payments Inc\n* FB\tFacebook, Inc. Common Stock\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Batch 2:**\n\n&amp;#x200B;\n\nCall:\n\n* Facebook, Inc. Common Stock\tFB\n* Automatic Data Processing Inc\tADP\n* Fidelity National Information Servcs Inc\tFIS\n* Brown-Forman Corporation Class B\tBF.B\n* MarketAxess Holdings Inc.\tMKTX\n* S&amp;P Global Inc\tSPGI\n* Twitter Inc\tTWTR\n* HRL\n* Kraft Heinz Co\tKHC\n* IHS Markit Ltd\tINFO\n* Coca-Cola Co\tKO\n* MarketAxess Holdings Inc.\tMKTX\n* IHS Markit Ltd\tINFO\n\n&amp;#x200B;\n\nPotential Call:\n\n* Air Transport Services Group Inc.\tATSG\n* Adobe Inc\tADBE\n* Paycom Software Inc\tPAYC\n* salesforce .com, inc.\tCRM\n* Tyler Technologies, Inc.\tTYL\n* Las Vegas Sands Corp.\tLVS\n* Fiserv Inc\tFISV\n* Global Payments Inc\tGPN\n* Mastercard Inc\tMA\n* Paychex, Inc.\tPAYX\n* Cintas Corporation\tCTAS\n* Alliant Energy Corporation\tLNT\n* American Electric Power Company Inc\tAEP\n* Consolidated Edison, Inc.\tED\n* Dominion Energy Inc\tD\n* Entergy Corporation\tETR\n* WEC Energy Group Inc\tWEC\n* Moody's Corporation\tMCO\n* Msci Inc\tMSCI\n* Atmos Energy Corporation\tATO\n* Church &amp; Dwight Co., Inc.\tCHD\n* Kimberly Clark Corp\tKMB\n* Roper Technologies Inc\tROP\n* W W Grainger Inc\tGWW\n* Verisign, Inc.\tVRSN\n* Ball Corporation\tBLL\n* Ameren Corp\tAEE\n* CenterPoint Energy Inc\tCNP\n* NiSource Inc.\tNI\n* Pinnacle West Capital Corporation\tPNW\n* Campbell Soup Company\tCPB\n* General Mills, Inc.\tGIS\n* J M Smucker Co\tSJM\n* Kellogg Company\tK\n* Domino's Pizza, Inc.\tDPZ\n* Realty Income Corp\tO\n* Pfizer Inc.\tPFE\n* Atmos Energy Corporation\tATO\n* Msci Inc\tMSCI\n* SBA Communications Corporation\tSBAC\n* Alliant Energy Corporation\tLNT\n* Global Payments Inc\tGPN\n* Church &amp; Dwight Co., Inc.\tCHD\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;***At Open of Friday***\n\n&amp;#x200B;\n\n**Batch 1:**\n\n* NRGU\tMicroSectors U S Big Oil Index 3X Leveraged ETN\n* DIG\tProShares Ultra Oil &amp; Gas\n* CSRA\tCisadane Sawit Raya PT\n\nMaybe:\n\n* GUSH\tDirexion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Bl 2X Shs\n* ERX\tDirexion Daily Energy Bull 2x Shares\n* WTI\tW&amp;T Offshore, Inc.\n* BP\tBP plc\n* Aerospace &amp; Defense\tTDG\tTransDigm Group Incorporated\n* Diversified Banks\tWFC\tWells Fargo &amp; Co\n* Integrated Oil &amp; Gas\tHES\tHess Corp.\n* Oil &amp; Gas Equipment &amp; Services\tHAL\tHalliburton Company\n* Oil &amp; Gas Equipment &amp; Services\tFTI\tTechnipFMC PLC\n* Oil &amp; Gas Exploration &amp; Production\tDVN\tDevon Energy Corp\n* Oil &amp; Gas Exploration &amp; Production\tEOG\tEOG Resources Inc\n* WCG\tWebcentral Group Ltd\n* ADS\tAlliance Data Systems Corporation\n* RIG\tTransocean LTD\n* MAC\tMacerich Co\n* HP\tHelmerich &amp; Payne, Inc.\n* ARG\tArgos Resources Ltd\n\n&amp;#x200B;\n\n**Batch 2:**\n\n&amp;#x200B;\n\nCall:\n\n* Automatic Data Processing Inc\tADP\n* Fidelity National Information Servcs Inc\tFIS\n* Brown-Forman Corporation Class B\tBF.B\n* MarketAxess Holdings Inc.\tMKTX\n* S&amp;P Global Inc\tSPGI\n* Facebook, Inc. Common Stock\tFB\n* Twitter Inc\tTWTR\n* IHS Markit Ltd\tINFO\n* Kraft Heinz Co\tKHC\n* Coca-Cola Co\tKO\n* Hormel Foods Corp\tHRL\n* MarketAxess Holdings Inc.\tMKTX\n* Kraft Heinz Co\tKHC\n\n&amp;#x200B;\n\nPotential Call:\n\n* Air Transport Services Group Inc.\tATSG\n* Adobe Inc\tADBE\n* Paycom Software Inc\tPAYC\n* salesforce .com, inc.\tCRM\n* Las Vegas Sands Corp.\tLVS\n* Fiserv Inc\tFISV\n* Global Payments Inc\tGPN\n* Mastercard Inc\tMA\n* Paychex, Inc.\tPAYX\n* Cintas Corporation\tCTAS\n* Alliant Energy Corporation\tLNT\n* American Electric Power Company Inc\tAEP\n* Consolidated Edison, Inc.\tED\n* salesforce .com, inc.\tCRM\n* Msci Inc\tMSCI\n* SBA Communications Corporation\tSBAC\n* Dominion Energy Inc\tD\n* Entergy Corporation\tETR\n* WEC Energy Group Inc\tWEC\n* SBA Communications Corporation\tSBAC\n* Moody's Corporation\tMCO\n* Msci Inc\tMSCI\n* Atmos Energy Corporation\tATO\n* Church &amp; Dwight Co., Inc.\tCHD\n* Kimberly Clark Corp\tKMB\n* Roper Technologies Inc\tROP\n* W W Grainger Inc\tGWW\n* Verisign, Inc.\tVRSN\n* Ball Corporation\tBLL\n* Domino's Pizza, Inc.\tDPZ\n* Realty Income Corp\tO\n* Ameren Corp\tAEE\n* CenterPoint Energy Inc\tCNP\n* NiSource Inc.\tNI\n* Pinnacle West Capital Corporation\tPNW\n* Campbell Soup Company\tCPB\n* Domino's Pizza, Inc.\tDPZ\n* Paycom Software Inc\tPAYC\n* Las Vegas Sands Corp.\tLVS\n* Atmos Energy Corporation\tATO\n* General Mills, Inc.\tGIS\n* Kellogg Company\tK\n* Pfizer Inc.\tPFE\n* Alliant Energy Corporation\tLNT\n* Global Payments Inc\tGPN\n* Church &amp; Dwight Co., Inc.\tCHD\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Update:**\n\nIt will be posted on WSB approx one hour before open, and the prices at open will be added within the hour of open.\n\nI will update as I go. For feedback, live updates, backups throughout the day check /r/WallStreetTrader or my post history.\n\nClose Batch 1 added: 8:32 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nClose Batch 2 added: 8:41am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nWaiting for open sync.\n\nClose Batch 1 added: 9:52 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nClose Batch 2 added: 10:05 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA",
        "subreddit": "wallstreetbets",
        "title": "Post #5 Friday: I have a discount trading bot which gives out daily (well hourly discounts for the stock market). Here’s what the bot stated under discounted companies...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kxwbo6/post_5_friday_i_have_a_discount_trading_bot_which/",
        "created": 1610752028.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612128490,
        "id": "l9mhk2",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "JKHY Jack Henry &amp; Associates: Reliable Company Trading on a Pullback Before 02/08/2021 AH Earnings.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9mhk2/jkhy_jack_henry_associates_reliable_company/",
        "created": 1612157290.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612128802,
        "id": "l9mlkz",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "StockMarket",
        "title": "JKHY Jack Henry &amp; Associates: Reliable Company Trading on a Pullback Before 02/08/2021 AH Earnings.",
        "url": "https://www.reddit.com/r/StockMarket/comments/l9mlkz/jkhy_jack_henry_associates_reliable_company/",
        "created": 1612157602.0
    },
    {
        "author": "Avid_Hiker98",
        "created_utc": 1609528828,
        "id": "koh4x4",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "[SPX Monthly Chart:](https://www.tradingview.com/chart/SPX/7rPzyt3E-SPX-Monthly-Risk-Reward-Less-Favorable/)\n\n* The market basically closed the year at ATH (3pts off) and is within a hair of 3855, which is the 138.2% Fib of the March low.\n* The rising monthly channel (shown above) shows that markets are stretched near resistance and already outside of their bollinger bands. The weekly band is at 3774.\n* While I believe there is room for upside into 2021, the risk/reward is **NOT** favorable here anymore. Sentiment is stretched and a correction would be welcomed with open arms.\n* I anticipate a 10-15% correction to start the year, which would align us with the rising 200dma near 3219. We ended the year in a tight range, and there is potential to carry into 3855 based on January 15 open interest and gamma positioning.\n\nLast few days I have been selling stocks and calls aggressively in anticipation of a correction. I am long TLT calls (flat) and SPY puts (down 37%).\n\n**Sentiment:**\n\n* The AAII Sentiment Survey is quite elevated near multi-year highs and shows overly bullish sentiment.\n* The Advisors Sentiment Report reports the views of over 120 independent investment newsletters (those not affiliated with brokerage houses or mutual funds) and reports the findings as the percentage of advisors that are bullish, those bearish and those that expect a correction. The current Bull to Bear spread is one of the highest in decades, yet another indication of frothy sentiment.\n* The NAAIM Exposure Index is currently at 89 and off some 100+ prints but remains elevated to the averages.\n* The BAML Fund Manager Survey shows the three most crowded trades are:  \n\n   * Long Tech via shares\n   * Short USD\n   * Long Bitcoin Spot via Perpetual Swaps\n   * Fund managers are \"all-in\" on leverage. This is evidenced by our DIX print on Thursday yet again showing dark pool buying.\n* Consumer Confidence deteriorated sharply in December, as the resurgence of COVID-19 \"remains a drag on confidence.”\n* CEO Confidence, as tracked by the Bloomberg Consumer Comfort Index hit a two week low at 47. This is the sharpest drop in economic outlook since April.\n\n**Market Health:**\n\n* NYSE Cumulative Adv/Dec:  \n\n   * Actually pretty healthy right now. This is still well above all of its important moving averages and remains in an uptrend.\n* NYSE McClellan Oscillator:  \n\n   * Neutral currently.\n* NYSE Summation Index (NYSI):  \n\n   * Most commonly used by fund managers to find divergences. Above a short term 5/8 day exponential moving average is a buy signal. Below flashes a short term sell signal. This is *currently showing a sell signal.* However, sell signals in rallies tend to be early signals...\n* Moving Averages:  \n\n   * The 8/21-week EMA crossover has long been a favorite signal for momentum in individual names and also works with Indices. The 21-week EMA is important support for growth/momentum stocks. In general, you want to be long when the 8 week is above the 21 week and short when it is below with crossovers being key trend inflection signals. The 12-month moving average (MA) and monthly MACD are good longer-term risk management tools. The price action relative to the 200-week MA provides a good gauge for the health of the S&amp;P 500’s secular trend. Pullbacks or corrections (aka cyclical bear markets) for the S&amp;P 500 that hold above or near the rising 200-week MA are a secular bull market pattern. Pullbacks that decisively break the 200-week MA are a sign of a secular bear market. Most corrections on the S&amp;P 500 during the 1950-1966 and 1980-2000 secular bull market held between the 100-week MA and the 200-week MA. The 2015-2016 S&amp;P 500 pullback fit this secular bull market correction pattern. The secular bear market periods from 1929-1950, 1966-1980, and 2000-2013 saw sustained periods below these long-term moving averages. This means that the 200-week MA provides a good secular bull market risk management tool or stop loss. Using this history as a guide suggests that the Ichimoku monthly cloud is a good trailing secular bull market stop loss. History also suggests that a decisive move below the monthly cloud confirms a secular bear market for US equities. *Currently we are above all moving averages and this is a bullish signal.*\n\n**Economics:**\n\n* The common theme appears to be an expectation of a synchronized global growth in 2021.\n* The optimism on 2021 delivering a record year for corporate profit growth and strong GDP growth around the globe is very contingent on a successful vaccine rollout. The current surge of cases and hospitalizations in the US and Europe is resulting in further restrictions and lockdowns that will weigh on growth expectations, or at least push out pent-up demand. Consumers have led the recovery so far with a boost from fiscal stimulus but the key to a self-sustained recovery is a strong capex cycle which is seen kicking off in Q2 2021. The labor market will also be in focus after record low unemployment the pandemic saw the number jump to 14.7% in April, the highest since the Great Depression, but has recovered rapidly though losing some momentum as it finished the year near 6.5% unemployment and consensus expectations to reach 5% by the end of 2021, still far-off from the 3.5% pre-crisis rate.\n* The recovery has already started in 2H20 in the US &amp; China while the European recovery has been more subdued. The driver of the strong 2021 recovery will be the full reopening of economies worldwide which makes a successful vaccine distribution critical. The US Dollar is closing 2020 weak and looks to have some structural issues with surging deficits, Fed’s intention to boost inflation, easy financial conditions, and expected economic and political improvements. The combination of easy monetary policy, a rebound in old economy industries and a global upswing in growth provides a healthy backdrop for 2021. The balance sheets of households, corporate and governments are expanding alongside the aggressive monetary policy and signs of inflation returning causing a rotation back to value and cyclical growth supported by a steepening yield curve.\n* GDP is seeing rising 6.4% globally in 2021 according to Morgan Stanley, the consensus is for 5.4% growth. In the US those numbers are 5.9% and 3.8% respectively.\n* Inflation would be the key risk into 2021 with it likely to start showing up in 2H21, and the risk being an overshoot could start a disruptive shift in Fed policy. Surging debt remains another concern, as a share of U.S. GDP, total debt has spiked near a record high and total nonfinancial debt has surged to new all-time highs. The rapid increase in government deficits is due to the combination of 1) the budget shortfall that already existed and was growing, plus 2) the deficit spending to fund the stimulus programs to date.\n* The other clear risk in 2021 is China where debt defaults are rising and could spark a move to credit tightening and a recession that would strangle the global recovery. The overall default rate is currently low but the percentage spike in debt/GDP was the highest since 2009 which could lead to policy tightening in 2021.\n\n**Market Valuation and Fundamentals:**\n\n* The NASDAQ continue to outperform in 2020 with a 45%+ YTD return compared to the S&amp;P at +15% as major secular trends in technology continue to play out. The trend of rapid rotational moves also continue with growth often seeing selling pressure for a few days before quickly recovering and resuming the longer-term uptrends. Into 2021 earnings growth is expected to be a record though room for multiple expansion is minimal. A combination of improving economic conditions causing greater business and consumer confidence should drive strong earnings growth in 2021. Increased fiscal spending and a moderation of tariffs provide additional tailwinds. In 2020 many businesses shedded labor and transformed business models to higher productivity to offset the collapse in demand and low inventories with rebounding production point to margin expansion in 2021. The 2021 environment shapes up to be one of solid earnings growth, a return of buybacks and modest multiple contraction. The growth versus value debate is likely to continue but the low-rate environment continues to favor growth, but even more-so a greater preference for quality, companies with strong balance sheets, cash flow generation, and returns on capital should continue to outperform. We are seeing historically strong earnings revision ratios and a record percentage of stocks with dividend yields above the rate of the ten-year Treasury, both conducive to allocations to equities. Compared to bonds, equities can act as a hedge in case of inflation and, with a thorough selection process, can still offer returns closer to historical returns.\n* My forecasts for 2021 take into account consensus expectations, a bull case for a strong vaccine rollout, and a bear case for disruptions to the vaccine rollout and geopolicatical potential issues. I am assigning a 40% probability for the bull case, 40% for the base case, and 20% for the bear case to arrive at a S&amp;P fair value of 3600 though 1H21. In 2H21 we start to look to 2022 estimates and feel we can approach $200 EPS with slight multiple contraction to 22X leaving upside potential to 4400 for year-end 2021.\n\n[https://imgur.com/a/QqPjfbU](https://imgur.com/a/QqPjfbU)\n\n* For 2021, the bottom-up EPS estimate (which reflects an aggregation of the median EPS estimates for CY 2021 for all of the companies in the index) is $169.20. For CY 2021, analysts are projecting earnings growth of 21.7% and revenue growth of 7.7%. The 6% trend growth rate since the 1930s would point to S&amp;P 500 EPS getting back to trend levels of $187 in 2022. An optimistic vaccine scenario would see S&amp;P 2022 EPS well above $200.\n\n[https://imgur.com/a/lLhmsb3](https://imgur.com/a/lLhmsb3)\n\n* The low rate environment impacts the multiple, and assuming the 10-year stays low, the Fed keeps rates at zero, and credit spreads stay firm, a valuation framework would put a trailing PE at 24X and forward at 21.5X for the current environment. The spread between the S&amp;P dividend yield versus the corporate Baa bond yield is near historical highs and the ERP (Equity Risk Premium) is very high by many measures. Assuming the spread between the dividend yield and IG corporate yield goes back to 2012-19 levels, it would point to 30%- plus upside for S&amp;P 500 valuations. Assuming some rise in rates as the spread narrows more from falling equity yields would point to 20%-plus upside. In 2021, policy support should remain in place to curtail risk aversion. Besides the risk of a credit crisis, concerns over a late-cycle overheating have been pushed further out due to the pandemic-induced recession and policy makers’ increased inflation tolerance. When comparing relative attractiveness across asset classes, which ultimately steers a substantial part of investment flows, equity markets continue to look quite attractive. Since the beginning of 2020, real bond yields in the USA have declined by over 100 basis points, outpacing the decline in earnings yields (inverse of the price-earnings ratio), thus supporting higher valuation multiples. Currently the difference between the earnings yield and the real bond yield as a measure for the equity risk premium (ERP) is higher than the long-term average, suggesting that equities offer an attractive excess return over bonds. Although lower interest rates support higher multiples due to the increase value of future earnings, a return to normal could push long-term interest rates higher and exert downward pressure on equity valuation multiples.\n\n[Sector Growth Rates](https://imgur.com/a/IJPIPWW)\n\n**Analyst 2021 Predictions:**\n\n* Morgan Stanley: $3900 - After a year of big swings in valuations, 2021 will be about who can deliver on earnings. 2020 was all about beta and understanding how equity markets trade in and around a recession that handed us the fattest pitch we’ve seen in a decade. 2021 will be much more about stock picking (alpha) and should favor those companies that can deliver earnings growth that isn’t already expected or priced. MSCO prefers companies with earnings growth most tied to re-openings and an economic recovery and also favors small caps. Financials are also preferred due to positive upside skew on rising rates and better credit; Materials and Industrials on demand rebound, earnings leverage and inflation protection; and Health Care given its GARP characteristics and re-rating potential with fading political overhangs.\n* Bank of America: $3800 - Stocks have already priced in much of the expected recovery in the economy and corporate profitability, leaving just slightly more upside heading into next year. Even as investors ride a wave of vaccine-related optimism, potential negative catalysts abound. The recovery is intact and the world likely reopens in the 2H, but a lot of optimism is priced in already on vaccine/recovery. Vaccine execution risk, delayed fiscal stimulus and longer lockdowns are risks. But a few themes support stocks: the S&amp;P 500 dividend yield is 3x the 10-year yield, and S&amp;P 500 dividends are set to increase in 2021. And unlike bond yields, earnings are nominal and participate in inflationary upside – where inflation risks may be running higher, given rampant money-printing and a potential post-vaccine spike in demand. BAML picks value stocks over growth, cyclicals over defensives and small caps over large caps, given each of these groups’ likelihoods to be disproportionately boosted by a post-virus economic recovery.\n* Goldman Sachs: $4300 - A vaccine is a more important development for the economy and markets than the prospective policies of a Biden presidency. The economic reopening coming alongside a vaccine, in tandem with a status quo policy environment cemented with a divided government, will help push the S&amp;P 500 to 4,300 by year-end 2021 and then to 4,600 by the end of 2022. The forecast assumes that the Senate will remain under Republican control following the Georgia run-off elections in January, the economy will continue on a path toward a “V-shaped” recovery, corporate profits will rebound, Fed funds rate will hold near-zero and the yield curve will steepen while the 10-year Treasury yield climbs only modestly.\n* Deutsche Bank: $3950 - Much of 2020’s run-up in the stock market came with multiples expansion, as prices escalated despite a drop in earnings, as companies dealt with fallout due to the coronavirus pandemic. Next year, as the economy recovers and a vaccine allows for long-lasting re-openings, earnings growth will rebound and multiples will de-rate. The pattern of the equity market recovery, bottoming halfway through recession and recouping most of its losses before it’s over, has been typical but the continued run-up means valuations are high. In our reading, elevated multiples reflect increased participation of retail investors which we see as sustaining, but we expect the multiple to begin to de-rate. For 2021, a recovery in earnings — which essentially increases the denominator of the price-earnings ratio — should lower multiples. That said, an increase in companies’ payout ratios as dividends and buybacks return could at least partially offset this. A gradual correction of overvaluation argues for the current overvaluation of 5 multiple points to diminish but remain significant at 3.6 points, putting the end-2021 multiple at 20.5X.\n* Jefferies: $4200 - Improving prospects for a vaccine, easy lending conditions and broader participation among cyclical and value stocks will help propel the stock market higher in 2021. November’s historic stock market rally, led by cyclical and value stocks in the energy, financials and industrials sectors, reflected broadening equity strength beyond just big tech and software shares. That rotation is anticipated to continue into next year, helping push the broader market higher. Notwithstanding the second and third Covid-19 waves permeating the world, there is a palpable feeling that the global economy is resynchronizing with the household, corporate and government balance sheets expanding simultaneously alongside aggressive monetary policy. The much-maligned value and cyclical growth sectors are slowly making a comeback as inflation pressures begin to return. This rotation has been supported by a steepening in the yield curve and with growthier stocks trading sideways. Improved visibility towards a successful coronavirus vaccine, easier lending conditions, little evidence of deflation and a sentiment switch from growth to value will lift US bank shares through 2021. Rising global capacity utilization rates, firmer producer prices, improving world trade volume, booming housing/autos and a weak dollar are the perfect environment for the S&amp;P 500 Industrials. The S&amp;P 500 materials sector is blowing off in response to a weak dollar, higher commodity prices, an upswing in global manufacturing and a restocking cycle.\n* CSFB: $4050 - Our 2021 forecasts are designed to answer a simple question: what the future will (2022) look like in the future (end of 2021). From this perspective, we are forced to de-emphasize the near-term, focusing instead on the return to a more normal world. As we look toward 2022, the virus will be a fading memory, the economy robust, but decelerating, the yield curve steeper and volatility lower, and the rotation into cyclicals largely behind us. Since the stock market discounts future events, each of these prospects for further improvement down the line should translate into a higher S&amp;P 500 as investors price in these events.\n* UBS: $4100 - The vaccine-related developments that drove stocks’ gains in November and early December have now been baked into market expectations, leaving vaccine distribution the next milestone for equity investors to consider in 2021. The key driver of U.S. equities will be the pace of vaccinations, similar to how shifts in mobility drove equities through the spring and summer. As people get vaccinated, they are likely to ‘normalize’ spending on areas impacted by COVID shortly thereafter. We see the rotation toward cyclical services spending and other COVID-hit areas as a key investment theme for 2021. UBS is overweight the consumer discretionary, industrials and energy sectors given that consumption and production will likely rebound next year. It downgraded materials and financials to Neutral. It is also Underweight consumer staples, utilities and REITs and Neutral on information technology, but overweight communication services and health care on still attractive growth relative to valuations. UBS maintained an upside case for the S&amp;P 500 of 4,400, which would emerge in the case of higher-than-baseline growth against a backdrop of still-low interest rates. However, in a downside case, the S&amp;P 500 could fall to 3,300, which would entail a weaker recovery and/or tighter financial conditions.\n* BMO Capital: $4200 - Heading into 2021, stocks are poised to keep reaping the benefits of the massive infusion of monetary support from the Federal Reserve, along with an anticipated additional round of fiscal stimulus. This constructive policy environment is likely to help push equities higher even as virus concerns linger for at least the first several months of the new year. Even with recent positive vaccine and treatment developments, the global pandemic and its unprecedented impact is unlikely to fade in coming months. As such, the massive fiscal and monetary response in the U.S. and around the world (also unprecedented) will likely remain in place to combat its negative economic impact for the foreseeable future. Such environments have historically supported continued stock market gains and we see no reason why 2021 will be any different. Aside from the global financial crisis, 2020 represented the swiftest quarter-over-quarter earnings collapse for the S&amp;P 500 where index EPS plummeted nearly 50% during 1Q, thus, we anticipate that 2021 has the potential to be one of the best years ever in terms of earnings growth, something we believe will also help to push stock prices higher. We remain optimistic and expect another year of double-digit gains as the economy and society slowly transition back to normal.\n* Barclays: $4000 - Markets are right to be optimistic about the global economic outlook in 2021, with growth returning and inflation rising but staying below central bank targets. Projected global gross domestic product growth of 5.6% in 2021, rebounding from a 3.6% contraction this year, with most Western economies reaching so-called herd immunity from Covid-19 in the second and third quarters of the year. Forecasts reflected the recent slew of positive vaccine results with efficacy rates exceeding expectations, which point to a significant boost for growth in the second quarter of 2021. Barclays also suggested the inflation outlook would not indicate any unwinding of current unprecedented levels of central bank support. Labor markets are recovering, but we are still at very high unemployment, so there is undeniably a lot of slack in the system. That means that when it comes to core inflation and the underlying drivers, to wage costs etc., that was unlikely to happen in the short run, meaning even next year. It would take several years really to come back. While Barclays anticipates a gradual improvement in inflation, it will not be significant enough to cause central banks to consider tightening their accommodative monetary policy stances. We have an environment whereby growth comes back, inflation stays relatively muted, and you have central banks continuing to support the recovery, and tightening is still far out.\n* Oppenheimer: $4300 - The S&amp;P 500 is likely to post another double-digit percentage gain in 2021 as the distribution of COVID-19 vaccines underpins a lasting economic recovery. This outcome is based on six key assumptions: First, that the public will expediently accept and receive COVID-19 vaccines and second, that equity investors will discount the success of the vaccines in reversing the disruptions brought on by the pandemic. Thirdly assumes that at least one of the two Senate seats in the Georgia runoff election will go to a Republican lawmaker, thereby retaining their control of the Senate and reducing (if not necessarily eliminating) the risk that the Biden administration will eradicate the corporate tax reform act of 2017. Fourth, the Federal Reserve will continue its low interest rate regime in tandem with accommodative monetary policy, and fifthly, that congressional lawmakers will step in with another round of fiscal stimulus by the first quarter of 2021 at the latest. Lastly, that investor appetite will continue to tilt toward “stocks that favor diversification and both growth and value segments of the market in a relatively low interest rate environment that favors equities, real assets and other asset classes over fixed income for intermediate and longer-term objectives. The vaccine rollout is arguably the most important in determining the trajectory of the S&amp;P 500 next year. Ultimately the stock market is broadly dependent on economic growth to drive revenues and earnings across the sectors.\n* JP Morgan: $4400 - Investors are entering 2021 against a confluence of market-positive events, including improving prospects for widespread vaccinations and sustained economic reopening, gridlock in Washington and accommodative central bank policy. Given the COVID-19 crisis, vaccine distribution is likely the linchpin event. But even with widespread vaccine availability still months away, optimism over early vaccine efficacy data has already sparked a rally among stocks hardest-hit by the pandemic. The equity market is facing one of the best backdrops for sustained gains in years. After a prolonged period of elevated risks (global trade war, COVID-19 pandemic, U.S. election uncertainty, etc.), the outlook is significantly clearing with the business cycle expanding and risks diminishing. We expect a ‘market nirvana’ scenario for equities with the melt-up continuing into 1H21, driven by earnings recovery and multiple expansion. Much of next year’s stock market rise is likely to come at the beginning of the year, as lingering uncertainties over vaccine distribution, the results of the Georgia senate race and additional monetary and fiscal stimulus start to dissipate. While the broader backdrop should still remain constructive in the second half of next year, by then the market will have likely priced in close to a full recovery and investors may start to expect a gradual shift in central bank forward guidance away from the current exceptionally accommodative stance.\n* BTIG - $4000 - Global synchronized growth underpinned by central bank ease and a Washington which sees Election 2020’s decidedly mixed outcomes as a catalyst for cooperation (spend, it’s necessary) and centrist government (no tax hikes) results in a Redistribution of Wealth consistent with the 2003-06 synchronized reflation period where Value outperformed. Growth, Small Cap outperformed Large Cap, and International equities outperformed the S&amp;P 500.\n\n**Gold:**\n\n* [Monthly](https://www.tradingview.com/chart/GLD/TUbcSBg2-GLD/)\n* Gold had a solid year in 2020 gaining more than 20% as a long base breakout that triggered in June 2019 continued to play out higher and reached its measured move objective while the rally briefly broke above 2011 highs before pulling back. If we look at Fibonacci extension targets of the 2011-2015 correction GLD has upside targets at $207 and $220. The 2018-2020 rally has Fibonacci retracement support levels at $162.5 and $152.5. Gold rallied in 2020 on economic uncertainty and a flight to safety and has pulled back in Q4 with the greater optimism for 2021 taking hold. On an allocation basis, Gold may be losing some of its luster as a store of value with the momentum seen in Bitcoin , although that has not been seen to this point with global gold ETF inflows topping a record in 2020 as a way to diversify portfolios and hedge against inflation. However, November saw the second largest outflow on record. In 2020 the lockdowns resulted in a 5% decline in global output, so the supply-side is expected to rebound in 2021. Gold prices should be supported by inflationary pressures, a deep fiscal deficit and a weaker USD. Goldman sees Gold reaching $2300 in 2021 as recovery from the coronavirus-related recession fuels higher inflation next year. Further fuel could be added from a recovery in demand from India and China.",
        "subreddit": "investing",
        "title": "2021 Market and Economic Outlook",
        "url": "https://www.reddit.com/r/investing/comments/koh4x4/2021_market_and_economic_outlook/",
        "created": 1609557628.0
    },
    {
        "author": "martin0288",
        "created_utc": 1609519849,
        "id": "koefny",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Ticker BABA on the nasdaq\n\nGo easy since its my first piece of DD, and I'm doing this to get different inputs on the company\n\nReason for DD: stock id down almost 30% from ATH\n\nI do not own any shares of alibaba \n\n \n\n*Processing img 8845zmm21r861...*\n\n**Quantitative assessment**\n\nAlibaba is a leading platform for global wholesale trade that serve million of buyers and suppliers around the world (mainly known for being prominent in Asia)\n\nLike amazon, their core e-commerce business consists of connecting third party sellers into one platform but, unlike amazon, they do not hold inventory and do not store /ship it.\n\n**How they make money**\n\n**E-commerce:** They make the main bulk of their money by charging a commission fee from transactions and a subscription fee to sellers. They say a 29% YoY growth in their revenues here.\n\n**Cloud operations:** From Investopedia: “Alibaba Cloud provides enterprise customers with a complete suite of cloud services, including database, storage, management and application services, big data analytics, a machine-learning platform, and other services. The company's cloud computing segment generates revenue from enterprise customers based on the duration and specific usage of the services.” This is the fastest growing segment of their business, reaching a 60% YoY revenue growth \n\n**Entertainment:** it’s a small part of their business and generates subscription-based revenue (8% YoY revenue growth)\n\nIn Q3 2020, 84% of their revenue can be attributed to commerce and the other 16% to cloud/entertainment/innovation initiatives and others (10%, 5%, and 1%, respectively)\n\nBeing such a large company, they touch many sectors, lots of which are expected to keep growing quickly in the future.\n\n**Management**\n\nWould love to hear your input on this one (i.e. I'm too lazy to look into the decisions they make and I don't know how I feel about Jack Ma)\n\n**Competition**\n\nTheir main competitor is Amazon, but other ones include eBay and Tencent holdings (the latter a Chinese tech company). Alibaba is very dominant in the Asian e-commerce markets. \n\n**Recent concerns**\n\nAt the time of this writing, the stock is down almost 27% from its late-October peak, a drop in price attributed to a recent antitrust investigation launched by the Chinese government for monopolistic behavior by essentially forcing sellers to chose only a single e-commerce platform. Additionally, Ant Group (their fintech sister company) had been denied an IPO a while back and keeps getting scrutiny from the government. The main risk here for Alibaba might be that they’re forced to divest some parts of their business. Personally, I think monopolistic concerns could keep emerging in the future as the company keeps growing however, I believe that despite these concerns, they can still strive as a business. There's plenty of YouTube videos and financial articles that cover this so I recommend those for more details.\n\n**Quantitative assessment (USD)**\n\nMarket cap: $650B \n\nQ3 2020 revenue: $22,8M (up 30% YoY, with forward projected growth of 36%)\n\nA few metrics stacked up against competitors (for the readers interpretation):\n\nhttps://preview.redd.it/xte5e455qq861.png?width=1357&amp;format=png&amp;auto=webp&amp;s=8c1eb19bda6e576e1a2c8675fd7ca35f55a7baec\n\nThe recent drop in share price has BABA trading at a discount compared to its main competitor amazon. Growing revenues in all aspects of their business mentioned above is encouraging to see as well. \n\nAlibaba seems to offer great value in an expensive tech market (especially considering the low PE ratio despite growing their revenues pretty fast), the main question is: are the risks of Chinese government regulations that can be imposed on the company worth the opportunity? \n\n&amp;#x200B;\n\nI skimmed through the company pretty quickly and there's plenty of details in their fundamental business that I didn't talk about, I just tried to give a big picture view. I recommend also doing your own research on the risks with this company since government investigations seem complex and there's other risks such as the fact that you're actually buying a holding company legally domiciled in the Cayman Islands.  \n\n That Investopedia article I referred to: [How Alibaba Makes Money: core e-commerce, cloud computing, digital media and entertainment (investopedia.com)](https://www.investopedia.com/articles/investing/121714/how-does-alibaba-make-money-simple-guide.asp) \n\nAlibaba q3 results presentation:  [Alibaba Group September Quarter 2020 Results](https://www.alibabagroup.com/en/ir/presentations/pre201105.pdf) \n\nActual q3 financial results pdf: [Microsoft Word - Alibaba Group Announces September Quarter 2020 Results\\_vF](https://alibabagroup.com/en/news/press_pdf/p201105.pdf) \n\nI would love to hear your thoughts on Alibaba\n\nAlso, happy new year!",
        "subreddit": "CanadianInvestor",
        "title": "A possible opportunity: quick alibaba DD",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/koefny/a_possible_opportunity_quick_alibaba_dd/",
        "created": 1609548649.0
    },
    {
        "author": "throwmeessay939",
        "created_utc": 1609553719,
        "id": "koombh",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "What is everyone’s opinion on Biden’s new relationship with China and the extent of the Ant /alibaba probe effect on the whole sector ? It seems like PDD , JD and baidu are near or at 52 week highs so investors aren’t totally shy about these stocks as they are a more attractive growth story than many large cap American stocks. I can see ant selling off assets and still having a Fintech presence with their holding company functioning as a bank . \n\nRight now I’m just valuing Baba as being ANT free and I believe it’s still quite an attractive value . Since Ma is no longer ceo of BABA it seems like the goal was more to penalize jack ma who has more of a symbolic stake in ant. \n\nJD is backed by both Google and Walmart, connected with cloud flare and I can’t see it failing, it seems like the best mid to long term growth potential and tencent will slowly grow and is discounted because of BABA as well imo . PDD and BIDU seem quite loved but I’m not really feeling their business models .  Will wallstreet have a short memory once ant is heavily regulated or will caution towards investments in China deepen?",
        "subreddit": "stocks",
        "title": "Chinese stocks 2021 JD BABA THCEY",
        "url": "https://www.reddit.com/r/stocks/comments/koombh/chinese_stocks_2021_jd_baba_thcey/",
        "created": 1609582519.0
    },
    {
        "author": "ImpressiveBonus8",
        "created_utc": 1609557493,
        "id": "kopn8r",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\n\nI hope you are all having a great start to 2021!\n\n**DISCLAIMER:** \n\n**I AM NOT A FINANCIAL ADVISOR NOR IS THIS ADVICE TO GO AND PURCHASE MARIMED STOCK $MRMD. I AM SIMPLY PASSING ALONG RESEARCH I HAVE GATHERED. THIS STOCK IS AN OTC (HIGHER RISK). BUYING/SELLING MARIMED STOCK WOULD BE AT THE DOING OF YOUR OWN. PLEASE DO NOT INVEST BLINDY, NOR USE THIS AS YOUR ONLY SOURCE OF INFORMATION.** \n\nBest of luck to you all!\n\n**What you will find in this DD:**\n\n* About MariMed. \n* What Does MariMed Do?\n   * Seed-to-Consumer \n   * Hemp Focus \n   * Brands \n   * CRM Technology \n   * Research &amp; Education \n* Partnerships + PR'S \n* The Team \n* Financials \n* Where The company is Headed \n* Technical Analysis \n* Why I like it\n\n**MariMed (Ticker - $MRMD) - About:** \n\nMariMed was initially founded as MariMed Advisors: an opportunity to advise operators and licensees on the design, development, operations, and financing of new cannabis cultivation centers and dispensaries nationwide. As the market and their experience grew, this business evolved into MariMed Inc, a premier seed-to-consumer vertically integrated multi state operator. The company used its experience as an advisor to develop and acquire its own brands of cannabis precision dosed products and state-of-the-art facilities, that focus on consumer safety, highest quality products and enhanced patient wellness.\n\n&amp;#x200B;\n\n[About MariMed](https://preview.redd.it/vbspm3oh7t861.png?width=2170&amp;format=png&amp;auto=webp&amp;s=9b0b8e0516e3a095ecda2effd05904a635dadf94)\n\nKey Takeaways: \n\n1. Among the largest multi-state operators in the US. \n2. First mover into hemp CBD market with supply and products in the US and EU. \n3. Ongoing discovery of better wellness through cannabis and hemp. \n\n**What Does MariMed Do?**\n\nMariMed Inc is a premier seed-to-consumer vertically integrated multi state operator. \n\n*Seed-To-Consumer:* \n\nTransitioning genetics to consumption. \n\nMariMed has assured patients and customers of end-to-end safety and quality from their seeds to enjoyment. MariMed has extensive experience with the wide array of issues relevant to legal cannabis business activities, including licensing for cultivation, processing and dispensing. \n\nMariMed holds:\n\n***13 cannabis licenses for cultivation, production and dispensaries across 6 US states. MariMed is currently managing over 300,000 square feet of premier cannabis facilities with a workforce soaring past 150 dedicated members. While running facilities in 6 US states, the company has a global expansion plan.*** \n\nMariMed has the following: \n\n* State-of-the-art regulatory compliant facilities which are models of excellence in horticultural principles, cannabis production, product development and dispensary operations. \n* Proprietary operating processes and procedures that employ industry best practices.\n* Strong local partnerships and deep expertise with real estate and commercial development, legal and tax advisory and government relations.\n* Opening wholly owned grow production and dispensaries in MA 2019\n\n*Hemp CBD:*\n\nWith hemp CBD now legal in most jurisdictions in North America and Europe, MariMed Inc. has been a first mover in the CBD market. With the creation of MariMed Hemp, it is a separated subsidiary business to optimize Marimed's investment in this growing industry.\n\nMariMed has made a strategic partnership with GenCanna, a Kentucky-based, vertically-integrated hemp producer of GMP-compliant CBD oils and isolates. The company is actively investing to ensure significant supply of compliant CBD and processing supply for their emerging CBD brands.\n\nHemp achievements: \n\n* Developed MariMed Hemp (MMH) as subsidiary for CBD initiatives.\n* Purchased 70% of MediTaurus, Whose Florance™ brand of CBD wellness products are well established in the US, UK and Europe. \n* MediTaurus holds significant intellectual property (IP) from scientific research &amp; formulation.\n* Developing new brands of CBD health and beauty products with 100% GMP compliant value chain from seed-to-sale.\n\nHemp Products:\n\n*Florance:*\n\nThe Florance™ brand was internationally recognized and known for the highest quality health and wellness products in the early 1900s. Over the years, leading scientists and doctors cultivated and sourced the most unique strains of hemp and produced and tested the highest quality propriety formulations, which evolved into a unique line of premium hemp CBD products.\n\nToday, Florance’s mission is to invent, develop, and distribute the most advanced, scientifically tested hemp-based food and nutritional products at affordable prices, backed by strong educational and clinical research platforms.\n\n*Seed Oil:*\n\nFlorance™  products are produced from U.S. organic hemp and EU certified organic hemp, along with with other organic fruits, berries and herbs. They contain no pesticides, herbicides or other harmful contaminants. Our products are third party tested in the U.S. and E.U. and we conform to the highest GMP standards.\n\nOther Hemp Information: \n\nhttps://preview.redd.it/m842r3mqot861.png?width=1204&amp;format=png&amp;auto=webp&amp;s=1454551637fc5e3c21c9d64ee2dd27040a938f14\n\n*Brands:* \n\nMariMed attempts to ensure products reflect consumer demands, from dosing specifications and discrete products to medical formulations.  The company starts with quality growing medium, rich genetics, and natural nutrients to formulate products for varying speeds and methods of delivery. The products always include a wide array of dosing preferences, and rich terpene profiles.\n\n&amp;#x200B;\n\n* Industry leader in cutting-edge, more precise and cleaner technology and packaging to better appeal to new and existing customers.\n* Licensees manufacture and distribute our branded products to 1/3 of all states that have legal sales.\n* Expanding licensees manufacture and distribution channels, encompassing thousands of dispensaries and additional retail outlets.\n* Build distribution networks in MariMed managed facilities and strategic partners throughout the country.\n\n*CRM Technology:* \n\nFocusing on lifetime customer value and consumer engagement. \n\n&amp;#x200B;\n\n* CRM Software by Sprout, a market leading innovator with customized solutions that **enhance revenues and margins** by creating stronger customer loyalty and brand targeting that builds awareness.\n* Cannabis companies **increase revenues and profit margins by engaging their customers**, creating brand awareness and driving online and in-store orders.\n* Combination of Multi-Media Messaging (MMS), Standard Messaging (SMS), Mobile Coupons, Mobile Surveys and Email Marketing.\n\n*Research &amp; Education:*\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lznnhsvnrt861.png?width=1282&amp;format=png&amp;auto=webp&amp;s=931be9e1f6fb68b55341e409b12f596423b5f731\n\n***Partnerships:***\n\n*Licensed Partners:*\n\n&amp;#x200B;\n\n[First State Compassion operates two medical dispensaries in Lewes and Wilmington, DE as well as a stated of the art regulatory compliant cultivation and production facility in Wilmington. ](https://preview.redd.it/h8zz2ysbst861.png?width=302&amp;format=png&amp;auto=webp&amp;s=fe2922e9731feb64655c219bd48240710031ff62)\n\nUnder the advisement of MariMed, FSC has opened two medical cannabis dispensaries. \n\n[https://marimedinc.com/2016/07/02/first-state-compassion-center-off-to-great-start-with-marimed-advisors/](https://marimedinc.com/2016/07/02/first-state-compassion-center-off-to-great-start-with-marimed-advisors/)\n\n[https://www.globenewswire.com/news-release/2017/06/01/1005337/0/en/MariMed-Client-FSCC-Opens-Delaware-s-2nd-Medical-Cannabis-Facility.html](https://www.globenewswire.com/news-release/2017/06/01/1005337/0/en/MariMed-Client-FSCC-Opens-Delaware-s-2nd-Medical-Cannabis-Facility.html) \n\n[Thrive has integrated MariMed's knowledge, experience and best practices across all areas into its dispensary services. Thrive's mission is to help its clients and patients flourish while elevating the industry standard for culture, compliance, customer, community and care. ](https://preview.redd.it/9k316ys7tt861.png?width=268&amp;format=png&amp;auto=webp&amp;s=cedc9b390de112e58fb65c097a682410b7b8b18e)\n\nMariMed was granted approval to open their third dispensary in Illinois. \n\n\"The dispensary in Mount Vernon, IL, which operates under the Thrive brand, will open on September 21, 2020 with a grand opening scheduled for September 25, 2020.\"\n\n[https://thriveil.com/third-dispensary-in-illinois/](https://thriveil.com/third-dispensary-in-illinois/)\n\n&amp;#x200B;\n\n[ARL Healthcare, Inc, is a Massachusetts corporation that has been awarded a Registered Marijuana Dispensary \\(RMD License\\) by the State of Massachusetts. It will operate a cultivation and production manufacturing facility in New Bedford and dispensaries in Middleborough and other locations in MA.](https://preview.redd.it/nw0synykut861.png?width=422&amp;format=png&amp;auto=webp&amp;s=98925bac468db7cbafafc5d4c879081d20f838bc)\n\nNovember 28th, 2017: MariMed purchases a 137,500 sq. ft. industrial building on 17 acres at 167 John Vertente Blvd., in the New Bedford, Mass., industrial park for a purchase price of $6,895,000. MariMed will develop approximately 70,000 sq. ft. into a full service state of the art medical cannabis cultivation and production facility that has been leased to ARL Healthcare, Inc.\n\n[https://www.canadianinsider.com/marimed-purchases-new-bedford-building-leases-to-arl-healthcare-for-cannabis-cultivation](https://www.canadianinsider.com/marimed-purchases-new-bedford-building-leases-to-arl-healthcare-for-cannabis-cultivation)\n\nMariMed Harvests its First Cannabis Crop in Massachusetts Amidst State-Wide Flower Shortage (Estimated to ramp up to approximately 1,000 pounds per month, including a variety of high grade cannabis from top genetic strains  operating through its wholly owned, licensed subsidiary, ARL Healthcare, Inc.)\n\n[https://www.globenewswire.com/news-release/2020/02/24/1989312/0/en/MariMed-Harvests-its-First-Cannabis-Crop-in-Massachusetts-Amidst-State-Wide-Flower-Shortage.html](https://www.globenewswire.com/news-release/2020/02/24/1989312/0/en/MariMed-Harvests-its-First-Cannabis-Crop-in-Massachusetts-Amidst-State-Wide-Flower-Shortage.html)\n\n&amp;#x200B;\n\n[Binske is a multi-state cannabis brand operating in 11 U.S. states. knowing for its best-in-class proprietary strains and craft ingredients which has earned it multiple awards including Leafly's Best Edibles, Best Concentrates, and Best Overall Company. The company is a division and registered trademark of privately held, Denver-based Praetorian Global. ](https://preview.redd.it/f6pll68myt861.png?width=382&amp;format=png&amp;auto=webp&amp;s=0f24016aca63c2d2f1a423d3e0bb66da983b2503)\n\nMariMed Inc. Signs Multi-State Licensing Agreement to Bring Binske Cannabis Brands to Eastern Markets - MariMed is licensed to manufacture and distribute the Binske portfolio of products in seven states: Illinois, Ohio, Massachusetts, Rhode Island, Maryland, Delaware, and Maine, adding substantially to the availability of Binske brands, which are currently licensed in Colorado, Nevada, Florida, and California.   The Binske brands include a variety of consumer options, including concentrates, edibles, vaporizers, and topicals. \n\n[https://www.globenewswire.com/news-release/2019/07/30/1893672/0/en/MariMed-Inc-Signs-Multi-State-Licensing-Agreement-to-Bring-Binske-Cannabis-Brands-to-Eastern-Markets.html](https://www.globenewswire.com/news-release/2019/07/30/1893672/0/en/MariMed-Inc-Signs-Multi-State-Licensing-Agreement-to-Bring-Binske-Cannabis-Brands-to-Eastern-Markets.html)\n\n*Hemp CBD:*\n\n&amp;#x200B;\n\n[In 2019, MariMed Hemp acquired 70&amp;#37; of MediTaurus, LLC which owns the high-end Florance brand of CBD products and their related intellectual property. It also brings Dr. Jokub as Ziburkus as MariMed's Chief Innovation Officer. MediTaurus reinforces MariMed's efforts to advance the field of scientific research into applications and efficacy of CBD and other cannabinoids. ](https://preview.redd.it/ofnn2co10u861.png?width=478&amp;format=png&amp;auto=webp&amp;s=d45201dde5a4abc9ae82805d420bc6a08ac46731)\n\n## The acquisition will provide synergy and opportunities for both firms\n\nDr. Žiburkus also believes that the currently rapid growth in the medical cannabis and hemp industries presents a lot of opportunities that can be tapped through synergies from consumers, medical practitioners and scientists. He also believes that the transaction between MediTaurus and MariMed will allow his company to tap into all the known benefits of the cannabis plant.\n\nMariMed CEO Bob Fireman noted that the transaction will be vital to his company. As far as operations are concerned, the deal will allow the Florance brand TO strengthen its MariMed Hemp division through its robust and premium CBD health and wellness products. The acquisition will also provide MariMed with access to MediTaurus’ IP as well as European partnerships.\n\n[https://ca.style.yahoo.com/marimed-purchase-70-meditaurus-100027480.html](https://ca.style.yahoo.com/marimed-purchase-70-meditaurus-100027480.html)\n\n*Support:*\n\n&amp;#x200B;\n\n[Sprout's CRM and marketing automation software combines technology, data and content to help dispensaries and cannabis brands increase sales, improve customer loyalty and build awareness. MariMed will accelerate the growth of Sprout's client base by marketing it to the top dispensaries and cannabis companies in the United States. ](https://preview.redd.it/dxddd5t01u861.png?width=388&amp;format=png&amp;auto=webp&amp;s=8a715b358907f428a322318b838f1be08f137c7b)\n\n“The cannabis industry needs a comprehensive software solution which integrates a full featured CRM engine and platform for marketing, education, and analysis for brands, dispensaries, educators, and researchers,” said MariMed CEO Robert Fireman. “The Sprout platform has the foundation for these functions and more. MariMed will work with the Sprout team to make this software the best for the cannabis industry. This product enables MariMed to provide a bundled technology solution for its brands, facilities, and strategic partnerships incorporating both B2B and B2C communications.”\n\n[https://www.globenewswire.com/news-release/2018/09/27/1577249/0/en/MariMed-Completes-Strategic-Investment-in-Sprout.html](https://www.globenewswire.com/news-release/2018/09/27/1577249/0/en/MariMed-Completes-Strategic-Investment-in-Sprout.html)\n\n&amp;#x200B;\n\n[iRollies was acquired by MariMed in 2018, growing an in-house ability to develop, improve and effectively market new and existing brands through packaging and promotional campaigns. iRollie also contracts with other suppliers. ](https://preview.redd.it/tmcs80pk1u861.png?width=488&amp;format=png&amp;auto=webp&amp;s=77c7f90c3db0184d9234a95d2973b2bdee1e3d32)\n\nMariMed hired iRollie’s cofounders Luke Shepter and Joe Khoury to expand the iRollie business as well as to bring their expertise and services in house to support MariMed brands and clients. MariMed acquired iRollie and its executives in exchange for $600,000 in MariMed stock. \n\n**GAVE UP STOCK FOR iRollie. No company would do this unless they believe in the purchase and believe it will help expand the company down the road.** \n\n[https://www.globenewswire.com/news-release/2018/07/24/1541215/0/en/MariMed-Acquires-iRollie-to-Support-MariMed-Brands-Expand-into-Ancillary-Cannabis-Service-Offerings.html](https://www.globenewswire.com/news-release/2018/07/24/1541215/0/en/MariMed-Acquires-iRollie-to-Support-MariMed-Brands-Expand-into-Ancillary-Cannabis-Service-Offerings.html)\n\n**The Team:** \n\nEvery Member is carefully selected: \"A company is only as good as it’s people. So, to have the best products, we must find and retain the best people. We’re proud of our team’s dedicated contribution to MariMed and our partners.\"\n\n&amp;#x200B;\n\n[Successful entrepreneur, attorney and investor with a diversified portfolio. Robert was an early pioneer and visionary in evolving legal medical cannabis industry over the last 20 years.](https://preview.redd.it/5l4geler2u861.png?width=282&amp;format=png&amp;auto=webp&amp;s=439293d799ac56d1d240867f07b6181f5a5fa2e7)\n\n&amp;#x200B;\n\n[Specialist in state-of-the-art cannabis facility design and cultivation system management. With Tim having specific expertise in agriculture and hydroponics, he helps drive the next generation cultivation processes to maintain industry edge.](https://preview.redd.it/ygjfhtov2u861.png?width=286&amp;format=png&amp;auto=webp&amp;s=663afddef4b89cc6a5b57d690c162bbe4c35b6c2)\n\n&amp;#x200B;\n\n[Cannabis product development expert with a proven track record of global sales and business development.Ryan co-founded Betty’s Eddies which MariMed acquired in 2017.](https://preview.redd.it/7amd8ahz2u861.png?width=286&amp;format=png&amp;auto=webp&amp;s=9a56269cb3cf176a41deed612d15f498f6f88e07)\n\n&amp;#x200B;\n\n[Operational experience in real estate and healthcare industries.Jon is in charge of financial operations, cannabis tax reporting and code requirements that exceed regulator expectations.](https://preview.redd.it/pw0l8nb33u861.png?width=282&amp;format=png&amp;auto=webp&amp;s=3fb23c786d0a4d44e3e68011181fd8567011c035)\n\n**Financials:** \n\nThe following information is from the third quarter 2020 results: \n\n[https://ir.marimedinc.com/news-events/press-releases/detail/132/marimed-reports-third-quarter-2020-results](https://ir.marimedinc.com/news-events/press-releases/detail/132/marimed-reports-third-quarter-2020-results)\n\n*Highlights:*\n\n* Core cannabis revenues of $13.5 million in Q3 represent a 220% increase compared with $4.2 million in Q3 2019. For the nine months ended September 30, 2020, core cannabis revenues totaled $30.5 million, a 168% increase compared with $11.4 million for the first nine months of 2019;\n* Gross profit from the core cannabis business increased 221% to $8.7 million for Q3 compared with $2.7 million for the same period in 2019. For the nine months ended September 30, 2020, gross profit from the core cannabis business totaled $19.7 million, a 159% increase from $7.6 million for the first nine months of 2019;\n* EBITDA for Q3 was $4.4 million compared to an EBITDA loss of $733,000 for the same period in 2019. For the nine months ended September 30, 2020, EBITDA totaled $8.6 million compared to an EBITDA loss of $1.3 million for the first nine months of 2019;\n* The foregoing 2019 revenues, gross profit and EBITDA information have been adjusted, for comparative purposes, to remove the impact from the one-time sales of hemp seeds during the same periods in 2019; and\n* The Company continues to take steps to improve financial flexibility and improve liquidity through debt restructuring activities.\n\nJon Levine, CFO of MariMed, added “During the quarter, we improved our balance sheet and financial flexibility by converting short-term, high interest rate debt to longer-term debt on much more attractive terms. We appreciate our lenders’ and investors’ continued support and believe this result reflects both the recognition of our progress to date, and shared confidence in our business strategy.”\n\n**Where The Company is Headed:**\n\n* Extend geographic reach through direct ownership of cannabis licenses and related seed-to-sale operations in US and internationally.\n* Expand presence in new hemp-derived CBD market with premium materials and products.\n* Enhance Marketing and customer education of products, benefits and changing modalities.\n* Continue to provide best in class development, management and operational advisory to approved facilities nationwide.\n* Enter ancillary services at the top and bottom of supply chains, including seeds, branded products and e-commerce retail. \n* Advance field of research to legitimize and strengthen our go-to-market reach.\n\n**Technical Analysis:** \n\nI am not good with technical analysis. I am a big fan of Petedoom on twitter and his analysis. I have linked it below: \n\n[https://twitter.com/petedoom/status/1343565915103879168?s=20](https://twitter.com/petedoom/status/1343565915103879168?s=20)\n\n[https://twitter.com/petedoom/status/1343891292141596679?s=20](https://twitter.com/petedoom/status/1343891292141596679?s=20)\n\n**Why I Like It:** \n\nMariMed in my opinion seems heavily undervalued. The company has increased revnues by 220% from Q3 2019 and increased gross profits by 221%. The company has a vast majority of partnerships which seem to bolster MariMed's profitability. The company has a vast array of products with good brands, CRM technology, education and research to support it. \n\nLastly, the marijuana legalization bill passed in the house recently. Despite the Senate vote being unlikely, under a Biden administration Cannabis should head up. \n\nLook in Mexico what's happening: \n\n[https://twitter.com/tomangell/status/1345075802405281792?s=20](https://twitter.com/tomangell/status/1345075802405281792?s=20)\n\nUSA: \n\n[https://www.congress.gov/bill/116th-congress/house-bill/3884](https://www.congress.gov/bill/116th-congress/house-bill/3884)\n\nCanada: \n\nLook at similar Canadian plays! \n\nAll in all, with everything MariMed has to offer the company is currently valued at 47 cents? Seems heavily undervalued to me. I believe that if cannabis plays heat up, this most certainly could be one to heat up too. \n\n&amp;#x200B;\n\nHope you guys enjoyed! Let me know your thoughts!\n\n&amp;#x200B;\n\n**DISCLAIMER:** \n\n**I AM NOT A FINANCIAL ADVISOR NOR IS THIS ADVICE TO GO AND PURCHASE MARIMED STOCK $MRMD. I AM SIMPLY PASSING ALONG RESEARCH I HAVE GATHERED. THIS STOCK IS AN OTC (HIGHER RISK). BUYING/SELLING MARIMED STOCK WOULD BE AT THE DOING OF YOUR OWN. PLEASE DO NOT INVEST BLINDY, NOR USE THIS AS YOUR ONLY SOURCE OF INFORMATION.**",
        "subreddit": "pennystocks",
        "title": "MariMed ($MRMD) Fundamental DD **LONG READ**",
        "url": "https://www.reddit.com/r/pennystocks/comments/kopn8r/marimed_mrmd_fundamental_dd_long_read/",
        "created": 1609586293.0
    },
    {
        "author": "SportsLaughs",
        "created_utc": 1609558706,
        "id": "kopysk",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Here are some random tickers\n\nI know r/wsb had their longs out since october\n\nWhat were they and how are they looking going into earnings?\n\n&amp;#x200B;\n\n \n\nHere are some earnings dates coming up - totally random bunch -\n\nFCEL 1/08  \n1/14 Blackrock  \nAMD 1/28  \nMA 1/28  \nAMZN 1/29  \nAAPL 1/29  \nCAT 1/29  \nhumana 2/03  \ncern 2/0  \nseneca 2/03  \nCRSR 2/03  \nF 2/04  \nDIS 2/04  \nTWLO 2/04  \nSONOS 2/04  \nSNAP 2/04  \nPTON 2/04  \nSTVI 2/05  \nTRNO 2/05  \nTWTR 2/09  \nCME 2/10  \nTHS 2/10  \nCHGG 2/1  \nLYFT 2/10  \nNVDA 2/11  \nROKU 2/12  \nUA 2/12  \nCRES 2/12  \nSHOP 2/12  \nSHAK 2/12  \nYETI 2/12  \nLSI 2/17\n\n[r/wsb](https://www.reddit.com/r/wsb/) had all this shit done by october, but which of your contracts are paying out?\n\nsay position and %s",
        "subreddit": "wallstreetbets",
        "title": "Earnings Season Option Longs",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kopysk/earnings_season_option_longs/",
        "created": 1609587506.0
    },
    {
        "author": "SportsLaughs",
        "created_utc": 1609552009,
        "id": "koo4za",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Here are some earnings dates coming up - totally random bunch - \n\n&amp;#x200B;\n\n FCEL 1/08  \n 1/14 Blackrock  \n LGI 1/19  \n AMD 1/28  \n MA 1/28  \n AMZN 1/29  \n AAPL 1/29  \n CAT 1/29  \n humana 2/03   \ncern 2/0  \n seneca 2/03  \n CRSR 2/03  \n F 2/04  \n DIS 2/04  \n TWLO 2/04  \n SONOS 2/04  \n SNAP 2/04  \n PTON 2/04  \n STVI 2/05  \n TRNO 2/05  \n TWTR 2/09  \n CME 2/10  \n THS 2/10  \n CHGG 2/1  \n LYFT 2/10  \n NVDA 2/11  \n ROKU 2/12  \n UA 2/12  \n CRES 2/12  \n SHOP 2/12  \n SHAK 2/12  \n YETI 2/12  \n LSI 2/17\n\n&amp;#x200B;\n\nr/wsb had all this shit done by october, but which of your contracts are paying out? \n\nsay position and %s",
        "subreddit": "wallstreetbets",
        "title": "Earnings Date Longs Ideas",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/koo4za/earnings_date_longs_ideas/",
        "created": 1609580809.0
    }
]