[
    {
        "author": "Last_Interview_4332",
        "created_utc": 1636439651,
        "id": "qpxq94",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": "**BULL CASES**\n\n/1. INTC is the only real US chip manufacturer that can reasonably compete with Korean Samsung and Taiwanese TSMC (-100 credit score for acknowledging Taiwan). It is getting lots of literal boat load of cash(probs something like $50B equivalent) from the government that is positive for the shareholders, while maintaining the buybacks and dividends.\nYes, TSMC and others are also hedging and gonna start making some chips in USA but realistically the gubment will give most of the cash to INTC.\n\n/2. US gubment is in a cold war with China, this means it's also a technological warfare. This means supercomputers, missile, Starlink chips(private company) etc and Intel is likely going to be one of the prime suppliers of this boom in tech investment.\n\n/3. TSMC and Samsung are pretty much bottlenecked. Apple, AMD, NVIDIA, Qualcomm, Mediatech, Broadcom, various carmakers, electronics manufacturers etc and not to mention Intel themselves are a big buyer. Specifically, Intel and Apple has bought out all capacity of TSMC 3nm(equivalent to Intel's 5 nm probs, I forgot). This means there is an enormous demand that is not being fulfilled and Intel launching their foundry services and already signing deals with Qualcomm, Amazon is a big deal.\n\nFor reference, TSMC's market cap is bigger than 3 Intel (yes, that's a unit I invented). In 2024-2025, you might even see Apple, NVIDIA and the likes fabricating their chips from Intel just to give a big F U to TSMC (who is currently slightly overcharging if the rumours are to be believed).\n\n/4. Intel is launching a GPU. The GPU market is also in a huge bottleneck due to higher demand from gamers and corn miners. Everyone expects that they are likely to sell their GPUs very easily. Think about this for a sec. Intel is just about to become one of the players in this huge GPU market.\nWhich would also make way for their server GPUs and AIs and the likes.\n\n/5. Think 10-15 years from now. Your fridge, doorbell, light, heating system and every ducking thing will have some chips and Intel is likely to remain a dominant player in this market. I think this will be bigger than the current entire semi market as it is. IOT is just getting started.\n\n/6. Intel is one of the forerunner player in AI techs like autonomous vehicles through their various investments(Mobil eye for one) and will likely remain so. I don't know how big this will be in 10 years, but it's likely that Intel will be one of the bigger players in the market like Google (through Waymo), Tesla and NVIDIA.\n\n/7. Intel also recently launched their big little architecture, where it has already became competitively better than AMD especially in gaming with low power consumption and huge power. Not to mention being very power efficient most of the time for using its efficiency cores most of the time. Not that it matters that much, seeing the gamer Steam reports, very few people actually play on the latest of the latest gen. But, that's also something that's worth noting at least. \n\nHowever, the vast majority of pc sales is in just your average boomer laptops and desktops. And they have a good lead there.\n\n*Tips for those wanting to build a high end new pc. Wait for Intel's lineup to be available broadly, high end pc gamers will dump their last gen AMD chips for the Intel one in the second hand market, causing a flooding of cheap AMD CPUs, buy one of them. Source: Did this once.*\n\n/8. One worrying factor is in the server market. Everyone seems to be launching their own server chips and AMD is very competitive and eating away market share. But Intel's management seems to be guiding us towards the right path. If their predictions prove to be right, they are on the right track.\n\n/9. Intel announced that they will launch Angstrom scale CPUs in the future, that's good I guess. They are also working in RISC-V and other CPU architectures.\n\n/10. Pat has an approval rating of 96% in Glassdoor and the employees would recommend others to work in Intel 89% of the time. This is a huge ass jump for both scores from the Bob Swan era. Go to Wayback Machine, you will see. This means a noticeable change has taken place within this huge organisation in such a short time.\n\n/11. Intel stock always seem to have price support at around $50. And it's near that range right now.\n\n/12. Most analysts are bullish on the stock. Comparatively cheap stock in this clown market. Wanna buy a $5.48B gravity powered truck company anyone?\n\n/13. Intel actually has one of the highest talented employee pull who can be expected to deliver. Contrary to popular belief.\n\n**Bear Cases**\n\n/1. This is a boomer stock according to reddit's circejerk. So, it's difficult to convince people that it is actually expected to grow around 11% CAGR just by the current demand circumstances alone by management's conservative estimates for the next few years. This is mega bearish. If the market doesn't care about a stock, no matter what the management do, the stock will not perform.\n\n/2. Intel has repeatedly failed to prove that their foundry division's predictions are reliable. If they went fabless like AMD, it would have probably rocketed already. But a big part of the cheapness of the stock comes from the unreliability of their foundry division. Yes, the management has finally started getting serious about their foundry, but one cannot ignore their past failures.\n\n/3. Government contracts and the likes are not completely free money like some of you believe, delays in delivery and contract fulfillment could make what is essentially a free money glitch to a costly mistake and a billion dollar loss with a brink of an eye. The terms are generally very strict, so Intel has to deliver.\n\n/4. Investments are going to be a lot and semiconductor industry being cyclical means, if Intel fails to deliver, its market share will be eaten away and lose billions in potential profit.\n\n/5. Stock seems to be largely rangebound like Microsoft was for 15 years.\n\n[positions or ban. bought 100 shares for now. will be selling some puts to enter into more. And then around the next earnings, will buy some calls](https://imgur.com/a/xxYyDIE)",
        "subreddit": "stocks",
        "title": "Intel: The second coming of christ",
        "url": "https://www.reddit.com/r/stocks/comments/qpxq94/intel_the_second_coming_of_christ/",
        "created": 1636468451.0
    },
    {
        "author": "Joa1907",
        "created_utc": 1636252336,
        "id": "qof941",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Gather round fellow companions, grab your wife’s boyfriend’s wallets and let me introduce you to this tendie factory opportunity for you to put money you cannot afford to lose and change your life.\n\nAlthough I like eating Mac n cheese, mj and masturbating on any Friday night, today I call for your attention for three different Ms, literally. $MMM is a manufacturing company blah blah boring shit, they have their hands on basically everything including sticky notes, paint, medical respirators and a lot more stuff… especially construction stuff.\n\nTHE ANALYSIS\n\nBiden’s’ infrastructure plan passed congress, many companies will benefit. The thing is, 3M is so broadly present in the sectors that will be invested on by the government that it is nearly impossible for it not to benefit. It’s like that awkward friend that you knows everyone around you so he goes to all the parties and stuff but you don’t really know know them and just awkwardly say hi, but he seems to be really close to everyone you know just not you for some reason… ya feel? \n\nAnyways, offering EV battery solutions, mostly insulating materials; and we know how hot that sector is right now.\n\nBut not only EVs will benefit, 3M is all around the manufacturing industry with abrasives, paints, bonding and more. Even touching the Broadcom sector.\n\nWhat I mean is, when Biden passed this bill, 3M execs bought a Beverly Hills house for each one of their dog’s toys. And these are rich dogs. Think about it.\n\nTHE TA\n\nNow for the part that you are waiting for, your daily horoscope reading for a random stock with badly drawn lines and numbers you don’t understand… but don’t worry cause I don’t either.\n\nSee, the stock has been trading in this triangle, which is on the brink of breakout, in fact when voting started for the bill on Friday morning we can see how much momentum it gained; until they said they were delaying voting.\n\nhttps://charts.equityclock.com/3m-company-nysemmm-seasonal-chart\n\nAlso here’s graphs of stock performance during the months of September through December, beating SPY by about 2% and there are not weak months for SPY usually.\n\nCONCLUSION\n\nMMM is primed for a breakout Monday after the bill passing. The best part is the price of the contracts, with 190 contracts being merely around $30. With the movement of this stock Friday morning, I am sure the stock will rally with this incredible catalyst. \n\nPOSITION\n21 190C 11/19\n2 Shares",
        "subreddit": "wallstreetbets",
        "title": "The three Ms you’ll want by Monday",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qof941/the_three_ms_youll_want_by_monday/",
        "created": 1636281136.0
    },
    {
        "author": "Last_Interview_4332",
        "created_utc": 1636435040,
        "id": "qpwkcu",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "**BULL CASES**\n\n/1. INTC is the only real US chip manufacturer that can reasonably compete with Korean Samsung and Taiwanese TSMC (-100 credit score for acknowledging Taiwan). It is getting lots of literal boat load of cash(probs something like $50B equivalent) from the government that is positive for the shareholders, while maintaining the buybacks and dividends.\nYes, TSMC and others are also hedging and gonna start making some chips in USA but realistically the gubment will give most of the cash to INTC.\n\n/2. US gubment is in a cold war with China, this means it's also a technological warfare. This means supercomputers, missile, Starlink chips(private company) etc and Intel is likely going to be one of the prime suppliers of this boom in tech investment.\n\n/3. TSMC and Samsung are pretty much bottlenecked. Apple, AMD, NVIDIA, Qualcomm, Mediatech, Broadcom, various carmakers, electronics manufacturers etc and not to mention Intel themselves are a big buyer. Specifically, Intel and Apple has bought out all capacity of TSMC 3nm(equivalent to Intel's 5 nm probs, I forgot). This means there is an enormous demand that is not being fulfilled and Intel launching their foundry services and already signing deals with Qualcomm, Amazon is a big deal.\n\nFor reference, TSMC's market cap is bigger than 3 Intel (yes, that's a unit I invented). In 2024-2025, you might even see Apple, NVIDIA and the likes fabricating their chips from Intel just to give a big F U to TSMC (who is currently slightly overcharging if the rumours are to be believed).\n\n/4. Intel is launching a GPU. The GPU market is also in a huge bottleneck due to higher demand from gamers and corn miners. Everyone expects that they are likely to sell their GPUs very easily. Think about this for a sec. Intel is just about to become one of the players in this huge GPU market.\nWhich would also make way for their server GPUs and AIs and the likes.\n\n/5. Think 10-15 years from now. Your fridge, doorbell, light, heating system and every ducking thing will have some chips and Intel is likely to remain a dominant player in this market. I think this will be bigger than the current entire semi market as it is. IOT is just getting started.\n\n/6. Intel is one of the forerunner player in AI techs like autonomous vehicles through their various investments(Mobil eye for one) and will likely remain so. I don't know how big this will be in 10 years, but it's likely that Intel will be one of the bigger players in the market like Google (through Waymo), Tesla and NVIDIA.\n\n/7. Intel also recently launched their big little architecture, where it has already became competitively better than AMD especially in gaming in both power consumption and power. Not that it matters that much, seeing the gamer Steam reports, very few people actually play on the latest of the latest gen. But, that's also something that's worth noting at least. \n\nHowever, the vast majority of pc sales is in just your average boomer laptops and desktops. And they have a good lead there.\n\n*Tips for those wanting to build a high end new pc. Wait for Intel's lineup to be available broadly, high end pc gamers will dump their last gen AMD chips for the Intel one in the second hand market, causing a flooding of cheap AMD CPUs, buy one of them. Source: Did this once.*\n\n/8. One worrying factor is in the server market. Everyone seems to be launching their own server chips and AMD is very competitive and eating away market share. But Intel's management seems to be guiding us towards the right path. If their predictions prove to be right, they are on the right track.\n\n/9. Intel announced that they will launch Angstrom scale CPUs in the future, that's good I guess. They are also working in RISC-V and other CPU architectures.\n\n/10. Pat has an approval rating of 96% in Glassdoor and the employees would recommend others to work in Intel 89% of the time. This is a huge ass jump for both scores from the Bob Swan era. Go to Wayback Machine, you will see. This means a noticeable change has taken place within this huge organisation in such a short time.\n\n/11. Intel stock always seem to have price support at around $50. And it's near that range right now.\n\n/12. Most analysts are bullish on the stock. Comparatively cheap stock in this clown market. Wanna buy a $5.48B gravity powered truck company anyone?\n\n/13. Intel actually has one of the highest talented employee pull who can be expected to deliver. Contrary to popular belief.\n\n**Bear Cases**\n\n/1. This is a boomer stock according to reddit's circejerk. So, it's difficult to convince people that it is actually expected to grow around 11% CAGR by management's conservative estimates.\n\n/2. Intel has repeatedly failed to prove that their foundry division's predictions are unreliable. If they went fabless like AMD, it would have probably rocketed already. But a big part of the cheapness of the stock comes from the unreliability of their foundry division. Yes, the management has finally started getting serious about their foundry, but one cannot ignore their past failures.\n\n/3. Government contracts and the likes are not completely free money like some of you believe, delays in delivery and contract fulfillment could make what is essentially a free money glitch to a costly mistake and a billion dollar loss with a brink of an eye. The terms are generally very strict, so Intel has to deliver.\n\n/4. Investments are going to be a lot and semiconductor industry being cyclical means, if Intel fails to deliver, its market share will be eaten away and lose billions in potential profit.\n\n/5. Stock seems to be largely rangebound like Microsoft was for 15 years.",
        "subreddit": "wallstreetbets",
        "title": "Why Intel Is The Play. To the 🌗 and beyond.🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qpwkcu/why_intel_is_the_play_to_the_and_beyond/",
        "created": 1636463840.0
    },
    {
        "author": "trickintown",
        "created_utc": 1636195171,
        "id": "qnxoum",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "SOXX - the semiconductor's ETF holds 16.5% of its assets in 2 non-performing companies - Broadcom and Intel. Something I am missing that fund experts at Blackrock are seeing with these two companies?\n\nThis group has always been bullish on AMD and NVDA, so just wondering why the disconnect between us retail investors and the funds?",
        "subreddit": "stocks",
        "title": "SOXX's 2 Largest Holdings - INTC and AVGO",
        "url": "https://www.reddit.com/r/stocks/comments/qnxoum/soxxs_2_largest_holdings_intc_and_avgo/",
        "created": 1636223971.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1637015975,
        "id": "qushen",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, November 15, 2021**\n\nStocks finished mixed, with the Dow Jones (DIA) and tech-heavy Nasdaq (QQQ) closing modestly lower, as market participants digested upbeat economic data coming from China and await for a key report on retail sales in the US later this week. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed on the day, closing 0.44% lower.\n\nStronger than expected economic data coming out of China helped lift the sentiments of market participants following last week’s inflation report. The world's second-largest economy saw both retail sales and industrial production unexpectedly rise in October in a year-over-year period, suggesting that China’s economy is holding up better than expected amid new stay-in-place restrictions and ongoing power shortages. However, prices of new homes dropped 0.25% in October versus September, marking the biggest drop in more than six years as the nation’s real estate market remains under pressure from the Evergrande situation. Here are the numbers:\n\n* Retail Sales: +4.9% YoY vs +3.5 expected\n* Industrial Production: +3.5% YoY vs +3% expected\n\nTomorrow, market participants will receive the Commerce Department’s monthly Retail Sales report, which is expected to show a 1.3% year-over-year rise in retail sales, improving from September’s disappointing 0.7% rise. Moreover, major retailers like Walmart (WMT), Target (TGT), Home Depot (HD), and Lowe’s (LOW) are set to report Q3 earnings, which will offer additional data regarding the state of consumer demand.  \n\nLast week, markets were spooked by the pace of inflation, with the recent Consumer Price Index (CPI) showing the fastest pace of increase in roughly 30 years. which showed prices soared 6.2% in a year-on-year period, accelerating from September’s 5.4% YoY rate, and higher than the 5.9% expected. The staying power and magnitude of inflationary pressures has, perhaps, become the central question for market participants, with companies across the board reporting rising input costs and price hikes passed on to the consumers to preserve margins. While Q3 earning results have robustly demonstrated that companies in the SPY were largely able to navigate these cost pressures, the possibility remains that if inflation runs hotter than expected for longer than expected, it could begin to hamper consumer demand. \n\nIan Shepherdson, Chief Economist at Pantheon Macroeconomics, wrote in a note to clients, “The surge in core inflation in October marks the start of a run of big gains, thanks to surging used auto prices, rebounding airline fares, and faster increases in housing costs. We think core inflation will peak at almost 7% in March, which will pose a serious challenge to the Fed's benign medium-term view. Chair \\[Jerome\\] Powell will have to convince markets that the combination of rocketing payrolls and soaring inflation does not threaten the transitory story, to which he appears still to be committed. We remain of the view that the Fed will start to hike in September, but a June hike can't be ruled out. If labor participation shows no sign of life by the March FOMC meeting, we expect the Fed to accelerate the taper and then hike in June. This would play badly across all asset markets.” As always, it is important to acknowledge and understand the risks present in the market. \n\n**Highlights**\n\n* Shares of Boeing (BA) surged after the company said it was “hopeful” China would resume order of the 737 Max two years after its grounding. \n* U.S. crude oil output from the Permian Basin of West Texas and New Mexico is set to jump to a record 4.95 million barrels per day in December, a new government forecast showed on Monday. This would bring production in the key U.S. shale patch well above its pre-pandemic average from March 2020.\n* Shares of oat-milk maker Oatly (OTLY) fell more than 20% after missing earnings expectations and cutting guidance. The stock is down roughly 50% since IPO back in late-May. \n* Shares of Snap (SNAP) were up after the company reached a deal with Sony Music Entertainment to allow the company to use its artist and sounds on the Snapchat App. \n* Twitter Inc said on Monday it will expand free access to the social networking site's data to help software developers create tools and products that could promote safer online conversations or curate content. The move is part of Twitter's growing effort over the past year to decentralize the company, a vision that aims to give users more control over what content they see in their Twitter feed or have new ways of sharing content on the site, Amir Shevat, Twitter's head of product for the developer platform, said in an interview.\n* Amazon.com Inc has reached a deal to sell virtual medical services to Hilton Hotels in the United States, one of the first major customers for the company’s burgeoning healthcare business. Amazon Care is an on-demand health offering that lets users message or video-chat clinicians and receive home visits in some cities.\n* UK ministers are expected to order an in-depth investigation of Nvidia Corp's planned $40 billion acquisition of British chip designer ARM over antitrust and national security concerns. As a huge NVDA bull, hope all goes well!\n* Social Finance Tech (SOFI) announced an offering of 50 million shares. The stock is down as a result. Not surprising for management to take advantage of this massive runup\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AutoDesk (ADSK) target raised by Mizuho from $350 to $380 at Buy. Stock currently around $326\n* Broadcom (AVGO) target raised by Argus from $560 to $620 at Buy. Stoick currently around $565\n* Coupang (CPNG) target raised by Mizuho from $32 to $40 at Overweight. Stock currently around $28\n* Salesforce (CRM) target raised by Mizuho from $320 to $360 at Buy. Stock currently around $305\n* Crowdstrike (CRWD) target raised by Mizuho from $330 to $360 at Buy. Stock was also downgraded by Morgan Stanley to $250, so there are competing perspectives here\n* Intuit (INTU) target raised by Morgan Stanley from $615 to $715 at Overweight. Stock currently around $626\n* MasterCard (MA) target raised by Mizuho from $50 to $465 at Buy. Stock currently around $360\n* Netflix (NFLX) target raised by KeyCorp from $690 to $725 at Overweight. Stock currently around $680\n* NVIDIA (NVDA) with three target raises. Stock currently around $300 \n   * Citigroup from $223 to $350 at Buy\n   * Robert W Baird from $240 to $360 at Outperform\n   * UBS Group from $230 to $350 at Buy\n* Palo Alto Networks (PANW) with three target raises. Stock currently around $518\n   * Mizuho from $560 to $625 at Buy\n   * Deutsche Bank from $560 to $605 at Buy\n   * Royal Bank of Canada from $560 to $590 at Outperform\n* Roblox (RBLX) target raised by BTIG Research from $98 to $133 at Buy. Stock currently around $108\n* Signature Bank (SBNY) target raised by Raymond James from $360 at $400 at Outperform. Stock currently around $321\n* Snowflake (SNOW) target raised by Mizuho from  $340 to $450 at Buy. Stock currently around $393\n* Social Finance Tech (SOFI) target raised by Mizuho from $28 to $30 at Buy. Stock currently around $22\n* Valero Energy (VLO) target raised by Wells Fargo from $102 to $106 at Overweight. Stock currently around $77\n\n\"Don't judge each day by the harvest you reap but by the seeds that you plant.\" -Robert Louis Stevenson",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, Nov 15, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/qushen/here_is_a_market_recap_for_today_monday_nov_15/",
        "created": 1637044775.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1637016001,
        "id": "qushqe",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Monday, November 15, 2021**\n\nStocks finished mixed, with the Dow Jones (DIA) and tech-heavy Nasdaq (QQQ) closing modestly lower, as market participants digested upbeat economic data coming from China and await for a key report on retail sales in the US later this week. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed on the day, closing 0.44% lower.\n\nStronger than expected economic data coming out of China helped lift the sentiments of market participants following last week’s inflation report. The world's second-largest economy saw both retail sales and industrial production unexpectedly rise in October in a year-over-year period, suggesting that China’s economy is holding up better than expected amid new stay-in-place restrictions and ongoing power shortages. However, prices of new homes dropped 0.25% in October versus September, marking the biggest drop in more than six years as the nation’s real estate market remains under pressure from the Evergrande situation. Here are the numbers:\n\n* Retail Sales: +4.9% YoY vs +3.5 expected\n* Industrial Production: +3.5% YoY vs +3% expected\n\nTomorrow, market participants will receive the Commerce Department’s monthly Retail Sales report, which is expected to show a 1.3% year-over-year rise in retail sales, improving from September’s disappointing 0.7% rise. Moreover, major retailers like Walmart (WMT), Target (TGT), Home Depot (HD), and Lowe’s (LOW) are set to report Q3 earnings, which will offer additional data regarding the state of consumer demand.  \n\nLast week, markets were spooked by the pace of inflation, with the recent Consumer Price Index (CPI) showing the fastest pace of increase in roughly 30 years. which showed prices soared 6.2% in a year-on-year period, accelerating from September’s 5.4% YoY rate, and higher than the 5.9% expected. The staying power and magnitude of inflationary pressures has, perhaps, become the central question for market participants, with companies across the board reporting rising input costs and price hikes passed on to the consumers to preserve margins. While Q3 earning results have robustly demonstrated that companies in the SPY were largely able to navigate these cost pressures, the possibility remains that if inflation runs hotter than expected for longer than expected, it could begin to hamper consumer demand. \n\nIan Shepherdson, Chief Economist at Pantheon Macroeconomics, wrote in a note to clients, “The surge in core inflation in October marks the start of a run of big gains, thanks to surging used auto prices, rebounding airline fares, and faster increases in housing costs. We think core inflation will peak at almost 7% in March, which will pose a serious challenge to the Fed's benign medium-term view. Chair \\[Jerome\\] Powell will have to convince markets that the combination of rocketing payrolls and soaring inflation does not threaten the transitory story, to which he appears still to be committed. We remain of the view that the Fed will start to hike in September, but a June hike can't be ruled out. If labor participation shows no sign of life by the March FOMC meeting, we expect the Fed to accelerate the taper and then hike in June. This would play badly across all asset markets.” As always, it is important to acknowledge and understand the risks present in the market. \n\n**Highlights**\n\n* Shares of Boeing (BA) surged after the company said it was “hopeful” China would resume order of the 737 Max two years after its grounding. \n* U.S. crude oil output from the Permian Basin of West Texas and New Mexico is set to jump to a record 4.95 million barrels per day in December, a new government forecast showed on Monday. This would bring production in the key U.S. shale patch well above its pre-pandemic average from March 2020.\n* Shares of oat-milk maker Oatly (OTLY) fell more than 20% after missing earnings expectations and cutting guidance. The stock is down roughly 50% since IPO back in late-May. \n* Shares of Snap (SNAP) were up after the company reached a deal with Sony Music Entertainment to allow the company to use its artist and sounds on the Snapchat App. \n* Twitter Inc said on Monday it will expand free access to the social networking site's data to help software developers create tools and products that could promote safer online conversations or curate content. The move is part of Twitter's growing effort over the past year to decentralize the company, a vision that aims to give users more control over what content they see in their Twitter feed or have new ways of sharing content on the site, Amir Shevat, Twitter's head of product for the developer platform, said in an interview.\n* Amazon.com Inc has reached a deal to sell virtual medical services to Hilton Hotels in the United States, one of the first major customers for the company’s burgeoning healthcare business. Amazon Care is an on-demand health offering that lets users message or video-chat clinicians and receive home visits in some cities.\n* UK ministers are expected to order an in-depth investigation of Nvidia Corp's planned $40 billion acquisition of British chip designer ARM over antitrust and national security concerns. As a huge NVDA bull, hope all goes well!\n* Social Finance Tech (SOFI) announced an offering of 50 million shares. The stock is down as a result. Not surprising for management to take advantage of this massive runup\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AutoDesk (ADSK) target raised by Mizuho from $350 to $380 at Buy. Stock currently around $326\n* Broadcom (AVGO) target raised by Argus from $560 to $620 at Buy. Stoick currently around $565\n* Coupang (CPNG) target raised by Mizuho from $32 to $40 at Overweight. Stock currently around $28\n* Salesforce (CRM) target raised by Mizuho from $320 to $360 at Buy. Stock currently around $305\n* Crowdstrike (CRWD) target raised by Mizuho from $330 to $360 at Buy. Stock was also downgraded by Morgan Stanley to $250, so there are competing perspectives here\n* Intuit (INTU) target raised by Morgan Stanley from $615 to $715 at Overweight. Stock currently around $626\n* MasterCard (MA) target raised by Mizuho from $50 to $465 at Buy. Stock currently around $360\n* Netflix (NFLX) target raised by KeyCorp from $690 to $725 at Overweight. Stock currently around $680\n* NVIDIA (NVDA) with three target raises. Stock currently around $300 \n   * Citigroup from $223 to $350 at Buy\n   * Robert W Baird from $240 to $360 at Outperform\n   * UBS Group from $230 to $350 at Buy\n* Palo Alto Networks (PANW) with three target raises. Stock currently around $518\n   * Mizuho from $560 to $625 at Buy\n   * Deutsche Bank from $560 to $605 at Buy\n   * Royal Bank of Canada from $560 to $590 at Outperform\n* Roblox (RBLX) target raised by BTIG Research from $98 to $133 at Buy. Stock currently around $108\n* Signature Bank (SBNY) target raised by Raymond James from $360 at $400 at Outperform. Stock currently around $321\n* Snowflake (SNOW) target raised by Mizuho from  $340 to $450 at Buy. Stock currently around $393\n* Social Finance Tech (SOFI) target raised by Mizuho from $28 to $30 at Buy. Stock currently around $22\n* Valero Energy (VLO) target raised by Wells Fargo from $102 to $106 at Overweight. Stock currently around $77\n\n\"Don't judge each day by the harvest you reap but by the seeds that you plant.\" -Robert Louis Stevenson",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, Nov 15, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/qushqe/here_is_a_market_recap_for_today_monday_nov_15/",
        "created": 1637044801.0
    },
    {
        "author": "Everydayprice",
        "created_utc": 1637342090,
        "id": "qxksvf",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I really like the Broadcom stock semiconductors ( AVGO )",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qxksvf/i_really_like_the_broadcom_stock_semiconductors/",
        "created": 1637370890.0
    },
    {
        "author": "Everydayprice",
        "created_utc": 1637342384,
        "id": "qxkwlj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I really like the Broadcom stock (AVGO) Semi conductors",
        "url": "https://i.redd.it/n4ajy1h06l081.jpg",
        "created": 1637371184.0
    }
]