[
    {
        "author": "_gm90_",
        "created_utc": 1617522821,
        "id": "mjrul6",
        "num_comments": 330,
        "num_crossposts": 0,
        "selftext": "What stocks are you buying and holding for the next 5-20 years? \n\nIt’s pretty obvious that technology will be as big as ever - Im in Apple and Microsoft \n\nElectric cars will be huge - I’m in Tesla \n\nDisney - Disney plus set to overtake Netflix, Disney theme parks will expand and grow ( I’m in Disney) \n\nCash is slowing being removed from society - I’m in PayPal, square, visa, jp Morgan \n\nYolo play - I’m in pltr (got in at 21 dollars) I believe there’s a high chance of it being massive in the future\n\nGaming - I’m in draftkings, competitive gaming is a growing industry \n\n\nI am considering adding crsp with its discounting price \n\nWhat other industries or stocks should I consider?",
        "subreddit": "stocks",
        "title": "Long term stocks",
        "url": "https://www.reddit.com/r/stocks/comments/mjrul6/long_term_stocks/",
        "created": 1617551621.0
    },
    {
        "author": "willyumn",
        "created_utc": 1617320661,
        "id": "mi84qf",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "For context, I'm 22, make $25/hr but have pretty much no bills since I live with my parents, so my risk tolerance is pretty high. I have about 55 shares of Tesla after \"un-diversifying\" and selling all my other stock. I'm pretty much all in. I cannot find any other company that i can put my money in where growth is seemingly inevitable. I do own bitcoin but what are some equities that I can purchase over the next few months, or all at once with 10k cash? \n\nI have a tiny % of my portfolio in Oracle, Trimble, Crispr, Upstart, Square, Paypal, to give you an idea of what types of stocks I'm attracted to. (data, fintech, autonomy). I'm averse to companies with binary outcomes like bio, pharma, etc. Any interesting leads? :)",
        "subreddit": "stocks",
        "title": "Where should I put $10k?",
        "url": "https://www.reddit.com/r/stocks/comments/mi84qf/where_should_i_put_10k/",
        "created": 1617349461.0
    },
    {
        "author": "ticklemypicklesir",
        "created_utc": 1617567562,
        "id": "mk3zox",
        "num_comments": 239,
        "num_crossposts": 0,
        "selftext": "Using the lower end of  Paysafe’s forecasted EBITDA ($500M), $1.5B revenue, an EV adjusted for  $1.8B debt, and applying the post-merger pro forma 720M outstanding  shares, here are Paysafe’s potential share prices based solely on sector  peer **EV/EBITDA ratios:**\n\n⁃ PayPal : $269B EV/ $4.47B EBITDA\n\n    \t= 60.2x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $28.2B EV / SP: $39.28   \n\n⁃ Repay : $2.2B EV/ $30M EBITDA\n\n    \t = 73.3x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $34.8B EV / SP: $48.43   \n\n⁃ Shift 4 : $7.7B EV/ $90M EBITDA\n\n    \t= 85x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $41B EV / SP: $56.91   \n\n⁃ Nuvei : $15B EV/ $171M EBITDA\n\n    \t= 87.7x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $42B EV / SP: $58.40   \n\n⁃ Adyen : $56B EV/ $273M EBITDA\n\n    \t= 205x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $101B EV / SP: $139   \n\n⁃ Square : $107B EV/ $357M EBITDA\n\n    \t= 299.7x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $148B EV / SP: $205.64   \n\n⁃ [Bill.com](https://bill.com/) : $13.2B EV/ -$15.6M EBITDA\n\n    \t= 308x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $152B EV / SP: $211.39   \n\n⁃ Affirm: $21.6B EV/ -$68M EBITDA\n\n    \t= 317x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $156.7B EV /SP: $217.64   \n\nEV/Revenue ratio , non-public company’s with estimated revenue per recent funding rounds:\n\n⁃ Stripe : $95B EV/ $1.8B est. rev\n\n    \t= 52.8x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $77.3B EV / SP: $107.44   \n\n⁃ Chime : $30B EV/ $600M est. rev\n\n    \t= 50x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $73.2B EV /SP: $101.67   \n\n⁃ Checkout : $15B EV/ $100M est. rev\n\n    \t= 150x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $223.2B EV / SP: $310   \n\nNote: Most of these companies have negative earnings and smaller margins than Paysafe.\n\nI’m  not suggesting it’s worth this much, but for reference, averaging the  above multiples would put BFT/Paysafe’s share price at $135.98\n\nMore realistically, taking the average from the lowest four puts the share price at $50.75.\n\nPaysafe is the number 1 digital wallet in Igaming and is used by the top sports gambling company Draftkings. As all SPACs do now, it sold off big today with the ticker change so there has never been a better time to buy than now! \n\nNote : I’m long PSFE with 3,350 shares @15.47\n\nCredit all the numbers to u/greensymbiote",
        "subreddit": "wallstreetbets",
        "title": "$PSFE (Paysafe) the most undervalued fintech play on the market. Popular analyst Steve Grasso has been calling for it to triple.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mk3zox/psfe_paysafe_the_most_undervalued_fintech_play_on/",
        "created": 1617596362.0
    },
    {
        "author": "prettyboyv",
        "created_utc": 1617322503,
        "id": "mi8p2x",
        "num_comments": 199,
        "num_crossposts": 0,
        "selftext": "First of all, I would like to say that in this analysys I did not want to dwell too much into the technical aspects of the PLTR's software product or the financial performance of the company.  I am well aware that those are one of the most important fundamental elements when valuing a business and I did spend a lot of time on them while doing my research, before ultimately deciding to invest in the company. However I believe that most of the redditors on this forum , especially those that are already investors, already have at least basic understanding of PLTR's financial situation and the specifications of its software. In this thesis I will try to give my perspective about why I think PLTR is a low bottom company with significant potential for growth, based on more \"abstract\" and less known factors.\n\n&amp;#x200B;\n\n \n\nFirst of all, let's take a look at the commercial side of its business. Currently BP and Airbus contracts are responsible for 20 percent of the PLTR's revenue and some analyst think that such high-concentration is bad. However, they said the same think about PLTR's government work when the stock debuted. In short, they said that it is very worrying that PLTR generates such a high-percentage of its revenue from the U.S government and tried to convince investors to value PLTR not as a soft company, but as a defence contractor. I am glad that I did not listen to them at that time and bought the stock at 10 dollars, cuz my thinking was that if the U.S government values the PLTR's software so highly it is extremely likely that commercial businesess will do the same. Do you get where I am going? If Airbus and BP are paying the company more than 100 million dollars combined per year, then that means that PLTR's software is extremely efficient and if used right, could potentially safe customers hundreds of millions dollars of expenses or lost revenue. If you want more confirmation about how important the software could be for the business, have in mind that when partnering with the U.S Agency for Disease Control and Prevention, there are rumours that as early as January 2020 Palantir was able to build confidential models that showed the potential for a rapidly rising outbreak. Palantir then rushed in mid-February to recall staff from abroad and order them into a four-week quarantine. Now imagine if you knew about this as early as PLTR. March puts for the win.\n\nEven forgetting about the software and PLTR's growing revenue, let's take a look at some other factors that can't be measured by financial modelling. Currently PLTR is the only SaasS company in the world that is in talks to receive Impact Level 6 certification from the DoD. That means that PLTR will have access to classified information. Yeah, that is the kind of information that if you share with unauthorised personnel you go to prison for commiting treason against the state. Furthermore, the marine that participated in the operation of killing Bin Laden said in his book that PLTR soft. was instrumental in the sucess of the mission. To top it off , PLTR's lobbyist include figures like retired Marine Corps Brig. Gen. Terry Pau and ex- US State Secretary Condoleezza Rais and the new Director of National Intelligence in the Biden admin- Avril Haines is a former employee. Well, I think that we can say with great certainty that PLTR has become extremely important for the U.S government operations. If history has taught us anything, it is that if  the U.S government values something , it will not shy away from spending millions of taxpayers dollars to keep it afloat. But it as not only the U.S government. PLTR has won numerous contracts with government agencies of other countries like the British NHS and PLTR's head of operation in Israel- Hamutal Meridor, served as senior director of Verint, with deep ties to Unit 8200. Unit 8200  is an Israeli Intelligence Corps *unit* of the Israel Defense Forces responsible for collecting signal intelligence (SIGINT) and code decryption.\n\nIf you are still not sure about PLTR's importance maybe you would like to know more about who is behind the company. Peter Thiel is a cofounder and the current largest shareholder. Yeah, that is right-Peter fucking Thiel. This guy was a business associate with Elon Musk in Paypal, he was the first investor in Facebook and a mentor of Zuckerberg and is a close friend of Chamath. He also bankrupted Gawker, cuz they had the audacity to leak the news that he is homosexual. Many people believe that he is one of the most well-connected men in the world and it comes at no surprise that he is a member of The Bilderberg group ( conspiracy theorists believe that these guys control the world) . I forgot to mention that his nickname is King Midas, cuz everything that he touches turns to gold.\n\nPalantir's other cofounder and current Ceo- Alex Karp is also a pretty interesting guy to say the least. He is a juris doctor from Stanford University, and a doctorate in neoclassical social theory from Goethe-Universität, Frankfurt, Germany. He is also a regular participant in the Davos economic forum. Oh, he also actively practices Tai Chi and Quidong. Yes, this guy actually studied the blade, how could you not trust him?\n\nTo sum it up, I will use Alex Karp's own words: “We are going to deliver the world’s best software with the world’s most efficient way of delivering it. Investors will decide what that’s worth to them. And I think you’ll find in a number of years that there will be a consensus: Palantir is a truly special software company that is arguably the most important software company in the world.” -Karp the day they went public\n\nPS: English is not my mother tongue and I wrote this piece in a rush, so please excuse me if there are any grammatical or spelling errors.",
        "subreddit": "stocks",
        "title": "PLTR is a low bottom company and has become too important to fail. Here is my bullish thesis.",
        "url": "https://www.reddit.com/r/stocks/comments/mi8p2x/pltr_is_a_low_bottom_company_and_has_become_too/",
        "created": 1617351303.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1617469898,
        "id": "mjcpfw",
        "num_comments": 196,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n# Table of Contents\n\n1. TL;DR\n2. Purpose\n3. The Employment Problem\n4. The Education Solution\n5. Autodesk's Role\n\n[Engaging with Industry 4.0](https://preview.redd.it/kz4g5qfd3zq61.png?width=3840&amp;format=png&amp;auto=webp&amp;s=e45fab6fc951bf329cd89d8beccad8fe7504bb89)\n\n# TL;DR\n\nMeaningful, sustainable, long-term employment.\n\nThe current administration and Federal Reserve are continuing to progress in setting the stage for long-term investments in the American economy. In combination with the USMCA trade deal of 2020, the US will see 250B in investments over 8 years for infrastructure refactoring. We take a look at how Autodesk is a core benefactor of the economic models that govern these investments. I expect Autodesk to triple in size by 2024.\n\n[Autodesk Revenues](https://preview.redd.it/aj4qbyf05zq61.png?width=1276&amp;format=png&amp;auto=webp&amp;s=dfff18884011a16bded7ba20d46e3772fad4a6fe)\n\n# Purpose\n\nTo be frank, I was surprised by the hunger for knowledge and I really enjoyed debating some of the rather brazen people here. WSB has grown and in my view, our committed analysts tend to run head-to-head with Wall Street analysts. We have on-the-ground experience as laborers, customers, and digital-natives that they often filter out of a privileged ignorance.\n\nPart of this is also due to the fact that I believe that investing in securities will become increasingly complex yet accessible for a typical retail investor which will either result in isolation OR incentivize cooperation.\n\n\\- Does the average retail investor really understand the core regulatory influences in investments like Square, PayPal, or even rob-the-hood? **(Square DD Complete)**\n\n\\- How do we compare social media incentives? **(Pinterest DD Complete)**\n\n\\- What really is customer service? **(GameStop DD Complete)**\n\n\\- Are we familiar with new international trades that increase Mexican-Texan manufacturing? **(Kansas City Southern Rail DD Complete)**\n\n**-** What are elements behind US lagging industrial sector? **(You are here)**\n\n\\- Is the average retail investor familiar with the network models that govern software like Fastly and Twilio? *(Cloud Compute DD in Progress)*\n\n\\- Do we understand the consequences of STEAM education (Science, technology, engineering, arts, mathematics)? *(Roblox DD in Progress)*\n\n\\- How knowledgable are we of fashion trends that make Nike and Foot Locker valuable?\n\nAt the end of the day, I am an educator and I believe that the goal of education is to engage a reader into a deeper curiosity or discussion, so that’s why I’m sharing my writing. I’m not here to convince you that this stock is even a good choice - but to explore the economics behind it.\n\n# The Employment Problem\n\n&gt;The **Fourth Industrial Revolution** (or **Industry 4.0**) is the ongoing automation of traditional manufacturing and industrial practices, using modern smart technology. Large-scale machine-to-machine communication (M2M) and the internet of things (IoT) are integrated for increased automation, improved communication and self-monitoring, and production of smart machines that can analyze and diagnose issues without the need for human intervention.\n\n&amp;#x200B;\n\n[A Skill Gap Problem](https://preview.redd.it/sbi6dmoy6zq61.png?width=711&amp;format=png&amp;auto=webp&amp;s=1cad0f9dc367ce723290f7ae65f97f702812041d)\n\nUltimately, the US is doing a pretty good job at maintaining  its engineering and architecture sectors, but there has been a glaring issue with a skill-gap that effects certain regions more than others. This is largely due to the strained relationship between increase automation vs. difficulty of learning the new tools associated with automation. People get left behind, especially when employment is lost in one factory and a worker is left to join another manufacturer with different standards, machines, or tools. In a nutshell, the barrier to entry for sustainable employment in the industrial sector has gone up in almost every facet.\n\nTools like Autodesk sit at the heart of these kinds of problems, where being able to understand and utilize a tool like Autodesk will dramatically increase your ability to get hired. In the information age, skills associated with Autodesk are ultimately as valuable as learning how to code in software or knowing the value of legislation and finance in other white-collar sectors. Autodesk lags behind these competitive sectors because the nature of industry it exists in with high capital expenditures. \n\nThe problem is a bottleneck problem, and solving the bottleneck will produce a far leaner and more efficient pipeline for industrial productivity, employment, and societal satisfaction.\n\n*Processing img kvm8z2md8zq61...*\n\n# The Education Solution\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ly24pppuezq61.png?width=512&amp;format=png&amp;auto=webp&amp;s=3ab25ce2945104acb0f3c4d3816cb713db1af238\n\nThe reality here is that the education sector is also a slow-mover where shortcuts carry heavy competitive consequences. Another big element in this process is that high-level skills are ultimately dependent on adoption and communication demands. We need adaptable engineers to be familiar with a fundamental skill set that speak similar \"languages\". Autodesk has generally positioned itself to be one of those tools in a similar way that organizations like Adobe has positioned itself.\n\nWhat I believe will happen is that the incentive of certifications and accelerated programs will increase dramatically as a way to boost lucrative employment and adoption of skills. These training programs will effectively become tickets initiate a good career.\n\nhttps://preview.redd.it/mj3rk4a2gzq61.png?width=2528&amp;format=png&amp;auto=webp&amp;s=bde08f5487ed3afdd3a760fc1b3d7a019eb89ca6\n\nhttps://preview.redd.it/xib18z21hzq61.png?width=638&amp;format=png&amp;auto=webp&amp;s=5bb74a3b31dda0b750b0cb19fdfc4f97a2a4515b\n\n# AutoDesk's Role\n\nAutoDesk targets the EAC sector (engineering, architecture, and construction), so it helps to think about AutoDesk as software that can handle large scale developments focusing on the nature of smaller designs like intricate screws or cars. There is a lot of work that must be completed, with a strong societal demand. This can range from multi-year developments of hospital building in rural areas, or the construction of off-shore windmill farms. This inevitably creates a powerful compounding effect with employment and Autodesk's subscription model and increasing mobile capacities.  \n\n\n\\- As employment increases, subscriptions begin to increase.\n\n\\- As subscription increases, projects of scale are adopted.\n\n\\- As projects of scale increase, employment increases.\n\n\\- As employment increases, the length of subscription increases.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vk4hin3cozq61.png?width=936&amp;format=png&amp;auto=webp&amp;s=b569a74582ac2699904727002ae3663f530a95c7\n\nThe following is a list of Autodesk's relationship with various opportunities in the near and longterm.\n\n\\- **LEED architecture certification in civil sectors with Autodesk's architecture platform, Revit.** \n\n&gt;**Leadership in Energy and Environmental Design** (**LEED**) is a green building certification program used worldwide. Developed by the non-profit U.S. Green Building Council (USGBC) it includes a set of rating systems for the design, construction, operation, and maintenance of green buildings, homes, and neighborhoods which aims to help building owners and operators be environmentally responsible and use resources efficiently.\n\nhttps://preview.redd.it/ee4tjnc7lzq61.png?width=740&amp;format=png&amp;auto=webp&amp;s=cc84dacfe3b87538cc1c390b3122001ee54d911a\n\nhttps://preview.redd.it/343gkyy4lzq61.png?width=2518&amp;format=png&amp;auto=webp&amp;s=e85ead7fa9f1d7dbabf9550db845312a6bf417b6\n\nhttps://preview.redd.it/vv0kyc9plzq61.png?width=1606&amp;format=png&amp;auto=webp&amp;s=5895ef4b34a6d7979b441a65bedd24794ff7cba1\n\n\\- **Water maintenance system certifications with AutoDesk's end-to-end water system software, Innovyze**\n\n&gt;Innovyze is a global leader in building innovative, industry-leading software for the water industry for over 35 years; serving thousands of clients including the largest utilities, construction design firms, consultancies and refining plants around the world.\n\nhttps://preview.redd.it/osvbe3xwlzq61.png?width=2540&amp;format=png&amp;auto=webp&amp;s=01171822c0c5d78e9957d1121cbc6df64c2994c8\n\nhttps://preview.redd.it/12v4ndv3mzq61.png?width=1602&amp;format=png&amp;auto=webp&amp;s=7e5127af358c0be7792cc83c71a4b58bc6715d84\n\n\\- Robotics certifications with Autodesk robotics software, Powermill\n\n&gt;Fusion 360 with PowerMill CAM software provides expert CNC programming strategies for complex 3- and 5-axis manufacturing (the functional space where robots can move around). \n\nhttps://preview.redd.it/8pfyslzknzq61.png?width=2364&amp;format=png&amp;auto=webp&amp;s=9661fcf9fed560a4a1d1fb39021723a85c462742\n\nhttps://preview.redd.it/d2tg9g6pqzq61.png?width=1588&amp;format=png&amp;auto=webp&amp;s=6359ad43ec16be671ce0dd208932892399cf7745\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nCover: [https://luna1.co/3edd28.jpg](https://luna1.co/3edd28.jpg)",
        "subreddit": "wallstreetbets",
        "title": "Understanding The Infrastructure Bill: The Federal Goals, Employment Solutions, and AutoDesk's Role in the Post-COVID Economy.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mjcpfw/understanding_the_infrastructure_bill_the_federal/",
        "created": 1617498698.0
    },
    {
        "author": "Beachside_Investing",
        "created_utc": 1617386399,
        "id": "mipqlu",
        "num_comments": 170,
        "num_crossposts": 0,
        "selftext": "$TSLA - Just beat delivery expectations and is simply one of the best stocks to own. Look for Tesla to get over 700.00 this week on the news.\n\n$MP - Chinese tariffs on rare earth metals could send MP Materials flying. MP provides the only rare earth metal mining facility in the United States, and has so much potential for future business.\n\n$PYPL - PayPal is still in the midst of a pretty significant dip. Look for them to bounce back to 300.00 in the next few weeks. Cash is becoming outdated, finance is becoming simpler and easier.\n\n$GME - The obvious one people want to see. BUT, I’m seeing a real corner of the market being created by WSB. Look at GME, AMC, etc. and they’re all slowly being lifted by this community. We’ve almost created our own portion of the market with these stocks. I see them continuing to slowly gain.",
        "subreddit": "wallstreetbets",
        "title": "Top Stock Picks: Week of 4/5",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mipqlu/top_stock_picks_week_of_45/",
        "created": 1617415199.0
    },
    {
        "author": "chivemath",
        "created_utc": 1617477661,
        "id": "mjf9lr",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Bitcoin is becoming an increasingly popular payment option among many companies.\nFast-food chains, big tech firms, and leading drinks companies are embracing cryptocurrencies.\nRarely does a news cycle go by without some mention of bitcoin's growing popularity, from fans and skeptics alike.\nts prices on trading exchanges tumbled around Thanksgiving last year — only to roar back and set an all-time high of $19,857 on November 30: a 177% year-to-date increase that put the S&amp;P 500's 14% rise to shame, as Insider previously reported. \nThen, last month, the cryptocurrency hit an all-time high, with prices surging to $60,000. One quirk of the increase meant that two pizzas bought by crypto legend Laszlo Hanyecz would have effectively been worth $613 million.\nBitcoin's volatility is well-publicized and has led many investors, including Warren Buffet, to criticize it and other cryptocurrencies as \"risky\" and \"worthless.\" Such warnings have not dissuaded more companies from accepting the currency as an official payment option, however. \nIn February, Elon Musk announced that Tesla would accept bitcoin as a form of payment for all models of its cars in the US. In addition, Twitter's CEO and founder, Jack Dorsey, teamed up with Jay-Z for a bitcoin endowment. The pair will invest 500 bitcoins to develop the currency in India and Africa.\nAlthough Tesla stole the headlines, there are also hundreds of other notable companies that accept the cryptocurrency as a valid form of payment, across various industries.",
        "subreddit": "investing",
        "title": "More companies, including PayPal and Starbucks, are accepting bitcoin and other cryptocurrencies as payment, despite volatility warnings",
        "url": "https://www.reddit.com/r/investing/comments/mjf9lr/more_companies_including_paypal_and_starbucks_are/",
        "created": 1617506461.0
    },
    {
        "author": "Velaryon1007",
        "created_utc": 1617396813,
        "id": "mite0k",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Hello there!\n\nAs the title suggests, I'm currently looking for sectors in which to invest other than Tech (I'm already quite tech heavy). \n\nI'm 21, I have read quite a bit about this and with 2 years of experience in this world, prefered to start early because \"Time in the market beats timing the market\", with a moderate risk tolerance. \nI understand the benefit of being diversified, but I personally think that knowing the sector that you are invested in gives 95% of the time better results than \"diversifying for the sake of doing it\", that's why I went tech heavy for a start.\n\nI have no preference between value or growth, but I value some kind of stability AND dividends (aiming for looong term holding). \n150% a month plays are nice, but I prefer avoiding the -60% that comes the following week / month. \n\nMy current holdings are:\n\n26% TSM (Semiconductor manufacturing)\n26% AAPL (Tech)\n24% NVDA (Tech / Semic / IA)\n24% LOGI (Computer peripherials)\n\nThe portfolio took a beating last month, but It's already well into the green realm. The beating is what showed me that I should consider diversifying to other sectors (after looking at them in depth) for the sake of stability. \n\nCurrently considering: \n\nVolkswagen (Automotive sector, future safe EV play, nice div., Germany's prefered child)\n\nBlackrock (Financial sector, too-big-to-fall, the \"safest\" I found)\n\nPaypal (FinTech with a foot into the crypto world lately)\n\nAnd a couple of spanish small caps (I'm from Spain) that I know locally that will grow during the upcoming years. \n\nAny suggestion of which I should choose, or what sector should I look into? (Green energy might be recovering, but I find it to be still overvalued for an entry point. Got a friend really burned with ICLN's European version, IQQH).\n\nThanks!",
        "subreddit": "stocks",
        "title": "Looking for diversification advice!",
        "url": "https://www.reddit.com/r/stocks/comments/mite0k/looking_for_diversification_advice/",
        "created": 1617425613.0
    },
    {
        "author": "Marijuana_420_",
        "created_utc": 1617489864,
        "id": "mjj5yw",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Initiative Q is an attempt by ex-PayPal guys to create a new payment system instead of payment cards that were designed in the 1950s. The system uses its own currency, the Q, and to get people to start using the system once it's ready they are allocating Qs for free to people that sign up now (the amount drops as more people join - so better to join early). Signing up is free and they only ask for your name and an email address. There's nothing to lose but if this payment system becomes a world leading payment method your Qs can be worth a lot. If you missed getting bitcoin seven years ago, you wouldn't want to miss this.\n\nHere is my invite link: https://initiativeq.com/invite/Ye7onIZde5\n\nThis link will stop working once I’m out of invites. Let me know after you registered, because I need to verify you on my end.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Limited space! Please download app after you sign up!",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mjj5yw/limited_space_please_download_app_after_you_sign/",
        "created": 1617518664.0
    },
    {
        "author": "itskayyuhvin",
        "created_utc": 1617277135,
        "id": "mhtfal",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "This post will detail some speculation on why believe Bitcoin will soon break 60k and potentially move to 70k within the next month or two. I'm fairly confident the bull run for Bitcoin is not over yet and will continue into this year before we see a correction.\n\n\\-Current Price of BTC around time of this post is around 58k-\n\n**External Catalysts**\n\nThe past few weeks there have been an onslaught of positive news for BTC . To name a few major ones:\n\n\\- Paypal is now incorporating use and everyday people can exchange BTC and other cryptocurrency.\n\n\\- Square, Tesla, and several other companies have included it in their balance sheet. Microstrategy essentially embraced their whole mission around it. Overstock accepts BTC as payment.\n\n\\- Spending will be high with the stimulus package and other bills under Democrats. BTC can be seen as a hedge to the dollar\n\n\\- Visa and other credit cards have also started incorporating it.\n\n*More importantly, there are major catalysts that will be coming this April that will likely propel it forward more:*\n\n\\- BTC ETFs are already being submitted by major institutions like Fidelity. When the GOLD ETF was introduced, the value of gold went on bull run the year to follow.\n\n\\- Coinbase IPO will be happening in April if there are no more delays. This one is **major**! Just the event will get the talk of cryptocurrency spread and be the chatter of the month.\n\n\\- Literally today Chipotle is getting in on the fun too with their Burrito or Bitcoin event: [https://newsroom.chipotle.com/2021-03-30-Burritos-Or-Bitcoin-Chipotle-To-Give-Away-200k-In-Free-Burritos-And-Bitcoin-To-Celebrate-National-Burrito-Day](https://newsroom.chipotle.com/2021-03-30-Burritos-Or-Bitcoin-Chipotle-To-Give-Away-200k-In-Free-Burritos-And-Bitcoin-To-Celebrate-National-Burrito-Day)\n\n**Technical Analysis:**\n\nBTC this week reached almost 60k three times this week.\n\nKey levels of Resistance: 60k, 64.5k\n\nKey levels of Support: 53k, 51k\n\nSettling at 58k is very bullish at it means it is bouncing *above* the 9-day and 21-day moving averages. If it's able to hold this it should be able to get to around 62k. If it passes the mental wall there, it can easily surge to 70k before correcting. If it fails to support 55k then we could see a downside\n\n**Tickers that follow Bit Coin: $MARA, $RIOT, $CAN**\n\nI chose three tickers to focus on that will likely benefit from a rally. I know there are other ones like SOS, BTBT, FTFT but those are high risk from what I've seen having short reports written up on them. And when Bitcoin goes down, they go down hard. Let me know if there are any new tickers that follow Bitcoin too.\n\n**MARA**\n\n\\- Bitcoin mining company I've been following since it was 5$. Has strong support\n\n\\- Recent News: To Launch the First North American-Based Bitcoin Mining Pool.\n\n\\- Reached a 52week high over 50+ today\n\n**RIOT**\n\n\\- Same as MARA a crypto mining company I've followed since it was 10$. It's always been slightly ahead of MARA but it seems the gap is closing.\n\n\\- Recently reported GREAT earnings 300% surprise in EPS\n\n\\- Heavily shorted (20%) which may be why it has not been climbing as hard in following BTC, but will easily soar multiple levels if Bit rallies hard enough.\n\n\\- Reached over 70 last time BTC ran\n\n**CAN**\n\n\\- The only Chinese stock I singled out that could see a strong run correlated with Bitcoin if it were to run this month.\n\n\\- Canaan manufactures equipment used for mining Bitcoin. As the price rises, more and more companies are enticed to mine.\n\n\\- Reached around 40 last time BTC ran\n\n*Bearish Warning:*\n\n\\- In the past when Bitcoin has ran, there has always been a big correction afterwards. Invest at your own risk.\n\n\\- Offerings can happen if the price climbs too much",
        "subreddit": "StockMarket",
        "title": "Writing on the Wall: Bitcoin and how to play it with MARA, RIOT, CAN",
        "url": "https://www.reddit.com/r/StockMarket/comments/mhtfal/writing_on_the_wall_bitcoin_and_how_to_play_it/",
        "created": 1617305935.0
    },
    {
        "author": "SoloTheFord",
        "created_utc": 1617299568,
        "id": "mi0wcz",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "This is an excerpt from previous DD but i want to share so people have a chance to make their own choice and do their own research before this stock blows up...\n\nPaysafe (NYSE:PSFE). The merger is legally official, it's going to be a massive cash cow. You've got online gambling, sports betting, big casinos shifting online, privacy payment provider e-wallets, the main branch with its own payment cards accepted internationally and seamlessly, also allowing private crypto purchases, not to mention their probability of supporting the fledgling esports igaming industry. All in one package. It is going to be colossal. Paypal is having issues just keeping their shit together with simple crypto transactions, people are pissed, moving to better providers like Square (which is also a great growth stock btw). The iGaming(online gambling) industry is already in the hundred billions of dollars per annum and Paysafe is a major payment processor at the forefront with a long and trusted track record if any of you are familiar with Neteller and Skrill formerly Moneybookers etc. \n\nIf BFT - Foley's track record on the other hand is any example of success, they can prop it up massively. The best of both worlds as BFT is also bringing insurance and investment holding companies along with it for some icing on the cake. \n\nPaypal is weakening and they are falling behind in these markets, they are too vanilla and wont touch any of this and are too busy un-clusterf*cking their already KYC users frozen or blocked btc transactions, besides people want ease of use without borders and no bullshit verification processes. I had history over a decade ago working directly with the digital payment providers currently under Paysafe when online gambling was basically outlawed in North America not to mention taking client orders which we still did anyway on regulated soil (come at me FBI) Im in Canada we had authorities do walk throughs of our offices all the time. Digressing. With BFT hovering around $14-$17 which to be honest is a goddamn steal right now, once it transitions into PSFE I estimate it will hit $40+ within the first few months, with far reaching upside, smack in between 2 crazy global industries that are on fire rn: crypto and igaming.\n\nLittle ex employee insider information for you right there. \n\n Jk, as i said, its all public knowledge, but these payment providers are proverbial money printers and not the bad kind and with all the Casinos shifting their business online/covid/crypto/kids stealings mom's credit card betting on their favourite twitch streamers to win at CS:GO, Fortnite,half joking. I'd say most current online betting money is in sports and poker in the 18-40 age range, you get the odd rich Boomers who drop 40k a day on coin flips or how many injuries there will be in a game, sick shit like that, who bets 40k on a coin flip? The rest are grannies hitting slots.  \n\nThe US is also lifting a lot of sanctions Federally and by state IIRC, relating to online gambling; BFT/PSFE is practically a lock. I highly suggest to anyone pick up BFT stock asap or at very least get some early wet feet. I personally own a few hundred and plan to buy more.",
        "subreddit": "StockMarket",
        "title": "$PSFE now live and its a steal.",
        "url": "https://www.reddit.com/r/StockMarket/comments/mi0wcz/psfe_now_live_and_its_a_steal/",
        "created": 1617328368.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1617268735,
        "id": "mhrha8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Paysafe has finally just gone public with a new Board of Directors, much less debt, lots more cash, new M&amp;A plans and a new ticker: PSFE During yesterday's ticker change, there were several reports of people having no access to their accounts and/or suddenly being faced with an abrupt change in margin requirements from 25% to 100%. Many suggest this was intentional manipulation to give institutions cheaper shares. Regardless, this may have created a good buying opportunity for us too. For those interested, here's some comprehensive DD.\n\nPaysafe is a unique combination of fintech, iGaming, sports betting and banking all rolled into one stock. Whether you like him or not, this is essentially why NBC’s Jim Cramer recently said, “There is something about Paysafe that may be the ultimate stock for this moment.” (video link below) Market analyst Steve Grasso says, “It’s the most excited I’ve been about a stock in a long time.” Grasso, by the way, has repeated called for it to triple ($45-50). So why is that?\n\nPaysafe offers a scalable electronic payment platform used by Draftkings, Roblox, Spotify, eToro, Fortnight, Coinbase, Amazon, Twitch, EA, 888, ApplePay, Youtube, Visa, Microsoft, Xbox, Amelco, William Hill, Ceasar's, Betfair, Pokerstars, PayLease, ESL Gaming, Luckbox, bet365, Lotto among many others.\n\nPaysafe is ranked No. 2 globally in the digital wallet space with presence in 120 countries and No. 4 globally in integrated merchant processing.\n\nImportantly, Paysafe is the No. 1 global leader in iGaming eCash network (currently 36% of revenue) with 10-15X growth projected. US iGaming continues to be legalized state by state, growing revenue by 234% in just the last year. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”\n\nPaysafe is enabled for digital currency (a type that shall not be mentioned in these parts) without having to go through fiat. It recently partnered with Coinbase to expand options in US and it just launched PaysafeCash in US. (Now in 40 currencies and 30 global markets enabling easier cross border payments.)\n\nPerhaps most central to this recent merger is Bill Foley, Fidelity’s Chairman of the Board and now the Chairman of Paysafe, who has a proven track record for generating exponential synergistic inorganic growth. For example, in just the last five years, he grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X) and he says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.”\n\nOf their expansion plans Foley says, “We’ve got a wide landscape we can attack. It’s pretty exciting.” “It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else.” “I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody. That’s why I got so excited about Paysafe Group Holdings Limited as its position in iGaming is really second to none.” “Whether it’s a lottery or slot machines or sportsbetting opening in a state, it’s our job to be there first and to make sure we dominate. We’re focusing on gaming, particularly sportsbetting, in the United States as it becomes legal and we’ve got a wide landscape we can attack. It’s pretty exciting.”\n\nAlong with Bill Foley, Paysafe's newly announced Board of Directors includes a former Morgan Stanley CEO, a former Chairman of the American Gaming Association and CEO of MGM Resorts International, a legal and regulatory expert in the multi-jurisdictional online and retail gambling industries, the CEO of Dun &amp; Bradstreet and CEO of Black Knight, two senior Managing Directors from Blackstone and two senior Managing Directors from CVC,\n\nBetween the new Board of Directors, Bill Foley’s proven expertise in rapid M&amp;A growth and Paysafe’s massive market share and diverse assets, including the world’s second largest digital wallet, $362 million in free cash flow, 30-35% margins (21% CAGR), a projected $100-110 billion in transactional volume and $1.5 billion revenue, it is inevitable that institutional investors will, by necessity, include PSFE in their portfolios.\n\nPaysafe’s industry leading risk management and international regulatory expertise gives them an edge in spaces where competitors have hesitated like iGaming, sportsbetting, alternative currency trading as well as offering essential banking and ecommerce services to the \"unbanked\" (1.7 billion globally). Paysafe has a global platform with integrated cloud technology (Snowflake) allowing for easier migration of eCash, integration of payment methods and expansion into global banking as a service. Paysafe is so diversified that they've identified a $58 trillion TAM.\n\nFurther, major investment funds know that fintechs are the future. Fund manager Cathie Wood says, “Fintechs are going to, we believe, gut banks.” Similarly, Jackie Reses, board member of the SF Federal Reserve and fmr Head of Square Capital, calls for fintech “taking over and revolutionizing banking” representing “a wholesale transition” of a $16 trillion market cap.\n\nAnalyst Michael Del Grosso recently initiated coverage saying, \"We believe PSFE represents a relatively scarce asset within the payments industry given its unique business strategy, geographical footprint, and focus on the iGaming industry. Our forecasts imply revenue growth at the high-end of management's guidance and we believe there is upside to our forecasts in the event of state-level legalization of iGaming. PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States.\"\n\nInvestors should be aware that there is are post-merger lockup periods before insiders can sell their shares: PIPE: = 176 days. Private Equity = 86 days (roughly 6 and 3 months respectively accounting for trading days and weekends). Something to be aware of but there are several signals that these parties aren't in any rush to sell. Eli Nagler, a Senior Managing Director at Blackstone, recently said: “Today is a significant milestone for Paysafe and a testament to the excellent work of their world-class management team over several years. We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.” Regarding Blackstone and CVC, who now have four senior managing directors on Paysafe’s Board, Foley said, “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table… All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.” Also, the PIPE investors are primarily insurance companies known for long term hold strategies and they are closely associated with Bill Foley. As Foley recently said, “Having a large PIPE basically validates the transaction.… The companies that I’m affiliated with actually invested roughly a billion dollars in the PIPE and forward purchase agreements so Paysafe was always a really protected asset, besides the fact that it’s a great asset.”\n\nBill Foley says Paysafe may be his “best investment ever.” He says, “It’s a fortress. It’s got a moat.” “We have a proven strategy of winning as new global markets open. And most importantly, we have unrivaled regulatory risk and technical expertise.”\n\nAs an aside, even though, “Roughly 75% of online gambling operators use Paysafe for processing payments” many in the US haven’t yet heard of it yet. Partially because much of its presence is in back-end processing. Through its several new partnerships (Coinbase, Microsoft Rentmoola), Paysafe is just now rolling out its offerings in the U.S. In Europe, where it is more commonly used, Trustpilot rates Paysafe as “Excellent” (4.7/5 stars) with over 20,000 reviews, and Skrill (owned by Paysafe) 4/5 stars “great” with over 16,000 reviews, while competitor PayPal is rated \"poor\" only 1/5 stars with over 16,000 reviews. Further, Paysafe was winner of the American Gambling Awards’ “Payment Processor of the Year,” and owns Openbucks, Neteller and Skrill, 2019 winner “Best Digital Wallet” for best consumer take up and most innovative technology with “greatest potential to disrupt current ecosystems.” Also, Paysafe won “Best Omni-Channel Payment Solution” 2021 MPE Award and the gaming industry SAGSE award for “Best Payment Method.”\n\nTo give a sense of their pace and progress, these are some of Paysafe’s recent announcements that were made before going public and have not been factored into the current valuation:\n\nDec. 15 — Paysafe launches Paysafecash in the US\n\nDec. 21 — Paysafe partners with Amelco to plug US sports books into unified payments platform\n\nDec. 23 — Paysafe enables online cash payments for Microsoft\n\nJan 11 — Paysafe partners with Colorado’s BetWildwood\n\nFeb 1 — Paysafe expands Virginia Lottery partnership\n\nFeb 17 — Paysafe partners with Luckbox to roll out Skrill and Neteller payment services\n\nFeb 18 — Paysafe expands partnership with ESL Gaming, the world’s largest esports company\n\nFeb 23 — Paysafe’s Skrill launches new fiat-to-digital currency\n\nFeb 25 — Paysafe partners with Austria’s A1 esports League\n\nMar 1 — Paysafe partners with RentMoola to enable US renters to pay rent with Paysafecash eCash\n\nMar 12 — Leeds United announces partnership with Skrill\n\nMar 15 — Paysafe expands U.S. partnership with PointsBet\n\nMar 16 — Paysafe partners with Provema to enable online cash payments\n\nMar 25 -- Paysafe’s Skrill expands digital currency offering to US with Coinbase\n\n&amp;#x200B;\n\nFortunately for shareholders, even before Foley’s value creation play book is put into action, Paysafe is currently undervalued compared to sector peers.\n\nSince market analyst Steve Grasso continues to his repeat his calls for a triple ($45-50), I've looked more closely at EV / EBITDA, EV / Revenue and EV / Free cash flow multiples of sector peers, including PayPal, Nuvei, Repay, Shift 4, Adyen, Square, Affirm, Stripe, Chime and a few others, using cross-referenced data from Nasdaq, WSJ, Morningstar, Macrotrends, Yahoo Finance. The conservative average of those three multiples puts Paysafe’s post-merger pro forma share value at around $46.52:\n\n&amp;#x200B;\n\nPaysafe’s share price using the average multiples from the full list of sector peers:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nMore realistic share prices, after eliminating all outliers with very high multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n&amp;#x200B;\n\nNote: Unlike Paysafe, nearly half of these publicly traded fintechs still do not report positive cash flow. Also, these multiples reflect a collective 27% pull back from recent highs so interest rate risks have been somewhat factored in.\n\nAlso, Paysafe's CFO noted that their conservative 11% growth projection is tied to the general fintech market at large. They have deliberately excluded both M&amp;A plans that are apparently already underway and US iGaming growth that may potentially grow 10x or more over the next 5 years. Further, the above comps include fintechs with slower or similar growth while still commanding much higher multiples. For example, Shift4 reported only 4% y-o-y growth and GPN's growth projection is on par with Paysafe's.",
        "subreddit": "wallstreetbets",
        "title": "Paysafe goes public with new ticker: PSFE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhrha8/paysafe_goes_public_with_new_ticker_psfe/",
        "created": 1617297535.0
    },
    {
        "author": "beefjerkytothemoon21",
        "created_utc": 1617546130,
        "id": "mjx59l",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Initiative Q is an attempt by ex-PayPal guys to create a new payment system instead of payment cards that were designed in the 1950s. The system uses its own currency, the Q, and to get people to start using the system once it's ready they are allocating Qs for free to people that sign up now (the amount drops as more people join - so better to join early). Signing up is free and they only ask for your name and an email address. There's nothing to lose but if this payment system becomes a world leading payment method your Qs can be worth a lot. If you missed getting bitcoin seven years ago, you wouldn't want to miss this.\n\nHere is my invite link: https://initiativeq.com/invite/uhfxoWzSbP\n\nThis link will stop working once I’m out of invites. Let me know after you registered, because I need to verify you on my end.",
        "subreddit": "StockMarket",
        "title": "Initiative Q",
        "url": "https://www.reddit.com/r/StockMarket/comments/mjx59l/initiative_q/",
        "created": 1617574930.0
    },
    {
        "author": "Equivalent-Branch850",
        "created_utc": 1617478914,
        "id": "mjfog4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "How to invest in crypto through PayPal",
        "url": "https://www.reddit.com/r/investing/comments/mjfog4/how_to_invest_in_crypto_through_paypal/",
        "created": 1617507714.0
    },
    {
        "author": "ShopRus",
        "created_utc": 1617304394,
        "id": "mi2ncb",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "check for all details at pinterest  [(1) Pinterest](https://www.pinterest.com/pin/842384305301230133/)",
        "subreddit": "wallstreetbets",
        "title": "$20 - 100 PayPal Cash in minutes",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mi2ncb/20_100_paypal_cash_in_minutes/",
        "created": 1617333194.0
    },
    {
        "author": "Marijuana_420_",
        "created_utc": 1617505035,
        "id": "mjnjlm",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Initiative Q is an attempt by ex-PayPal guys to create a new payment system instead of payment cards that were designed in the 1950s. The system uses its own currency, the Q, and to get people to start using the system once it's ready they are allocating Qs for free to people that sign up now (the amount drops as more people join - so better to join early). Signing up is free and they only ask for your name and an email address. There's nothing to lose but if this payment system becomes a world leading payment method your Qs can be worth a lot. If you missed getting bitcoin seven years ago, you wouldn't want to miss this.\n\nHere is my invite link: https://initiativeq.com/invite/awb_aPR3T\n\nThis link will stop working once I’m out of invites. Let me know after you registered, because I need to verify you on my end.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Limited space! Please don’t forget to install app after sign up!",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mjnjlm/limited_space_please_dont_forget_to_install_app/",
        "created": 1617533835.0
    },
    {
        "author": "badpauly",
        "created_utc": 1617318360,
        "id": "mi7ezt",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "\nThis is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[QS / QuantumScape Corporation](https://fintel.io/n/us/qs)|1|15,221,334|7|100,004,164 \n[DSGN / Design Therapeutics, Inc.](https://fintel.io/n/us/dsgn)|9|2,010,550|20|40,211,000 \n[EWTX / Edgewise Therapeutics, Inc.](https://fintel.io/n/us/ewtx)|7|1,984,375|16|31,750,000 \n[PFSI / PennyMac Financial Services, Inc.](https://fintel.io/n/us/pfsi)|4|446,336|65|28,834,382 \n[SAII / Software Acquisition Group Inc. II Class A](https://fintel.io/n/us/saii)|6|2,743,557|10|27,463,006  \n[IKNA / Ikena Oncology, Inc.](https://fintel.io/n/us/ikna)|4|846,800|16|13,548,800 \n[CASI / CASI Pharmaceuticals, Inc.](https://fintel.io/n/us/casi)|1|3,000,000|2|6,150,000 \n[MRUS / Merus N.V.](https://fintel.io/n/us/mrus)|3|300,000|20|5,925,000 \n[GMS / GMS Inc.](https://fintel.io/n/us/gms)|2|115,000|40|4,620,850 \n[MTEM / Molecular Templates, Inc.](https://fintel.io/n/us/mtem)|1|80,000|11|915,848 \n[KFS / Kingsway Financial Services Inc.](https://fintel.io/n/us/kfs)|4|163,763|5|742,632 \n[VZIO / VIZIO Holding Corp.](https://fintel.io/n/us/vzio)|1|35,000|21|735,000 \n[TDUP / ThredUp Inc. Class A](https://fintel.io/n/us/tdup)|3|46,427|14|649,978 \n[CMPI / Checkmate Pharmaceuticals, Inc.](https://fintel.io/n/us/cmpi)|3|36,704|12|413,003 \n[UIHC / United Insurance Holdings Corp.](https://fintel.io/n/us/uihc)|5|56,080|7|404,058 \n[RDGA / Ridgefield Acquisition Corp.](https://fintel.io/n/us/rdga)|1|1,600,000|0|400,000 \n[IMH / Impac Mortgage Holdings, Inc.](https://fintel.io/n/us/imh)|10|157,336|2|316,452 \n[REVG / REV Group, Inc.](https://fintel.io/n/us/revg)|1|16,750|18|301,165 \n[SDHY / PGIM Short Duration High Yield Opportunities Fund](https://fintel.io/n/us/sdhy)|10|15,000|19|283,633 \n[EPZM / Epizyme, Inc.](https://fintel.io/n/us/epzm)|2|34,486|8|274,817 \n[SCOBU / ScION Tech Growth II Units](https://fintel.io/n/us/scobu)|2|24,037|10|239,813 \n[GBDC / Golub Capital BDC, Inc.](https://fintel.io/n/us/gbdc)|8|16,000|15|238,626 \n[ESTC / Elastic N.V.](https://fintel.io/n/us/estc)|1|2,000|107|213,371 \n[BIGZ / BlackRock Innovation and Growth Trust](https://fintel.io/n/us/bigz)|2|10,601|20|212,020 \n[CRDE / Cardinal Ethanol LLC](https://fintel.io/n/us/crde)|3|40|5,367|210,600 \n[RYTM / Rhythm Pharmaceuticals, Inc.](https://fintel.io/n/us/rytm)|1|10,000|20|201,713 \n[AVO / Mission Produce, Inc.](https://fintel.io/n/us/avo)|1|11,200|18|197,120 \n[TPL / Texas Pacific Land Trust](https://fintel.io/n/us/tpl)|32|124|1,547|191,821 \n[SEMR / SEMrush Holdings, Inc.](https://fintel.io/n/us/semr)|1|13,000|14|182,000 \n[FEIM / Frequency Electronics, Inc.](https://fintel.io/n/us/feim)|4|13,124|11|150,346 \n[EMPR / Empire Petroleum Corp.](https://fintel.io/n/us/empr)|3|428,571|0|150,000 \n[PRPL / Purple Innovation, Inc.](https://fintel.io/n/us/prpl)|1|5,000|30|149,800 \n[ISD / Prudential Short Duration High Yield Fund, Inc.](https://fintel.io/n/us/isd)|4|9,000|16|140,376 \n[CYTH / Cyclo Therapeutics, Inc.](https://fintel.io/n/us/cyth)|6|16,050|8|126,430 \n[AIV / Apartment Investment &amp;amp; Management Co.](https://fintel.io/n/us/aiv)|2|20,000|6|117,591 \n[NOVN / Novan, Inc.](https://fintel.io/n/us/novn)|1|70,000|1|100,100 \n[FXNC / First National Corp.](https://fintel.io/n/us/fxnc)|2|5,510|18|99,826 \n[BANX / StoneCastle Financial Corporation](https://fintel.io/n/us/banx)|1|5,000|20|99,250 \n[XXII / 22nd Century Group, Inc.](https://fintel.io/n/us/xxii)|2|30,000|3|96,900 \n[SREV / ServiceSource International, Inc.](https://fintel.io/n/us/srev)|2|56,196|1|80,887\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[RKT / Rocket Companies Inc](https://fintel.io/n/us/rkt)|3|-60,600,000|25|-1,499,850,000 \n[MP / MP Materials Corp.](https://fintel.io/n/us/mp)|13|-11,130,998|34|-375,949,457 \n[COOP / Mr. Cooper Group Inc.](https://fintel.io/n/us/coop)|4|-7,400,000|32|-238,650,000 \n[CERT / Certara, Inc.](https://fintel.io/n/us/cert)|1|-8,674,151|24|-209,263,893 \n[ALHC / Alignment Healthcare, Inc.](https://fintel.io/n/us/alhc)|4|-10,204,978|17|-171,749,780 \n[ULTA / Ulta Salon, Cosmetics &amp;amp; Fragrance, Inc.](https://fintel.io/n/us/ulta)|3|-523,666|307|-160,331,802 \n[CEQP / Crestwood Equity Partners LP](https://fintel.io/n/us/ceqp)|1|-6,000,000|22|-132,000,000 \n[TRIP / TripAdvisor, Inc.](https://fintel.io/n/us/trip)|1|-1,713,859|54|-91,999,951 \n[SNOW / Snowflake Inc](https://fintel.io/n/us/snow)|9|-268,218|227|-60,862,926  \n[VZIO / VIZIO Holding Corp.](https://fintel.io/n/us/vzio)|5|-1,265,520|20|-25,606,371 \n[RSI / Rush Street Interactive, Inc.](https://fintel.io/n/us/rsi)|4|-1,245,000|15|-18,766,076 \n[TLGA / TLG Acquisition One Corp.](https://fintel.io/n/us/tlga)|3|-139,131|120|-16,695,720 \n[MPW / Medical Properties Trust Inc.](https://fintel.io/n/us/mpw)|1|-710,000|21|-15,059,100 \n[OFLX / Omega Flex, Inc.](https://fintel.io/n/us/oflx)|3|-103,449|145|-15,000,105 \n[WOR / Worthington Industries, Inc.](https://fintel.io/n/us/wor)|9|-175,000|68|-11,864,251 \n[AZO / AutoZone, Inc.](https://fintel.io/n/us/azo)|4|-7,600|1,399|-10,631,409 \n[TFFP / TFF Pharmaceuticals, Inc.](https://fintel.io/n/us/tffp)|1|-715,000|14|-10,010,000 \n[GNK / Genco Shipping &amp;amp; Trading Ltd.](https://fintel.io/n/us/gnk)|6|-900,000|11|-9,655,020 \n[BSY / Bentley Systems, Incorporated Class B](https://fintel.io/n/us/bsy)|2|-173,000|46|-8,134,665 \n[GOOG / Alphabet Inc. Class C](https://fintel.io/n/us/goog)|21|-3,955|2,038|-8,085,791 \n[BALY / Bally&amp;#x27;&amp;#x27;s Corporation](https://fintel.io/n/us/baly)|4|-110,000|70|-7,591,956 \n[TEN / Tenneco, Inc.](https://fintel.io/n/us/ten)|3|-665,004|11|-7,160,507 \n[SNPS / Synopsys, Inc.](https://fintel.io/n/us/snps)|1|-28,311|241|-6,834,921 \n[DRI / Darden Restaurants, Inc.](https://fintel.io/n/us/dri)|11|-43,835|145|-6,333,717 \n[KR / Kroger Co.](https://fintel.io/n/us/kr)|4|-161,312|38|-6,091,743 \n[HPQ / HP Inc.](https://fintel.io/n/us/hpq)|1|-187,322|31|-5,889,067 \n[AME / Ametek, Inc.](https://fintel.io/n/us/ame)|3|-32,240|126|-4,066,612 \n[FUL / Fuller (H.B.) Co.](https://fintel.io/n/us/ful)|10|-58,614|64|-3,730,004 \n[NUE / Nucor Corp.](https://fintel.io/n/us/nue)|1|-47,581|77|-3,672,302  \n[ALLK / Allakos Inc.](https://fintel.io/n/us/allk)|3|-24,747|115|-2,848,778 \n[AVGO / Broadcom Limited](https://fintel.io/n/us/avgo)|3|-5,990|471|-2,814,372 \n[EGLE / Eagle Bulk Shipping, Inc.](https://fintel.io/n/us/egle)|5|-77,565|37|-2,809,877 \n[AIR / AAR Corp.](https://fintel.io/n/us/air)|4|-46,174|43|-1,986,681 \n[CMC / Commercial Metals Co.](https://fintel.io/n/us/cmc)|2|-63,296|31|-1,970,696 \n[LPG / Dorian LPG Ltd.](https://fintel.io/n/us/lpg)|2|-143,631|13|-1,876,830 \n[DRE / Duke Realty Corp.](https://fintel.io/n/us/dre)|2|-43,736|43|-1,867,918 \n[FIVE / Five Below, Inc.](https://fintel.io/n/us/five)|1|-9,079|200|-1,819,068 \n[AOS / Smith (A.O.) Corp.](https://fintel.io/n/us/aos)|5|-25,805|70|-1,805,938 \n[SUMO / Sumo Logic, Inc.](https://fintel.io/n/us/sumo)|3|-90,000|18|-1,622,740\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/mi7ezt/significant_insider_trading_activity_last_7_days/",
        "created": 1617347160.0
    }
]