[
    {
        "author": "ssauronn",
        "created_utc": 1611810374,
        "id": "l6omry",
        "num_comments": 8653,
        "num_crossposts": 0,
        "selftext": " **Mods do not delete, this is important to me, please read**\n\n&amp;#x200B;\n\nI was in my early teens during the '08 crisis. I vividly remember the enormous repercussions that the reckless actions by those on Wall Street had in my personal life, and the lives of those close to me. I was fortunate - my parents were prudent and a little paranoid, and they had some food storage saved up. When that crisis hit our family, we were able to keep our little house, but we lived off of pancake mix, and powdered milk, and beans and rice for a year. Ever since then, my parents have kept a food storage, and they keep it updated and fresh.\n\nThose close to me, my friends and extended family, were not nearly as fortunate. My aunt moved in with us and paid what little rent she could to my family while she tried to find any sort of work. Do you know what tomato soup made out of school cafeteria ketchup packets taste like? My friends got to find out. Almost a year after the crisis' low, my dad had stabilized our income stream and to help out others, he was hiring my friends' dads for odd house work. One of them built a new closet in our guest room. Another one did some landscaping in our backyard. I will forever be so proud of my parents, because in a time of need, even when I have no doubt money was still tight, they had the mindfulness and compassion to help out those who absolutely needed it.\n\nTo Melvin Capital: you stand for everything that I hated during that time. You're a firm who makes money off of exploiting a company and manipulating markets and media to your advantage. Your continued existence is a sharp reminder that the ones in charge of so much hardship during the '08 crisis were not punished. And your blatant disregard for the law, made obvious months ago through your (for the Melvin lawyers out there: alleged) illegal naked short selling and more recently your obscene market manipulation after hours shows that you haven't learned a single thing since '08. And why would you? Your ilk were bailed out and rewarded for terrible and illegal financial decisions that negatively changed the lives of millions. I bought shares a few days ago. I dumped my savings into GME, paid my rent for this month with my credit card, and dumped my rent money into more GME (which for the people here at WSB, I would not recommend). And I'm holding. This is personal for me, and millions of others. You can drop the price of GME after hours $120, I'm not going anywhere. You can pay for thousands of reddit bots, I'm holding. You can get every mainstream media outlet to demonize us, I don't care. I'm making this as painful as I can for you.\n\nTo CNBC: you must realize your short term gains through promoting institutions' agenda is just that - short term. Your staple audience will soon become too old to care, and the millions of us, not just at WSB but every person affected by the '08 crash that's now paying attention to GME, are going to remember how you stuck up for the firms that ruined so many of us, and tried to tear down the little guys. I know for sure I'll remember this. In response, here is a [list of CNBC sponsors and partners](https://www.cnbcevents.com/sponsors/). They include, but are not limited to, **IBM**, **Cisco**, **TMobile**, **JPMorgan**, **Oracle**, and **ZipRecruiter**. Their parent company is [NBCUniversal](https://en.wikipedia.org/wiki/NBCUniversal), owned by **Comcast** and **GE**.\n\nTo the boomers, and/or people close to that age, just now paying attention to these \"millennial blog posts\": you realize that, even if you weren't adversely effected by the '08 crash, your children and perhaps grandchildren most likely were? *We're not enemies, we're on the same side*. Stop listening to the media that's making us out to be market destroyers, and start rooting for us, because we have a once in a lifetime opportunity to punish the sort of people who caused so much pain and stress a decade ago, and we're taking that opportunity. Your children, your grandchildren, might have suffered as I described because of the institutions that we're fighting against. You really want to choose them, over your own family and friends? We're not asking you to risk your 401k or retirement fund on a single GME bet. We're just asking you to be understanding, supportive, and to not support the people that caused so much suffering a decade ago.\n\nTo WSB: you all are amazing. I imagine that I'm not the only one that this is personal for. I've read myself so many posts on what you guys went through during the '08 crash. Whether you're here for the gains, to stick it to the man as I am, or just to be part of a potentially market changing movement - thank you. Each and every one of you are the reason that we have this chance. I've never felt this optimistic about the future before. This is life changing amounts of money for so many of you, and to be part of a rare instance of a wealth distribution from the rich to the poor is just incredible. I love you all.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNote: I can't seem to get a hold of mods and they keep fucking removing the post. I have no idea how to get this to stick and its important to me that the people I'm addressing read it.",
        "subreddit": "wallstreetbets",
        "title": "An Open Letter to Melvin Capital, CNBC, Boomers, and WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6omry/an_open_letter_to_melvin_capital_cnbc_boomers_and/",
        "created": 1611839174.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1610889192,
        "id": "kz682f",
        "num_comments": 406,
        "num_crossposts": 0,
        "selftext": "I created an algo that scans the most popular trading sub-reddits and logs the tickers mentioned in due-diligence or discussion-styled posts. Instead of scanning for how many times each ticker was mentioned in a comment, I logged how popular the post was among the sub-reddit. Essentially if it makes it to the 'hot' page, regardless of the subreddit, then it will most likely be on this list. There are two parts to this post. The first is for posts that were submitted in the most active trading sub-reddits (such as this one), and the second part has the most mentioned tickers from the WSB sub-reddit.\n\n**How is \"Hype\" calculated?**\n\nWell, this is a little tricky but it's based on the engagement that the post received in that sub-reddit relative to other posts in the same sub-reddit\n\n**How can I use this list?**\n\nThe best way to use this data is to learn about new tickers that might be trending. As an example, I probably would have never known about the ARK etfs, or even Palantir, until they started trending on Reddit. This gives many people an opportunity to learn about these stocks and decide if they want to invest in them or not. The data on this list is limited to one post per ticker. I've taken the most 'popular' post for that ticker on whichever sub-reddit it may have been. What I've found is that normally if tickers begin to trend on one sub-reddit then generally-speaking there will be posts for the same ticker on various other sub-reddits. Here's the data from the last week.\n\n# Most Hyped Stock Threads\n\n&amp;#x200B;\n\n|Title|Tickers|Avg Hype %|\n|:-|:-|:-|\n|[GME shorts get crushed as explained by Cramer ... big WSB shout out, the first of two in the show tonight](https://www.reddit.com/r/wallstreetbets/comments/kxhitu/gme_shorts_get_crushed_as_explained_by_cramer_big/)|GME|300+%|\n|[Tesla passes Facebook to become fifth most valuable U.S. company](https://www.reddit.com/r/stocks/comments/kt4dsy/tesla_passes_facebook_to_become_fifth_most/)|FB, TSLA|300+%|\n|[Citi wants a war? Let’s give them a war! PLTR ](https://www.reddit.com/r/wallstreetbets/comments/kwhxx3/citi_wants_a_war_lets_give_them_a_war_pltr/)|PLTR|300+%|\n|[ARKX. ARK invest Space Exploration ETF. SEC Filiing below](https://www.reddit.com/r/stocks/comments/kwr7ef/arkx_ark_invest_space_exploration_etf_sec_filiing/)|ARKW, ARKF, ARKK, ARKG|300+%|\n|[Nio Is the Next Tesla, Jim Cramer Says](https://www.reddit.com/r/stocks/comments/kvetxt/nio_is_the_next_tesla_jim_cramer_says/)|TSLA, NIO|300+%|\n|[NIO Partners with NVIDIA to Develop a New Generation of Automated Driving Electric Vehicles](https://www.reddit.com/r/stocks/comments/ktrnpo/nio_partners_with_nvidia_to_develop_a_new/)|NVDA, NIO|300+%|\n|[Looks like Hyundai IS doing a joint partnership with Apple for the Apple car. Time to buy GOEV.](https://www.reddit.com/r/stocks/comments/kv3xli/looks_like_hyundai_is_doing_a_joint_partnership/)|AAPL|300+%|\n|[Intel Gains 9% as CEO Bob Swan to step down Feb. 15, CNBC says](https://www.reddit.com/r/investing/comments/kwh7hg/intel_gains_9_as_ceo_bob_swan_to_step_down_feb_15/)|INTC|300+%|\n|[NIO DAY HIGHLIGHTS](https://www.reddit.com/r/stocks/comments/ktq03r/nio_day_highlights/)|NIO|300+%|\n|[Lemonade Insurance: A Full Blown Bubble?](https://www.reddit.com/r/investing/comments/kw1ssd/lemonade_insurance_a_full_blown_bubble/)|LMND|300+%|\n|[Sold a covered call on $PLUG earlier in the week and now it's deep ITM](https://www.reddit.com/r/thetagang/comments/kt3026/sold_a_covered_call_on_plug_earlier_in_the_week/)|PLUG|300+%|\n|[Amazon Stock Price Target Prediction &amp; Analysis \\[DCF, Fundamental &amp; Tehnical\\]](https://www.reddit.com/r/StockMarket/comments/kxwje8/amazon_stock_price_target_prediction_analysis_dcf/)|AMZN|300+%|\n|[Boeing 737 missing after take off in Indonesia](https://www.reddit.com/r/stocks/comments/ktp3wm/boeing_737_missing_after_take_off_in_indonesia/)|BA|297%|\n|[$TWTR down afterhours following donald trump ban](https://www.reddit.com/r/options/comments/ktiysz/twtr_down_afterhours_following_donald_trump_ban/)|TWTR|290%|\n|[Walmart to create fintech start-up with investment firm behind RH](https://www.reddit.com/r/investing/comments/kvcihl/walmart_to_create_fintech_startup_with_investment/)|WMT|187%|\n|[Took GM 50 years to come up with this? So bad its bullish](https://www.reddit.com/r/wallstreetbets/comments/ktm80t/took_gm_50_years_to_come_up_with_this_so_bad_its/)|GM|183%|\n|[Tesla's Model Y wins 5-star safety rating from NHTSA](https://www.reddit.com/r/stocks/comments/kx6mkw/teslas_model_y_wins_5star_safety_rating_from_nhtsa/)|TSLA|171%|\n|[I am the GME Oracle](https://www.reddit.com/r/wallstreetbets/comments/kxdout/i_am_the_gme_oracle/)|ORCL, GME|165%|\n|[ARKG or ARKK for long term gains?](https://www.reddit.com/r/investing/comments/ktmnxn/arkg_or_arkk_for_long_term_gains/)|ARKK, ARKG|161%|\n|[\\[Report\\] Goldman Sachs is trying to dump 38M shares of Uber. The sellers are unknown, but Bloomberg points to 9 large holders led by SoftBan...](https://www.reddit.com/r/investing/comments/ktu0we/report_goldman_sachs_is_trying_to_dump_38m_shares/)|UBER|159%|\n|[Silver, way more than just a precious metal and an incredible investment opportunity](https://www.reddit.com/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/)|SLV|145%|\n|[Shorted spy for Monday](https://www.reddit.com/r/options/comments/ktfxa3/shorted_spy_for_monday/)|SPY|98%|\n|[“A CBS interview with Tim Cook will reportedly bring a huge announcement from Apple on Wednesday.”](https://www.reddit.com/r/wallstreetbets/comments/kvz7t0/a_cbs_interview_with_tim_cook_will_reportedly/)|AAPL|82%|\n|[PTON value is out of control](https://www.reddit.com/r/investing/comments/kvx234/pton_value_is_out_of_control/)|PTON|73%|\n|[PSA: BlackBerry (BB), GME's forgotten... cousin? IV off the roof!!!](https://www.reddit.com/r/thetagang/comments/kxivci/psa_blackberry_bb_gmes_forgotten_cousin_iv_off/)|BB, GME|72%|\n|[Visa abandons takeover of Plaid after DOJ raises antitrust concerns](https://www.reddit.com/r/investing/comments/kwae77/visa_abandons_takeover_of_plaid_after_doj_raises/)|V|69%|\n|[Continuing our investing journey from PLTR to DTIL](https://www.reddit.com/r/stocks/comments/kxwq2t/continuing_our_investing_journey_from_pltr_to_dtil/)|DTIL, PLTR|61%|\n|[Call Options on Ford](https://www.reddit.com/r/options/comments/ksqqxo/call_options_on_ford/)|F|59%|\n|[Alibaba (BABA) is  on steroids!](https://www.reddit.com/r/stocks/comments/kxepm4/alibaba_baba_is_on_steroids/)|BABA|55%|\n|[MSFT, APPL, GOOGL - worth holding all of them?](https://www.reddit.com/r/stocks/comments/kwf6yh/msft_appl_googl_worth_holding_all_of_them/)|GOOGL|51%|\n\n&amp;#x200B;\n\n# WallStreetBets - Most Mention Equities This Week\n\n&amp;#x200B;\n\n|Ticker|Comments|Bullish %|\n|:-|:-|:-|\n|GME - Gamestop Corporation - Class A|18,694|89%|\n|TSLA - Tesla Inc|13,820|80%|\n|NIO - NIO Inc - ADR|4,956|77%|\n|PLTR - Palantir Technologies|4,567|89%|\n|AAPL - Apple Inc|4,278|82%|\n|PLUG - Plug Power Inc|2,947|85%|\n|BABA - Alibaba Group Holding Ltd - ADR|1,485|87%|\n|AMZN - Amazon.com Inc.|1,307|82%|\n|AMD - Advanced Micro Devices Inc.|1,286|88%|\n|FB - Facebook Inc - Class A|930|81%|\n|WISH - ContextLogic Inc - Class A|922|86%|\n|PSTH - Pershing Square Tontine Holdings Ltd - Class A|830|100%|\n|TLRY - Tilray Inc - Class 2|824|94%|\n|SPCE - Virgin Galactic Holdings Inc - Class A|666|94%|\n|APHA - Aphria Inc|622|96%|\n|BA - Boeing Co.|616|66%|\n|ARKG - ARK Investment Management LLC - ARK Genomic Revolution ETF|603|90%|\n|BB - BlackBerry Ltd|574|92%|\n|MT - ArcelorMittal |521|94%|",
        "subreddit": "stocks",
        "title": "I created an algo that tracks the most hyped stocks on Reddit. Here are the results for this week",
        "url": "https://www.reddit.com/r/stocks/comments/kz682f/i_created_an_algo_that_tracks_the_most_hyped/",
        "created": 1610917992.0
    },
    {
        "author": "brbcripwalking",
        "created_utc": 1611892764,
        "id": "l7ijqb",
        "num_comments": 147,
        "num_crossposts": 0,
        "selftext": "Noobs gather around for story time.\n\nOnce upon a time, the short interest on GameStop was 140% (what in the Roth IRA fuck) and the shares hit $490.\n\nWhat does that mean?\n\nI’ll explain like we’re on a short bus on the way to space camp. Keep your arms and legs inside the vehicle all times.\n\n_____\n\nThere’s only 100 crack rocks in the streets of Compton. Then these greedy ass bloods at Melvin St ask to borrow 140 crack rocks to return later and to pay interest on those rocks even though only 100 exist.\n\nThe kingpins who wrote them this contract do so unethically because the interest generates money.\n\nMelvin St does this without actually holding any crack because they’re not about that life. They’ll buy and return the rock when it’s cheaper in the future than when they borrowed it and pocket the change.\n\nThey do this order to drive the friendly neighborhood crack dealer GangStop out of business.\n\nMelvin St been doing this for years and when the last did this, one crack rock is worth $4. Melvin St really wants the rock to hit $0 and for GangStop to go out of business.\n\n______\n\nI love GangStop. They sell me my fucking hood rat stuff for cheap. So I buy 10 crack rocks. My homies at Grove St Bets likes GangStop too. So they buy 10 crack rocks.\n\nThere’s only 80 rocks available in the wild now.\n\n______\n\nRyan Cohen and his squad of Crips see value in this enterprise. They come in and buy up 30 crack rocks which is a controlling stake. Now there is only 50 rocks left in the wild and shorts still have to return 140 rocks. \n\nThe price of a crack rock skyrockets because Ryan Cohen promises to close underperforming corners and sell the gang shit online instead.\n\nCall options to buy a bag of crack rock at a certain price are purchased and this drives the prices up. The kingpins who wrote those contracts buy up rocks in case those calls are exercised and crack is called away. This is called gamma hedging.\n\n______\n\nGrove St Bets gets wind of this and /u/deepfuckingvalue, the oracle of the crack rock, leads the charge in buying up crack rock to fuck the nerds at Melvin St. Now there is only 30 rock available for sale.\n\nToday, a price of a crack rock is $312. And the supply of crack on the streets is dwindling. Melvin St tried their darndest to manipulate the pricing on this because they’re about to get gang banged if the debts are called in. This is called a margin call.\n\n______\n\nMelvin St even tried to blame Grove St Bets for the price action and they send robots and shills to make the moderators of this community have to work harder than they really have to.\n\nNoobs from all over the world started repping Compton and now Grove Street Bets is 5 million strong.\n\n______\n\nThe snitch ass bitches at the Citadel Community Center (who has a stake in Melvin St) called in the police commissioner at Apex Clearing House and they put pressure on Robinhood, Webull, E-Trade, etc to stop allowing the purchase of crack rock.\n\nHowever when the kingpins start gamma hedging, Melvin knows they’ll either be butt fucked or gangbanged on the street.\n\n______\n\nThey still owe 140 pieces of crack rock when there is only 100 available at all. On top of that most rocks are held by OG Ryan Cohen, Smart money, institutions, GSB, and Ja Rule.\n\nMelvin St and friends will have to pay any price in order to return the rocks that they borrowed in order to keep their homes and to not be gangbanged. This is called a short squeeze.\n\n_______\n\nThey are already $70b in the hole.\n\nhttps://www.reuters.com/article/us-retail-trading-shortbets-idUSKBN29X1SW?taid=6012f37e9ac87d000147d4e3\n\n______\n\nSome say the price of a rock could reach $10,000.\n\nIn order for that to happen. You must follow rule number 4 of Biggie Smalls 10 Crack Commandments. Never get high on your own supply. \n\nTLDR: Buy that shit. Hold that shit. Cocaines a helluva drug.\n\n\nhttps://i.imgur.com/C4GKV5i.jpg",
        "subreddit": "wallstreetbets",
        "title": "GameStop, Gamma Hedging, Wall Street Bets, and the Crack Rock. An in depth explanation of the dynamics of a short squeeze.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l7ijqb/gamestop_gamma_hedging_wall_street_bets_and_the/",
        "created": 1611921564.0
    },
    {
        "author": "slipperyslevine",
        "created_utc": 1611093896,
        "id": "l0uhxd",
        "num_comments": 133,
        "num_crossposts": 0,
        "selftext": "TLDR: This man DOES NOT KNOW HOW TO FUCKING LOSE\n\nTLDR: $BB 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n&amp;#x200B;\n\n[Trust in John S. Chen, and John S. Chen will deliver you tendies.](https://preview.redd.it/vw65iie24dc61.png?width=1124&amp;format=png&amp;auto=webp&amp;s=13e32b3f9d0d3f3a3af55924d0ff96a2aa6a72b5)\n\nFirst, the Chen family history: Chen's family is from Wuxi, the birthplace of modern industrialization in China. During the Chinese civil war, they migrated to Hong Kong, rebuilt their lives, and moved to the U S of A. It takes some serious stuff to get through all that. Undeterred, Chen-daddy then went on to graduate from Brown University manga cum laude in electrical engineering before getting his master's from Caltech.\n\nHere's where it gets really interesting:\n\n**Chen became CEO of Sybase in 1998. As John Gallant and Eric Knorr noted in** ***IT World***\\*\\*, Sybase had been a strong competitor of\\*\\* **Oracle**\\*\\*, but had become a \"dead company\" after failing to enter the market for enterprise applications, as Oracle had. Chen and his team proceeded to reinvent Sybase as an \"enabler of the 'unwired enterprise'\". In so doing, Chen and his team led a re-invention strategy that that led to the turnaround of the company into a profitable mobile device producer, valued at $6 billion in 2010.\\*\\*\n\n&amp;#x200B;\n\nDoes that sound like something similar?\n\nBlackBerry failed to anticipate and enter the touchscreen display market for phones, instead relying on their boomer keyboards and shitty 2-bit games. As we all know, Grand Poobah Jobs came in and slapped BlackBerry around.\n\nUntil Chen-daddy showed up and realized BlackBerry had incredible people and a huge edge in cybersecurity: their shitty boomer phones were entrusted by enterprises and governments around the world. Thus began a massive pivot to software which is now going to take BlackBerry back into the pantheon of big data companies and 🚀🚀🚀🚀🚀\n\n&amp;#x200B;\n\nTRUST IN CHEN!\n\nDisclaimer: I am long as fuck on $BB with options and shares and bought more today. Not selling until Chen is on the world's richest list",
        "subreddit": "wallstreetbets",
        "title": "$BB TRUST IN JOHN CHEN",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l0uhxd/bb_trust_in_john_chen/",
        "created": 1611122696.0
    },
    {
        "author": "pumpkinparty000",
        "created_utc": 1610655151,
        "id": "kxdout",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I am the GME Oracle",
        "url": "https://i.redd.it/wds76hk6vcb61.jpg",
        "created": 1610683951.0
    },
    {
        "author": "smshowoff",
        "created_utc": 1611803674,
        "id": "l6mjy8",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "# And the breakouts and 🚀 of next week:\n\n&amp;#x200B;\n\nI created an algo that scans the most popular trading sub-reddits and logs the tickers mentioned in due-diligence or discussion-styled posts. Instead of scanning for how many times each ticker was mentioned in a comment, I logged how popular the post was among the sub-reddit. Essentially if it makes it to the 'hot' page, regardless of the subreddit, then it will most likely be on this list. There are two parts to this post. The first is for posts that were submitted in the most active trading sub-reddits (such as this one), and the second part has the most mentioned tickers from the WSB sub-reddit.\n\n**How is \"Hype\" calculated?**\n\nWell, this is a little tricky but it's based on the engagement that the post received in that sub-reddit relative to other posts in the same sub-reddit\n\n**How can I use this list?**\n\nThe best way to use this data is to learn about new tickers that might be trending (like spotting those 🚀🚀).\n\nAs an example, I probably would have never known about the ARK etfs, or even Palantir, until they started trending on Reddit. This gives many people an opportunity to learn about these stocks and decide if they want to invest in them or not, or to use some automated brokerages like [Quantbase](https://www.getquantbase.com) with algo-investor models based on these sentiment analyses. The data on this list is limited to one post per ticker. I've taken the most 'popular' post for that ticker on whichever sub-reddit it may have been. What I've found is that normally if tickers begin to trend on one sub-reddit then generally-speaking there will be posts for the same ticker on various other sub-reddits. Here's the data from the last week.\n\n# Most Hyped Stock Threads\n\n&amp;#x200B;\n\n|Title|Tickers|Avg Hype %|\n|:-|:-|:-|\n|[GME shorts get crushed as explained by Cramer ... big WSB shout out, the first of two in the show tonight](https://www.reddit.com/r/wallstreetbets/comments/kxhitu/gme_shorts_get_crushed_as_explained_by_cramer_big/)|GME|300+%|\n|[Tesla passes Facebook to become fifth most valuable U.S. company](https://www.reddit.com/r/stocks/comments/kt4dsy/tesla_passes_facebook_to_become_fifth_most/)|FB, TSLA|300+%|\n|[Citi wants a war? Let’s give them a war! PLTR](https://www.reddit.com/r/wallstreetbets/comments/kwhxx3/citi_wants_a_war_lets_give_them_a_war_pltr/)|PLTR|300+%|\n|[ARKX. ARK invest Space Exploration ETF. SEC Filiing below](https://www.reddit.com/r/stocks/comments/kwr7ef/arkx_ark_invest_space_exploration_etf_sec_filiing/)|ARKW, ARKF, ARKK, ARKG|300+%|\n|[Nio Is the Next Tesla, Jim Cramer Says](https://www.reddit.com/r/stocks/comments/kvetxt/nio_is_the_next_tesla_jim_cramer_says/)|TSLA, NIO|300+%|\n|[NIO Partners with NVIDIA to Develop a New Generation of Automated Driving Electric Vehicles](https://www.reddit.com/r/stocks/comments/ktrnpo/nio_partners_with_nvidia_to_develop_a_new/)|NVDA, NIO|300+%|\n|[Looks like Hyundai IS doing a joint partnership with Apple for the Apple car. Time to buy GOEV.](https://www.reddit.com/r/stocks/comments/kv3xli/looks_like_hyundai_is_doing_a_joint_partnership/)|AAPL|300+%|\n|[Intel Gains 9% as CEO Bob Swan to step down Feb. 15, CNBC says](https://www.reddit.com/r/investing/comments/kwh7hg/intel_gains_9_as_ceo_bob_swan_to_step_down_feb_15/)|INTC|300+%|\n|[NIO DAY HIGHLIGHTS](https://www.reddit.com/r/stocks/comments/ktq03r/nio_day_highlights/)|NIO|300+%|\n|[Lemonade Insurance: A Full Blown Bubble?](https://www.reddit.com/r/investing/comments/kw1ssd/lemonade_insurance_a_full_blown_bubble/)|LMND|300+%|\n|[Sold a covered call on $PLUG earlier in the week and now it's deep ITM](https://www.reddit.com/r/thetagang/comments/kt3026/sold_a_covered_call_on_plug_earlier_in_the_week/)|PLUG|300+%|\n|[Amazon Stock Price Target Prediction &amp; Analysis \\[DCF, Fundamental &amp; Tehnical\\]](https://www.reddit.com/r/StockMarket/comments/kxwje8/amazon_stock_price_target_prediction_analysis_dcf/)|AMZN|300+%|\n|[Boeing 737 missing after take off in Indonesia](https://www.reddit.com/r/stocks/comments/ktp3wm/boeing_737_missing_after_take_off_in_indonesia/)|BA|284%|\n|[$TWTR down afterhours following donald trump ban](https://www.reddit.com/r/options/comments/ktiysz/twtr_down_afterhours_following_donald_trump_ban/)|TWTR|283%|\n|[Walmart to create fintech start-up with investment firm behind RH](https://www.reddit.com/r/investing/comments/kvcihl/walmart_to_create_fintech_startup_with_investment/)|WMT|234%|\n|[Took GM 50 years to come up with this? So bad its bullish](https://www.reddit.com/r/wallstreetbets/comments/ktm80t/took_gm_50_years_to_come_up_with_this_so_bad_its/)|GM|199%|\n|[Tesla's Model Y wins 5-star safety rating from NHTSA](https://www.reddit.com/r/stocks/comments/kx6mkw/teslas_model_y_wins_5star_safety_rating_from_nhtsa/)|TSLA|183%|\n|[I am the GME Oracle](https://www.reddit.com/r/wallstreetbets/comments/kxdout/i_am_the_gme_oracle/)|ORCL, GME|187%|\n|[ARKG or ARKK for long term gains?](https://www.reddit.com/r/investing/comments/ktmnxn/arkg_or_arkk_for_long_term_gains/)|ARKK, ARKG|143%|\n|[\\[Report\\] Goldman Sachs is trying to dump 38M shares of Uber. The sellers are unknown, but Bloomberg points to 9 large holders led by SoftBan...](https://www.reddit.com/r/investing/comments/ktu0we/report_goldman_sachs_is_trying_to_dump_38m_shares/)|UBER|136%|\n|[Silver, way more than just a precious metal and an incredible investment opportunity](https://www.reddit.com/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/)|SLV|135%|\n|[Shorted spy for Monday](https://www.reddit.com/r/options/comments/ktfxa3/shorted_spy_for_monday/)|SPY|122%|\n|[“A CBS interview with Tim Cook will reportedly bring a huge announcement from Apple on Wednesday.”](https://www.reddit.com/r/wallstreetbets/comments/kvz7t0/a_cbs_interview_with_tim_cook_will_reportedly/)|AAPL|91%|\n|[PTON value is out of control](https://www.reddit.com/r/investing/comments/kvx234/pton_value_is_out_of_control/)|PTON|83%|\n|[PSA: BlackBerry (BB), GME's forgotten... cousin? IV off the roof!!!](https://www.reddit.com/r/thetagang/comments/kxivci/psa_blackberry_bb_gmes_forgotten_cousin_iv_off/)|BB, GME|78%|\n|[Visa abandons takeover of Plaid after DOJ raises antitrust concerns](https://www.reddit.com/r/investing/comments/kwae77/visa_abandons_takeover_of_plaid_after_doj_raises/)|V|72%|\n|[Continuing our investing journey from PLTR to DTIL](https://www.reddit.com/r/stocks/comments/kxwq2t/continuing_our_investing_journey_from_pltr_to_dtil/)|DTIL, PLTR|71%|\n|[Call Options on Ford](https://www.reddit.com/r/options/comments/ksqqxo/call_options_on_ford/)|F|66%|\n|[Alibaba (BABA) is on steroids!](https://www.reddit.com/r/stocks/comments/kxepm4/alibaba_baba_is_on_steroids/)|BABA|63%|\n|[MSFT, APPL, GOOGL - worth holding all of them?](https://www.reddit.com/r/stocks/comments/kwf6yh/msft_appl_googl_worth_holding_all_of_them/)|GOOGL|33%|\n\n# \n\n# WallStreetBets - Most Mention Equities This Week\n\n&amp;#x200B;\n\n|Ticker|Comments|Bullish %|\n|:-|:-|:-|\n|GME - Gamestop Corporation - Class A|32,694|98%|\n|AMC Inc|15,820|100%|\n|BB - Blackberry Ltd|6,956|96%|\n|PLTR - Palantir Technologies|5,567|92%|\n|AAPL - Apple Inc|4,678|85%|\n|PLUG - Plug Power Inc|3,247|91%|\n|BABA - Alibaba Group|2,599|81%|\n|AMZN - Amazon.com Inc.|1,307|82%|\n|AMD - Advanced Micro...|1,286|88%|\n|FB - Facebook Inc - Class A|930|81%|\n|WISH - ContextLogic|922|86%|\n|PSTH - Pershing Square|830|100%|\n|TLRY - Tilray Inc - Class|2824|94%|\n|SPCE - Virgin Galactic|666|94%|\n|APHA - Aphria Inc|622|96%|\n|BA - Boeing Co.|616|66%|\n|ARKG - ARK ETF|803|90%|\n|Bed, Bath, and B..., BBBY Inc|784|97%|\n|MT - ArcelorMittal|721|92%|\n\n&amp;#x200B;",
        "subreddit": "stocks",
        "title": "Tracking the the most hyped stocks on Reddit. Here’s the results for this week.",
        "url": "https://www.reddit.com/r/stocks/comments/l6mjy8/tracking_the_the_most_hyped_stocks_on_reddit/",
        "created": 1611832474.0
    },
    {
        "author": "GiaSauseda",
        "created_utc": 1610307970,
        "id": "kulc34",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": "If you've paid any attention to the financial news over the last 2 years, you've seen the questions and critiques about Warren Buffett's cash position. In almost every interview he's asked why is he stacking cash or why Berkshire isn't outperforming the S&amp;P 500. The majority of questions aren't as brazen, but rewatch some of his interviews and you'll see that 1 or 2 questions along those lines comes up.\n\nTake this article by CNBC from November of last year:\n\nBeing in the enviable position of having that much cash to spend seems unenviable at the moment, as far as Berkshire shareholders, and maybe even Buffett, are concerned. Buffett’s company is currently on pace for its worst annual stock performance since 2009.\n\n“He pinned himself into a corner a few years ago, saying I can’t have $150 billion in cash in three to four years and say that’s alright,” said Greggory Warren, a Morningstar analyst who covers Berkshire Hathaway.\n\nUnderperformance versus the index, deals that have not worked out well, such as Kraft Heinz (thought it showed signs of life in its most recent earnings), and increasing willingness on Buffett’s part to consider share buybacks, all point to the the importance of moving that cash into investments that generate a return.\"\n\nhttps://www.cnbc.com/2019/11/01/even-obvious-way-for-buffett-to-solve-big-cash-problem-is-a-puzzle.html\n\nI can spend all day finding each and every article from the past 2-3 years but you understand my point.\n\nAs stocks soared to all time highs, people wondered just as they did during the tech boom whether Buffett had lost his touch. Now Buffett is sitting on a 125+ Billion dollar mountain of cash just biding his time. He's poised more favorably than he could ever ask for, and prices are just getting more reasonable by the day.\n\nTLDR: When you see Buffett stacking cash, he's not an idiot. He's waiting for prices to become reasonable again, which only happens after a significant market decline.\n\nI'm not saying he's an oracle, but he's rarely wrong. If history is any indicator, Berkshire is going to reap some mighty rewards.",
        "subreddit": "investing",
        "title": "Warren Buffett, as always, looks like the smartest guy in the room.",
        "url": "https://www.reddit.com/r/investing/comments/kulc34/warren_buffett_as_always_looks_like_the_smartest/",
        "created": 1610336770.0
    },
    {
        "author": "GnarExtracts",
        "created_utc": 1610471703,
        "id": "kvvw1y",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I'll post some DD, but we all know that 🚀🚀🚀🚀🚀🚀 is the only indicator we need to get to tendie town.  \n  \nCompared to the rest of the tech sector, ORCL is a bit of a sleeping giant. They're mildly undervalued, and have been crushing their earnings reports. Rumors from users is that their cloud tech is top notch and that they're becoming increasingly more competitive in their cloud services and enterprise IT products.  \n  \nWith a recent move to Austin, the ticker breaking out of its channel, and everything pointing upwards on one of the few mildly undervalued tech companies around, 90-100 by Q4 2021 is seriously possible. Most analysts see this ticker as a secure long-term bull play. Got over 60% of my portfolio in LEAPS over the past two days at Sept-16-2022 62.5c. Even a bull run of $6 bucks in the next few months can 2x your capital. Or you can throw it away on FDs, I'm hoping in my ship the fucking moooonnnnnnn 🚀🚀🚀🚀🚀🚀🚀🚀🚀 2021 Diamond Hands begins",
        "subreddit": "wallstreetbets",
        "title": "$ORCL 2021 MOON LANDING 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kvvw1y/orcl_2021_moon_landing/",
        "created": 1610500503.0
    },
    {
        "author": "StinkyPickles75",
        "created_utc": 1610630936,
        "id": "kx5mui",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "ATVK just released a statement on their new pink status and future plans. \n\nAbout the CEO from the release:\n\n “In his doctoral dissertation, he studied, investigated, analyzed and compared the general growth process of four technology companies: Microsoft, Google, Apple and Oracle. The study examined the founders, backgrounds, beginnings and business decisions that led them to become the technology giants they are today.”\n\nhttps://finance.yahoo.com/amphtml/news/ameritek-ventures-inc-now-pink-130000210.html?__twitter_impression=true",
        "subreddit": "pennystocks",
        "title": "ATVK Pink Current and Looking Ahead",
        "url": "https://www.reddit.com/r/pennystocks/comments/kx5mui/atvk_pink_current_and_looking_ahead/",
        "created": 1610659736.0
    },
    {
        "author": "tomorland",
        "created_utc": 1610380876,
        "id": "kv5hiw",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Let's brainstorm this a little bit.  I'm sure most of you saw that snippet from 60 minutes (posted on WSB recently), saying, \"Amazon would have to sell every book being sold in the world today to justify its stock price.\" That was way back in the late 1990s when Amazon was just an on-line book store. \n\nSomeone else said, \"That's Tesla today.\" \n\nI'd like to know how. \n\nAmazon had a clear path to expand from selling books, to household gadgets, to literally everything and anything sold by anyone anywhere. Including things that didn't exist in the 1990s, like AWS cloud services (that \\*should\\* have gone to someone like Akamai or CSCO or MSFT, or Oracle or even freaking WalMart had a better information system infrastructure than Amazon had in the 1990s.)  Amazon dominating that segment was just a fluke. And currently the lion's share of its revenue too.\n\nAlso, I wanted an electric car but didn't want Tesla's goofy iPad-style interface system, among other things, so I took an old sports car and built my own EV. Guess what? EV's are not hard. Sure, mine is definitely not more efficient than a Tesla (or Bolt, or etc.) but I learned something important -- replacing the drivetrain and installing batteries was the easy part (granted, I have some electrical engineering experience -- but not much). Literally everything else about building a car was way, way, WAY harder. Companies like Ford, GM, Toyota, VW, etc. can \\*easily\\* outbuild Tesla, and highly efficient, high-torque electric motors and solid state batteries appear to be on their way to commodity status. \n\nSolar Panels, self-driving capability, yada, yada... I don't see how these can possibly match the scale of what Amazon did. Grid energy storage, merging with Space-X and using Starlink's Skynet as part of the self-driving hive-mind... maybe? \n\nWhat else could there be? Fully autonomous, self-managing houses? Is Tesla going to start selling phones that use Starlink, to fulfill the space Iridium tried to back in the 90's? \n\nHelp me understand how TSLA \\*might\\* live-up to its current stock price. I want to believe, but currently, I'm just not seeing it.",
        "subreddit": "investing",
        "title": "Tesla (again)",
        "url": "https://www.reddit.com/r/investing/comments/kv5hiw/tesla_again/",
        "created": 1610409676.0
    },
    {
        "author": "Sensei071",
        "created_utc": 1610566145,
        "id": "kwnv0p",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "DMYI is the third SPAC of DMY Technology Group with solid management (including former CFO of Oracle and Accenture) and decent SPAC track record.\n\nDMY’s first SPAC, DYMT (now RSI post-merger) is now trading at above $22. DMY’s second SPAC, DMYD (going to merge with Genius Sport) is now trading at above $16. DMYI is trading at $11 but hasn’t announced a target just yet. But it has been confirmed that DMYI is targeting AI/cloud/quantum computing which is likely more disruptive and higher growth than the first two SPACs which targeted online gambling/sports betting.\n\nFor DMYI, I feel like the slight premium price for a SPAC without target announcement is justified given what I discussed above. I expect target announcement this quarter and the rewards are high with minimal risks based on the current share price.",
        "subreddit": "SPACs",
        "title": "DMYI - Under the radar SPAC",
        "url": "https://www.reddit.com/r/SPACs/comments/kwnv0p/dmyi_under_the_radar_spac/",
        "created": 1610594945.0
    },
    {
        "author": "tadhg8811",
        "created_utc": 1611097028,
        "id": "l0vkkl",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI work as a product manager at a large tech company and as part of my job it's important for me to understand major technology trends and strategies. I put this post together to outline a major new 'moat' strategy being used by some of the world's best SaaS companies. I've also highlighted some of the best related investment opportunities.\n\nIf you found this post valuable and would like to read more please let me know. I'm thinking about writing like this more often if it's something people get value from. Thanks a lot\n\n# The Lock-Expand-Improve Strategy\n\nIn 2016, Instagram launched their ‘Stories’ feature. Instagram Stories was an almost direct copy of Snapchat Stories (even copying the name). Whatever your opinion on such a move, it has most definitely paid off. By 2019, the daily active user count for Instagram stories was twice as high as Snapchat’s total DAU count.\n\nBuilding great software is still one of the most important things that software companies should be focused on. But it’s not enough. In a world where your best features can (and will) be copied, companies need to focus on building a strong economic moat around their business.\n\nFirst coined by Warren Buffett, an economic moat is a company’s ability to build and maintain a durable competitive advantage while protecting its long-term profits and market share.\n\n&gt;“The most important thing \\[is\\] trying to find a business with a wide and long-lasting moat around it … protecting a terrific economic castle with an honest lord in charge of the castle,” - Buffett\n\nI believe that there are 3 ‘types’ of moats in particular that when built together by tech companies, will compound upon each other to create a hugely defensible business. This business strategy will be one of the most important strategies of the next 10 years. Companies who can successfully execute on this strategy will dominate their markets and deliver outsized returns to their investors.\n\nI call this moat strategy the **Lock-Expand-Improve** strategy.\n\nIn this post, I’ll first briefly explain some of the traditional moats currently seen in tech companies. Then I’ll go into detail on the lock-expand-improve strategy. Finally, I’ll highlight a few tech companies that I think are best positioned to execute on this strategy and therefore make for great investment opportunities.\n\n## Traditional Business Moats\n\n* **Deep Technology/IP:** Sometimes, companies can build a massive economic moat by having deep technology that is at least 10 times better than the competition. Google’s search engine is the classic example of this. Google joined the search wars somewhat late but had a solution that was far better than Yahoo’s.\n* **Economies of Scale:** The bigger your are, the lower your costs will be due to having more operating leverage. This means that you can earn more money per customer (at the same price) or provide a cheaper solution than your smaller competitors. Software companies in general are great examples of economies of scale due to the almost zero additional cost of production involved in acquiring another customer.\n* **Network Effects:** Your product/service has network effects if its value increases as the number of people using it increases. Social networks and messaging products are classic examples of network effects. Network moats can be incredibly defensible. Why would I download a new messaging app when all of my friends are using WhatsApp?\n* **Brand Loyalty:** A strong brand can be a moat. Think Apple, Coca-Cola, Gucci. Instantly recognisable brands that have built huge businesses by cultivating brand loyalty amongst their customers.\n\nThe above moats have built some of the biggest and most enduring tech companies in the world. Google, Amazon and Facebook all have one or more of those moats. But many of these moats can become shallow over time. For example, network effects have been key to Facebook’s success. The more users that use Facebook, the better Facebook becomes for each individual user (to an extent). However, Facebook’s network effects don’t stop users from adopting and using other social networks.\n\nMajor platform shifts/trends can also make some moats a lot more shallow. The emergence of open-source software has made deep tech a far shallower moat in many instances.\n\nToday, for tech companies to build a truly durable competitive advantage they need more than one moat. These moats should also compound upon each other. The whole should be greater than the sum of its parts.\n\nEnter the lock-expand-improve moat strategy.\n\n## Lock-Expand-Improve\n\nBefore explaining the lock-expand-improve strategy, it’s important to note that this strategy is focused on B2B/enterprise software companies. While aspects of this strategy could most likely be useful for companies in other industries/verticals, I’ll only be highlighting investment opportunities in the B2B/enterprise space.\n\nThe most important thing to note about this strategy is that it is a compounding moat strategy. This means two things:\n\n1. Each step of the strategy must be in place for it to be successful.\n2. Each step builds upon the previous step to allow companies to build a stronger competitive advantage over time.\n\nWhile traditional moats allow companies to focus on protecting and improving their castle (business), these moats can get shallower over time. The lock-expand-improve strategy allows companies not only to to protect and improve their castles but also to ***dig a deeper and wider moat over time.***\n\n## Step 1: Lock-In\n\nThe first two steps of this strategy are similar to the popular ‘land and expand’ strategy.\n\nThe first step, lock-in (or high switching costs), involves making it very difficult for your customers to switch to a competitor. Here are some of the ways that software companies can achieve customer lock-in:\n\n1. **High sunk costs:** High sunk costs are a common feature of major ERP-style businesses such as ServiceNow or Oracle. Implementing these products can cost millions of dollars and take months to years. Once a customer has put that much time and effort into implementing your product, they will be far less likely to switch to a competitor.\n2. **Deep integrations:** If your product allows your customers to integrate with lots of other apps and data sources, it will be far harder for a company to switch to a competing product. They will not only have to replace your product but also replace all of the integrations that have been built up over time.\n3. **Business logic and workflows:** You can build customer lock-in by being the product in which a lot of customer information, logic and workflows are stored. A good example of this is Atlassian’s jira product. While the implementation costs for jira are low, a huge amount of organisational logic and process gets stored in jira over time, making it difficult to replace.\n\n## Step 2: Expand\n\nOnce you have achieved customer lock-in, the next step is to expand into other product areas and use cases. The goal is to solve more problems and sell more relevant products to each individual customer.\n\nThis multi-product strategy is a really powerful way of building a strong moat around your business. Even if the individual products are worse in isolation, the benefits of multi-product may far outweigh the negatives for customers.\n\nFor example, a competitor may have built a sales analytics tool that is far better than Salesforce’s analytics product. But a large customer is not comparing both analytics tools in isolation. A large customer is comparing your analytics tool against the fact that they can also get their CRM, marketing and customer support software all from Salesforce. One contract. One vendor relationship. One login for employees.\n\n## Step 3: Improve with data\n\nOnce a company has locked-in their customers and has expanded into new products, they can then begin collecting huge amounts of data about how their customers use their products.\n\nThis final step of this strategy is the most important - Using customer data to provide tangible benefits to those customers and significantly improve their businesses. There are two main ways that data can be used to benefit customers:\n\n1. ***Focus on using the data from an individual customer to benefit that specific customer -*** Companies can use an individual customer’s data to provide actionable insights to that customer to allow them to improve their businesses. For example, People.ai uses ML to help companies uncover new revenue opportunities. Customer data can also be used to automate specific, repetitive tasks for customers. For example, UiPath (can’t wait for their IPO) provides RPA solutions to allow customers to automate repetitive tasks.\n2. ***Focus on using the data from all customers to benefit the entire customer ecosystem -*** Google is a great example of a company that uses a data network effect to their advantage. The more search data they collect from all searches, the more accurate they can make searches in the future. We are beginning to see some enterprise software companies move in this direction. For example, ServiceNow provides benchmarking data to customers to allow them to compare themselves against industry standards and improve their business from there.\n\nArtificial intelligence and machine learning have been buzzwords in the software world for quite a while. Up until now, we haven’t seen huge benefits from AI/ML strategies in b2b/enterprise software. I strongly believe that this is beginning to change. We are starting to see the big incumbents build or acquire meaningful data solutions (eg Salesforce acquiring Tableau). Companies that can leverage AI/ML to do meaningful and useful things with their customer’s data will have a huge advantage over their competition.\n\n## The Flywheel\n\nYou can see how the lock-expand-improve strategy has such a compounding effect. By first locking in a customer, you can expand into new products, which allows you to then collect as much data as possible. Once you are collecting this data, you can then begin to use this data to provide big tangible benefits to your customers. These benefits mean your customers will be even less likely to switch to a competitor (lock-in) which will allow you to expand into even more products and collect even more data. The flywheel continues.\n\nThat is what’s so powerful about this strategy - where many traditional moats get shallower over time, the flywheel effect makes this economic moat even deeper and wider over time.\n\n## Investment Opportunities\n\n*(\\*\\*\\*Please note, that this post does not represent investment advice and these are just the companies that I'm excited about for my personal portfolio)*\n\nWhile there are many b2b/enterprise tech companies that have successfully executed on the first 2 steps of this strategy (lock and expand) and there are a number of companies placing a huge amount of focus on step 3 (improving with data), there are no companies who I feel have fully executed on this strategy in it’s entirety.\n\nFrom an investing perspective, the opportunity lies in identifying companies who are best positioned to (and would benefit most from) successful execute the lock-expand-improve strategy. Below are 3 such companies that I am incredibly bullish on.\n\n## Okta ($OKTA):\n\nOkta is an identity management company that provides identity services such as single sign on and user authentication. They are perfectly positioned to execute on the lock-expand-improve strategy.\n\nOkta has incredibly high lock-in properties. Once a product is managing your SSO, user authentication and provisioning services, it is not easy to replace. The switching costs are high both in terms of the amount of core business logic managed by the platform and the amount of integrations to other software products.\n\nOkta is successfully executing on the expansion aspect of this strategy too. They have moved into products such as API management and now have two major product areas; workforce identity management and customer identity management.\n\nI believe Okta has a huge opportunity to double down on their data initiatives and to truly start to help their customers to improve. They have already started doing so with their “Okta Insights” product which provides analytics and tailored recommendations to Okta customers. These products seem to be mostly focused on user security but imagine the further opportunities here - We are seeing an explosion in the number of SaaS products being used internally by companies. Okta is the single source of truth for companies to understand their SaaS usage, spend etc. Okta has a huge opportunity to leverage this information to help their customers choose the right tools, reduce unnecessary IT spend and much more.\n\nOkta is already the leader in the identity management space. If they continue to focus on their data strategy over the next few years then I firmly believe that the lock-expand-improve flywheel will begin turning and they will fully cement that position.\n\n## Twilio ($TWLO)\n\nTwilio provides communication APIs that allows companies to engage/communicate with customers over multiple channels such as SMS and Whatsapp.\n\nAPI products have very high lock-in characteristics. The more services that Twilio allows you to integrate with, the harder it becomes to switch to a competitor.\n\nTwilio is expanding into new product areas very successfully. They have expanded into new communications use cases such as video messaging and recently launched a programmable call centre product - Twilio Flex.\n\nWhat’s most interesting about Twilio is its data strategy. Up until 2020, they didn’t seem to have much of a data focus. But their recent acquisition of Segment looks set to change all that. Segment allows customers to make data-driven decisions around engineering and marketing., allowing them to improve their businesses over time. The Segment acquisition was a brilliant move. It makes Twilio’s position far more defensible. The flywheel effect could be very powerful here; Twilio already has high lock-in and is expanding aggressively, the Segment acquisition allows them to focus on helping their customers to improve their businesses through data.\n\n## Stripe\n\nOkay, I know - Stripe isn’t public. But I couldn’t help including them here. They look likely to go public in the few years and in my opinion are perfectly positioned to execute on the lock-expand-improve strategy.\n\nStripe’s product has high lock-in properties, they are expanding aggressively into other product areas and have already built a very powerful data product - Stripe Radar which allows companies to detect and fight fraud.\n\nStripe has all of the ingredients for a successful lock-expand-improve execution. Here’s hoping they go public sooner rather than later.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIf you liked this post lease let me know below. Are there any companies you think I should have added to the list?",
        "subreddit": "investing",
        "title": "Big investment opportunities in tech companies who adopt this business strategy",
        "url": "https://www.reddit.com/r/investing/comments/l0vkkl/big_investment_opportunities_in_tech_companies/",
        "created": 1611125828.0
    },
    {
        "author": "RedMurray",
        "created_utc": 1610548798,
        "id": "kwhogw",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Let me be serious with you kids for a minute (puts foot up on a stool, leans on his knee, arms crossed)...\n\nYou retards just might be right more often than not.  WSB is where I first heard people jizzing about PLUG, TSLA, GME, PLTR &amp; CRSR.  Four of the five have paid off well, perhaps the autist in here are more oracle than retard?",
        "subreddit": "wallstreetbets",
        "title": "WSB as legit DD?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kwhogw/wsb_as_legit_dd/",
        "created": 1610577598.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1609689923,
        "id": "kpn2s9",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "What's up fellas at Options. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n&amp;#x200B;\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|WORK - Slack Technologies Inc - Class A|20.7B|$42.24|9%|\n|SPY - SSgA Active Trust - SSGA SPDR S&amp;P 500|330B|$373.88|16%|\n|VZ - Verizon Communications Inc|243B|$58.75|18%|\n|PEP - Pepsico Inc.|205B|$148.42|19%|\n|TM - Toyota Motor Corporation - ADR|252B|$154.57|20%|\n|COST - Costco Wholesale Corp|167B|$376.75|20%|\n|WMT - Walmart Inc|408B|$144.15|21%|\n|PG - Procter &amp; Gamble Co.|345B|$139.14|21%|\n|HD - Home Depot, Inc.|286B|$265.62|21%|\n|WM - Waste Management, Inc.|49.8B|$117.93|21%|\n|ORCL - Oracle Corp.|190B|$64.69|21%|\n|CSCO - Cisco Systems, Inc.|189B|$44.73|22%|\n|HSY - Hershey Company|31.7B|$152.33|22%|\n|MCD - McDonald\\`s Corp|160B|$214.58|22%|\n|KO - Coca-Cola Co|236B|$54.84|22%|\n|KR - Kroger Co.|24.2B|$31.76|23%|\n|QQQ - Invesco Capital Management LLC - Invesco QQQ Trust Series 1|153B|$314.19|23%|\n|NKE - Nike, Inc. - Class B|222B|$141.47|25%|\n|YUM - Yum Brands Inc.|32.7B|$108.56|25%|\n|MMM - 3M Co.|101B|$174.79|25%|\n|JNJ - Johnson &amp; Johnson|414B|$157.38|26%|\n|LOW - Lowe\\`s Cos., Inc.|118B|$160.51|26%|\n|T - AT&amp;T, Inc.|205B|$28.76|26%|\n|V - Visa Inc - Class A|482B|$218.73|26%|\n|MO - Altria Group Inc.|76.2B|$41.00|26%|\n|TGT - Target Corp|88.4B|$176.53|27%|\n|ABT - Abbott Laboratories|194B|$109.49|27%|\n|IWM - BlackRock Institutional Trust Company N.A. - BTC iShares Russell 2000|58.7B|$196.06|27%|\n|DE - Deere &amp; Co.|84.3B|$269.05|27%|\n|CVS - CVS Health Corp|89.4B|$68.30|27%|\n|BMY - Bristol-Myers Squibb Co.|140B|$62.03|27%|\n|DPZ - Dominos Pizza Inc|15.1B|$383.46|27%|\n|HSBC - HSBC Holdings plc - ADR|106B|$25.91|28%|\n|BX - Blackstone Group Inc (The) - Class A|43.7B|$64.81|28%|\n|DLTR - Dollar Tree Inc|25.4B|$108.04|28%|\n|ADBE - Adobe Inc|240B|$500.45|28%|\n|AZN - Astrazeneca plc - ADR|131B|$49.98|29%|\n|MSFT - Microsoft Corporation|1.68T|$222.83|29%|\n|SBUX - Starbucks Corp.|125B|$107.05|29%|\n|JPM - JPMorgan Chase &amp; Co.|387B|$127.07|29%|\n|HPQ - HP Inc|31.7B|$24.59|29%|\n|IBM - International Business Machines Corp.|112B|$125.88|29%|\n|UNH - Unitedhealth Group Inc|333B|$350.68|29%|\n|PFE - Pfizer Inc.|205B|$36.81|30%|\n|SNE - Sony Corporation. - ADR|127B|$101.10|30%|\n|DELL - Dell Technologies Inc - Class C|53.1B|$73.29|30%|\n|MA - Mastercard Incorporated - Class A|353B|$356.94|31%|\n|TXN - Texas Instruments Inc.|151B|$164.19|31%|\n|CRM - Salesforce.Com Inc|204B|$222.53|31%|\n|CAT - Caterpillar Inc.|98.9B|$182.02|31%|\n|BK - Bank Of New York Mellon Corp|37.6B|$42.44|31%|\n|BAC - Bank Of America Corp.|262B|$30.31|31%|\n|FDX - Fedex Corp|68.8B|$259.62|32%|\n|GS - Goldman Sachs Group, Inc.|90.7B|$263.71|32%|\n|ATVI - Activision Blizzard Inc|71.8B|$92.84|32%|\n|GOOGL - Alphabet Inc - Class A|1.18T|$1752.52|32%|\n|GOOG - Alphabet Inc - Class C|1.18T|$1753.86|32%|\n|WMB - Williams Cos Inc|24.3B|$20.05|32%|\n|UPS - United Parcel Service, Inc. - Class B|146B|$168.40|32%|\n|DIS - Walt Disney Co (The)|328B|$181.18|32%|\n|EA - Electronic Arts, Inc.|41.6B|$143.73|33%|\n|DD - DuPont de Nemours Inc|52.2B|$71.11|33%|\n|MS - Morgan Stanley|124B|$68.53|34%|\n|BKNG - Booking Holdings Inc|91.2B|$2224.35|34%|\n|GILD - Gilead Sciences, Inc.|73B|$58.27|34%|\n|NVDA - NVIDIA Corp|323B|$522.43|36%|\n|AMAT - Applied Materials Inc.|78.9B|$86.37|36%|\n|LULU - Lululemon Athletica inc.|43.5B|$348.13|36%|\n|AMZN - Amazon.com Inc.|1.63T|$3258.85|36%|\n|CMG - Chipotle Mexican Grill|38.8B|$1386.71|37%|\n|WDAY - Workday Inc - Class A|43.1B|$239.89|37%|\n|C - Citigroup Inc|128B|$61.66|37%|\n|GOLD - Barrick Gold Corp.|40.5B|$22.78|37%|\n|SPLK - Splunk Inc|27.5B|$169.99|37%|\n|EBAY - EBay Inc.|34.6B|$50.24|38%|\n|FOXA - Fox Corporation - Class A|17.3B|$29.12|38%|\n|TSM - Taiwan Semiconductor Manufacturing - ADR|565B|$109.04|38%|\n|AAPL - Apple Inc|2.26T|$132.65|38%|\n|BABA - Alibaba Group Holding Ltd - ADR|630B|$232.73|39%|\n|DB - Deutsche Bank AG|22.5B|$10.90|39%|\n|GM - General Motors Company|59.6B|$41.64|39%|\n|NOW - ServiceNow Inc|107B|$550.43|39%|\n|TTWO - Take-Two Interactive Software, Inc.|23.9B|$207.84|39%|\n|XOM - Exxon Mobil Corp.|174B|$41.22|40%|\n|F - Ford Motor Co.|34.3B|$8.79|40%|\n|QCOM - Qualcomm, Inc.|172B|$152.50|40%|\n|LOGI - Logitech International S.A.|16.8B|$97.21|40%|\n|LUV - Southwest Airlines Co|27.5B|$46.61|40%|\n|ARKF - ARK ETF Trust - ARK Fintech Innovation ETF|1.94B|$49.71|40%|\n|FB - Facebook Inc - Class A|780B|$273.59|40%|\n|ULTA - Ulta Beauty Inc|16.2B|$287.25|40%|\n|INTC - Intel Corp.|204B|$49.84|41%|\n|ARKW - ARK Investment Management LLC - ARK Next Generation Internet ETF|5.3B|$146.36|41%|\n|LVS - Las Vegas Sands Corp|45.5B|$59.60|41%|\n|WFC - Wells Fargo &amp; Co.|125B|$30.18|41%|\n|PZZA - Papa John\\`s International, Inc.|2.8B|$84.90|41%|\n|PYPL - PayPal Holdings Inc|274B|$234.58|41%|\n|MELI - MercadoLibre Inc|83.5B|$1673.23|41%|\n|WBA - Walgreens Boots Alliance Inc|34.5B|$39.88|41%|\n|ALLY - Ally Financial Inc|13.3B|$35.66|42%|\n|FIT - Fitbit Inc - Class A|1.67B|$6.80|42%|\n|TWTR - Twitter Inc|43.1B|$54.15|43%|\n|BP - BP plc - ADR|69.3B|$20.52|44%|\n|NFLX - NetFlix Inc|239B|$541.00|44%|\n|TEVA - Teva- Pharmaceutical Industries Ltd. - ADR|10.5B|$9.65|45%|\n|OKTA - Okta Inc - Class A|30.8B|$254.33|45%|\n|JD - JD.com Inc - ADR|137B|$87.96|45%|\n|RH - RH - Class A|9.13B|$447.52|45%|\n|PCG - PG&amp;E Corp.|24.7B|$12.46|45%|\n|EXPE - Expedia Group Inc|18B|$132.40|46%|\n|VALE - Vale S.A. - ADR|88.6B|$16.76|46%|\n|PBR - Petroleo Brasileiro S.A. Petrobras - ADR|23.5B|$11.23|46%|\n|UBER - Uber Technologies Inc|90B|$51.00|46%|\n|BA - Boeing Co.|121B|$214.06|47%|\n|ESTC - Elastic N.V|12.8B|$146.13|47%|\n|DBX - Dropbox Inc - Class A|7.01B|$22.18|48%|\n|SMAR - Smartsheet Inc - Class A|8.47B|$69.29|48%|\n|DOCU - DocuSign Inc|41.5B|$222.41|48%|\n|NOK - Nokia Corp - ADR|2.57B|$3.91|48%|\n|UAA - Under Armour Inc - Class A|7.22B|$17.17|48%|\n|TEAM - Atlassian Corporation Plc - Class A|30.9B|$234.14|49%|\n|SHAK - Shake Shack Inc - Class A|3.25B|$84.78|49%|\n|GE - General Electric Co.|94.6B|$10.80|49%|\n|MU - Micron Technology Inc.|84B|$75.19|49%|\n|YETI - YETI Holdings Inc|5.96B|$68.47|49%|\n|SHOP - Shopify Inc - Class A|136B|$1131.95|49%|\n|DAL - Delta Air Lines, Inc.|25.6B|$40.21|49%|",
        "subreddit": "options",
        "title": "Weekend IV Report - Tickers with low IV and cheap premiums",
        "url": "https://www.reddit.com/r/options/comments/kpn2s9/weekend_iv_report_tickers_with_low_iv_and_cheap/",
        "created": 1609718723.0
    },
    {
        "author": "NicNicD",
        "created_utc": 1610763213,
        "id": "ky9p88",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This guy must feel like an Oracle right now!!",
        "url": "https://youtu.be/6HjbkmtCH8w",
        "created": 1610792013.0
    },
    {
        "author": "peaceouteast",
        "created_utc": 1610556853,
        "id": "kwkhcg",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Office vacancy rates climbed across the country during the pandemic, with downtown Toronto’s jumping to 7.2 per cent in the fourth quarter, as tenants tried to get rid of space and did not renew leases amid months of remote work.\n\nDowntown Toronto’s vacancy rate was over 50 per cent higher than the 4.7 per cent rate in the third quarter, and hit its highest level since the economic turmoil of the global financial crisis a decade ago, according to the latest report from CBRE commercial real estate firm. Space available for sublet represented almost half of the vacant space – a record high.\n\nUntil the pandemic struck, Toronto had been the crown jewel in North American office markets. The city had a vacancy rate below 3 per cent from 2018 through early last year, the lowest level across major cities in Canada and the U.S., including Manhattan and San Francisco.\n\nOverall, Canada’s office vacancy rate rose to 13 per cent in the fourth quarter, from 11.5 per cent in the third, with every major business hub in the country experiencing more vacancies and sublets: Vancouver reached 5.8 per cent vacancy rate, Montreal hit 10 per cent, Calgary 30 per cent, Edmonton 20 per cent, Ottawa 9.5 per cent and the Waterloo region 14 per cent, according to CBRE.\n\nMonths of remote work have made some companies believe that their work force can function relatively well outside of the office, and that has triggered them to give up some of their real estate. The pandemic’s devastating impact on tourism, retail and hospitality has also led companies in those industries to forgo office space in an effort to conserve cash.\n\n“The impact from working from home will take years to play out because leases don’t all roll over at once,” said CBRE Canada’s vice-chairman, Paul Morassutti. “Tenants are evaluating how they are working through the crisis.”\n\nIn downtown Toronto, the biggest office market in the country, the rental rates remained relatively steady even though vacancy rates rose. The shift to remote work is occurring as a stream of new office buildings are under construction and about to flood the market, which had been expected to push up vacancy rates and curb rent increase even prior to the pandemic.\n\nLast year, traditional office users such as PricewaterhouseCoopers, Cisco Systems Inc., Oracle Corp., Air Canada and PC Financial tried to get rid of some of their downtown Toronto space.\n\nAt the same time, companies that have prospered in the pandemic – Amazon.com Inc. and Shopify – increased their real estate in downtown Toronto. Amazon expanded its presence in two buildings. Shopify took more space in a new building even after its CEO had said the era of office centricity was over.\n\nOffice tenants are grappling with how much office space they will need in the future, as well as how their work force will function best when the pandemic eases.\n\n“I don’t think it means the death of the office market at all,” said Mr. Morassutti. “But by the same token, to suggest that there will be no impact whatsoever strikes me as being a little bit illogical, and not aligned with what we are seeing out there today.”\n\nAs traditional office tenants give up space, there are questions about whether there are enough Amazons and Shopifys to fill the new space and whether the big banks and other financial services companies will shrink their spaces when their leases are up for renewal.\n\nCalgary, which has suffered from two oil downturns over the past decade, continued to see a vacancy rate around 30 per cent. Since the 2014 oil recession, the major office tenants – oil companies and those that service the oil industry – have been retreating and shrinking their office footprint. That took place as big developers built their new office buildings, leaving the city awash in office space. Tenants with long-term lease obligations are still trying to downsize, according to CBRE.\n\nhttps://www.theglobeandmail.com/business/article-downtown-toronto-office-vacancy-rate-hits-highest-level-since-global/",
        "subreddit": "CanadianInvestor",
        "title": "Downtown Toronto office vacancy rate hits highest level since global financial crisis",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/kwkhcg/downtown_toronto_office_vacancy_rate_hits_highest/",
        "created": 1610585653.0
    },
    {
        "author": "Career_Regular",
        "created_utc": 1609781331,
        "id": "kqdbhy",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**Industry Overview**\n\nFinancial institutions are known for their lackluster online/digital experience. Many processes inside of these companies are done manually with paper and can take weeks to process and receive approval. Financial institutions are one of the most risk-averse sets of customers.\n\nBanks and other financial institutions will always be around. Although these companies may look different from today, this industry will always be around. That’s why Buffett invests in banks. As cloud software and the regulatory burden becomes more expensive and time-consuming, financial institutions are looking to improve their processes to be more efficient and please customers.\n\nSimple processes can drag on for weeks in financial institutions. Cloud software, nCino, and nCino’s competitors are helping solve this problem. nCino aims to change these manual processes and make financial institutions more nimble while still being compliant with all regulations.\n\nAccording to Gartner, banking had the highest global enterprise IT spending of all industries with approximately $376 billion spent in 2018. Although nCino only defines its serviceable addressable market at $10bn, the broader IT industry gives nCino a long runway of future potential growth.\n\nnCino has a number of competitors. My initial research shows that nCino competes with Fiserv, Oracle, and other small companies. In order to invest in nCino, a deeper look into the competitive environment will need to be completed.\n\n**Business Overview**\n\nnCino was founded in 2012 by a team of bankers. These founders built a software company solving problems for banks. The founders knew the struggles that often occur inside banks and used their knowledge to solve these problems. nCino is a bank operating system platform. It helps provide banks onboard, originate loans, open accounts, and many other processes. The CEO stated in an interview that “he wants the software to do everything from operations, ranging from treasury management to mortgages (coming soon), to tracking employees’ efficiency.” nCino already has relationships with over 305 financial institutions that use the nCino bank operating system, which is their main platform, and then nCino has another 920 financial institutions that use the portfolio analytics solution tool that was acquired in the acquisition of Visible Equity.\n\nnCino has already signed some of the largest financial institutions in the world. nCino boasts Bank of America, Barclays, TD Bank, and many regional community banks, credit unions, and challenger banks as customers.\n\nnCino sells its software on a per-seat basis. This gives it room to continue to expand within its existing customer base. nCino also stands to benefit from capturing more financial institutional clients and expanding their average contract value.  \\`\n\nHere is a list of nCino’s offerings: loan origination, portfolio analytics, compliance and risk management, digital customer engagement, customer relationship management (CRM), client onboarding, deposit account opening, business process automation, and enterprise content management.\n\n**Total Addressable Market**\n\nnCino’s S-1 touts that there are more than 28,000 financial institutions worldwide. Gartner also lists banking as the industry with the highest global enterprise IT spending with approximately $376 billion spent in 2018. The financial industry is one of the largest industries and if nCino can help power even a sliver of this industry, it will be a good future for this company. Of course, I have to caveat this by saying that starting a t-shirt business and capturing 1% of the apparel industry may seem plausible, but it is impossible. I make this statement because nCino already has a strong base of customers and has done the work to capture this pie. This gives it the possibility to capture more market share, not all of it, but more.\n\nThe bull thesis for nCino is to be the main software operating system for banks. As banks become more reliant on technology, nCino will prove to be a critical piece of infrastructure. nCino will also develop more product offerings that help their customers. This enhances the stickiness of nCino and leads to upsell opportunities.\n\nnCino’s management team lists the total serviceable market for nCino’s bank operating system at more than $10bn. I believe this is within reason and management is likely underestimating (on purpose or not) the addressable market they believe they can capture.\n\n**Competitive Advantages**\n\nAlthough I like to be optimistic about companies when researching them, I do think nCino is quite an attractive company based on my research on the qualitative aspects of the business.\n\n* **Mission-critical product with high switching costs.**\n   * The solutions that nCino provides are for mission-critical processes that banks want to be done right. Financial institutions would rather have a manual time-consuming process than an automatic process that goes wrong. Switching costs come into play once customers are comfortable with nCino’s product. As customers rely more and more on nCino, these customers are unlikely to switch.Switching from nCino (or any company) to a competitor may lead to outages, issues, and lots of problems that financial institutions will not risk having to deal with. Even if financial institutions attempt to build out their own bank operating system, it will be costly, prone to error, and not worth it! That’s like trying to build out Stripe if you’re an e-commerce company (@Shopify). Allocating capital to build out this function will make zero sense for financial institutions. It’s better to stick to what you know and what you’re good at. That’s why nCino will have high switching costs.\n* **Economies of scale.**\n   * The cost of building out a suite of software products and deploying it to a large customer base is much cheaper for a large company than a small company. Just like no startup would try and compete directly with Amazon, Shopify, Salesforce, Stripe, etc, as nCino grows, no company will come close to competing in the same fashion due to their scale benefits.As nCino looks to expand its product offering, the attractiveness of nCino’s products to financial institutions will only grow. Financial institutions, a very risk-averse set of customers, want products that have been vetted by other financial institutions and have offerings that solve critical problems.\n\n**Financials**\n\nLike many SaaS companies, nCino has two primary revenue lines. The first is recurring revenue similar to most SaaS companies. The second revenue source is professional services revenue. Subscription revenue accounts for the majority of revenue and gross profit.\n\n**January 2020:**\n\nTotal revenue = \\~$138mn\n\nGAAP Gross profit = \\~$74mn\n\nSubscription revenue = \\~$103mn\n\nSubscription revenue growth = \\~60%\n\nSubscription gross profit margin = \\~70%\n\nGAAP EBIT margin = -20%\n\n**January 2019:**\n\nTotal revenue = \\~$92mn\n\nGAAP Gross profit = \\~$45mn\n\nSubscription revenue = \\~$64mn\n\nSubscription revenue growth = \\~69%\n\nSubscription gross profit margin = \\~69%\n\nGAAP EBIT margin = -25%\n\n**January 2018:**\n\nTotal revenue = \\~$58mn\n\nGAAP Gross profit = \\~$28mn\n\nSubscription revenue = \\~$38mn\n\nSubscription revenue growth = N/A\n\nSubscription gross profit margin = \\~67%\n\nGAAP EBIT margin = -32%\n\nAlthough nCino is not profitable on a GAAP basis like many of its software peers, the attractiveness of the growth story is compelling. More research into unit economics may provide an even more compelling story.\n\n**What’s Interesting**\n\nThe financial industry is a risk-averse industry and usually, one of the last industries to adapt to change. This is changing with the increasing adoption of technology and software. The innovation occurring in FinTech and in financial institutions is growing. If nCino can be one of the main companies to be the operating system for banks (just like Microsoft/Salesforce is to most companies) then nCino may be an attractive investment opportunity.\n\nSalesforce also owns a large portion of nCino. nCino relies on the “Salesforce Platform.” Also, this may initially seem like a concern, Salesforce also owns 11.6% of nCino. It wouldn’t make much sense for Salesforce to stop nCino from using the Salesforce Platform if they own such a material stake in the company.\n\nSome of the hedge funds that I follow ([Link](https://twitter.com/StratusYoung/status/1327453755583893505)) have positions in nCino which is what initially attracted me to this business. Hedge funds like Dragoneer, Tiger Global, and Durable Capital have a position in nCino. Sure these positions may just be small positions to take advantage of the tech IPO pop, but future quarters will show if this is a long-term position for these funds.\n\n**Future Questions**\n\n* **Competition**\n   * In order to be more confident in nCino, I’d have to know more about the banking industry and the various competitors and similar nCino product offerings. Through my research, I found some competitors, but little to no information on these companies because they are private or are just not in the typical VC crowd.I also am not sure how hard it would be for Salesforce, Microsoft, or another well-funded company to try and launch similar product offerings to nCino. It seems from first glance that nCino has a strong suite of products, but not sure if this is something they’ve built over time or is from the founders’ background in banking. I doubt Salesforce would try and compete directly with nCino but may form some type of ongoing partnership.\n* **Ownership**\n   * I like to see management teams with large ownership stakes in the businesses they run. With nCino, I don’t see a large ownership stake. Although there were a number of founders and thus each founder has a small stake in nCino, the largest positions by far are owned by Insight Partners, Salesforce, and Wellington. I will need to do more research on digging into the ownership structure and see whether or not management is being incentivized alongside public investors.\n\n**Conclusion**\n\nI think nCino is a strong company and in my opinion, it’s one of the more attractive investment opportunities from the companies I’ve outlined in the past. The financial industry is huge and if nCino can continue to innovate, build products, upsell existing customers, and sign contracts with new customers, I think nCino may be a stock that people will be talking about in 3-5 years.\n\nIt’s had very strong growth thus far and likely will continue. Of course, the valuation is a key point with some concerns over the high multiple, but relative to similar high growth/high margin comparable companies, nCino fits into this bucket.",
        "subreddit": "wallstreetbets",
        "title": "nCino Analysis (NASDAQ: NCNO)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kqdbhy/ncino_analysis_nasdaq_ncno/",
        "created": 1609810131.0
    },
    {
        "author": "joerover22",
        "created_utc": 1610511395,
        "id": "kw8r3m",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Just curious if im over diversified? Thinking I may just go all ETF's and set it and forget it, buy on dips.  \n$APPL  \n$ATAC - spac  \n$CLA - spac  \n$FAN - wind energy etf  \n$GIK - spac  \n$GOEV - canoo EV company  \n$HLYN - spac  \n$ICLN - energy etc  \n$INTC - intel  \n$MARA - bitcoin blockchain mining  \n$NEE - energy  \n$ORCL - oracle  \n$RIOT - bitcoin blockchain mining  \n$SKLZ - esports/gaming  \n$TAN - solar energy etf  \n$TLRY - Marijuana  \n$WFC - Wells Fargo Banking",
        "subreddit": "StockMarket",
        "title": "Your Thoughts?",
        "url": "https://www.reddit.com/r/StockMarket/comments/kw8r3m/your_thoughts/",
        "created": 1610540195.0
    },
    {
        "author": "smshowoff",
        "created_utc": 1611819424,
        "id": "l6r0ws",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "# First off - HOLD $GME. This shit is forward-looking, for next week after The Great Squeeze and we need another 10Xer. $GME will be basically be a store of value to replace fiat by then so ONWARD AND UPWARD.\n\nI created an algo that scans the most popular trading sub-reddits and logs the tickers mentioned in due-diligence or discussion-styled posts. Instead of scanning for how many times each ticker was mentioned in a comment, I logged how popular the post was among the sub-reddit. Essentially if it makes it to the 'hot' page, regardless of the subreddit, then it will most likely be on this list. There are two parts to this post. The first is for posts that were submitted in the most active trading sub-reddits (such as this one), and the second part has the most mentioned tickers from the WSB sub-reddit.\n\n**How is \"Hype\" calculated?**\n\nWell, this is a little tricky but it's based on the engagement that the post received in that sub-reddit relative to other posts in the same sub-reddit\n\n**How can I use this list?**\n\nThe best way to use this data is to learn about new tickers that might be trending. As an example, I probably would have never known about the ARK etfs, or even Palantir, until they started trending on Reddit. This gives many people an opportunity to learn about these stocks and decide if they want to invest in them or not. The data on this list is limited to one post per ticker. I've taken the most 'popular' post for that ticker on whichever sub-reddit it may have been. What I've found is that normally if tickers begin to trend on one sub-reddit then generally-speaking there will be posts for the same ticker on various other sub-reddits. Here's the data from the last week.\n\n# Most Hyped Stock Threads\n\n&amp;#x200B;\n\n|Title|Tickers|Avg Hype %|\n|:-|:-|:-|\n|[GME shorts get crushed as explained by Cramer ... big WSB shout out, the first of two in the show tonight](https://www.reddit.com/r/wallstreetbets/comments/kxhitu/gme_shorts_get_crushed_as_explained_by_cramer_big/)|GME (obviously)|300+%|\n|[Tesla passes Facebook to become fifth most valuable U.S. company](https://www.reddit.com/r/stocks/comments/kt4dsy/tesla_passes_facebook_to_become_fifth_most/)|FB, TSLA|300+%|\n|[Citi wants a war? Let’s give them a war! PLTR](https://www.reddit.com/r/wallstreetbets/comments/kwhxx3/citi_wants_a_war_lets_give_them_a_war_pltr/)|PLTR|300+%|\n|[ARKX. ARK invest Space Exploration ETF. SEC Filiing below](https://www.reddit.com/r/stocks/comments/kwr7ef/arkx_ark_invest_space_exploration_etf_sec_filiing/)|ARKW, ARKF, ARKK, ARKG|300+%|\n|[Nio Is the Next Tesla, Jim Cramer Says](https://www.reddit.com/r/stocks/comments/kvetxt/nio_is_the_next_tesla_jim_cramer_says/)|TSLA, NIO|300+%|\n|[NIO Partners with NVIDIA to Develop a New Generation of Automated Driving Electric Vehicles](https://www.reddit.com/r/stocks/comments/ktrnpo/nio_partners_with_nvidia_to_develop_a_new/)|NVDA, NIO|300+%|\n|[Looks like Hyundai IS doing a joint partnership with Apple for the Apple car. Time to buy GOEV.](https://www.reddit.com/r/stocks/comments/kv3xli/looks_like_hyundai_is_doing_a_joint_partnership/)|AAPL|300+%|\n|[Intel Gains 9% as CEO Bob Swan to step down Feb. 15, CNBC says](https://www.reddit.com/r/investing/comments/kwh7hg/intel_gains_9_as_ceo_bob_swan_to_step_down_feb_15/)|INTC|300+%|\n|[NIO DAY HIGHLIGHTS](https://www.reddit.com/r/stocks/comments/ktq03r/nio_day_highlights/)|NIO|300+%|\n|[Lemonade Insurance: A Full Blown Bubble?](https://www.reddit.com/r/investing/comments/kw1ssd/lemonade_insurance_a_full_blown_bubble/)|LMND|300+%|\n|[Sold a covered call on $PLUG earlier in the week and now it's deep ITM](https://www.reddit.com/r/thetagang/comments/kt3026/sold_a_covered_call_on_plug_earlier_in_the_week/)|PLUG|300+%|\n|[Amazon Stock Price Target Prediction &amp; Analysis \\[DCF, Fundamental &amp; Tehnical\\]](https://www.reddit.com/r/StockMarket/comments/kxwje8/amazon_stock_price_target_prediction_analysis_dcf/)|AMZN|300+%|\n|[Boeing 737 missing after take off in Indonesia](https://www.reddit.com/r/stocks/comments/ktp3wm/boeing_737_missing_after_take_off_in_indonesia/)|BA|284%|\n|[$TWTR down afterhours following donald trump ban](https://www.reddit.com/r/options/comments/ktiysz/twtr_down_afterhours_following_donald_trump_ban/)|TWTR|283%|\n|[Walmart to create fintech start-up with investment firm behind RH](https://www.reddit.com/r/investing/comments/kvcihl/walmart_to_create_fintech_startup_with_investment/)|WMT|234%|\n|[Took GM 50 years to come up with this? So bad its bullish](https://www.reddit.com/r/wallstreetbets/comments/ktm80t/took_gm_50_years_to_come_up_with_this_so_bad_its/)|GM|199%|\n|[Tesla's Model Y wins 5-star safety rating from NHTSA](https://www.reddit.com/r/stocks/comments/kx6mkw/teslas_model_y_wins_5star_safety_rating_from_nhtsa/)|TSLA|183%|\n|[I am the GME Oracle](https://www.reddit.com/r/wallstreetbets/comments/kxdout/i_am_the_gme_oracle/)|ORCL, GME|187%|\n|[ARKG or ARKK for long term gains?](https://www.reddit.com/r/investing/comments/ktmnxn/arkg_or_arkk_for_long_term_gains/)|ARKK, ARKG|143%|\n|[\\[Report\\] Goldman Sachs is trying to dump 38M shares of Uber. The sellers are unknown, but Bloomberg points to 9 large holders led by SoftBan...](https://www.reddit.com/r/investing/comments/ktu0we/report_goldman_sachs_is_trying_to_dump_38m_shares/)|UBER|136%|\n|[Silver, way more than just a precious metal and an incredible investment opportunity](https://www.reddit.com/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/)|SLV|135%|\n|[Shorted spy for Monday](https://www.reddit.com/r/options/comments/ktfxa3/shorted_spy_for_monday/)|SPY|122%|\n|[“A CBS interview with Tim Cook will reportedly bring a huge announcement from Apple on Wednesday.”](https://www.reddit.com/r/wallstreetbets/comments/kvz7t0/a_cbs_interview_with_tim_cook_will_reportedly/)|AAPL|91%|\n|[PTON value is out of control](https://www.reddit.com/r/investing/comments/kvx234/pton_value_is_out_of_control/)|PTON|83%|\n|[PSA: BlackBerry (BB), GME's forgotten... cousin? IV off the roof!!!](https://www.reddit.com/r/thetagang/comments/kxivci/psa_blackberry_bb_gmes_forgotten_cousin_iv_off/)|BB, GME|78%|\n|[Visa abandons takeover of Plaid after DOJ raises antitrust concerns](https://www.reddit.com/r/investing/comments/kwae77/visa_abandons_takeover_of_plaid_after_doj_raises/)|V|72%|\n|[Continuing our investing journey from PLTR to DTIL](https://www.reddit.com/r/stocks/comments/kxwq2t/continuing_our_investing_journey_from_pltr_to_dtil/)|DTIL, PLTR|71%|\n|[Call Options on Ford](https://www.reddit.com/r/options/comments/ksqqxo/call_options_on_ford/)|F|66%|\n|[Alibaba (BABA) is on steroids!](https://www.reddit.com/r/stocks/comments/kxepm4/alibaba_baba_is_on_steroids/)|BABA|63%|\n|[MSFT, APPL, GOOGL - worth holding all of them?](https://www.reddit.com/r/stocks/comments/kwf6yh/msft_appl_googl_worth_holding_all_of_them/)|GOOGL|33%|\n\n# \n\n# WallStreetBets - Most Mention Equities This Week\n\n&amp;#x200B;\n\n|Ticker|Comments|Bullish %|\n|:-|:-|:-|\n|GME - Gamestop Corporation - Class A|320,694|98%|\n|AMC - AMC Inc|150,820|98%|\n|NOK - Nokia Inc|60,956|79%|\n|BB - Blackberry, Ltd|50,567|92%|\n|AAPL - Apple Inc|40,678|85%|\n|PLUG - Plug Power Inc|30,247|91%|\n|BABA - Alibaba Group|20,599|81%|\n|AMZN - Amazon.com Inc.|10,307|82%|\n|AMD - Advanced Micro...|10,286|88%|\n|FB - Facebook Inc - Class A|9,030|81%|\n|WISH - ContextLogic|9,022|86%|\n|PSTH - Pershing Square|8300|100%|\n|TLRY - Tilray Inc - Class|2824|94%|\n|SPCE - Virgin Galactic|6606|94%|\n|APHA - Aphria Inc|6022|96%|\n|BA - Boeing Co.|6016|66%|\n|ARKG - ARK ETF|4803|90%|\n|TSLA - Tesla|3784|97%|\n|MT - ArcelorMittal|3721|92%|",
        "subreddit": "Wallstreetbetsnew",
        "title": "AFTER--$GME MOVES: Made an algo that tracks the the most hyped stocks on Reddit. Here’s the next rocketships for next week.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/l6r0ws/aftergme_moves_made_an_algo_that_tracks_the_the/",
        "created": 1611848224.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1610472481,
        "id": "kvw5kq",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "What's up fellas at smallstreetbets. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|FIT - Fitbit Inc - Class A|1.72B|$7.00|17%|\n|VZ - Verizon Communications Inc|238B|$57.41|18%|\n|SPY - SSgA Active Trust - SSGA SPDR S&amp;P 500|334B|$378.37|18%|\n|COST - Costco Wholesale Corp|161B|$364.76|20%|\n|PG - Procter &amp; Gamble Co.|342B|$138.03|21%|\n|TM - Toyota Motor Corporation - ADR|250B|$153.69|21%|\n|WMT - Walmart Inc|417B|$147.30|21%|\n|WM - Waste Management, Inc.|49.5B|$117.05|22%|\n|PEP - Pepsico Inc.|196B|$142.08|22%|\n|ORCL - Oracle Corp.|186B|$62.99|22%|\n|KR - Kroger Co.|24.2B|$31.80|23%|\n|HD - Home Depot, Inc.|292B|$270.95|23%|\n|MCD - McDonald\\`s Corp|160B|$213.97|23%|\n|KO - Coca-Cola Co|216B|$50.16|24%|\n|HSY - Hershey Company|31.2B|$150.03|24%|\n|LOW - Lowe\\`s Cos., Inc.|122B|$166.23|25%|\n|MMM - 3M Co.|95.3B|$165.35|25%|\n|T - AT&amp;T, Inc.|206B|$28.86|25%|\n|NKE - Nike, Inc. - Class B|231B|$146.85|25%|\n|BMY - Bristol-Myers Squibb Co.|147B|$64.86|26%|\n|QQQ - Invesco Capital Management LLC - Invesco QQQ Trust Series 1|151B|$314.87|26%|\n|YUM - Yum Brands Inc.|32.5B|$107.49|26%|\n|MO - Altria Group Inc.|76.9B|$41.39|26%|\n|BX - Blackstone Group Inc (The) - Class A|42.3B|$62.84|27%|\n|JNJ - Johnson &amp; Johnson|420B|$159.25|27%|\n|V - Visa Inc - Class A|469B|$213.05|27%|\n|DPZ - Dominos Pizza Inc|15.4B|$390.63|27%|\n|DLTR - Dollar Tree Inc|26.4B|$112.18|28%|\n|IBM - International Business Machines Corp.|115B|$128.37|28%|\n|TGT - Target Corp|97.8B|$195.56|28%|\n|CVS - CVS Health Corp|99.6B|$75.99|28%|\n|HPQ - HP Inc|33.2B|$25.80|28%|\n|IWM - BlackRock Institutional Trust Company N.A. - BTC iShares Russell 2000|64.4B|$207.60|28%|\n|DE - Deere &amp; Co.|92.7B|$294.31|29%|\n|JPM - JPMorgan Chase &amp; Co.|421B|$137.91|29%|\n|MSFT - Microsoft Corporation|1.64T|$217.83|30%|\n|UNH - Unitedhealth Group Inc|342B|$360.05|30%|\n|PFE - Pfizer Inc.|210B|$37.69|30%|\n|CSCO - Cisco Systems, Inc.|192B|$45.53|30%|\n|DELL - Dell Technologies Inc - Class C|54.8B|$75.88|30%|\n|WORK - Slack Technologies Inc - Class A|20.6B|$42.19|31%|\n|ADBE - Adobe Inc|228B|$474.27|31%|\n|ABT - Abbott Laboratories|196B|$110.53|32%|\n|GILD - Gilead Sciences, Inc.|78.3B|$62.84|32%|\n|MA - Mastercard Incorporated - Class A|344B|$348.85|32%|\n|TXN - Texas Instruments Inc.|157B|$171.46|32%|\n|FDX - Fedex Corp|65B|$245.07|33%|\n|CRM - Salesforce.Com Inc|200B|$218.42|33%|\n|SNE - Sony Corporation. - ADR|131B|$103.74|33%|\n|BAC - Bank Of America Corp.|286B|$33.01|33%|\n|AZN - Astrazeneca plc - ADR|133B|$50.61|33%|\n|GOOGL - Alphabet Inc - Class A|1.19T|$1762.33|34%|\n|BK - Bank Of New York Mellon Corp|40.4B|$45.43|34%|\n|SBUX - Starbucks Corp.|122B|$104.48|34%|\n|GOOG - Alphabet Inc - Class C|1.19T|$1770.89|34%|\n|ATVI - Activision Blizzard Inc|70.3B|$91.00|34%|\n|DIS - Walt Disney Co (The)|324B|$179.01|35%|\n|UPS - United Parcel Service, Inc. - Class B|140B|$161.28|35%|\n|MS - Morgan Stanley|138B|$75.97|36%|\n|GS - Goldman Sachs Group, Inc.|101B|$293.19|36%|\n|LULU - Lululemon Athletica inc.|45.2B|$361.90|36%|\n|WDAY - Workday Inc - Class A|41.2B|$229.25|36%|\n|BKNG - Booking Holdings Inc|91B|$2219.47|36%|\n|WBA - Walgreens Boots Alliance Inc|41.2B|$47.66|36%|\n|DD - DuPont de Nemours Inc|61.6B|$84.11|37%|\n|HSBC - HSBC Holdings plc - ADR|112B|$27.54|37%|\n|C - Citigroup Inc|138B|$66.37|38%|\n|EA - Electronic Arts, Inc.|40.9B|$141.03|39%|\n|GOLD - Barrick Gold Corp.|41.8B|$23.55|39%|\n|AMAT - Applied Materials Inc.|89.6B|$97.78|39%|\n|EBAY - EBay Inc.|37.2B|$54.07|39%|\n|ULTA - Ulta Beauty Inc|16.3B|$289.55|39%|\n|AMZN - Amazon.com Inc.|1.56T|$3115.62|40%|\n|SPLK - Splunk Inc|26.9B|$167.31|40%|\n|FOXA - Fox Corporation - Class A|18B|$30.39|40%|\n|CAT - Caterpillar Inc.|105B|$193.79|40%|\n|WFC - Wells Fargo &amp; Co.|137B|$33.27|40%|\n|QCOM - Qualcomm, Inc.|176B|$155.97|41%|\n|PZZA - Papa John\\`s International, Inc.|3.07B|$93.28|41%|\n|WMB - Williams Cos Inc|26.1B|$21.54|41%|\n|ARKF - ARK ETF Trust - ARK Fintech Innovation ETF|2.09B|$50.96|41%|\n|XOM - Exxon Mobil Corp.|198B|$47.02|41%|\n|CMG - Chipotle Mexican Grill|39.2B|$1401.31|42%|\n|NVDA - NVIDIA Corp|337B|$546.22|42%|\n|TTWO - Take-Two Interactive Software, Inc.|23.7B|$206.99|42%|\n|INTC - Intel Corp.|211B|$51.56|42%|\n|AAPL - Apple Inc|2.17T|$129.09|42%|\n|NOW - ServiceNow Inc|102B|$524.21|42%|\n|ALLY - Ally Financial Inc|14B|$37.45|43%|\n|LUV - Southwest Airlines Co|28B|$47.40|43%|\n|PCG - PG&amp;E Corp.|24.2B|$12.16|43%|\n|BP - BP plc - ADR|82.3B|$24.38|43%|\n|F - Ford Motor Co.|36.3B|$9.28|43%|\n|LOGI - Logitech International S.A.|17.6B|$102.08|44%|\n|PYPL - PayPal Holdings Inc|278B|$238.09|44%|\n|ARKW - ARK Investment Management LLC - ARK Next Generation Internet ETF|5.69B|$154.83|44%|\n|MU - Micron Technology Inc.|88B|$78.56|45%|\n|TSM - Taiwan Semiconductor Manufacturing - ADR|636B|$122.58|45%|\n|MELI - MercadoLibre Inc|87.8B|$1763.60|45%|\n|PBR - Petroleo Brasileiro S.A. Petrobras - ADR|23.9B|$11.40|46%|\n|DISH - Dish Network Corp - Class A|17.2B|$32.77|47%|\n|FB - Facebook Inc - Class A|733B|$256.58|47%|\n|OKTA - Okta Inc - Class A|30.6B|$251.97|47%|\n|NFLX - NetFlix Inc|221B|$498.61|47%|\n|BA - Boeing Co.|117B|$206.85|48%|\n|RH - RH - Class A|9.97B|$487.07|48%|\n|ESTC - Elastic N.V|13.1B|$149.75|49%|\n|BABA - Alibaba Group Holding Ltd - ADR|615B|$226.72|49%|\n|GM - General Motors Company|64.4B|$45.13|49%|\n|GE - General Electric Co.|100B|$11.51|49%|\n|FEYE - FireEye Inc|5.23B|$23.14|49%|\n\n&amp;#x200B;",
        "subreddit": "smallstreetbets",
        "title": "IV Report - Tickers with low IV and cheaper premiums",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/kvw5kq/iv_report_tickers_with_low_iv_and_cheaper_premiums/",
        "created": 1610501281.0
    },
    {
        "author": "moonordead",
        "created_utc": 1611330957,
        "id": "l2qiep",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "KLR (Kaleyra) is a much smaller competitor of TWLO/Bandwidth offering customer engagement suites via instant messages, WhatsApp, email and voice call. It was founded by ex-Oracle employee in 1998 in Italy and recently have grown its presence in US and India via strategic acquisitions. \n\nKLR was taken public via reverse merger by GigCapital in 2019. However, the stock was punished during covid (and due to lack of fanfares) and it has only got back to pre covid level recently. On the surface, the stock might look expensive now considering +300% move from the bottom in Mar 2020. \n\nHowever, the stock remains comparatively cheap especially compared to its competitors. \n\nKLR is currently trading at 2.5x revenue while Bandwidth is trading at 15x revenue and Twilio at over 30x revenue. KLR definitely lacks the Silicon Valley connection and fanfare, hence might not fully enjoy the rich valuation of Twilio. \n\nHowever here are some facts to consider why KLR is an attractive alternative:\n\n- It is operating in fast growing industry that’s expected to grow at almost 30% until 2025 to $25B\n\nhttps://d1io3yog0oux5.cloudfront.net/_b3628f4508e2f2193d3417802f6fd670/kaleyra/db/777/6633/pdf/Investor+Presentation+November+2020-1.pdf\n\n- It’s revenue has been growing at 30% CAGR since 2015 from $60m to $160m in 2020\n\n- It’s EBITDA margin is expected to expand as the company has high operating leverage\n\n- It enjoys blue chip companies as their clients with some growing rapidly along with the company (Flipkart, Byju, Uber)\n\n- It’s retention rate among clients is very sticky \n\n- It just started growing in US (US revenue was 6% in 2019, 20% in 2020)\n\n- Even Twilio is a client of KLR in connectivity\n\nTldr: I own quite significant shares for my portfolio and some long dated options\n\nPlease feel free to criticize, any inputs are welcome",
        "subreddit": "stocks",
        "title": "KLR - Cheap alternative to TWLO/Bandwidth (CPaaS)",
        "url": "https://www.reddit.com/r/stocks/comments/l2qiep/klr_cheap_alternative_to_twlobandwidth_cpaas/",
        "created": 1611359757.0
    },
    {
        "author": "Intelligent-Rip-8312",
        "created_utc": 1609727996,
        "id": "kpz9vx",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hello, I am a french investor and this month am gonna invest 200€ (not my first investment). I will invest them in 4 stocks, and that's where the game begins.\n\nAm pretty sure my first 150€(50€ each) will go in \n1: Visa\n2: MasterCard\n3: Pepsi Co\n\nAny opinion about these investments are welcomed.\n\nAnd for the last 50€ I still don't know where to put them and that's why I ask you. I thaught about Exxon Mobil or maybe invest more in some action that I already have in my wallet (probably Oracle tbh) \n\n\nSo here's some information about my wallet to help u understand my situation : 700€ invested \n\nAMD 30.83%\nNvidia 14.17%\nSchneider electric 11.45%\nFederal Realty Investment 10.82%\nBlackStone Group 8.03%\nTotal 7.33%\nSanofi 7.24%\nOracle 7.23%\nMicrosoft 2.91%\n\nAny thaughts are welcome since am starting in this ;)",
        "subreddit": "investing",
        "title": "Where to invest my 200€",
        "url": "https://www.reddit.com/r/investing/comments/kpz9vx/where_to_invest_my_200/",
        "created": 1609756796.0
    },
    {
        "author": "ReyesA1991",
        "created_utc": 1609658320,
        "id": "kpg58o",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "With 2020 over, I decided to look at the regional geographic distribution of North America's \"mega\" cap corporations ($50b+ market capitalization) by headquarters.\n\nHere's the graphic I made laying that out: [https://i.imgur.com/t37BQWc.jpg](https://i.imgur.com/t37BQWc.jpg)\n\nNorth America has 152 mega cap companies, 145 in the United States and 7 in Canada. Mexico has 2 companies right on the cusp (Walmex at $49b and America Movil at $49b), but misses the cusp. Maybe next year.\n\nThese 152 companies have a market cap of $27.06 trillion. 97.7% is in the USA. 2.3% is in Canada.\n\nTo be clear, these companies are grouped based on the location of their headquarters, aka where high-level executive decisions are made (where CEO/President/Chairman/Board/executive management generally resides). Of course, these companies have multinational operations and their workforce is spread throughout.\n\nSome thoughts:\n\n* The U.S. gained $5.586 trillion in mega cap market value in the past year. Canada gained $97 billion. North America gained $5.683 trillion total.\n* The West Coast had a banner year due to COVID pandemic and general inertia. With 56.6 million people (of North America's 580 million, or 9.8%) it is now home to 46 companies who combined have 52.4% of North America's mega cap market value. Last year, these 145 companies had a market cap of $21.4 trillion, and the West Coast had 42.4% of the share. So the West Coast captured 10% of the mega cap \"market share\" in one year.\n* Mega cap market value increased by 26.79% in the United States and 18.34% in Canada. In both cases, the increase was due to tech growth. In Canada, Shopify's growth alone makes up nearly the entirety of Canada's growth. Shopify went from not being mega cap ($46b) on January 1, 2020, to having a market cap of $137 billion a year later, or 198% growth. If you exclude Shopify from Canada's listing, Canada's mega cap only grew by 1.24%, showing how countries without competitive tech industries will fall behind in the coming decade. If Shopify can continue to grow in the coming years, it will do wonders to shift Canada's mega cap value away from dying (energy) and stagnant (finance) industries.\n* The same tech shift was noticeable throughout the U.S. The West Coast's mega cap market value increased by a whopping 52.9% from $9.067 trillion to $13.863 trillion. Tesla alone added $593 billion of market capitalization, or nearly the entire mega cap value of Canada. The rest of the U.S. had mixed growth. The Great Lakes and Southeast had 12.75% market cap growth and 12.80% market cap growth, respectively. The Northeast, heavy on traditional industries and finance, only grew by 4.56%. The Southwest declined by 5.32% due to the oil shock and Exxon's market cap collapse.\n* Of the 7 North American companies among the Top 10 globally, we have the following growth:  \n\n   * Alphabet: +$264 billion market cap growth\n   * Amazon: +$714 billion market cap growth\n   * Apple: +$968 billion market cap growth\n   * Berkshire Hathaway (the only non-tech): -$8 billion market cap growth\n   * Facebook: +$193 billion market cap growth\n   * Microsoft: +$482 billion market cap growth\n   * Tesla: +$593 billion market cap growth\n   * **TOTAL: +$3.206 trillion**\n* As the numbers above show, the 7 companies above grew by $3.206 trillion. So these 7 alone account for 57.4% of the U.S. gain, and 56.4% of North America's. They also account for 67% of the West Coast increase just due to sheer size, even if smaller tech companies had much better percentage growth rates than all but Tesla.\n* Two companies IPOd straight into mega cap territory: Airbnb and Snowflake. Both are seriously overvalued and I can't imagine them sustaining those levels.\n* If 2021 is a year of recovery, I could also see a correction, with money being pulled from the safety of big tech back into traditional industries. So next year's snapshot might be far less imbalanced than the +53% West Coast, +5% Northeast dynamic we had this year.\n* HQ relocations are a big question mark. This year alone, Charles Schwab and Oracle moved their HQs to Texas (though the former's isn't final final until January 21). If Paypal or Tesla move to Texas in 2021, the West Coast dominance could be reduced even further.\n\nAny other thoughts?",
        "subreddit": "investing",
        "title": "North American Mega Cap Company HQs by Geographic Distribution and Market Cap Growth 2020-2021",
        "url": "https://www.reddit.com/r/investing/comments/kpg58o/north_american_mega_cap_company_hqs_by_geographic/",
        "created": 1609687120.0
    },
    {
        "author": "Career_Regular",
        "created_utc": 1609769043,
        "id": "kq9c3u",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Industry Overview**\n\nFinancial institutions are known for their lackluster online/digital experience. Many processes inside of these companies are done manually with paper and can take weeks to process and receive approval. Financial institutions are one of the most risk-averse sets of customers. \n\nBanks and other financial institutions will always be around. Although these companies may look different from today, this industry will always be around. That’s why Buffett invests in banks. As cloud software and the regulatory burden becomes more expensive and time-consuming, financial institutions are looking to improve their processes to be more efficient and please customers. \n\nSimple processes can drag on for weeks in financial institutions. Cloud software, nCino, and nCino’s competitors are helping solve this problem. nCino aims to change these manual processes and make financial institutions more nimble while still being compliant with all regulations. \n\nAccording to Gartner, banking had the highest global enterprise IT spending of all industries with approximately $376 billion spent in 2018. Although nCino only defines its serviceable addressable market at $10bn, the broader IT industry gives nCino a long runway of future potential growth. \n\nnCino has a number of competitors. My initial research shows that nCino competes with Fiserv, Oracle, and other small companies. In order to invest in nCino, a deeper look into the competitive environment will need to be completed.  \n\n**Business Overview**\n\nnCino was founded in 2012 by a team of bankers. These founders built a software company solving problems for banks. The founders knew the struggles that often occur inside banks and used their knowledge to solve these problems. nCino is a bank operating system platform. It helps provide banks onboard, originate loans, open accounts, and many other processes. The CEO stated in an interview that “he wants the software to do everything from operations, ranging from treasury management to mortgages (coming soon), to tracking employees’ efficiency.” nCino already has relationships with over 305 financial institutions that use the nCino bank operating system, which is their main platform, and then nCino has another 920 financial institutions that use the portfolio analytics solution tool that was acquired in the acquisition of Visible Equity. \n\nnCino has already signed some of the largest financial institutions in the world. nCino boasts Bank of America, Barclays, TD Bank, and many regional community banks, credit unions, and challenger banks as customers. \n\nnCino sells its software on a per-seat basis. This gives it room to continue to expand within its existing customer base. nCino also stands to benefit from capturing more financial institutional clients and expanding their average contract value.\n\nHere is a list of nCino’s offerings: loan origination, portfolio analytics, compliance and risk management, digital customer engagement, customer relationship management (CRM), client onboarding, deposit account opening, business process automation, and enterprise content management. \n\n**Total Addressable Market**\n\nnCino’s S-1 touts that there are more than 28,000 financial institutions worldwide. Gartner also lists banking as the industry with the highest global enterprise IT spending with approximately $376 billion spent in 2018. The financial industry is one of the largest industries and if nCino can help power even a sliver of this industry, it will be a good future for this company. Of course, I have to caveat this by saying that starting a t-shirt business and capturing 1% of the apparel industry may seem plausible, but it is impossible. I make this statement because nCino already has a strong base of customers and has done the work to capture this pie. This gives it the possibility to capture more market share, not all of it, but more. \n\nThe bull thesis for nCino is to be the main software operating system for banks. As banks become more reliant on technology, nCino will prove to be a critical piece of infrastructure. nCino will also develop more product offerings that help their customers. This enhances the stickiness of nCino and leads to upsell opportunities. \n\nnCino’s management team lists the total serviceable market for nCino’s bank operating system at more than $10bn. I believe this is within reason and management is likely underestimating (on purpose or not) the addressable market they believe they can capture. \n\n**Competitive Advantages**\n\nAlthough I like to be optimistic about companies when researching them, I do think nCino is quite an attractive company based on my research on the qualitative aspects of the business.\n\n* **Mission-critical product with high switching costs.**\n   * The solutions that nCino provides are for mission-critical processes that banks want to be done right. Financial institutions would rather have a manual time-consuming process than an automatic process that goes wrong. Switching costs come into play once customers are comfortable with nCino’s product. As customers rely more and more on nCino, these customers are unlikely to switch. Switching from nCino (or any company) to a competitor may lead to outages, issues, and lots of problems that financial institutions will not risk having to deal with. Even if financial institutions attempt to build out their own bank operating system, it will be costly, prone to error, and not worth it! That’s like trying to build out Stripe if you’re an e-commerce company (@Shopify). Allocating capital to build out this function will make zero sense for financial institutions. It’s better to stick to what you know and what you’re good at. That’s why nCino will have high switching costs.\n* **Economies of scale.**\n   * The cost of building out a suite of software products and deploying it to a large customer base is much cheaper for a large company than a small company. Just like no startup would try and compete directly with Amazon, Shopify, Salesforce, Stripe, etc, as nCino grows, no company will come close to competing in the same fashion due to their scale benefits.     As nCino looks to expand its product offering, the attractiveness of nCino’s products to financial institutions will only grow. Financial institutions, a very risk-averse set of customers, want products that have been vetted by other financial institutions, and have offerings that solve critical problems.\n\n**Financials**\n\nLike many SaaS companies, nCino has two primary revenue lines. The first is recurring revenue similar to most SaaS companies. The second revenue source is professional services revenue. Subscription revenue accounts for the majority of revenue and gross profit. \n\n**January 2020:**\n\nTotal revenue = \\~$138mn\n\nGAAP Gross profit = \\~$74mn\n\nSubscription revenue = \\~$103mn\n\nSubscription revenue growth = \\~60%\n\nSubscription gross profit margin = \\~70%\n\nGAAP EBIT margin = -20%\n\n**January 2019:**\n\nTotal revenue = \\~$92mn\n\nGAAP Gross profit = \\~$45mn\n\nSubscription revenue = \\~$64mn\n\nSubscription revenue growth = \\~69%\n\nSubscription gross profit margin = \\~69%\n\nGAAP EBIT margin = -25%\n\n**January 2018:**\n\nTotal revenue = \\~$58mn\n\nGAAP Gross profit = \\~$28mn\n\nSubscription revenue = \\~$38mn\n\nSubscription revenue growth = N/A\n\nSubscription gross profit margin = \\~67%\n\nGAAP EBIT margin = -32%\n\nAlthough nCino is not profitable on a GAAP basis like many of its software peers, the attractiveness of the growth story is compelling. More research into unit economics may provide an even more compelling story. \n\n**What’s Interesting**\n\nThe financial industry is a risk-averse industry and usually, one of the last industries to adapt to change. This is changing with the increasing adoption of technology and software. The innovation occurring in FinTech and in financial institutions is growing. If nCino can be one of the main companies to be the operating system for banks (just like Microsoft/Salesforce is to most companies) then nCino may be an attractive investment opportunity. \n\nSalesforce also owns a large portion of nCino. nCino relies on the “Salesforce Platform.” Also, this may initially seem like a concern, Salesforce also owns 11.6% of nCino. It wouldn’t make much sense for Salesforce to stop nCino from using the Salesforce Platform if they own such a material stake in the company. \n\nSome of the hedge funds that I follow have positions in nCino which is what initially attracted me to this business. Hedge funds like Dragoneer, Tiger Global, and Durable Capital have a position in nCino. Sure these positions may just be small positions to take advantage of the tech IPO pop, but future quarters will show if this is a long-term position for these funds. \n\n**Future Questions**\n\n* **Competition**\n   * In order to be more confident in nCino, I’d have to know more about the banking industry and the various competitors and similar nCino product offerings. Through my research, I found some competitors, but little to no information on these companies because they are private or are just not in the typical VC crowd.  I also am not sure how hard it would be for Salesforce, Microsoft, or another well-funded company to try and launch similar product offerings to nCino. It seems from first glance that nCino has a strong suite of products, but not sure if this is something they’ve built over time or is from the founders’ background in banking. I doubt Salesforce would try and compete directly with nCino but may form some type of ongoing partnership.   \n* **Ownership**\n   * I like to see management teams with large ownership stakes in the businesses they run. With nCino, I don’t see a large ownership stake. Although there were a number of founders and thus each founder has a small stake in nCino, the largest positions by far are owned by Insight Partners, Salesforce, and Wellington. I will need to do more research on digging into the ownership structure and see whether or not management is being incentivized alongside public investors.\n\n**Conclusion**\n\nI think nCino is a strong company and in my opinion, it’s one of the more attractive investment opportunities from the companies I’ve outlined in the past. The financial industry is huge and if nCino can continue to innovate, build products, upsell existing customers, and sign contracts with new customers, I think nCino may be a stock that people will be talking about in 3-5 years. \n\nIt’s had very strong growth thus far and likely will continue. Of course, the valuation is a key point with some concerns over the high multiple, but relative to similar high growth/high margin comparable companies, nCino fits into this bucket.",
        "subreddit": "StockMarket",
        "title": "nCino Analysis (NASDAQ: NCNO)",
        "url": "https://www.reddit.com/r/StockMarket/comments/kq9c3u/ncino_analysis_nasdaq_ncno/",
        "created": 1609797843.0
    },
    {
        "author": "polilo123",
        "created_utc": 1611253562,
        "id": "l24agk",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Clover Health** just posted a recent filing and they mentioned that they are also capable in their app to automate a virtual visit as well as provide pharmaceutical deliveries to their clients. This insurance might become a x10 like TDOC and may be more of Value.\n\n&amp;#x200B;\n\n# Tele Health Services \n\n&gt;Additional Products Built on the Clover Assistant Platform   \n&gt;  \n&gt;While the platform is currently primarily used by physicians at the point of care, the Clover Assistant’s impact is scalable across a myriad of use cases.   \n&gt;  \n&gt;The platform is designed to surface the most relevant information for a specific context so that any users of the platform can make more informed decisions at the most actionable opportunity available. Use cases include:  \n&gt;  \n&gt;• **Office / virtual visits**. The Clover Assistant empowers physicians by recommending personalized, evidence-based medications, providing reminders of timely discussion topics and treatment, enabling requests for member data and orders for tests or screening kits and identifies potential undiagnosed conditions based on clinical evidence. Our software makes these features available for in-person visits or through telemedicine solutions.  \n&gt;  \n&gt;• **In-home visits**. The Clover Assistant empowers physicians and other providers who operate outside of clinical settings, offices or hospitals. It supports, for example, our in-home primary care program enabling lengthy interactions for our members with the most advanced illnesses or complex conditions. It also supports in-home programs targeting members who have been recently discharged from hospitals or who do not receive regular care from a PCP.  \n&gt;  \n&gt;• **Office staff.** Through its Care Connect feature, the Clover Assistant empowers office staff by identifying patients due for a visit, flagging members recently discharged from the hospital and providing tools for scheduling various screenings and follow-up visits.\n\n&amp;#x200B;\n\n# Pharmaceutical Partnerships\n\n&amp;#x200B;\n\n&gt;Our growth depends in part on the success of our strategic relationships with third parties.  \n&gt;  \n&gt;In order to grow our business, we anticipate that we will continue to depend on our relationships with third parties to perform certain operational functions and services, to support and use our Clover Assistant and technology platforms, and to support our general services and administration functions. These third parties include, for example, insurance brokers, our information technology system providers, data submission providers, coders, quality metrics auditors, **pharmacy benefit management (“PBM”), services suppliers, enrollment administration providers, and customer service, provider support line, call center and claim and billing service providers.** We also rely on integrations with EHR providers and clinical software developers. If their services become unavailable, our operations and business strategies could be significantly disrupted. For example, we have entered into agreements with our PBM services suppliers to provide us and certain of our members with certain PBM services, such as claims processing, **mail pharmacy services, specialty pharmacy services, retail network pharmacy network, participating pharmacy audits**, reporting, formulary services\n\n&amp;#x200B;\n\n# Scalable Software with Massive Partnerships\n\nCurrently there are 3 known massively (Unannounced) Partners of Clover (CVS, Walgreens, Costco) and one announced (Walmart) which was not really announced it was just in an SEC Filing.  Clover being a Software as a Service company is scalable everywhere think of it like SAP/ORACLE but for Healthcare providers. They can just translate everything and it can be deployable through any language. This project is also Spear Headed by the person who Led Google's Android UI.\n\n&amp;#x200B;\n\nThis thing has a potential x10 potentially even more in the long run. These levels are loading zone like Teladoc last year it was trading at $12 now its almost trading at $250 and the thing is Clover Health is in partnerships of Giant Conglomerates Chamath, Walmart, Walgreens, Costco, CVS.\n\nAnd with Biden Care coming up in the next few weeks I'm sure this will go parabolic into $100/share.",
        "subreddit": "SPACs",
        "title": "Clover health is also a Telehealth and Amazon of Pharmaceuticals besides being just what people think as insurance.",
        "url": "https://www.reddit.com/r/SPACs/comments/l24agk/clover_health_is_also_a_telehealth_and_amazon_of/",
        "created": 1611282362.0
    },
    {
        "author": "marioistic",
        "created_utc": 1610250599,
        "id": "ku6r4l",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Thought Oracle $ORCL would take off like many other tech stocks this year, feeling like 2021 is their year especially since the pandemic really bolsters their core structures",
        "url": "https://www.reddit.com/r/investing/comments/ku6r4l/thought_oracle_orcl_would_take_off_like_many/",
        "created": 1610279399.0
    },
    {
        "author": "marioistic",
        "created_utc": 1610250477,
        "id": "ku6pxd",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Thought Oracle would take off like the other tech stocks have, maybe their time is coming up soon?",
        "url": "https://www.reddit.com/r/stocks/comments/ku6pxd/thought_oracle_would_take_off_like_the_other_tech/",
        "created": 1610279277.0
    },
    {
        "author": "joerover22",
        "created_utc": 1610510449,
        "id": "kw8hje",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "New to investing, about a month and a half so far.  \nJust curious if im over diversified? Thinking I may just go all ETF's  and set it and forget it, buy on dips.  \n$APPL   \n$ATAC - spac  \n$CLA - spac  \n$FAN - wind energy etf  \n$GIK - spac  \n$GOEV - canoo EV company  \n$HLYN - spac  \n$ICLN  - energy etc  \n$INTC  - intel  \n$MARA - bitcoin blockchain mining  \n$NEE - energy  \n$ORCL - oracle  \n$RIOT - bitcoin blockchain mining   \n$SKLZ - esports/gaming  \n$TAN - solar energy etf  \n$TLRY - Marijuana  \n$WFC - Wells Fargo Banking",
        "subreddit": "StockMarket",
        "title": "Am I Over-Diversified?",
        "url": "https://www.reddit.com/r/StockMarket/comments/kw8hje/am_i_overdiversified/",
        "created": 1610539249.0
    },
    {
        "author": "Career_Regular",
        "created_utc": 1609780939,
        "id": "kqd6pm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Industry Overview**\n\nFinancial institutions are known for their lackluster online/digital experience. Many processes inside of these companies are done manually with paper and can take weeks to process and receive approval. Financial institutions are one of the most risk-averse sets of customers.\n\nBanks and other financial institutions will always be around. Although these companies may look different from today, this industry will always be around. That’s why Buffett invests in banks. As cloud software and the regulatory burden becomes more expensive and time-consuming, financial institutions are looking to improve their processes to be more efficient and please customers.\n\nSimple processes can drag on for weeks in financial institutions. Cloud software, nCino, and nCino’s competitors are helping solve this problem. nCino aims to change these manual processes and make financial institutions more nimble while still being compliant with all regulations.\n\nAccording to Gartner, banking had the highest global enterprise IT spending of all industries with approximately $376 billion spent in 2018. Although nCino only defines its serviceable addressable market at $10bn, the broader IT industry gives nCino a long runway of future potential growth.\n\nnCino has a number of competitors. My initial research shows that nCino competes with Fiserv, Oracle, and other small companies. In order to invest in nCino, a deeper look into the competitive environment will need to be completed.\n\n**Business Overview**\n\nnCino was founded in 2012 by a team of bankers. These founders built a software company solving problems for banks. The founders knew the struggles that often occur inside banks and used their knowledge to solve these problems. nCino is a bank operating system platform. It helps provide banks onboard, originate loans, open accounts, and many other processes. The CEO stated in an interview that “he wants the software to do everything from operations, ranging from treasury management to mortgages (coming soon), to tracking employees’ efficiency.” nCino already has relationships with over 305 financial institutions that use the nCino bank operating system, which is their main platform, and then nCino has another 920 financial institutions that use the portfolio analytics solution tool that was acquired in the acquisition of Visible Equity.\n\nnCino has already signed some of the largest financial institutions in the world. nCino boasts Bank of America, Barclays, TD Bank, and many regional community banks, credit unions, and challenger banks as customers.\n\nnCino sells its software on a per-seat basis. This gives it room to continue to expand within its existing customer base. nCino also stands to benefit from capturing more financial institutional clients and expanding their average contract value.\n\nHere is a list of nCino’s offerings: loan origination, portfolio analytics, compliance and risk management, digital customer engagement, customer relationship management (CRM), client onboarding, deposit account opening, business process automation, and enterprise content management.\n\n**Total Addressable Market**\n\nnCino’s S-1 touts that there are more than 28,000 financial institutions worldwide. Gartner also lists banking as the industry with the highest global enterprise IT spending with approximately $376 billion spent in 2018. The financial industry is one of the largest industries and if nCino can help power even a sliver of this industry, it will be a good future for this company. Of course, I have to caveat this by saying that starting a t-shirt business and capturing 1% of the apparel industry may seem plausible, but it is impossible. I make this statement because nCino already has a strong base of customers and has done the work to capture this pie. This gives it the possibility to capture more market share, not all of it, but more.\n\nThe bull thesis for nCino is to be the main software operating system for banks. As banks become more reliant on technology, nCino will prove to be a critical piece of infrastructure. nCino will also develop more product offerings that help their customers. This enhances the stickiness of nCino and leads to upsell opportunities.\n\nnCino’s management team lists the total serviceable market for nCino’s bank operating system at more than $10bn. I believe this is within reason and management is likely underestimating (on purpose or not) the addressable market they believe they can capture.\n\n**Competitive Advantages**\n\nAlthough I like to be optimistic about companies when researching them, I do think nCino is quite an attractive company based on my research on the qualitative aspects of the business.\n\n* **Mission-critical product with high switching costs.**\n   * The solutions that nCino provides are for mission-critical processes that banks want to be done right. Financial institutions would rather have a manual time-consuming process than an automatic process that goes wrong. Switching costs come into play once customers are comfortable with nCino’s product. As customers rely more and more on nCino, these customers are unlikely to switch. Switching from nCino (or any company) to a competitor may lead to outages, issues, and lots of problems that financial institutions will not risk having to deal with. Even if financial institutions attempt to build out their own bank operating system, it will be costly, prone to error, and not worth it! That’s like trying to build out Stripe if you’re an e-commerce company (@Shopify). Allocating capital to build out this function will make zero sense for financial institutions. It’s better to stick to what you know and what you’re good at. That’s why nCino will have high switching costs.\n* **Economies of scale.**\n   * The cost of building out a suite of software products and deploying it to a large customer base is much cheaper for a large company than a small company. Just like no startup would try and compete directly with Amazon, Shopify, Salesforce, Stripe, etc, as nCino grows, no company will come close to competing in the same fashion due to their scale benefits. As nCino looks to expand its product offering, the attractiveness of nCino’s products to financial institutions will only grow. Financial institutions, a very risk-averse set of customers, want products that have been vetted by other financial institutions, and have offerings that solve critical problems.\n\n**Financials**\n\nLike many SaaS companies, nCino has two primary revenue lines. The first is recurring revenue similar to most SaaS companies. The second revenue source is professional services revenue. Subscription revenue accounts for the majority of revenue and gross profit.\n\n**January 2020:**\n\nTotal revenue = \\~$138mn\n\nGAAP Gross profit = \\~$74mn\n\nSubscription revenue = \\~$103mn\n\nSubscription revenue growth = \\~60%\n\nSubscription gross profit margin = \\~70%\n\nGAAP EBIT margin = -20%\n\n**January 2019:**\n\nTotal revenue = \\~$92mn\n\nGAAP Gross profit = \\~$45mn\n\nSubscription revenue = \\~$64mn\n\nSubscription revenue growth = \\~69%\n\nSubscription gross profit margin = \\~69%\n\nGAAP EBIT margin = -25%\n\n**January 2018:**\n\nTotal revenue = \\~$58mn\n\nGAAP Gross profit = \\~$28mn\n\nSubscription revenue = \\~$38mn\n\nSubscription revenue growth = N/A\n\nSubscription gross profit margin = \\~67%\n\nGAAP EBIT margin = -32%\n\nAlthough nCino is not profitable on a GAAP basis like many of its software peers, the attractiveness of the growth story is compelling. More research into unit economics may provide an even more compelling story.\n\n**What’s Interesting**\n\nThe financial industry is a risk-averse industry and usually, one of the last industries to adapt to change. This is changing with the increasing adoption of technology and software. The innovation occurring in FinTech and in financial institutions is growing. If nCino can be one of the main companies to be the operating system for banks (just like Microsoft/Salesforce is to most companies) then nCino may be an attractive investment opportunity.\n\nSalesforce also owns a large portion of nCino. nCino relies on the “Salesforce Platform.” Also, this may initially seem like a concern, Salesforce also owns 11.6% of nCino. It wouldn’t make much sense for Salesforce to stop nCino from using the Salesforce Platform if they own such a material stake in the company.\n\nSome of the hedge funds that I follow have positions in nCino which is what initially attracted me to this business. Hedge funds like Dragoneer, Tiger Global, and Durable Capital have a position in nCino. Sure these positions may just be small positions to take advantage of the tech IPO pop, but future quarters will show if this is a long-term position for these funds.\n\n**Future Questions**\n\n* **Competition**\n   * In order to be more confident in nCino, I’d have to know more about the banking industry and the various competitors and similar nCino product offerings. Through my research, I found some competitors, but little to no information on these companies because they are private or are just not in the typical VC crowd. I also am not sure how hard it would be for Salesforce, Microsoft, or another well-funded company to try and launch similar product offerings to nCino. It seems from first glance that nCino has a strong suite of products, but not sure if this is something they’ve built over time or is from the founders’ background in banking. I doubt Salesforce would try and compete directly with nCino but may form some type of ongoing partnership.\n* **Ownership**\n   * I like to see management teams with large ownership stakes in the businesses they run. With nCino, I don’t see a large ownership stake. Although there were a number of founders and thus each founder has a small stake in nCino, the largest positions by far are owned by Insight Partners, Salesforce, and Wellington. I will need to do more research on digging into the ownership structure and see whether or not management is being incentivized alongside public investors.\n\n**Conclusion**\n\nI think nCino is a strong company and in my opinion, it’s one of the more attractive investment opportunities from the companies I’ve outlined in the past. The financial industry is huge and if nCino can continue to innovate, build products, upsell existing customers, and sign contracts with new customers, I think nCino may be a stock that people will be talking about in 3-5 years.\n\nIt’s had very strong growth thus far and likely will continue. Of course, the valuation is a key point with some concerns over the high multiple, but relative to similar high growth/high margin comparable companies, nCino fits into this bucket.",
        "subreddit": "SecurityAnalysis",
        "title": "nCino Analysis (NASDAQ: NCNO)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kqd6pm/ncino_analysis_nasdaq_ncno/",
        "created": 1609809739.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1610654961,
        "id": "kxdmkh",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "I am the GME Oracle (DD inside)",
        "url": "https://i.redd.it/9x08xadmucb61.jpg",
        "created": 1610683761.0
    },
    {
        "author": "crage222",
        "created_utc": 1610744332,
        "id": "ky3pc7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Well wishes from the Oracle Beaver",
        "url": "https://i.redd.it/pwtyaq0d8kb61.jpg",
        "created": 1610773132.0
    },
    {
        "author": "rollitdown",
        "created_utc": 1611847212,
        "id": "l6zg9z",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "The industry standard oracle network",
        "subreddit": "wallstreetbets",
        "title": "DECENTRAlinkZATION NEEDED.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6zg9z/decentralinkzation_needed/",
        "created": 1611876012.0
    },
    {
        "author": "tadhg8811",
        "created_utc": 1610581782,
        "id": "kwtbg5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nOne of the most important things I look for when analysing potential investments is whether or not the company has a strong economic moat. An economic moat gives a company a distinct advantage over its competitors, allowing it to protect and increase market share and revenue.\n\nI'm putting together a list of the most 'valuable' types of moats to look out for when analysing companies. Also trying to focus on more \"under-appreciated\" moats that investors often miss.\n\nWould love to hear if anyone has any suggestions on types of moats that could be added to the list???\n\n**Here's the list so far, would love your feedback:**\n\n(note: I focus on investing in tech companies so this list kind of reflects that)\n\n## Traditional Business Moats\n\n* **Technology:** Sometimes, companies can build a massive economic moat by having deep technology that is at least 10 times better than the competition. Google’s search engine is the classic example of this. Google joined the search wars somewhat late but had a solution that was far better than Yahoo’s.\n* **Economies of Scale:** The bigger your are, the lower your costs will be due to having more operating leverage. This means that you can earn more money per customer (at the same price) or provide a cheaper solution than your smaller competitors. Software companies in general are great examples of economies of scale due to the almost-zero additional cost of production involved in acquiring another customer.\n* **Network Effects:** Your product/service has network effects if its value increases as the number of people using it increases. Social networks and messaging products are classic examples of network effects. Network moats can be incredibly defensible. Why would I download a new messaging app when all my friends are using WhatsApp?\n* **Brand Loyalty:** A strong brand can be a moat. Think Apple, Coca-Cola, Gucci. Instantly recognisable brands that have built huge businesses by cultivating brand loyalty amongst their customers.\n\n## Under-Appreciated Moats\n\n#### 1. Professional Services:\n\nProfessional services typically involve providing hands-on setup, configuration and implementation support to your customers. This helps them to have the best possible experience of your product, suited to their specific needs. Providing professional services can create a unique economic moat for 3 key reasons:\n\n* **Stronger Customer Relationships:** By providing hands-on support to your customers, you will build a strong relationship and strong brand loyalty that is very difficult to replicate with “ready-to-go” products.\n* **Sunk Costs:** The significant cost, time and effort involved in the implementation process will deter your customers from switching to a competitor without a very strong reason.\n* **Switching Costs:** Providing hands-on support will make it very costly for your customers to move to a competitor. They would have to replicate all of the integrations and configurations that you have helped them setup. While also needing to retrain their staff on a brand new system. Costly indeed.\n\n#### 2. Multi-Product Strategy:\n\nA multi-product strategy is a really powerful way of building a strong moat around your business. Even if the individual products are worse in isolation, the benefits of multi-product may far outweigh the negatives for customers.\n\nFor example, a competitor have built a sales analytics tool that is far better than Salesforce’s analytics product. But a large customer is not comparing both analytics tools in isolation. A large customer is comparing your analytics tool against the fact that they can also get their CRM, marketing and customer support software all from Salesforce. One contract. One vendor relationship. One login for employees.\n\nThis presents a bit of a chicken/egg problem for competitors. How do you build a wedge into a market like this? It’s not easy. That’s why multi-product is such a compelling moat.\n\n#### 3. Data:\n\nData has always been a hugely valuable resource for tech companies. Many companies have built huge moats around their customer’s data. Companies like Oracle are essentially databases on which different enterprise applications have been built. Another name for this is a system of record.\n\nThe huge emerging opportunity in data lies in *doing useful things with that data.* It sounds simplistic but many enterprise products are still essentially CRUD applications. They may allow customers to easily access huge amounts of data, but they don’t allow you to do much more than create, read and update that data.\n\nWith machine learning, we are starting to see products that do really powerful things with data. For example, People.ai uses ML to help companies uncover new revenue opportunities from their customers. This is just the tip of the iceberg. For example, you can imagine an ML product that make hiring and promotion recommendations based on employee data. Or products that make marketing suggestions based on previous marketing campaigns.\n\nIt’s fairly clear that incumbent companies have the upper hand here. A company like Salesforce already has access to customer data. They ‘just’ need to build products that can make intelligent recommendations from this data. This combination (system of record + ML) would be a massively defensible moat. As Salesforce provides better recommendations to its customers, they would be less and less likely to move and store their data somewhere else. A virtuous cycle (for Salesforce).\n\n&amp;#x200B;\n\nWhat do you think of this list so far? What moats should I add to the list? Are there any that I should remove?\n\nThanks",
        "subreddit": "StockMarket",
        "title": "What are the most important economic moats?",
        "url": "https://www.reddit.com/r/StockMarket/comments/kwtbg5/what_are_the_most_important_economic_moats/",
        "created": 1610610582.0
    },
    {
        "author": "SpittinOpinions",
        "created_utc": 1611602430,
        "id": "l4v72c",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "BIGtoken will be spun off from Nasdaq-traded $SRAX into their own company through a reverse merger with $FPVD.\n\nThe definitive agreement has been signed and any day now the merger will be complete and the $FPVD ticker will be changed to reflect the new company, likely to $BIGT.\n\nBIGToken is a successful and growing revenue pillar for $SRAX and will finally be free to grow on their own, as their own company.\n\nThis is a bit of an unusual situation and has flown way under the radar since the merger hasn't taken effect yet and the ticker hasn't changed.  That'll happen any day.\n\nBIGtoken has hired a veteran digital media and blockchain expert as CEO and has assembled a great management team with big future plans for growth.\n\n$FPVD is trading around $0.01 right now, which is way undervalued, in my opinion, for what this company will be after the reverse merger, not even taking into account the huge growth projections they have for BIGtoken.\n\nDo your own due diligence on the opportunity and the new management team.  I am telling you all this to get the word out and this is in no way investment advice.\n\nHere is the link to details on the reverse merger and new CEO:\n\n[https://www.investorwire.com/news-articles/srax-inc-nasdaq-srax-announces-blockchain-and-digital-media-expert-lou-kerner-as-ceo-of-bigtoken/](https://www.investorwire.com/news-articles/srax-inc-nasdaq-srax-announces-blockchain-and-digital-media-expert-lou-kerner-as-ceo-of-bigtoken/) \n\nAnd here is a link on the new CEO discussing his big plans for BIGtoken:\n\n[https://medium.com/crypto-oracle/the-5-reasons-im-joining-bigtoken-as-ceo-6f216c1f1020](https://medium.com/crypto-oracle/the-5-reasons-im-joining-bigtoken-as-ceo-6f216c1f1020) \n\n&amp;#x200B;\n\n**About BIGtoken**\n\nBIGtoken is the first consumer-managed data marketplace where people can own and earn from their data. Through a transparent platform and consumer reward system, BIGtoken provides consumers choice, transparency and compensation for their data. The system also provides advertisers and media companies access to transparent, verified consumer data to better reach and serve audiences.",
        "subreddit": "pennystocks",
        "title": "$FPVD - BIGtoken Catalyst",
        "url": "https://www.reddit.com/r/pennystocks/comments/l4v72c/fpvd_bigtoken_catalyst/",
        "created": 1611631230.0
    },
    {
        "author": "Briguy52",
        "created_utc": 1611421888,
        "id": "l3g2gz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I have a small position in BB and have been considering expanding, but one thing I haven't seen much of in all the DD posted here is thorough analysis of Blackberry QNX's competition (I thought \"DD\" stood for \"due diligence\"? /s)\n\nAs a disclaimer, I have no auto industry background, but I do have experience in software.\n\nI'll be including hyperlinked sources for all stats and claims I make. \n\n# First off, reasons I like BB \n\nA lot of this has been overdone in this subreddit, but in summary:\n\n* Approaching $1B software and licensing revenue on $7.85B market cap (very reasonable price to sales for SAAS)\n* CEO John Chen has a technical background (BS in Electrical Engineering from Brown, MS in EE from Caltech) [from Wikipedia](https://en.wikipedia.org/wiki/John_S._Chen)\n* This is super important for tech companies because a technical CEO will actually understand their product and not just be a bean counter (case study: Bob Swan and Intel)\n* CEO John Chen made the bold move of pivoting from a doomed hardware business to software and has stuck at it for the last 7 years (he's not going anywhere until he accomplishes his mission)\n* Recent Sony/AWS/etc. partnerships\n* They are the incumbent in auto OS with Blackberry QNX running on 175 million cars right now [PR Newswire source](https://www.prnewswire.com/news-releases/blackberry-qnx-software-now-embedded-in-more-than-175-million-vehicles-301081594.html)\n* 5 years ago, they were at 60 million, so that's a CAGR of 23.8% per year (though that's starting to slow - 2019 to 2020 was 150M --&gt; 175M so 16.7% as they reach saturation I imagine + COVID)\n* Diversified revenue streams (licensing, patents, QNX, Spark, etc.)\n* IEC safety certs + possibility of integrating with their own security products ([https://blackberry.qnx.com/en/resource-center/qnx-certifications](https://blackberry.qnx.com/en/resource-center/qnx-certifications)) (I haven't found anything similar for Android Automotive yet, let me know if there is)\n\n# What is Android Automotive? (hint: not the same as Android Auto)\n\n* First off, Google made this very confusing by having two different things called \"Android Automotive\" (the OS) and \"Android Auto\" (the app)\n* [Here's what they say](https://source.android.com/devices/automotive/start/what_automotive):\n\n&gt;**Android Automotive is Android**. Android Automotive is not a fork or parallel development of Android. It is the same codebase and lives in the same repository as the Android shipped on phones, tablets, etc. It builds on a robust platform and feature set developed over 10+ years, enabling it to leverage the existing security model, compatibility program, developer tools, and infrastructure while continuing to be highly customizable and portable, completely free, and open source  \n&gt;  \n&gt;**Android Automotive extends Android**. In the course of building Android into a full-featured platform for infotainment, we’re adding support for automotive-specific requirements, features, and technologies. Android Automotive will be a full-stack, turnkey automotive infotainment platform, just as Android is for mobile today.\n\n\"Android Automotive is Android\". That's a big thing. That means:\n\n* Android Automotive is backed by Google and Google's Android teams\n* Android Automotive is backed by the Android open source community \n* Android Automotive can integrate closer with Google Play Store, Google Maps, and Google Assistant (literal quote from Nissan's press release [here](https://global.nissannews.com/en/releases/release-860852d7040eed420ffbaebb22094eb4-180918-01-e) which I cover later)\n* Any Android developers should theoretically be able to write an app for Android Automotive without too much retraining\n* We're talking about software here, so ultimately it's up to engineers and developers to actually use it\n* In the past, software deals were signed by taking CTOs and account executives to steakhouses and golfing excursions. \n* These days, engineers are a lot more involved - oftentimes spinning up prototypes to demo for their leadership before any deals are signed. (Or if they aren't, that's a huge red flag for any company that relies on tech.)\n\n# Developer friendliness case study: documentation\n\nThis sounds dumb, but let's look at what documentation engineers would have to work with:\n\nVirgin Blackberry QNX docs: [http://www.qnx.com/download/group.html?programid=29183](http://www.qnx.com/download/group.html?programid=29183)\n\n* Folder icons and entire page literally look out of Windows XP\n* You have to download PDFs (what are you going to do, print them all out and arrange them in your cubicle?)\n\nChad Android Automotive docs: [https://source.android.com/devices/automotive/evs/camera\\_system](https://source.android.com/devices/automotive/evs/camera_system)\n\n* Super clean, super easy to read, all in the browser, well organized\n\nCompare these to successful API-based SAAS services like [Stripe](https://stripe.com/docs/api) or [Twilio](https://www.twilio.com/docs/usage/api). If you were a developer and learning auto OS for the first time, what would you rather use?\n\nObviously, no company is going to pick an operating system based on their documentation alone, but I think it reveals a lot about the development ecosystem that their engineers will have to operate in. And ever more these days, engineers are empowered to guide their leadership in what software they want to use (e.g. engineers would rather use easy-to-use MongoDB than stuffy old Oracle).\n\n# Market Share\n\n* As mentioned at the beginning, Blackberry QNX is killing it with 175M cars on the road\n* That's the main reason why I like it in the short term - huge amounts of recurring SAAS revenue\n\nI'm worried that in 5-10 years, Apple and Google are going to come in and eat Blackberry's lunch just like they did with mobile:\n\n* GM will use Android Automotive in all their cars starting in 2021 [The Verge](https://www.theverge.com/2019/9/5/20851021/general-motors-android-auto-google-infotainment)\n\n&gt;General Motors will use Google’s new Android Automotive OS to power the infotainment systems in its cars starting in 2021, the two companies announced on Thursday. That means **Google Assistant, Maps, and other automotive-approved Android apps** will be available in GM’s cars via the Play Store without requiring the use of an Android smartphone.\n\n* Nissan, Renault, and Mitsubishi are using Android Automotive [Nissan press release](https://global.nissannews.com/en/releases/release-860852d7040eed420ffbaebb22094eb4-180918-01-e)\n\n&gt;World's leading automotive alliance signs a global multiyear agreement to partner with Google to equip Renault, Nissan and Mitsubishi vehicles with intelligent infotainment systems  \n&gt;  \n&gt;The Alliance will utilize Android, world's most popular operating system, to offer customers a new array of services including **Google Maps, Google Assistant and Google Play Store**  \n&gt;  \n&gt;These services will be combined with Alliance Intelligent \"Cloud based\" remote software upgrades and vehicle diagnostics\n\n* Porche's new all electric Taycan will be using Apple Car Play for all the cool software stuff (infotainment, music, etc.) while maintaining Blackberry QNX for the car critical functions [source](https://www.theglobeandmail.com/drive/mobility/article-big-tech-companies-may-soon-edge-out-automakers-with-advanced/)\n* While BB still gets their share, if the Apple/Intel developments are any indication, Apple will use 3rd parties to get going but their obsession with seamless hardware/software in their products makes me wonder how long it'll take before Apple does their own car OS\n\n# Summary\n\n* Big picture, the auto OS market is huge, \"expected to hit $4.5B by 2026\" so there's plenty of money to go around. It's possible Blackberry QNX, Android Automotive, and other OS may all flourish together. [global news wire source](https://www.globenewswire.com/news-release/2020/11/24/2132346/0/en/Automotive-OS-Market-to-hit-USD-4-5-Bn-by-2026-Global-Market-Insights-Inc.html)\n* That said, I find it very worrying that companies like GM, Nissan, Porsche are deciding to partner with the Google and Apple for their new models (obviously, they have no incentive to retrofit old/existing cars with new OS)\n* Short term BB's biggest moat comes from their incumbent market share + security guarantees (ie as a customer you'd get IEC certs for free by using BB QNX). I think their next few years will remain cushy.\n* Long term, I don't see any guarantee that auto manufacturers (especially start-ups composed of SV engineers) wouldn't go with open source Android Automotive over closed source Windows XP docs BB QNX that reeks of like IBM/Oracle/HP type boomer software.\n* BB does have diversified revenue with their security offerings, so though QNX is a large portion of their revenue, it's not all.\n\nAs mentioned earlier, I do have shares of BB (as well as GOOGL) and think BB will have a jolly good time in the next 3-5 years. But I do worry that Google and Apple will come in and repeat what they did to Blackberry with mobile.\n\nObligatory 🥜\n\nCheers.",
        "subreddit": "wallstreetbets",
        "title": "Have any BB holders considered the threat of Android Automotive?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l3g2gz/have_any_bb_holders_considered_the_threat_of/",
        "created": 1611450688.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1611493184,
        "id": "l3yzo0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What's up fellas at r/options. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|SPY - S&amp;P 500|341B|$383.90|15%|\n|VZ - Verizon Communi...|238B|$57.66|17%|\n|PG - Procter &amp; Gambl...|320B|$130.38|18%|\n|WM - Waste Managemen...|48.8B|$115.55|20%|\n|YUM - Yum Brands Inc....|32.3B|$107.33|20%|\n|COST - Costco Wholesal...|161B|$362.86|21%|\n|PEP - Pepsico Inc.|192B|$139.06|21%|\n|MCD - McDonald\\`s Corp...|159B|$213.67|22%|\n|WORK - Slack Technolog...|20.9B|$42.76|22%|\n|ORCL - Oracle Corp.|178B|$60.50|23%|\n|TM - Toyota Motor Co...|241B|$148.13|23%|\n|QQQ - Invesco Capital...|154B|$326.37|23%|\n|UNH - Unitedhealth Gr...|330B|$348.33|23%|\n|ABT - Abbott Laborato...|200B|$113.00|23%|\n|KO - Coca-Cola Co|208B|$48.63|24%|\n|HSY - Hershey Company...|30.8B|$148.42|24%|\n|BMY - Bristol-Myers S...|146B|$64.67|24%|\n|HD - Home Depot, Inc...|306B|$284.38|25%|\n|KR - Kroger Co.|25.6B|$33.55|25%|\n|NKE - Nike, Inc. - Cl...|219B|$139.86|25%|\n|WMT - Walmart Inc|414B|$146.52|25%|\n|IBM - International B...|106B|$118.36|25%|\n|PFE - Pfizer Inc.|203B|$36.63|26%|\n|BX - Blackstone Grou...|43.8B|$65.28|26%|\n|T - AT&amp;T, Inc.|206B|$29.04|26%|\n|V - Visa Inc - Clas...|445B|$202.28|26%|\n|DLTR - Dollar Tree Inc...|25.4B|$108.09|26%|\n|JNJ - Johnson &amp; Johns...|431B|$163.97|26%|\n|MMM - 3M Co.|97.5B|$169.72|27%|\n|JPM - JPMorgan Chase ...|408B|$134.16|27%|\n|MO - Altria Group In...|77.7B|$41.92|27%|\n|SBUX - Starbucks Corp....|121B|$104.45|27%|\n|TGT - Target Corp|96.1B|$191.97|27%|\n|CVS - CVS Health Corp...|97B|$74.29|28%|\n|IWM - BlackRock Insti...|65.4B|$214.59|28%|\n|ADBE - Adobe Inc|227B|$473.50|28%|\n|BK - Bank Of New Yor...|37.2B|$42.10|28%|\n|GILD - Gilead Sciences...|84B|$67.11|28%|\n|CSCO - Cisco Systems, ...|189B|$44.77|29%|\n|AZN - Astrazeneca plc...|140B|$53.23|29%|\n|GS - Goldman Sachs G...|99.6B|$290.36|30%|\n|MS - Morgan Stanley|134B|$74.35|30%|\n|MSFT - Microsoft Corpo...|1.71T|$227.04|30%|\n|DE - Deere &amp; Co.|96B|$306.28|30%|\n|BAC - Bank Of America...|273B|$31.66|30%|\n|TXN - Texas Instrumen...|159B|$173.42|30%|\n|MA - Mastercard Inco...|325B|$330.13|31%|\n|CAT - Caterpillar Inc...|104B|$192.22|31%|\n|INTC - Intel Corp.|232B|$56.84|32%|\n|GOOG - Alphabet Inc - ...|1.28T|$1907.03|32%|\n|FDX - Fedex Corp|67.4B|$254.80|32%|\n|SNE - Sony Corporatio...|128B|$101.22|33%|\n|GOOGL - Alphabet Inc - ...|1.28T|$1899.23|33%|\n|C - Citigroup Inc|128B|$61.43|33%|\n|NFLX - NetFlix Inc|250B|$568.11|33%|\n|LOGI - Logitech Intern...|18B|$104.11|34%|\n|WFC - Wells Fargo &amp; C...|132B|$32.01|34%|\n|ATVI - Activision Bliz...|73B|$94.36|34%|\n|EA - Electronic Arts...|42.3B|$146.21|35%|\n|WBA - Walgreens Boots...|41B|$47.35|35%|\n|UPS - United Parcel S...|137B|$159.81|35%|\n|LULU - Lululemon Athle...|43.4B|$346.73|35%|\n|LOW - Lowe\\`s Cos., In...|126B|$172.96|35%|\n|DIS - Walt Disney Co ...|313B|$173.08|35%|\n|WMB - Williams Cos In...|26.2B|$21.61|35%|\n|HPQ - HP Inc|32.6B|$25.33|36%|\n|ULTA - Ulta Beauty Inc...|16.9B|$300.31|36%|\n|BP - BP plc - ADR|80.6B|$23.80|36%|\n|CMG - Chipotle Mexica...|41.8B|$1500.68|36%|\n|AMZN - Amazon.com Inc....|1.65T|$3301.58|37%|\n|XOM - Exxon Mobil Cor...|201B|$47.50|37%|\n|BKNG - Booking Holding...|84.7B|$2074.22|38%|\n|GOLD - Barrick Gold Co...|41.7B|$23.49|38%|\n|ARKF - ARK ETF Trust -...|2.49B|$54.59|38%|\n|EBAY - EBay Inc.|38.9B|$56.35|38%|\n|HSBC - HSBC Holdings p...|113B|$27.86|38%|\n|PCG - PG&amp;E Corp.|23.3B|$11.82|38%|\n|SPLK - Splunk Inc|27.6B|$170.94|38%|\n|DELL - Dell Technologi...|55B|$76.12|38%|\n|DPZ - Dominos Pizza I...|15B|$380.81|39%|\n|TTWO - Take-Two Intera...|23.6B|$204.59|40%|\n|DD - DuPont de Nemou...|59.5B|$81.06|40%|\n|ALLY - Ally Financial ...|15.2B|$40.80|41%|\n|NOW - ServiceNow Inc|106B|$542.60|41%|\n|BABA - Alibaba Group H...|700B|$258.70|41%|\n|CRM - Salesforce.Com ...|207B|$226.31|41%|\n|AAPL - Apple Inc|2.34T|$139.62|41%|\n|AMAT - Applied Materia...|97.3B|$106.56|41%|\n|TSM - Taiwan Semicond...|670B|$129.55|41%|\n|PZZA - Papa John\\`s Int...|3.26B|$98.74|41%|\n|MU - Micron Technolo...|92.2B|$82.42|41%|\n|LUV - Southwest Airli...|28B|$47.45|42%|\n|WDAY - Workday Inc - C...|42.4B|$235.11|43%|\n|DB - Deutsche Bank A...|22.5B|$10.89|43%|\n|OKTA - Okta Inc - Clas...|32B|$263.63|43%|\n|ARKW - ARK Investment ...|6.45B|$164.76|43%|\n|FOXA - Fox Corporation...|17.7B|$30.25|44%|\n|QCOM - Qualcomm, Inc.|184B|$163.07|44%|\n|FB - Facebook Inc - ...|784B|$274.89|44%|\n|PBR - Petroleo Brasil...|21.3B|$10.21|44%|\n|RH - RH - Class A|10.2B|$501.10|45%|\n|PYPL - PayPal Holdings...|295B|$250.33|46%|\n|NVDA - NVIDIA Corp|340B|$549.84|46%|\n|BA - Boeing Co.|116B|$206.30|46%|\n|DAL - Delta Air Lines...|25.5B|$40.06|46%|\n|LVS - Las Vegas Sands...|41.4B|$54.24|46%|\n|JD - JD.com Inc - AD...|148B|$95.14|47%|\n|ARKK - ARK Investment ...|22.9B|$145.96|47%|\n|GE - General Electri...|97.3B|$11.15|48%|\n|CLDR - Cloudera Inc|4.38B|$13.97|49%|\n|DOCU - DocuSign Inc|47.6B|$254.53|49%|",
        "subreddit": "options",
        "title": "Weekend IV Report - Tickers with low IV and cheaper premiums",
        "url": "https://www.reddit.com/r/options/comments/l3yzo0/weekend_iv_report_tickers_with_low_iv_and_cheaper/",
        "created": 1611521984.0
    },
    {
        "author": "Wonderful-Raisin",
        "created_utc": 1611628011,
        "id": "l540k1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nHope you all are perched under your $BBBY Tendie waterfalls like I am... $BBBY is crushing it and there is more to come.\n\nFor you idiots that can't read or write... BBBY + 1/27/21 = 🚀🚀🚀. For tards that can open a box of Cheerios, please read on.\n\n**First of all, want to get something straight. I am the original $BBBY Oracle. Many imposters claim to be the sultan of these crispy tendies, but I was the first to post this on the Dumb Money Discord... took me a couple days to share it would my fellow WSB tards, but let it be known... The trade came from this multiple blunt force impacted brain.**\n\n**PROOF:**\n\nPhoto forthcoming (Bots won't let me) Wonderful-Raisin=optionsbythebay on DM Discord.\n\n&amp;#x200B;\n\nOriginal WSB Post: [https://www.reddit.com/r/wallstreetbets/comments/kmp2lg/bed\\_bath\\_to\\_infinity\\_and\\_beyond\\_bbby\\_solid\\_dd/](https://www.reddit.com/r/wallstreetbets/comments/kmp2lg/bed_bath_to_infinity_and_beyond_bbby_solid_dd/)\n\nEnough Gloating... had to do it or you tards may not listen and sell your precious soap and candle drizzled $BBBY shares.\n\n**TLDR:**\n\n* **BBBY is up nearly 100% since I posted 1 month ago.. so listen the fuck up.**\n* Read my Original WSB POST. Contains thorough research that has all proven true to date. Do your own damn research though.\n* NASDAQ Short Interest Report gets published on 1/27/2021 @ 4PM ET  \n\n   * After last Short Interest Report on 1/12, $BBBY had 76M shares shorted.  \n\n      * This is a shit pile of shares. Bigger than Andy Left's nightly shit pile after compulsively gorging himself with fast food as he contemplates his bankruptcy strategy... but really, its a lot, 14.5 Days to cover.\n      * Last Nasdaq report Here: [https://www.nasdaq.com/market-activity/stocks/bbby/short-interest](https://www.nasdaq.com/market-activity/stocks/bbby/short-interest)\n      * This was the short interest only through 12/31 which was pre earnings. Earnings happened on 1/7, which many of you cowards sold your shares right after. That's why you're poor and I'm swimming in Tendies.\n* PREDICTION: The next short interest report is going to show that MORE shares are Shorted than last time... Because the short interest for next report will be through 1/15.  \n\n   * Reasoning: Most of the real Wall Street Tards doubled down after what was thought to be a lackluster earnings... It actually was great. BBBY missed because they reported a nice tax cutting loss on the sale of Cost Plus.... Future Earnings will only be 🚀🚀🚀 from here on out.\n* PREDICTION: Since WSB Tardnation has now made the idea of buying heavily shorted stocks cooler than an NRB at the beach , this is going to drive $BBBY to the top of the short interest rankings.\n\n**Bottom Line:**\n\nBBBY at top of the short interest rankings+ Lord Tritton's Oil Tanker of Unicorn Tears+ ECommerce improvements+ cooking/home trend continuing through 2021+ WSB Tardnation+ Boomer WSB wannabees=Endless Mangroves of Cripsy $BBBY Tendies\n\nValhalla we ride...\n\n\\*I am not a financial advisor, this is my opinion and my opinion only. Do your own research before making a trade. Do not take this as financial advice\\*",
        "subreddit": "wallstreetbets",
        "title": "I am the $BBBY Oracle - Why $BBBY=3X on 1/27/2021 🚀🚀🚀🚀 All Hail Lord Tritton",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l540k1/i_am_the_bbby_oracle_why_bbby3x_on_1272021_all/",
        "created": 1611656811.0
    },
    {
        "author": "pseudotooth",
        "created_utc": 1612021570,
        "id": "l8ob50",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Ladies and Gentlemen, the Oracle has spoken!",
        "url": "https://i.redd.it/0hihwc29qhe61.jpg",
        "created": 1612050370.0
    },
    {
        "author": "neonJK",
        "created_utc": 1612066656,
        "id": "l94ap6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "DeepFuckingValue - The Oracle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l94ap6/deepfuckingvalue_the_oracle/",
        "created": 1612095456.0
    },
    {
        "author": "merongmahawangsa",
        "created_utc": 1609723792,
        "id": "kpy0bi",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Anyone else think orcl is undervalued?",
        "url": "https://www.reddit.com/r/StockMarket/comments/kpy0bi/anyone_else_think_orcl_is_undervalued/",
        "created": 1609752592.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1611338135,
        "id": "l2t21k",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "https://www.thestreet.com/investing/goldman-initiaties-microsoft-at-buy-oracle-at-sell\n\nRegarding Microsoft, Goldman analysts wrote in a commentary that it “stands out very uniquely in the technology world given its strong presence across all layers of the cloud stack including applications platforms and infrastructure.” \n\nThey added that “our investment thesis is that Microsoft is well positioned to double its $60 billion-plus commercial cloud business (Azure, Office 365, Dynamics, and LinkedIn Commercial) into a $120 billion to $140 billion business longer term. We believe that Microsoft’s installed base of on-premise Windows servers alone represents $80 billion to $90 billion in potential Azure business.”",
        "subreddit": "stocks",
        "title": "Microsoft Initiated at Buy by Goldman, Oracle at Sell",
        "url": "https://www.reddit.com/r/stocks/comments/l2t21k/microsoft_initiated_at_buy_by_goldman_oracle_at/",
        "created": 1611366935.0
    },
    {
        "author": "Jupi_ter",
        "created_utc": 1611829021,
        "id": "l6tdf1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "The Oracle has spoken",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6tdf1/the_oracle_has_spoken/",
        "created": 1611857821.0
    },
    {
        "author": "SpittinOpinions",
        "created_utc": 1611536917,
        "id": "l4cds9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Here is a letter from the new CEO of BIGToken, which is set to become their own company after a reverse merger with $FPVD.\n\nThe time to get in $FPVD before it really blows up is running short.\n\n\nhttps://medium.com/crypto-oracle/the-5-reasons-im-joining-bigtoken-as-ceo-6f216c1f1020",
        "subreddit": "pennystocks",
        "title": "$FPVD - Note from new CEO",
        "url": "https://www.reddit.com/r/pennystocks/comments/l4cds9/fpvd_note_from_new_ceo/",
        "created": 1611565717.0
    },
    {
        "author": "Wonderful-Raisin",
        "created_utc": 1611626838,
        "id": "l53ngv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hope you all are perched under your $BBBY Tendie waterfalls like I am... $BBBY is crushing it and there is more to come. \n\nFor you idiots that can't read or write... BBBY + 1/27/21 = 🚀🚀🚀. For tards that can open  a box of Cheerios, please read on.  \n\n**First of all, want to get something straight. I am the original $BBBY Oracle. Many imposters claim to be the sultan of these crispy tendies, but I was the first to post this on the Dumb Money Discord... took me a couple days to share it would my fellow WSB tards, but let it be known... The trade came from this multiple blunt force impacted brain.** \n\n**PROOF:**\n\n&amp;#x200B;\n\n[Wonderful-Raisin=optionsbythebay](https://preview.redd.it/dx70gtdgukd61.png?width=1287&amp;format=png&amp;auto=webp&amp;s=890587da56cd7723f0bf261b0463126bb3e77036)\n\nOriginal WSB Post: [https://www.reddit.com/r/wallstreetbets/comments/kmp2lg/bed\\_bath\\_to\\_infinity\\_and\\_beyond\\_bbby\\_solid\\_dd/](https://www.reddit.com/r/wallstreetbets/comments/kmp2lg/bed_bath_to_infinity_and_beyond_bbby_solid_dd/)\n\n&amp;#x200B;\n\nEnough Gloating... had to do it or you tards may not listen and sell your precious soap and candle drizzled $BBBY shares. \n\n&amp;#x200B;\n\n**TLDR:**\n\n* **BBBY is up nearly 100% since I posted 1 month ago.. so listen the fuck up.** \n* Read my Original WSB POST. Contains thorough research that has all proven true to date. Do your own fucking research though.\n* NASDAQ Short Interest Report gets published on 1/27/2021 @ 4PM ET\n   * After last Short Interest Report on 1/12, $BBBY had 76M shares shorted.\n      * This is a shit pile of shares. Bigger than Andy Left's nightly shit pile after compulsively gorging himself with fast food as he contemplates his bankruptcy strategy...  but really, its a lot, 14.5 Days to cover.\n      * Last Nasdaq report Here: [https://www.nasdaq.com/market-activity/stocks/bbby/short-interest](https://www.nasdaq.com/market-activity/stocks/bbby/short-interest)\n      * This was the short interest only through 12/31 which was pre earnings. Earnings happened on 1/7, which many of you cowards sold your shares right after. That's why you're poor and I'm swimming in Tendies. \n* PREDICTION: The next short interest report is going to show that MORE shares are Shorted than last time... Because the short interest for next report will be through 1/15. \n   * Reasoning: Most of the real Wall Street Tards doubled down after what was thought to be a lackluster earnings... It actually was great. BBBY missed because they reported a nice tax cutting loss on the sale of Cost Plus.... Future Earnings will only be 🚀🚀🚀 from here on out. \n* PREDICTION: Since WSB Tardnation has now made the idea of buying heavily shorted stocks cooler than an NRB at the beach , this is going to drive $BBBY to the top of the short interest rankings.\n\n**Bottom Line:** \n\nBBBY at top of the short interest rankings+ Lord Tritton's Oil Tanker of Unicorn Tears+ ECommerce improvements+ cooking/home trend continuing through 2021+ WSB Tardnation+ Boomer WSB wannabees=Endless Mangroves of  Cripsy $BBBY Tendies\n\n&amp;#x200B;\n\nValhalla we ride...\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\*I am not a financial advisor, this is my opinion and my opinion only. Do your own research before making a trade. Do not take this as financial advice\\*",
        "subreddit": "wallstreetbets",
        "title": "I am the $BBBY Oracle - Why this Stock will 3X on 1/27 AH 🚀🚀🚀🚀🚀 - All Hail Lord Tritton",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l53ngv/i_am_the_bbby_oracle_why_this_stock_will_3x_on/",
        "created": 1611655638.0
    },
    {
        "author": "roostein",
        "created_utc": 1611850335,
        "id": "l70wgx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Listen to the Oracle BUY. THE. DIP. GME &gt;&gt; 🚀🚀🚀",
        "url": "https://i.redd.it/vymu64v2l3e61.jpg",
        "created": 1611879135.0
    },
    {
        "author": "Sky_vodka1979",
        "created_utc": 1612119798,
        "id": "l9j8qs",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The Oracle of Ottawa says $AMC 🚀🚀🚀🚀🌙🌙🌙 💎💎💎",
        "url": "https://i.redd.it/s86tezybupe61.jpg",
        "created": 1612148598.0
    },
    {
        "author": "Midnight-Feisty",
        "created_utc": 1610380940,
        "id": "kv5ibn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "ORCL is getting HOT",
        "url": "https://finance.yahoo.com/news/oracle-orcl-6-6-since-163004625.html",
        "created": 1610409740.0
    },
    {
        "author": "BullishCuzTendies",
        "created_utc": 1611005565,
        "id": "l04d97",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "TOP 10 HOLDINGS* WEIGHT \n1. ALPHABET INC. 8.75%\n2. ORACLE CORP 7.55%\n3. MICROSOFT CORP 7.44%\n4. AMAZON.COM INC. 7.22%\n5. SALESFORCE.COM INC 6.21%\n6. SHOPIFY INC 5.96%\n7. SAP SE 5.84%\n8. SERVICENOW INC 5.22%\n9. INTUIT COM 4.78%\n10. ZOOM VIDEO COMMUNICATIONS INC 3.94%\n\n[More product data on the ETF](https://evolveetfs.com/product/data/)",
        "subreddit": "CanadianInvestor",
        "title": "Canada's first cloud data ETF launched today: DATA (Evolve ETFs)",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/l04d97/canadas_first_cloud_data_etf_launched_today_data/",
        "created": 1611034365.0
    },
    {
        "author": "Flynnme",
        "created_utc": 1611506906,
        "id": "l42xx9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "mega $LMACU (pre target)\nThis might not be a close to NAV play but it's definitely a spac to put on your watchlist! \n\nHere are some details about $LMACU\n\n\"Undoubtedly, the reputational heft of two of the business world’s most successful operators legitimizes the SPAC asset class.\" - Julian Klymochko AKA \"The arbitrage king\" on Twitter on $LMACU\n\n$LMAC.U \n~ IPO 1/22/2021\n~ IPO opening price: $13.20\n~ $500 million trust.\n~ 1 unit = 1 share 1/4 of a warrent.\n~ Unit split: March 15 on a Monday.\n\nManagement\n~ Gregory B. Maffei — CEO.\nCEO of tripadvisor holdings, chairman of Live Nation, SiriusXM.\nFmr CFO of Microsoft  Oracle.\n\nSponsor\nLiberty Media. Founder &amp; chairman of liberty Media is \"John Malone\". Liberty media own  stakes in Formula One, SiriusXM and the Atlanta Braves among others\n\nTargeting\n~ Media, digital media, music, entertainment, communications, telecommunications and technology industries.\n~ LMAC aims to act as a long-term partner to its target companies\n\n[julian's post](https://julian-34159.medium.com/what-you-need-to-know-this-week-january-23rd-2021-41ce8a4e4200)\n\n~~ \n~ SEC link: [sec filings link](https://www.sec.gov/cgi-bin/browse-edgar?CIK=1831992&amp;owner=exclude)\n\n(I wanted to buy in on Friday when it IPO'd but it opened at $13.20)",
        "subreddit": "SPACs",
        "title": "$LMACU - Liberty Media - opened on its IPO day $13.20 -",
        "url": "https://www.reddit.com/r/SPACs/comments/l42xx9/lmacu_liberty_media_opened_on_its_ipo_day_1320/",
        "created": 1611535706.0
    },
    {
        "author": "Jupi_ter",
        "created_utc": 1611828917,
        "id": "l6tchk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "The Oracle has spoken",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6tchk/the_oracle_has_spoken/",
        "created": 1611857717.0
    },
    {
        "author": "LUCKYMAZE",
        "created_utc": 1611807367,
        "id": "l6npwy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Apple - Microsoft - Google - Oracle - Gamestop",
        "url": "https://i.redd.it/pp5c3s6310e61.jpg",
        "created": 1611836167.0
    },
    {
        "author": "kulchurvulchur",
        "created_utc": 1612129302,
        "id": "l9ms50",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Chainlink's oracle could become the future of the world's financial system.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9ms50/chainlinks_oracle_could_become_the_future_of_the/",
        "created": 1612158102.0
    },
    {
        "author": "SpittinOpinions",
        "created_utc": 1611604836,
        "id": "l4w3jn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " BIGtoken will be spun off from Nasdaq-traded $SRAX into their own company through a reverse merger with $FPVD.\n\nThe definitive agreement has been signed and any day now the merger will be complete and the $FPVD ticker will be changed to reflect the new company, likely to $BIGT.\n\nBIGToken is a successful and growing revenue pillar for $SRAX and will finally be free to grow on their own, as their own company.\n\nThis is a bit of an unusual situation and has flown way under the radar since the merger hasn't taken effect yet and the ticker hasn't changed. That'll happen any day.\n\nBIGtoken has hired a veteran digital media and blockchain expert as CEO and has assembled a great management team with big future plans for growth.\n\n$FPVD is trading around $0.01 right now, which is way undervalued, in my opinion, for what this company will be after the reverse merger, not even taking into account the huge growth projections they have for BIGtoken.\n\nDo your own due diligence on the opportunity and the new management team. I am telling you all this to get the word out and this is in no way investment advice.\n\nHere is the link to details on the reverse merger and new CEO:\n\n[https://www.investorwire.com/news-articles/srax-inc-nasdaq-srax-announces-blockchain-and-digital-media-expert-lou-kerner-as-ceo-of-bigtoken/](https://www.investorwire.com/news-articles/srax-inc-nasdaq-srax-announces-blockchain-and-digital-media-expert-lou-kerner-as-ceo-of-bigtoken/)\n\nAnd here is a link on the new CEO discussing his big plans for BIGtoken:\n\n[https://medium.com/crypto-oracle/the-5-reasons-im-joining-bigtoken-as-ceo-6f216c1f1020](https://medium.com/crypto-oracle/the-5-reasons-im-joining-bigtoken-as-ceo-6f216c1f1020)\n\n&amp;#x200B;\n\n**About BIGtoken**\n\nBIGtoken is the first consumer-managed data marketplace where people can own and earn from their data. Through a transparent platform and consumer reward system, BIGtoken provides consumers choice, transparency and compensation for their data. The system also provides advertisers and media companies access to transparent, verified consumer data to better reach and serve audiences.",
        "subreddit": "StockMarket",
        "title": "$FPVD - BIGtoken Catalyst",
        "url": "https://www.reddit.com/r/StockMarket/comments/l4w3jn/fpvd_bigtoken_catalyst/",
        "created": 1611633636.0
    },
    {
        "author": "SpittinOpinions",
        "created_utc": 1611604939,
        "id": "l4w4yy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " BIGtoken will be spun off from Nasdaq-traded $SRAX into their own company through a reverse merger with $FPVD.\n\nThe definitive agreement has been signed and any day now the merger will be complete and the $FPVD ticker will be changed to reflect the new company, likely to $BIGT.\n\nBIGToken is a successful and growing revenue pillar for $SRAX and will finally be free to grow on their own, as their own company.\n\nThis is a bit of an unusual situation and has flown way under the radar since the merger hasn't taken effect yet and the ticker hasn't changed. That'll happen any day.\n\nBIGtoken has hired a veteran digital media and blockchain expert as CEO and has assembled a great management team with big future plans for growth.\n\n$FPVD is trading around $0.01 right now, which is way undervalued, in my opinion, for what this company will be after the reverse merger, not even taking into account the huge growth projections they have for BIGtoken.\n\nDo your own due diligence on the opportunity and the new management team. I am telling you all this to get the word out and this is in no way investment advice.\n\nHere is the link to details on the reverse merger and new CEO:\n\n[https://www.investorwire.com/news-articles/srax-inc-nasdaq-srax-announces-blockchain-and-digital-media-expert-lou-kerner-as-ceo-of-bigtoken/](https://www.investorwire.com/news-articles/srax-inc-nasdaq-srax-announces-blockchain-and-digital-media-expert-lou-kerner-as-ceo-of-bigtoken/)\n\nAnd here is a link on the new CEO discussing his big plans for BIGtoken:\n\n[https://medium.com/crypto-oracle/the-5-reasons-im-joining-bigtoken-as-ceo-6f216c1f1020](https://medium.com/crypto-oracle/the-5-reasons-im-joining-bigtoken-as-ceo-6f216c1f1020)\n\n&amp;#x200B;\n\n**About BIGtoken**\n\nBIGtoken is the first consumer-managed data marketplace where people can own and earn from their data. Through a transparent platform and consumer reward system, BIGtoken provides consumers choice, transparency and compensation for their data. The system also provides advertisers and media companies access to transparent, verified consumer data to better reach and serve audiences.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "$FPVD - BIGtoken Catalyst",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/l4w4yy/fpvd_bigtoken_catalyst/",
        "created": 1611633739.0
    },
    {
        "author": "handsome_uruk",
        "created_utc": 1611586783,
        "id": "l4ph8i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Alright, y’all. By now 99% of this sub must have made sweet 🍗🍗💰💰 from TSLA, GME, PLTR … e.t.c  - all the meme stocks. Once GME hits $694.20 later today, consider realizing some of those gains and diving into $PSTH. For those of you who managed to somehow miss out on all this free money the last 11 months, now is your chance.  I’ve been watching this play and it’s looking sexy. $PSTH is the mother of all SPACs with the dream team of investors. \n\n&amp;#x200B;\n\nFor the uninitiated,  a **SPAC** is a shell company listed with the sole purpose of merging with a target private company to take it public. $PSTH is a $5bn SPAC sponsored by Bill Ackman looking to merge with a [mature unicorn](https://www.cnbc.com/2020/06/22/bill-ackmans-new-blank-check-company-will-be-a-4-billion-bet-on-a-so-called-mature-unicorn.html). It is the largest SPAC of all time. SPACs have been on 🔥 throughout the 2020s. Literally, every SPAC has been green this year. Chamath pumps out a new one every few weeks. \n\n&amp;#x200B;\n\n**Why SPACS?** \n\n&amp;#x200B;\n\nSPACs make it easy for companies to go public by avoiding many of the issues of the IPO process. They are much cheaper, faster, and more profitable for companies. See this great DD by Bill Gurley [https://abovethecrowd.com/2020/08/23/going-public-circa-2020-door-3-the-spac/](https://abovethecrowd.com/2020/08/23/going-public-circa-2020-door-3-the-spac/)\n\n&amp;#x200B;\n\n$PSTH is the largest SPAC, lead by Bill Ackman's Pershing Square Holdings PSH. Bill is set to announce his target end of this quarter (any time now). Seth Klarman is investing $400M. There already tons of DD on $PSTH so I won’t go over all the details. Our very own mattress king u/dhsmatt2  has a great DD  [here on his $2.3M Big Dick Energy Bet](https://www.reddit.com/r/wallstreetbets/comments/jeie8p/23m_bet_big_dick_energy/). As his loyal subject, I must follow suit. It would be high treason to go against our king 👑\n\n&amp;#x200B;\n\n**Bill &amp; Seth**\n\n&amp;#x200B;\n\n**Bill Ackman** is the lead sponsor. He’s one of the GOATs of investing and undoubtedly has a point to prove with this SPAC as a follow-up to his COVID trade that has been hailed as [the greatest trade of all time](https://www.marketwatch.com/story/how-the-single-best-trade-of-all-time-netted-one-investor-a-26-billion-profit-2020-04-29). He is a value investor with 💎👐  who holds positions for a few million WSB years. Interestingly, his fund PSH only holds &lt; 10 positions. He makes very few trades, but when he does, he goes in with conviction. At the moment, PSH holds positions in $HHC (24% ownership) , $LOW  (1.6%), $QSR (8.2%) $CMG  (4.1%) , $A (4%),  $HLT (4.8%),  $SBUX (.86%), $FNMA and $FMCC. As boring as some of these tickers sound, he has absolutely crushed the markets over the last 15 years.\n\n&amp;#x200B;\n\n[PSH performance vs SP500](https://preview.redd.it/y6vu7nls8fd61.png?width=624&amp;format=png&amp;auto=webp&amp;s=84fd8469a8b56800b1ddc305d4a4c1cd659bfd9f)\n\n&amp;#x200B;\n\nWith PSTH, Bill is on the hunt to add a mature unicorn to his portfolio. Target size $15-$30bn.\n\n&amp;#x200B;\n\n**Seth Klarman**, AKA “The Oracle of Boston” is a boomer value investor hailed as the next Buffet. He is the manager of  The Baupost Group. He knows his shit and is all about the fundamentals (excuse the f-bomb). He is known for contrarian plays and the uncanny ability to sniff out undervalued equities, making billions from distressed  debt,  credit swaps, derivatives, and other instruments after the 2008 crash. He bought in $400M of PSTH. According to [Baupost’s 13F](https://whalewisdom.com/filer/baupost-group-llc-ma#tabholdings_tab_link) this makes $PSTH his 6th largest public holding.  Last week he shook the investing community when he warned that investors today are like [“frogs in boiling water”](https://au.finance.yahoo.com/news/urgent-warning-for-50-market-drop-003337418.html) . He is conservative, risk-averse, and doesn’t make a ton of investments in public equities. So this move in $PSTH is big news. Like Buffett, Seth has hoards of cash 💵💵💵 sitting on the sidelines waiting for value. If $PSTH is good value for him, it must be good for me. All in.\n\n \n\nAs value investors with the biggest 💎👐 you can be guaranteed that Bill &amp; Seth will buy the dip if any, making this an even safer play. When covid hit, Bill added to his positions in a big way. Having such strong investors acts as a floor for the stock; a stamp of approval. SPAC investing is all about the team and these are some of the best guys our there to be investing alongside. This SPAC gives the once in a decade opportunity to get in on a hot stock right from the beginning. $PSTH is worth \\~$5bn. For context, there have only been 3 IPOs &gt; $5bn in the last decade! Imagine owning a piece of a giant like AMZN, MSFT, SBUX e.t.c on day one! \n\n&amp;#x200B;\n\n**PSTH is the investor friendly SPAC**\n\n&amp;#x200B;\n\nBill has taken extra steps to make sure that this SPAC is super **investor friendly**. The problem with most SPACs is the sponsor is entitled to **20%** of the common just for completing the merger regardless of if the **stock goes up or down**. The is a serious misalignment of incentives. PSTH has eliminated all forms of sketch compensation to the sponsor. Bill is investing **$1bn of his own money** on shareholders' terms. The only special treatment he gets is the added $65M worth of 10-year sponsor warrants (a warrant is a fancy word for a call issued by a company). Basically, Bill is buying shares and getting warrants (calls) just like the rest of us. He has every incentive to pump this as high as possible, and make money for shareholders.  \n\n\n$PSTH has a “**tontine**” structure to reward 💎👐 investors. Every share comes with 2/9 of a warrant , that can be exercised after the merger. Prior to merger, you can redeem a share for $20 cash. At $28 per share, your absolute risk is $8/share prior to merger.  You get warrants (calls) for holding shares post-merger. 🧻👐 investors who bail before merger will have their warrants redistributed among the remaining shareholders. This sweetens the deal for those who hold and sets $PSTH apart from other SPACs as a more shareholder friendly play. [Bill's report has everything you need to know about the tontine structure](https://pershingsquareholdings.com/wp-content/uploads/2020/08/Pershing-Square-Holdings-Ltd.-June-2020-Interim.pdf)[.](https://pershingsquareholdings.com/wp-content/uploads/2020/08/Pershing-Square-Holdings-Ltd.-June-2020-Interim.pdf)\n\n&amp;#x200B;\n\n**This is one of the more excellent stonks.** \n\n&amp;#x200B;\n\n**Positions**: 2.8k shares.  $40c 12/17\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[PSTH Yolo](https://preview.redd.it/paqe76pfbfd61.png?width=486&amp;format=png&amp;auto=webp&amp;s=41447c13dc85fcbb3a385b2c8fbe7c137ba124cb)\n\n&amp;#x200B;\n\n[PSTH Yolo](https://preview.redd.it/h9o1bcbjbfd61.png?width=623&amp;format=png&amp;auto=webp&amp;s=f13c886232ff5aa3b92cd18505939807a237ae6b)\n\n**TL;DR:**  SPACs are hot. $PSTH is the mother of all SPACs. Use some of those gains from TSLA, GME, PLTR … to get some $PSTH shares and warrants. 🚀🚀🚀🚀🚀🚀\n\n**Disclaimer**: I am not your father (I hope). This is not investment advice. Do your own DD before YOLOing your 401k.\n\n&amp;#x200B;\n\n\\- uruk",
        "subreddit": "wallstreetbets",
        "title": "Bill and Seth's Excellent Adventures: PSTH DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l4ph8i/bill_and_seths_excellent_adventures_psth_dd/",
        "created": 1611615583.0
    },
    {
        "author": "Bigney17",
        "created_utc": 1611644800,
        "id": "l58lu9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "To Melvin Capital, a quote from the Oracle himself. -30% 😂",
        "url": "https://i.redd.it/6qsswquwlmd61.jpg",
        "created": 1611673600.0
    },
    {
        "author": "Factitiously_Real",
        "created_utc": 1611677120,
        "id": "l5h0aa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The oracle has spoken",
        "url": "https://i.redd.it/94ciui7t9pd61.png",
        "created": 1611705920.0
    },
    {
        "author": "NotPresidentChump",
        "created_utc": 1612106991,
        "id": "l9ehdn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Expect more short ladder attacks on GME next week as always look to the sage guidance of the Oracle of Omaha",
        "url": "https://i.redd.it/m1413909soe61.jpg",
        "created": 1612135791.0
    }
]