[
    {
        "author": "SaveThemTurdles",
        "created_utc": 1613412033,
        "id": "lkj30k",
        "num_comments": 145,
        "num_crossposts": 0,
        "selftext": "I’d like to know which ARK fund you think is the best investment going forward. Each of them have grown over 100% within the past year, with no signs of slowing down. Here are the 5 actively managed ARK ETFs and the top 10 holdings as of Dec. 31st 2020 for reference:\n\n**ARK Genomic Revolution - ARKG**\n\n1 PACIFIC BIOSCIENCES OF CALIF\n2 TELADOC HEALTH INC\n3 CRISPR THERAPEUTICS AG\n4 TWIST BIOSCIENCE CORP\n5 CAREDX INC\n6 IOVANCE BIOTHERAPEUTICS INC\n7 EXACT SCIENCES CORP\n8 FATE THERAPEUTICS INC\n9 INVITAE CORP\n10 PERSONALIS INC\nWeight 45.3% \n\n**ARK Innovation - ARKK**\n\n1 TESLA INC\n2 ROKU INC\n3 CRISPR THERAPEUTICS AG\n4 SQUARE INC - A\n5 TELADOC HEALTH INC\n6 INVITAE CORP\n7 ZILLOW GROUP INC - C\n8 PURE STORAGE INC - CLASS A\n9 PROTO LABS INC\n10 SPOTIFY TECHNOLOGY SA\nWeight - 48.5%\n\n**ARK Next Generation Internet - ARKW**\n\n1 TESLA INC\n2 ROKU INC\n3 SQUARE INC - A\n4 GRAYSCALE BITCOIN TRUST BTC\n5 TELADOC HEALTH INC\n6 SPOTIFY TECHNOLOGY SA\n7 PURE STORAGE INC - CLASS A\n8 TENCENT HOLDINGS LTD-UNS ADR\n9 FACEBOOK INC-CLASS A\n10 SNAP INC - A\nWeight - 41.2%\n\n**ARK Autonomous Technology &amp; Robotics - ARKQ**\n\n1 TESLA INC\n2 MATERIALISE NV-ADR\n3 TRIMBLE INC\n4 DEERE &amp; CO\n5 ALPHABET INC-CL C\n6 FLIR SYSTEMS INC\n7 JD.COM INC-ADR\n8 KRATOS DEFENSE &amp; SECURITY\n9 BAIDU INC - SPON ADR\n10 IRIDIUM COMMUNICATIONS INC\nWeight - 48.6%\n\n**ARK Fintech Innovation - ARKF**\n\n1 SQUARE INC - A\n2 MERCADOLIBRE INC\n3 ZILLOW GROUP INC - C\n4 INTERCONTINENTAL EXCHANGE IN\n5 TENCENT HOLDINGS LTD-UNS ADR\n6 PINTEREST INC- CLASS A\n7 ADYEN NV\n8 PAYPAL HOLDINGS INC\n9 SEA LTD-ADR\n10 ALIBABA GROUP HOLDING-SP ADR\nWeight - 45.3%\n\nQuickly glancing over the top holdings, you’ll see there’s quite a bit of overlap between ETFs, and I don’t think it’s really necessary to hold all of them. I am looking to invest in 2 ARK funds when the market opens. I don’t expect the same rate of growth over the next few years, but would like sustained growth to some degree. Which fund do you like best and why?",
        "subreddit": "stocks",
        "title": "Best ARK fund?",
        "url": "https://www.reddit.com/r/stocks/comments/lkj30k/best_ark_fund/",
        "created": 1613440833.0
    },
    {
        "author": "Btwn3n20charachters",
        "created_utc": 1614198054,
        "id": "lrmfq3",
        "num_comments": 50,
        "num_crossposts": 2,
        "selftext": "So I stumbled upon TRMB as one typically does: analyzing Cathie Wood's holdings in ARKQ. I had never heard of the company nor seen the stock mentioned anywhere, but, given TRMB is the #4 holding in ARKQ, I decided to check them out. \n\nFirst of all, who the hell even are these people: \n\nTrimble Inc. is basically a hardware and software provider, focusing on managment and organization systems. \n\nThat may be jibberish to you, but basically the company is broken into 4 segments:\n\n1. Buildings and Infrastructure, which focuses on serving architects, contractors, owners, and operators by providing software for route selection and design; systems to guide and control construction equipment; systems to monitor, track, and manage assets, equipment, and workers; software to share and communicate data; 3D conceptual design and modeling software; building information modeling software; integrated site layout and measurement systems; cost estimating, scheduling, and project controls solutions; applications for sub-contractors and trades; and an integrated workplace management software.\n2. Geospatial, which provides surveying and geospatial products, and geographic information systems \n3. Resources and Utilities, which offers precision agriculture products and services, such as guidance and positioning systems, automated and variable-rate application and technology systems, and information management solutions. It offers manual and automated navigation guidance for tractors and other farm equipment; solutions to automate the application of pesticide and seeding; water solutions; Farmer Core, a software subscription that enables farmers to connect their farm operation; and forestry solutions for forest management and timber processing\n4. The transportation segment offers solutions for long haul trucking, field service management, rail, and construction logistics industries; and transportation management, analytics, routing, mapping, reporting, and predictive modeling solution\n\nPretty cool and important stuff, I think, so I dove into the numbers:\n\n18.4 billion dollar market cap (very comparable with industry peers ZBRA, KEYS, CGNX), PE ratio of 30.1 (compared to the industry average of 26.3), avg volume of 2.05 million, all pretty solid. \n\nOver the past 52 weeks, the stock is up 71.35%, with a 52-week range of 20.01-76.50. The 50-day MA is 70.90. \n\nOf course, I had to look into the company's financials as well. \n\nIn Q4 2020, the company had a total revenue of 829.70 million dollars (up 0.4% year over year), with an operating income of 127.80 million. The company has an operating margin of around 15%, which is above its industry average. Revenue declined from 2019 to 2020 by 200 million dollars, but that is to be expected given the overall decline of the economy last year. Net income grew dramatically from 2018 to 2019, growing from 315.8 million to 547.4 million, and then grew another 16% (87 million) in 2020. \n\nRobert Painter, the CEO, ended their most recent earnings call by saying, \"We enter 2021 with increased conviction in our ability to fulfill our mission to transform the way the world works. Furthermore, I'd also like to take the opportunity to acknowledge Trimble's inclusion in the S&amp;P 500 as of January 21, a milestone for Trimble's growth and global impact\"\n\nThe company has continuously beat consensus estimates in earnings per share, most recently beating an expected 0.51 EPS with 0.61 EPS. Q1 2021 EPS consensus is 0.54. \n\n**Finally, my bull case for the stock:**\n\n* TRMB is an industry leader in agricultural, construction, and trucking telematics.\n* Caterpillar, Hyundai, Paccarr, and more are all using TRMB as their telematics solution on many product lines.\n* TRMB executives believe telematics have only reached about 25-30% of the total addressable market. \n\n**Bear case:**\n\n* The company is known to rapidly acquire other companies, where they risk overpaying. \n\nMaybe this will help you, maybe it won't, I was just interested in the stock so decided to dig around. \n\nDisclosure: I entered a position earlier today with 10 shares @ $74.36",
        "subreddit": "stocks",
        "title": "Trimble Inc. (TRMB) DD",
        "url": "https://www.reddit.com/r/stocks/comments/lrmfq3/trimble_inc_trmb_dd/",
        "created": 1614226854.0
    },
    {
        "author": "Btwn3n20charachters",
        "created_utc": 1614198165,
        "id": "lrmh90",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Trimble Inc. (TRMB) DD",
        "url": "/r/stocks/comments/lrmfq3/trimble_inc_trmb_dd/",
        "created": 1614226965.0
    },
    {
        "author": "sronamission",
        "created_utc": 1612967348,
        "id": "lgurcv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$TRMB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lgurcv/trmb/",
        "created": 1612996148.0
    },
    {
        "author": "Sufficient_Nature368",
        "created_utc": 1612368647,
        "id": "lbqzep",
        "num_comments": 182,
        "num_crossposts": 5,
        "selftext": "This will be long....Sorry in advance. I decided I'd like to research Michael Burry since I've seen so many people talking about him on here and this is just what I've discovered about him and his methods.\n\n**Quick Facts:**\n\n* Founder of hedge fund Scion Capital 2000-2008. Closed to focus on personal investments\n* Best known for seeing the subprime mortgage crisis (2007-2010) and profiting from it\n* Investment style is built upon Benjamin Graham and David Dodd’s 1934 book Security Analysis: \"All my stock picking is 100% based on the concept of a margin of safety.\"\n\n**Strategy:**\n\n* Michael Burry's strategy as he states is not very complex. He tries to buy shares of unpopular companies when the look like roadkill, and sell them when they've been cleaned up a bit. Lets take a look at his Q2 2020 Positions, top buys, and top sells. There are a few that are not big surprises but check it out.\n\n|Stock|Shares|Market Value|% of Portfolio|\n|:-|:-|:-|:-|\n|GOOG / Alphabet Inc Class C (CALL)|80,000\t| $113,089,000 | 35.87 |\n| FB / Facebook Inc (CALL) | 93,200 | $21,163,000 | 6.71 |\n| BKNG / Booking Holdings Inc (CALL) | 11,600 | $18,471,000 | 5.86 |\n| GS / Goldman Sachs Group (CALL) | 73,600 | $14,545,000 | 4.61 |\n| GME / Gamestop Corp | 2,750,000 | $11,935,000 | 3.79 |\n| WDC / Western Digital Inc (CALL) | 270,000 | $11,921,000 | 3.78 |\n| BBBY / Bed Bath &amp; Beyond Inc | 1,000,000 | $10,600,000 | 3.36 |\n| DISCA / Discovery Inc | 500,000 | $10,550,000 | 3.35 |\n| TCOM / Trip.com Inc | 325,000 | $8,424,000 | 2.67 |\n| QRVO / Qorvo Inc | 75,000 | $8,290,000 | 2.63 |\n\n* **Top Buys**\n   * GOOG / Alphabet Inc Class C (CALL)\n   * FB / Facebook Inc (CALL)\n   * BKNG / Booking Holdings Inc (CALL)\n   * GS / Goldman Sachs Group (CALL)\n   * WDC / Western Digital Inc (CALL)\n* **Top Sells**\n   * Jack / Jack In The Box Inc\n   * FB / Facebook Inc\n   * BA / Boeing Inc\n   * MAXR / Maxar Technologies Ltd\n   * QRVO / Qorvo Inc\n\nMr. Burry's weapon of choice is his **research** and that it's critical for him to understand a company's value before laying down a dime and that 100% of his stock picking is based on the concept of margin of safety introduced in the book \"Security Analysis\" which I am reading through right now and dang is it huge lol. He also states that he has his own version of their technique, but that the net is that he wants to protect his downside to prevent permanent loss of capital. Specific, known catalyst are not necessary. Sheer, outrageous value is enough.\n\nHe cares little about the level of the general market and puts few restrictions on potential investments. They can be large-cap stocks, small cap, mid cap, micro cap, tech or non-tech and finds out-of-favor industries a particularly fertile ground for best-of-breed shares at **steep discounts**.\n\n**How does he determine the discount?**\n\n* Focuses on free cash flow and enterprise value (Market capitalization less cash plus debt)\n* Screen companies by look at enterprise value/EBITDA ratio. Accepted ratio varies with the industry and it position in the economic cycle\n* If stock passes loose screen, looks harder to determine specific price and value of a company\n   * Takes into account off-balance sheet items and true free cash flow\n   * Ignores price-earning ratios\n   * Return of equity is deceptive and dangerous\n   * Prefers minimal debt\n   * Adjust book value to a realistic number\n* Invest in rare birds - asset plays, and to a lesser extent, arbitrage opportunities and companies selling at less than two-thirds of net value\n* Will mix in with companies favored by Warren Buffet **IF** they become available at good prices. Deserving of longer holding periods.\n\n**How many Stocks does he hold?**\n\n* Likes to hold 12 to 18 stocks diversified among various depressed industries, and tends to be fully invested. Provides enough room for his best ideas and helps with volatility.\n* Feels volatility is no relation to risk.\n\n**Tax Implications**\n\n* Not concerned much about tax. Know his portfolio turnover will generally exceed 50% annually, and at 20% the long-term tax benefits of low-turnover pretty much disappear.\n\n**When he buys**\n\n* He mixes barebones technical analysis into his strategy. \n* Prefers to buy within 10% to 15% of a 52-week low that has shown itself to offer some price support. If a stock other than a rare bird breaks a new low, in most cases he cuts the loss.\n   * Balances the fact that he is turning his back on potentially greater value with the fact that since implementing this rule he hasn't had a single misfortunate blow up his entire portfolio\n\n&amp;#x200B;\n\n&gt;In the end, investing is neither a science nor an art - it is a scientific art.\n\n&amp;#x200B;\n\n**Works Cited**\n\n[https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/](https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/)\n\n[https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/](https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/)\n\n[https://en.wikipedia.org/wiki/Michael\\_Burry](https://en.wikipedia.org/wiki/Michael_Burry)",
        "subreddit": "ValueInvesting",
        "title": "Michael Burry's Investment Strategy",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/lbqzep/michael_burrys_investment_strategy/",
        "created": 1612397447.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612222116,
        "id": "lahib2",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": "# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is extremely memeable, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\nTwinkies to the moon: [https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…now they’re going to make us some Tendies™ as well.\n\nFor some historical context, the company was private-equity owned for awhile and then went public via a SPAC in 2016 (before SPAC's were as cool as they are today). The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the SPAC (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the WSB pool of capital (especially since many of us have our tendies tied up in GME right now). If you’re looking for a bit of tendie diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)***\n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little tendie diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "wallstreetbets",
        "title": "Twinkies for Tendies: Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lahib2/twinkies_for_tendies_long_thesis_on_hostess/",
        "created": 1612250916.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612217235,
        "id": "lafmq2",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n[https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)***\n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "stocks",
        "title": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/",
        "created": 1612246035.0
    },
    {
        "author": "CryoSaint",
        "created_utc": 1612244335,
        "id": "laolti",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)\n\nI posted this TWNK long thesis in r/stocks, [here](https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/), but think it has a home in r/options as well given the 15% short interest, low IV, cheap options, and potential for gamma squeeze. Appreciate any and all thoughts.\n\n# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)*** \n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "wallstreetbets",
        "title": "Great info on TWNK. I did not write this!! Just copied..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laolti/great_info_on_twnk_i_did_not_write_this_just/",
        "created": 1612273135.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612218859,
        "id": "lag9pd",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "I posted this TWNK long thesis in r/stocks, [here](https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/), but think it has a home in r/options as well given the 15% short interest, low IV, cheap options, and potential for gamma squeeze. Appreciate any and all thoughts.\n\n# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n[https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)*** \n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "options",
        "title": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/options/comments/lag9pd/long_thesis_on_hostess_brands_twnk_owner_of/",
        "created": 1612247659.0
    },
    {
        "author": "HowDoesIStonks",
        "created_utc": 1612942430,
        "id": "lgom07",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I love sustainability SPACs and have already bought into most of them. So I've been looking around for more near NAV SPACs which might target an ESG or sustainability focused company and I found these four. They all have ESG mandates and/or are considering sustainability focused companies, however many are also considering other sectors as well, like FinTech, so they aren't guaranteed to go green. All are currently trading between $10-11.\n\n# ARBG : Aequi Acquisition Corp.\n\n&gt;We expect to favor potential technologically driven target companies in the consumer industry. In addition, a target company must demonstrate a dedication to Diversity, Equity and Inclusion (“DE&amp;I”) and strong Environmental, Social and Governance (“ESG”) principles. \\[...\\]  \n&gt;  \n&gt;Our acquisition and value creation strategy is to acquire a data-centric, growth-orientated consumer company in a sector such as, retail, education, financial technology, media &amp; gaming, healthcare &amp; wellness, legal, and/or procurement &amp; eco-friendly packaging.\n\nAlso\n\n&gt;In addition, our sponsor is committing to donate 10% of the founder shares it holds to advance social and economic mobility following the consummation of the initial business combination.\n\nI think that's really cool and shows they are probably serious about ESG and not just ESGwashing.\n\nLeadership: Hope S. Taitz, CEO of ELY Capital, Co-founder of Catalyst Partners, former BOD Girls Who Code. Joy Seppala, founder of SISU Capital. Previously Head of the Special Situations Investment Group at Banque Paribas.\n\n# PIAI : Prime Impact Acquisition I\n\n&gt;We believe that advances in Artificial Intelligence (AI), machine learning, cloud computing, mobile applications, automation throughout global supply chains, clean energy solutions, autonomous vehicles and the consumer and industrial IoT will drive sustained growth and accelerate the digital transformation of the enterprise and lead to significant value creation. The development and application of these new technologies are expected to create massive opportunities within new and existing sectors, such as technology, media and telecom (TMT), medicine and healthcare (Med Tech) and traditional industries (Industrial Tech).  \\[...\\]  \n&gt;  \n&gt;It is our goal to acquire companies that can evolve to exploit the opportunities and navigate the challenges of the complex, data-centric global economy. We will target companies that are benefiting from the disruptive impact of new technologies and the continuing growth in developing markets, such as China and India.  \n&gt;  \n&gt;We intend to drive long-term growth and build a successful public company through disciplined strategic execution and a commitment to environmental sustainability, social responsibility and strong corporate governance (ESG).\n\nLeadership: Mike Cordano, former President and COO of Western Digital Corporation. Mark Long, former CFO of Western Digital Corporation. Jim McLean, founder of Silicon Valley Data Capital.\n\n# MLAC : Malacca Straits Acquisition Co Ltd\n\n&gt;Our business strategy is to identify and complete our initial business combination with a company which is currently part of a Southeast Asian business conglomerate in the media, food processing, renewable energy and healthcare industries, though we will also look for opportunities outside these sectors, which we believe can be positioned for success in Southeast Asian markets as well as other markets in Asia and beyond, which is complementary to the experience of our management team.\n\nLeadership: Kenneth Ng, founder of Ark Pacific Capital Management Limited, ED of Sprint Power Technology Limited, an EV consulting and engineering services company. Previously ED of Elliott Advisors (HK) Limited, Hong Kong arm of the hedge fund Elliott Associates. Stanley Wang, founder of K2 Venture Capital Company Limited, which invests in Southeast Asian FinTech and AI companies.\n\n# AVAN : Avanti Acquisition Corp.\n\n&gt;Consistent with our strategy, we have identified the following general criteria and guidelines which we believe are important in evaluating potential target businesses. We intend to seek to acquire companies that we believe: have a clear European focus; have an identifiable current and/or future nexus with the United States making them suitable for a NYSE listing; \\[...\\] Based in part on the above general criteria and guidelines, we do not currently expect to consider target businesses that operate primarily in the following sectors: Real Estate; Banking and Insurance, except Fintech companies; Natural Resources and Infrastructure, except renewable sources of energy companies; Biotech; and Pure Media, Publishing and Advertising, except new business model or Tech angle companies.\n\nAlso an ESG mention\n\n&gt;NNS Group and Sienna Capital share the same business principles and investment approach, which include: seeking sustainable growth of portfolio assets and ultimately long-term value creation through consistent and disciplined implementation of environmental, social and governance principles and sustainable business practices;\n\nLeadership: Nassef Sawiris, founder NNS Group, former CEO of OCI NV and Orascom Construction Industries SAE. Colin Hall, former CEO  of Sienna Capital.\n\nDisclaimer: It's not a sure thing that any of these SPACs will target a green company. I am not a financial advisor. Disclosure: I bought 10 commons 50 warrants of each.",
        "subreddit": "SPACs",
        "title": "Four near NAV SPACs considering ESG and green targets",
        "url": "https://www.reddit.com/r/SPACs/comments/lgom07/four_near_nav_spacs_considering_esg_and_green/",
        "created": 1612971230.0
    },
    {
        "author": "STVMAIN",
        "created_utc": 1612188145,
        "id": "la3pea",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "some really cheap stocks $SDC, $ENDP, $WDC ,$BB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la3pea/some_really_cheap_stocks_sdc_endp_wdc_bb/",
        "created": 1612216945.0
    },
    {
        "author": "newyorkcash",
        "created_utc": 1612453417,
        "id": "lcies7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC price target raised by Baird to $85 from $50.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lcies7/wdc_price_target_raised_by_baird_to_85_from_50/",
        "created": 1612482217.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612269629,
        "id": "laulsh",
        "num_comments": 550,
        "num_crossposts": 0,
        "selftext": "In this post we are going to go through an in-depth analysis of AMD, we are going to take a look at their fundamental value, their DCF, do a little technical analysis and set some price targets for the near future and for the long term\n\n\\~Very Long Post\\~ \\[Do NOT Read if you don't like comprehensive analysis\\]\n\nHello everyone! Let’s start by talking a little about [AMD](https://ibb.co/d0cPRrj), they are one of the biggest semiconductor companies in the world, and they operate in multiple segments like Computing, Gaming, Enterprise, Semi-Custom and many more with some of the most important products for the company being microprocessors and GPUs both for personal use like (gaming consoles &amp; PCs) while also offering products for professional use like data centers.\n\nThe company was founded more than 50 years ago and have more than 11K employees, with the company overperforming recently as they have seen a more than 80% rise in the last year.\n\nSo, guys, let’s go a little through the 4th quarter &amp; yearly [results](https://ibb.co/f0CLSF7) for AMD. The company reported a revenue of $3.24B in the 4th quarter, with a 53% growth since last year, while for the full year they earned almost $10B as they more than doubled they quarterly and full year net income, which resulted in a $1.29 earnings/share for the year.\n\nThe [company](https://ibb.co/TY6trfs) has 2 major income segments in Computing &amp; Graphics which brought in sales of over $6.4B for the year and an operating income of $1.26B and the Enterprise, Embedded and Semi-Custom segment which brought in $3.3B in revenues and almost $400M in operating income. They also provide an additional segment that doesn’t bring in any revenues but which represents costs that can’t be associated with any of the other 2 segments, but also includes stock-based compensations and acquisitions related costs.\n\nBoth of these 2 [segments](https://ibb.co/qdfVyrK) have seen huge increases in the past year with operating income doubling for the computing &amp; graphics segment and increasing by almost 50% for the EEC segment.\n\n[AMD](https://ibb.co/tYmkPwg) didn’t have such a big capital expenditure in 2020, with only $294M but this can increase depending on the demand of their products while they also [adjusted](https://ibb.co/hCtfk2k) their income with $312M in depreciation &amp; amortizations. Both of these numbers have increased by 40 to 50% in the past years and will be important in the DCF valuation.\n\nThey have also managed to increase the gross profit margin to 45%, up 2% from 2019 as their earnings before interest &amp; tax or [EBIT](https://ibb.co/xDptyzW) stood at $1.37B.\n\nThe company has seen a continued earnings per share [growth](https://ibb.co/FhLj0Y7) overall, despite the first 2 quarters of 2020 coming in lower than previous, but that was to be expected as this was impacted by the reduced [revenues](https://ibb.co/QdjCvnx) in Q1 &amp; Q2 before things started to pick up back again, as they finished with a huge increase overall in the 4th quarter.\n\nTheir product [portfolio](https://ibb.co/YkjNDbY) has become a great challenge to Intel’s market share and is continuing to evolve, as Intel is still struggling to regain momentum with their products.\n\n[AMD](https://ibb.co/XX3h4CD) announced the world’s best processors for laptop and an enterprise variant that is expected to be available in the first half of 2021.\n\nThey have also launched the fastest [AMD](https://ibb.co/fQQnFj4) gaming graphics card ever while also working with big companies like Amazon on their AWS cloud offerings &amp; Microsoft Azure which are planning to use their upcoming 3rd generation EPYC processors.\n\nAMD is also involved in supercomputers which indicates that they are continuing to innovate and develop products that will be in high demand for the foreseeable future\n\nThe one big thing that can propel AMD even more in the future is the proposed acquisition or more rather merger with Xilinx , which also beat earnings expectations the other day, with revenues of over $800M for the quarter and a Free Cash Flow of 44% of their revenues. Xilinx has a market cap of over $32B, and the combination of the 2 companies would create synergies. They are targeting an all-stock transaction which will have implications on my projections, but as time has gone, the $35B price tag is only a 10% premium for Xilinx. The one hurdle the companies have to pass is the regulatory procedures. We will have to wait and see if the deal goes through or not, as it’s expected the deal should be finished by the end of the year, with AMD shareholders retaining 74% of the new group shares and Xilinx holding the remaining 26%.\n\nAMD also offered great [guidance](https://ibb.co/n649gFm) for 2021 as they expect the strength of their product [portfolio](https://ibb.co/Xbx5TV4) to push AMD revenues up 37% over 2020 and also expect their gross margin to increase to 47%, while they expect an effective tax rate for next year of 15%, well belove the 21% US corporate tax rate.\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates and expectations. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nSo, let’s start with the Unleveraged discounted free cash flow [projections](https://ibb.co/hKFMswn) to see what the current valuation of the company is.\n\nI used their total revenues projections that we will discuss later on in the long-term projection and the net income for 2020 to which I added back the Depreciation &amp; Amortization costs they had in 2020 and got to a $1.68B EBITDA.\n\nFor the next years I used 1% increase in EBIT margin which I think they can achieve pretty easy and an increase in capex of 10%/year in order to maintain an increased production capacity while also applying a 15% decrease in their net working capital.\n\nSo, for an 8% discount rate, which is pretty much the Average SP500 return, we get a $9.7B Discounted Free Cash Flow by 2025.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for both of them we do have to subtract or add the net assets or debt, which in this case stands $5.75B in assets. I personally think a use of the average is better suited for most companies, though some of the companies trade largely on the EBITDA approach and other on the growth approach.\n\nIf we use the growth approach, we can see that AMD is pretty fairly valued right now, as this implies a loss of 2%, while on the other hand the EBITDA multiple approach gives us a valuation of over $112, meaning an almost 30% undervaluation of the company. But as I said, I think a use of the average is best, so, my current price target for AMD in 2021 is $98.82, implying a 13.5% return from the last price.\n\nAnd now let’s move on to a longer-term valuation of the company based on the growth projections I have for AMD.\n\nFor my [projections](https://ibb.co/cx8pfhr) I actually just used their full year results and implied different growth rates for each revenue stream. I think we can continue to see 50% growth rate in the EEC segment for 2021 and then implying a gradual slowing of their growth, while for the Computing &amp; Graphics segment I implied a 35% growth, way lower than the over 100% they saw in 2020, also implying a gradual slowdown of the trend by 2025.\n\nI think these growth implications are pretty reasonable giving the high demand the company has seen for their entire product line, especially as gaming revenues have continued to increase, and also taking into account the need for their products in data centers, cloud usage &amp; digital currency mining.\n\nFor their cost of [sales](https://ibb.co/cx8pfhr), I started from the current ones which stand at 80% for the Computing &amp; Graphics segment and implied a 1% improvement each year, while for the EEC segment I started from the 88% expense margin right now and implied a gradual 2% improvement. I also maintained their other expense regarding to the cost of sales to 3% of their total revenues, in-line with the previous years.\n\nThis means for [2025](https://ibb.co/swQfJgf) we would get just over $33B in revenues and $26B in expenses, resulting in a gross profit of almost $7B. I also maintained the same capex as in the DCF and also [substracted](https://ibb.co/SshLk4K) the interest &amp; other expenses for which I implied a 5% annual growth, thus leading us to a $6.28B in earnings before tax.\n\nI [maintained](https://ibb.co/SshLk4K) their 15% effective tax rate projections and also diluted their shares by 1% each year accounting for some dilution in the stock.\n\nSo, for the $5.3B in 2025 revenues after tax and accounting for 1.27B shares, that would mean a $4.21 earnings/share, meaning the [stock](https://ibb.co/HYzfCkz) is trading at 20 times forward price to earnings for 2025.\n\nI like to base my future projections on Forward/PE valuations so, with the current projected PE and depending on what PE you assume for the stock between 25 and 40, the stock can trade between $105 and almost $168.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/SyN8bn9) are my actual price targets\n\nI think the 2025 bear case price we can see AMD trade at is $115 which would imply a return of almost 33% , while my base case and my pretty safe assumption is that AMD will trade at 137$/share by the end of 2025, implying a 57% return on the current price. But my most bullish case would see the company trading at $158, which would imply a return of over 81%. So yeah guys, these are my Overall price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 35 PE’s with the most bullish case valuing the company between a PE of 35-40.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1rkJLAXxwqbo6WEfR9NfPEKZagiW4EVbRsz58ejqTVEI) is the full spreadsheet that I have projected for AMD by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nI think these are pretty reasonable [targets](https://ibb.co/9NTJYmP), as the semiconductors industry will keep on booming in the next decade, as the world will need more &amp; more chips that also keep advancing in technology.\n\nThe company also has very good financials, with almost $9B in assets vs just $3.1B in total liabilities, which can be easily paid by just the current assets.\n\nAnd let’s also take a look at what the estimates are from the [analysts](https://ibb.co/G0QpnrW). We can only see EPS estimates until 2023 of $3.22, which I think is safe to say can grow an additional dollar by 2025, so my projections are pretty in-line with what other experts anticipate.\n\nSo, what do I expect in the next couple of days, weeks and months for AMD?\n\nLet’s look at this [CHART](https://ibb.co/wQw6CQP), the stock just broke below the long-term uptrend but has seen good support at the $86-87 levels, which is where the next support should stand. We saw AMD pushing towards $100 in the beginning of the year, but it hit major resistance once Intel also announced a change in their leadership, as they brought in the WMWare CEO Gelsinger, but it’s very hard to see him turn around Intel in a very short time. Intel will need some years &amp; a lot of capital expenditure to turn things around, if they do manage to do it at all.\n\nAMD hasn’t been overbought since August, and currently has an RSI near 41, which is pretty oversold for a good company, so I expect to see them regaining some momentum in the near-term, but I guess the market is very busy with the current short-squeezes. AMD will se a lot of resistance breaking through the $100 level, not because of something fundamental with the company, but I guess it’s a psychological resistance rather.\n\nAnd let’s take a quick look at what 24 [analysts](https://ibb.co/bKRQwXP) on Wall Street are saying. They mostly have a buy call on the company with an average price target of $100 and a high price target of $135. So, I think the analyst are pretty spot on with AMD, but my PT are slightly lower as it’s always better to undershoot and overperform rather than the other way around.\n\nSo, what would I do? Well, I own AMD stock and I believe it still has plenty of room to grow, so I would start building a position right now and add on any weakness, and I would especially buy more if the stock drops even lower than 80$.\n\nOne last thing to mention about AMD is that they also have a very big % of their shares held by institutions, with over 74% of the float being held by big funds like Vanguard &amp; Blackrock which does significantly reduce the sell-off possibilities.\n\nSo, this are my projections and my expectations for the company, I think Lisa SU has done a terrific job since becoming the CEO, and has driven AMD to a renewed approach to their business, as the company has been booming in the past 5 years, growing more than twice as much as Nvidia and crushing the SP500 and Intel’s performance.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time!",
        "subreddit": "stocks",
        "title": "AMD Complete Stock Analysis &amp; Price Target Prediction",
        "url": "https://www.reddit.com/r/stocks/comments/laulsh/amd_complete_stock_analysis_price_target/",
        "created": 1612298429.0
    },
    {
        "author": "sillyhands1",
        "created_utc": 1612190993,
        "id": "la4pt3",
        "num_comments": 232,
        "num_crossposts": 0,
        "selftext": "Haven't seen a post about something other than GME since this sub was flooded by millions of people, so I figured I would mention something new. AMD, yeah remember the company everyone seemingly forgot about despite posting huge growth consistently in 2020? Well they recently had earnings and suffered bigly along with most tech. Some highlights from their earnings:\n\n* Record revenue for the year with $9.76 billion in revenue\n* Q4 Revenue up 53% to $3.244 billion (also record quaterly revenue)\n* Gross profit up 53% to $1.451 billion\n* Net income up to $1.78 billion compared to $170 million a year ago\n* EPS up 867% (yes that is right) to $1.45 per share\n* Cash flow up to $554 million YoY\n* Q1 2021 guidance: 3.2B in revenue (79% YoY) and 46% gross margin\n* FY'2021 guidance: 37% increase in revenue YoY\n* Lets not forget their recent acquisition of Xilinx that will put them in a great position for the future\n\nSu bae has been delivering hard on her promises, and I see no reason for this momentum to not carry forward into 2021. They have gone on sale after earnings, and I can't wait to see what AMD has in store for 2021.",
        "subreddit": "wallstreetbets",
        "title": "Incredible AMD financial report that seemingly flew under the radar during all these GME posts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4pt3/incredible_amd_financial_report_that_seemingly/",
        "created": 1612219793.0
    },
    {
        "author": "shortymcsteve",
        "created_utc": 1612199987,
        "id": "la8gys",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "On Friday Robinhood went after WSB’s first love Suebae. \nUsers were limited to buy only ONE share of AMD after they announced a record quarter. Why??? \n\n&amp;nbsp;\n\nLet’s see - AMD is heavily invested in by big funds. AMD announces a record quarter, the stock begins to sell off!? Many people on r/amd_stock theorise this is institutional money trying to liquidate cash and take profits after getting hit by GME. \n\nBut wait, AMD short interest just rose from [52m to 107m.](http://www.reddit.com/r/AMD_Stock/comments/l7uw06/short_interest_on_amd_has_doubled_from_52_million/ ) Up over 50% in 2 and a half weeks after the company grows 50% and produces record results..\n\n\n\nThen Robinhood adds AMD to the list of stocks you can only buy a limited amount of and limit it to ONE share. Wtf? \n\n\nAMD isn’t part of any of the massive shorting going on in the market and is a pretty stable company. So why would they do this? Oh right, because AMD is one of the most held stocks on RH and many young investors like the company on a consumer level. So while it’s at a discount they want to stop you buying in so their buddies with the short positions can load up and get their money back after getting wrecked by GME, AMC and other heavily shorted stocks. \n\n&amp;nbsp;\n\n**Here’s what’s happening:**\n\nFunds with large positions in AMD are shorting the stock before selling off stock they previously held. This drops the price and they collect a nice bonus on the way out. \nThe short interest in the stock has increase drastically by over 50%, and of course between earnings and RH limiting trading we saw a number of hit piece articles with false information about AMD. But weirdly enough no one report on the leaks that [AMD are now powering Tesla’s in car game console/entertainment system.](http://www.reddit.com/r/AMD_Stock/comments/l749ia/patrick_schur_picture_confirms_tesla_uses_navi_23/) Last time there was even a rumour of AMD supplying Tesla the stock went vertical. \n \n\nI’m sure the OGs here remember the blatant manipulation that happened with this stock back in the days when it was $2-$20. People like Goldman would downgrade the stock, load up on stock and wait for it to rally, sell, and then downgrade again.\nThese guys are back using AMD as their personal money printer because they just got wrecked.\n\n&amp;nbsp;\n\n**Oh, and you know who happens to own 2.1m shares in AMD? That’s right, [MELVIN CAPITAL.](https://fintel.io/so/us/amd)**\n\n&amp;nbsp;\n\nBut here’s one thing RH didn’t think about. \nXilinx is about to be acquired by AMD in an all stock deal, this means both stocks move in unison with each other. And more importantly, the daily average trade volume of Xilinx is only 3m compared to AMDs 45.15m\n\nThis means if a number of people decide they like Xilinx stock, AMD will follow far faster than if they decided to simply like AMD stock. And since there’s no limits on Xilinx people can currently like the stock as much as they want.\n\nSide note - If you *really* like Xilinx and hold until the deal is complete, you will be given 1.734 shares in AMD for every Xilinx share you own. If this deal happened right now at current prices, this means you would make around 10% on your investment compared to just holding the same amount in AMD.\n\n&amp;nbsp;\n\n**Please note:** I am not a financial advisor, just some long term WSB member here to explain that if everyone jumped into Xilinx instead of AMD the shorts would get pretty screwed. They think they found a way to make their money back, it would be pretty nice if they didn’t. \n\n&amp;nbsp;\n\n**HOLD GME**\n\n**LIKE XILINX (if you want I’m not a financial advisor)**\n\n**DESTROY THE SHORTS**\n\n**FUCK ROBINHOOD**\n\n&amp;nbsp;\n\nAlso, shoutout to [Hothardware for being the only news website talking about this](https://hothardware.com/news/amd-robinhood-gamestop-gme-shorts-wallstreetbets\n). \nSomething is very wrong here and we need everyone to know it.\n\n&amp;nbsp;\n\nTL;DR; - GO READ IT, STOP BEING LAZY. THIS IS IMPORTANT AND EVERYONE NEEDS TO KNOW. *YOU HAVE TO UNDERSTAND.*\n\n🖐💎🖐 🚀🚀🚀🚀🚀🚀🚀🚀🚀🖐💎🖐",
        "subreddit": "smallstreetbets",
        "title": "😡THE SHORTS ARE HIDING IN AMD😡",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/la8gys/the_shorts_are_hiding_in_amd/",
        "created": 1612228787.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612223525,
        "id": "lai0iw",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "smallstreetbets",
        "title": "AMD/Xilinx Merger...",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lai0iw/amdxilinx_merger/",
        "created": 1612252325.0
    },
    {
        "author": "shortymcsteve",
        "created_utc": 1612200072,
        "id": "la8i9v",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "On Friday Robinhood went after WSB’s first love Suebae. \nUsers were limited to buy only ONE share of AMD after they announced a record quarter. Why??? \n\n&amp;nbsp;\n\nLet’s see - AMD is heavily invested in by big funds. AMD announces a record quarter, the stock begins to sell off!? Many people on r/amd_stock theorise this is institutional money trying to liquidate cash and take profits after getting hit by GME. \n\nBut wait, AMD short interest just rose from [52m to 107m.](http://www.reddit.com/r/AMD_Stock/comments/l7uw06/short_interest_on_amd_has_doubled_from_52_million/ ) Up over 50% in 2 and a half weeks after the company grows 50% and produces record results..\n\n\n\nThen Robinhood adds AMD to the list of stocks you can only buy a limited amount of and limit it to ONE share. Wtf? \n\n\nAMD isn’t part of any of the massive shorting going on in the market and is a pretty stable company. So why would they do this? Oh right, because AMD is one of the most held stocks on RH and many young investors like the company on a consumer level. So while it’s at a discount they want to stop you buying in so their buddies with the short positions can load up and get their money back after getting wrecked by GME, AMC and other heavily shorted stocks. \n\n&amp;nbsp;\n\n**Here’s what’s happening:**\n\nFunds with large positions in AMD are shorting the stock before selling off stock they previously held. This drops the price and they collect a nice bonus on the way out. \nThe short interest in the stock has increase drastically by over 50%, and of course between earnings and RH limiting trading we saw a number of hit piece articles with false information about AMD. But weirdly enough no one report on the leaks that [AMD are now powering Tesla’s in car game console/entertainment system.](http://www.reddit.com/r/AMD_Stock/comments/l749ia/patrick_schur_picture_confirms_tesla_uses_navi_23/) Last time there was even a rumour of AMD supplying Tesla the stock went vertical. \n \n\nI’m sure the OGs here remember the blatant manipulation that happened with this stock back in the days when it was $2-$20. People like Goldman would downgrade the stock, load up on stock and wait for it to rally, sell, and then downgrade again.\nThese guys are back using AMD as their personal money printer because they just got wrecked.\n\n&amp;nbsp;\n\n**Oh, and you know who happens to own 2.1m shares in AMD? That’s right, [MELVIN CAPITAL.](https://fintel.io/so/us/amd)**\n\n&amp;nbsp;\n\nBut here’s one thing RH didn’t think about. \nXilinx is about to be acquired by AMD in an all stock deal, this means both stocks move in unison with each other. And more importantly, the daily average trade volume of Xilinx is only 3m compared to AMDs 45.15m\n\nThis means if a number of people decide they like Xilinx stock, AMD will follow far faster than if they decided to simply like AMD stock. And since there’s no limits on Xilinx people can currently like the stock as much as they want.\n\nSide note - If you *really* like Xilinx and hold until the deal is complete, you will be given 1.734 shares in AMD for every Xilinx share you own. If this deal happened right now at current prices, this means you would make around 10% on your investment compared to just holding the same amount in AMD.\n\n&amp;nbsp;\n\n**Please note:** I am not a financial advisor, just some long term WSB member here to explain that if everyone jumped into Xilinx instead of AMD the shorts would get pretty screwed. They think they found a way to make their money back, it would be pretty nice if they didn’t. \n\n&amp;nbsp;\n\n**HOLD GME**\n\n**LIKE XILINX (if you want I’m not a financial advisor)**\n\n**DESTROY THE SHORTS**\n\n**FUCK ROBINHOOD**\n\n&amp;nbsp;\n\nAlso, shoutout to [Hothardware for being the only news website talking about this](https://hothardware.com/news/amd-robinhood-gamestop-gme-shorts-wallstreetbets\n). \nSomething is very wrong here and we need everyone to know it.\n\n&amp;nbsp;\n\nTL;DR; - GO READ IT, STOP BEING LAZY. THIS IS IMPORTANT AND EVERYONE NEEDS TO KNOW. *YOU HAVE TO UNDERSTAND.*\n\n🖐💎🖐 🚀🚀🚀🚀🚀🚀🚀🚀🚀🖐💎🖐",
        "subreddit": "Wallstreetbetsnew",
        "title": "😡THE SHORTS ARE HIDING IN AMD😡",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/la8i9v/the_shorts_are_hiding_in_amd/",
        "created": 1612228872.0
    },
    {
        "author": "athleech",
        "created_utc": 1612261861,
        "id": "laspz7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hello (I am fairly new to investing btw),\nI want to ask what the Xilinx takeover by AMD will look like for me as a Xilinx shareholder. \nAs most people probably know AMD and Xilinx have an all stock transaction deal where current Xilinx shareholders will receive 1.7** shares of AMD in return for their Xilinx shares. \nNow I can’t seem to find any news on this except for the fact that the deal is supposed to be closed in 2021. I am just wondering what it will look like for me; will my Xilinx shares automatically be switched by AMD shares or do I have to do something for it? And when do you expect it to be finalized?\nThanks in advance for the answers",
        "subreddit": "stocks",
        "title": "What will the AMD / Xilinx takeover look like?",
        "url": "https://www.reddit.com/r/stocks/comments/laspz7/what_will_the_amd_xilinx_takeover_look_like/",
        "created": 1612290661.0
    }
]