[
    {
        "author": "utradea",
        "created_utc": 1620735636,
        "id": "n9vqk2",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n**Introduction**\n\nOf the many forces of society, the advancement of technology is one that is truly unstoppable. From how we obtain information to how people communicate from a distance, technology has changed the way people live their lives. The service providers of our everyday lives are consistently looking for ways to automate &amp; improve their offerings/operations. This created a market and demand for Amdocs Limited (Nasdaq: DOX), a technology and software product/service (such as consulting) provider that serves companies in communications, media, finance, entertainment, digital, etc.\n\n**Company Overview**\n\nEstablished in 1982 In Israel, Amdocs Limited is a multinational software company headquartered in Missouri, US. For 40 years, Amdocs has been offering advanced software products and related technology services to optimize their clients’ operations. With 26,000 employees, Amdocs is currently in business with 350 service providers in more than 80 countries. Their clientele comprised of leaders in a wide range of industries: telecom giants AT&amp;T &amp; Bell, financial institutions like HSBC, and general crowd favorites such as Amazon, 7Eleven, and Microsoft.\n\nMost of Amdocs’ offerings are provided within “amdocsONE”, a comprehensive collection of products/services consisting of: Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation. With its “cloud-native, modular and open offerings”, Amdocs helps clients smoothly and fully transition into tech-automated, digital operations.\n\nIn such a demanded market with high-ticket clients, Amdocs recorded $4.16B in revenue during FY2020 (ended September 30th, 2020), at a 33.9% Gross Margin, 19% EBITDA Margin, and 11.9% Net Profit Margin. DOX also has consistently growing Operating Cash Flow, recording $910.7M in the Last-Twelve-Months ending in December of 2020.\n\nYes, everything seems to be working out well for DOX, but that brings up the question: is there still room to grow, or has DOX plateaued, making it a safe bet, but not a high-return investment?\n\n**Capital Structure &amp; Shareholders Breakdown**\n\nA quick look at Amdocs’ capital structure: **22% Debt, 77.1% Common Equity, 0.9% Minority Interest.** What is important to point out here is that DOX has **recorded $0 in debt** for 3 straight years from FY2017-19. This is a very uncommon occurrence for a company to be 0% leveraged. In contrast, most of its competitors are operating around the 15%-25% debt/total capital ratio, comparable companies like Akamai Technologies recording \\~40% leverage in its capital structure. \n\nWhen it comes the shareholders of DOX, most of its outstanding shares are owned by institutional holders. Traditional portfolio managers such as asset manager firms are the biggest investors, with FMR LLC. as the largest holder. The large scale and consistent (holds &amp; buys) asset management investment shows street professionals see DOX as a profitable, stable investment.\n\n**Looking Long**\n\nOverall, I believe DOX shows potential at a hold/buy for long positions if you are looking to invest in an undervalued, but experienced &amp; matured company.  The following are three main theses behind a long investment in DOX:\n\n* **Strong &amp; Consistent Financial Performance:**\n\nAs an established company, we are seeing highly predictable topline growth rate with consistent profit margins. Although these no longer large-scale increases we would see on a growing tech company, DOX’s consistency and strong performance is definitely a supporting factor when it comes to investment. In more detail, DOX has a 2.9% top-line 5-year CAGR as of December 31st, 2020, with corresponding 3%, 3.6%, and 10.4% 5-year CAGR with EBITDA, EBIT, and Net Income, respectively. Although top-line growth was contracting a few years prior, it has rebounded between 2015-20, which could be contributed to the increasing number of companies transitioning into digital operations/cloud systems. Nevertheless, the higher (and increasing) bottom-line CAGRs means the company is still consistently increasing its profit margins (it is important to point out in that 5Y Net Income CAGR as of Dec.31st 2020 is significantly higher than previous years, which were around 2.2%-5.3%). DOX also has a strong cash flow, largely due to steady increases in operating cash flow. The OP cash flow is the best indicator here as unlevered free cash flow has seen some small-scale turbulence in recent years due to M&amp;As such as the acquisition of Openet Telecom, Juganu Ltd., and Veego during CY2020. Overall, DOX is a strong investment from the financial perspective due to its margin growth and consistency.\n\n* **Deep Product Portfolio with Wide Coverage**\n\nThrough “amdocsONE”, Amdocs is able to provide a full-suite of comprehensive products/services that covers every stage of digital transformation. From cutting 80% of time-to-market when utilizing Amdocs bundle offers, to continuous operational support and open tools/cloud platforms, clients receive a thorough service when working with Amdocs. Within the six main categories of offerings mention above (Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation), there are numerous individual products that allows users to customize their usage of the Amdocs’ platform and offerings. For example, CES20 is Amdocs’ cloud-based customer experience suite. Within CES20, there are 4 products that helps automate and digitize the users’ operations: DigitalONE, CatalogONE, RevenueONE, and Service &amp; Network Automation. DigitalONE is a cloud-based system that allows users to work on their branding and customer experience. CatalogONE is an open-cloud platform catalog solution that allows users to launch new products easily with a detailed user interface. RevenueONE is a platform that allows users to scale or acquire new revenue stream while limiting the cost of acquisition. Last, Service &amp; network Automation is a branch covered by amdocsNEO. AmdocsNEO is a service &amp; network automation platform that offers a wide range of tracking and management capabilities. It is used to drive and control the fast automation process of the company. The CES20 is just an example of how Amdocs products are often interconnected and deeply comprehensive. They also offer certain platforms or products/services that are industry specific.\n\nThe wide coverage of the Amdocs offerings means they can gain market penetration across numerous industries. At the same time, the stage-specific offerings allow Amdocs to stay in demand and relevant as clients transition and grow. This plays a huge part into client retainment.\n\nLast, the continuous innovation initiatives at Amdocs supports an investment as it shows the company is consistently trying to grow and improve itself. As a tech company, it is extremely dangerous to slack-off on innovation, which is often seen with tech firms that reaches a consistent profit margin. Being in the tech industry means you live and die by the creativity and uniqueness of the offerings. Amdocs is consistently investing \\~20% of their gross profit into R&amp;D. This shows the company’s dedication to innovation, which ensures that it will remain in demand in the future.\n\n* **Extremely Low Leverage**\n\nThe last thesis is quite a short and simple one: the low leverage of the company means reduced risks and limits debt-related expenses such as interest/principal payments, which in turn increases their profitability. As mentioned above, there has be several years where the company literally at $0 in debt. During FY2020, the company took on \\~$1B worth of debt, which could mean they are preparing for large scale development as from a financial standpoint, they are not in a situation where taking the extra cash is worth the liability. With that being said, the new debt is only 22% of the company’s overall capital structure, and they will have no problem paying off the related fees as they have a strong track-record of positive cash flow.\n\n**Macro Market Trends**\n\nThe overall demand for digital/automation transformation/operations creates numerous trends that can positively impact the future of DOX. With the COVID-19 pandemic, company were pushed by the circumstances to digitize their operations, which will expand the market as well as create higher demand for the future. Here are some top trends that will impact DOX’s performance:\n\n* **Overall Growth of the SaaS Market:**  \n\n   * has been consistent growth in the past decade in the SaaS market. This is driven by multiple factors including the automation of internal control, enterprise centre processing system, as well as the boom of 5G and cloud-based services. Looking into the future, for the period of 2019-23, the worldwide SaaS market is expected to reach a $60.36B valuation, recording a 9% CAGR over that period.\n\nhttps://preview.redd.it/re0rwefjhhy61.png?width=581&amp;format=png&amp;auto=webp&amp;s=3e03058110bfbf707b168afd09bdda586914a7db\n\n* **Lasting Impacts of COVID-19:**  \n\n   * The pandemic has already significantly accelerated the digitization rate due to the lockdowns and remote working environments. This is not a one-time catalyst, but rather a preview of what was going to happen in the future regardless; the pandemic situation has simply brought the future quicker. Going cloud or digitizing is not a temporary decision, this means the market has permanently expanded, and will continue to grow as demand increases.\n\nhttps://preview.redd.it/78jymbukhhy61.png?width=601&amp;format=png&amp;auto=webp&amp;s=d0362d3fb6c918222d0ffb49fff1132dadea2686\n\n* **5G Penetration &amp; Advancements**  \n\n   * Continuous developments in 5G technology will impact the SaaS industry in two ways:\n\n1. It will increase the accessibility of cloud-platforms and related services, thus increasing demand.\n2. It will improve the quality and range of capabilities for the products/services of software companies.\n\nhttps://preview.redd.it/zcswsxwlhhy61.png?width=580&amp;format=png&amp;auto=webp&amp;s=f3c6560ebdcf519a5bbed1bdc42acc3c298571bc\n\nIn the modern society, it seems like life is limited if you have bad Wi-Fi connection. That is emphasized in the world of SaaS. Broader bandwidth and connection qualities will incentivize potential customers to digitalise and help service providers create higher quality products.\n\n**Financials and Valuations**\n\nWhen it comes to the fair valuation of Amdocs Limited (DOX), I used both comparable companies and intrinsic valuations, then weighted the price outcomes for the final target price. Instead, I evaluated the company using a basic comparable analysis. The companies included in the comparable universe are Akamai Technologies Inc. (AKAM), Ciena Corporation (CIEN), Citrix Systems (CTXS), Cognizant Technology Solutions Corp. (CTSH), and Perspecta Inc. (PRSP). The DCF valuation is relative crude with simple margin and top-line forecasts, but the results seem very reasonable and in-line with street estimates.\n\n**Risks**\n\nTo finish off this analysis on DOX, there are a few key risks to keep in mind:\n\n* **Cyber Security**\n\nAlthough moving operations towards cloud or digital platforms will increase efficiency and limit costs, it does come with security risks. By nature of public, integrated, and/or connected cloud platforms or enterprise central systems, a large quantity of information can be easily accessed in one spot. Although that makes operations easier, it also increases the impact of hacks or other cyber security concerns. In these interconnected platforms, large amounts of information are at risks once the “first door” is opened. Hackers no longer need to crack multiple systems to acquire different information such as customer information and financials. If Amdocs gets hacked, it will likely be very detrimental to the company as large quantity of information will be exposed.\n\n* **Limited Innovation or Growth due to Lack of 5G or Internet Penetration**\n\nFor Amdocs and the entire SaaS industry, poor internet infrastructure will limit growth potential and market penetration. If 5G usage and general internet coverage does not match the rate of innovation of Amdocs, revenue growth will stall, which might impact the pricing of the stock. It will also limit the room for innovation and enhancement, which allows more time for competitors to grow within the current infrastructure and increase the competition.\n\n**In the End: Buy, Hold, or Sell?**\n\nOverall, I think Amdocs Limited (DOX) is currently undervalued. In general, the street has a buy or hold/buy valuation on the current price, which I do agree with. Therefore, my final thoughts on DOX are:\n\n* **Buy** for long-term value investment. The stock might be somewhat volatile in the short-term, but its long-term value will be consistent.\n* **Hold/Sell** if an investment return is already realized. The economy and overall market is kind of inflated as we recover from the pandemic, therefore a potential cash-out is definitely tangible as rumours of stock market crash spreads.\n\n**TLDR**\n\nAn undervalued technology solution and service provider in a growing market with $0 debt and an upside of at least 25%\n\nOriginal analysis can be found [here](https://info.utradea.com/idea/60997b509f45b0081495db90)",
        "subreddit": "wallstreetbets",
        "title": "$DOX - A Leader in Media &amp; Communication Digitization (Long DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9vqk2/dox_a_leader_in_media_communication_digitization/",
        "created": 1620764436.0
    },
    {
        "author": "utradea",
        "created_utc": 1620735704,
        "id": "n9vrc2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nOf the many forces of society, the advancement of technology is one that is truly unstoppable. From how we obtain information to how people communicate from a distance, technology has changed the way people live their lives. The service providers of our everyday lives are consistently looking for ways to automate &amp; improve their offerings/operations. This created a market and demand for Amdocs Limited (Nasdaq: DOX), a technology and software product/service (such as consulting) provider that serves companies in communications, media, finance, entertainment, digital, etc.\n\n**Company Overview**\n\nEstablished in 1982 In Israel, Amdocs Limited is a multinational software company headquartered in Missouri, US. For 40 years, Amdocs has been offering advanced software products and related technology services to optimize their clients’ operations. With 26,000 employees, Amdocs is currently in business with 350 service providers in more than 80 countries. Their clientele comprised of leaders in a wide range of industries: telecom giants AT&amp;T &amp; Bell, financial institutions like HSBC, and general crowd favorites such as Amazon, 7Eleven, and Microsoft.\n\nMost of Amdocs’ offerings are provided within “amdocsONE”, a comprehensive collection of products/services consisting of: Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation. With its “cloud-native, modular and open offerings”, Amdocs helps clients smoothly and fully transition into tech-automated, digital operations.\n\nIn such a demanded market with high-ticket clients, Amdocs recorded $4.16B in revenue during FY2020 (ended September 30th, 2020), at a 33.9% Gross Margin, 19% EBITDA Margin, and 11.9% Net Profit Margin. DOX also has consistently growing Operating Cash Flow, recording $910.7M in the Last-Twelve-Months ending in December of 2020.\n\nYes, everything seems to be working out well for DOX, but that brings up the question: is there still room to grow, or has DOX plateaued, making it a safe bet, but not a high-return investment?\n\n**Capital Structure &amp; Shareholders Breakdown**\n\nA quick look at Amdocs’ capital structure: **22% Debt, 77.1% Common Equity, 0.9% Minority Interest.** What is important to point out here is that DOX has **recorded $0 in debt** for 3 straight years from FY2017-19. This is a very uncommon occurrence for a company to be 0% leveraged. In contrast, most of its competitors are operating around the 15%-25% debt/total capital ratio, comparable companies like Akamai Technologies recording \\~40% leverage in its capital structure. \n\nWhen it comes the shareholders of DOX, most of its outstanding shares are owned by institutional holders. Traditional portfolio managers such as asset manager firms are the biggest investors, with FMR LLC. as the largest holder. The large scale and consistent (holds &amp; buys) asset management investment shows street professionals see DOX as a profitable, stable investment.\n\n**Looking Long**\n\nOverall, I believe DOX shows potential at a hold/buy for long positions if you are looking to invest in an undervalued, but experienced &amp; matured company.  The following are three main theses behind a long investment in DOX:\n\n* **Strong &amp; Consistent Financial Performance:**\n\nAs an established company, we are seeing highly predictable topline growth rate with consistent profit margins. Although these no longer large-scale increases we would see on a growing tech company, DOX’s consistency and strong performance is definitely a supporting factor when it comes to investment. In more detail, DOX has a 2.9% top-line 5-year CAGR as of December 31st, 2020, with corresponding 3%, 3.6%, and 10.4% 5-year CAGR with EBITDA, EBIT, and Net Income, respectively. Although top-line growth was contracting a few years prior, it has rebounded between 2015-20, which could be contributed to the increasing number of companies transitioning into digital operations/cloud systems. Nevertheless, the higher (and increasing) bottom-line CAGRs means the company is still consistently increasing its profit margins (it is important to point out in that 5Y Net Income CAGR as of Dec.31st 2020 is significantly higher than previous years, which were around 2.2%-5.3%). DOX also has a strong cash flow, largely due to steady increases in operating cash flow. The OP cash flow is the best indicator here as unlevered free cash flow has seen some small-scale turbulence in recent years due to M&amp;As such as the acquisition of Openet Telecom, Juganu Ltd., and Veego during CY2020. Overall, DOX is a strong investment from the financial perspective due to its margin growth and consistency.\n\n* **Deep Product Portfolio with Wide Coverage**\n\nThrough “amdocsONE”, Amdocs is able to provide a full-suite of comprehensive products/services that covers every stage of digital transformation. From cutting 80% of time-to-market when utilizing Amdocs bundle offers, to continuous operational support and open tools/cloud platforms, clients receive a thorough service when working with Amdocs. Within the six main categories of offerings mention above (Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation), there are numerous individual products that allows users to customize their usage of the Amdocs’ platform and offerings. For example, CES20 is Amdocs’ cloud-based customer experience suite. Within CES20, there are 4 products that helps automate and digitize the users’ operations: DigitalONE, CatalogONE, RevenueONE, and Service &amp; Network Automation. DigitalONE is a cloud-based system that allows users to work on their branding and customer experience. CatalogONE is an open-cloud platform catalog solution that allows users to launch new products easily with a detailed user interface. RevenueONE is a platform that allows users to scale or acquire new revenue stream while limiting the cost of acquisition. Last, Service &amp; network Automation is a branch covered by amdocsNEO. AmdocsNEO is a service &amp; network automation platform that offers a wide range of tracking and management capabilities. It is used to drive and control the fast automation process of the company. The CES20 is just an example of how Amdocs products are often interconnected and deeply comprehensive. They also offer certain platforms or products/services that are industry specific.\n\nThe wide coverage of the Amdocs offerings means they can gain market penetration across numerous industries. At the same time, the stage-specific offerings allow Amdocs to stay in demand and relevant as clients transition and grow. This plays a huge part into client retainment.\n\nLast, the continuous innovation initiatives at Amdocs supports an investment as it shows the company is consistently trying to grow and improve itself. As a tech company, it is extremely dangerous to slack-off on innovation, which is often seen with tech firms that reaches a consistent profit margin. Being in the tech industry means you live and die by the creativity and uniqueness of the offerings. Amdocs is consistently investing \\~20% of their gross profit into R&amp;D. This shows the company’s dedication to innovation, which ensures that it will remain in demand in the future.\n\n* **Extremely Low Leverage**\n\nThe last thesis is quite a short and simple one: the low leverage of the company means reduced risks and limits debt-related expenses such as interest/principal payments, which in turn increases their profitability. As mentioned above, there has be several years where the company literally at $0 in debt. During FY2020, the company took on \\~$1B worth of debt, which could mean they are preparing for large scale development as from a financial standpoint, they are not in a situation where taking the extra cash is worth the liability. With that being said, the new debt is only 22% of the company’s overall capital structure, and they will have no problem paying off the related fees as they have a strong track-record of positive cash flow.\n\n**Macro Market Trends**\n\nThe overall demand for digital/automation transformation/operations creates numerous trends that can positively impact the future of DOX. With the COVID-19 pandemic, company were pushed by the circumstances to digitize their operations, which will expand the market as well as create higher demand for the future. Here are some top trends that will impact DOX’s performance:\n\n* **Overall Growth of the SaaS Market:**  \n\n   * has been consistent growth in the past decade in the SaaS market. This is driven by multiple factors including the automation of internal control, enterprise centre processing system, as well as the boom of 5G and cloud-based services. Looking into the future, for the period of 2019-23, the worldwide SaaS market is expected to reach a $60.36B valuation, recording a 9% CAGR over that period.\n* **Lasting Impacts of COVID-19:**\n   * The pandemic has already significantly accelerated the digitization rate due to the lockdowns and remote working environments. This is not a one-time catalyst, but rather a preview of what was going to happen in the future regardless; the pandemic situation has simply brought the future quicker. Going cloud or digitizing is not a temporary decision, this means the market has permanently expanded, and will continue to grow as demand increases.\n* **5G Penetration &amp; Advancements**\n   * Continuous developments in 5G technology will impact the SaaS industry in two ways:\n\n1. It will increase the accessibility of cloud-platforms and related services, thus increasing demand.\n2. It will improve the quality and range of capabilities for the products/services of software companies.\n\nIn the modern society, it seems like life is limited if you have bad Wi-Fi connection. That is emphasized in the world of SaaS. Broader bandwidth and connection qualities will incentivize potential customers to digitalise and help service providers create higher quality products.\n\n**Financials and Valuations**\n\nWhen it comes to the fair valuation of Amdocs Limited (DOX), I used both comparable companies and intrinsic valuations, then weighted the price outcomes for the final target price. Instead, I evaluated the company using a basic comparable analysis. The companies included in the comparable universe are Akamai Technologies Inc. (AKAM), Ciena Corporation (CIEN), Citrix Systems (CTXS), Cognizant Technology Solutions Corp. (CTSH), and Perspecta Inc. (PRSP). The DCF valuation is relative crude with simple margin and top-line forecasts, but the results seem very reasonable and in-line with street estimates.\n\n**Risks**\n\nTo finish off this analysis on DOX, there are a few key risks to keep in mind:\n\n* **Cyber Security**\n\nAlthough moving operations towards cloud or digital platforms will increase efficiency and limit costs, it does come with security risks. By nature of public, integrated, and/or connected cloud platforms or enterprise central systems, a large quantity of information can be easily accessed in one spot. Although that makes operations easier, it also increases the impact of hacks or other cyber security concerns. In these interconnected platforms, large amounts of information are at risks once the “first door” is opened. Hackers no longer need to crack multiple systems to acquire different information such as customer information and financials. If Amdocs gets hacked, it will likely be very detrimental to the company as large quantity of information will be exposed.\n\n* **Limited Innovation or Growth due to Lack of 5G or Internet Penetration**\n\nFor Amdocs and the entire SaaS industry, poor internet infrastructure will limit growth potential and market penetration. If 5G usage and general internet coverage does not match the rate of innovation of Amdocs, revenue growth will stall, which might impact the pricing of the stock. It will also limit the room for innovation and enhancement, which allows more time for competitors to grow within the current infrastructure and increase the competition.\n\n**In the End: Buy, Hold, or Sell?**\n\nOverall, I think Amdocs Limited (DOX) is currently undervalued. In general, the street has a buy or hold/buy valuation on the current price, which I do agree with. Therefore, my final thoughts on DOX are:\n\n* **Buy** for long-term value investment. The stock might be somewhat volatile in the short-term, but its long-term value will be consistent.\n* **Hold/Sell** if an investment return is already realized. The economy and overall market is kind of inflated as we recover from the pandemic, therefore a potential cash-out is definitely tangible as rumours of stock market crash spreads.\n\n**TLDR**\n\nAn undervalued technology solution and service provider in a growing market with $0 debt and an upside of at least 25%\n\nOriginal analysis can be found [here](https://info.utradea.com/idea/60997b509f45b0081495db90)",
        "subreddit": "StockMarket",
        "title": "$DOX - A Leader in Media &amp; Communication Digitization (Long DD)",
        "url": "https://www.reddit.com/r/StockMarket/comments/n9vrc2/dox_a_leader_in_media_communication_digitization/",
        "created": 1620764504.0
    },
    {
        "author": "utradea",
        "created_utc": 1620735565,
        "id": "n9vprl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nOf the many forces of society, the advancement of technology is one that is truly unstoppable. From how we obtain information to how people communicate from a distance, technology has changed the way people live their lives. The service providers of our everyday lives are consistently looking for ways to automate &amp; improve their offerings/operations. This created a market and demand for Amdocs Limited (Nasdaq: DOX), a technology and software product/service (such as consulting) provider that serves companies in communications, media, finance, entertainment, digital, etc.\n\n**Company Overview**\n\nEstablished in 1982 In Israel, Amdocs Limited is a multinational software company headquartered in Missouri, US. For 40 years, Amdocs has been offering advanced software products and related technology services to optimize their clients’ operations. With 26,000 employees, Amdocs is currently in business with 350 service providers in more than 80 countries. Their clientele comprised of leaders in a wide range of industries: telecom giants AT&amp;T &amp; Bell, financial institutions like HSBC, and general crowd favorites such as Amazon, 7Eleven, and Microsoft.\n\nMost of Amdocs’ offerings are provided within “amdocsONE”, a comprehensive collection of products/services consisting of: Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation. With its “cloud-native, modular and open offerings”, Amdocs helps clients smoothly and fully transition into tech-automated, digital operations.\n\nIn such a demanded market with high-ticket clients, Amdocs recorded $4.16B in revenue during FY2020 (ended September 30th, 2020), at a 33.9% Gross Margin, 19% EBITDA Margin, and 11.9% Net Profit Margin. DOX also has consistently growing Operating Cash Flow, recording $910.7M in the Last-Twelve-Months ending in December of 2020.\n\nYes, everything seems to be working out well for DOX, but that brings up the question: is there still room to grow, or has DOX plateaued, making it a safe bet, but not a high-return investment?\n\n**Capital Structure &amp; Shareholders Breakdown**\n\nA quick look at Amdocs’ capital structure: **22% Debt, 77.1% Common Equity, 0.9% Minority Interest.** What is important to point out here is that DOX has **recorded $0 in debt** for 3 straight years from FY2017-19. This is a very uncommon occurrence for a company to be 0% leveraged. In contrast, most of its competitors are operating around the 15%-25% debt/total capital ratio, comparable companies like Akamai Technologies recording \\~40% leverage in its capital structure. \n\nWhen it comes the shareholders of DOX, most of its outstanding shares are owned by institutional holders. Traditional portfolio managers such as asset manager firms are the biggest investors, with FMR LLC. as the largest holder. The large scale and consistent (holds &amp; buys) asset management investment shows street professionals see DOX as a profitable, stable investment.\n\n**Looking Long**\n\nOverall, I believe DOX shows potential at a hold/buy for long positions if you are looking to invest in an undervalued, but experienced &amp; matured company.  The following are three main theses behind a long investment in DOX:\n\n* **Strong &amp; Consistent Financial Performance:**\n\nAs an established company, we are seeing highly predictable topline growth rate with consistent profit margins. Although these no longer large-scale increases we would see on a growing tech company, DOX’s consistency and strong performance is definitely a supporting factor when it comes to investment. In more detail, DOX has a 2.9% top-line 5-year CAGR as of December 31st, 2020, with corresponding 3%, 3.6%, and 10.4% 5-year CAGR with EBITDA, EBIT, and Net Income, respectively. Although top-line growth was contracting a few years prior, it has rebounded between 2015-20, which could be contributed to the increasing number of companies transitioning into digital operations/cloud systems. Nevertheless, the higher (and increasing) bottom-line CAGRs means the company is still consistently increasing its profit margins (it is important to point out in that 5Y Net Income CAGR as of Dec.31st 2020 is significantly higher than previous years, which were around 2.2%-5.3%). DOX also has a strong cash flow, largely due to steady increases in operating cash flow. The OP cash flow is the best indicator here as unlevered free cash flow has seen some small-scale turbulence in recent years due to M&amp;As such as the acquisition of Openet Telecom, Juganu Ltd., and Veego during CY2020. Overall, DOX is a strong investment from the financial perspective due to its margin growth and consistency.\n\n* **Deep Product Portfolio with Wide Coverage**\n\nThrough “amdocsONE”, Amdocs is able to provide a full-suite of comprehensive products/services that covers every stage of digital transformation. From cutting 80% of time-to-market when utilizing Amdocs bundle offers, to continuous operational support and open tools/cloud platforms, clients receive a thorough service when working with Amdocs. Within the six main categories of offerings mention above (Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation), there are numerous individual products that allows users to customize their usage of the Amdocs’ platform and offerings. For example, CES20 is Amdocs’ cloud-based customer experience suite. Within CES20, there are 4 products that helps automate and digitize the users’ operations: DigitalONE, CatalogONE, RevenueONE, and Service &amp; Network Automation. DigitalONE is a cloud-based system that allows users to work on their branding and customer experience. CatalogONE is an open-cloud platform catalog solution that allows users to launch new products easily with a detailed user interface. RevenueONE is a platform that allows users to scale or acquire new revenue stream while limiting the cost of acquisition. Last, Service &amp; network Automation is a branch covered by amdocsNEO. AmdocsNEO is a service &amp; network automation platform that offers a wide range of tracking and management capabilities. It is used to drive and control the fast automation process of the company. The CES20 is just an example of how Amdocs products are often interconnected and deeply comprehensive. They also offer certain platforms or products/services that are industry specific.\n\nThe wide coverage of the Amdocs offerings means they can gain market penetration across numerous industries. At the same time, the stage-specific offerings allow Amdocs to stay in demand and relevant as clients transition and grow. This plays a huge part into client retainment.\n\nLast, the continuous innovation initiatives at Amdocs supports an investment as it shows the company is consistently trying to grow and improve itself. As a tech company, it is extremely dangerous to slack-off on innovation, which is often seen with tech firms that reaches a consistent profit margin. Being in the tech industry means you live and die by the creativity and uniqueness of the offerings. Amdocs is consistently investing \\~20% of their gross profit into R&amp;D. This shows the company’s dedication to innovation, which ensures that it will remain in demand in the future.\n\n* **Extremely Low Leverage**\n\nThe last thesis is quite a short and simple one: the low leverage of the company means reduced risks and limits debt-related expenses such as interest/principal payments, which in turn increases their profitability. As mentioned above, there has be several years where the company literally at $0 in debt. During FY2020, the company took on \\~$1B worth of debt, which could mean they are preparing for large scale development as from a financial standpoint, they are not in a situation where taking the extra cash is worth the liability. With that being said, the new debt is only 22% of the company’s overall capital structure, and they will have no problem paying off the related fees as they have a strong track-record of positive cash flow.\n\n**Macro Market Trends**\n\nThe overall demand for digital/automation transformation/operations creates numerous trends that can positively impact the future of DOX. With the COVID-19 pandemic, company were pushed by the circumstances to digitize their operations, which will expand the market as well as create higher demand for the future. Here are some top trends that will impact DOX’s performance:\n\n* **Overall Growth of the SaaS Market:**  \n\n   * has been consistent growth in the past decade in the SaaS market. This is driven by multiple factors including the automation of internal control, enterprise centre processing system, as well as the boom of 5G and cloud-based services. Looking into the future, for the period of 2019-23, the worldwide SaaS market is expected to reach a $60.36B valuation, recording a 9% CAGR over that period.\n\n📷\n\n* **Lasting Impacts of COVID-19:**  \n\n   * The pandemic has already significantly accelerated the digitization rate due to the lockdowns and remote working environments. This is not a one-time catalyst, but rather a preview of what was going to happen in the future regardless; the pandemic situation has simply brought the future quicker. Going cloud or digitizing is not a temporary decision, this means the market has permanently expanded, and will continue to grow as demand increases.\n\n📷\n\n* **5G Penetration &amp; Advancements**  \n\n   * Continuous developments in 5G technology will impact the SaaS industry in two ways:\n\n1. It will increase the accessibility of cloud-platforms and related services, thus increasing demand.\n2. It will improve the quality and range of capabilities for the products/services of software companies.\n\n📷\n\nIn the modern society, it seems like life is limited if you have bad Wi-Fi connection. That is emphasized in the world of SaaS. Broader bandwidth and connection qualities will incentivize potential customers to digitalise and help service providers create higher quality products.\n\n**Financials and Valuations**\n\nWhen it comes to the fair valuation of Amdocs Limited (DOX), I used both comparable companies and intrinsic valuations, then weighted the price outcomes for the final target price. Instead, I evaluated the company using a basic comparable analysis. The companies included in the comparable universe are Akamai Technologies Inc. (AKAM), Ciena Corporation (CIEN), Citrix Systems (CTXS), Cognizant Technology Solutions Corp. (CTSH), and Perspecta Inc. (PRSP). The DCF valuation is relative crude with simple margin and top-line forecasts, but the results seem very reasonable and in-line with street estimates.\n\n**Risks**\n\nTo finish off this analysis on DOX, there are a few key risks to keep in mind:\n\n* **Cyber Security**\n\nAlthough moving operations towards cloud or digital platforms will increase efficiency and limit costs, it does come with security risks. By nature of public, integrated, and/or connected cloud platforms or enterprise central systems, a large quantity of information can be easily accessed in one spot. Although that makes operations easier, it also increases the impact of hacks or other cyber security concerns. In these interconnected platforms, large amounts of information are at risks once the “first door” is opened. Hackers no longer need to crack multiple systems to acquire different information such as customer information and financials. If Amdocs gets hacked, it will likely be very detrimental to the company as large quantity of information will be exposed.\n\n* **Limited Innovation or Growth due to Lack of 5G or Internet Penetration**\n\nFor Amdocs and the entire SaaS industry, poor internet infrastructure will limit growth potential and market penetration. If 5G usage and general internet coverage does not match the rate of innovation of Amdocs, revenue growth will stall, which might impact the pricing of the stock. It will also limit the room for innovation and enhancement, which allows more time for competitors to grow within the current infrastructure and increase the competition.\n\n**In the End: Buy, Hold, or Sell?**\n\nOverall, I think Amdocs Limited (DOX) is currently undervalued. In general, the street has a buy or hold/buy valuation on the current price, which I do agree with. Therefore, my final thoughts on DOX are:\n\n* **Buy** for long-term value investment. The stock might be somewhat volatile in the short-term, but its long-term value will be consistent.\n* **Hold/Sell** if an investment return is already realized. The economy and overall market is kind of inflated as we recover from the pandemic, therefore a potential cash-out is definitely tangible as rumours of stock market crash spreads.\n\n**TLDR**\n\nAn undervalued technology solution and service provider in a growing market with $0 debt and an upside of at least 25%\n\nOriginal analysis can be found [here](https://info.utradea.com/idea/60997b509f45b0081495db90)",
        "subreddit": "wallstreetbets",
        "title": "$DOX - A Leader in Media &amp; Communication Digitization (Long DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9vprl/dox_a_leader_in_media_communication_digitization/",
        "created": 1620764365.0
    },
    {
        "author": "Erland_Brynjar",
        "created_utc": 1620416388,
        "id": "n770cn",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I was looking at tax efficiencies and found [this chart](https://www.blackrock.com/ca/investors/en/literature/tax-information/distribution-characteristics.pdf) that breaks down the dividends for all the ishares ETFs in 2020 into eligible, other income, foreign and R of C. ETFs are going to return some capital as they balance the portfolio due to inflows and outflows, and 5% is considered “low”. Ant ETF not here is probably lower than 3% R of C. (See notes at end about XRE.)\n\nWhile this may not be an exhaustive list, and do your own research, here are the “worst” offenders for return of capital in 2020.\n\n- ABC ETF % of dividend that is R of C (yield)\n\n- XSMH US small cap 100% (0.37%)\n\n- XID India 100% (0.03%)\n\n- DXV floating rate 100% (1.59%)\n\n- DXF global financials 57.81% (1.23%)\n\n- XRE REITS 46.98% (3.79%)\n\n- XTR monthly income 45.88% (5.14%)\n\n- FIE monthly income 42.38% (6.42%)\n\n- DXC dividends 20.85% (1.70%)\n\n- XIU TSX/S&amp;P 17.67% (2.80%)\n\n- XSEM ESG 16.48% (1.16%)\n\n- GCNS conservative balanced 14.66% (n/a)\n\n- XSMC US small caps 12.80% (0.67%)\n\n- XEM emerging 10.43% (1.26%)\n\n- XCH China 10.21% (2.19%)\n\n- XMM min vol emerging 9.96% (2.05%)\n\n- XML min vol EAFE 8.28% (1.08%)\n\n- XEC emerging 8.12% (1.60%)\n\n- XSAB ESG Canada 7.54% (2.56%)\n\n- XIG US corporate bonds 7.23% (2.62%)\n\n- XIC Canada 6.72% (2.77%)\n\n- XESG ESG 6.69% (2.07%)\n\n- XGI industrials 6.07% (0.89%)\n\n- XMW min vol global 5.81% (1.51%)\n\n- XIN EAFE 5.70% (n/a)\n\n- XSE conservative fixed income 5.31% (2.75%)\n\n- XDIV dividends 4.41% (4.34%)\n\n- XWD world 4.28% (1.01%)\n\n- XSH short term Corp bonds 4.04% (2.64%)\n\n- XHY US high yield bonds 3.96% (5.08%)\n\n- XUU US 3.75% (1.25%)\n\n- XFN financials 3.24% (3.14%)\n\n- XUS S&amp;P 3.16% (1.29%)\n\n- XUT utilities 2.73% (4.31%)\n\n\nNote: A return of capital is typically considered a less than desirable form of distribution from an ETF because it is drawn from shareholder equity rather than a fund’s income.\n\nNote: Real estate investment trusts also distribute ROC, but for a different reason. For accounting purposes, REITs depreciate their assets. This reduces net income, but because depreciation is a non-cash charge – and may overstate what the REIT spends to maintain its properties – the REIT's cash flow is usually higher than its net income. The difference is distributed to unitholders as ROC, even though it represents actual cash generated by the business.\n\nNote: Generally, a fund that is bringing in a lot of new money will distribute a higher percentage of ROC to unitholders.\n\nNote: Returns of capital are not taxed.",
        "subreddit": "CanadianInvestor",
        "title": "How much of your dividends was Return of Capital?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n770cn/how_much_of_your_dividends_was_return_of_capital/",
        "created": 1620445188.0
    },
    {
        "author": "VMP85",
        "created_utc": 1623815398,
        "id": "o0w0dz",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I am looking to gain additional exposure to semiconductors (beyond what I already have with FSKAX, VTIAX and VXUS) and am looking to get feedback or suggestions on the best way to go about doing this. This is in a taxable account. My first thought was to buy SMH as TSM and NVDA are the two largest holdings. However, it lacks any AAPL and MSFT. Would the best choice be to buy SMH and also both AAPL and MSFT? Or, would it be best to buy AMD, NVDA, TSM, AMAT, TXN, AAPL and MSFT individually?",
        "subreddit": "stocks",
        "title": "Exposure to semiconductors suggestions",
        "url": "https://www.reddit.com/r/stocks/comments/o0w0dz/exposure_to_semiconductors_suggestions/",
        "created": 1623844198.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623332540,
        "id": "nwnysp",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "As usual for me, I took some of my adderall prescription and it drove me to write a DD on my most watched stocks at the moment.\n\nApplied Matterials Inc ($AMAT) is a large-cap stock, and I base my play upon it's high quality and strong momentum; as well as confidence in semi-conductor stocks. AMAT provides manufacturing equipment, services and software to the semiconductor, display and related industries.\n\nApplied Materials is the leading producer of equipment and materials for producing microchips, TV's (OLED's/LCD's), and solar panels. They also have their services business which offers manufacturing consulting and automation software. They are based in California, but have factories around the world, with Asian customers accounting for 80% of it's revenue.\n\nTo summarise:\n\n- Semi-conductor systems make 60% of revenue, this is for equipment used to manufacture semiconductor devices such as microprocessors and memory.\n\n- Applied global services provide a quarter of revenue. This is for integrated solutions to optimise equipment, performance and productivity,\n\n- And the display markets account for 10% of it's revenue. Providing products for manufacturing LCD's and OLED displays.\n\n- It's customers include Apple, HP and Dell.\n\nWith the current silicon shortage, I expect the stock to surge further when this shortage slows down.\n\n- AMAT has been stair stepping higher in the recent bull trend, as a leader in one of the stronger industry groups in tech (semiconductors), I believe it among other semi-conductor stocks are a great buy for a long right now.\n\n- AMAT's 5-year return on Capital Employed is 25.1%, which is a strong indicator that it has the power to grow profitably. AMAT's share price has had a 72.1% return relative to the market over the past 12 months.\n\n- Furthermore, it's earnings outlook is improving. Analysts are still raising their earnings estimates for the company. For the year, the stock currently has an earnings estimate of $6.53 per share, up 56.59% from a year ago.\n\n- AMAT is testing the 10 week line on the weekly chart, after declining recently. This has formed a handle, and if you rebound from here to get above the handle, there could be a breakout.\n\n- As Nvidia recently broke out we could see other semiconductor stocks such as TSM, AMAT, LCRX, and ASML following this pattern.\n\n- ASML is also in the buy range after finding support at the 10-week line.\n\nWhy semi-conductor stocks are a good play: \n- The Innovator IBD Breakout Oppurtunities Index (BOUT) jumped 152% from March 2020 lows before pulling back in February. This ETF is now integrating leading components manufacturers such as DELL, ZBRA, AMAT, LRCX, UCTT, and TER.\n\nJim Cramer himself is now looking at AMAT, TSM and AMD.\n\n\"Cramer recently said that if investors think chips are truly in short supply and we need capital equipment, then the company they most need is Lam Research (LRCX), other than Taiwan Semiconductor Manufacturing (TSM)\"\n\n\"Jim Cramer recently named chip equipment major Applied Materials (AMAT), as one of the stocks that got away.\n\nHe called out the bull market in semiconductor equipment. We need to make more chips, he said, and companies like Applied Materials can make that happen.\n\nThe semiconductor equipment major reported mixed fiscal-second-quarter earnings and received a number of positive reviews and price-target upgrades from Wall Street analysts.\"\n\nAnyway, aside from Cramer there are many other reasons to own semi-conductor stocks.\n\nOne of my primary reasons is the growth in data centre demand. This was why I bought NVDA calls at $620, aside from the stock-split. AMD is also bringing out new data-centre GPUs.\n\n- There has been a huge growth in demand for data centre equipment, due to the rise in work-from-home driving data centre's to increase their cloud-storage capacities. This has fuelled demand for data-centre chips from data centre operators.\n\n- The data centre market is expected to grow to $519.34 billion during 2021-2025, driven by the growing clout of cloud services and digitization. Further, increase in adoption of multi-cloud and network upgrade to support 5G is fueling growth.\n\n- New semiconductor manufacturing processes from 10nm, 7nm, to 5nm and 3nm has opened new business avenues.\n\n- 5G deployment is spuring further sector growth.\n\n- VR and AR devices, gaming, wearables and drones, have grown in use due to Coronavirus - hence leading to a increase in usage of online services globablly.\n\n- Improvements in DRAM and NAND pricing are fueling semi-conductor stocks catering to the memory market.\n\n- AMD, and TSM delivered good performance in the first quarter driven by data centre demand.\n\nI think my adderall has worn off now, but I will update with a part 2 later on. I'm going to open a position in TSMC, AMAT, LCRX, and ASML today. I will look at AMD also.",
        "subreddit": "wallstreetbets",
        "title": "$AMAT DD and why semi-conductor stocks are a great play right now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nwnysp/amat_dd_and_why_semiconductor_stocks_are_a_great/",
        "created": 1623361340.0
    },
    {
        "author": "TheMacroDrip",
        "created_utc": 1622736430,
        "id": "nrh2hj",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "The global semi-conductor shortage, aka chip shortage, has been crippling many industries. Demand for chips is continuing to outstrip supply and the car industry is longer the only one feeling the pain. Many auto-makers are actually limiting the amount of cars produced in 2021, including Ford recently who announced they will be canceling weeks worth of production of the F-150.\n\n**Overview**\n\nThere are a few factors at play giving analysts the impression that this shortage may last until early 2022. There’s a few KEY points that come to mind:\n\n* Most chips are produced overseas: Covid-related delays in shipping ports have effected supply coming into the United States.\n* China has been stock-piling chips: Chinese businesses have bought an absurd amount of chip-producing equipment (roughly $32 billion) in an effort to protect themselves from further US sanctions.\n* Demand for electronic products have soared.\n* Often over-looked, consumers don’t realize the amount of chips it takes to build cars in 2021. The trend is continuing in the same direction as many analysts expect the automative industry to begin predominantly developing cars with network connectivity.\n\nThis leaves an opportunity for those willing to look past the hardship some of these companies are experiencing of being unable to meet demand. The semi-conductor industry is expected to grow at CAGR of roughly \\~9% over the next 7-8 years. I see this as a relatively conservative number and it is my opinion that we are heading into a super-cycle of chip upgrades, processing power, and memory devices. Here are a few reasons:\n\n1. We are already seeing noticeable shift in demand and the way consumers are interacting in a new digital world.\n2. These electronics are becoming faster and more powerful, which simply requires a larger quantity &amp; quality of chips.\n3. More and more devices rely on connectivity and the car industry is now making it’s way onto a similar path.\n4. Following Nvidia’s earnings call we are seeing a large rise in trends for AI and machine-learning which is leading to increased demand for the required components.\n5. The rise of crypto mining will also play a role in the increased demand.\n\n**The Players**\n\nMany of the chip-related plays have already seen convincing growth over the last 12 months. However, several names have recently followed the markets to the downside and currently pose a potential good entry point. This secular trend in semi-conductor demand over the next several years is here to stay.\n\nMy semis watchlist is holding some familiar names: Applied Materials (AMAT), ASML Holdings (ASML), Skyworks Solutions (SWKS), Nvidia (NVDA), Intel (INTC), Advanced Micro Devices (AMD), Qualcomm (QCOM), and Taiwan Semiconductors (TSM).\n\nThe ones that make my shortlist are the following: NVDA, AMD, TSM, and AMAT. Here’s a look at the 2-year chart for the 4 tickers mentioned above. \n\nhttps://preview.redd.it/xr0kge6rq2371.png?width=2380&amp;format=png&amp;auto=webp&amp;s=c4beece1276b8c383ed5a2c0cca07bf40f42da11\n\n&amp;#x200B;\n\nIt is clear the secular trend in computer chips and processors have contributed greatly to the growth of these companies. Let’s take a look at a shorter time-frame. Here’s the 3-month chart for the same list of tickers. \n\nhttps://preview.redd.it/pip83wxqq2371.png?width=2388&amp;format=png&amp;auto=webp&amp;s=b353b714f1958233646a57ee5680bf2385ee2a3d\n\n&amp;#x200B;\n\nLooking at it from another angle we see AMD and TSM have been lagging behind the performance of AMAT and NVDA, who are on a nearly identical path. TSM is a leading manufacturer of chips and actually supplies most of AMD’s chips. They are based in Taiwan and there have been some concerns over the potential invasion of China. Setting those concerns aside these companies may still experience strong growth. My plays right now are in AMD and TSM and I will feel comfortable adding to any of the names I mentioned in this article if the right entry point shows itself.\n\n**Final Thoughts**\n\nI would love to say here’s why “x” company is in a better financial position than company “y”, but in this case I believe the high demand for semiconductors will benefit most names participating in this industry. Of course, not every company is made equal so please do your own research before investing in any stocks. In my opinion, this industry is in an upward secular trend and demand remains in-tact, providing tailwinds to the participants.\n\nKeep an eye on earnings reports and financial data of companies that BUY these products. Look at phone, tablet, computer manufacturers (Apple), cloud server providers, Google server expansion (also server chip REPLACEMENT rates, which is a thing), and AI/Machine learning projects (autonomous driving, video analysis, big-data processors). It may be years before the growth slows in this industry and these players will stand to largely benefit.",
        "subreddit": "StockMarket",
        "title": "The global chip shortage and how I'll be taking advantage of the semi's dip: NVDA, AMD, AMAT, TSM",
        "url": "https://www.reddit.com/r/StockMarket/comments/nrh2hj/the_global_chip_shortage_and_how_ill_be_taking/",
        "created": 1622765230.0
    },
    {
        "author": "JamesGBoswell",
        "created_utc": 1624124542,
        "id": "o3lhk0",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Which semiconductor companies will be most likely to receive funds after the bill is signed into law? Here are my thoughts and assumptions. Please correct any mistakes. Disclaimer: I own positions in Intel, Micron, and Applied Materials.\n\nMy understanding is that the bill is largely meant to support and consolidate semiconductor manufacturing and semi cap manufacturing in the U.S. Thus, U.S.-based companies with facilities in the U.S. and that want to develop their semiconductor manufacturing capabilities in the U.S. will be the most likely to receive funding from this law as well as future support from the U.S. government which is aligned with rare bipartisanship to address and neutralize the threat of China’s growing global technological dominance. Those companies will have a competitive advantage in the marketplace after receiving these funds, regardless of other fundamental or technical factors.\n\nHowever, the funds will come in the form of grants and tax credits. My understanding, and here's where I'm making big assumptions, is that companies must apply to receive the funds and that this is an involved and competitive process. The law won’t be signed until toward the end of this year at the earliest. Then, companies will apply for grants to fund projects to build fabs, improve supply chains, etc.\n\nINTC and MU seem like clear favorites to receive funds because they’re U.S.-based IDMs with facilities primarily in the U.S., and they’re often included in news stories related to the bill. TSM and Samsung are outside the U.S., though that doesn’t mean they couldn’t hypothetically receive funds to build a fab in the U.S. But if grants are competitive, then how likely would TSM or Samsung be to receive funds to build a new fab if they were competing with Intel or MU for the same funding, based purely on the intent of the law being to support U.S.-based semiconductor business?\n\nAMAT also seems like a favorite to receive funds even though ASML has a monopoly on the most advanced semi cap equipment. ASML is based in the Netherlands and only has two facilities in the U.S. Also, I speculate that AMAT could use funds from the law to put toward R&amp;D to compete with ASML, but my knowledge in that area is lacking.\n\nIt won’t be until next year before companies can even start applying for funds. There probably won’t be any winners for projects until at least a year from now.\n\nCatalysts:\n\n* Bill gets signed by the end of this year.\n* Companies submit applications for projects and winners are announced.\n* Winners start receiving funds and investing them in projects.\n\nThis isn't advice. I'm not a financial advisor.",
        "subreddit": "investing",
        "title": "U.S. Innovation and Competition Act - which semis will receive funds?",
        "url": "https://www.reddit.com/r/investing/comments/o3lhk0/us_innovation_and_competition_act_which_semis/",
        "created": 1624153342.0
    },
    {
        "author": "Kamikaze_Cash",
        "created_utc": 1623445643,
        "id": "nxq9s8",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**tl;dr:** LRCX will benefit tremendously from the US push to produce semiconductors. Buy shares and LEAPS. \n\n**Position:** 103x LRCX shares with DRIP (dividend reinvestment) and 1x 1/2023 $500c.\n\n**The DD:** \n\n* The push within the US to produce semiconductors (microchips) inside American borders has encouraged companies like INTC, TSMC, and Samsung to commit to building multi-million dollar fab plants (semiconductor factories). \n* The semiconductor shortage in general indicates there is demand for more semis.\n* The 5G and IoT rollouts means semiconductor demand will remain high and manufactories are likely to expand further.\n\nLRCX is well-positioned to make money off this. LRCX builds the machines and does the research that these other companies need to make microchips. Without LRCX, there are no manufactories. And after the fab plants are built, the machines need maintenance. LRCX provides this maintenance at 30%+ margins.\n\n**Fundamentals:**\n\n&amp;#x200B;\n\n[Beats Earnings](https://preview.redd.it/t67m821yap471.png?width=407&amp;format=png&amp;auto=webp&amp;s=37ee8d9b94a3a0f5bfcb12d1fb6317bb5747c0fa)\n\nLRCX has beat earnings 4/4 of the last quarters. It has the growth potential to continue beating earnings.\n\nAt a 27 P/E ratio, its valuation is average in its industry and has room to climb.\n\n**Technicals:** \n\n&amp;#x200B;\n\n[Up and to the right](https://preview.redd.it/xwr8epatap471.png?width=559&amp;format=png&amp;auto=webp&amp;s=cc38dae385b63dcd764d4509061508a2cf9206ed)\n\nLRCX goes up and to the right. It has the fundamental backing to continue. Demand for shares increases as the stock gets down to $600.\n\n&amp;#x200B;\n\n[RSI, MACD, Moving Averages](https://preview.redd.it/85xb9jk9bp471.png?width=898&amp;format=png&amp;auto=webp&amp;s=e471b714290c3175f09ac20a21b391f4e2ea7b88)\n\nMACD looks like shit, but RSI is positive and LRCX travels along its 50-DMA pretty well. Look to start DCAing into shares around this level and buy more shares or LEAPS as we approach $600.\n\n**Competition:**\n\nAMAT competes with LRCX in most industry segments. However LRCX stands out as the best wafer developer. If you cannot afford LRCX at $600, AMAT is $136. AMAT is also more diversified and is a good alternative choice.\n\nThere are some others including a Dutch company, but AMAT and LRCX are the main competitors in this industry, and they both have a wide moat.",
        "subreddit": "wallstreetbets",
        "title": "LRCX is the semiconductor play for 2021-2022",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nxq9s8/lrcx_is_the_semiconductor_play_for_20212022/",
        "created": 1623474443.0
    },
    {
        "author": "JamesGBoswell",
        "created_utc": 1624214129,
        "id": "o4byc8",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Which semiconductor companies will be most likely to receive funds after the bill is signed into law? Here are my thoughts and assumptions. Please correct any mistakes. Disclaimer: I own positions in Intel, Micron, and Applied Materials.\n\nMy understanding is that the bill is largely meant to support and consolidate semiconductor manufacturing and semi cap manufacturing in the U.S. Thus, U.S.-based companies with facilities in the U.S. that want to develop their semiconductor manufacturing capabilities in the U.S. will be the most likely to receive funding from this law as well as future support from the U.S. government which is aligned with rare bipartisanship to address and neutralize the threat of China’s growing global technological dominance. Those companies will have a competitive advantage in the marketplace after receiving these funds, regardless of other fundamental or technical factors.\n\nHowever, the funds will come in the form of grants and tax credits. My understanding, and here's where I'm making big assumptions, is that companies must apply to receive the funds and that this is an involved and competitive process. The law won’t be signed until toward the end of this year at the earliest. Then companies will apply for grants to fund projects to build fabs, improve supply chains, etc.\n\nINTC and MU seem like clear favorites to receive funds because they’re U.S.-based IDMs with facilities primarily in the U.S., and they’re often included in news stories related to the bill. TSM and Samsung are outside the U.S., though that doesn’t mean they couldn’t hypothetically receive funds to build a fab in the U.S. But if grants are competitive, then how likely would TSM or Samsung be to receive funds to build a new fab if they were competing with Intel or MU for the same funding, based purely on the intent of the law being to support U.S.-based semiconductor business?\n\nAMAT also seems like a favorite to receive funds even though ASML has a monopoly on the most advanced semi cap equipment. ASML is based in the Netherlands and only has two facilities in the U.S. Also, I speculate that AMAT could use funds from the law to put toward R&amp;D to compete with ASML, but my knowledge in that area is lacking.\n\nIt won’t be until next year before companies can even start applying for funds. There probably won’t be any winners for projects until at least a year from now.\n\nCatalysts:\n\n* Bill gets signed by the end of this year.\n* Companies submit applications for projects and winners are announced.\n* Winners start receiving funds and investing them in projects.\n\nThis isn't advice. I'm not a financial advisor.",
        "subreddit": "stocks",
        "title": "US Innovation and Competition Act - which semis will receive funds?",
        "url": "https://www.reddit.com/r/stocks/comments/o4byc8/us_innovation_and_competition_act_which_semis/",
        "created": 1624242929.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1623712332,
        "id": "nzzqex",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "$SOXX (semiconductor ETF) has broken out of its wedge after ~4 months of consolidation. $AMAT $LRCX $NVDA $AMD, etc are primed to breakout if tomorrow's economic data reports sends tech flying!",
        "url": "https://i.redd.it/tvl73o88cb571.png",
        "created": 1623741132.0
    },
    {
        "author": "JamesGBoswell",
        "created_utc": 1624124096,
        "id": "o3lbc3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Which semiconductor companies will be most likely to receive funds after the bill is signed into law? Here are my thoughts and assumptions. Please correct any mistakes. Disclaimer: I own positions in Intel, Micron, and Applied Materials.\n\nMy understanding is that the bill is largely meant to support and consolidate semiconductor manufacturing and semi cap manufacturing in the U.S. Thus, U.S.-based companies with facilities in the U.S. that want to develop their semiconductor manufacturing capabilities in the U.S. will be the most likely to receive funding from this law as well as future support from the U.S. government which is aligned with rare bipartisanship to address and neutralize the threat of China’s growing global technological dominance. Those companies will have a competitive advantage in the marketplace after receiving these funds, regardless of other fundamental or technical factors.\n\nHowever, the funds will come in the form of grants and tax credits. My understanding, and here's where I'm making big assumptions, is that companies must apply to receive the funds and that this is an involved and competitive process. The law won’t be signed until toward the end of this year at the earliest. Then companies will apply for grants to fund projects to build fabs, improve supply chains, etc.\n\nINTC and MU seem like clear favorites to receive funds because they’re U.S.-based IDMs with facilities primarily in the U.S., and they’re often included in news stories related to the bill. TSM and Samsung are outside the U.S., though that doesn’t mean they couldn’t hypothetically receive funds to build a fab in the U.S. But if grants are competitive, then how likely would TSM or Samsung be to receive funds to build a new fab if they were competing with Intel or MU for the same funding, based purely on the intent of the law being to support U.S.-based semiconductor business?\n\nAMAT also seems like a favorite to receive funds even though ASML has a monopoly on the most advanced semi cap equipment. ASML is based in the Netherlands and only has two facilities in the U.S. Also, I speculate that AMAT could use funds from the law to put toward R&amp;D to compete with ASML, but my knowledge in that area is lacking.\n\nIt won’t be until next year before companies can even start applying for funds. There probably won’t be any winners for projects until at least a year from now.\n\nCatalysts:\n\n* Bill gets signed by the end of this year.\n* Companies submit applications for projects and winners are announced.\n* Winners start receiving funds and investing them in projects.\n\nThis isn't advice. I'm not a financial advisor.",
        "subreddit": "StockMarket",
        "title": "U.S. Innovation and Competition Act - which semis will receive funds?",
        "url": "https://www.reddit.com/r/StockMarket/comments/o3lbc3/us_innovation_and_competition_act_which_semis/",
        "created": 1624152896.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1622815758,
        "id": "ns60d8",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "Wallstreetbetsnew",
        "title": "The global chip shortage and how I'll be taking advantage of the semi's dip: NVDA, AMD, AMAT, TSM",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/ns60d8/the_global_chip_shortage_and_how_ill_be_taking/",
        "created": 1622844558.0
    },
    {
        "author": "Pdiddy143",
        "created_utc": 1623238270,
        "id": "nvtjsy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "HOW TF IS THIS SHIT LEGAL?!? Senate passes a tech manufacturing bill to counter China. Numerous senators/ house members purchased semi-conductor stock BEFOREHAND. For example, Nancy Wyden bought $AAPL, $AMAT, $AVGO, $KLAC &amp; $NVDA BEFORE the legislation. https://unusualwhales.com/i_am_the_senate/semi",
        "url": "https://i.redd.it/5rdr8c9978471.jpg",
        "created": 1623267070.0
    },
    {
        "author": "inverse_action",
        "created_utc": 1622962516,
        "id": "ntfsf0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Please let me know what you think. I am in my late 30s and started to invest last year. :D Thanks\n\n**NVDA** 24.92%\n\n**SQ** 11.36%\n\n**TSLA** 7.79%\n\n**ILMN** 7.41%\n\n**MSFT** 5.93%\n\n**AAPL** 5.65%\n\n**ISRG** 3.93%\n\n**OPEN** 2.90%\n\n**U** 2.81%\n\n**VRTX** 2.48%\n\n**AVGO** 2.24%\n\n**EDIT** 2.15%\n\n**BNGO** 2.03%\n\n**MU** 1.98%\n\n**TWST** 1.82%\n\n**AMAT** 1.65%\n\n**QCOM** 1.59%\n\n**GDOT** 1.47%\n\n**SKLZ** 1.44%\n\n**PLTR** 1.42%\n\n**BIDU** 1.37%\n\n**ABBV** 1.33%\n\n**EXAS** 1.26%\n\n**CRSP** 1.07%\n\n**NVTA** 0.97%\n\n**BDSI** 0.85%",
        "subreddit": "investing_discussion",
        "title": "Feedback for my portfolio!",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ntfsf0/feedback_for_my_portfolio/",
        "created": 1622991316.0
    },
    {
        "author": "stocks-in-demand",
        "created_utc": 1623180912,
        "id": "nvcchf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMAT trading bearish",
        "url": "https://i.redd.it/fqhqsx2cg3471.png",
        "created": 1623209712.0
    },
    {
        "author": "Minimum-Mood3347",
        "created_utc": 1623802080,
        "id": "o0s637",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "AMAT. Thoughts on taking a short position.",
        "url": "https://www.reddit.com/r/stocks/comments/o0s637/amat_thoughts_on_taking_a_short_position/",
        "created": 1623830880.0
    },
    {
        "author": "prostockadvice",
        "created_utc": 1622605436,
        "id": "nqcjrt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " It is going to be a short trading week and shortened weeks tend to be choppy. The Nasdaq and S&amp;P came under selling pressure yesterday as the Dow Jones barely finished positive. Oil and energy performed exceedingly well.  \n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*Waiting for set ups to trigger on the following before entering options:*  \n\n$DFS\n\n$V\n\n$OKTA\n\n$GPS\n\n$BHP\n\n$AMAT\n\n$TTWO\n\n$MS\n\n$NAIL\n\n$BABA\n\n$VRSK\n\n$SPY\n\n$TRV  \n\nPatience for a good entry is key.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n **New Alerts Added:** \n\n&amp;#x200B;\n\nAlibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others.\n\nAlthough BABA is still in a bearish pattern, it is hard to find an analyst that doesn't have a 'buy' rating for the e-commerce goliath of Asia. There are major resistances that it is hovering around right now which it has rejected 4 times since its ATH in last October. More so now, the 50 day MA is here as well. Overall, I am bullish on BABA and if we can have another buying opportunity at the bottom support (purple line), I will be getting into calls around $220. \n\n*Processing img stuk135axr271...*\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n \n\nVerisk Analytics, Inc. provides data analytics solutions in the United States and internationally. It provides predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, natural resources intelligence, economic forecasting, commercial banking and finance, and various other fields. The company operates through three segments: Insurance, Energy and Specialized Markets, and Financial Services.\n\nCurrently, VRSK is possibly bouncing on major support dating back to the March 2019 lows. I will wait until today to confirm a 'bounce' and if true, I like the $180 monthly calls.\n\nhttps://preview.redd.it/s39tca7dxr271.png?width=1156&amp;format=png&amp;auto=webp&amp;s=082858553e3354a0344b80abe0f2c2000958a6d3\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n Next, I've back tested data on a multi factor alert strategy on $SPY. Once the Stochastic RSI forms a bull cross on the day candles and only if the RSI is less than a constant value of 20. This has returned almost a 90% success rate in a little over a year. Once this triggers again, I will buy SPY weekly calls and only taking profit after 2-3 days.  \n\nhttps://preview.redd.it/954ou9mexr271.png?width=1156&amp;format=png&amp;auto=webp&amp;s=2b929f2be8714b46823df5b865ef52d3ef3353b3\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n \n\nThe Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United states and internationally. The company operates through three segments: Business Insurance, Bond &amp; Specialty Insurance, and Personal Insurance.\n\n$TRV has been doing rather well and has found strong support along the 50 day MA. If it pulls back to this support, I believe calls up to $170 will work well here. TRV has been trading within a paralell channel since May of last year. \n\nhttps://preview.redd.it/xad3g2bgxr271.png?width=1156&amp;format=png&amp;auto=webp&amp;s=86ec7c94e2da33f7d521365ef3d7916f9eef80cd\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\nDisclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations. Prostockadvice.com is not responsible or liable in any way for opinions expressed here. This is not meant to be financial advice as we are not a licensed financial advisor.",
        "subreddit": "options",
        "title": "4 Options Set Ups w/ Back Tested Data",
        "url": "https://www.reddit.com/r/options/comments/nqcjrt/4_options_set_ups_w_back_tested_data/",
        "created": 1622634236.0
    }
]