[
    {
        "author": "bigbear0083",
        "created_utc": 1630153817,
        "id": "pd8xfn",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning August 30th, 2021.\n\n# **A key jobs report in the week ahead could drive the next big market move - [(Source)](https://www.cnbc.com/2021/08/27/a-key-jobs-report-in-the-week-ahead-could-drive-the-next-big-market-move.html)**\n*****\n&gt; With Jackson Hole in the rear-view mirror, August’s employment report could be the next driver for markets.\n*****\n&gt; Stocks gained in the past week, surging again to new highs Friday after a speech by Federal Reserve Chairman Jerome Powell. The chairman acknowledged that Fed officials expect to taper back their $120 billion a month bond-buying program this year, a first step toward reversing easy policy.\n*****\n&gt; Powell was speaking at the Kansas City Fed’s annual Jackson Hole, Wyo. symposium, held virtually this year. He said the Fed has seen sufficient progress on inflation, but the labor market has not yet improved enough to start the taper. Importantly, he also emphasized that the wind down of the bond program does not mean the Fed will automatically move on to raise interest rate hikes.\n*****\n&gt; “Powell has made it clear the Fed is not prepared to raise interest rates anytime soon. The market seems relieved by that. … With some of the economic data already slowing, I think interest rate hikes are far, far away, and investors are happy about that,” said Michael Arone, chief investment strategist for the US SPDR business at State Street Global Advisors.\n*****\n&gt; Arone said the Fed has so far avoided a “taper tantrum,” similar to the 2013 market sell-off when the Fed announced it was rolling back quantitative easing. Powell’s speech was widely anticipated to clarify the Fed’s position on its $120 billion monthly bond purchases, after a number of Fed officials called for the start of a wind down.\n*****\n&gt; # Jobs are the focal point\n*****\n&gt; Now, market focus shifts even more fiercely to jobs data, with the release Friday of the August employment report.\n*****\n&gt; “For sure, the market is going to react,” said Jim Caron, head of macro strategies for global fixed income at Morgan Stanley Investment Management. “I think it’s important. I think the issue that they’re going to have is unemployment benefits don’t really run out until the beginning of September. It’s really not until you get the October jobs number that you get a more free look at September.”\n*****\n&gt; The dollar index sank after Powell’s Friday morning speech, as stocks rallied to new highs and Treasury yields fell. Other data in the coming week includes consumer confidence Tuesday and Wednesday’s release of Institute for Supply Management manufacturing data and ADP’s private sector payroll data, a kind of preview for Friday’s government jobs report.\n*****\n&gt; “I wouldn’t be surprised to see follow-through Monday and Tuesday, but ahead of ADP on Wednesday, I’d look for position adjusting which means weaker stocks and weaker bonds and stronger dollar ahead of the jobs data,” said Marc Chandler, chief market strategist at Bannockburn Global Forex.\n*****\n&gt; He said Powell was dovish, as expected, while still emphasizing that tapering was coming. But the key for markets was that he stressed the end of the program does not mean “tightening” or rate hikes. The 10-year Treasury yield had risen above 1.35% this week, but fell to 1.3% after Powell spoke Friday.\n*****\n&gt; # U.S. 10-year Treasury yield\n*****\n&gt; “The market will get cautious again ahead of the jobs data. Then it’s a new world into September. You have to wait until after the jobs data to see if these moves have sustaining power. This is ‘a buy the rumor, sell the fact’ move,” Chandler said.\n*****\n&gt; Some market pros had expected an announcement on tapering from the Fed at its September meeting, but that view has now mostly changed to a November or December announcement. “Because of the uncertainty of delta, I think it will take more than the next jobs report,” said Diane Swonk, chief economist at Grant Thornton. “The disruption to jobs in particular is if schools have to close again.”\n*****\n&gt; Economists polled by Dow Jones expect 750,000 jobs were created in August and the unemployment rate fell to 5.2%. In July, the economy created 943,000 jobs and unemployment slid to 5.4%. Education was a big contributor in July, with 261,000 jobs added in public schools and private education.\n*****\n&gt; “It doesn’t have to be a spectacular number to satisfy their needs,” said Swonk of the August report. “You need a solid jobs number, something north of a half million... I think we’re going to be close to that. They’re going to want to see September employment as well.”\n*****\n&gt; # Market risks\n*****\n&gt; State Street’s Arone said the Fed’s discussion of the tapering will be top of mind in the markets, just as the next earnings season rolls around.\n*****\n&gt; “It will be interesting at a time when the Fed starts taking its foot off the pedal,” he said. “Right now, the bull case continues to be reasonably strong, but markets don’t go straight up. If I was going to key on a specific risk, I’d keep an eye on third quarter earnings reports, and more importantly what corporate executives are saying about next year.”\n*****\n&gt; Arone said strong earnings has been the biggest driver of market gains, helping investors ignore worries about the spread of the Covid delta variant, the U.S. withdrawal from Afghanistan, and dysfunction in Washington.\n*****\n&gt; The market’s summer rally continued in the past week, with the Dow ending at 35,455, up just about 1% for the week. The S&amp;P 500 and Nasdaq both ended the week at record highs.\n*****\n&gt; The S&amp;P 500 was up 1.5% at 4,509, and the Nasdaq rose 2.8% to 15,129.\n*****\n&gt; “The market has been able to ignore all this noise and rally,” he said, adding it would be ironic if it were earnings that caused a sell-off and not a Fed policy change or something else.\n*****\n&gt; He said the market could get choppy in September and into October, a seasonally weak time of year for stocks.\n*****\n&gt; “We caught a glimpse of this this quarter, with big tech — where the numbers were beating, but they suggested that future quarters would see slower growth,” Arone said. “Investors didn’t like that, and I think it gave us a glimpse of what happens if it spreads beyond the technology sector to other sectors.”\n*****\n&gt; There are a few earnings in the coming week, including Zoom Video Monday, Campbell Soup Wednesday, and Hewlett Packard and Broadcom Thursday.\n*****\n&gt; # Watching Ida\n*****\n&gt; The oil and gas industry is closely watching Hurricane Ida, which was heading straight for Louisiana. Oil, gasoline and natural gas all rallied Friday, as energy companies shut down Gulf of Mexico production ahead of the storm. Louisiana is also home to a number of refineries.\n*****\n&gt; West Texas Intermediate futures settled up nearly 2% Friday, at $68.74 per barrel. The benchmark U.S. crude was up more than 10% for the week, its best weekly gain since June 5, 2020.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/didTIRh.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/Ix151Zj.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/QVpHWsA.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/KT1s80n.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/E2AuWSX.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/7RNC2XB.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/puSwYZx.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JHQ3zsL.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wAgKTB0.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/gzL4Eck.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wLwUeqE.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/Pgih5dk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/1qQ8hq7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/gzDuu8v.png))**\n\n*****\n\n&gt; # Small Cap Labor Day Rally Getting Underway\n\n&gt; In the below chart, daily data since July 1, 1979 through August 20, 2021 for the Russell 2000 index of smaller companies are divided by the Russell 1000 index of largest companies, and then compressed into a single year to show an idealized yearly pattern. When the graph is descending, large-cap companies are outperforming small-cap companies; when the graph is rising, smaller companies are moving up faster than their larger brethren. The most prominent period of outperformance generally begins in mid-December and lasts until late-February or early March with a surge in January. This period of outperformance by small-caps is known as the “January Effect” in the annual Stock Trader’s Almanac.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/ee23ad03da0bcf4a9f8869976521a446/51d39e9e109dc4da-47/s500x750/7dc9cb9b15e57125a71f2475fad23ab6ccd1423e.jpg))**\n\n&gt; In recent years, another sizable move is quite evident just before Labor Day. One possible explanation for this move is individual investors begin to return to work after summertime vacations and are searching for “bargain” stocks. In a typical year, small-caps would have been lagging and could represent an opportunity relative to other large-cap possibilities. As of today’s close, Russell 2000 is up 13.4% compared to the Russell 1000 being up 19.0% year-to-date. Lagging small-caps and resilient U.S. consumers could be the ideal setup for a repeat of this pattern this year. However, the small-cap advantage does historically wane around mid-September.\n\n*****\n\n&gt; # Small-Caps Bounce\n\n&gt; ln today's Morning Lineup, we noted the inverse correlation between performance this week and market caps. As shown in the major US Indices screen of our Trend Analyzer tool, the two best performers over the past five days have been Micro-Caps (IWC) followed by small caps like the Russell 2000 (IWM) and the Core S&amp;P Small-Cap ETF (IJR). Mid-cap ETFs are the next best performers with high 2% gains then most large cap indices have only risen around 1.5% this week with the exception of the Dow (DIA) which has not even gained 1%. As for where these indices are trading relative to each one's trading range, it is partially a mean reversion story. Small caps were deeply oversold one week ago and are now sitting just below their 50-DMAs. While not to as extreme of a degree, mid-caps were similarly trading a full standard deviation below their 50-DMAs last week. Today, they are on the opposite side of their 50-DMAs and on the verge of overbought readings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/indices0827.png))**\n\n&gt; As previously mentioned, small caps like the Micro-Cap ETF (IWC) and Russell 2000 ETF (IWM) were oversold last week. From a charting perspective, each of these indices' rallies this week are not only bounces from extreme oversold levels, but they also follow brief dips below their 200-DMAs. But whereas the past five days have seen solid gains, yesterday saw IWC and IWM reject their 50-DMAs and the high end of their ranges that have been in place since late July. In other words, even though small caps have led the market this week, they are not out of the woods yet.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWC.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWM.png))**\n\n&gt; Looking at the relative strength lines of small caps like IWC and IWM versus the large cap S&amp;P 500 (SPY) over the past year, the past week's outperformance again is a blip on the radar and has only put a small dent in the longer term trend of underperformance.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-Small-v-Large2.png))**\n\n&gt; Where that is not necessarily the case is small market caps versus the smallest market caps. As shown below, the relative strength line of the Micro-Cap ETF (IWC) versus the Russell 2000 (IWM) broke out of the past few months' downtrend over the past few days.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWC-vs-IWM2.png))**\n\n*****\n\n&gt; # 6 Charts on Stocks Making New All-Time Highs\n\n&gt; The S&amp;P 500 Index made yet another new all-time high yesterday, the 50th on the year. “The all-time record for any one year is 77 S&amp;P 500 new all-time highs back in 1995,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Incredibly, 2021 is currently on pace for 78 new highs. There’s a long way to go, but this has been an amazing year and this is yet another way to show it.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-1.png?ssl=1))**\n\n&gt; As impressive as 50 new highs is, investors need to remember that new highs happen in clusters that can last decades. We’ve been sharing this chart for years, saying exactly that: previous periods of new highs lasted much longer than most expected. Mark Twain said history doesn’t repeat itself, but it often rhymes. If history rhymes once again, we could still have several more years of new highs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-2.png?ssl=1))**\n\n&gt; Another interesting stat about S&amp;P 500 all-time highs is every month so far in 2021 has seen a new high, 8 for 8. Only once have all 12 months made a new all-time high and that was in 2014. This is somewhat surprising, given the S&amp;P 500 gained only 11.4% in 2014, but it was a very slow and persistent move. Most investors (including this author) would guess it was 1995, but that spectacular year saw new highs in ‘only’ 10 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-3.png?ssl=1))**\n\n&gt; Although August tends to be historically weak for stocks, that hasn’t been the case this year. In fact, the S&amp;P 500 has made an incredible 9 new highs already this month, the most since 1929. No, we don’t think this is another 1929, but this is just another way to show how astounding this bull run has been.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-4.png?ssl=1))**\n\n&gt; As shown in the LPL Chart of the Day, 50 new S&amp;P 500 all-time highs before the end of August is quite a feat. In fact, only twice has the 50 level been cracked through the end of August, in 1964 and 1995.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-5.png?ssl=1))**\n\n&gt; So what happens next? The rest of the year in 1964 the S&amp;P 500 added 3.6%, while it added 9.6% in 1995. Below we looked at all the years with at least 30 new all-time highs through August and sure enough, better than average returns the rest of the year are common. The final 4 months gained 4.7%, versus the average final 4 months gain for all years of 3.6%. Now this is skewed due to 1987s crash, as that was the only time stocks were lower the final 4 months after more than 30 new highs by the end of August. Smoothing things out, the median return jumps up to a very impressive 5.4%, versus a median return of 3.6% for all years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-6.png?ssl=1))**\n\n&gt; 2021 is off to a roaring start and we continue to expect higher prices before all is said and done. The studies we did today do little to change our view. We’d use any potential weakness as an opportunity to add before potential higher prices.\n\n*****\n\n&gt; # Nasdaq Crosses Another 1,000 Point Threshold\n\n&gt; It won't be official until the close, but with the Nasdaq crossing 15,000 for the first time today, it's on pace to cross its third 1,000 point threshold this year and the sixth since the pandemic began in early 2020. The table below lists each 1,000 point threshold that the Nasdaq has crossed over time along with the first day that it crossed that threshold, the number of days since the prior cross, what percentage that 1,000 point consists of relative to the prior threshold, and then how many upside and downside crosses the Nasdaq has had around that level on a closing basis.\n\n&gt; Of all the 1,000 point thresholds the Nasdaq has crossed over time, the only one that it never traded back below after crossing it was 6,000 back in April 2017. Besides 1,000, that was also the 1,000 point threshold that took the longest to cross above. After first crossing 5,000 back in March 2000, it took 6,256 days for the Nasdaq to top 6,000. Since then, though, the Nasdaq has been making quick work of 1,000 point thresholds. With the exception of the 486-day gap between 8K and 9K, every other 1,000-point threshold since 6,000 has taken less than a year to cross. Even in the midst of a global pandemic, it took the Nasdaq less than six months to get from 9,000 to 10,000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-Crosses.png))**\n\n&gt; The long-term chart of the Nasdaq below includes red dots to show each time the Nasdaq first crossed a 1,000 point threshold along with the number of days for each one.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-1000-Point-thresholds.png))**\n\n&gt; Looking at the chart above may give you a feeling of lightheadedness given the seemingly parabolic nature of the last few years. An important thing to keep in mind, though, is that as a percentage of the index's price level, every 1,000 point threshold represents a smaller move in percentage terms. While the move from 9K to 10K represented a move of over 11%, the move from 14K to 15K represents only a little more than 7%. Looking at this chart on a log scale where each label on the y-axis represents a doubling of the index shows how modest the recent 1,000 point thresholds have been relative to earlier ones. Think about it this way, in the less than two years between when the Nasdaq first crossed 2K to when it crossed 5K for the first time (four different 1,000 point thresholds), it rallied 150%. Over the last four years, though, the Nasdaq has crossed 10 different 1,000-point thresholds, but the gain has also only been 150%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-1000-Point-thresholds-Log-Scale.png))**\n\n*****\n\n&gt; # Bulls Head In Separate Directions\n\n&gt;As the major indices have set more record highs in the past week, bullish sentiment has rebounded. The American Association of Individual Investors' (AAII) weekly reading on bullish sentiment rose 6.4 percentage points to 39.4% this week. That is the highest reading of optimism since the week of July 8th when bullish sentiment was a hair above 40%. While recovered, that reading is still muted versus the past year's range and is only 1.5 percentage points above their historical average. In other words, bullish sentiment has rebounded but is far from elevated.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Bull.png))**\n\n&gt; While the AAII survey showed an increase in bullish sentiment, another survey of newsletter writers from Investors Intelligence saw the opposite result. This survey's reading on bullish sentiment dropped to just 50% this week which is the lowest level since May of last year. Although this reading has now fallen out of the past year's range, it is still slightly elevated versus the historical average of 45%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-II-Bull.png))**\n\n&gt; Given the uptick in bullish sentiment, the AAII survey saw only a third of respondents report as bearish versus 35.1% last week. Like bullish sentiment, this reading remains outside of the range it has occupied for most of the past year although that current reading is also not far away from the historical average of 30.5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Bear.png))**\n\n&gt; As we noted in last Thursday's Chart of the Day, the bull-bear spread dipped into negative territory last week for the first time since late January and it was at the lowest level since October 2020. With the inverse moves in bullish and bearish sentiment this week, the spread has moved back into positive territory to its highest level since the last week of July.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-BB-Spread.png))**\n\n&gt; Not all of the gains to bullish sentiment came from the bearish camp. Neutral sentiment saw an even larger decline of 4.2 percentage points. That brings the reading down to 27.5% which is the lowest reading since April 15th when it stood at just 21.6%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Neutral.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending August 27th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(LINK REMOVED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 8.29.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(LINK REMOVED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**TICKERS REMOVED.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/gzL4Eck.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/vkLERKx.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/jPhLbGO.png))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 8.30.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/JMueNPp.png))\n\n&gt; # ***Monday 8.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Tv2AZDN.png))\n\n*****\n\n&gt; # ***Tuesday  8.31.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/84mbmWL.png))\n\n&gt; # ***Tuesday 8.31.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/UIvsHKr.png))\n\n*****\n\n&gt; # ***Wednesday 9.1.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0zugFIh.png))\n\n&gt; # ***Wednesday 9.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TKW9fwy.png))\n\n*****\n\n&gt; # ***Thursday 9.2.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7WOTcax.png))\n\n&gt; # ***Thursday 9.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VhK9X0Y.png))\n\n*****\n\n&gt; # ***Friday 9.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.3.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Zoom Video Communications, Inc. $340.81\n**Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, August 30, 2021. The consensus earnings estimate is $1.16 per share on revenue of $990.96 million and the Earnings Whisper ® number is $1.25 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $1.14 to $1.15 per share on revenue of $985.00 million to $990.00 million. Consensus estimates are for year-over-year earnings growth of 39.76% with revenue increasing by 49.35%. The stock has drifted higher by 2.7% from its open following the earnings release to be 5.9% below its 200 day moving average of $362.10. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, August 17, 2021 there was some notable buying of 10,580 contracts of the $350.00 call and 10,573 contracts of the $350.00 put expiring on Friday, October 15, 2021. Option traders are pricing in a 8.8% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CrowdStrike, Inc. $282.31\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, August 31, 2021. The consensus earnings estimate is $0.09 per share on revenue of $323.16 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for earnings of $0.07 to $0.09 per share on revenue of $318.30 million to $324.40 million. Consensus estimates are for year-over-year earnings growth of 550.00% with revenue increasing by 62.42%. Short interest has decreased by 19.8% since the company's last earnings release while the stock has drifted higher by 30.1% from its open following the earnings release to be 32.2% above its 200 day moving average of $213.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, August 16, 2021 there was some notable buying of 3,330 contracts of the $200.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 7.8% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Futu Holdings Ltd $96.47\n**Futu Holdings Ltd (FUTU)** is confirmed to report earnings at approximately 4:00 AM ET on Tuesday, August 31, 2021. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Short interest has decreased by 4.4% since the company's last earnings release while the stock has drifted lower by 20.5% from its open following the earnings release to be 15.7% below its 200 day moving average of $114.41. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, July 27, 2021 there was some notable buying of 2,362 contracts of the $150.00 call expiring on Friday, September 17, 2021. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=FUTU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Li Auto Inc. $29.34\n**Li Auto Inc. (LI)** is confirmed to report earnings at approximately 4:00 AM ET on Monday, August 30, 2021. The consensus estimate is for a loss of $0.03 per share on revenue of $4.41 billion and the Earnings Whisper ® number is ($0.05) per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for revenue of $609.00 million to $651.70 million. Short interest has increased by 6.2% since the company's last earnings release while the stock has drifted higher by 45.6% from its open following the earnings release to be 0.5% above its 200 day moving average of $29.19. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, August 9, 2021 there was some notable buying of 3,006 contracts of the $28.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 8.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $88.11\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 1, 2021. The consensus estimate is for a loss of $0.01 per share on revenue of $2.20 billion and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 87.50% with revenue increasing by 29.42%. Short interest has increased by 7.7% since the company's last earnings release while the stock has drifted higher by 14.6% from its open following the earnings release to be 3.0% above its 200 day moving average of $85.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,235 contracts of the $82.00 put and 1,234 contracts of the $97.00 call expiring on Friday, September 3, 2021. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Akoustis Technologies, Inc. $9.99\n**Akoustis Technologies, Inc. (AKTS)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, August 30, 2021. The consensus estimate is for a loss of $0.16 per share on revenue of $2.50 million and the Earnings Whisper ® number is ($0.19) per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 15.79% with revenue increasing by 583.06%. Short interest has increased by 22.9% since the company's last earnings release while the stock has drifted lower by 13.0% from its open following the earnings release to be 12.2% below its 200 day moving average of $11.38. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,551 contracts of the $10.00 call expiring on Friday, September 17, 2021. Option traders are pricing in a 28.8% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=AKTS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Catalent, Inc. $129.85\n**Catalent, Inc. (CTLT)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, August 30, 2021. The consensus earnings estimate is $1.01 per share on revenue of $1.14 billion and the Earnings Whisper ® number is $1.05 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 18.82% with revenue increasing by 20.30%. Short interest has decreased by 26.4% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 19.2% above its 200 day moving average of $108.93. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CTLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cloudera, Inc. $15.95\n**Cloudera, Inc. (CLDR)** is confirmed to report earnings at approximately 7:05 AM ET on Monday, August 30, 2021. The consensus earnings estimate is $0.09 per share on revenue of $227.19 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 12.50% with revenue increasing by 6.00%. Short interest has decreased by 1.7% since the company's last earnings release while the stock has drifted higher by 0.1% from its open following the earnings release to be 12.6% above its 200 day moving average of $14.17. On Friday, August 27, 2021 there was some notable buying of 5,737 contracts of the $16.00 call expiring on Friday, September 3, 2021. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 11.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CLDR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # DocuSign $300.76\n**DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 2, 2021. The consensus earnings estimate is $0.39 per share on revenue of $487.50 million and the Earnings Whisper ® number is $0.42 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $479.00 million to $485.00 million. Consensus estimates are for year-over-year earnings growth of 550.00% with revenue increasing by 42.46%. Short interest has increased by 15.4% since the company's last earnings release while the stock has drifted higher by 43.3% from its open following the earnings release to be 25.4% above its 200 day moving average of $239.86. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, August 11, 2021 there was some notable buying of 1,911 contracts of the $250.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 9.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # ChargePoint Holdings, Inc. $21.24\n**ChargePoint Holdings, Inc. (CHPT)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 1, 2021. The consensus estimate is for a loss of $0.14 per share on revenue of $49.06 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for revenue of $46.00 million to $51.00 million. The stock has drifted lower by 22.5% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,534 contracts of the $30.00 call and 1,502 contracts of the $30.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 10.4% move on earnings and the stock has averaged a 7.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend a great trading week ahead r/wallstreetbets. :)",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning August 30th, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pd8xfn/wall_street_week_ahead_for_the_trading_week/",
        "created": 1630182617.0
    },
    {
        "author": "snkbrdng",
        "created_utc": 1627931303,
        "id": "owlglg",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Ok idiots listen up AMD is now headed to $269 before EOY.\n\nHere is why:\n1) Intel is getting pantsed by AMD\n2) NVDA is the benchmark stock for AMD to compare against\n3) XLNX merger closes in November (potentially earlier)\n\nFor you non nerds: Smart Intel engineers went to go to work for Facebook, Amazon, Google, Tesla. The idiots that remained screwed up massively over the last 2 years getting ready for the next generations of chips.\nSemiconductor manufacturing is complicated and takes 3 years to work out the kinks on the new technology. TSMC is good and Intel sucks. This will continue for 2-3 more years minimum.\n\n\n1.AMD revenue growth. Last week announced 99% yearly growth. Still room to grow after pulling down Intel’s pants (10% market share for EPYC today, every cloud and enterprise customer is now validating EPYC).\n\n2. NVIDIA is run by the Elon Musk of the semiconductor industry. Jensen has been CEO longer than all the other semiconductor CEOs combined (Internet+Broadcom+Qualcomm+AMD+TSMC+AMD). NVDA earned their 94 p/e. Whose next? AMD\n\n3. Big players are arbitraging XLNX acquisition. Once this selling pressure disappears (presumably around merger closing) it’s gonna rip.\n\nAt the end of this (rev growth, reduced selling pressure, P/E matching NVDA today) AMD will be at $269.",
        "subreddit": "wallstreetbets",
        "title": "AMD Target Price $269 DD 8/2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/owlglg/amd_target_price_269_dd_82/",
        "created": 1627960103.0
    },
    {
        "author": "cclagator",
        "created_utc": 1630269933,
        "id": "pe3d42",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was higher by 1.5%, more than the 1% expected move options were pricing.\n\n**This Week – SPY** options are pricing less than a 1% (in either direction) for the upcoming week. With the SPY around $450 that corresponds to about **$446** as a *bearish expected move* and **$454** as a *bullish expected move*.\n\n**Implied Volatility** – The VIX saw an intra-week high of about 19 mid-week, but came in Friday to finish the week about 16.50. That is lower than its historical average. December VIX futures are about 22.50, down from about 23 last week.\n\n**Expected Moves for This Week** via [**Options AI**](https://www.optionsai.com/):\n\nThe major ETFs are all pricing smaller moves this week than they were last week:\n\n* SPY **0.8%**\n* QQQ **1.0%**\n* IWM **1.7%**\n* DIA **0.9%**\n\nThe 0.8% expected move in the SPY is lower than the historical average. An Iron Condor with $1 wide wings based on the Expected Move for Friday, needs the ETF to finish between about $446.60 and $454.40 to make money. It needs the ETF between $447 and $454 to see Max Gain:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1w4lfckmzck71.png?width=569&amp;format=png&amp;auto=webp&amp;s=1596d5bf67a0ecfa8a6e5091e47d6a5d45de0d8d\n\n### In the News\n\nHurricane Ida made landfall on the Gulf Coast of Louisiana on Sunday. The area is home to a lot of Oil and Gas industry and the storm grew in strength rapidly over the weekend into a Category 4 storm, after markets closed on Friday. Here’s what options were pricing for movement this week in the ETFs:\n\n* XOP 3.6%\n* XLE 2.3%\n* USO 3.1%\n\n&amp;#x200B;\n\n### Expected Moves for Companies Reporting Earnings\n\nSome earnings of note this week include Zoom, Chewy, Crowdstrike, Docusign, and more. Expected move links go to the Options AI Calendar (free to use and search for other stocks I missed here). Recent actual earnings moves start with most recent:\n\nMonday\n\n**Zoom** ZM / [Expected Move: **7.3%**](https://tools.optionsai.com/earnings/ZOOM) / Recent moves: 0%, -9%, -15%\n\nTuesday\n\n**Crowdstrike** CRWD / [Expected Move: **6.5%**](https://tools.optionsai.com/earnings/CRWD) / Recent moves: -4%, +6%, +14%\n\n**Ambarella** AMBA / [Expected Move: **7.6%**](https://tools.optionsai.com/earnings/AMBA) / Recent moves: -1%, 0%, +15%\n\nWednesday\n\n**Chewy** CHWY / [Expected Move: **7%**](https://tools.optionsai.com/earnings/CHWY) / Recent moves: -6%, +5%, -5%\n\n**Okta** OKTA / [Expected Move: **5.5%**](https://tools.optionsai.com/earnings/OKTA) / Recent moves: -10%, -6%, +5%\n\n**Five Below** FIVE / [Expected Move: **6%**](https://tools.optionsai.com/earnings/FIVE) / Recent moves: +7%, -4%, +4%\n\nThursday\n\n**Broadcom** AVGO / [Expected Move: **7.1%**](https://tools.optionsai.com/earnings/AVGO) / Recent moves: +2%, +1%, -1%\n\n**Docusign** DOCU / [Expected Move: **3.6%**](https://tools.optionsai.com/earnings/DOCU) / Recent moves: +20%, -7%, +5%",
        "subreddit": "options",
        "title": "Expected Moves SPY, USO. Earnings from ZM, CHWY, CRWD, DOCU.",
        "url": "https://www.reddit.com/r/options/comments/pe3d42/expected_moves_spy_uso_earnings_from_zm_chwy_crwd/",
        "created": 1630298733.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1630153749,
        "id": "pd8wun",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning August 30th, 2021.\n\n# **A key jobs report in the week ahead could drive the next big market move - [(Source)](https://www.cnbc.com/2021/08/27/a-key-jobs-report-in-the-week-ahead-could-drive-the-next-big-market-move.html)**\n*****\n&gt; With Jackson Hole in the rear-view mirror, August’s employment report could be the next driver for markets.\n*****\n&gt; Stocks gained in the past week, surging again to new highs Friday after a speech by Federal Reserve Chairman Jerome Powell. The chairman acknowledged that Fed officials expect to taper back their $120 billion a month bond-buying program this year, a first step toward reversing easy policy.\n*****\n&gt; Powell was speaking at the Kansas City Fed’s annual Jackson Hole, Wyo. symposium, held virtually this year. He said the Fed has seen sufficient progress on inflation, but the labor market has not yet improved enough to start the taper. Importantly, he also emphasized that the wind down of the bond program does not mean the Fed will automatically move on to raise interest rate hikes.\n*****\n&gt; “Powell has made it clear the Fed is not prepared to raise interest rates anytime soon. The market seems relieved by that. … With some of the economic data already slowing, I think interest rate hikes are far, far away, and investors are happy about that,” said Michael Arone, chief investment strategist for the US SPDR business at State Street Global Advisors.\n*****\n&gt; Arone said the Fed has so far avoided a “taper tantrum,” similar to the 2013 market sell-off when the Fed announced it was rolling back quantitative easing. Powell’s speech was widely anticipated to clarify the Fed’s position on its $120 billion monthly bond purchases, after a number of Fed officials called for the start of a wind down.\n*****\n&gt; # Jobs are the focal point\n*****\n&gt; Now, market focus shifts even more fiercely to jobs data, with the release Friday of the August employment report.\n*****\n&gt; “For sure, the market is going to react,” said Jim Caron, head of macro strategies for global fixed income at Morgan Stanley Investment Management. “I think it’s important. I think the issue that they’re going to have is unemployment benefits don’t really run out until the beginning of September. It’s really not until you get the October jobs number that you get a more free look at September.”\n*****\n&gt; The dollar index sank after Powell’s Friday morning speech, as stocks rallied to new highs and Treasury yields fell. Other data in the coming week includes consumer confidence Tuesday and Wednesday’s release of Institute for Supply Management manufacturing data and ADP’s private sector payroll data, a kind of preview for Friday’s government jobs report.\n*****\n&gt; “I wouldn’t be surprised to see follow-through Monday and Tuesday, but ahead of ADP on Wednesday, I’d look for position adjusting which means weaker stocks and weaker bonds and stronger dollar ahead of the jobs data,” said Marc Chandler, chief market strategist at Bannockburn Global Forex.\n*****\n&gt; He said Powell was dovish, as expected, while still emphasizing that tapering was coming. But the key for markets was that he stressed the end of the program does not mean “tightening” or rate hikes. The 10-year Treasury yield had risen above 1.35% this week, but fell to 1.3% after Powell spoke Friday.\n*****\n&gt; # U.S. 10-year Treasury yield\n*****\n&gt; “The market will get cautious again ahead of the jobs data. Then it’s a new world into September. You have to wait until after the jobs data to see if these moves have sustaining power. This is ‘a buy the rumor, sell the fact’ move,” Chandler said.\n*****\n&gt; Some market pros had expected an announcement on tapering from the Fed at its September meeting, but that view has now mostly changed to a November or December announcement. “Because of the uncertainty of delta, I think it will take more than the next jobs report,” said Diane Swonk, chief economist at Grant Thornton. “The disruption to jobs in particular is if schools have to close again.”\n*****\n&gt; Economists polled by Dow Jones expect 750,000 jobs were created in August and the unemployment rate fell to 5.2%. In July, the economy created 943,000 jobs and unemployment slid to 5.4%. Education was a big contributor in July, with 261,000 jobs added in public schools and private education.\n*****\n&gt; “It doesn’t have to be a spectacular number to satisfy their needs,” said Swonk of the August report. “You need a solid jobs number, something north of a half million... I think we’re going to be close to that. They’re going to want to see September employment as well.”\n*****\n&gt; # Market risks\n*****\n&gt; State Street’s Arone said the Fed’s discussion of the tapering will be top of mind in the markets, just as the next earnings season rolls around.\n*****\n&gt; “It will be interesting at a time when the Fed starts taking its foot off the pedal,” he said. “Right now, the bull case continues to be reasonably strong, but markets don’t go straight up. If I was going to key on a specific risk, I’d keep an eye on third quarter earnings reports, and more importantly what corporate executives are saying about next year.”\n*****\n&gt; Arone said strong earnings has been the biggest driver of market gains, helping investors ignore worries about the spread of the Covid delta variant, the U.S. withdrawal from Afghanistan, and dysfunction in Washington.\n*****\n&gt; The market’s summer rally continued in the past week, with the Dow ending at 35,455, up just about 1% for the week. The S&amp;P 500 and Nasdaq both ended the week at record highs.\n*****\n&gt; The S&amp;P 500 was up 1.5% at 4,509, and the Nasdaq rose 2.8% to 15,129.\n*****\n&gt; “The market has been able to ignore all this noise and rally,” he said, adding it would be ironic if it were earnings that caused a sell-off and not a Fed policy change or something else.\n*****\n&gt; He said the market could get choppy in September and into October, a seasonally weak time of year for stocks.\n*****\n&gt; “We caught a glimpse of this this quarter, with big tech — where the numbers were beating, but they suggested that future quarters would see slower growth,” Arone said. “Investors didn’t like that, and I think it gave us a glimpse of what happens if it spreads beyond the technology sector to other sectors.”\n*****\n&gt; There are a few earnings in the coming week, including Zoom Video Monday, Campbell Soup Wednesday, and Hewlett Packard and Broadcom Thursday.\n*****\n&gt; # Watching Ida\n*****\n&gt; The oil and gas industry is closely watching Hurricane Ida, which was heading straight for Louisiana. Oil, gasoline and natural gas all rallied Friday, as energy companies shut down Gulf of Mexico production ahead of the storm. Louisiana is also home to a number of refineries.\n*****\n&gt; West Texas Intermediate futures settled up nearly 2% Friday, at $68.74 per barrel. The benchmark U.S. crude was up more than 10% for the week, its best weekly gain since June 5, 2020.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/didTIRh.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/Ix151Zj.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/QVpHWsA.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/KT1s80n.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/E2AuWSX.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/7RNC2XB.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/puSwYZx.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JHQ3zsL.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wAgKTB0.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/gzL4Eck.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wLwUeqE.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/Pgih5dk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/1qQ8hq7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/gzDuu8v.png))**\n\n*****\n\n&gt; # Small Cap Labor Day Rally Getting Underway\n\n&gt; In the below chart, daily data since July 1, 1979 through August 20, 2021 for the Russell 2000 index of smaller companies are divided by the Russell 1000 index of largest companies, and then compressed into a single year to show an idealized yearly pattern. When the graph is descending, large-cap companies are outperforming small-cap companies; when the graph is rising, smaller companies are moving up faster than their larger brethren. The most prominent period of outperformance generally begins in mid-December and lasts until late-February or early March with a surge in January. This period of outperformance by small-caps is known as the “January Effect” in the annual Stock Trader’s Almanac.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/ee23ad03da0bcf4a9f8869976521a446/51d39e9e109dc4da-47/s500x750/7dc9cb9b15e57125a71f2475fad23ab6ccd1423e.jpg))**\n\n&gt; In recent years, another sizable move is quite evident just before Labor Day. One possible explanation for this move is individual investors begin to return to work after summertime vacations and are searching for “bargain” stocks. In a typical year, small-caps would have been lagging and could represent an opportunity relative to other large-cap possibilities. As of today’s close, Russell 2000 is up 13.4% compared to the Russell 1000 being up 19.0% year-to-date. Lagging small-caps and resilient U.S. consumers could be the ideal setup for a repeat of this pattern this year. However, the small-cap advantage does historically wane around mid-September.\n\n*****\n\n&gt; # Small-Caps Bounce\n\n&gt; ln today's Morning Lineup, we noted the inverse correlation between performance this week and market caps. As shown in the major US Indices screen of our Trend Analyzer tool, the two best performers over the past five days have been Micro-Caps (IWC) followed by small caps like the Russell 2000 (IWM) and the Core S&amp;P Small-Cap ETF (IJR). Mid-cap ETFs are the next best performers with high 2% gains then most large cap indices have only risen around 1.5% this week with the exception of the Dow (DIA) which has not even gained 1%. As for where these indices are trading relative to each one's trading range, it is partially a mean reversion story. Small caps were deeply oversold one week ago and are now sitting just below their 50-DMAs. While not to as extreme of a degree, mid-caps were similarly trading a full standard deviation below their 50-DMAs last week. Today, they are on the opposite side of their 50-DMAs and on the verge of overbought readings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/indices0827.png))**\n\n&gt; As previously mentioned, small caps like the Micro-Cap ETF (IWC) and Russell 2000 ETF (IWM) were oversold last week. From a charting perspective, each of these indices' rallies this week are not only bounces from extreme oversold levels, but they also follow brief dips below their 200-DMAs. But whereas the past five days have seen solid gains, yesterday saw IWC and IWM reject their 50-DMAs and the high end of their ranges that have been in place since late July. In other words, even though small caps have led the market this week, they are not out of the woods yet.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWC.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWM.png))**\n\n&gt; Looking at the relative strength lines of small caps like IWC and IWM versus the large cap S&amp;P 500 (SPY) over the past year, the past week's outperformance again is a blip on the radar and has only put a small dent in the longer term trend of underperformance.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-Small-v-Large2.png))**\n\n&gt; Where that is not necessarily the case is small market caps versus the smallest market caps. As shown below, the relative strength line of the Micro-Cap ETF (IWC) versus the Russell 2000 (IWM) broke out of the past few months' downtrend over the past few days.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWC-vs-IWM2.png))**\n\n*****\n\n&gt; # 6 Charts on Stocks Making New All-Time Highs\n\n&gt; The S&amp;P 500 Index made yet another new all-time high yesterday, the 50th on the year. “The all-time record for any one year is 77 S&amp;P 500 new all-time highs back in 1995,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Incredibly, 2021 is currently on pace for 78 new highs. There’s a long way to go, but this has been an amazing year and this is yet another way to show it.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-1.png?ssl=1))**\n\n&gt; As impressive as 50 new highs is, investors need to remember that new highs happen in clusters that can last decades. We’ve been sharing this chart for years, saying exactly that: previous periods of new highs lasted much longer than most expected. Mark Twain said history doesn’t repeat itself, but it often rhymes. If history rhymes once again, we could still have several more years of new highs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-2.png?ssl=1))**\n\n&gt; Another interesting stat about S&amp;P 500 all-time highs is every month so far in 2021 has seen a new high, 8 for 8. Only once have all 12 months made a new all-time high and that was in 2014. This is somewhat surprising, given the S&amp;P 500 gained only 11.4% in 2014, but it was a very slow and persistent move. Most investors (including this author) would guess it was 1995, but that spectacular year saw new highs in ‘only’ 10 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-3.png?ssl=1))**\n\n&gt; Although August tends to be historically weak for stocks, that hasn’t been the case this year. In fact, the S&amp;P 500 has made an incredible 9 new highs already this month, the most since 1929. No, we don’t think this is another 1929, but this is just another way to show how astounding this bull run has been.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-4.png?ssl=1))**\n\n&gt; As shown in the LPL Chart of the Day, 50 new S&amp;P 500 all-time highs before the end of August is quite a feat. In fact, only twice has the 50 level been cracked through the end of August, in 1964 and 1995.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-5.png?ssl=1))**\n\n&gt; So what happens next? The rest of the year in 1964 the S&amp;P 500 added 3.6%, while it added 9.6% in 1995. Below we looked at all the years with at least 30 new all-time highs through August and sure enough, better than average returns the rest of the year are common. The final 4 months gained 4.7%, versus the average final 4 months gain for all years of 3.6%. Now this is skewed due to 1987s crash, as that was the only time stocks were lower the final 4 months after more than 30 new highs by the end of August. Smoothing things out, the median return jumps up to a very impressive 5.4%, versus a median return of 3.6% for all years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-6.png?ssl=1))**\n\n&gt; 2021 is off to a roaring start and we continue to expect higher prices before all is said and done. The studies we did today do little to change our view. We’d use any potential weakness as an opportunity to add before potential higher prices.\n\n*****\n\n&gt; # Nasdaq Crosses Another 1,000 Point Threshold\n\n&gt; It won't be official until the close, but with the Nasdaq crossing 15,000 for the first time today, it's on pace to cross its third 1,000 point threshold this year and the sixth since the pandemic began in early 2020. The table below lists each 1,000 point threshold that the Nasdaq has crossed over time along with the first day that it crossed that threshold, the number of days since the prior cross, what percentage that 1,000 point consists of relative to the prior threshold, and then how many upside and downside crosses the Nasdaq has had around that level on a closing basis.\n\n&gt; Of all the 1,000 point thresholds the Nasdaq has crossed over time, the only one that it never traded back below after crossing it was 6,000 back in April 2017. Besides 1,000, that was also the 1,000 point threshold that took the longest to cross above. After first crossing 5,000 back in March 2000, it took 6,256 days for the Nasdaq to top 6,000. Since then, though, the Nasdaq has been making quick work of 1,000 point thresholds. With the exception of the 486-day gap between 8K and 9K, every other 1,000-point threshold since 6,000 has taken less than a year to cross. Even in the midst of a global pandemic, it took the Nasdaq less than six months to get from 9,000 to 10,000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-Crosses.png))**\n\n&gt; The long-term chart of the Nasdaq below includes red dots to show each time the Nasdaq first crossed a 1,000 point threshold along with the number of days for each one.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-1000-Point-thresholds.png))**\n\n&gt; Looking at the chart above may give you a feeling of lightheadedness given the seemingly parabolic nature of the last few years. An important thing to keep in mind, though, is that as a percentage of the index's price level, every 1,000 point threshold represents a smaller move in percentage terms. While the move from 9K to 10K represented a move of over 11%, the move from 14K to 15K represents only a little more than 7%. Looking at this chart on a log scale where each label on the y-axis represents a doubling of the index shows how modest the recent 1,000 point thresholds have been relative to earlier ones. Think about it this way, in the less than two years between when the Nasdaq first crossed 2K to when it crossed 5K for the first time (four different 1,000 point thresholds), it rallied 150%. Over the last four years, though, the Nasdaq has crossed 10 different 1,000-point thresholds, but the gain has also only been 150%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-1000-Point-thresholds-Log-Scale.png))**\n\n*****\n\n&gt; # Bulls Head In Separate Directions\n\n&gt;As the major indices have set more record highs in the past week, bullish sentiment has rebounded. The American Association of Individual Investors' (AAII) weekly reading on bullish sentiment rose 6.4 percentage points to 39.4% this week. That is the highest reading of optimism since the week of July 8th when bullish sentiment was a hair above 40%. While recovered, that reading is still muted versus the past year's range and is only 1.5 percentage points above their historical average. In other words, bullish sentiment has rebounded but is far from elevated.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Bull.png))**\n\n&gt; While the AAII survey showed an increase in bullish sentiment, another survey of newsletter writers from Investors Intelligence saw the opposite result. This survey's reading on bullish sentiment dropped to just 50% this week which is the lowest level since May of last year. Although this reading has now fallen out of the past year's range, it is still slightly elevated versus the historical average of 45%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-II-Bull.png))**\n\n&gt; Given the uptick in bullish sentiment, the AAII survey saw only a third of respondents report as bearish versus 35.1% last week. Like bullish sentiment, this reading remains outside of the range it has occupied for most of the past year although that current reading is also not far away from the historical average of 30.5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Bear.png))**\n\n&gt; As we noted in last Thursday's Chart of the Day, the bull-bear spread dipped into negative territory last week for the first time since late January and it was at the lowest level since October 2020. With the inverse moves in bullish and bearish sentiment this week, the spread has moved back into positive territory to its highest level since the last week of July.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-BB-Spread.png))**\n\n&gt; Not all of the gains to bullish sentiment came from the bearish camp. Neutral sentiment saw an even larger decline of 4.2 percentage points. That brings the reading down to 27.5% which is the lowest reading since April 15th when it stood at just 21.6%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Neutral.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending August 27th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(LINK REMOVED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 8.29.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(LINK REMOVED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**TICKERS REMOVED.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/gzL4Eck.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/vkLERKx.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/jPhLbGO.png))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 8.30.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/JMueNPp.png))\n\n&gt; # ***Monday 8.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Tv2AZDN.png))\n\n*****\n\n&gt; # ***Tuesday  8.31.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/84mbmWL.png))\n\n&gt; # ***Tuesday 8.31.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/UIvsHKr.png))\n\n*****\n\n&gt; # ***Wednesday 9.1.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0zugFIh.png))\n\n&gt; # ***Wednesday 9.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TKW9fwy.png))\n\n*****\n\n&gt; # ***Thursday 9.2.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7WOTcax.png))\n\n&gt; # ***Thursday 9.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VhK9X0Y.png))\n\n*****\n\n&gt; # ***Friday 9.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.3.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Zoom Video Communications, Inc. $340.81\n**Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, August 30, 2021. The consensus earnings estimate is $1.16 per share on revenue of $990.96 million and the Earnings Whisper ® number is $1.25 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $1.14 to $1.15 per share on revenue of $985.00 million to $990.00 million. Consensus estimates are for year-over-year earnings growth of 39.76% with revenue increasing by 49.35%. The stock has drifted higher by 2.7% from its open following the earnings release to be 5.9% below its 200 day moving average of $362.10. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, August 17, 2021 there was some notable buying of 10,580 contracts of the $350.00 call and 10,573 contracts of the $350.00 put expiring on Friday, October 15, 2021. Option traders are pricing in a 8.8% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CrowdStrike, Inc. $282.31\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, August 31, 2021. The consensus earnings estimate is $0.09 per share on revenue of $323.16 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for earnings of $0.07 to $0.09 per share on revenue of $318.30 million to $324.40 million. Consensus estimates are for year-over-year earnings growth of 550.00% with revenue increasing by 62.42%. Short interest has decreased by 19.8% since the company's last earnings release while the stock has drifted higher by 30.1% from its open following the earnings release to be 32.2% above its 200 day moving average of $213.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, August 16, 2021 there was some notable buying of 3,330 contracts of the $200.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 7.8% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Futu Holdings Ltd $96.47\n**Futu Holdings Ltd (FUTU)** is confirmed to report earnings at approximately 4:00 AM ET on Tuesday, August 31, 2021. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Short interest has decreased by 4.4% since the company's last earnings release while the stock has drifted lower by 20.5% from its open following the earnings release to be 15.7% below its 200 day moving average of $114.41. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, July 27, 2021 there was some notable buying of 2,362 contracts of the $150.00 call expiring on Friday, September 17, 2021. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=FUTU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Li Auto Inc. $29.34\n**Li Auto Inc. (LI)** is confirmed to report earnings at approximately 4:00 AM ET on Monday, August 30, 2021. The consensus estimate is for a loss of $0.03 per share on revenue of $4.41 billion and the Earnings Whisper ® number is ($0.05) per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for revenue of $609.00 million to $651.70 million. Short interest has increased by 6.2% since the company's last earnings release while the stock has drifted higher by 45.6% from its open following the earnings release to be 0.5% above its 200 day moving average of $29.19. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, August 9, 2021 there was some notable buying of 3,006 contracts of the $28.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 8.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $88.11\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 1, 2021. The consensus estimate is for a loss of $0.01 per share on revenue of $2.20 billion and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 87.50% with revenue increasing by 29.42%. Short interest has increased by 7.7% since the company's last earnings release while the stock has drifted higher by 14.6% from its open following the earnings release to be 3.0% above its 200 day moving average of $85.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,235 contracts of the $82.00 put and 1,234 contracts of the $97.00 call expiring on Friday, September 3, 2021. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Akoustis Technologies, Inc. $9.99\n**Akoustis Technologies, Inc. (AKTS)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, August 30, 2021. The consensus estimate is for a loss of $0.16 per share on revenue of $2.50 million and the Earnings Whisper ® number is ($0.19) per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 15.79% with revenue increasing by 583.06%. Short interest has increased by 22.9% since the company's last earnings release while the stock has drifted lower by 13.0% from its open following the earnings release to be 12.2% below its 200 day moving average of $11.38. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,551 contracts of the $10.00 call expiring on Friday, September 17, 2021. Option traders are pricing in a 28.8% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=AKTS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Catalent, Inc. $129.85\n**Catalent, Inc. (CTLT)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, August 30, 2021. The consensus earnings estimate is $1.01 per share on revenue of $1.14 billion and the Earnings Whisper ® number is $1.05 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 18.82% with revenue increasing by 20.30%. Short interest has decreased by 26.4% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 19.2% above its 200 day moving average of $108.93. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CTLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cloudera, Inc. $15.95\n**Cloudera, Inc. (CLDR)** is confirmed to report earnings at approximately 7:05 AM ET on Monday, August 30, 2021. The consensus earnings estimate is $0.09 per share on revenue of $227.19 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 12.50% with revenue increasing by 6.00%. Short interest has decreased by 1.7% since the company's last earnings release while the stock has drifted higher by 0.1% from its open following the earnings release to be 12.6% above its 200 day moving average of $14.17. On Friday, August 27, 2021 there was some notable buying of 5,737 contracts of the $16.00 call expiring on Friday, September 3, 2021. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 11.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CLDR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # DocuSign $300.76\n**DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 2, 2021. The consensus earnings estimate is $0.39 per share on revenue of $487.50 million and the Earnings Whisper ® number is $0.42 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $479.00 million to $485.00 million. Consensus estimates are for year-over-year earnings growth of 550.00% with revenue increasing by 42.46%. Short interest has increased by 15.4% since the company's last earnings release while the stock has drifted higher by 43.3% from its open following the earnings release to be 25.4% above its 200 day moving average of $239.86. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, August 11, 2021 there was some notable buying of 1,911 contracts of the $250.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 9.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # ChargePoint Holdings, Inc. $21.24\n**ChargePoint Holdings, Inc. (CHPT)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 1, 2021. The consensus estimate is for a loss of $0.14 per share on revenue of $49.06 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for revenue of $46.00 million to $51.00 million. The stock has drifted lower by 22.5% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,534 contracts of the $30.00 call and 1,502 contracts of the $30.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 10.4% move on earnings and the stock has averaged a 7.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend a great trading week ahead r/stocks. :)",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning August 30th, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pd8wun/wall_street_week_ahead_for_the_trading_week/",
        "created": 1630182549.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1628619701,
        "id": "p1v23r",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "W￼ith Apple‘s iPhone typical fall launch is fast approaching, details about the device’s new capabilities have started to leak out.\n\nAs consumers and gadget fans pore over the tidbits for taste of what Apple’s (ticker: AAPL) latest pocket computetr will have in store, chip investors too are scrutinizing the trickle of information. In a Tuesday report, Bloomberg News said the new Apple phones will feature new video and camera features, a faster Apple-designed chip to power the gadget, and new screen technology. Apple will keep the same iPhone dimensions and designs as last year’s models, the report said.\n\nBased on the scarce available details, the exact makeup of the guts of the next line of iPhones is highly speculative at this point. But, investors know a few things already based on past designs and the bare-bones description. \n\nOne of the biggest changes in recent memory was the iPhone’s adoption of 5G technology, requiring a batch of new chips to support the fast uplink speed. For many phones, including Apple’s, that tended to mean much more silicon overall, which was good news for the chip makers that supply Apple with parts.\n\nFor the 5G modems themselves, the iPhone 12 contained chips made by Qualcomm (QCOM), which suggests it too will likely supply the iPhone’s 5G wireless chip—at least for now. Apple has reportedly launched its own effort to design wireless radios, so that may change in the future. The chip giant has made other chips for the iPhones such as power modules. \n\nSkyworks Solutions (SWKS) and Qorvo (QRVO) make radio-related iPhone components, too, and have both been historic suppliers. Broadcom (AVGO) also has made wireless chips and other iPhone components. Barclays chip analyst Blayne Curtis has staked Qorvo has his favorite of the batch of Apple suppliers he watches.\n\nFor the new camera, it’s possible Texas Instruments (TXN) could play a role, as it has supplied the power-management chip for previous iterations of the iPhone camera. Its chips that help with battery-charging have also been spotted in past phones.\n\nMemory-wise, according to an iFixit teardown, the last iPhone used random access memory made by Micron Technology (MU). Micron has said the 5G upgrade cycle has benefited it because new generation phones typically carry more RAM than their 4G counterparts. The iPhone 12’s flash storage was produced by closely held Kioxia Holdings, a Japanese memory maker that has been considering an initial public offering in recent months.\n\nWe know Apple is designing the chips that power its phones, and has for several generations, effectively cutting out Qualcomm from the processor part of iPhone revenue. Taiwan \nSemiconductor Manufacturing (TSM), has made the chip in the past, and it is all but certain to be making the latest iPhone processors.\n\nSource: Barron's\n\nSome of the semi stocks mentioned in this article are still worth to buy. qcom, tsm, mu, skws and qrvo are all trading between 20 to 30 pe. The revenue growth for these stocks are still attractive. With apple releasing the new iphones at September, these stocks will definitely benefit from the ongoing 5G trend.",
        "subreddit": "stocks",
        "title": "Apple Suppliers That Could Benefit New iPhone Models",
        "url": "https://www.reddit.com/r/stocks/comments/p1v23r/apple_suppliers_that_could_benefit_new_iphone/",
        "created": 1628648501.0
    },
    {
        "author": "kribz666",
        "created_utc": 1630185150,
        "id": "pdi2bn",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**\\[Long post with ALL stocks releasing earnings this week\\]**\n\n&amp;#x200B;\n\n# Consumer Cyclical \n\n[$SCVL release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 928M$ - historic mvts around earnings: average 13.2% - std dev. 8.2% - last 11.1% \n\n[$HRB release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 4.58B$ - historic mvts around earnings: average 9.6% - std dev. 4.8% - last 8.7%\n\n[$CAL release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 995M$ - historic mvts around earnings: average 12.2% - std dev. 8.0% - last 19.5% \n\n$RGS release on 2021-08-30 - Market cap: 369M$ - historic mvts around earnings: average 11.2% - std dev. 6.2% - last 25.9% \n\n$FIVE release on 2021-08-31 - Market cap: 10.4B$ - historic mvts around earnings: average 8.2% - std dev. 6.4% - last 4.3% \n\n$DXLG release on 2021-08-31 - Market cap: 233M$ - historic mvts around earnings: average 22.9% - std dev. 14.9% - last 30.8% \n\n$M release on 2021-08-31 - Market cap: 5.72B$ - historic mvts around earnings: average 9.6% - std dev. 5.3% - last 5.7%\n\n$GES release on 2021-08-31 - Market cap: 1.74B$ - historic mvts around earnings: average 22.3% - std dev. 41.2% - last 8.8% \n\n$PVH release on 2021-08-31 - Market cap: 7.72B$ - historic mvts around earnings: average 7.6% - std dev. 5.4% - last 4.0% \n\n$JILL release on 2021-09-01 - Market cap: 219M$ - historic mvts around earnings: average 21.9% - std dev. 13.4% - last 20.1% \n\n$CONN release on 2021-09-01 - Market cap: 819M$ - historic mvts around earnings: average 20.6% - std dev. 7.1% - last 33.2% \n\n$VRA release on 2021-09-01 - Market cap: 419M$ - historic mvts around earnings: average 15.5% - std dev. 10.3% - last 11.4% \n\n$HOV release on 2021-09-01 - Market cap: 576M$ - historic mvts around earnings: average 14.1% - std dev. 9.0% - last 14.5% \n\n$HOFT release on 2021-09-01 - Market cap: 464M$ - historic mvts around earnings: average 12.5% - std dev. 6.0% - last 19.4% \n\n$HOME release on 2021-09-01 - Market cap: 2.34B$ - historic mvts around earnings: average 17.9% - std dev. 14.2% - last 3.0% \n\n$CTHR release on 2021-09-01 - Market cap: 78.3M$ - historic mvts around earnings: average 18.3% - std dev. 11.3% - last 23.8% \n\n$SIG release on 2021-09-01 - Market cap: 3.82B$ - historic mvts around earnings: average 17.2% - std dev. 9.1% - last 25.6% \n\n$GCO release on 2021-09-01 - Market cap: 866M$ - historic mvts around earnings: average 16.7% - std dev. 8.9% - last 7.3% \n\n$KIRK release on 2021-09-01 - Market cap: 334M$ - historic mvts around earnings: average 21.1% - std dev. 12.7% - last 5.3% \n\n$DBI release on 2021-09-01 - Market cap: 1.19B$ - historic mvts around earnings: average 13.6% - std dev. 9.0% - last 8.9% \n\n$OXM release on 2021-09-02 - Market cap: 1.74B$ - historic mvts around earnings: average 8.7% - std dev. 6.1% - last 19.9% \n\n$TLYS release on 2021-09-02 - Market cap: 482M$ - historic mvts around earnings: average 15.7% - std dev. 9.2% - last 5.0% \n\n# Technology \n\n[$SCSC release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 758M$ - historic mvts around earnings: average 10.6% - std dev. 5.1% - last 5.9% \n\n[$STNE release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 19.7B$ - historic mvts around earnings: average 12.7% - std dev. 6.5% - last 4.5% \n\n$GWRE release on 2021-08-31 - Market cap: 9.38B$ - historic mvts around earnings: average 6.5% - std dev. 3.7% - last 4.5% \n\n$MDB release on 2021-08-31 - Market cap: 21.1B$ - historic mvts around earnings: average 11.2% - std dev. 6.5% - last 18.0% \n\n$CLDR release on 2021-08-31 - Market cap: 4.62B$ - historic mvts around earnings: average 15.5% - std dev. 10.2% - last 21.0% \n\n$PD release on 2021-08-31 - Market cap: 3.43B$ - historic mvts around earnings: average 13.5% - std dev. 8.3% - last 12.6% \n\n$CRWD release on 2021-08-31 - Market cap: 51.3B$ - historic mvts around earnings: average 11.2% - std dev. 6.4% - last 4.0% \n\n$AMBA release on 2021-08-31 - Market cap: 3.81B$ - historic mvts around earnings: average 10.7% - std dev. 5.8% - last 2.8% \n\n$ZUO release on 2021-08-31 - Market cap: 1.95B$ - historic mvts around earnings: average 12.2% - std dev. 8.7% - last 6.3% \n\n$NTNX release on 2021-09-01 - Market cap: 7.73B$ - historic mvts around earnings: average 12.4% - std dev. 10.9% - last 4.4% \n\n$DOMO release on 2021-09-01 - Market cap: 2.3B$ - historic mvts around earnings: average 16.8% - std dev. 10.3% - last 5.9% \n\n$MDLA release on 2021-09-01 - Market cap: 4.94B$ - historic mvts around earnings: average 12.6% - std dev. 7.4% - last 16.8%\n\n $AVGO release on 2021-09-01 - Market cap: 193B$ - historic mvts around earnings: average 5.9% - std dev. 3.6% - last 3.3% \n\n$YEXT release on 2021-09-01 - Market cap: 1.79B$ - historic mvts around earnings: average 11.3% - std dev. 5.8% - last 18.9% \n\n$MEI release on 2021-09-02 - Market cap: 1.88B$ - historic mvts around earnings: average 8.1% - std dev. 4.9% - last 2.7% \n\n$SAIC release on 2021-09-02 - Market cap: 5.49B$ - historic mvts around earnings: average 9.4% - std dev. 5.5% - last 4.9% \n\n$DOCU release on 2021-09-02 - Market cap: 49.1B$ - historic mvts around earnings: average 9.6% - std dev. 5.2% - last 21.3% \n\n# Healthcare \n\n[$CDMO release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 1.42B$ - historic mvts around earnings: average 19.2% - std dev. 10.7% - last 9.4%\n\n[$CTLT release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 18.6B$ - historic mvts around earnings: average 8.1% - std dev. 5.5% - last 8.6% \n\n$BMRA release on 2021-08-30 - Market cap: 50.4M$ - historic mvts around earnings: average 12.2% - std dev. 7.6% - last 7.9%\n\n$ADMP release on 2021-08-30 - Market cap: 144M$ - historic mvts around earnings: average 10.2% - std dev. 5.6% - last 6.4% \n\n$IMTX release on 2021-09-01 - Market cap: 755M$ - historic mvts around earnings: average 5.6% - std dev. 3.4% - last 3.7% \n\n$PHR release on 2021-09-01 - Market cap: 2.83B$ - historic mvts around earnings: average 10.1% - std dev. 5.9% - last 12.4% \n\n$PDCO release on 2021-09-01 - Market cap: 3.47B$ - historic mvts around earnings: average 9.7% - std dev. 7.0% - last 8.2% \n\n$MSON release on 2021-09-01 - Market cap: 402M$ - historic mvts around earnings: average 11.9% - std dev. 7.4% - last 10.9% \n\n$BYSI release on 2021-09-01 - Market cap: 445M$ - historic mvts around earnings: average 11.5% - std dev. 7.7% - last 10.5% \n\n$COO release on 2021-09-02 - Market cap: 18.5B$ - historic mvts around earnings: average 5.4% - std dev. 3.1% - last 1.4% \n\n# Real Estate \n\n[$LEJU release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 282M$ - historic mvts around earnings: average 13.3% - std dev. 7.9% - last 13.2% \n\n# Communication Services \n\n[$ZM release on 2021-08-30](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 106B$ - historic mvts around earnings: average 17.0% - std dev. 12.5% - last 4.3%\n\n[$OOMA release on 2021-09-02](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 544M$ - historic mvts around earnings: average 13.1% - std dev. 8.4% - last 19.7% \n\n# Basic Materials \n\n[$GSM release on 2021-08-31](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 918M$ - historic mvts around earnings: average 17.2% - std dev. 22.4% - last 13.2% \n\n[$SYNL release on 2021-09-01](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 102M$ - historic mvts around earnings: average 8.1% - std dev. 4.3% - last 6.0% \n\n# Industrials \n\n[$MTRX release on 2021-08-31](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 300M$ - historic mvts around earnings: average 13.5% - std dev. 8.3% - last 12.4% \n\n[$DY release on 2021-08-31](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 2.43B$ - historic mvts around earnings: average 15.1% - std dev. 8.4% - last 15.3% \n\n$CPRT release on 2021-08-31 - Market cap: 29.7B$ - historic mvts around earnings: average 6.4% - std dev. 5.1% - last 2.5% \n\n$KFY release on 2021-09-01 - Market cap: 3.66B$ - historic mvts around earnings: average 11.1% - std dev. 6.7% - last 9.1% \n\n$NX release on 2021-09-01 - Market cap: 877M$ - historic mvts around earnings: average 8.7% - std dev. 6.7% - last 4.7% \n\n$DCI release on 2021-09-01 - Market cap: 7.87B$ - historic mvts around earnings: average 6.5% - std dev. 3.5% - last 3.2% \n\n$GMS release on 2021-09-01 - Market cap: 1.84B$ - historic mvts around earnings: average 8.4% - std dev. 5.1% - last 4.9% \n\n$SWBI release on 2021-09-01 - Market cap: 1.1B$ - historic mvts around earnings: average 13.4% - std dev. 11.2% - last 20.8% \n\n$TTC release on 2021-09-01 - Market cap: 11.4B$ - historic mvts around earnings: average 6.1% - std dev. 2.8% - last 4.0%\n\n $SPCB release on 2021-09-01 - Market cap: 28.8M$ - historic mvts around earnings: average 16.0% - std dev. 12.3% - last 2.4%\n\n $HURC release on 2021-09-02 - Market cap: 240M$ - historic mvts around earnings: average 8.2% - std dev. 4.2% - last 13.1% \n\n# Energy \n\n[$KLXE release on 2021-08-31](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 79.3M$ - historic mvts around earnings: average 23.6% - std dev. 15.8% - last 30.6%\n\n# Consumer Defensive \n\n[$CPB release on 2021-09-01](https://earnings-watcher.tech/#/company?symbol=SCVL) \\- Market cap: 13.7B$ - historic mvts around earnings: average 6.1% - std dev. 3.3% - last 3.5%",
        "subreddit": "smallstreetbets",
        "title": "All Stocks Reporting Earnings This Week (by Sector and Market Cap)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/pdi2bn/all_stocks_reporting_earnings_this_week_by_sector/",
        "created": 1630213950.0
    },
    {
        "author": "theJimmybob",
        "created_utc": 1630162200,
        "id": "pdb4xp",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "# Some implied moves for #earnings next week:\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n* **$DOCU 8.4%**\n* **$AVGO 3.9%**\n* **$HPE 5.2%**\n* **$MDB 8.9%**\n* **$ZM 8.6%**\n* **$LI 8.7%**\n* **$CHWY 8.3%**\n* **$AI 15.4%**\n* **$SWBI 13.9%**\n* **$OKTA 6.5%**\n* **$FIVE 7.0%**\n* **$STNE 9.7%**\n* **$NDSN 5.5%**\n* **$FUTU 12.2%**\n* **$NTES 6.9%**\n* **$CHS 14.8%**\n* **$CRWD 7.6%**\n* **$AMBA 8.9%**\n* **$PLAN 12.2%**\n* **$PVH 9.7%**\n* **$CPB 4.7%**\n* **$VRA 14.2%**\n* **$CONN 16.5%**\n* **$DY 12.5%**\n* **$VEEV 7.0%**\n* **$CHPT 9.9%**\n* **$NTNX 10.6%**\n* **$SMTC 7.5%**\n* **$SIG 13.3%**\n* **$AEO 8.7%**\n* **$PDCO 8.7%**\n* **$LE 17.2%**\n* **$PD 13.2%**\n* **$YEXT 12.9%**",
        "subreddit": "wallstreetbets",
        "title": "Some implied moves for #earnings next week:",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdb4xp/some_implied_moves_for_earnings_next_week/",
        "created": 1630191000.0
    },
    {
        "author": "HedgingDelta",
        "created_utc": 1630329765,
        "id": "pehzh6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "AVGO Earnings Possibilities",
        "url": "https://i.redd.it/6vecl6fpxhk71.png",
        "created": 1630358565.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1630153541,
        "id": "pd8v8x",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning August 30th, 2021.\n\n# **A key jobs report in the week ahead could drive the next big market move - [(Source)](https://www.cnbc.com/2021/08/27/a-key-jobs-report-in-the-week-ahead-could-drive-the-next-big-market-move.html)**\n*****\n&gt; With Jackson Hole in the rear-view mirror, August’s employment report could be the next driver for markets.\n*****\n&gt; Stocks gained in the past week, surging again to new highs Friday after a speech by Federal Reserve Chairman Jerome Powell. The chairman acknowledged that Fed officials expect to taper back their $120 billion a month bond-buying program this year, a first step toward reversing easy policy.\n*****\n&gt; Powell was speaking at the Kansas City Fed’s annual Jackson Hole, Wyo. symposium, held virtually this year. He said the Fed has seen sufficient progress on inflation, but the labor market has not yet improved enough to start the taper. Importantly, he also emphasized that the wind down of the bond program does not mean the Fed will automatically move on to raise interest rate hikes.\n*****\n&gt; “Powell has made it clear the Fed is not prepared to raise interest rates anytime soon. The market seems relieved by that. … With some of the economic data already slowing, I think interest rate hikes are far, far away, and investors are happy about that,” said Michael Arone, chief investment strategist for the US SPDR business at State Street Global Advisors.\n*****\n&gt; Arone said the Fed has so far avoided a “taper tantrum,” similar to the 2013 market sell-off when the Fed announced it was rolling back quantitative easing. Powell’s speech was widely anticipated to clarify the Fed’s position on its $120 billion monthly bond purchases, after a number of Fed officials called for the start of a wind down.\n*****\n&gt; # Jobs are the focal point\n*****\n&gt; Now, market focus shifts even more fiercely to jobs data, with the release Friday of the August employment report.\n*****\n&gt; “For sure, the market is going to react,” said Jim Caron, head of macro strategies for global fixed income at Morgan Stanley Investment Management. “I think it’s important. I think the issue that they’re going to have is unemployment benefits don’t really run out until the beginning of September. It’s really not until you get the October jobs number that you get a more free look at September.”\n*****\n&gt; The dollar index sank after Powell’s Friday morning speech, as stocks rallied to new highs and Treasury yields fell. Other data in the coming week includes consumer confidence Tuesday and Wednesday’s release of Institute for Supply Management manufacturing data and ADP’s private sector payroll data, a kind of preview for Friday’s government jobs report.\n*****\n&gt; “I wouldn’t be surprised to see follow-through Monday and Tuesday, but ahead of ADP on Wednesday, I’d look for position adjusting which means weaker stocks and weaker bonds and stronger dollar ahead of the jobs data,” said Marc Chandler, chief market strategist at Bannockburn Global Forex.\n*****\n&gt; He said Powell was dovish, as expected, while still emphasizing that tapering was coming. But the key for markets was that he stressed the end of the program does not mean “tightening” or rate hikes. The 10-year Treasury yield had risen above 1.35% this week, but fell to 1.3% after Powell spoke Friday.\n*****\n&gt; # U.S. 10-year Treasury yield\n*****\n&gt; “The market will get cautious again ahead of the jobs data. Then it’s a new world into September. You have to wait until after the jobs data to see if these moves have sustaining power. This is ‘a buy the rumor, sell the fact’ move,” Chandler said.\n*****\n&gt; Some market pros had expected an announcement on tapering from the Fed at its September meeting, but that view has now mostly changed to a November or December announcement. “Because of the uncertainty of delta, I think it will take more than the next jobs report,” said Diane Swonk, chief economist at Grant Thornton. “The disruption to jobs in particular is if schools have to close again.”\n*****\n&gt; Economists polled by Dow Jones expect 750,000 jobs were created in August and the unemployment rate fell to 5.2%. In July, the economy created 943,000 jobs and unemployment slid to 5.4%. Education was a big contributor in July, with 261,000 jobs added in public schools and private education.\n*****\n&gt; “It doesn’t have to be a spectacular number to satisfy their needs,” said Swonk of the August report. “You need a solid jobs number, something north of a half million... I think we’re going to be close to that. They’re going to want to see September employment as well.”\n*****\n&gt; # Market risks\n*****\n&gt; State Street’s Arone said the Fed’s discussion of the tapering will be top of mind in the markets, just as the next earnings season rolls around.\n*****\n&gt; “It will be interesting at a time when the Fed starts taking its foot off the pedal,” he said. “Right now, the bull case continues to be reasonably strong, but markets don’t go straight up. If I was going to key on a specific risk, I’d keep an eye on third quarter earnings reports, and more importantly what corporate executives are saying about next year.”\n*****\n&gt; Arone said strong earnings has been the biggest driver of market gains, helping investors ignore worries about the spread of the Covid delta variant, the U.S. withdrawal from Afghanistan, and dysfunction in Washington.\n*****\n&gt; The market’s summer rally continued in the past week, with the Dow ending at 35,455, up just about 1% for the week. The S&amp;P 500 and Nasdaq both ended the week at record highs.\n*****\n&gt; The S&amp;P 500 was up 1.5% at 4,509, and the Nasdaq rose 2.8% to 15,129.\n*****\n&gt; “The market has been able to ignore all this noise and rally,” he said, adding it would be ironic if it were earnings that caused a sell-off and not a Fed policy change or something else.\n*****\n&gt; He said the market could get choppy in September and into October, a seasonally weak time of year for stocks.\n*****\n&gt; “We caught a glimpse of this this quarter, with big tech — where the numbers were beating, but they suggested that future quarters would see slower growth,” Arone said. “Investors didn’t like that, and I think it gave us a glimpse of what happens if it spreads beyond the technology sector to other sectors.”\n*****\n&gt; There are a few earnings in the coming week, including Zoom Video Monday, Campbell Soup Wednesday, and Hewlett Packard and Broadcom Thursday.\n*****\n&gt; # Watching Ida\n*****\n&gt; The oil and gas industry is closely watching Hurricane Ida, which was heading straight for Louisiana. Oil, gasoline and natural gas all rallied Friday, as energy companies shut down Gulf of Mexico production ahead of the storm. Louisiana is also home to a number of refineries.\n*****\n&gt; West Texas Intermediate futures settled up nearly 2% Friday, at $68.74 per barrel. The benchmark U.S. crude was up more than 10% for the week, its best weekly gain since June 5, 2020.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/didTIRh.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/Ix151Zj.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/QVpHWsA.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/KT1s80n.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/E2AuWSX.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/7RNC2XB.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/puSwYZx.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JHQ3zsL.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wAgKTB0.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/gzL4Eck.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/wLwUeqE.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/Pgih5dk.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/1qQ8hq7.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/gzDuu8v.png))**\n\n*****\n\n&gt; # Small Cap Labor Day Rally Getting Underway\n\n&gt; In the below chart, daily data since July 1, 1979 through August 20, 2021 for the Russell 2000 index of smaller companies are divided by the Russell 1000 index of largest companies, and then compressed into a single year to show an idealized yearly pattern. When the graph is descending, large-cap companies are outperforming small-cap companies; when the graph is rising, smaller companies are moving up faster than their larger brethren. The most prominent period of outperformance generally begins in mid-December and lasts until late-February or early March with a surge in January. This period of outperformance by small-caps is known as the “January Effect” in the annual Stock Trader’s Almanac.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/ee23ad03da0bcf4a9f8869976521a446/51d39e9e109dc4da-47/s500x750/7dc9cb9b15e57125a71f2475fad23ab6ccd1423e.jpg))**\n\n&gt; In recent years, another sizable move is quite evident just before Labor Day. One possible explanation for this move is individual investors begin to return to work after summertime vacations and are searching for “bargain” stocks. In a typical year, small-caps would have been lagging and could represent an opportunity relative to other large-cap possibilities. As of today’s close, Russell 2000 is up 13.4% compared to the Russell 1000 being up 19.0% year-to-date. Lagging small-caps and resilient U.S. consumers could be the ideal setup for a repeat of this pattern this year. However, the small-cap advantage does historically wane around mid-September.\n\n*****\n\n&gt; # Small-Caps Bounce\n\n&gt; ln today's Morning Lineup, we noted the inverse correlation between performance this week and market caps. As shown in the major US Indices screen of our Trend Analyzer tool, the two best performers over the past five days have been Micro-Caps (IWC) followed by small caps like the Russell 2000 (IWM) and the Core S&amp;P Small-Cap ETF (IJR). Mid-cap ETFs are the next best performers with high 2% gains then most large cap indices have only risen around 1.5% this week with the exception of the Dow (DIA) which has not even gained 1%. As for where these indices are trading relative to each one's trading range, it is partially a mean reversion story. Small caps were deeply oversold one week ago and are now sitting just below their 50-DMAs. While not to as extreme of a degree, mid-caps were similarly trading a full standard deviation below their 50-DMAs last week. Today, they are on the opposite side of their 50-DMAs and on the verge of overbought readings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/indices0827.png))**\n\n&gt; As previously mentioned, small caps like the Micro-Cap ETF (IWC) and Russell 2000 ETF (IWM) were oversold last week. From a charting perspective, each of these indices' rallies this week are not only bounces from extreme oversold levels, but they also follow brief dips below their 200-DMAs. But whereas the past five days have seen solid gains, yesterday saw IWC and IWM reject their 50-DMAs and the high end of their ranges that have been in place since late July. In other words, even though small caps have led the market this week, they are not out of the woods yet.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWC.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWM.png))**\n\n&gt; Looking at the relative strength lines of small caps like IWC and IWM versus the large cap S&amp;P 500 (SPY) over the past year, the past week's outperformance again is a blip on the radar and has only put a small dent in the longer term trend of underperformance.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-Small-v-Large2.png))**\n\n&gt; Where that is not necessarily the case is small market caps versus the smallest market caps. As shown below, the relative strength line of the Micro-Cap ETF (IWC) versus the Russell 2000 (IWM) broke out of the past few months' downtrend over the past few days.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082721-IWC-vs-IWM2.png))**\n\n*****\n\n&gt; # 6 Charts on Stocks Making New All-Time Highs\n\n&gt; The S&amp;P 500 Index made yet another new all-time high yesterday, the 50th on the year. “The all-time record for any one year is 77 S&amp;P 500 new all-time highs back in 1995,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Incredibly, 2021 is currently on pace for 78 new highs. There’s a long way to go, but this has been an amazing year and this is yet another way to show it.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-1.png?ssl=1))**\n\n&gt; As impressive as 50 new highs is, investors need to remember that new highs happen in clusters that can last decades. We’ve been sharing this chart for years, saying exactly that: previous periods of new highs lasted much longer than most expected. Mark Twain said history doesn’t repeat itself, but it often rhymes. If history rhymes once again, we could still have several more years of new highs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-2.png?ssl=1))**\n\n&gt; Another interesting stat about S&amp;P 500 all-time highs is every month so far in 2021 has seen a new high, 8 for 8. Only once have all 12 months made a new all-time high and that was in 2014. This is somewhat surprising, given the S&amp;P 500 gained only 11.4% in 2014, but it was a very slow and persistent move. Most investors (including this author) would guess it was 1995, but that spectacular year saw new highs in ‘only’ 10 months.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-3.png?ssl=1))**\n\n&gt; Although August tends to be historically weak for stocks, that hasn’t been the case this year. In fact, the S&amp;P 500 has made an incredible 9 new highs already this month, the most since 1929. No, we don’t think this is another 1929, but this is just another way to show how astounding this bull run has been.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-4.png?ssl=1))**\n\n&gt; As shown in the LPL Chart of the Day, 50 new S&amp;P 500 all-time highs before the end of August is quite a feat. In fact, only twice has the 50 level been cracked through the end of August, in 1964 and 1995.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-5.png?ssl=1))**\n\n&gt; So what happens next? The rest of the year in 1964 the S&amp;P 500 added 3.6%, while it added 9.6% in 1995. Below we looked at all the years with at least 30 new all-time highs through August and sure enough, better than average returns the rest of the year are common. The final 4 months gained 4.7%, versus the average final 4 months gain for all years of 3.6%. Now this is skewed due to 1987s crash, as that was the only time stocks were lower the final 4 months after more than 30 new highs by the end of August. Smoothing things out, the median return jumps up to a very impressive 5.4%, versus a median return of 3.6% for all years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/08/Blog-8.25.21-6.png?ssl=1))**\n\n&gt; 2021 is off to a roaring start and we continue to expect higher prices before all is said and done. The studies we did today do little to change our view. We’d use any potential weakness as an opportunity to add before potential higher prices.\n\n*****\n\n&gt; # Nasdaq Crosses Another 1,000 Point Threshold\n\n&gt; It won't be official until the close, but with the Nasdaq crossing 15,000 for the first time today, it's on pace to cross its third 1,000 point threshold this year and the sixth since the pandemic began in early 2020. The table below lists each 1,000 point threshold that the Nasdaq has crossed over time along with the first day that it crossed that threshold, the number of days since the prior cross, what percentage that 1,000 point consists of relative to the prior threshold, and then how many upside and downside crosses the Nasdaq has had around that level on a closing basis.\n\n&gt; Of all the 1,000 point thresholds the Nasdaq has crossed over time, the only one that it never traded back below after crossing it was 6,000 back in April 2017. Besides 1,000, that was also the 1,000 point threshold that took the longest to cross above. After first crossing 5,000 back in March 2000, it took 6,256 days for the Nasdaq to top 6,000. Since then, though, the Nasdaq has been making quick work of 1,000 point thresholds. With the exception of the 486-day gap between 8K and 9K, every other 1,000-point threshold since 6,000 has taken less than a year to cross. Even in the midst of a global pandemic, it took the Nasdaq less than six months to get from 9,000 to 10,000.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-Crosses.png))**\n\n&gt; The long-term chart of the Nasdaq below includes red dots to show each time the Nasdaq first crossed a 1,000 point threshold along with the number of days for each one.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-1000-Point-thresholds.png))**\n\n&gt; Looking at the chart above may give you a feeling of lightheadedness given the seemingly parabolic nature of the last few years. An important thing to keep in mind, though, is that as a percentage of the index's price level, every 1,000 point threshold represents a smaller move in percentage terms. While the move from 9K to 10K represented a move of over 11%, the move from 14K to 15K represents only a little more than 7%. Looking at this chart on a log scale where each label on the y-axis represents a doubling of the index shows how modest the recent 1,000 point thresholds have been relative to earlier ones. Think about it this way, in the less than two years between when the Nasdaq first crossed 2K to when it crossed 5K for the first time (four different 1,000 point thresholds), it rallied 150%. Over the last four years, though, the Nasdaq has crossed 10 different 1,000-point thresholds, but the gain has also only been 150%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082421-Nasdaq-1000-Point-thresholds-Log-Scale.png))**\n\n*****\n\n&gt; # Bulls Head In Separate Directions\n\n&gt;As the major indices have set more record highs in the past week, bullish sentiment has rebounded. The American Association of Individual Investors' (AAII) weekly reading on bullish sentiment rose 6.4 percentage points to 39.4% this week. That is the highest reading of optimism since the week of July 8th when bullish sentiment was a hair above 40%. While recovered, that reading is still muted versus the past year's range and is only 1.5 percentage points above their historical average. In other words, bullish sentiment has rebounded but is far from elevated.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Bull.png))**\n\n&gt; While the AAII survey showed an increase in bullish sentiment, another survey of newsletter writers from Investors Intelligence saw the opposite result. This survey's reading on bullish sentiment dropped to just 50% this week which is the lowest level since May of last year. Although this reading has now fallen out of the past year's range, it is still slightly elevated versus the historical average of 45%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-II-Bull.png))**\n\n&gt; Given the uptick in bullish sentiment, the AAII survey saw only a third of respondents report as bearish versus 35.1% last week. Like bullish sentiment, this reading remains outside of the range it has occupied for most of the past year although that current reading is also not far away from the historical average of 30.5%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Bear.png))**\n\n&gt; As we noted in last Thursday's Chart of the Day, the bull-bear spread dipped into negative territory last week for the first time since late January and it was at the lowest level since October 2020. With the inverse moves in bullish and bearish sentiment this week, the spread has moved back into positive territory to its highest level since the last week of July.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-BB-Spread.png))**\n\n&gt; Not all of the gains to bullish sentiment came from the bearish camp. Neutral sentiment saw an even larger decline of 4.2 percentage points. That brings the reading down to 27.5% which is the lowest reading since April 15th when it stood at just 21.6%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/08/082621-AAII-Neutral.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending August 27th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=flru09LrTcw))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 8.29.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=_LcBq9NfjhI))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$ZM $CRWD $FUTU $LI $CHWY $AKTS $CTLT $CLDR $DOCU $CHPT $AEO $NTES $AVGO $AI $STNE $SWBI $OKTA $DBI $FIVE $SIG $CHS $NDSN $VEEV $BNR $PLAN $PVH $SOL $ASAN $CIEN $AMBA $CPB $DAO $AMWD $CONN $MCFT $NTNX $CAL $VRA $TTC $REX $DOOO**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/gzL4Eck.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/vkLERKx.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/jPhLbGO.png))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 8.30.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/JMueNPp.png))\n\n&gt; # ***Monday 8.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Tv2AZDN.png))\n\n*****\n\n&gt; # ***Tuesday  8.31.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/84mbmWL.png))\n\n&gt; # ***Tuesday 8.31.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/UIvsHKr.png))\n\n*****\n\n&gt; # ***Wednesday 9.1.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/0zugFIh.png))\n\n&gt; # ***Wednesday 9.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/TKW9fwy.png))\n\n*****\n\n&gt; # ***Thursday 9.2.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7WOTcax.png))\n\n&gt; # ***Thursday 9.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/VhK9X0Y.png))\n\n*****\n\n&gt; # ***Friday 9.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 9.3.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Zoom Video Communications, Inc. $340.81\n**Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, August 30, 2021. The consensus earnings estimate is $1.16 per share on revenue of $990.96 million and the Earnings Whisper ® number is $1.25 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $1.14 to $1.15 per share on revenue of $985.00 million to $990.00 million. Consensus estimates are for year-over-year earnings growth of 39.76% with revenue increasing by 49.35%. The stock has drifted higher by 2.7% from its open following the earnings release to be 5.9% below its 200 day moving average of $362.10. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, August 17, 2021 there was some notable buying of 10,580 contracts of the $350.00 call and 10,573 contracts of the $350.00 put expiring on Friday, October 15, 2021. Option traders are pricing in a 8.8% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # CrowdStrike, Inc. $282.31\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, August 31, 2021. The consensus earnings estimate is $0.09 per share on revenue of $323.16 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for earnings of $0.07 to $0.09 per share on revenue of $318.30 million to $324.40 million. Consensus estimates are for year-over-year earnings growth of 550.00% with revenue increasing by 62.42%. Short interest has decreased by 19.8% since the company's last earnings release while the stock has drifted higher by 30.1% from its open following the earnings release to be 32.2% above its 200 day moving average of $213.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, August 16, 2021 there was some notable buying of 3,330 contracts of the $200.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 7.8% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Futu Holdings Ltd $96.47\n**Futu Holdings Ltd (FUTU)** is confirmed to report earnings at approximately 4:00 AM ET on Tuesday, August 31, 2021. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Short interest has decreased by 4.4% since the company's last earnings release while the stock has drifted lower by 20.5% from its open following the earnings release to be 15.7% below its 200 day moving average of $114.41. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, July 27, 2021 there was some notable buying of 2,362 contracts of the $150.00 call expiring on Friday, September 17, 2021. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 7.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=FUTU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Li Auto Inc. $29.34\n**Li Auto Inc. (LI)** is confirmed to report earnings at approximately 4:00 AM ET on Monday, August 30, 2021. The consensus estimate is for a loss of $0.03 per share on revenue of $4.41 billion and the Earnings Whisper ® number is ($0.05) per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat The company's guidance was for revenue of $609.00 million to $651.70 million. Short interest has increased by 6.2% since the company's last earnings release while the stock has drifted higher by 45.6% from its open following the earnings release to be 0.5% above its 200 day moving average of $29.19. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, August 9, 2021 there was some notable buying of 3,006 contracts of the $28.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 8.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $88.11\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 1, 2021. The consensus estimate is for a loss of $0.01 per share on revenue of $2.20 billion and the Earnings Whisper ® number is $0.03 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 87.50% with revenue increasing by 29.42%. Short interest has increased by 7.7% since the company's last earnings release while the stock has drifted higher by 14.6% from its open following the earnings release to be 3.0% above its 200 day moving average of $85.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,235 contracts of the $82.00 put and 1,234 contracts of the $97.00 call expiring on Friday, September 3, 2021. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Akoustis Technologies, Inc. $9.99\n**Akoustis Technologies, Inc. (AKTS)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, August 30, 2021. The consensus estimate is for a loss of $0.16 per share on revenue of $2.50 million and the Earnings Whisper ® number is ($0.19) per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 15.79% with revenue increasing by 583.06%. Short interest has increased by 22.9% since the company's last earnings release while the stock has drifted lower by 13.0% from its open following the earnings release to be 12.2% below its 200 day moving average of $11.38. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,551 contracts of the $10.00 call expiring on Friday, September 17, 2021. Option traders are pricing in a 28.8% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=AKTS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Catalent, Inc. $129.85\n**Catalent, Inc. (CTLT)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, August 30, 2021. The consensus earnings estimate is $1.01 per share on revenue of $1.14 billion and the Earnings Whisper ® number is $1.05 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 18.82% with revenue increasing by 20.30%. Short interest has decreased by 26.4% since the company's last earnings release while the stock has drifted higher by 19.7% from its open following the earnings release to be 19.2% above its 200 day moving average of $108.93. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CTLT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cloudera, Inc. $15.95\n**Cloudera, Inc. (CLDR)** is confirmed to report earnings at approximately 7:05 AM ET on Monday, August 30, 2021. The consensus earnings estimate is $0.09 per share on revenue of $227.19 million and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 12.50% with revenue increasing by 6.00%. Short interest has decreased by 1.7% since the company's last earnings release while the stock has drifted higher by 0.1% from its open following the earnings release to be 12.6% above its 200 day moving average of $14.17. On Friday, August 27, 2021 there was some notable buying of 5,737 contracts of the $16.00 call expiring on Friday, September 3, 2021. Option traders are pricing in a 17.9% move on earnings and the stock has averaged a 11.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CLDR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # DocuSign $300.76\n**DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 2, 2021. The consensus earnings estimate is $0.39 per share on revenue of $487.50 million and the Earnings Whisper ® number is $0.42 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $479.00 million to $485.00 million. Consensus estimates are for year-over-year earnings growth of 550.00% with revenue increasing by 42.46%. Short interest has increased by 15.4% since the company's last earnings release while the stock has drifted higher by 43.3% from its open following the earnings release to be 25.4% above its 200 day moving average of $239.86. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, August 11, 2021 there was some notable buying of 1,911 contracts of the $250.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 9.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # ChargePoint Holdings, Inc. $21.24\n**ChargePoint Holdings, Inc. (CHPT)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, September 1, 2021. The consensus estimate is for a loss of $0.14 per share on revenue of $49.06 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for revenue of $46.00 million to $51.00 million. The stock has drifted lower by 22.5% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, August 27, 2021 there was some notable buying of 1,534 contracts of the $30.00 call and 1,502 contracts of the $30.00 put expiring on Friday, September 17, 2021. Option traders are pricing in a 10.4% move on earnings and the stock has averaged a 7.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend a great trading week ahead r/StockMarket. :)",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning August 30th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pd8v8x/wall_street_week_ahead_for_the_trading_week/",
        "created": 1630182341.0
    },
    {
        "author": "babbldev",
        "created_utc": 1629988608,
        "id": "pc0sst",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I put together this tier List of [\\#stock](https://twitter.com/hashtag/stock?src=hashtag_click) market news sentiment over the month of August. How it works: I measured the optimism/pessimism/speculation expressed about each stock/crypto in new articles then aggregated their scores across all articles into a \"bullish\" rating for each ticker, and grouped them by percentile into the buckets you see below.\n\n&amp;#x200B;\n\n**Ticker Sentiment Tiers:**\n\n* most bullish: [$JPM](https://twitter.com/search?q=%24JPM&amp;src=cashtag_click) [$LTC](https://twitter.com/search?q=%24LTC&amp;src=cashtag_click) [$GE](https://twitter.com/search?q=%24GE&amp;src=cashtag_click) [$CRO](https://twitter.com/search?q=%24CRO&amp;src=cashtag_click) \n* very bullish: [$SNDL](https://twitter.com/search?q=%24SNDL&amp;src=cashtag_click) [$USDC](https://twitter.com/search?q=%24USDC&amp;src=cashtag_click) [$ADA](https://twitter.com/search?q=%24ADA&amp;src=cashtag_click) $FE $IR\n* pretty bullish: [$AVGO](https://twitter.com/search?q=%24AVGO&amp;src=cashtag_click) [$FIS](https://twitter.com/search?q=%24FIS&amp;src=cashtag_click) [$RTX](https://twitter.com/search?q=%24RTX&amp;src=cashtag_click) [$GS](https://twitter.com/search?q=%24GS&amp;src=cashtag_click)  \n* slightly bullish: $DKNG $SPWR $CLOV $RIOT\n* neutral: [$ABC](https://twitter.com/search?q=%24ABC&amp;src=cashtag_click) [$UPS](https://twitter.com/search?q=%24UPS&amp;src=cashtag_click) [$FOX](https://twitter.com/search?q=%24FOX&amp;src=cashtag_click) [$TGT](https://twitter.com/search?q=%24TGT&amp;src=cashtag_click) $EOS\n* slightly bearish: [$CME](https://twitter.com/search?q=%24CME&amp;src=cashtag_click) [$COST](https://twitter.com/search?q=%24COST&amp;src=cashtag_click) [$EBAY](https://twitter.com/search?q=%24EBAY&amp;src=cashtag_click) [$GPS](https://twitter.com/search?q=%24GPS&amp;src=cashtag_click) $OCGN\n* pretty bearish: $DOGE $ICE $PEP\n* very: [$CCI](https://twitter.com/search?q=%24CCI&amp;src=cashtag_click) [$EA](https://twitter.com/search?q=%24EA&amp;src=cashtag_click) [$GM](https://twitter.com/search?q=%24GM&amp;src=cashtag_click) [$PNC](https://twitter.com/search?q=%24PNC&amp;src=cashtag_click) \n* most: [$TXN](https://twitter.com/search?q=%24TXN&amp;src=cashtag_click) [$DOW](https://twitter.com/search?q=%24DOW&amp;src=cashtag_click) [$PLUG](https://twitter.com/search?q=%24PLUG&amp;src=cashtag_click) $IP $SO $CB\n\n&amp;#x200B;\n\n*Source: 11,042 finance articles published across a variety of platforms (SeekingAlpha, Benzinga, Yahoo Finance, MarketWatch, The Motley Fool, 100+ others)*\n\n*Tickers must have a minimum of 20 articles to be included in the tier list*\n\nhttps://preview.redd.it/a4gnjf9eqpj71.png?width=1617&amp;format=png&amp;auto=webp&amp;s=49ebc34d35d73a8056cf8bf43bdc6d78a7f97c41",
        "subreddit": "StockMarket",
        "title": "Tier list of stocks by their average news sentiment expressed during the month of August:",
        "url": "https://www.reddit.com/r/StockMarket/comments/pc0sst/tier_list_of_stocks_by_their_average_news/",
        "created": 1630017408.0
    },
    {
        "author": "HSeldon2020",
        "created_utc": 1629655411,
        "id": "p9hfxc",
        "num_comments": 388,
        "num_crossposts": 0,
        "selftext": "There are three fairly basic ways that new traders lose money in 2021:\n\n**1)** They read some elaborate post about how some piece of garbage stock is the next MEME explosion.  To their newbie eyes the extensive DD looked convincing, and the stock is *only* $10 a share right now, so they they buy 1,000 shares.  And then they average down another 1,000. Two months later they are being told by the same people that were wrong about their DD to begin with,  to hold on to the now, $8 stock.  Even worse, they now believe that selling that stock is \"exactly what the evil hedge funds want you to do!\".  A few months after that they are questioning their life choices and stuck with a useless $4 stock.\n\n**2)** Most YouTube videos are geared towards trying to sell you a method of Day Trading that is based on *Gap n Go* strategies.  These methods, while real, are far more difficult than they are made to appear, but yet they are very marketable (i.e. \"how to turn $5,000 into $50,000!\").  Instead what happens is new traders become singularly focused on finding low float, highly shorted stocks that jump up after the open, convinced they are moments away from the next big score.  Once again, months later they are questioning their life choices and stuck with an account that has dropped far below the PDT requirements\n\nAnd finally that brings us to OTM options:\n\n**3)** Slightly more sophisticated than the first two methods of losing your money, this one requires actual thought and analysis.  \n\nThe appeal is obvious - they are cheap.  And if the stock explodes those options can double, triple, etc in value.  \n\nHere's why they don't work - The options themselves have no real value other than the pure premium you are paying.  When *buying* options, your goal should always be to pay as little premium as possible.  Ideally you would have options at total parity (i.e. Stock is at $100 and the $99 Call Option is worth - $1).  \n\nSimple formula here for ITM Options - (Strike Price + Option Price) - Stock Price = Premium you are paying.\n\nSimpler formula for OTM Options - Option Price = Premium you are paying.\n\nSo let's take an example -\n\nYou like **CSCO,** it is smart pick, the daily chart looks good, it is past earnings (and seriously, please stop holding options over earnings) and looks like clear skies ahead.  Two choices:\n\n56 Strike Call, Expires Aug 27th for $2.35\n\n59 Strike Call, Expires Aug 27th for .30 cents\n\nLet's say you are going to spend $500 - so you can get 2 of the 56 Calls or 16 of the 59 Calls.  \n\nIf next week CSCO hardly moves at all (current at $58.22), your 56 calls will be worth $2.22 - a loss of only 13 cents per call or $26.  \n\nHowever, in that same scenario, your 59 calls will expire worthless, a loss of $480.  \n\nOK, let's say CSCO goes up $1 next week, it is now at $59.22 - \n\nYour 56 Calls are now worth $3.22 (at expiration), a profit of .87 per call or $174.\n\nYour 59 calls are now worth .22 a loss of .08 per Call or -$128.\n\n**OTM Options place heavy lifting on the stock to get you to profitability.  You are betting on a huge move in the stock that pull your options ITM faster than Theta strips away their value.**    \n\n***You are almost always better off going with ITM options, that have a Delta of .6 or higher and are at least a week out, if not more.***  \n\nIn fact, if you just stuck to these three rules it would increase you likelihood of success a great deal:\n\n**1) Do not trade Options over earnings, trade them before, trade them after, but do not hold them** ***over*** **the earnings announcement.**\n\n**2) Do not go for the cheaper OTM options, instead choose Calls or Puts that have a higher Delta and are farther out in time.**\n\n**3) Do not trade Option Spreads unless you know how to leg out of them if they do not go your way.**\n\n(the 3rd one may seem like a small issue, but the number of people that get stuck in spreads they do not know how to exit is alarmingly high).\n\nThis advice may seem basic to some traders here, but if you look at the posts on this forum you will quickly see that the foundational rules you may have been following as a trader aren't as obvious as you think.  New traders clearly do not know these basic principles and we should stop assuming they do.",
        "subreddit": "options",
        "title": "Stop With The OTM Gambling Obsession",
        "url": "https://www.reddit.com/r/options/comments/p9hfxc/stop_with_the_otm_gambling_obsession/",
        "created": 1629684211.0
    },
    {
        "author": "yukhateeee",
        "created_utc": 1629192817,
        "id": "p60f8m",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "My hottest stocks of year 2000.  Lost my shirt during the internet boom.  Following are/were the hottest stocks of year 2000 and more money than I should have.  For those with too much allocated to PLTR AMC GME CHEW WISH, etc.  This were their predecessors.  \n\n[https://imgur.com/a/pnxrnN1](https://imgur.com/a/pnxrnN1)\n\nMost are not around anymore.  Some still are. TXN for example, hit \\~$99 in 2000 and didn't see that again until 2017.  CSCO $82 high in 2000, that is still the ATH.  Dell has gone private and re-public since then.  \n\nMy lesson learned, you can bet on Fidel Castro, but most revolutions fail.  Bet on the dictator.  In finance, that means bet on google, amzn, SPY/VTI.  Let DDD/SSYS go...\n\nBTW:  I doubled my money on AMZN in 2008-2010 and did the high-five.  Everytime I see AMZN today, I feel madness descending...",
        "subreddit": "stocks",
        "title": "Hot Stocks!!!! Year 2000",
        "url": "https://www.reddit.com/r/stocks/comments/p60f8m/hot_stocks_year_2000/",
        "created": 1629221617.0
    },
    {
        "author": "Nice_Theta",
        "created_utc": 1630182524,
        "id": "pdhaa3",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I posted [my July earnings trading report](https://www.reddit.com/r/thetagang/comments/ov71vv/my_july_earnings_report/) last month, and many of you were kind enough to share your thoughts with me.\n\nTLDR: My July results were almost a scratch, $93 into a positive column, and I was undecided if trading earnings is a worthwhile thing.\n\nFast forward to the end of August… I couldn’t keep away from earnings, just love trading them.\n\nHere are my August stats:\n\n* 21 earnings trades (short condors and strangles, all small positions, average BPu $532.85 per position)\n* 19 wins and 2 losses. A win rate - 90%. Better than July’s 77%. A little experience helps!\n* My wins brought in $567.68\n* Losses took away $104.00\n* Net profit $463.68.\n\nWins: ABNB, BBY, CRM, CSCO, DASH, GPS, HPQ, INTU, M, MRVL, NVDA, PTON, SNOW, SPLK, TGT, TJX, ULTA, URBN, WDC\n\nLosses: LOW, JWN\n\nThe wins are great - no doubt. But it is the losses that are really interesting and have a high learning value. My losses show my indecision between two lines of thought: to defend a losing trade or to exit ASAP to minimize the loss. I have seen convincing arguments for both approaches, and am not yet sure where I stand on this.\n\nI managed my losing LOW trade fairly well in the beginning, brought it from several hundred down to around $30 loss. I could have brought it to a win, but I made a mistake - misread where I was standing and exited for a small loss. I learned how to read the position correctly and did another losing trade right - turned it into a win.\n\nI decided to take a loss on JWN because my overall win rate for August was around 93% and I thought I could afford a small loss. But now I think it could’ve been managed and perhaps turned. But we’ll never know if it could and if I had the skill to do it.\n\nWhere do you stand on this question? Do you defend? Or take a loss and move on to the next trade?",
        "subreddit": "options",
        "title": "My August earnings report",
        "url": "https://www.reddit.com/r/options/comments/pdhaa3/my_august_earnings_report/",
        "created": 1630211324.0
    },
    {
        "author": "gorays21",
        "created_utc": 1629046046,
        "id": "p4x07i",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "This week will be somewhat interesting(although not as crazy as last few weeks) because this week earnings include 2 of the most mentioned companies on reddit:\n\n&amp;#x200B;\n\n* Nvidia\n* Roblox\n* Walmart\n* Macy's\n* Target\n* Cisco\n* Foot locker\n\nHere is the full list:\n\n [pjyvtisbz8h71.png (950×515) (redd.it)](https://i.redd.it/pjyvtisbz8h71.png)",
        "subreddit": "stocks",
        "title": "This weeks earnings!",
        "url": "https://www.reddit.com/r/stocks/comments/p4x07i/this_weeks_earnings/",
        "created": 1629074846.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629079259,
        "id": "p56ozu",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p56ozu/historical_post_earnings_moves_mega_compilation/",
        "created": 1629108059.0
    },
    {
        "author": "thehopeofcali",
        "created_utc": 1628567395,
        "id": "p1hh1j",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Fastly is an edge computing/security/CDN company based out of San Francisco and competes mainly with Cloudflare.\n\nWhy now:\n\n1. High short interest, at least 20% of the float, due to poor Q2'21 earnings, can catch short sellers with their shorts down\n2. Acquisition target from public cloud providers (Amazon, Google, Microsoft, Cisco, Oracle)\n3. Best edge computing product\n4. It did not want to be in the 30s in recent price action, setting up for further bullishness\n\nAnyone have any thoughts about the aforementioned points?",
        "subreddit": "wallstreetbets",
        "title": "Fastly!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1hh1j/fastly/",
        "created": 1628596195.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629055108,
        "id": "p4ztl6",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4ztl6/historical_post_earnings_moves_mega_compilation/",
        "created": 1629083908.0
    },
    {
        "author": "cclagator",
        "created_utc": 1629052259,
        "id": "p4yyb7",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was higher by about 0.7%, in line with the 0.8% expected move options were pricing.\n\n**This Week – SPY** options are once again pricing less than a 1% move (in either direction) for the upcoming week. With the SPY around $445 that corresponds to about **$442** as a *bearish expected move* and **$449** as a *bullish expected move*.\n\n**Implied Volatility** – The VIX was lower on the week, closing around 15.50. That is below its historical average and index/etf expected moves for the next week are tight as a result. The futures curve is upward sloping with December VIX futures around 22.\n\n**Expected Moves for This Week** (via Options AI):\n\n* SPY **0.7%**\n* QQQ **1%**\n* IWM **1.7%**\n* DIA **0.9%**\n\n&amp;#x200B;\n\n### In the News\n\nRobinhood (HOOD) was down about $5 last week. Options were pricing about an $8 move. As is often the case with meme stocks option implied volatility falls when the stocks go lower. HOOD has been no exception. Weekly at-the-money options started last week about 155 vol. The weeklies for this week are around 115 vol. Options were pricing about a 15% move last week. This week they are pricing about an 11% move:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qu59wp9mekh71.png?width=565&amp;format=png&amp;auto=webp&amp;s=4a51ad69536d9442e7ffdeb824397fd0b52442e5\n\n&amp;#x200B;\n\n### Expected Moves for Companies Reporting Earnings\n\nSome earnings of note this week include Nvidia, Cisco, Home Depot and Target. Links go to the Options AI Calendar which is free to use and you can search for other stocks of interest.\n\nTuesday\n\n**Home Depot** HD / [Expected Move: **2.8%**](https://tools.optionsai.com/earnings/HD) / Recent moves: -1%, -3%, -3%\n\n**Walmart** WMT / [Expected Move: **3%**](https://tools.optionsai.com/earnings/WMT) / Recent moves: +2%, -6%, -2%\n\nWednesday\n\n**Target** TGT / [Expected Move: **4.5%**](https://tools.optionsai.com/earnings/TGT) / Recent moves: +6%, -7%, +2%\n\n**Lowe’s** LOW / [Expected Move: **4%**](https://tools.optionsai.com/earnings/LOW) / Recent moves: -4%, -8%, 0%\n\n**TJ Max** TJX / [Expected Move: **3.3%**](https://tools.optionsai.com/earnings/TJX) / Recent moves: -1%, +2%, -5%\n\n**Nvidia** NVDA / [Expected Move: **4.8%**](https://tools.optionsai.com/earnings/NVDA) / Recent moves: -1%, -8%, 0%\n\n**Cisco** CSCO / [Expected Move: **3.3%**](https://tools.optionsai.com/earnings/CSCO) / Recent moves: +1%, -3%, +7%\n\nThursday\n\n**Macy’s** M / [Expected Move: **8.6%**](https://tools.optionsai.com/earnings/M) / Recent moves: +4%, +2%, +1%\n\n**Applied Materials** AMAT / [Expected Move: **4.5%**](https://tools.optionsai.com/earnings/AMAT) / Recent moves: -1%, +5%, +4%\n\nFriday\n\n**Deere** DE / [Expected Move: **3.7%**](https://tools.optionsai.com/earnings/DE) / Recent moves: +1%, +10%, -2%",
        "subreddit": "options",
        "title": "Expected moves this week, SPY, HOOD, earnings from NVDA, CSCO, TGT, HD and more",
        "url": "https://www.reddit.com/r/options/comments/p4yyb7/expected_moves_this_week_spy_hood_earnings_from/",
        "created": 1629081059.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629060777,
        "id": "p51jh6",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p51jh6/historical_post_earnings_moves_mega_compilation/",
        "created": 1629089577.0
    },
    {
        "author": "WallSteetDebts",
        "created_utc": 1629835339,
        "id": "pav1xm",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "As we tards can see $CSCO has gone up by a measly 1.3% you probably didn't even notice it, why should you? While stocks are ripping 10% on a green day why should this stock even demand for our attention right?\n\nCurrently the stock is broken it's high from 2019 with strong volumes, chances are high that we are in for a great bull rally on this one, But this isn't what I am trying to point at. \n\nOn 22/01 Expiry for 60C(mind you the LTP of the stock is 59.3$ while I am making this post) the LTP for the call was 2.5$ a small 4% move for the stock, and you get 150 days for this bet to play out. Even if the stock rise to 70 by the end of Jan next year we could be up 300%.\n\nI am keeping this shorts cause I know you apes can't read. \n\nTLDR; 22/01 Jan 60C is extremely undervalued. \n\n🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "DeepFundamentalValue- A DD on CSCO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pav1xm/deepfundamentalvalue_a_dd_on_csco/",
        "created": 1629864139.0
    },
    {
        "author": "thehopeofcali",
        "created_utc": 1628566167,
        "id": "p1h5qq",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Fastly is an edge computing/security/CDN company based out of San Francisco and competes mainly with Cloudflare. \n\nWhy now:\n\n1. High short interest, at least 20% of the float, due to poor Q2'21 earnings, can catch short sellers with their shorts down\n2. Acquisition target from public cloud providers (Amazon, Google, Microsoft, Cisco, Oracle)\n3. Best edge computing product\n4. It did not want to be in the 30s in recent price action, setting up for further bullishness\n\nAnyone have any thoughts about the aforementioned points?",
        "subreddit": "wallstreetbets",
        "title": "FSLY setup",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1h5qq/fsly_setup/",
        "created": 1628594967.0
    },
    {
        "author": "ABCBAA",
        "created_utc": 1627985054,
        "id": "ox0b6i",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I recently read that one way you can work out if a stock is overvalued is by looking at EV/EBITDA or P/E ratios across the market. \n\nI want to use this to see if Zoom stock is overvalued, but nearly all of Zoom's competitors are conglomerates (i.e. Google for Google Meet, Microsoft for Skype, Cisco for Cisco Webex, etc.), so I'm not sure if directly comparing ratios will be an accurate indicator. What could I do here? Thanks!",
        "subreddit": "stocks",
        "title": "Zoom stock - comparing financial ratios",
        "url": "https://www.reddit.com/r/stocks/comments/ox0b6i/zoom_stock_comparing_financial_ratios/",
        "created": 1628013854.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629051820,
        "id": "p4ytdb",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "smallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/p4ytdb/historical_post_earnings_moves_mega_compilation/",
        "created": 1629080620.0
    },
    {
        "author": "uncut210",
        "created_utc": 1628781090,
        "id": "p31tio",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "What's up with NVDA, VIAC, F, AMD, CSCO, and DOCU?\nThought we were ready for 🚀🚀🚀🚀🚀🚀🚀🚀🚀\nAnyone have ideas to best play these? Momentum seems to be out of the market lately, why is that?",
        "subreddit": "wallstreetbets",
        "title": "Again, whats the deal???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p31tio/again_whats_the_deal/",
        "created": 1628809890.0
    },
    {
        "author": "bicne",
        "created_utc": 1629305495,
        "id": "p6v5cz",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$CSCO boutta blow tf up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p6v5cz/csco_boutta_blow_tf_up/",
        "created": 1629334295.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629051609,
        "id": "p4yqza",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4yqza/historical_post_earnings_moves_mega_compilation/",
        "created": 1629080409.0
    },
    {
        "author": "uncut210",
        "created_utc": 1628781735,
        "id": "p32185",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "What's up with NVDA, VIAC, F, AMD, CSCO, and DOCU?\nThought we were ready for 🚀🚀🚀🚀🚀🚀🚀🚀🚀\nAnyone have ideas to best play these? Momentum seems to be out of the market lately, why is that? How to spot momentum stocks?",
        "subreddit": "wallstreetbets",
        "title": "Looking for some advice",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p32185/looking_for_some_advice/",
        "created": 1628810535.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629051823,
        "id": "p4yteg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "options",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/options/comments/p4yteg/historical_post_earnings_moves_mega_compilation/",
        "created": 1629080623.0
    },
    {
        "author": "uncut210",
        "created_utc": 1628781852,
        "id": "p322md",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What's up with NVDA, VIAC, F, AMD, CSCO, and DOCU?\n\n\nThought we were ready for 🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n\nAnyone have ideas to best play these? \n\nMomentum seems to be out of the market lately, why is that? \n\nHow to spot momentum stocks?",
        "subreddit": "wallstreetbets",
        "title": "Need some advice...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p322md/need_some_advice/",
        "created": 1628810652.0
    },
    {
        "author": "uncut210",
        "created_utc": 1628780921,
        "id": "p31rho",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What's up with NVDA, VIAC, F, AMD, CSCO, and DOCU?\nThought we were ready for 🚀🚀🚀🚀🚀🚀🚀🚀🚀\nAnyone have ideas to best play these? Momentum seems to be out of the market lately, why is that?",
        "subreddit": "wallstreetbets",
        "title": "What's the deal???",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p31rho/whats_the_deal/",
        "created": 1628809721.0
    },
    {
        "author": "uncut210",
        "created_utc": 1628781436,
        "id": "p31xmp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What's up with NVDA, VIAC, F, AMD, CSCO, and DOCU?\nThought we were ready for 🚀🚀🚀🚀🚀🚀🚀🚀🚀\nAnyone have ideas to best play these? Momentum seems to be out of the market lately, why is that?",
        "subreddit": "wallstreetbets",
        "title": "What is the deal? Need some advice.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p31xmp/what_is_the_deal_need_some_advice/",
        "created": 1628810236.0
    },
    {
        "author": "zatrades",
        "created_utc": 1630270438,
        "id": "pe3ixl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Which chart would you rather CRWD or CSCO; CHWY or WOOF?",
        "url": "https://www.reddit.com/r/StockMarket/comments/pe3ixl/which_chart_would_you_rather_crwd_or_csco_chwy_or/",
        "created": 1630299238.0
    },
    {
        "author": "Any_Chemistry2103",
        "created_utc": 1629734070,
        "id": "pa2nxg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "(TSX:WELL)\n\nI’m sure everyone has heard a lot about WELL Health - it was a pretty hot stock a couple months ago but I haven’t been seeing much on them recently. I guess the novelty of the company started to wear off and people began to ask if WELL could continue to rise over the long term or if it was just a one-time thing due to the increased demand for virtual healthcare services amid the Covid-19 pandemic. The company has clearly done a great job recently with the expansions and acquisitions that they have been pursuing, including CRH and MyHealth, in order to diversify their exposure and I think WELL’s beyond impressive Q2 results make it safe to say they aren’t going anywhere.\n\nWELL achieved a record quarterly revenue of $61.8 million during the quarter, compared to revenue of $10.6 million generated during Q2-2020, an increase of 484% driven primarily by the CRH acquisition, which accounted for revenue of $36.7 million during the quarter. The company also produced positive EBITDA for the third consecutive quarter which is a great sign. With their own portfolio of over 25 clinics plus over 40 that were added from their acquisition of MyHealth, they are now the largest outpatient clinic operator in Canada. From a patient perspective, WELL’s omni-channel patient visits grew by 19 per cent from quarter-to-quarter, registering 559,008 total visits in the quarter with in-person visits accounting for 43 per cent of the quota.\n\nLast month, WELL formed WELL Ventures, a wholly owned subsidiary that’s purpose is to invest in companies that share WELL’s vision on healthcare. Historically, WELL has been successful at identifying strong businesses to invest in and they hope to use WELL Ventures to continue finding profitable business opportunities.\n\nThe CEO of WELL has also mentioned a NASDAQ listing in October. Recently announced was their partnership with renowned law firm Fenwick &amp; West, which helped Facebook, Amazon, Cisco, and Coinbase with their IPOs. This is important because WELL’s equivalents in the US are currently trading at much higher multiples making this a unique opportunity to get on the gains. Once WELL goes live on the NASDAQ, US funds will be hammering this stock.\n\nFor a deeper dive into their Q2 results, check out: [https://www.newswire.ca/news-releases/well-health-achieves-record-revenue-and-adjusted-ebitda-in-q2-2021-with-484-yoy-revenue-growth-and-615-growth-in-its-adjusted-gross-profit-868134844.html](https://www.newswire.ca/news-releases/well-health-achieves-record-revenue-and-adjusted-ebitda-in-q2-2021-with-484-yoy-revenue-growth-and-615-growth-in-its-adjusted-gross-profit-868134844.html)\n\nThis is not financial advice, if you are interested in the company look into them!",
        "subreddit": "investing_discussion",
        "title": "Well Health crushed Q2 earnings!",
        "url": "https://www.reddit.com/r/investing_discussion/comments/pa2nxg/well_health_crushed_q2_earnings/",
        "created": 1629762870.0
    },
    {
        "author": "zatrades",
        "created_utc": 1630272674,
        "id": "pe484b",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Which chart would you rather buy CRWD or CSCO; CHWY or WOOF?  Which would you buy, if any? Please share your thoughts. These are all 6 months charts from stockcharts.   \n\n&amp;#x200B;\n\n[  ](https://preview.redd.it/bz92c9fd6dk71.png?width=700&amp;format=png&amp;auto=webp&amp;s=b3b78c5f49e8ac02ee7885df994b47ba10da3300)\n\nCRWD up 19% week.  \n\n Fyi Crowdstrike has earnings this week.  \n\n&amp;#x200B;\n\n[  ](https://preview.redd.it/owfpl36j6dk71.png?width=700&amp;format=png&amp;auto=webp&amp;s=51664c282f79f782ca9b43396f5cb8edd5ec0d3c)\n\nCSCO up 1% week.  \n\n  Old tech is the new tech? fyi Cisco had earnings 2 weeks ago.  \n\n&amp;#x200B;\n\n[  ](https://preview.redd.it/qon6wewo6dk71.png?width=700&amp;format=png&amp;auto=webp&amp;s=657a10546a045c5e080ff40dc2027d58afa7225c)\n\nCHWY up 2% month.  \n\nfyi  Chewy has earnings this week.  \n\n&amp;#x200B;\n\n[  ](https://preview.redd.it/w2ec59sw6dk71.png?width=700&amp;format=png&amp;auto=webp&amp;s=ced31feb3ba1614bafaf28d14d1bd5c017ed6831)\n\nWOOF up 4% month.  \n\n Woof couldn’t catch a bid until after earnings last week.  \n\n Which stock would you buy, if any? Please share your thoughts.   \n\nI welcome discussion and new ideas. Thank you!",
        "subreddit": "StockMarket",
        "title": "Which chart would you rather buy CRWD or CSCO; CHWY or WOOF?",
        "url": "https://www.reddit.com/r/StockMarket/comments/pe484b/which_chart_would_you_rather_buy_crwd_or_csco/",
        "created": 1630301474.0
    },
    {
        "author": "delsystem32exe",
        "created_utc": 1627937645,
        "id": "ownmn1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "today i had some long citrix calls, sold a 20 delta call OTM only for it to double in value by market close... it will expire on friday, but it seems like diagnols underperform.",
        "subreddit": "options",
        "title": "do diagnols underperform long calls.",
        "url": "https://www.reddit.com/r/options/comments/ownmn1/do_diagnols_underperform_long_calls/",
        "created": 1627966445.0
    },
    {
        "author": "bergmoss",
        "created_utc": 1627915796,
        "id": "owg2jo",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "Deposited fund via ACH 4 days ago, was told by both companies that it would take at least 4 business days to settle, today is the 4th day, nothing.\n\nMeanwhile, a OTC stock went from .06/share to .14/share in those 4 days.\n\nJust a simple rant, of all places that happily take your money, make that shit available sooner.",
        "subreddit": "options",
        "title": "Tdameritrade/Fidelity Deposit systems sucks",
        "url": "https://www.reddit.com/r/options/comments/owg2jo/tdameritradefidelity_deposit_systems_sucks/",
        "created": 1627944596.0
    },
    {
        "author": "OTSProspect",
        "created_utc": 1627930992,
        "id": "owlcn3",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "I am currently a chase customer and will be receiving a substantial 6 figure windfall in the near future. I already have a 457 deferred compensation plan with my employer that I contribute to.\n\nI would like to use the vast majority of these funds to invest in broad market index funds. At first I was considering Robinhood, fidelity, etc or any other investment based apps, but I also learned Chase offers its option for customers to invest.\n\nI plan on having over 75K in combined accounts to qualify for the sapphire account. \n\nIf I already have all my other checking and savings accounts with Chase, is there any reason not to use Chase for investing purposes?",
        "subreddit": "investing",
        "title": "Is Chase's self investing account any good?",
        "url": "https://www.reddit.com/r/investing/comments/owlcn3/is_chases_self_investing_account_any_good/",
        "created": 1627959792.0
    },
    {
        "author": "repuswow",
        "created_utc": 1627923451,
        "id": "owipui",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "If you have to ask where to buy a stock, it's because your broker won't allow it and you need a big broker. I have to give RH credit for leading the way on commission free trades, but at some point you do need to get a better broker if you intend to trade more seriously, and basically all of them offer commission free trading. \n\nFor OTC, I use Fidelity. I've heard Schwab is good but I don't have experience with them.\n\nFor regular trading I like TDAmeritrade. They have $6.95 commissions on OTC trades though, which is why I use Fidelity for that.\n\nFor crypto, get an actual crypto wallet.",
        "subreddit": "pennystocks",
        "title": "For hopefully the last time, Webull and RH do not allow you to buy OTC stocks and they only offer some penny stocks. Why are you even still using them anyway? The big brokers have commission free trades as well.",
        "url": "https://www.reddit.com/r/pennystocks/comments/owipui/for_hopefully_the_last_time_webull_and_rh_do_not/",
        "created": 1627952251.0
    },
    {
        "author": "jlinhardt2019",
        "created_utc": 1627833518,
        "id": "ovup2y",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hey all.  In case you haven't heard, OTC Pink Current stock NSAV has gain 10x (1000%) in the month of July and doesn't look to be slowing down anytime soon.  Currently trading at $0.10 (on Schwab, Etrade or Fidelity.  Can't trade on TDAmeritrade or Robinhood)\n\n[https://finance.yahoo.com/quote/NSAV?p=NSAV&amp;.tsrc=fin-srch](https://finance.yahoo.com/quote/NSAV?p=NSAV&amp;.tsrc=fin-srch)\n\nIts launching a REGULATED cryptoexchange on Aug 9th,\n\nhas ownership in Virtuabroker, a NY Rideshare start up, a new cryptocurrency (STUX) and is 50% owned by an investment firm from Hong Kong, SilverBear Capital ([https://www.sbcfinancialgroup.com.hk](https://www.sbcfinancialgroup.com.hk)) and has BOD support from Labsgroup and Bitmart exchange\n\n1 analyst from WSJ has a 12 month price target of $22.95\n\nCome join us on Stocktwits - [https://stocktwits.com/symbol/NSAV](https://stocktwits.com/symbol/NSAV)\n\nThis is not financial advice, just an overview of what is known about NSAV.  Do your own DD and invest at your risk.",
        "subreddit": "wallstreetbets",
        "title": "NSAV is on Fire, and super affordable OTC Penny Stock",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ovup2y/nsav_is_on_fire_and_super_affordable_otc_penny/",
        "created": 1627862318.0
    },
    {
        "author": "CashflowConnoisseur",
        "created_utc": 1627880939,
        "id": "ow7yvz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As an investor, you may have the benefit of a custodian without giving much thought to the importance of their role. The Securities Exchange Commission’s (SEC) custody rule requires that Registered Investment Advisors (RIAs) safeguard their client’s assets, by imposing requirements designed to protect client funds and securities. Custodians also process trading, settling, and reconciling of assets purchased and sold. Additionally, they maintain all economic benefits to account owners including collecting income, corporate actions and proxy issues.\n\n#### Qualified Custodians \n\nAn investment advisor is required to maintain client funds and securities with a qualified custodian, which can be a bank, registered broker-dealer and a few other types of entities. Examples of large custodians include Charles Schwab, TD Ameritrade and Fidelity. The qualified custodian either maintains client funds and securities in a separate account under the client’s name or, in accounts under the name of the investment advisor, as agent or trustee for the clients. Second, the investment advisor opening the custodial account must promptly notify the client in writing of the qualified custodian’s name, address, how the funds or securities are maintained when the account is opened and following any changes to this information. Account statements from the qualified custodian must be provided to the client at least quarterly, permitting advisory clients the opportunity to compare these statements with any statements they receive from the advisor.\n\n#### Annual Exams and Additional Protections\n\nIf the investment advisor has custody of client assets, they must enter into a written agreement with an independent public accountant to examine the assets on a surprise basis every year, with the examiner contacting some advisory clients to confirm their holdings with those listed on the advisor’s records. If the qualified custodian is the investment advisor or, is affiliated, they must meet additional requirements, including obtaining an annual opinion from an independent public accountant regarding the effectiveness of the custodian’s procedures for safeguarding client funds. Safekeeping of assets includes maintaining ownership, providing valuation, accounting, and reporting assets. \n\n#### Securities Investor Protection Corporation (SIPC)\n\nAn SIPC is a nonprofit organization that protects against the loss of cash and securities held by a customer at a SIPC member firm. The SIPC will cover up to $500,000 in securities, including a $250,000 limit for cash. In addition to SIPC, some custodians provide their customers with additional “excess of SIPC” coverage through private insurers. The excess coverage is only used when SIPC coverage is exhausted and, like SIPC, does not cover investment losses due to market fluctuation or other investment losses.\n\n#### Steps Investors Should Take\n\nWhen working with an investment advisor, ask about the custodian they will use for your accounts, are they an SIPC member and do they provide an “excess of SIPC” coverage. Will accounts be in your name or the investment advisor’s name, as your agent? When you issue checks for deposit, always make your check payable directly to your custodian. If your investment advisor is registered with the SEC, you should always receive a separate statement, at least quarterly, directly from the custodian. Even with the protections offered by the “custody rule” and SIPC, investors should exercise care when making investment decisions.  \n\n\n  \n[https://www.pantagraph.com/business/kingston-safeguarding-your-investments/article\\_9a55c4e8-12d2-554a-b6bd-3afaa429e29a.html](https://www.pantagraph.com/business/kingston-safeguarding-your-investments/article_9a55c4e8-12d2-554a-b6bd-3afaa429e29a.html)",
        "subreddit": "ValueInvesting",
        "title": "Great article on Stocks Custodians, SIPC Coverage, Account Statements.",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/ow7yvz/great_article_on_stocks_custodians_sipc_coverage/",
        "created": 1627909739.0
    },
    {
        "author": "CashflowConnoisseur",
        "created_utc": 1627881029,
        "id": "ow7zm5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As an investor, you may have the benefit of a custodian without giving much thought to the importance of their role. The Securities Exchange Commission’s (SEC) custody rule requires that Registered Investment Advisors (RIAs) safeguard their client’s assets, by imposing requirements designed to protect client funds and securities. Custodians also process trading, settling, and reconciling of assets purchased and sold. Additionally, they maintain all economic benefits to account owners including collecting income, corporate actions and proxy issues.\n\nQualified Custodians \n\nAn investment advisor is required to maintain client funds and securities with a qualified custodian, which can be a bank, registered broker-dealer and a few other types of entities. Examples of large custodians include Charles Schwab, TD Ameritrade and Fidelity. The qualified custodian either maintains client funds and securities in a separate account under the client’s name or, in accounts under the name of the investment advisor, as agent or trustee for the clients. Second, the investment advisor opening the custodial account must promptly notify the client in writing of the qualified custodian’s name, address, how the funds or securities are maintained when the account is opened and following any changes to this information. Account statements from the qualified custodian must be provided to the client at least quarterly, permitting advisory clients the opportunity to compare these statements with any statements they receive from the advisor.\n\nAnnual Exams and Additional Protections\n\nIf the investment advisor has custody of client assets, they must enter into a written agreement with an independent public accountant to examine the assets on a surprise basis every year, with the examiner contacting some advisory clients to confirm their holdings with those listed on the advisor’s records. If the qualified custodian is the investment advisor or, is affiliated, they must meet additional requirements, including obtaining an annual opinion from an independent public accountant regarding the effectiveness of the custodian’s procedures for safeguarding client funds. Safekeeping of assets includes maintaining ownership, providing valuation, accounting, and reporting assets. \n\nSecurities Investor Protection Corporation (SIPC)\n\nAn SIPC is a nonprofit organization that protects against the loss of cash and securities held by a customer at a SIPC member firm. The SIPC will cover up to $500,000 in securities, including a $250,000 limit for cash. In addition to SIPC, some custodians provide their customers with additional “excess of SIPC” coverage through private insurers. The excess coverage is only used when SIPC coverage is exhausted and, like SIPC, does not cover investment losses due to market fluctuation or other investment losses.\n\nSteps Investors Should Take\n\nWhen working with an investment advisor, ask about the custodian they will use for your accounts, are they an SIPC member and do they provide an “excess of SIPC” coverage. Will accounts be in your name or the investment advisor’s name, as your agent? When you issue checks for deposit, always make your check payable directly to your custodian. If your investment advisor is registered with the SEC, you should always receive a separate statement, at least quarterly, directly from the custodian. Even with the protections offered by the “custody rule” and SIPC, investors should exercise care when making investment decisions.\n\n[https://www.pantagraph.com/business/kingston-safeguarding-your-investments/article\\_9a55c4e8-12d2-554a-b6bd-3afaa429e29a.html](https://www.pantagraph.com/business/kingston-safeguarding-your-investments/article_9a55c4e8-12d2-554a-b6bd-3afaa429e29a.html)",
        "subreddit": "StockMarket",
        "title": "Great article on Stocks Custodians, SIPC Coverage, Account Statements.",
        "url": "https://www.reddit.com/r/StockMarket/comments/ow7zm5/great_article_on_stocks_custodians_sipc_coverage/",
        "created": 1627909829.0
    }
]