[
    {
        "author": "bigbear0083",
        "created_utc": 1638631446,
        "id": "r8rvg6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 6th, 2021.\n\n# **More turbulence could be ahead for stocks as investors weigh omicron and the Fed’s next steps - [(Source)](https://www.cnbc.com/2021/12/03/stocks-could-face-more-turbulence-in-the-week-ahead.html)**\n*****\n&gt; Volatility could continue to plague markets after a week of violent swings that sent many stocks plummeting.\n*****\n&gt; In the week ahead, investors await more news on the omicron Covid variant and another inflation report Friday that is expected to show consumer prices remain the hottest in three decades.\n*****\n&gt; In the past week, stocks sold off on worries about the omicron variant and concerns the Federal Reserve will move away from its easy policies and raise interest rates sooner than anticipated. Fed Chairman Jerome Powell told a Congressional panel Tuesday that the central bank will consider speeding up the taper of its $120 billion monthly bond-buying program when it meets Dec. 14 and 15. The Federal Reserve put its bond-purchasing program in place in early 2020 to prop up the economy during the pandemic.\n*****\n&gt; “It’s going to be a somewhat turbulent December because we probably need to wait for earnings season to get regrounded, back to fundamentals,” said Jack Ablin, chief investment officer at Cresset. “For as high as a lot of the ratios would suggest, price-to-sales, price-to-earnings, when you throw it into the hopper with interest rates and everything else, things aren’t that bad. I don’t think we’re teetering on the edge of a cliff.”\n*****\n&gt; But Ablin did say the comments from Powell were unnerving investors, who fear the Fed will also speed up interest rate hikes. Powell acknowledged he was wrong about inflation being “transitory,” or temporary, spooking investors. The bond purchases are now scheduled to end in June.\n*****\n&gt; “I’m not sure what investors’ read on inflation is. Do they think the Fed is going to raise rates, get ahead of it too early and everything is going to roll over? Ever since Powell took ‘transitory’ out of his talk, investors have been somewhat off balance,” said Ablin.\n*****\n&gt; The consumer price index or CPI for November is expected Friday morning. Economists polled by Dow Jones predict it rose 0.6% on a monthly basis, or 6.7% year over year. That compares to a 0.9% gain in October, and a 6.2% jump year over year, the biggest move in three decades.\n*****\n&gt; # Risky names slammed\nHigh fliers and growth were among the hardest hit Friday, as investors bailed out of some of the riskiest stocks. As stocks plunged Friday, Treasury yields fell. Yields move opposite price, and the move was seen as a flight to safety. The 10-year note yield fell to 1.35%.\n*****\n&gt; The ARK Innovation ETF was down nearly 12.7% for the week. Most of the growth names in the fund plunged into bear market territory. “I think investors have to keep in mind that’s not a 15-week strategy. It’s a 15-year strategy, as far as we’re concerned,” Ablin said.\n*****\n&gt; For the week, the small cap Russell 2000 was down nearly 4%, while the S&amp;P 500 was off just 1.2%. The worst performing major sector for the week was communications services, which includes internet companies. It was down 2.8%, followed by consumer discretionary, off 2.4%. Financials lost nearly 2%, and the S&amp;P technology sector was down 0.4% for the week. But on Friday, tech lost 1.7%.\n*****\n&gt; The Federal Reserve should be quiet in the week ahead. Fed officials traditionally do not make major speeches in the blackout period, which is the coming week, ahead of their Dec. 14 and 15 meeting. One exception is Minneapolis Fed President Neel Kashkari who speaks Thursday at the Center for Indian Country Development Research Summit.\n*****\n&gt; Much of the focus will be on how the market itself is performing.\n*****\n&gt; “Ever since the Nov. 22 outside bearish day, all strength has been sold with lots of damage underneath the hood,” said Scott Redler of T3Live.com. “Now finally some of the leadership names are showing faulty action.” He noted that both Microsoft and Apple were weaker.\n*****\n&gt; “Money is not hiding in Amazon, Google, or Facebook. They haven’t been special for weeks,” he said.\n*****\n&gt; The S&amp;P closed below its 50-day moving average Friday, after closing below it Wednesday. The 50-day is at 4,544. That’s a signal to some market technicians that the index is on the verge of breaking down. The 50-day moving average is the average closing price over the past 50 days, and is viewed as a momentum indicator.\n*****\n&gt; “Basically, it’s effectively a retest of support because we had the relief rally [Thursday],” said Katie Stockton, founder of Fairlead Strategies. She said the S&amp;P 500 needs to close below the 50-day for two consecutive days before the move is considered a breakdown.\n*****\n&gt; “The action in the high growth, high multiple names is not a good sign,” said Stockton. “We do have some signs of downside exhaustion but not as widespread as I would hope. We’re seeing some of the heavyweights, like Adobe for example, taking out levels like the 50-day moving averages.” She said some of those big names have now joined the selling.\n*****\n&gt; “We’re just watching how bad it gets. Monday is going to be the tell,” said Stockton. “That also gives it the weekend to settle... Extremes have gotten a little bit more extreme. Sentiment is the most oversold from a contrarian perspective since the October low.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/hk2QMMD.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/w6utI7X.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/N8u66xV.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/tagANgL.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/28oKFM3.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t8zd2PY.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fEvF2Bm.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ponrnUL.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SqxThz0.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ARPnz4g.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/3QmNJUa.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/sz567v5.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/s9GIfxy.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zBWalJo.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Cz7EeMl.png))**\n\n*****\n\n&gt; # Small-Cap Corrections\n\n&gt; At the close on Wednesday (12/1), the small-cap Russell 2,000 had fallen 12.1% from its recent high on November 8th, leaving the index in \"correction\" territory. A market \"correction\" is a drop of 10%+ that was preceded by a rally of at least 10% on a closing basis. This correction for the Russell 2,000 is its 58th since data for the index begins in 1978. Below is a table showing prior corrections for the Russell. The average correction sees the index fall 18.35%, which is just shy of the 20% threshold for a \"bear market.\" The median correction is a little smaller at -15.4%. In terms of length, the average Russell correction has lasted 73 days, while the median is 62 days. For the current Russell 2,000 correction to reach average levels, it would need to fall another 7% from here, and it would come to an end on January 20th, 2022.\n\n&gt; In terms of extremes, the biggest correction that the Russell 2,000 has ever experienced was the 41.9% decline seen during the initial COVID Crash from 1/16/20 to 3/18/20. The longest correction lasted 397 days from 6/24/83 to 7/25/84. In terms of the shortest correction, there were two that lasted 3 days. One of those came during the Financial Crisis while the other happened last June.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/raycorrec.png))**\n\n*****\n\n&gt; # December Typically Starts Out Weak\n\n&gt; December typically starts out weak as tax-loss selling ramps up and with the big gains this year we would expect that early December weakness to materialize. Then as you can see in the typical December chart here stocks begin to takeoff around mid-month led by small caps and the Russell 2000.\n\n&gt; This is what used to be known as the “January Effect:” small caps outperforming large caps in the month of January. Nowadays most of the so-called January Effect takes place in the last half of December (2021 Almanac pages 110 &amp; 112, 2022 pages 112 &amp; 114). The January Effect is not to be confused with the January Barometer (2021 Almanac page 16, 2022 page 18), which states as the S&amp;P 500 goes in January, so goes the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/84caf5990b652671445781962a51ee2f/b2ebb400780bd4c8-af/s500x750/1795f2bbf763fb254a002bda32bd9b217881240b.jpg))**\n\n*****\n\n&gt; # December Almanac: Small Cap Effect &amp; Santa Claus Rally\n\n&gt; Trading in December is holiday inspired and fueled by a buying bias throughout the month. However, the first part of the month tends to be weaker as tax-loss selling and yearend portfolio restructuring begins. Regardless, December is laden with market seasonality and important events.\n\n&gt; December is the number three S&amp;P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the second-best Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not all that likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.\n\n&gt; In the last seventeen post-election years, December’s ranking slip to #7 S&amp;P 500, #7 NASDAQ and DJIA #5. Small caps, measured by the Russell 2000, tend to have a field day in post-election-year Decembers. Since 1981, the Russell 2000 has lost ground three time in ten post-election years in December. The average small cap gain in all ten years is a solid 2.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/64044be6e473181304fe66b98074cbde/5618185eea1cfe29-fe/s400x600/931f46ef694541cebb05ea5f3193a5faa1f6bc60.jpg))**\n\n&gt; Small caps tend to start to outperform larger caps near the middle of the month (early January Effect) and The “Santa Claus Rally” begins on the open on December 27 and lasts until the second trading day of 2022. Average S&amp;P 500 gains over this seven trading-day range since 1969 are a respectable 1.3%.\n\n&gt; Years when the Santa Claus Rally (SCR) has failed to materialize are often flat or down. The last six times SCR (the last five trading days of the year and the first two trading days of the New Year) has not occurred were followed by three flat years (1994, 2004 and 2015) and two nasty bear markets (2000 and 2008) and a mild bear that ended in February 2016. As Yale Hirsch’s now famous line states, “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n*****\n\n&gt; # 6 Things To Know About December And Omicron\n\n&gt; Here comes December, historically a pretty solid month for stocks, but now we have the Omicron variant wreaking havoc on markets. “What a difference a week makes. A week ago stocks were at all-time highs and the economy was strong. Now all we have are uncertainties and questions,” explained LPL Financial Chief Market Strategist Ryan Detrick. “As of now we’re optimistic that stocks will sidestep the new variant worries, but we recommend investors buckle up their seatbelts, as the end of 2021 could be a bumpy one.”\n\n&gt; Here are six things to think about as we head into the jolliest month of them all.\n\n&gt; First, historically, the S&amp;P 500 Index has gained 1.5% on average in December, which is the third best month of the year with only April and November better. But as you can see here, over the past 10 years, December has been much weaker. Of course, much of this was due to a huge 9.2% drop in 2018 (which we’ll get to soon enough).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-1.png?ssl=1))**\n\n&gt; Second, some more good news is December has been up 74.3% of the time, more than any other month of the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-2-.png?ssl=1))**\n\n&gt; drop in 2018. Only once in history was December the worst month of the year for the S&amp;P 500 and it was indeed in 2018. Three times it was the second worst month of the year, in 1968, 1980, and 1996. The worst monthly return so far this year was a 4.8% drop in September.\n\n&gt; Fourth, stocks usually don’t get moving until the second half of the month, right as the holiday good feel vibes start to come out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-3.png?ssl=1))**\n\n&gt; Fifth, this year is in rare air, as all 11 months have made a new all-time high so far. Should the S&amp;P 500 make new highs in December that would be a perfect 12 for 12, matching 2014 as the only years to complete this incredible feat.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-4.png?ssl=1))**\n\n&gt; Sixth, as we show in the LPL Chart of the Day, it turns out that when stocks are up more than 20% for the year heading into December (like 2021), the final month actually does better, up 1.7% versus 1.5%. Also, it has been higher eight of the past nine times the year was up more than 20% heading into the final month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-5.png?ssl=1))**\n\n*****\n\n&gt; # Job Growth Came Up Short in November\n\n&gt; The domestic economy added just 210,000 jobs during November, well below Bloomberg-surveyed economists’ consensus forecast for a gain of 550,000 and below October’s revised tally of 546,000. The net revision to prior months was positive but only by 82,000.\n\n&gt; The modest 23,000 gain in leisure and hospitality jobs, which were up 170,000 in October, and a 20,000 drop in retail jobs don’t make much sense given solid retail sales data of late. That could set up a positive reversal from revisions next month, though that potential bump will play some tug-of-war with the emergence of the Omicron COVID-19 variant, which came after the November survey period ended.\n\n&gt; As shown in the LPL Chart of the Day, for the past four months the pace of job gains has been well below the pre-Delta variant levels of near 1 million back in June and July. However, there are a number of reasons to be optimistic that job growth picks up in early 2022, assuming the Omicron variant doesn’t get in the way.\n\n&gt; “The job growth number is disappointing, no doubt, especially considering the survey period fell before we even know the name of the newest Covid-19 variant,” noted LPL Financial Equity Strategist Jeffrey Buchbinder. “While Omicron may curb hiring a bit over the next month or two, we remain confident in our expectation for strong job gains and above-average growth in the U.S. economy in 2022.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-12.3.21.png?ssl=1))**\n\n&gt; The story was clearly better when looking at the unemployment rate, derived from the household survey rather than from employers. The unemployment rate unexpectedly fell from 4.6% to 4.2% in November as workers—in an encouraging sign—came off the sidelines (1.14 million of them), lifting the participation rate by 0.2% to 61.8%, a post-recession high but still well off pre-pandemic levels.\n\n&gt; Inflation data also painted a somewhat reassuring picture. The year-over-year increase in average hourly earnings rose less than expected at 4.8% (+0.3% month over month), below consensus expectations of 5.0% and 0.4%, and not enough to keep up with the Consumer Price Index (CPI) over the same period. It’s reasonable to conclude that the increase in labor participation helped limit wage increases, but we have a long way to go there still. The labor market is still 3.9 million jobs below pre-pandemic levels and the labor market remains under-supplied, as noted above. In other words, further improvement in participation will still be needed to help contain inflation pressure.\n\n&gt; Some will argue that this report will make the Federal Reserve (Fed) think twice before accelerating tapering of its bond purchases, but we’re not so sure.\n\n&gt; “There were a number of positives with this jobs report,” explained LPL Financial Fixed Income Strategist Lawrence Gillum. “Labor force participation increased and the unemployment rate fell—both of which point to a continued strong jobs market. That may give the Fed reasons to speed up its tapering plans.”\n\n&gt; Overall, this report is a disappointing reminder that we’re going to have to wait longer for the booming jobs numbers that we still expect to see. We continue to expect more people to get back to work in the months ahead, in an environment of strong labor demand, which can help alleviate wage pressure and firm up the economic growth outlook. Omicron is a risk but based on the information we have today, we do not expect that variant, or any others, to meaningfully slow the job market recovery in 2022.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 3rd, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 12.5.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$CHPT $GME $LULU $CHWY $COST $AZO $RH $SAIC $LOVE $AVGO $DLHC $PATH $COUP $MDB $ASO $DBI $THO $ORCL $PLAY $CBP $SFIX $HRL $S $CONN $SUMO $SOL $UNFI $KFY $GTLB $CIEN $ALCO $PD $TOL $HQY $CASY $CNM $VRA $GEF $JW.A $ALOT $PLAB $AOUT**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/ARPnz4g.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/V8bYDe5.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.6.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/br3K0zL.png))\n\n&gt; # ***Monday 12.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hbGoBFe.png))\n\n*****\n\n&gt; # ***Tuesday  12.7.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tM8wghC.png))\n\n&gt; # ***Tuesday 12.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hhcFlGr.png))\n\n*****\n\n&gt; # ***Wednesday 12.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/lPByiPr.png))\n\n&gt; # ***Wednesday 12.8.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FNjpxcY.png))\n\n*****\n\n&gt; # ***Thursday 12.9.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/2PUPQhA.png))\n\n&gt; # ***Thursday 12.9.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/6kqQxly.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/OcHR8nI.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ChargePoint Holdings, Inc. $21.57\n&gt; **ChargePoint Holdings, Inc. (CHPT)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 7, 2021. The consensus estimate is for a loss of $0.14 per share on revenue of $63.02 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $60.00 million to $65.00 million. Short interest has decreased by 35.9% since the company's last earnings release while the stock has drifted lower by 9.3% from its open following the earnings release to be 12.1% below its 200 day moving average of $24.53. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, November 29, 2021 there was some notable buying of 1,258 contracts of the $34.00 call expiring on Friday, December 17, 2021. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 7.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # GameStop Corp. $172.39\n&gt; **GameStop Corp. (GME)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 8, 2021. The consensus estimate is for a loss of $0.22 per share on revenue of $1.19 billion and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 58.49% with revenue increasing by 18.44%. Short interest has decreased by 10.4% since the company's last earnings release while the stock has drifted lower by 4.3% from its open following the earnings release to be 7.3% below its 200 day moving average of $185.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 19, 2021 there was some notable buying of 2,239 contracts of the $250.00 call expiring on Friday, December 10, 2021. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 16.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=GME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # lululemon athletica inc. $435.72\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 9, 2021. The consensus earnings estimate is $1.39 per share on revenue of $1.43 billion and the Earnings Whisper ® number is $1.59 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat The company's guidance was for earnings of $1.33 to $1.38 per share. Consensus estimates are for year-over-year earnings growth of 19.83% with revenue increasing by 27.97%. Short interest has increased by 6.0% since the company's last earnings release while the stock has drifted higher by 0.5% from its open following the earnings release to be 17.1% above its 200 day moving average of $371.99. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 16, 2021 there was some notable buying of 552 contracts of the $490.00 call expiring on Friday, December 10, 2021. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $62.69\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, December 9, 2021. The consensus estimate is for a loss of $0.04 per share on revenue of $2.21 billion and the Earnings Whisper ® number is ($0.04) per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 24.02%. Short interest has increased by 25.4% since the company's last earnings release while the stock has drifted lower by 20.9% from its open following the earnings release to be 20.0% below its 200 day moving average of $78.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, November 23, 2021 there was some notable buying of 6,763 contracts of the $65.00 put expiring on Friday, January 21, 2022. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 6.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Costco Wholesale Corp. $528.93\n&gt; **Costco Wholesale Corp. (COST)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 9, 2021. The consensus earnings estimate is $2.59 per share on revenue of $49.05 billion and the Earnings Whisper ® number is $2.77 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.10% with revenue increasing by 13.52%. Short interest has decreased by 17.1% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 27.1% above its 200 day moving average of $416.03. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, November 29, 2021 there was some notable buying of 3,073 contracts of the $550.00 call and 2,087 contracts of the $550.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 1.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # AutoZone, Inc. -\n&gt; **AutoZone, Inc. (AZO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, December 7, 2021. The consensus earnings estimate is $20.83 per share on revenue of $3.34 billion and the Earnings Whisper ® number is $22.59 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.93% with revenue increasing by 5.89%. Short interest has increased by 22.4% since the company's last earnings release while the stock has drifted higher by 15.3% from its open following the earnings release to be 20.6% above its 200 day moving average of $1,544.93. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=AZO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # RH $537.14\n&gt; **RH (RH)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 8, 2021. The consensus earnings estimate is $6.69 per share on revenue of $985.18 million and the Earnings Whisper ® number is $7.21 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.90% with revenue increasing by 16.73%. Short interest has increased by 2.2% since the company's last earnings release while the stock has drifted lower by 23.9% from its open following the earnings release to be 15.5% below its 200 day moving average of $635.39. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 17, 2021 there was some notable buying of 1,250 contracts of the $310.00 call expiring on Friday, January 20, 2023. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=RH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Science Applications International Corporation $85.56\n&gt; **Science Applications International Corporation (SAIC)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, December 6, 2021. The consensus earnings estimate is $1.45 per share on revenue of $1.88 billion and the Earnings Whisper ® number is $1.57 per share. Investor sentiment going into the company's earnings release has 42% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 10.49% with revenue increasing by 3.41%. Short interest has decreased by 9.7% since the company's last earnings release while the stock has drifted lower by 1.5% from its open following the earnings release to be 3.7% below its 200 day moving average of $88.85. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SAIC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lovesac Company $61.76\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, December 8, 2021. The consensus estimate is for a loss of $0.40 per share on revenue of $112.19 million and the Earnings Whisper ® number is ($0.28) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 350.00% with revenue increasing by 50.10%. Short interest has increased by 26.5% since the company's last earnings release while the stock has drifted higher by 9.2% from its open following the earnings release to be 9.5% below its 200 day moving average of $68.25. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 11.6% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Broadcom Limited $558.12\n&gt; **Broadcom Limited (AVGO)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 9, 2021. The consensus earnings estimate is $7.74 per share on revenue of $7.36 billion and the Earnings Whisper ® number is $7.85 per share. Investor sentiment going into the company's earnings release has 86% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 19.08% with revenue increasing by 13.81%. Short interest has increased by 9.0% since the company's last earnings release while the stock has drifted higher by 12.5% from its open following the earnings release to be 15.4% above its 200 day moving average of $483.79. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 16, 2021 there was some notable buying of 1,273 contracts of the $560.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets. :)",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning December 6th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r8rvg6/wall_street_week_ahead_for_the_trading_week/",
        "created": 1638660246.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638582952,
        "id": "r8erac",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 6th, 2021.\n\n# **More turbulence could be ahead for stocks as investors weigh omicron and the Fed’s next steps - [(Source)](https://www.cnbc.com/2021/12/03/stocks-could-face-more-turbulence-in-the-week-ahead.html)**\n*****\n&gt; Volatility could continue to plague markets after a week of violent swings that sent many stocks plummeting.\n*****\n&gt; In the week ahead, investors await more news on the omicron Covid variant and another inflation report Friday that is expected to show consumer prices remain the hottest in three decades.\n*****\n&gt; In the past week, stocks sold off on worries about the omicron variant and concerns the Federal Reserve will move away from its easy policies and raise interest rates sooner than anticipated. Fed Chairman Jerome Powell told a Congressional panel Tuesday that the central bank will consider speeding up the taper of its $120 billion monthly bond-buying program when it meets Dec. 14 and 15. The Federal Reserve put its bond-purchasing program in place in early 2020 to prop up the economy during the pandemic.\n*****\n&gt; “It’s going to be a somewhat turbulent December because we probably need to wait for earnings season to get regrounded, back to fundamentals,” said Jack Ablin, chief investment officer at Cresset. “For as high as a lot of the ratios would suggest, price-to-sales, price-to-earnings, when you throw it into the hopper with interest rates and everything else, things aren’t that bad. I don’t think we’re teetering on the edge of a cliff.”\n*****\n&gt; But Ablin did say the comments from Powell were unnerving investors, who fear the Fed will also speed up interest rate hikes. Powell acknowledged he was wrong about inflation being “transitory,” or temporary, spooking investors. The bond purchases are now scheduled to end in June.\n*****\n&gt; “I’m not sure what investors’ read on inflation is. Do they think the Fed is going to raise rates, get ahead of it too early and everything is going to roll over? Ever since Powell took ‘transitory’ out of his talk, investors have been somewhat off balance,” said Ablin.\n*****\n&gt; The consumer price index or CPI for November is expected Friday morning. Economists polled by Dow Jones predict it rose 0.6% on a monthly basis, or 6.7% year over year. That compares to a 0.9% gain in October, and a 6.2% jump year over year, the biggest move in three decades.\n*****\n&gt; # Risky names slammed\nHigh fliers and growth were among the hardest hit Friday, as investors bailed out of some of the riskiest stocks. As stocks plunged Friday, Treasury yields fell. Yields move opposite price, and the move was seen as a flight to safety. The 10-year note yield fell to 1.35%.\n*****\n&gt; The ARK Innovation ETF was down nearly 12.7% for the week. Most of the growth names in the fund plunged into bear market territory. “I think investors have to keep in mind that’s not a 15-week strategy. It’s a 15-year strategy, as far as we’re concerned,” Ablin said.\n*****\n&gt; For the week, the small cap Russell 2000 was down nearly 4%, while the S&amp;P 500 was off just 1.2%. The worst performing major sector for the week was communications services, which includes internet companies. It was down 2.8%, followed by consumer discretionary, off 2.4%. Financials lost nearly 2%, and the S&amp;P technology sector was down 0.4% for the week. But on Friday, tech lost 1.7%.\n*****\n&gt; The Federal Reserve should be quiet in the week ahead. Fed officials traditionally do not make major speeches in the blackout period, which is the coming week, ahead of their Dec. 14 and 15 meeting. One exception is Minneapolis Fed President Neel Kashkari who speaks Thursday at the Center for Indian Country Development Research Summit.\n*****\n&gt; Much of the focus will be on how the market itself is performing.\n*****\n&gt; “Ever since the Nov. 22 outside bearish day, all strength has been sold with lots of damage underneath the hood,” said Scott Redler of T3Live.com. “Now finally some of the leadership names are showing faulty action.” He noted that both Microsoft and Apple were weaker.\n*****\n&gt; “Money is not hiding in Amazon, Google, or Facebook. They haven’t been special for weeks,” he said.\n*****\n&gt; The S&amp;P closed below its 50-day moving average Friday, after closing below it Wednesday. The 50-day is at 4,544. That’s a signal to some market technicians that the index is on the verge of breaking down. The 50-day moving average is the average closing price over the past 50 days, and is viewed as a momentum indicator.\n*****\n&gt; “Basically, it’s effectively a retest of support because we had the relief rally [Thursday],” said Katie Stockton, founder of Fairlead Strategies. She said the S&amp;P 500 needs to close below the 50-day for two consecutive days before the move is considered a breakdown.\n*****\n&gt; “The action in the high growth, high multiple names is not a good sign,” said Stockton. “We do have some signs of downside exhaustion but not as widespread as I would hope. We’re seeing some of the heavyweights, like Adobe for example, taking out levels like the 50-day moving averages.” She said some of those big names have now joined the selling.\n*****\n&gt; “We’re just watching how bad it gets. Monday is going to be the tell,” said Stockton. “That also gives it the weekend to settle... Extremes have gotten a little bit more extreme. Sentiment is the most oversold from a contrarian perspective since the October low.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/hk2QMMD.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/w6utI7X.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/N8u66xV.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/tagANgL.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/28oKFM3.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t8zd2PY.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fEvF2Bm.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ponrnUL.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SqxThz0.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/r0gUrDf.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/3QmNJUa.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/sz567v5.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/s9GIfxy.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zBWalJo.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Cz7EeMl.png))**\n\n*****\n\n&gt; # Small-Cap Corrections\n\n&gt; At the close on Wednesday (12/1), the small-cap Russell 2,000 had fallen 12.1% from its recent high on November 8th, leaving the index in \"correction\" territory. A market \"correction\" is a drop of 10%+ that was preceded by a rally of at least 10% on a closing basis. This correction for the Russell 2,000 is its 58th since data for the index begins in 1978. Below is a table showing prior corrections for the Russell. The average correction sees the index fall 18.35%, which is just shy of the 20% threshold for a \"bear market.\" The median correction is a little smaller at -15.4%. In terms of length, the average Russell correction has lasted 73 days, while the median is 62 days. For the current Russell 2,000 correction to reach average levels, it would need to fall another 7% from here, and it would come to an end on January 20th, 2022.\n\n&gt; In terms of extremes, the biggest correction that the Russell 2,000 has ever experienced was the 41.9% decline seen during the initial COVID Crash from 1/16/20 to 3/18/20. The longest correction lasted 397 days from 6/24/83 to 7/25/84. In terms of the shortest correction, there were two that lasted 3 days. One of those came during the Financial Crisis while the other happened last June.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/raycorrec.png))**\n\n*****\n\n&gt; # December Typically Starts Out Weak\n\n&gt; December typically starts out weak as tax-loss selling ramps up and with the big gains this year we would expect that early December weakness to materialize. Then as you can see in the typical December chart here stocks begin to takeoff around mid-month led by small caps and the Russell 2000.\n\n&gt; This is what used to be known as the “January Effect:” small caps outperforming large caps in the month of January. Nowadays most of the so-called January Effect takes place in the last half of December (2021 Almanac pages 110 &amp; 112, 2022 pages 112 &amp; 114). The January Effect is not to be confused with the January Barometer (2021 Almanac page 16, 2022 page 18), which states as the S&amp;P 500 goes in January, so goes the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/84caf5990b652671445781962a51ee2f/b2ebb400780bd4c8-af/s500x750/1795f2bbf763fb254a002bda32bd9b217881240b.jpg))**\n\n*****\n\n&gt; # December Almanac: Small Cap Effect &amp; Santa Claus Rally\n\n&gt; Trading in December is holiday inspired and fueled by a buying bias throughout the month. However, the first part of the month tends to be weaker as tax-loss selling and yearend portfolio restructuring begins. Regardless, December is laden with market seasonality and important events.\n\n&gt; December is the number three S&amp;P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the second-best Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not all that likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.\n\n&gt; In the last seventeen post-election years, December’s ranking slip to #7 S&amp;P 500, #7 NASDAQ and DJIA #5. Small caps, measured by the Russell 2000, tend to have a field day in post-election-year Decembers. Since 1981, the Russell 2000 has lost ground three time in ten post-election years in December. The average small cap gain in all ten years is a solid 2.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/64044be6e473181304fe66b98074cbde/5618185eea1cfe29-fe/s400x600/931f46ef694541cebb05ea5f3193a5faa1f6bc60.jpg))**\n\n&gt; Small caps tend to start to outperform larger caps near the middle of the month (early January Effect) and The “Santa Claus Rally” begins on the open on December 27 and lasts until the second trading day of 2022. Average S&amp;P 500 gains over this seven trading-day range since 1969 are a respectable 1.3%.\n\n&gt; Years when the Santa Claus Rally (SCR) has failed to materialize are often flat or down. The last six times SCR (the last five trading days of the year and the first two trading days of the New Year) has not occurred were followed by three flat years (1994, 2004 and 2015) and two nasty bear markets (2000 and 2008) and a mild bear that ended in February 2016. As Yale Hirsch’s now famous line states, “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n*****\n\n&gt; # 6 Things To Know About December And Omicron\n\n&gt; Here comes December, historically a pretty solid month for stocks, but now we have the Omicron variant wreaking havoc on markets. “What a difference a week makes. A week ago stocks were at all-time highs and the economy was strong. Now all we have are uncertainties and questions,” explained LPL Financial Chief Market Strategist Ryan Detrick. “As of now we’re optimistic that stocks will sidestep the new variant worries, but we recommend investors buckle up their seatbelts, as the end of 2021 could be a bumpy one.”\n\n&gt; Here are six things to think about as we head into the jolliest month of them all.\n\n&gt; First, historically, the S&amp;P 500 Index has gained 1.5% on average in December, which is the third best month of the year with only April and November better. But as you can see here, over the past 10 years, December has been much weaker. Of course, much of this was due to a huge 9.2% drop in 2018 (which we’ll get to soon enough).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-1.png?ssl=1))**\n\n&gt; Second, some more good news is December has been up 74.3% of the time, more than any other month of the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-2-.png?ssl=1))**\n\n&gt; drop in 2018. Only once in history was December the worst month of the year for the S&amp;P 500 and it was indeed in 2018. Three times it was the second worst month of the year, in 1968, 1980, and 1996. The worst monthly return so far this year was a 4.8% drop in September.\n\n&gt; Fourth, stocks usually don’t get moving until the second half of the month, right as the holiday good feel vibes start to come out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-3.png?ssl=1))**\n\n&gt; Fifth, this year is in rare air, as all 11 months have made a new all-time high so far. Should the S&amp;P 500 make new highs in December that would be a perfect 12 for 12, matching 2014 as the only years to complete this incredible feat.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-4.png?ssl=1))**\n\n&gt; Sixth, as we show in the LPL Chart of the Day, it turns out that when stocks are up more than 20% for the year heading into December (like 2021), the final month actually does better, up 1.7% versus 1.5%. Also, it has been higher eight of the past nine times the year was up more than 20% heading into the final month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-5.png?ssl=1))**\n\n*****\n\n&gt; # Job Growth Came Up Short in November\n\n&gt; The domestic economy added just 210,000 jobs during November, well below Bloomberg-surveyed economists’ consensus forecast for a gain of 550,000 and below October’s revised tally of 546,000. The net revision to prior months was positive but only by 82,000.\n\n&gt; The modest 23,000 gain in leisure and hospitality jobs, which were up 170,000 in October, and a 20,000 drop in retail jobs don’t make much sense given solid retail sales data of late. That could set up a positive reversal from revisions next month, though that potential bump will play some tug-of-war with the emergence of the Omicron COVID-19 variant, which came after the November survey period ended.\n\n&gt; As shown in the LPL Chart of the Day, for the past four months the pace of job gains has been well below the pre-Delta variant levels of near 1 million back in June and July. However, there are a number of reasons to be optimistic that job growth picks up in early 2022, assuming the Omicron variant doesn’t get in the way.\n\n&gt; “The job growth number is disappointing, no doubt, especially considering the survey period fell before we even know the name of the newest Covid-19 variant,” noted LPL Financial Equity Strategist Jeffrey Buchbinder. “While Omicron may curb hiring a bit over the next month or two, we remain confident in our expectation for strong job gains and above-average growth in the U.S. economy in 2022.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-12.3.21.png?ssl=1))**\n\n&gt; The story was clearly better when looking at the unemployment rate, derived from the household survey rather than from employers. The unemployment rate unexpectedly fell from 4.6% to 4.2% in November as workers—in an encouraging sign—came off the sidelines (1.14 million of them), lifting the participation rate by 0.2% to 61.8%, a post-recession high but still well off pre-pandemic levels.\n\n&gt; Inflation data also painted a somewhat reassuring picture. The year-over-year increase in average hourly earnings rose less than expected at 4.8% (+0.3% month over month), below consensus expectations of 5.0% and 0.4%, and not enough to keep up with the Consumer Price Index (CPI) over the same period. It’s reasonable to conclude that the increase in labor participation helped limit wage increases, but we have a long way to go there still. The labor market is still 3.9 million jobs below pre-pandemic levels and the labor market remains under-supplied, as noted above. In other words, further improvement in participation will still be needed to help contain inflation pressure.\n\n&gt; Some will argue that this report will make the Federal Reserve (Fed) think twice before accelerating tapering of its bond purchases, but we’re not so sure.\n\n&gt; “There were a number of positives with this jobs report,” explained LPL Financial Fixed Income Strategist Lawrence Gillum. “Labor force participation increased and the unemployment rate fell—both of which point to a continued strong jobs market. That may give the Fed reasons to speed up its tapering plans.”\n\n&gt; Overall, this report is a disappointing reminder that we’re going to have to wait longer for the booming jobs numbers that we still expect to see. We continue to expect more people to get back to work in the months ahead, in an environment of strong labor demand, which can help alleviate wage pressure and firm up the economic growth outlook. Omicron is a risk but based on the information we have today, we do not expect that variant, or any others, to meaningfully slow the job market recovery in 2022.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 3rd, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 12.5.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$COUP $MDB $HQY $GTLB $SUMO $AZO $DBI $ALCO $CHPT $PLAY $SFIX $TOL $SOL $PD $S $CDMO $AVAV $LOVE $GME $RH $PATH $GEF $OXM $CHWY $LULU $COST $ORCL $AVGO $MTN $KLXE $KSPN $ASO**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/r0gUrDf.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/evjwA2L.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.6.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/br3K0zL.png))\n\n&gt; # ***Monday 12.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hbGoBFe.png))\n\n*****\n\n&gt; # ***Tuesday  12.7.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tM8wghC.png))\n\n&gt; # ***Tuesday 12.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hhcFlGr.png))\n\n*****\n\n&gt; # ***Wednesday 12.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/lPByiPr.png))\n\n&gt; # ***Wednesday 12.8.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FNjpxcY.png))\n\n*****\n\n&gt; # ***Thursday 12.9.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/2PUPQhA.png))\n\n&gt; # ***Thursday 12.9.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/6kqQxly.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/OcHR8nI.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.),\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets. :)",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning December 6th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r8erac/wall_street_week_ahead_for_the_trading_week/",
        "created": 1638611752.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638582862,
        "id": "r8eq9y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Friday afternoon to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 6th, 2021.\n\n# **More turbulence could be ahead for stocks as investors weigh omicron and the Fed’s next steps - [(Source)](https://www.cnbc.com/2021/12/03/stocks-could-face-more-turbulence-in-the-week-ahead.html)**\n*****\n&gt; Volatility could continue to plague markets after a week of violent swings that sent many stocks plummeting.\n*****\n&gt; In the week ahead, investors await more news on the omicron Covid variant and another inflation report Friday that is expected to show consumer prices remain the hottest in three decades.\n*****\n&gt; In the past week, stocks sold off on worries about the omicron variant and concerns the Federal Reserve will move away from its easy policies and raise interest rates sooner than anticipated. Fed Chairman Jerome Powell told a Congressional panel Tuesday that the central bank will consider speeding up the taper of its $120 billion monthly bond-buying program when it meets Dec. 14 and 15. The Federal Reserve put its bond-purchasing program in place in early 2020 to prop up the economy during the pandemic.\n*****\n&gt; “It’s going to be a somewhat turbulent December because we probably need to wait for earnings season to get regrounded, back to fundamentals,” said Jack Ablin, chief investment officer at Cresset. “For as high as a lot of the ratios would suggest, price-to-sales, price-to-earnings, when you throw it into the hopper with interest rates and everything else, things aren’t that bad. I don’t think we’re teetering on the edge of a cliff.”\n*****\n&gt; But Ablin did say the comments from Powell were unnerving investors, who fear the Fed will also speed up interest rate hikes. Powell acknowledged he was wrong about inflation being “transitory,” or temporary, spooking investors. The bond purchases are now scheduled to end in June.\n*****\n&gt; “I’m not sure what investors’ read on inflation is. Do they think the Fed is going to raise rates, get ahead of it too early and everything is going to roll over? Ever since Powell took ‘transitory’ out of his talk, investors have been somewhat off balance,” said Ablin.\n*****\n&gt; The consumer price index or CPI for November is expected Friday morning. Economists polled by Dow Jones predict it rose 0.6% on a monthly basis, or 6.7% year over year. That compares to a 0.9% gain in October, and a 6.2% jump year over year, the biggest move in three decades.\n*****\n&gt; # Risky names slammed\nHigh fliers and growth were among the hardest hit Friday, as investors bailed out of some of the riskiest stocks. As stocks plunged Friday, Treasury yields fell. Yields move opposite price, and the move was seen as a flight to safety. The 10-year note yield fell to 1.35%.\n*****\n&gt; The ARK Innovation ETF was down nearly 12.7% for the week. Most of the growth names in the fund plunged into bear market territory. “I think investors have to keep in mind that’s not a 15-week strategy. It’s a 15-year strategy, as far as we’re concerned,” Ablin said.\n*****\n&gt; For the week, the small cap Russell 2000 was down nearly 4%, while the S&amp;P 500 was off just 1.2%. The worst performing major sector for the week was communications services, which includes internet companies. It was down 2.8%, followed by consumer discretionary, off 2.4%. Financials lost nearly 2%, and the S&amp;P technology sector was down 0.4% for the week. But on Friday, tech lost 1.7%.\n*****\n&gt; The Federal Reserve should be quiet in the week ahead. Fed officials traditionally do not make major speeches in the blackout period, which is the coming week, ahead of their Dec. 14 and 15 meeting. One exception is Minneapolis Fed President Neel Kashkari who speaks Thursday at the Center for Indian Country Development Research Summit.\n*****\n&gt; Much of the focus will be on how the market itself is performing.\n*****\n&gt; “Ever since the Nov. 22 outside bearish day, all strength has been sold with lots of damage underneath the hood,” said Scott Redler of T3Live.com. “Now finally some of the leadership names are showing faulty action.” He noted that both Microsoft and Apple were weaker.\n*****\n&gt; “Money is not hiding in Amazon, Google, or Facebook. They haven’t been special for weeks,” he said.\n*****\n&gt; The S&amp;P closed below its 50-day moving average Friday, after closing below it Wednesday. The 50-day is at 4,544. That’s a signal to some market technicians that the index is on the verge of breaking down. The 50-day moving average is the average closing price over the past 50 days, and is viewed as a momentum indicator.\n*****\n&gt; “Basically, it’s effectively a retest of support because we had the relief rally [Thursday],” said Katie Stockton, founder of Fairlead Strategies. She said the S&amp;P 500 needs to close below the 50-day for two consecutive days before the move is considered a breakdown.\n*****\n&gt; “The action in the high growth, high multiple names is not a good sign,” said Stockton. “We do have some signs of downside exhaustion but not as widespread as I would hope. We’re seeing some of the heavyweights, like Adobe for example, taking out levels like the 50-day moving averages.” She said some of those big names have now joined the selling.\n*****\n&gt; “We’re just watching how bad it gets. Monday is going to be the tell,” said Stockton. “That also gives it the weekend to settle... Extremes have gotten a little bit more extreme. Sentiment is the most oversold from a contrarian perspective since the October low.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/hk2QMMD.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/w6utI7X.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/N8u66xV.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/tagANgL.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/28oKFM3.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t8zd2PY.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fEvF2Bm.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ponrnUL.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SqxThz0.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/r0gUrDf.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/3QmNJUa.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/sz567v5.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/s9GIfxy.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zBWalJo.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Cz7EeMl.png))**\n\n*****\n\n&gt; # Small-Cap Corrections\n\n&gt; At the close on Wednesday (12/1), the small-cap Russell 2,000 had fallen 12.1% from its recent high on November 8th, leaving the index in \"correction\" territory. A market \"correction\" is a drop of 10%+ that was preceded by a rally of at least 10% on a closing basis. This correction for the Russell 2,000 is its 58th since data for the index begins in 1978. Below is a table showing prior corrections for the Russell. The average correction sees the index fall 18.35%, which is just shy of the 20% threshold for a \"bear market.\" The median correction is a little smaller at -15.4%. In terms of length, the average Russell correction has lasted 73 days, while the median is 62 days. For the current Russell 2,000 correction to reach average levels, it would need to fall another 7% from here, and it would come to an end on January 20th, 2022.\n\n&gt; In terms of extremes, the biggest correction that the Russell 2,000 has ever experienced was the 41.9% decline seen during the initial COVID Crash from 1/16/20 to 3/18/20. The longest correction lasted 397 days from 6/24/83 to 7/25/84. In terms of the shortest correction, there were two that lasted 3 days. One of those came during the Financial Crisis while the other happened last June.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/raycorrec.png))**\n\n*****\n\n&gt; # December Typically Starts Out Weak\n\n&gt; December typically starts out weak as tax-loss selling ramps up and with the big gains this year we would expect that early December weakness to materialize. Then as you can see in the typical December chart here stocks begin to takeoff around mid-month led by small caps and the Russell 2000.\n\n&gt; This is what used to be known as the “January Effect:” small caps outperforming large caps in the month of January. Nowadays most of the so-called January Effect takes place in the last half of December (2021 Almanac pages 110 &amp; 112, 2022 pages 112 &amp; 114). The January Effect is not to be confused with the January Barometer (2021 Almanac page 16, 2022 page 18), which states as the S&amp;P 500 goes in January, so goes the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/84caf5990b652671445781962a51ee2f/b2ebb400780bd4c8-af/s500x750/1795f2bbf763fb254a002bda32bd9b217881240b.jpg))**\n\n*****\n\n&gt; # December Almanac: Small Cap Effect &amp; Santa Claus Rally\n\n&gt; Trading in December is holiday inspired and fueled by a buying bias throughout the month. However, the first part of the month tends to be weaker as tax-loss selling and yearend portfolio restructuring begins. Regardless, December is laden with market seasonality and important events.\n\n&gt; December is the number three S&amp;P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the second-best Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not all that likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.\n\n&gt; In the last seventeen post-election years, December’s ranking slip to #7 S&amp;P 500, #7 NASDAQ and DJIA #5. Small caps, measured by the Russell 2000, tend to have a field day in post-election-year Decembers. Since 1981, the Russell 2000 has lost ground three time in ten post-election years in December. The average small cap gain in all ten years is a solid 2.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/64044be6e473181304fe66b98074cbde/5618185eea1cfe29-fe/s400x600/931f46ef694541cebb05ea5f3193a5faa1f6bc60.jpg))**\n\n&gt; Small caps tend to start to outperform larger caps near the middle of the month (early January Effect) and The “Santa Claus Rally” begins on the open on December 27 and lasts until the second trading day of 2022. Average S&amp;P 500 gains over this seven trading-day range since 1969 are a respectable 1.3%.\n\n&gt; Years when the Santa Claus Rally (SCR) has failed to materialize are often flat or down. The last six times SCR (the last five trading days of the year and the first two trading days of the New Year) has not occurred were followed by three flat years (1994, 2004 and 2015) and two nasty bear markets (2000 and 2008) and a mild bear that ended in February 2016. As Yale Hirsch’s now famous line states, “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n*****\n\n&gt; # 6 Things To Know About December And Omicron\n\n&gt; Here comes December, historically a pretty solid month for stocks, but now we have the Omicron variant wreaking havoc on markets. “What a difference a week makes. A week ago stocks were at all-time highs and the economy was strong. Now all we have are uncertainties and questions,” explained LPL Financial Chief Market Strategist Ryan Detrick. “As of now we’re optimistic that stocks will sidestep the new variant worries, but we recommend investors buckle up their seatbelts, as the end of 2021 could be a bumpy one.”\n\n&gt; Here are six things to think about as we head into the jolliest month of them all.\n\n&gt; First, historically, the S&amp;P 500 Index has gained 1.5% on average in December, which is the third best month of the year with only April and November better. But as you can see here, over the past 10 years, December has been much weaker. Of course, much of this was due to a huge 9.2% drop in 2018 (which we’ll get to soon enough).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-1.png?ssl=1))**\n\n&gt; Second, some more good news is December has been up 74.3% of the time, more than any other month of the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-2-.png?ssl=1))**\n\n&gt; drop in 2018. Only once in history was December the worst month of the year for the S&amp;P 500 and it was indeed in 2018. Three times it was the second worst month of the year, in 1968, 1980, and 1996. The worst monthly return so far this year was a 4.8% drop in September.\n\n&gt; Fourth, stocks usually don’t get moving until the second half of the month, right as the holiday good feel vibes start to come out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-3.png?ssl=1))**\n\n&gt; Fifth, this year is in rare air, as all 11 months have made a new all-time high so far. Should the S&amp;P 500 make new highs in December that would be a perfect 12 for 12, matching 2014 as the only years to complete this incredible feat.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-4.png?ssl=1))**\n\n&gt; Sixth, as we show in the LPL Chart of the Day, it turns out that when stocks are up more than 20% for the year heading into December (like 2021), the final month actually does better, up 1.7% versus 1.5%. Also, it has been higher eight of the past nine times the year was up more than 20% heading into the final month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-5.png?ssl=1))**\n\n*****\n\n&gt; # Job Growth Came Up Short in November\n\n&gt; The domestic economy added just 210,000 jobs during November, well below Bloomberg-surveyed economists’ consensus forecast for a gain of 550,000 and below October’s revised tally of 546,000. The net revision to prior months was positive but only by 82,000.\n\n&gt; The modest 23,000 gain in leisure and hospitality jobs, which were up 170,000 in October, and a 20,000 drop in retail jobs don’t make much sense given solid retail sales data of late. That could set up a positive reversal from revisions next month, though that potential bump will play some tug-of-war with the emergence of the Omicron COVID-19 variant, which came after the November survey period ended.\n\n&gt; As shown in the LPL Chart of the Day, for the past four months the pace of job gains has been well below the pre-Delta variant levels of near 1 million back in June and July. However, there are a number of reasons to be optimistic that job growth picks up in early 2022, assuming the Omicron variant doesn’t get in the way.\n\n&gt; “The job growth number is disappointing, no doubt, especially considering the survey period fell before we even know the name of the newest Covid-19 variant,” noted LPL Financial Equity Strategist Jeffrey Buchbinder. “While Omicron may curb hiring a bit over the next month or two, we remain confident in our expectation for strong job gains and above-average growth in the U.S. economy in 2022.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-12.3.21.png?ssl=1))**\n\n&gt; The story was clearly better when looking at the unemployment rate, derived from the household survey rather than from employers. The unemployment rate unexpectedly fell from 4.6% to 4.2% in November as workers—in an encouraging sign—came off the sidelines (1.14 million of them), lifting the participation rate by 0.2% to 61.8%, a post-recession high but still well off pre-pandemic levels.\n\n&gt; Inflation data also painted a somewhat reassuring picture. The year-over-year increase in average hourly earnings rose less than expected at 4.8% (+0.3% month over month), below consensus expectations of 5.0% and 0.4%, and not enough to keep up with the Consumer Price Index (CPI) over the same period. It’s reasonable to conclude that the increase in labor participation helped limit wage increases, but we have a long way to go there still. The labor market is still 3.9 million jobs below pre-pandemic levels and the labor market remains under-supplied, as noted above. In other words, further improvement in participation will still be needed to help contain inflation pressure.\n\n&gt; Some will argue that this report will make the Federal Reserve (Fed) think twice before accelerating tapering of its bond purchases, but we’re not so sure.\n\n&gt; “There were a number of positives with this jobs report,” explained LPL Financial Fixed Income Strategist Lawrence Gillum. “Labor force participation increased and the unemployment rate fell—both of which point to a continued strong jobs market. That may give the Fed reasons to speed up its tapering plans.”\n\n&gt; Overall, this report is a disappointing reminder that we’re going to have to wait longer for the booming jobs numbers that we still expect to see. We continue to expect more people to get back to work in the months ahead, in an environment of strong labor demand, which can help alleviate wage pressure and firm up the economic growth outlook. Omicron is a risk but based on the information we have today, we do not expect that variant, or any others, to meaningfully slow the job market recovery in 2022.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 3rd, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 12.5.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$COUP $MDB $HQY $GTLB $SUMO $AZO $DBI $ALCO $CHPT $PLAY $SFIX $TOL $SOL $PD $S $CDMO $AVAV $LOVE $GME $RH $PATH $GEF $OXM $CHWY $LULU $COST $ORCL $AVGO $MTN $KLXE $KSPN $ASO**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/r0gUrDf.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/evjwA2L.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.6.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/br3K0zL.png))\n\n&gt; # ***Monday 12.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hbGoBFe.png))\n\n*****\n\n&gt; # ***Tuesday  12.7.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tM8wghC.png))\n\n&gt; # ***Tuesday 12.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hhcFlGr.png))\n\n*****\n\n&gt; # ***Wednesday 12.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/lPByiPr.png))\n\n&gt; # ***Wednesday 12.8.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FNjpxcY.png))\n\n*****\n\n&gt; # ***Thursday 12.9.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/2PUPQhA.png))\n\n&gt; # ***Thursday 12.9.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/6kqQxly.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/OcHR8nI.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.),\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket. :)",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning December 6th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/r8eq9y/wall_street_week_ahead_for_the_trading_week/",
        "created": 1638611662.0
    }
]