[
    {
        "author": "Realguyme",
        "created_utc": 1630025956,
        "id": "pccqus",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": " Most great semi stocks are already priced in or overvalued, and we smart experienced apes know that you never buy overvalued stocks because its potential gain is small and its potential loss is too big.\n\nTherefore, we need to buy the stock that is undervalued but eventually goes up to meet its price target later because of its strong fundamentals and future growth (which is MU). And why do we need to pick semi stocks for this? Because Semiconductor business is one of the most potential and profitable business in the whole industry; we simply think that everything is turning to digital and AI systems, and all those devices, platforms, and servers need memory chips. Biden's infrastructure bills and his willingness to support semi industry are also tailwinds of semi stocks.\n\nOk, so why MU is the most undervalued stock among all semiconductors now?\n\nBecause it is ridiculously cheap! 7x forward price to earnings multiple now, and even though it actually have a slowdown in memory chip industry, it is still 10-12x forward earnings which is still ridiculously cheap compared to other semi stocks. (According to Quint Tatro, Joule Financial founder at CNBC).\n\nMU's 52 week high is 96.96, and its current price is 72.77. It showed some high volatility and corrections after its ATH because it went up too fast in short time (52 week low is 43.67). The last large correction made MU's price down from 83 to 68.80 which was 17% down in 4 days. This correction happened because of Morgan Stanley's report that says 'winter is coming' for semis. However, all other institutions and investors, including Goldman Sachs, Bofa, Jim Cramer, think that MU is way undervalued, and its price is at the bottom now. Vanguard Group, Sanders Capital, and State Street, top 5 MU shareholders, added MU positions between August 6 to August 16 . Since many institutions and large investors start to buy MU back, its price went up from 68 to 77, and then it dropped to 73 today due to the red market and some sell offs.\n\nReasons why this is a great timing to buy MU now\n\n1. The sentiment turned to bullish. It kept going up since it hit its bottom price 68, and yesterday, August 25th, it pumped from 73 to 77 in few minutes, closed at 74, and the current price is 72.77 now. Great buying point before it keeps pumping after this Jackson Hole meeting.\n2. Too CHEAP compared to ALL other semis. Here is the picture.\n\n[As you can see, MU is -23.64&amp;#37; from 52 week High on August 25, it has a more discount today since it dropped to 72.77. Ok, then we might doubt about its fundamentals and its future growth. Don't worry, here is why most analysts and institutions think MU is super undervalued and it is time to buy now.](https://preview.redd.it/dlkwd2twtsj71.png?width=1522&amp;format=png&amp;auto=webp&amp;s=320db86cfa01137884d5738472075d85b9f5bc78)\n\n[Its FY1 is 12.13 which is already great, but its FY2 and 3 is 6.36 and 6.34 which is too great compared to others. So, it is a great time to buy it before all those number soar later.](https://preview.redd.it/4o837srxtsj71.png?width=1233&amp;format=png&amp;auto=webp&amp;s=021afd568ab356ba677378e791f117c4bedef258)\n\nTheir EPS and Revenue growth are also great too (beating all estimates for over 2 years).\n\nhttps://preview.redd.it/j65bzmrytsj71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=76f6143cca80476247088955c96ff2d31d03e2b6\n\n3. Morgan Stanley, aka sneaky bitches, revealed a report 'winter is coming' or whatever, saying that DRAM memory chip price was already at the peak and it is going down now which will lead all DRAM company's profit to go down due to its historical data. However, most institutions and investors still believe that DRAM's demand is still too strong enough to cover that DRAM price drop, because all PCs, Servers, Laptops, smartphones, tablets, robots, cars, and anything that has automated computer system needs 'memory chip'. Semi industry has a bright future, and I think Morgan Stanley's report was just a manipulation in order to short the stock and buying it back at discounted price. This asshole bought SK hynix (2nd largest DRAM company) shares back after its correction in Korea. Its price was 120,000 Won before MS's report, and it dropped to 98,000 after its report and they started buying back from 100,000 now. I still strongly believe that this stock will keep going up before tapering. (I hope the Fed does not mention about tapering at Jackson Hole).\n\n4. RSI number is important because we can know if the stock is overbought or not. The current market sentiment is unstable due to upcoming tapering, interest rates, inflation, national debts, infrastructure, etc. and most overbought stock have a high chance to meet its huge corrections later. Ok, so MU's current monthly RSI is 57. It is still in the middle which is a great number for tech growth stock. For example, Nvidia's monthly RSI is 86, AMD's monthly RSI is 85, AMAT is 75, TSM is 76, Qualcomm is 65, and ASML is 93. RSI does not explain everything, but it helps you to know that MU is pretty undervalued.\n\n5. Most great investors always say 'being simple is the best strategy'. I also believe that. Simply, we will make the money if we buy the GOOD stock in cheap way and sell it in expensive way. And simply, MU, a GOOD stock, is cheap now.\n\n6. Here is a better explanation about MU itself (my first MU DD) that shows why MU is a GOOD stock. [https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron\\_will\\_eventually\\_rally\\_5080\\_upside\\_potential/](https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron_will_eventually_rally_5080_upside_potential/)\n\nThere is a high chance that the Fed will not mention about tapering at Jackson Hole meeting because of Delta variant problems and slower than expected economy recovery. If they don't, tech stocks have a higher chance to get pumped for a while, and indeed, undervalued stocks have the highest chance to soar. So I personally strongly believe that few more tailwinds can drive MU price up to 20-30% before its next earnings (Sep 27), and 60-100% in 3-6 months depending on market sentiment.\n\nIts current price targets are: Yahoo avg 115.59, Seeking Alpha avg 111.76, Marketwatch avg 115.85,  \nTip Ranks: 112.64, Marketbeat: 112.07, CNN: 112.50. Total Average PT: 113.40.\n\nIt is simple, but actually not easy. Buy it now since it is turning to bullish, and sell the news before it actually tanks again. If the tapering is coming? Buy the PUTs or wait until the price became cheap again with healthy correction. And then we get in the ride again when it starts pumping again. I think that is how you can survive in this stupid unpredictable market. I sometimes use option straddle strategy during this unpredictable market because all you need to do is choosing high volatility stocks (I might use this strategy for MU later since it has a high volatility, and the current market is unpredictable).\n\nMy positions: 24 Sep 72c x 7 , 24 Sep 68c x 10, owning 100 shares.\n\nIndeed, this is just my DD, no financial advice.\n\nThank you guys.",
        "subreddit": "wallstreetbets",
        "title": "MU, the most undervalued semi stock, has 20-30% upside potential in a month, 70-100% upside potential in 3-6 months. The sentiment has been changed to bullish this week, a GREAT TIME TO BUY.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pccqus/mu_the_most_undervalued_semi_stock_has_2030/",
        "created": 1630054756.0
    },
    {
        "author": "nerdydude7447",
        "created_utc": 1629479387,
        "id": "p89i5k",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "$AMAT reported earning the other day, beat expectations, raised guidance for the next quarter and for the next year. MORE IMPORTANTLY on the conference call they mentioned that their guidance for next year does not include multinational government spending to expand local chipmaking. I recommend you listen to the call to get the full picture.\n\nIn my eyes additional chipmaking will have to come online, and governments understand the importance of it. These shortages are just a beginning of what to come, as we smartify and electrify everything. All of these things will need more chips. And remember $AMAT doesn't make chips, they make the tooling, essentially they are the shovel seller in the semiconductor gold rush.\n\nPlus on the chart it's looking oversold to me.\n\nPosition: Oct 15 $140c",
        "subreddit": "wallstreetbets",
        "title": "$AMAT looking to breakout?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p89i5k/amat_looking_to_breakout/",
        "created": 1629508187.0
    },
    {
        "author": "tiredsenior",
        "created_utc": 1629485848,
        "id": "p8bjye",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "I'm going to keep this short. I've been invested in $AMAT pre-earnings and I think this is the perfect time to pick up some more. It absolutely destroyed earnings yesterday beating revenue and EPS estimates. I suspect that the main reason for the dip today is investor fear of the chip shortage and overall fear around growth potential. Currently, they have over 10 billion in backlog orders, strong and steady cash flows, strong analyst ratings from Stifel and WF, and they are poised to grow even more next quarter.\n\nThey're currently looking to diversify what they do. From the earnings, you could even see that \"Foundry and logic chip equipment accounted for 63% of semiconductor systems sales in the third quarter, Applied Materials said. Gear for making dynamic random-access memory, or DRAM, chips made up 20% of sales. And flash memory chip equipment provided the remaining 17% of sales.\" With financials, they had an adjusted $1.90 EPS and over 6+ billion in revenue which is tremendous YOY and quarterly growth.\n\n&amp;#x200B;\n\nTLDR: AMAT's going to break out soon: strong revenue, cash flow, and growth potential",
        "subreddit": "wallstreetbets",
        "title": "$AMAT to the moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p8bjye/amat_to_the_moon/",
        "created": 1629514648.0
    },
    {
        "author": "goldeaglec",
        "created_utc": 1627911092,
        "id": "owektj",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hello,\n\nBeen on this sub for awhile just soaking in information. I bought some individual stock (AMAT @ $50.85 and ENPH @ 18.35)when I didn't have a lot to play with in the market (just one share of each company). I wish at that time I had more money to actually invest haha. Would it be beneficial to sell those shares and just invest in a similar ETF or mutual fund? Or just buy more? I do own shares of SOXQ which owns shares in AMAT for an example. I could use advice for green energy funds for an alternative to ENPH. Thanks!",
        "subreddit": "stocks",
        "title": "Sell individual stocks to buy ETF or mutual fund",
        "url": "https://www.reddit.com/r/stocks/comments/owektj/sell_individual_stocks_to_buy_etf_or_mutual_fund/",
        "created": 1627939892.0
    },
    {
        "author": "dcthechamp",
        "created_utc": 1629765606,
        "id": "pacoda",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I’ve been helping my wife’s boyfriend move all his stuff into the master bedroom of our house so I can take the guest room. Some of his clothes got wrinkled during the move so I’m writing this while I iron his slacks for work tomorrow. \n\nVery rarely do we see an opportunity in which both the retarded and non-retarded feel good about entering a play together. Enter AMAT. Did someone say skweez? No, but the shorts do have to cover for ex-dividend 8/25. \n\n**Massive Earnings Beat-** In one of the most bullish calls my wife has ever let me listen to, AMAT revealed record Q3 2021 numbers last Thursday. The market responded by giving the stock a 3% haircut. \n\n&amp;#x200B;\n\n* *Record quarterly revenue of      $6.20 billion, up 41 percent year over year*\n* *Record quarterly GAAP operating      margin of 32.5 percent and record non-GAAP operating margin of 32.7      percent, up 7.3 points and 6.3 points year over year, respectively*\n* *Record quarterly GAAP EPS of      $1.87 and record non-GAAP EPS of $1.90, up 105 percent and 79 percent year      over year, respectively*\n\nThe also raised guidance for Q4 from $4.36 billion revenue on $1.02 per share to $4.4-4.8 billion on $1.11-$1.23 per share. “Applied has the broadest and most enabling portfolio of technologies to accelerate our customers’ roadmaps, putting us in a great position to outperform our markets again in 2021 and the years ahead.” –CEO Gary Dickerson\n\n&amp;#x200B;\n\n[\\\\\"If you continue to undervalue us, I'm going to buyback the stock. Lmao try me cucks I authorized a 7.5 billion buyback in March.\\\\\"](https://preview.redd.it/8esbofufb7j71.png?width=502&amp;format=png&amp;auto=webp&amp;s=333a762fe24ddb3d3a9e537e9226dc78373367f7)\n\n**Tale of the Tape-** After bouncing off the top of the channel again, AMAT reversed its downtrend today and broke/stayed above $130 on average volume. This presents a good entry point for you fellow retards as we move back up. Every major analyst rating has a PT of at least $140, with most at $150-160. I believe this time when we move back up, it will be to a new ATH. \n\n&amp;#x200B;\n\n[ALL ABOARD! KEEP YOUR HANDS AND FEET INSIDE THE ROCKET AT ALL TIMES.](https://preview.redd.it/dl5jck4wb7j71.png?width=791&amp;format=png&amp;auto=webp&amp;s=b6963c4fb72cdae9d42104c82d6405eba15f047e)\n\n  \n\nSo financials are great. Fundamentals are great. We are on the chart’s launch pad. What’s the catalyst? \n\n**Ex-dividend 8/25-** Big money has seemingly drummed the share price for no reason other than to load up at a lower entry. Tomorrow shorts will either have to cover their position or be responsible for paying the 24 cents a share. All the stars have aligned for this thing to fly if it gets some volume. AMAT is also presenting at an investor conference tomorrow (Needham SemiCap and EDA Conference on Tuesday, Aug. 24) but conferences are boomer circle jerks that nobody cares about. \n\nFor short term retards, I expect to see some nice green dildos as we move to $140 by Friday. For long term retards, this thing is at a fucking discount for your buy and hold.",
        "subreddit": "wallstreetbets",
        "title": "Applied Materials ($AMAT) – The Conductor Of The Tendies Train",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pacoda/applied_materials_amat_the_conductor_of_the/",
        "created": 1629794406.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629492102,
        "id": "p8dj0n",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, August 20, 2021**\n\nStocks rose today, recovering some of the losses from earlier this week as market participants shake off some taper concerns. Market participants continue to weigh several factors affecting the market, including but not limited to (1) the taper timeline, (2) record-breaking corporate earnings, (3) and surging coronavirus delta variant infections. \n\nThe S&amp;P 500 (SPY) rose 0.79% today, recovering earlier losses, but finished the week 0.31% down. The Nasdaq (QQQ) rose 1.04% today and staged a remarkable comeback this week, coming from 2% down Thursday to finishing 0.01% higher. The Dow Jones (DIA) rose 0.65% today but finished the week 0.96% down, underperforming the other two major indexes. The Russell 2000 (IWM), which tracks the performance of small-caps, rose 1.68% today but finished the week 1.98% down.\n\nOn Wednesday, meeting minutes suggested members of the Federal Reserve were advancing the debate over the timing and scope of tapering the pace of the pandemic-era asset purchasing program. In the latest minutes, the Fed said, “looking ahead, most participants noted that, provided that the economy were to evolve broadly as anticipated, they judged it could be appropriate to start reducing the pace of asset purchases this year.”As I said above, this makes a lot of sense judging how the economy has also so far rebounded at a faster pace than expected. Given this record-breaking quarter in terms of corporate earnings and improving labor market conditions, the economy is beginning to be able to stand on its own without all the pandemic-era support. However, while progress has been made, the Fed’s goal has not yet been reached. The meeting minutes said, “ most participants judged that the Committee’s standard of “substantial further progress” toward the maximum-employment goal had not yet been met.” \n\nIn order to stave off another “taper tantrum” and directly address interest rates concerns, the minutes explicitly stressed the need to “reaffirm the absence of any mechanical link between the timing of tapering and that of an eventual increase in the target range for the federal funds rate.” Participants voted to maintain the interest rate near zero. I cannot stress this enough, potential interest rate hikes in 2023 will be the real test for equities. Until then I remain very bullish and will continue buying up every dip (has worked wonderfully so far). Of this, the meeting minutes said, “A couple of participants also noted that a tapering of asset purchases did not amount to a tightening of the stance of monetary policy and instead only implied that additional monetary accommodation would be provided at a slower rate.”\n\nRead the full meeting minutes here: [https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf](https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf)\n\nAs of yesterday, 91% of companies in the SPY have reported Q2 earnings, with 87% of these topping consensus estimates on earnings per share, according to data compiled by FactSet. The expected, year-over-year overall growth rate for the SPY currently stands at 89.3%, the fastest increase since the Q4 2009. David Kostin, Chief US Equity Strategist at Goldman Sachs, said “In an earnings season with many surprises – including the highest frequency of EPS \\[earnings per share\\] beats in our 22-year data history – one of the most notable was the surge in corporate buyback activity. Strong corporate equity demand is one reason we forecast a 5% return to our SPY year-end target of $470”\n\nThe U.S. now has an average of 143,827 new COVID-19 cases per day as of yesterday, a rate that has doubled in a little over two weeks, the number of hospitalized is at a six month high, and roughly 911 people are dying each day, triple the death rate seen in late July. For context, the US was averaging roughly 20,000 new cases per day on July 1.\n\nHowever, while this is definitely not good, it is important to mention that cases remain highly concentrated in areas of high vaccine hesitancy. According to John Hopkins University, almost ⅓ of all COVID hospitalizations in the US are in Texas or Florida. \n\nAccording to data analysis by the Associated Press using data through May 2021, shows that 98.9% of those hospitalized with COVID are unvaccinated (only 1,200 of 107,000 hospitalizations as of May 2021). Dr. Rochelle Wolensky, Director of the Center for Disease Control and Prevention (CDC), said “There is a clear message that is coming through: This is becoming a pandemic of the unvaccinated. Our biggest concern is we are going to continue to see preventable cases, hospitalizations and sadly deaths among the unvaccinated.”\n\n**Highlights**\n\n* The price of digital currencies surged after Coinbase (COIN) announced it was investing $500 million and would allocate 10% of quarterly profits into a digital currency portfolio. \n* Yesterday was Tesla AI Day, in which the company unveiled new technologies and ideas the company is working on. Among the most interesting was a humanoid robot that will be operated using Tesla’s full-self driving technology (FSD). The robot is designed to do “dangerous, repetitive, boring tasks” according to Elon Musk. Interesting to say the least.\n* Microsoft (MSFT) boosted the price of Office 365 for the first time since the service was launched a decade ago. This caused the surge to spike to a new all-time high. The company said collaboration tools now used by more than 250 million monthly active users\n* After 70 years, the MLB dropped Topps as the creator of the iconic baseball cards. As a result, Topps merger into the market was terminated a day before shareholders were set to vote.\n* Shares of Nvidia (NVDA) continued beasting after smashing earnings and raising guidance moving forward. I love this stock so much\n* Shares of Alibaba (BABA) continue to bleed among the regulatory crackdown by the Chinese Communist Party. The stock is now way below even March 2020 level and is trading at the lowest level since June 2019.\n* Facebook (FB) unveiled a new product called “Horizon Workrooms”, which is a VR powered, remote work app that uses the company Oculus Rift headset. Zuckerberg called it the first step in building a “metaverse”, which is a collectively-shared virtual space where people are able to interact using avatars. This seems like the next big trend among giant internet companies.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AbbVie (ABBV) target raised by SVB Leerink from $145 to $148 at Outperform. Stock currently around $119\n* Applied Materials (AMAT) with two target raises. Stock currently around $127\n   * Mizuho from $158 to $161 at Buy\n   * Morgan Stanley from $139 to $150 at Equal-Weight\n* Invitation Homes (INVH) target raised by Morgan Stanley from $45 to $48.50 at Overweight. Stock currently around $40.50\n* Microsoft (MSFT) with two target raises. Stock currently around $304\n   * UBS Group from $325 to $350 at Buy\n   * Wedbush from $325 to $350 at Outperform\n* Peloton Interaction (PTON) target raised by MKM Partners from $110 to $130 at Buy. Stock currently around $108\n* Sherwin Williams (SHW) target raised by Morgan Stanley from $315 to $345 at Overweight. Stock currently around $307\n* Tapestry (TPR) target raised by Robert W Baird from $58 to $60 at Outperform. Stock currently around $40.50\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices not a risk, but it is an opportunity. Where else do you look for cheap stocks?” - Li Lu",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, August 20, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p8dj0n/here_is_a_market_recap_for_today_friday_august_20/",
        "created": 1629520902.0
    },
    {
        "author": "cclagator",
        "created_utc": 1629052259,
        "id": "p4yyb7",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was higher by about 0.7%, in line with the 0.8% expected move options were pricing.\n\n**This Week – SPY** options are once again pricing less than a 1% move (in either direction) for the upcoming week. With the SPY around $445 that corresponds to about **$442** as a *bearish expected move* and **$449** as a *bullish expected move*.\n\n**Implied Volatility** – The VIX was lower on the week, closing around 15.50. That is below its historical average and index/etf expected moves for the next week are tight as a result. The futures curve is upward sloping with December VIX futures around 22.\n\n**Expected Moves for This Week** (via Options AI):\n\n* SPY **0.7%**\n* QQQ **1%**\n* IWM **1.7%**\n* DIA **0.9%**\n\n&amp;#x200B;\n\n### In the News\n\nRobinhood (HOOD) was down about $5 last week. Options were pricing about an $8 move. As is often the case with meme stocks option implied volatility falls when the stocks go lower. HOOD has been no exception. Weekly at-the-money options started last week about 155 vol. The weeklies for this week are around 115 vol. Options were pricing about a 15% move last week. This week they are pricing about an 11% move:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qu59wp9mekh71.png?width=565&amp;format=png&amp;auto=webp&amp;s=4a51ad69536d9442e7ffdeb824397fd0b52442e5\n\n&amp;#x200B;\n\n### Expected Moves for Companies Reporting Earnings\n\nSome earnings of note this week include Nvidia, Cisco, Home Depot and Target. Links go to the Options AI Calendar which is free to use and you can search for other stocks of interest.\n\nTuesday\n\n**Home Depot** HD / [Expected Move: **2.8%**](https://tools.optionsai.com/earnings/HD) / Recent moves: -1%, -3%, -3%\n\n**Walmart** WMT / [Expected Move: **3%**](https://tools.optionsai.com/earnings/WMT) / Recent moves: +2%, -6%, -2%\n\nWednesday\n\n**Target** TGT / [Expected Move: **4.5%**](https://tools.optionsai.com/earnings/TGT) / Recent moves: +6%, -7%, +2%\n\n**Lowe’s** LOW / [Expected Move: **4%**](https://tools.optionsai.com/earnings/LOW) / Recent moves: -4%, -8%, 0%\n\n**TJ Max** TJX / [Expected Move: **3.3%**](https://tools.optionsai.com/earnings/TJX) / Recent moves: -1%, +2%, -5%\n\n**Nvidia** NVDA / [Expected Move: **4.8%**](https://tools.optionsai.com/earnings/NVDA) / Recent moves: -1%, -8%, 0%\n\n**Cisco** CSCO / [Expected Move: **3.3%**](https://tools.optionsai.com/earnings/CSCO) / Recent moves: +1%, -3%, +7%\n\nThursday\n\n**Macy’s** M / [Expected Move: **8.6%**](https://tools.optionsai.com/earnings/M) / Recent moves: +4%, +2%, +1%\n\n**Applied Materials** AMAT / [Expected Move: **4.5%**](https://tools.optionsai.com/earnings/AMAT) / Recent moves: -1%, +5%, +4%\n\nFriday\n\n**Deere** DE / [Expected Move: **3.7%**](https://tools.optionsai.com/earnings/DE) / Recent moves: +1%, +10%, -2%",
        "subreddit": "options",
        "title": "Expected moves this week, SPY, HOOD, earnings from NVDA, CSCO, TGT, HD and more",
        "url": "https://www.reddit.com/r/options/comments/p4yyb7/expected_moves_this_week_spy_hood_earnings_from/",
        "created": 1629081059.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1628786948,
        "id": "p33sq7",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "https://finance.yahoo.com/news/micron-falls-memory-concerns-even-153903684.html\n\nThe stock dropped nearly 8% in its biggest intraday decline since March. It has lost more than 15% so far this week, putting it on track for its biggest one-week decline since March 2020.\n\nThe day’s slump came after Morgan Stanley downgraded the stock to equal weight from overweight as a part of a broadly negative call on the market for the DRAM category of memory chips, Micron’s largest product in terms of revenue, according to data compiled by Bloomberg.\n\nThese few day stocks decline are not reasonable. Mu, amat and lrcx these are all valuation reasonable and quality stocks. They dropped for 10% or more for the past few days. Chip shortages and 5G trend are still ongoing, these stocks should still have a lot of growth potential, so investors should start to adding positions here.",
        "subreddit": "stocks",
        "title": "Micron Falls on Memory Concerns Even as Some Analysts See Bottom",
        "url": "https://www.reddit.com/r/stocks/comments/p33sq7/micron_falls_on_memory_concerns_even_as_some/",
        "created": 1628815748.0
    },
    {
        "author": "Spiritual_Exchange47",
        "created_utc": 1629629503,
        "id": "p9aeq4",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://i.redd.it/95t8exs93wi71.gif\n\n&amp;#x200B;\n\nApplied Materials (AMAT) Tops Q3 EPS\n\nQ3 EPS of $1.90 - $0.13 better than the analyst estimate of $1.77.\n\nRevenue: $6.2B vs $5.94 Consensus\n\n**GUIDANCE:**\n\nQ4 2021 EPS of $1.87-$2.01 versus the consensus of $1.81.\n\nQ4 2021 Revenue: $6.08-6.58 billion, versus the consensus of $6.04 billion.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nAMAT's going to break out soon: strong revenue, cash flow, and growth potential\n\nThis is not financial advice.\n\n&amp;#x200B;\n\nMy Positions\n\n09/17 Call 140 USD",
        "subreddit": "wallstreetbets",
        "title": "Applied Materials Inc. ( $AMAT ) Earnings Thread — BULLISH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p9aeq4/applied_materials_inc_amat_earnings_thread_bullish/",
        "created": 1629658303.0
    },
    {
        "author": "kribz666",
        "created_utc": 1628978123,
        "id": "p4gz4s",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**\\[Long post with ALL stocks releasing earnings this week\\]**\n\n# Utilities\n\n[$AZRE](https://earninngs-watcher.tech/#/company?symbol=AZRE) release on 2021-08-16 - Market cap: 1.05B$ - average movement around earnings 4.9%\n\n[$CWCO](https://earninngs-watcher.tech/#/company?symbol=cwco) release on 2021-08-17 - Market cap: 194M$ - average movement around earnings 3.6%\n\n# Consumer Cyclical\n\n[$HD](https://earninngs-watcher.tech/#/company?symbol=HD) release on 2021-08-17 - Market cap: 329B$ - average movement around earnings 2.7%\n\n[$LOW](https://earninngs-watcher.tech/#/company?symbol=LOW) release on 2021-08-18 - Market cap: 134B$ - average movement around earnings 4.8%\n\n$TJX release on 2021-08-17 - Market cap: 78.6B$ - average movement around earnings 4.8%\n\n$ROST release on 2021-08-18 - Market cap: 42.2B$ - average movement around earnings 4.0%\n\n$AMCR release on 2021-08-16 - Market cap: 18.8B$ - average movement around earnings 5.2%\n\n$LB release on 2021-08-18 - Market cap: 18.1B$ - average movement around earnings 8.3%\n\n$AAP release on 2021-08-16 - Market cap: 13.1B$ - average movement around earnings 7.0%\n\n$KSS release on 2021-08-16 - Market cap: 8.43B$ - average movement around earnings 8.5%\n\n$FL release on 2021-08-20 - Market cap: 6.22B$ - average movement around earnings 10.9%\n\n$M release on 2021-08-19 - Market cap: 5.72B$ - average movement around earnings 7.9%\n\n$MMYT release on 2021-08-19 - Market cap: 2.96B$ - average movement around earnings 12.0%\n\n$EAT release on 2021-08-18 - Market cap: 2.65B$ - average movement around earnings 6.1%\n\n$BKE release on 2021-08-20 - Market cap: 2.03B$ - average movement around earnings 8.0%\n\n$LZB release on 2021-08-16 - Market cap: 1.95B$ - average movement around earnings 9.8%\n\n# Healthcare\n\n[$A](https://earninngs-watcher.tech/#/company?symbol=A) release on 2021-08-16 - Market cap: 44B$ - average movement around earnings 3.3%\n\n[$PINC](https://earninngs-watcher.tech/#/company?symbol=PINC) release on 2021-08-17 - Market cap: 4.27B$ - average movement around earnings 8.6%\n\n$SUPN release on 2021-08-16 - Market cap: 1.67B$ - average movement around earnings 9.2%\n\n$CRTX release on 2021-08-16 - Market cap: 1.45B$ - average movement around earnings 9.8%\n\n$PAVM release on 2021-08-16 - Market cap: 506M$ - average movement around earnings 11.0%\n\n$ACRX release on 2021-08-16 - Market cap: 168M$ - average movement around earnings 13.2%\n\n$ADMP release on 2021-08-16 - Market cap: 144M$ - average movement around earnings 9.6%\n\n$VBLT release on 2021-08-16 - Market cap: 139M$ - average movement around earnings 7.0%\n\n$ENTX release on 2021-08-18 - Market cap: 87.7M$ - average movement around earnings 10.1%\n\n$EDSA release on 2021-08-16 - Market cap: 72.6M$ - average movement around earnings 9.3%\n\n$PRPO release on 2021-08-16 - Market cap: 71.1M$ - average movement around earnings 12.8%\n\n$TLGT release on 2021-08-17 - Market cap: 56M$ - average movement around earnings 11.1%\n\n# Industrials\n\n[$DE](https://earninngs-watcher.tech/#/company?symbol=DE) release on 2021-08-20 - Market cap: 106B$ - average movement around earnings 6.8%\n\n[$NDSN](https://earninngs-watcher.tech/#/company?symbol=NDSN) release on 2021-08-17 - Market cap: 12.9B$ - average movement around earnings 4.4%\n\n$GOGL release on 2021-08-16 - Market cap: 2.15B$ - average movement around earnings 6.8%\n\n$SFL release on 2021-08-16 - Market cap: 1.07B$ - average movement around earnings 5.1%\n\n$CAAP release on 2021-08-18 - Market cap: 838M$ - average movement around earnings 7.1%\n\n$NAT release on 2021-08-16 - Market cap: 532M$ - average movement around earnings 7.1%\n\n$SMED release on 2021-08-17 - Market cap: 198M$ - average movement around earnings 12.2%\n\n$NM release on 2021-08-18 - Market cap: 130M$ - average movement around earnings 12.4%\n\n$GASS release on 2021-08-19 - Market cap: 111M$ - average movement around earnings 8.1%\n\n$OMEX release on 2021-08-16 - Market cap: 88.3M$ - average movement around earnings 9.5%\n\n$CVV release on 2021-08-16 - Market cap: 28.4M$ - average movement around earnings 8.0%\n\n# Technology\n\n$NVDA release on 2021-08-17 - Market cap: 460B$ - average movement around earnings 6.1%\n\n$AMAT release on 2021-08-19 - Market cap: 127B$ - average movement around earnings 6.7%\n\n$ADI release on 2021-08-17 - Market cap: 62.1B$ - average movement around earnings 4.2%\n\n$SNPS release on 2021-08-17 - Market cap: 40.6B$ - average movement around earnings 4.9%\n\n$KEYS release on 2021-08-18 - Market cap: 27.6B$ - average movement around earnings 5.0%\n\n$UI release on 2021-08-19 - Market cap: 19.9B$ - average movement around earnings 10.8%\n\n$JKHY release on 2021-08-16 - Market cap: 12.2B$ - average movement around earnings 4.2%\n\n$CREE release on 2021-08-16 - Market cap: 11.2B$ - average movement around earnings 9.5%\n\n$DQ release on 2021-08-16 - Market cap: 4.81B$ - average movement around earnings 12.5%\n\n$FN release on 2021-08-16 - Market cap: 3.5B$ - average movement around earnings 7.9%\n\n$OSIS release on 2021-08-18 - Market cap: 1.79B$ - average movement around earnings 7.7%\n\n# Communication Services\n\n$SLGG release on 2021-08-17 - Market cap: 201M$ - average movement around earnings 15.7%\n\n$SRAX release on 2021-08-16 - Market cap: 130M$ - average movement around earnings 12.3%\n\n$FENG release on 2021-08-16 - Market cap: 119M$ - average movement around earnings 9.8%\n\n$AESE release on 2021-08-16 - Market cap: 86.8M$ - average movement around earnings 12.0%\n\n# Financial Services\n\n$PGR release on 2021-08-18 - Market cap: 54.9B$ - average movement around earnings 3.4%\n\n$SWKH release on 2021-08-16 - Market cap: 220M$ - average movement around earnings 4.0%\n\n# Consumer Defensive\n\n$WMT release on 2021-08-17 - Market cap: 392B$ - average movement around earnings 3.0%\n\n$TGT release on 2021-08-18 - Market cap: 114B$ - average movement around earnings 6.9%\n\n$EL release on 2021-08-19 - Market cap: 110B$ - average movement around earnings 5.3%\n\n$BJ release on 2021-08-19 - Market cap: 6.49B$ - average movement around earnings 7.5%\n\n$ATGE release on 2021-08-16 - Market cap: 1.87B$ - average movement around earnings 7.9%\n\n$ARCE release on 2021-08-19 - Market cap: 1.84B$ - average movement around earnings 5.7%\n\n$JBSS release on 2021-08-17 - Market cap: 1.05B$ - average movement around earnings 12.1%\n\n$VSTA release on 2021-08-18 - Market cap: 720M$ - average movement around earnings 7.3%\n\n$LFVN release on 2021-08-16 - Market cap: 113M$ - average movement around earnings 12.2%\n\n# Energy\n\n[$HMLP](https://earninngs-watcher.tech/#/company?symbol=HMLP) release on 2021-08-18 - Market cap: 592M$ - average movement around earnings 3.8%",
        "subreddit": "smallstreetbets",
        "title": "All Stocks Reporting Earnings This Week (by Sector and Market Cap)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/p4gz4s/all_stocks_reporting_earnings_this_week_by_sector/",
        "created": 1629006923.0
    },
    {
        "author": "babbldev",
        "created_utc": 1629161316,
        "id": "p5t7nn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " Weekend Sentiment Review (8/14-8/15)\n\nTickers with most optimistic / pessimistic sentiment in this weekend's news coverage:  \n\nMost optimistic: \n\n1. [$AMD](https://twitter.com/search?q=%24AMD&amp;src=cashtag_click) \n2. [$PFE](https://twitter.com/search?q=%24PFE&amp;src=cashtag_click)\n3. [$ABNB](https://twitter.com/search?q=%24ABNB&amp;src=cashtag_click) \n4. [$MU](https://twitter.com/search?q=%24MU&amp;src=cashtag_click)\n5. [$MRNA](https://twitter.com/search?q=%24MRNA&amp;src=cashtag_click)\n6. ...\n\nMost pessimistic: \n\n1. [$AMAT](https://twitter.com/search?q=%24AMAT&amp;src=cashtag_click)\n2. [$WISH](https://twitter.com/search?q=%24WISH&amp;src=cashtag_click)\n3. [$PTON](https://twitter.com/search?q=%24PTON&amp;src=cashtag_click)\n4. [$TMUS](https://twitter.com/search?q=%24TMUS&amp;src=cashtag_click)\n5. [$INTC](https://twitter.com/search?q=%24INTC&amp;src=cashtag_click)\n6. ...\n\n [\\#StocksToWatch](https://twitter.com/hashtag/StocksToWatch?src=hashtag_click) full top 10 lists below:\n\n*Sources: 1,468 articles published by Benzinga, Yahoo Finance, Seeking Alpha, and 50+ others*\n\nhttps://preview.redd.it/q6fesuthfth71.jpg?width=835&amp;format=pjpg&amp;auto=webp&amp;s=4243c8f031ba9fae764c892452e9708e7f4a83f2\n\nhttps://preview.redd.it/8ck2kvthfth71.jpg?width=839&amp;format=pjpg&amp;auto=webp&amp;s=856a1a142e5538908917f7f2b0b872db5bd656d2",
        "subreddit": "StockMarket",
        "title": "Tickers with the most optimistic / pessimistic sentiment in this weekend's news coverage:",
        "url": "https://www.reddit.com/r/StockMarket/comments/p5t7nn/tickers_with_the_most_optimistic_pessimistic/",
        "created": 1629190116.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1630025059,
        "id": "pcchyc",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Most great semi stocks are already priced in or overvalued, and we smart experienced apes know that you never buy overvalued stocks because its potential gain is small and its potential loss is too big.\n\nTherefore, we need to buy the stock that is undervalued but eventually goes up to meet its price target later because of its strong fundamentals and future growth (which is MU). And why do we need to pick semi stocks for this? Because Semiconductor business is one of the most potential and profitable business in the whole industry; we simply think that everything is turning to digital and AI systems, and all those devices, platforms, and servers need memory chips. Biden's infrastructure bills and his willingness to support semi industry are also tailwinds of semi stocks.\n\nOk, so why MU is the most undervalued stock among all semiconductors now?\n\nBecause it is ridiculously cheap! 7x forward price to earnings multiple now, and even though it actually have a slowdown in memory chip industry, it is still 10-12x forward earnings which is still ridiculously cheap compared to other semi stocks. (According to Quint Tatro, Joule Financial founder at CNBC).\n\nMU's 52 week high is 96.96, and its current price is 72.77. It showed some high volatility and corrections after its ATH because it went up too fast in short time (52 week low is 43.67). The last large correction made MU's price down from 83 to 68.80 which was 17% down in 4 days. This correction happened because of Morgan Stanley's report that says 'winter is coming' for semis. However, all other institutions and investors, including Goldman Sachs, Bofa, Jim Cramer, think that MU is way undervalued, and its price is at the bottom now. Vanguard Group, Sanders Capital, and State Street, top 5 MU shareholders, added MU positions between August 6 to August 16 ([https://whalewisdom.com/stock/mu](https://whalewisdom.com/stock/mu)). Since many institutions and large investors start to buy MU back, its price went up from 68 to 77, and then it dropped to 73 today due to the red market and some sell offs. \n\nReasons why this is a great timing to buy MU now\n\n1. The sentiment turned to bullish. It kept going up since it hit its bottom price 68, and yesterday, August 25th, it pumped from 73 to 77 in few minutes, closed at 74, and the current price is 72.77 now. Great buying point before it keeps pumping after this Jackson Hole meeting.\n2. Too CHEAP compared to ALL other semis. Here is the picture. (seekingalpha)\n\n[As you can see, MU is -23.64&amp;#37; from 52 week High on August 25, it has a more discount today since it dropped to 72.77. Ok, then we might doubt about its fundamentals and its future growth. Don't worry, here is why most analysts and institutions think MU is super undervalued and it is time to buy now.](https://preview.redd.it/debopnsz9sj71.png?width=1522&amp;format=png&amp;auto=webp&amp;s=2c8ed55ed03c8aea5fd0f96ca1658ec3c3c174b7)\n\n[Its FY1 is 12.13 which is already great, but its FY2 and 3 is 6.36 and 6.34 which is too great compared to others. So, it is a great time to buy it before all those number soar later.](https://preview.redd.it/j8azt162bsj71.png?width=1233&amp;format=png&amp;auto=webp&amp;s=240e36d04a518463049c783da3419a4fa7e969f1)\n\n[Their EPS and Revenue growth are also great too \\(beating all estimates for over 2 years\\). ](https://preview.redd.it/5puxp7macsj71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=86d8874f3047b816923bddb20285c12d75a0622c)\n\n3. Morgan Stanley, aka sneaky bitches, revealed a report 'winter is coming' or whatever, saying that DRAM memory chip price was already at the peak and it is going down now which will lead all DRAM company's profit to go down due to its historical data. However, most institutions and investors still believe that DRAM's demand is still too strong enough to cover that DRAM price drop, because all PCs, Servers, Laptops, smartphones, tablets, robots, cars, and anything that has automated computer system needs 'memory chip'. Semi industry has a bright future, and I think Morgan Stanley's report was just a manipulation in order to short the stock and buying it back at discounted price. This asshole bought SK hynix (2nd largest DRAM company) shares back after its correction in Korea. Its price was 120,000 Won before MS's report, and it dropped to 98,000 after its report and they started buying back from 100,000 now. ([https://finance.naver.com/item/main.nhn?code=000660#](https://finance.naver.com/item/main.nhn?code=000660#)). I still strongly believe that this stock will keep going up before tapering. (I hope the Fed does not mention about tapering at Jackson Hole).\n\n4. RSI number is important because we can know if the stock is overbought or not. The current market sentiment is unstable due to upcoming tapering, interest rates, inflation, national debts, infrastructure, etc. and most overbought stock have a high chance to meet its huge corrections later. Ok, so MU's current monthly RSI is 57. It is still in the middle which is a great number for tech growth stock. For example, Nvidia's monthly RSI is 86, AMD's monthly RSI is 85, AMAT is 75, TSM is 76, Qualcomm is 65, and ASML is 93. RSI does not explain everything, but it helps you to know that MU is pretty undervalued.\n\n5. Most great investors always say 'being simple is the best strategy'. I also believe that. Simply, we will make the money if we buy the GOOD stock in cheap way and sell it in expensive way. And simply, MU, a GOOD stock, is cheap now. \n\n6. Here is a better explanation about MU itself (my first MU DD) that shows why MU is a GOOD stock.  [https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron\\_will\\_eventually\\_rally\\_5080\\_upside\\_potential/](https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron_will_eventually_rally_5080_upside_potential/)\n\nThere is a high chance that the Fed will not mention about tapering at Jackson Hole meeting because of Delta variant problems and slower than expected economy recovery. If they don't, tech stocks have a higher chance to get pumped for a while, and indeed, undervalued stocks have the highest chance to soar. So I personally strongly believe that few more tailwinds can drive MU price up to 20-30% before its next earnings (Sep 27), and 60-100% in 3-6 months depending on market sentiment.\n\nIts current price targets are: Yahoo avg 115.59, Seeking Alpha avg 111.76, Marketwatch avg 115.85,    \n Tip Ranks: 112.64, Marketbeat: 112.07, CNN: 112.50.  Total Average PT: 113.40.\n\nIt is simple, but actually not easy. Buy it now since it is turning to bullish, and sell the news before it actually tanks again. If the tapering is coming? Buy the PUTs or wait until the price became cheap again with healthy correction. And then we get in the ride again when it starts pumping again. I think that is how you can survive in this stupid unpredictable market. I sometimes use option straddle strategy during this unpredictable market because all you need to do is choosing high volatility stocks (I might use this strategy for MU later since it has a high volatility, and the current market is unpredictable).\n\nMy positions:  24 Sep 72c x 7 , 24 Sep 68c x 10, owning 100 shares.\n\nIndeed, this is just my DD, no financial advice. \n\nThank you guys.",
        "subreddit": "wallstreetbets",
        "title": "MU, the most undervalued semi stock, has 20-30% upside potential in a month, 60-100% in 6 months (Sentiment turned to bullish this week, TIME TO BUY)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pcchyc/mu_the_most_undervalued_semi_stock_has_2030/",
        "created": 1630053859.0
    },
    {
        "author": "babbldev",
        "created_utc": 1630300457,
        "id": "pebkpo",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " My full review of stock market news sentiment, gathered by scraping 4,668 finance articles across 100+ publishers (Yahoo Finance, Motley Fool, Benzinga, SeekingAlpha, etc.) over the past week. The original version can be found [here](https://babbl.substack.com/p/goodbye-summer-hello-all-time-high?justPublished=true).\n\n**TLDR:** Stock market news sentiment was significantly bullish (ie. optimistic into the future) driven by new all-time high S&amp;P 500 and NASDAQ prices, Bitcoin eclipsing $50K benchmark, and regarding upcoming economic data to be released (jobs, housing, manufacturing reports next week). \n\n \n\n# 1. This Week’s News Sentiment 📰\n\nThis week’s stock market news bounced back towards significantly bullish sentiment, with the average article recording an optimistic 0.30 sentiment score (which is *double* the average sentiment score posted last week) and impressive 0.67 time-sense score; this means approximately one third of all sentences written about the markets this week leaned optimistically, and an overlapping two thirds of all sentences were written in future-tense. **Both scores add up to indicate that market conversation remains highly bullish, expressing high degrees of optimism about the future.** \n\n# 2. Most Mentioned Tickers 📊\n\n*Each week we analyze the number of headlines written about each stock and cryptocurrency. The most mentioned tickers in this week’s news and the tickers with the biggest volume increase compared to last week are shown here:* [most mentioned tickers 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4eeaf148-8cef-437e-b7fa-a4e10af08411_1231x1169.jpeg)\n\n 🍎 [**Apple Inc. ($AAPL)**](https://finance.yahoo.com/quote/TSLA/)**: The most-mentioned ticker in stock market news coverage this week was $AAPL.** The company’s stock finished the week at $148.60 per share, and showed moderate optimism expressed in news sentiment. Many of Apple’s headlines this week centered on CEO Tim Cook as he celebrated his 10-year anniversary in the pilot’s chair — per his contract with the company, he received 5-million shares of $AAPL stock this week to the tune of $750M, according to SEC filings. His influence on the company’s trajectory over the past decade has been undeniable, as he is now responsible for creating more shareholder value than any CEO *ever* ( ($2.1 trillion dollars, shown [here](http://%20%28%242.1%20trillion%20dollars%29/)). Other headlines from Apple came this week in the form of Warren Buffett wisdom, as the billionaire Berkshire CEO stated he’d be adding more shares of $AAPL to his portfolio as a hedge against rising inflation. Buffett — who himself ranks #7 on the list of all-time shareholder value produced — has been a long-time proponent of Apple, and [argues](https://finance.yahoo.com/news/10-best-stocks-buy-according-161829003.html) that now is a better time than ever to be purchasing the stock.  This week’s biggest $AAPL article:\n\n&gt;*“Apple's Cook receives, sells off over 5M shares of AAPL stock worth more than $750M”* | [Apple Insider](https://appleinsider.com/articles/21/08/26/apples-cook-receives-sells-off-over-5m-shares-of-aapl-stock-worth-more-than-750m)\n\n⛓️ [**Riot Blockchain Inc. ($RIOT)**](https://finance.yahoo.com/quote/RIOT/)**: Riot Blockchain saw this week’s biggest increase in news headlines compared to last week** after announcing its Q2 earnings report on Monday; average news sentiment expressed was moderately optimistic with a score of 0.32. The bitcoin-mining company posted a quarterly earnings-per-share of $0.22, broadly eclipsing its consensus analyst estimates of $0.02 and signaling immense improvement from its -$0.31 EPS loss posted a year ago. In the report, Riot reported Bitcoin mining revenues exceeding $31M, an astounding 1540% increase from last year, coupled with 70% increase in its mining revenue margins. The company attributed much of its mining capacity growth to its successful acquisition of Whinstone (an infrastructure provider), and to significant efforts related to de-risking its operational structure. With such encouraging numbers to report and with Bitcoin’s price re-eclipsing the $50K benchmark, $RIOT stock price grew 5.17% to $38.57 per share — a 1,007% increase in price from the same time last year. This week’s biggest $RIOT article:\n\n&gt;*“Riot Blockchain Records $31M In Bitcoin Mining Revenue, Up 1540% From Same Period Last YearRiot Blockchain Records $31M In Bitcoin Mining Revenue, Up 1540% From Same Period Last Year”* | [Yahoo Finance](https://finance.yahoo.com/news/riot-blockchain-records-31m-bitcoin-121940609.html)\n\n# 3. Sentiment Winners and Losers 👍👎\n\n*Each week we summarize the most extreme sentiment scores in the news for each ticker to help you decide where to focus your attention. By our analysis, here’s a look at which tickers scored the highest (and lowest) in terms of optimism, pessimism, speculation, and reaction expressed in last week’s news:* [most optimistic &amp; pessimistic tickers 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fed7ae131-4122-42a1-a212-303c0b9ce81a_2166x1290.png)\n\n🏬 [**Best Buy Inc. ($BBY):**](https://finance.yahoo.com/quote/BBY/) **This week’s most optimistic stock in news coverage was Best Buy** ***(optimism score: 59.7%).*** $BBY stock rose 3.98% to end the week back above its $115 price level after the company released Q2 earnings on Tuesday. In their quarterly report, Best Buy announced earnings a sales increase of 20% over the past 90-days, exceeding the forecast of 17% set by management in their previous report. The consumer electronics retailer attributed much of this growth to charging higher prices for products across their computing and premium home appliance segments, citing heightened demand for technology upgrades as people are beginning to permanently embrace habits like working from home and streaming TV. The ability to raise their margins across segments has boded well, allowing the company to achieve its highest profitability rate ever of more than 6% operating margins (see [chart](https://media.ycharts.com/charts/9d766a7052b6ce9fca69af524780fd8c.png)). This renewed reassurance of strong business growth after a string of week quarters financially has raised eyebrows across Wall Street, with the likes of Jim Cramer saying that Best Buy’s turnaround brings broader implications to the e-commerce landscape: “Best Buy’s basically replacing corporate tech support for remote works”. This week’s most optimistic $BBY news article:\n\n&gt;*“Best Buy Shares Rise on Earnings Beat, Retailer says Consumers are Upgrading Tech to Work at Home”* | [CNBC](https://www.cnbc.com/2021/08/24/best-buy-bby-earnings-q2-2022.html)\n\n🏭 [**Celanese Corp ($CE):**](https://finance.yahoo.com/quote/CE/) **This week’s most pessimistic stock in news coverage was Celanese*****(pessimism score: 47.6%).*** It should be noted that Celenese — a global hybrid chemical company based in Irving, Texas — was also the most speculative stock in news coverage three weeks ago, after the company announced a significant beat of its Q2 earnings estimates; since then the stock has moved steadily downhill for the most part. Despite $CE stock bouncing back this period up 3.4% to $160.25 per share, the company saw more pessimism expressed in news articles than any other ticker this week, driven by a string of negatively connotated articles written in responses to poor performance over the previous week (during which the company’s stock price fell for six consecutive days to more than 10% below its 52-week high from May). The company also announced this week that it would be offering up to € 300M towards the purchase of its outstanding 1.125% senior notes due in 2023. Compared to close competitors like Exxon Mobile Corp. ($XOM) and Eastman Chemical Co.($EMN), Celanese has underperformed its peers over the last 30 days as the earnings fervor subdues. Despite the downward trajectory of the recent months, many analysts argue that the company could remain a reliable long-term hold due to its consistent earnings and dividends. The most pessimistic article written about $CE this week:\n\n&gt;*“Celanese Corp. Stock Underperforms Comptitors with Losses on the Day”* | [MarketWatch](https://www.marketwatch.com/story/celanese-corp-stock-outperforms-competitors-despite-losses-on-the-day-01629405802-2f989e83d4f3)\n\n \n\n🧬 [**NeoGenomics Inc. ($NEO):**](https://finance.yahoo.com/quote/NEO/) **The stock with the most speculative (ie. future-tense) sentiment measured in the news this week was NeoGenomics** ***(speculation score: 94.8%).*** $NEO stock rose nearly 10% to $48.49 this week, yet still remains well below its 12-month high of $59.88 set back in February. The company — which specializes in high-complexity pharmaceutical information services for cancer genetics diagnostic testing — has been one of the more volatile stocks on the market in recent months, as investors have shown increased interest in unproven biomedical companies of the like. While some analysts contend that such companies are worth a gamble for their potential to achieve huge profitability in a blossoming healthcare sector, others say that $NEO’s balance sheet signals undue risk of permanent losses for investors. One major red flag is the company’s seeming incapability of paying its lenders, as it currently sits on a thrown of more than $533.4M worth of debt (an increase of $170.9M over the previous year). While NeoGenomics reported more than $571.7M in cash during its most recent earnings report, the runway toward achieving substantial profitability is finite. The question: can the company find consistent revenues before its debt burden grows unbearable? This week’s most speculative $NEO article:\n\n&gt;*“Is NeoGenomics a Risky Investment?”* | [Simply Wall St.](https://finance.yahoo.com/news/neogenomics-nasdaq-neo-risky-investment-125607745.html)\n\n🔉 [**Adobe Inc. ($ADBE):**](https://finance.yahoo.com/quote/ADBE/) **The stock with the most reactive (ie. past-tense) sentiment measured in the news this week was Adobe** ***(reaction score: 82.8%).*** After notching a new all-time high share price to end last week, $ADBE stock price rose another 2% to $658.52 on the week after the company announced it will acquire video-collaboration software producer Frame.io for $1.275B in the coming months. The strategic move could result in enhancements to the Creative Cloud software where Adobe derives a major part of its revenue (it includes the best-selling Premier Pro and After-Effects applications and accounted for more than 60% of the company’s sales last quarter, an increase of 24% compared to last year). The move also signals the company’s willingness to embrace collaboration-centric software, a trend we’ve seen across many SaaS companies catalyzed by the COVID-19 work-from-home movement. The acquisition will set Adobe up nicely on the enterprise side of the pie as well, as Frame.io boasts an existing portfolio of many prominent media customers, including Netflix, Turner, and Vice. The most reactive article published about $ADBE this week:\n\n&gt;*“Adobe says it will acquire video-collaboration software company Frame.io for $1.275 billion”* | [CNBC](https://www.cnbc.com/2021/08/19/adobe-to-acquire-video-software-company-frameio-for-1point275-billion.html)\n\n#  3b. Biggest Changes in Sentiment\n\n💱 **Cardano ($ADA) saw the largest increase in optimism expressed this week compared to last week.** The alt-coin, which now boasts the third-highest market capitalization of all cryptocurrencies, made waves in news coverage this week after eclipsing the $2.00 price benchmark last week and reaching a new all-time high price of $2.39 on Wednesday on the back of [comments](https://ambcrypto.com/hoskinson-says-cardano-is-on-a-different-path-than-ethereum-bitcoin/) from its outspoken founder Charles Hoskinson.\n\n💊 **CVS Health ($CVS) recorded the largest increase in pessimism expressed this week** after announcing that it would be limiting purchases of over-the-counter rapid COVID-19 tests in the coming weeks due to excess demand. While this news draws questions about the robustness of CVS’s supply chain, the main takeaway seems to be its implications about the current severity of the pandemic. Accordingly, $CVS stock price fell 1.97% on the week.\n\n🛍️ **ContextLogic Inc. ($WISH) posted the biggest increase in speculative language expressed this week compared to last.** This comes a week after $WISH stock fell 9% on disappointing Q2 earnings. Throughout this week, the stock rallied back more than 5% to $6.94 on heavy volume from retail traders on r/WallStreetBets and the like, leaving [analysts](https://investorplace.com/2021/08/wish-stock-is-worth-sticking-with-even-after-its-dismal-earnings-report/) to wonder if the stock is worth sticking around for. Other highly speculative tickers in news this week include Intel ($INTC), Peloton ($PTON), Skyworks ($SKWS), and Applied Materials ($AMAT).\n\n☕ **Starbucks Inc. ($SBUX) received the biggest increase in reactive language expressed** driven by a multitude of articles written about its recent ability to capture consumer trends as a business — including this [piece](https://www.fool.com/investing/2021/08/25/3-reasons-why-starbucks-could-win-as-students-retu/) which anticipates a bump in sales as college students return to in-person classes, and [social media buzz](https://twitter.com/uDontKnoDietz/status/1430589780799234059?s=20) driven by its early introduction of pumpkin spice-themed drinks -(before Labor Day? is that legal?). Other highly reactive tickers this week include Boeing ($BA), Walmart ($WMT), Invesco QQQ Trust ($QQQ), and IBM ($IBM).\n\n# 4. Market Mood Outlook 🌡️🔭\n\nThis week’s stock market news saw another boost in optimism back to its recent high levels as the markets peaked above new all-time high price points. Speculation in the news remains abound as we wrap up the month of August and transition into the final months of 2021. **While stocks have performed well in recent weeks on top of outstanding earnings reports across the board, inflationary pressures and economic uncertainty remain top of mind.**\n\nWe said it last week and we’ll say it again: the heightened optimism in the news is a reassuring hand in today’s market, but a signifcant shift in mood or economic catalysts (or some combination of the two, realistically) have the potential to bring the market back down to Earth. We will look ahead to vital economic reports (and their reactions) this week, including: housing data to be released Tuesday, manufacturing and service economy trends to be released Wednesday and Friday, and August’s monthly job report due Friday.\n\nWith this in mind, good luck to all in this final week of trading before Labor Day. Stay tuned later this week for an extra newsletter about what we are reading heading into this Fall, and some in-depth analysis about what we saw in the news over the month of August. That’s all for today’s report; thanks for reading. 🙏",
        "subreddit": "StockMarket",
        "title": "FULL REVIEW: stock market news sentiment report 8/23-8/27",
        "url": "https://www.reddit.com/r/StockMarket/comments/pebkpo/full_review_stock_market_news_sentiment_report/",
        "created": 1630329257.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629492126,
        "id": "p8djbc",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Friday, August 20, 2021**\n\nStocks rose today, recovering some of the losses from earlier this week as market participants shake off some taper concerns. Market participants continue to weigh several factors affecting the market, including but not limited to (1) the taper timeline, (2) record-breaking corporate earnings, (3) and surging coronavirus delta variant infections. \n\nThe S&amp;P 500 (SPY) rose 0.79% today, recovering earlier losses, but finished the week 0.31% down. The Nasdaq (QQQ) rose 1.04% today and staged a remarkable comeback this week, coming from 2% down Thursday to finishing 0.01% higher. The Dow Jones (DIA) rose 0.65% today but finished the week 0.96% down, underperforming the other two major indexes. The Russell 2000 (IWM), which tracks the performance of small-caps, rose 1.68% today but finished the week 1.98% down.\n\nOn Wednesday, meeting minutes suggested members of the Federal Reserve were advancing the debate over the timing and scope of tapering the pace of the pandemic-era asset purchasing program. In the latest minutes, the Fed said, “looking ahead, most participants noted that, provided that the economy were to evolve broadly as anticipated, they judged it could be appropriate to start reducing the pace of asset purchases this year.”As I said above, this makes a lot of sense judging how the economy has also so far rebounded at a faster pace than expected. Given this record-breaking quarter in terms of corporate earnings and improving labor market conditions, the economy is beginning to be able to stand on its own without all the pandemic-era support. However, while progress has been made, the Fed’s goal has not yet been reached. The meeting minutes said, “ most participants judged that the Committee’s standard of “substantial further progress” toward the maximum-employment goal had not yet been met.” \n\nIn order to stave off another “taper tantrum” and directly address interest rates concerns, the minutes explicitly stressed the need to “reaffirm the absence of any mechanical link between the timing of tapering and that of an eventual increase in the target range for the federal funds rate.” Participants voted to maintain the interest rate near zero. I cannot stress this enough, potential interest rate hikes in 2023 will be the real test for equities. Until then I remain very bullish and will continue buying up every dip (has worked wonderfully so far). Of this, the meeting minutes said, “A couple of participants also noted that a tapering of asset purchases did not amount to a tightening of the stance of monetary policy and instead only implied that additional monetary accommodation would be provided at a slower rate.”\n\nRead the full meeting minutes here: [https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf](https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf)\n\nAs of yesterday, 91% of companies in the SPY have reported Q2 earnings, with 87% of these topping consensus estimates on earnings per share, according to data compiled by FactSet. The expected, year-over-year overall growth rate for the SPY currently stands at 89.3%, the fastest increase since the Q4 2009. David Kostin, Chief US Equity Strategist at Goldman Sachs, said “In an earnings season with many surprises – including the highest frequency of EPS \\[earnings per share\\] beats in our 22-year data history – one of the most notable was the surge in corporate buyback activity. Strong corporate equity demand is one reason we forecast a 5% return to our SPY year-end target of $470”\n\nThe U.S. now has an average of 143,827 new COVID-19 cases per day as of yesterday, a rate that has doubled in a little over two weeks, the number of hospitalized is at a six month high, and roughly 911 people are dying each day, triple the death rate seen in late July. For context, the US was averaging roughly 20,000 new cases per day on July 1.\n\nHowever, while this is definitely not good, it is important to mention that cases remain highly concentrated in areas of high vaccine hesitancy. According to John Hopkins University, almost ⅓ of all COVID hospitalizations in the US are in Texas or Florida. \n\nAccording to data analysis by the Associated Press using data through May 2021, shows that 98.9% of those hospitalized with COVID are unvaccinated (only 1,200 of 107,000 hospitalizations as of May 2021). Dr. Rochelle Wolensky, Director of the Center for Disease Control and Prevention (CDC), said “There is a clear message that is coming through: This is becoming a pandemic of the unvaccinated. Our biggest concern is we are going to continue to see preventable cases, hospitalizations and sadly deaths among the unvaccinated.”\n\n**Highlights**\n\n* The price of digital currencies surged after Coinbase (COIN) announced it was investing $500 million and would allocate 10% of quarterly profits into a digital currency portfolio. \n* Yesterday was Tesla AI Day, in which the company unveiled new technologies and ideas the company is working on. Among the most interesting was a humanoid robot that will be operated using Tesla’s full-self driving technology (FSD). The robot is designed to do “dangerous, repetitive, boring tasks” according to Elon Musk. Interesting to say the least.\n* Microsoft (MSFT) boosted the price of Office 365 for the first time since the service was launched a decade ago. This caused the surge to spike to a new all-time high. The company said collaboration tools now used by more than 250 million monthly active users\n* After 70 years, the MLB dropped Topps as the creator of the iconic baseball cards. As a result, Topps merger into the market was terminated a day before shareholders were set to vote.\n* Shares of Nvidia (NVDA) continued beasting after smashing earnings and raising guidance moving forward. I love this stock so much\n* Shares of Alibaba (BABA) continue to bleed among the regulatory crackdown by the Chinese Communist Party. The stock is now way below even March 2020 level and is trading at the lowest level since June 2019.\n* Facebook (FB) unveiled a new product called “Horizon Workrooms”, which is a VR powered, remote work app that uses the company Oculus Rift headset. Zuckerberg called it the first step in building a “metaverse”, which is a collectively-shared virtual space where people are able to interact using avatars. This seems like the next big trend among giant internet companies.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AbbVie (ABBV) target raised by SVB Leerink from $145 to $148 at Outperform. Stock currently around $119\n* Applied Materials (AMAT) with two target raises. Stock currently around $127\n   * Mizuho from $158 to $161 at Buy\n   * Morgan Stanley from $139 to $150 at Equal-Weight\n* Invitation Homes (INVH) target raised by Morgan Stanley from $45 to $48.50 at Overweight. Stock currently around $40.50\n* Microsoft (MSFT) with two target raises. Stock currently around $304\n   * UBS Group from $325 to $350 at Buy\n   * Wedbush from $325 to $350 at Outperform\n* Peloton Interaction (PTON) target raised by MKM Partners from $110 to $130 at Buy. Stock currently around $108\n* Sherwin Williams (SHW) target raised by Morgan Stanley from $315 to $345 at Overweight. Stock currently around $307\n* Tapestry (TPR) target raised by Robert W Baird from $58 to $60 at Outperform. Stock currently around $40.50\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices not a risk, but it is an opportunity. Where else do you look for cheap stocks?” - Li Lu",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, August 20, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/p8djbc/here_is_a_market_recap_for_today_friday_august_20/",
        "created": 1629520926.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1629485526,
        "id": "p8bgee",
        "num_comments": 4,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "$AMAT to the Moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p8bgee/amat_to_the_moon/",
        "created": 1629514326.0
    },
    {
        "author": "Spiritual_Exchange47",
        "created_utc": 1629628473,
        "id": "p9a7l6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Applied Materials (AMAT) Tops Q3 EPS\n\nQ3 EPS of $1.90 - $0.13 better than the analyst estimate of $1.77.\n\nRevenue: $6.2B vs $5.94 Consensus\n\n**GUIDANCE:**\n\nQ4 2021 EPS of $1.87-$2.01 versus the consensus of $1.81.\n\nQ4 2021 Revenue: $6.08-6.58 billion, versus the consensus of $6.04 billion.\n\n&amp;#x200B;\n\nMy Position\n\n09/17 Call 140 USD",
        "subreddit": "wallstreetbets",
        "title": "Applied Materials Inc. ( $AMAT ) Earnings Thread — VERY BULLISH!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p9a7l6/applied_materials_inc_amat_earnings_thread_very/",
        "created": 1629657273.0
    },
    {
        "author": "babbldev",
        "created_utc": 1630355026,
        "id": "peqcg7",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/2dl2qtpgzjk71.jpg?width=1231&amp;format=pjpg&amp;auto=webp&amp;s=7abb4a239e1c2d5e7ccfbd618e7b838f6d64bb69\n\nMy full review of stock market news sentiment, gathered by scraping 4,668 finance articles across 100+ publishers (Yahoo Finance, Motley Fool, Benzinga, SeekingAlpha, etc.) over the past week. The original version can be found [here](https://babbl.substack.com/p/goodbye-summer-hello-all-time-high?justPublished=true).\n\n**TLDR:** Stock market news sentiment was significantly bullish (ie. optimistic into the future) driven by new all-time high S&amp;P 500 and NASDAQ prices, B!tcoin eclipsing $50K benchmark, and regarding upcoming economic data to be released (jobs, housing, manufacturing reports next week).\n\n# 1. This Week’s News Sentiment 📰\n\nThis week’s stock market news bounced back towards significantly bullish sentiment, with the average article recording an optimistic 0.30 sentiment score (which is *double* the average sentiment score posted last week) and impressive 0.67 time-sense score; this means approximately one third of all sentences written about the markets this week leaned optimistically, and an overlapping two thirds of all sentences were written in future-tense. **Both scores add up to indicate that market conversation remains highly bullish, expressing high degrees of optimism about the future.** \n\n# 2. Most Mentioned Tickers 📊\n\n*Each week we analyze the number of headlines written about each stock and cryptocurrency. The most mentioned tickers in this week’s news and the tickers with the biggest volume increase compared to last week are shown here:* [Most Mentioned Tickers Table 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4eeaf148-8cef-437e-b7fa-a4e10af08411_1231x1169.jpeg)\n\n🍎 [**Apple Inc. ($AAPL)**](https://finance.yahoo.com/quote/TSLA/)**: The most-mentioned ticker in stock market news coverage this week was $AAPL.** The company’s stock finished the week at $148.60 per share, and showed moderate optimism expressed in news sentiment. Many of Apple’s headlines this week centered on CEO Tim Cook as he celebrated his 10-year anniversary in the pilot’s chair — per his contract with the company, he received 5-million shares of $AAPL stock this week to the tune of $750M, according to SEC filings. His influence on the company’s trajectory over the past decade has been undeniable, as he is now responsible for creating more shareholder value than any CEO *ever* ( ($2.1 trillion dollars, shown [here](http://%20%28%242.1%20trillion%20dollars%29/)). Other headlines from Apple came this week in the form of Warren Buffett wisdom, as the billionaire Berkshire CEO stated he’d be adding more shares of $AAPL to his portfolio as a hedge against rising inflation. Buffett — who himself ranks #7 on the list of all-time shareholder value produced — has been a long-time proponent of Apple, and [argues](https://finance.yahoo.com/news/10-best-stocks-buy-according-161829003.html) that now is a better time than ever to be purchasing the stock. This week’s biggest $AAPL article:\n\n&gt;*“Apple's Cook receives, sells off over 5M shares of AAPL stock worth more than $750M”* | [Apple Insider](https://appleinsider.com/articles/21/08/26/apples-cook-receives-sells-off-over-5m-shares-of-aapl-stock-worth-more-than-750m)\n\n⛓️ [**Riot Blockchain Inc. ($RIOT)**](https://finance.yahoo.com/quote/RIOT/)**: Riot Blockchain saw this week’s biggest increase in news headlines compared to last week** after announcing its Q2 earnings report on Monday; average news sentiment expressed was moderately optimistic with a score of 0.32. The B!tcoin-mining company posted a quarterly earnings-per-share of $0.22, broadly eclipsing its consensus analyst estimates of $0.02 and signaling immense improvement from its -$0.31 EPS loss posted a year ago. In the report, Riot reported B!tcoin-mining revenues exceeding $31M, an astounding 1540% increase from last year, coupled with 70% increase in its mining revenue margins. The company attributed much of its mining capacity growth to its successful acquisition of Whinstone (an infrastructure provider), and to significant efforts related to de-risking its operational structure. With such encouraging numbers to report and with B!tcoin’s price re-eclipsing the $50K benchmark, $RIOT stock price grew 5.17% to $38.57 per share — a 1,007% increase in price from the same time last year. This week’s biggest $RIOT article:\n\n&gt;*“Riot Blockchain Records $31M In B!itcoin Mining Revenue, Up 1540% From Same Period Last YearRiot Blockchain Records $31M In* B!tcoin *Mining Revenue, Up 1540% From Same Period Last Year”* | [Yahoo Finance](https://finance.yahoo.com/news/riot-blockchain-records-31m-bitcoin-121940609.html)\n\n# 3. Sentiment Winners and Losers 👍👎\n\n*Each week we summarize the most extreme sentiment scores in the news for each ticker to help you decide where to focus your attention. By our analysis, here’s a look at which tickers scored the highest (and lowest) in terms of optimism, pessimism, speculation, and reaction expressed in last week’s news:* [Ticker News Sentiment Chart 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fed7ae131-4122-42a1-a212-303c0b9ce81a_2166x1290.png)\n\n🏬 [**Best Buy Inc. ($BBY):**](https://finance.yahoo.com/quote/BBY/) **This week’s most optimistic stock in news coverage was Best Buy** ***(optimism score: 59.7%).*** $BBY stock rose 3.98% to end the week back above its $115 price level after the company released Q2 earnings on Tuesday. In their quarterly report, Best Buy announced earnings a sales increase of 20% over the past 90-days, exceeding the forecast of 17% set by management in their previous report. The consumer electronics retailer attributed much of this growth to charging higher prices for products across their computing and premium home appliance segments, citing heightened demand for technology upgrades as people are beginning to permanently embrace habits like working from home and streaming TV. The ability to raise their margins across segments has boded well, allowing the company to achieve its highest profitability rate ever of more than 6% operating margins (see [chart](https://media.ycharts.com/charts/9d766a7052b6ce9fca69af524780fd8c.png)). This renewed reassurance of strong business growth after a string of week quarters financially has raised eyebrows across Wall Street, with the likes of Jim Cramer saying that Best Buy’s turnaround brings broader implications to the e-commerce landscape: “Best Buy’s basically replacing corporate tech support for remote works”. This week’s most optimistic $BBY news article:\n\n&gt;*“Best Buy Shares Rise on Earnings Beat, Retailer says Consumers are Upgrading Tech to Work at Home”* | [CNBC](https://www.cnbc.com/2021/08/24/best-buy-bby-earnings-q2-2022.html)\n\n🏭 [**Celanese Corp ($CE):**](https://finance.yahoo.com/quote/CE/) **This week’s most pessimistic stock in news coverage was Celanese*****(pessimism score: 47.6%).*** It should be noted that Celenese — a global hybrid chemical company based in Irving, Texas — was also the most speculative stock in news coverage three weeks ago, after the company announced a significant beat of its Q2 earnings estimates; since then the stock has moved steadily downhill for the most part. Despite $CE stock bouncing back this period up 3.4% to $160.25 per share, the company saw more pessimism expressed in news articles than any other ticker this week, driven by a string of negatively connotated articles written in responses to poor performance over the previous week (during which the company’s stock price fell for six consecutive days to more than 10% below its 52-week high from May). The company also announced this week that it would be offering up to € 300M towards the purchase of its outstanding 1.125% senior notes due in 2023. Compared to close competitors like Exxon Mobile Corp. ($XOM) and Eastman Chemical Co.($EMN), Celanese has underperformed its peers over the last 30 days as the earnings fervor subdues. Despite the downward trajectory of the recent months, many analysts argue that the company could remain a reliable long-term hold due to its consistent earnings and dividends. The most pessimistic article written about $CE this week:\n\n&gt;*“Celanese Corp. Stock Underperforms Comptitors with Losses on the Day”* | [MarketWatch](https://www.marketwatch.com/story/celanese-corp-stock-outperforms-competitors-despite-losses-on-the-day-01629405802-2f989e83d4f3)\n\n### Biggest Mood Swings and Changes 🎭🔀\n\n*Each week we compare the sentiment of each ticker to its sentiment from the previous week. Presented below are the tickers that saw the biggest change in eah of our four sentiment metrics this week compared to last.* [Biggest Ticker Sentiment Changes 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F03e21704-47a6-4aee-aa44-ce645b144302_1899x756.png)\n\n💱 **Cardano ($ADA) saw the largest increase in optimism expressed this week compared to last week.** The alt-coin, which now boasts the third-highest market capitalization of all cryptocurrencies, made waves in news coverage this week after eclipsing the $2.00 price benchmark last week and reaching a new all-time high price of $2.39 on Wednesday on the back of [comments](https://ambcrypto.com/hoskinson-says-cardano-is-on-a-different-path-than-ethereum-bitcoin/) from its outspoken founder Charles Hoskinson.\n\n💊 **CVS Health ($CVS) recorded the largest increase in pessimism expressed this week** after announcing that it would be limiting purchases of over-the-counter rapid COVID-19 tests in the coming weeks due to excess demand. While this news draws questions about the robustness of CVS’s supply chain, the main takeaway seems to be its implications about the current severity of the pandemic. Accordingly, $CVS stock price fell 1.97% on the week.\n\n🛍️ **ContextLogic Inc. ($WISH) posted the biggest increase in speculative language expressed this week compared to last.** This comes a week after $WISH stock fell 9% on disappointing Q2 earnings. Throughout this week, the stock rallied back more than 5% to $6.94 on heavy volume from retail traders on r/WallStreetBets and the like, leaving [analysts](https://investorplace.com/2021/08/wish-stock-is-worth-sticking-with-even-after-its-dismal-earnings-report/) to wonder if the stock is worth sticking around for. Other highly speculative tickers in news this week include Intel ($INTC), Peloton ($PTON), Skyworks ($SKWS), and Applied Materials ($AMAT).\n\n☕ **Starbucks Inc. ($SBUX) received the biggest increase in reactive language expressed** driven by a multitude of articles written about its recent ability to capture consumer trends as a business — including this [piece](https://www.fool.com/investing/2021/08/25/3-reasons-why-starbucks-could-win-as-students-retu/) which anticipates a bump in sales as college students return to in-person classes, and [social media buzz](https://twitter.com/uDontKnoDietz/status/1430589780799234059?s=20) driven by its early introduction of pumpkin spice-themed drinks -(before Labor Day? is that legal?). Other highly reactive tickers this week include Boeing ($BA), Walmart ($WMT), Invesco QQQ Trust ($QQQ), and IBM ($IBM).\n\n# 4. Market Mood Outlook 🌡️🔭\n\nThis week’s stock market news saw another boost in optimism back to its recent high levels as the markets peaked above new all-time high price points. Speculation in the news remains abound as we wrap up the month of August and transition into the final months of 2021. **While stocks have performed well in recent weeks on top of outstanding earnings reports across the board, inflationary pressures and economic uncertainty remain top of mind.**\n\nWe said it last week and we’ll say it again: the heightened optimism in the news is a reassuring hand in today’s market, but a signifcant shift in mood or economic catalysts (or some combination of the two, realistically) have the potential to bring the market back down to Earth. We will look ahead to vital economic reports (and their reactions) this week, including: housing data to be released Tuesday, manufacturing and service economy trends to be released Wednesday and Friday, and August’s monthly job report due Friday.\n\nWith this in mind, good luck to all in this final week of trading before Labor Day. Stay tuned later this week for an extra newsletter about what we are reading heading into this Fall, and some in-depth analysis about what we saw in the news over the month of August. That’s all for today’s report; thanks for reading. 🙏",
        "subreddit": "wallstreetbets",
        "title": "FULL REVIEW: Stock market news sentiment report 8/23-8/27",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/peqcg7/full_review_stock_market_news_sentiment_report/",
        "created": 1630383826.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1629485492,
        "id": "p8bg0n",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "10K $AMAT YOLO",
        "url": "https://i.redd.it/rms97os27ki71.png",
        "created": 1629514292.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1629485452,
        "id": "p8bfjz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "$AMAT TO THE MOON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p8bfjz/amat_to_the_moon/",
        "created": 1629514252.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1630025585,
        "id": "pccn95",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " Most great semi stocks are already priced in or overvalued, and we smart experienced apes know that you never buy overvalued stocks because its potential gain is small and its potential loss is too big.\n\nTherefore, we need to buy the stock that is undervalued but eventually goes up to meet its price target later because of its strong fundamentals and future growth (which is MU). And why do we need to pick semi stocks for this? Because Semiconductor business is one of the most potential and profitable business in the whole industry; we simply think that everything is turning to digital and AI systems, and all those devices, platforms, and servers need memory chips. Biden's infrastructure bills and his willingness to support semi industry are also tailwinds of semi stocks.\n\nOk, so why MU is the most undervalued stock among all semiconductors now?\n\nBecause it is ridiculously cheap! 7x forward price to earnings multiple now, and even though it actually have a slowdown in memory chip industry, it is still 10-12x forward earnings which is still ridiculously cheap compared to other semi stocks. (According to Quint Tatro, Joule Financial founder at CNBC).\n\nMU's 52 week high is 96.96, and its current price is 72.77. It showed some high volatility and corrections after its ATH because it went up too fast in short time (52 week low is 43.67). The last large correction made MU's price down from 83 to 68.80 which was 17% down in 4 days. This correction happened because of Morgan Stanley's report that says 'winter is coming' for semis. However, all other institutions and investors, including Goldman Sachs, Bofa, Jim Cramer, think that MU is way undervalued, and its price is at the bottom now. Vanguard Group, Sanders Capital, and State Street, top 5 MU shareholders, added MU positions between August 6 to August 16 . Since many institutions and large investors start to buy MU back, its price went up from 68 to 77, and then it dropped to 73 today due to the red market and some sell offs.\n\nReasons why this is a great timing to buy MU now\n\n1. The sentiment turned to bullish. It kept going up since it hit its bottom price 68, and yesterday, August 25th, it pumped from 73 to 77 in few minutes, closed at 74, and the current price is 72.77 now. Great buying point before it keeps pumping after this Jackson Hole meeting.\n2. Too CHEAP compared to ALL other semis. Here is the picture. \n\n[As you can see, MU is -23.64&amp;#37; from 52 week High on August 25, it has a more discount today since it dropped to 72.77. Ok, then we might doubt about its fundamentals and its future growth. Don't worry, here is why most analysts and institutions think MU is super undervalued and it is time to buy now.](https://preview.redd.it/ukiud4jlssj71.png?width=1522&amp;format=png&amp;auto=webp&amp;s=55d2fafe95240732779838488b931141d4da000f)\n\n[Its FY1 is 12.13 which is already great, but its FY2 and 3 is 6.36 and 6.34 which is too great compared to others. So, it is a great time to buy it before all those number soar later.](https://preview.redd.it/nvwzxklnssj71.png?width=1233&amp;format=png&amp;auto=webp&amp;s=54c8b095a81474a901030f03901d1bf9cfbe1791)\n\nTheir EPS and Revenue growth are also great too (beating all estimates for over 2 years).\n\nhttps://preview.redd.it/kqyog9xpssj71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=e9b57343b4c82f4737d38eebb958ca559997c3de\n\n3. Morgan Stanley, aka sneaky bitches, revealed a report 'winter is coming' or whatever, saying that DRAM memory chip price was already at the peak and it is going down now which will lead all DRAM company's profit to go down due to its historical data. However, most institutions and investors still believe that DRAM's demand is still too strong enough to cover that DRAM price drop, because all PCs, Servers, Laptops, smartphones, tablets, robots, cars, and anything that has automated computer system needs 'memory chip'. Semi industry has a bright future, and I think Morgan Stanley's report was just a manipulation in order to short the stock and buying it back at discounted price. This asshole bought SK hynix (2nd largest DRAM company) shares back after its correction in Korea. Its price was 120,000 Won before MS's report, and it dropped to 98,000 after its report and they started buying back from 100,000 now. ([https://finance.naver.com/item/main.nhn?code=000660#](https://finance.naver.com/item/main.nhn?code=000660#)). I still strongly believe that this stock will keep going up before tapering. (I hope the Fed does not mention about tapering at Jackson Hole).\n\n4. RSI number is important because we can know if the stock is overbought or not. The current market sentiment is unstable due to upcoming tapering, interest rates, inflation, national debts, infrastructure, etc. and most overbought stock have a high chance to meet its huge corrections later. Ok, so MU's current monthly RSI is 57. It is still in the middle which is a great number for tech growth stock. For example, Nvidia's monthly RSI is 86, AMD's monthly RSI is 85, AMAT is 75, TSM is 76, Qualcomm is 65, and ASML is 93. RSI does not explain everything, but it helps you to know that MU is pretty undervalued.\n\n5. Most great investors always say 'being simple is the best strategy'. I also believe that. Simply, we will make the money if we buy the GOOD stock in cheap way and sell it in expensive way. And simply, MU, a GOOD stock, is cheap now.\n\n6. Here is a better explanation about MU itself (my first MU DD) that shows why MU is a GOOD stock. [https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron\\_will\\_eventually\\_rally\\_5080\\_upside\\_potential/](https://www.reddit.com/r/wallstreetbets/comments/osbr7k/micron_will_eventually_rally_5080_upside_potential/)\n\nThere is a high chance that the Fed will not mention about tapering at Jackson Hole meeting because of Delta variant problems and slower than expected economy recovery. If they don't, tech stocks have a higher chance to get pumped for a while, and indeed, undervalued stocks have the highest chance to soar. So I personally strongly believe that few more tailwinds can drive MU price up to 20-30% before its next earnings (Sep 27), and 60-100% in 3-6 months depending on market sentiment.\n\nIts current price targets are: Yahoo avg 115.59, Seeking Alpha avg 111.76, Marketwatch avg 115.85,  \nTip Ranks: 112.64, Marketbeat: 112.07, CNN: 112.50. Total Average PT: 113.40.\n\nIt is simple, but actually not easy. Buy it now since it is turning to bullish, and sell the news before it actually tanks again. If the tapering is coming? Buy the PUTs or wait until the price became cheap again with healthy correction. And then we get in the ride again when it starts pumping again. I think that is how you can survive in this stupid unpredictable market. I sometimes use option straddle strategy during this unpredictable market because all you need to do is choosing high volatility stocks (I might use this strategy for MU later since it has a high volatility, and the current market is unpredictable).\n\nMy positions: 24 Sep 72c x 7 , 24 Sep 68c x 10, owning 100 shares.\n\nIndeed, this is just my DD, no financial advice.\n\nThank you guys.",
        "subreddit": "wallstreetbets",
        "title": "MU, the most undervalued semi stock, has 20-30% upside potential in a month, and has 60-100% upside potential in 3-6 months. (The sentiment has been changed to bullish this week, a GREAT TIME TO BUY).",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pccn95/mu_the_most_undervalued_semi_stock_has_2030/",
        "created": 1630054385.0
    },
    {
        "author": "babbldev",
        "created_utc": 1630355242,
        "id": "peqeza",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/8u8uu1oj1kk71.jpg?width=1231&amp;format=pjpg&amp;auto=webp&amp;s=f3ab100dd06c00b6e7cdb66a3360f61fc62f656d\n\nMy full review of stock market news sentiment, gathered by scraping 4,668 finance articles across 100+ publishers (Yahoo Finance, Motley Fool, Benzinga, etc.) over the past week. The original version can be found [here](https://babbl.substack.com/p/goodbye-summer-hello-all-time-high?justPublished=true).\n\n**TLDR:** Stock market news sentiment was significantly bullish (ie. optimistic into the future) driven by new all-time high S&amp;P 500 and NASDAQ prices, B!tcoin eclipsing $50K benchmark, and regarding upcoming economic data to be released (jobs, housing, manufacturing reports next week).\n\n# 1. This Week’s News Sentiment 📰\n\nThis week’s stock market news bounced back towards significantly bullish sentiment, with the average article recording an optimistic 0.30 sentiment score (which is *double* the average sentiment score posted last week) and impressive 0.67 time-sense score; this means approximately one third of all sentences written about the markets this week leaned optimistically, and an overlapping two thirds of all sentences were written in future-tense. **Both scores add up to indicate that market conversation remains highly bullish, expressing high degrees of optimism about the future.**\n\n# 2. Most Mentioned Tickers 📊\n\n*Each week we analyze the number of headlines written about each stock and cryptocurrency. The most mentioned tickers in this week’s news and the tickers with the biggest volume increase compared to last week are shown here:* [Most Mentioned Tickers Table 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4eeaf148-8cef-437e-b7fa-a4e10af08411_1231x1169.jpeg)\n\n🍎 [**Apple Inc. ($AAPL)**](https://finance.yahoo.com/quote/TSLA/)**: The most-mentioned ticker in stock market news coverage this week was $AAPL.** The company’s stock finished the week at $148.60 per share, and showed moderate optimism expressed in news sentiment. Many of Apple’s headlines this week centered on CEO Tim Cook as he celebrated his 10-year anniversary in the pilot’s chair — per his contract with the company, he received 5-million shares of $AAPL stock this week to the tune of $750M, according to SEC filings. His influence on the company’s trajectory over the past decade has been undeniable, as he is now responsible for creating more shareholder value than any CEO *ever* ( ($2.1 trillion dollars, shown [here](http://%20%28%242.1%20trillion%20dollars%29/)). Other headlines from Apple came this week in the form of Warren Buffett wisdom, as the billionaire Berkshire CEO stated he’d be adding more shares of $AAPL to his portfolio as a hedge against rising inflation. Buffett — who himself ranks #7 on the list of all-time shareholder value produced — has been a long-time proponent of Apple, and [argues](https://finance.yahoo.com/news/10-best-stocks-buy-according-161829003.html) that now is a better time than ever to be purchasing the stock. This week’s biggest $AAPL article:\n\n&gt;*“Apple's Cook receives, sells off over 5M shares of AAPL stock worth more than $750M”* | [Apple Insider](https://appleinsider.com/articles/21/08/26/apples-cook-receives-sells-off-over-5m-shares-of-aapl-stock-worth-more-than-750m)\n\n⛓️ [**Riot Blockchain Inc. ($RIOT)**](https://finance.yahoo.com/quote/RIOT/)**: Riot Blockchain saw this week’s biggest increase in news headlines compared to last week** after announcing its Q2 earnings report on Monday; average news sentiment expressed was moderately optimistic with a score of 0.32. The B!tcoin-mining company posted a quarterly earnings-per-share of $0.22, broadly eclipsing its consensus analyst estimates of $0.02 and signaling immense improvement from its -$0.31 EPS loss posted a year ago. In the report, Riot reported B!tcoin-mining revenues exceeding $31M, an astounding 1540% increase from last year, coupled with 70% increase in its mining revenue margins. The company attributed much of its mining capacity growth to its successful acquisition of Whinstone (an infrastructure provider), and to significant efforts related to de-risking its operational structure. With such encouraging numbers to report and with B!tcoin’s price re-eclipsing the $50K benchmark, $RIOT stock price grew 5.17% to $38.57 per share — a 1,007% increase in price from the same time last year. This week’s biggest $RIOT article:\n\n&gt;*“Riot Blockchain Records $31M In B!itcoin Mining Revenue, Up 1540% From Same Period Last YearRiot Blockchain Records $31M In* B!tcoin *Mining Revenue, Up 1540% From Same Period Last Year”* | [Yahoo Finance](https://finance.yahoo.com/news/riot-blockchain-records-31m-bitcoin-121940609.html)\n\n# 3. Sentiment Winners and Losers 👍👎\n\n*Each week we summarize the most extreme sentiment scores in the news for each ticker to help you decide where to focus your attention. By our analysis, here’s a look at which tickers scored the highest (and lowest) in terms of optimism, pessimism, speculation, and reaction expressed in last week’s news:* [Ticker News Sentiment Chart 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fed7ae131-4122-42a1-a212-303c0b9ce81a_2166x1290.png)\n\n🏬 [**Best Buy Inc. ($BBY):**](https://finance.yahoo.com/quote/BBY/) **This week’s most optimistic stock in news coverage was Best Buy** ***(optimism score: 59.7%).*** $BBY stock rose 3.98% to end the week back above its $115 price level after the company released Q2 earnings on Tuesday. In their quarterly report, Best Buy announced earnings a sales increase of 20% over the past 90-days, exceeding the forecast of 17% set by management in their previous report. The consumer electronics retailer attributed much of this growth to charging higher prices for products across their computing and premium home appliance segments, citing heightened demand for technology upgrades as people are beginning to permanently embrace habits like working from home and streaming TV. The ability to raise their margins across segments has boded well, allowing the company to achieve its highest profitability rate ever of more than 6% operating margins (see [chart](https://media.ycharts.com/charts/9d766a7052b6ce9fca69af524780fd8c.png)). This renewed reassurance of strong business growth after a string of week quarters financially has raised eyebrows across Wall Street, with the likes of Jim Cramer saying that Best Buy’s turnaround brings broader implications to the e-commerce landscape: “Best Buy’s basically replacing corporate tech support for remote works”. This week’s most optimistic $BBY news article:\n\n&gt;*“Best Buy Shares Rise on Earnings Beat, Retailer says Consumers are Upgrading Tech to Work at Home”* | [CNBC](https://www.cnbc.com/2021/08/24/best-buy-bby-earnings-q2-2022.html)\n\n🏭 [**Celanese Corp ($CE):**](https://finance.yahoo.com/quote/CE/) **This week’s most pessimistic stock in news coverage was Celanese**\\*\\*\\*(pessimism score: 47.6%).\\*\\*\\* It should be noted that Celenese — a global hybrid chemical company based in Irving, Texas — was also the most speculative stock in news coverage three weeks ago, after the company announced a significant beat of its Q2 earnings estimates; since then the stock has moved steadily downhill for the most part. Despite $CE stock bouncing back this period up 3.4% to $160.25 per share, the company saw more pessimism expressed in news articles than any other ticker this week, driven by a string of negatively connotated articles written in responses to poor performance over the previous week (during which the company’s stock price fell for six consecutive days to more than 10% below its 52-week high from May). The company also announced this week that it would be offering up to € 300M towards the purchase of its outstanding 1.125% senior notes due in 2023. Compared to close competitors like Exxon Mobile Corp. ($XOM) and Eastman Chemical Co.($EMN), Celanese has underperformed its peers over the last 30 days as the earnings fervor subdues. Despite the downward trajectory of the recent months, many analysts argue that the company could remain a reliable long-term hold due to its consistent earnings and dividends. The most pessimistic article written about $CE this week:\n\n&gt;*“Celanese Corp. Stock Underperforms Comptitors with Losses on the Day”* | [MarketWatch](https://www.marketwatch.com/story/celanese-corp-stock-outperforms-competitors-despite-losses-on-the-day-01629405802-2f989e83d4f3)\n\n## Biggest Mood Swings and Changes 🎭🔀\n\n*Each week we compare the sentiment of each ticker to its sentiment from the previous week. Presented below are the tickers that saw the biggest change in eah of our four sentiment metrics this week compared to last.* [Biggest Ticker Sentiment Changes 8/23-8/27](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F03e21704-47a6-4aee-aa44-ce645b144302_1899x756.png)\n\n💱 **Cardano ($ADA) saw the largest increase in optimism expressed this week compared to last week.** The alt-coin, which now boasts the third-highest market capitalization of all cryptocurrencies, made waves in news coverage this week after eclipsing the $2.00 price benchmark last week and reaching a new all-time high price of $2.39 on Wednesday on the back of [comments](https://ambcrypto.com/hoskinson-says-cardano-is-on-a-different-path-than-ethereum-bitcoin/) from its outspoken founder Charles Hoskinson.\n\n💊 **CVS Health ($CVS) recorded the largest increase in pessimism expressed this week** after announcing that it would be limiting purchases of over-the-counter rapid COVID-19 tests in the coming weeks due to excess demand. While this news draws questions about the robustness of CVS’s supply chain, the main takeaway seems to be its implications about the current severity of the pandemic. Accordingly, $CVS stock price fell 1.97% on the week.\n\n🛍️ **ContextLogic Inc. ($WISH) posted the biggest increase in speculative language expressed this week compared to last.** This comes a week after $WISH stock fell 9% on disappointing Q2 earnings. Throughout this week, the stock rallied back more than 5% to $6.94 on heavy volume from retail traders on r/WallStreetBets and the like, leaving [analysts](https://investorplace.com/2021/08/wish-stock-is-worth-sticking-with-even-after-its-dismal-earnings-report/) to wonder if the stock is worth sticking around for. Other highly speculative tickers in news this week include Intel ($INTC), Peloton ($PTON), Skyworks ($SKWS), and Applied Materials ($AMAT).\n\n☕ **Starbucks Inc. ($SBUX) received the biggest increase in reactive language expressed** driven by a multitude of articles written about its recent ability to capture consumer trends as a business — including this [piece](https://www.fool.com/investing/2021/08/25/3-reasons-why-starbucks-could-win-as-students-retu/) which anticipates a bump in sales as college students return to in-person classes, and [social media buzz](https://twitter.com/uDontKnoDietz/status/1430589780799234059?s=20) driven by its early introduction of pumpkin spice-themed drinks -(before Labor Day? is that legal?). Other highly reactive tickers this week include Boeing ($BA), Walmart ($WMT), Invesco QQQ Trust ($QQQ), and IBM ($IBM).\n\n# 4. Market Mood Outlook 🌡️🔭\n\nThis week’s stock market news saw another boost in optimism back to its recent high levels as the markets peaked above new all-time high price points. Speculation in the news remains abound as we wrap up the month of August and transition into the final months of 2021. **While stocks have performed well in recent weeks on top of outstanding earnings reports across the board, inflationary pressures and economic uncertainty remain top of mind.**\n\nWe said it last week and we’ll say it again: the heightened optimism in the news is a reassuring hand in today’s market, but a signifcant shift in mood or economic catalysts (or some combination of the two, realistically) have the potential to bring the market back down to Earth. We will look ahead to vital economic reports (and their reactions) this week, including: housing data to be released Tuesday, manufacturing and service economy trends to be released Wednesday and Friday, and August’s monthly job report due Friday.\n\nWith this in mind, good luck to all in this final week of trading before Labor Day. Stay tuned later this week for an extra newsletter about what we are reading heading into this Fall, and some in-depth analysis about what we saw in the news over the month of August. That’s all for today’s report; thanks for reading. 🙏",
        "subreddit": "wallstreetbets",
        "title": "FULL REVIEW: Stock market news sentiment report 8/23-8/27",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/peqeza/full_review_stock_market_news_sentiment_report/",
        "created": 1630384042.0
    },
    {
        "author": "WealthIncomeEquality",
        "created_utc": 1629414069,
        "id": "p7psjf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Applied Materials beats on EPS and Rev Growth, Q4 guidance exceeds analyst estimates",
        "url": "https://www.reddit.com/r/stocks/comments/p7psjf/applied_materials_beats_on_eps_and_rev_growth_q4/",
        "created": 1629442869.0
    },
    {
        "author": "Loud_Bumblebee194",
        "created_utc": 1628603248,
        "id": "p1pik6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[TSMC](https://www.nasdaq.com/market-activity/stocks/tsm/institutional-holdings): 17% institutional ownership \n\n[ASML](https://www.nasdaq.com/market-activity/stocks/asml/institutional-holdings): 18% institutional ownership \n\nIn comparison, [AMAT](https://www.nasdaq.com/market-activity/stocks/amat/institutional-holdings) has almost 80% institutional ownership \n\nIs it because ASML and TSMC are foreign companies and therefore harder to track ownership?",
        "subreddit": "stocks",
        "title": "Why do TSMC and ASML have such low institutional ownership?",
        "url": "https://www.reddit.com/r/stocks/comments/p1pik6/why_do_tsmc_and_asml_have_such_low_institutional/",
        "created": 1628632048.0
    },
    {
        "author": "babbldev",
        "created_utc": 1630096089,
        "id": "pcvejr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "The most pessimistic [\\#StocksInNews](https://twitter.com/hashtag/StocksInNews?src=hashtag_click) This mid week (8/22-8/25)  \n\n1. [$SWKS](https://twitter.com/search?q=%24SWKS&amp;src=cashtag_click) 📷 \n\n2. [$CMCSA](https://twitter.com/search?q=%24CMCSA&amp;src=cashtag_click) 📷 \n\n3. [$SBUX](https://twitter.com/search?q=%24SBUX&amp;src=cashtag_click) 📷 \n\n4. [$AMAT](https://twitter.com/search?q=%24AMAT&amp;src=cashtag_click) \n\n5. [$DIS](https://twitter.com/search?q=%24DIS&amp;src=cashtag_click) \n\n6. [$BA](https://twitter.com/search?q=%24BA&amp;src=cashtag_click) \n\n7. [$BR](https://twitter.com/search?q=%24BR&amp;src=cashtag_click) \n\n8. [$TLRY](https://twitter.com/search?q=%24TLRY&amp;src=cashtag_click) \n\n9. [$TJX](https://twitter.com/search?q=%24TJX&amp;src=cashtag_click) \n\n10. [$NEE](https://twitter.com/search?q=%24NEE&amp;src=cashtag_click) \n\nbonus: [$CSX](https://twitter.com/search?q=%24CSX&amp;src=cashtag_click) 📷 \n\n&amp;#x200B;\n\n  \n\n\nhttps://preview.redd.it/xv9p0gezmyj71.png?width=822&amp;format=png&amp;auto=webp&amp;s=4351db40336f312b1a635ae5207a9c57926df156",
        "subreddit": "StockMarket",
        "title": "The most pessimistic stocks covered in the news over a mid week period (8/22-8/25)",
        "url": "https://www.reddit.com/r/StockMarket/comments/pcvejr/the_most_pessimistic_stocks_covered_in_the_news/",
        "created": 1630124889.0
    },
    {
        "author": "arabdude313313",
        "created_utc": 1627982373,
        "id": "owzr1n",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Lots of upcoming catalysts for this company this month, I don't think any other company has this many upcoming catalysts. Other than the buyback and catalysts listed below, they are also about to become current, as well as partnership announcement with ANSYS and multiple other companies. \n\nAug 6.Third CC --\n\nAug 6 Apogee d7 website unveil --\n\nAug 10 3 nft auctions --\n\nAug 17 buyback details --\n\nSept 1th Zippa game launch",
        "subreddit": "pennystocks",
        "title": "HPIL - Share BUYBACK and many catalysts upcoming",
        "url": "https://www.reddit.com/r/pennystocks/comments/owzr1n/hpil_share_buyback_and_many_catalysts_upcoming/",
        "created": 1628011173.0
    }
]