[
    {
        "author": "BlondedJare",
        "created_utc": 1612214479,
        "id": "laeil2",
        "num_comments": 47,
        "num_crossposts": 1,
        "selftext": "HPQ-Silicon Resources Inc: tickers (hpq.v - tsx and uragf - otc) has developed technology that reduces the cost of producing silicon-based spherical nanopowders &amp; nanowires, making this company an essential leader of the renewable energy revolution moving into the future.\n\nHPQ is currently being shorted by cynical wall street investors trying to leech off of the company’s value. These predatory tactics are limited, however, as HPQ has a growing legion of loyal supporters that will soon send shorters into oblivion.\n\nWhy is HPQ being targeted by shorters? HPQ has the backing of the Quebec government and is partnered with Pyrogenesis, an equally promising green-solutions company that has attracted the attention of the ARK investment portfolio. HPQ’s nano silicon powder will be instrumental in making silicon batteries, hydrogen fuel cells and solar panels to deliver on a promise for a greener future. HPQ has recently surpassed industry expectations by producing silicon nanopowder smaller than 100 nanometers, which is critical for these applications.\n\nThe HPQ/PYR dream team has the ability to produce economically viable Si-NPs (nano size of is totally customizable) using a process that is SCALABLE. This breakthrough is exclusive to HPQ Silicon and holds the key to renewable energy profits in the aforementioned sectors. As a result of this potential, HPQ has already secured NDA’s and orders for their product from electric vehicle manufacturers.\n\nHPQ’s ability to produce high-quality silicon powder at far cheaper rates than its competitors (with little to no environmental footprint) makes this company a highly strategic acquisition by TESLA and other EV companies. You owe it to yourself to do some due diligence in this company if you consider yourself a renewable/green investor, or wanting to join the movement of sending cynical shorts crying home to their mothers.\n\nThis is the year that HPQ reveals its partnerships that will bring the renewable energy revolution to reality; a disruptive innovation in silicon production using low-cost, green technology, creating a paradigm shift in energy storage &amp; generation.",
        "subreddit": "pennystocks",
        "title": "HPQ Silicon Resources: Disruptive Renewable Energy Tech",
        "url": "https://www.reddit.com/r/pennystocks/comments/laeil2/hpq_silicon_resources_disruptive_renewable_energy/",
        "created": 1612243279.0
    },
    {
        "author": "Mazer_Rac",
        "created_utc": 1612220588,
        "id": "lagxns",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "TL;DR: We're being defrauded! Register your certificates! Hold Wall St. accountable! There are links at the bottom on how to register your certificates in your name using DRS. There is also a SEC link that explains different forms of stock ownership and how brokers will commonly use \"street ownership\" where they just use a spreadsheet to track stocks internally, they're the only one who knows who owns what. They're making shares up out of thin air, depriving you of your voting and dividend rights and keeping it secret.\n\nI also recommend screenshotting how many shares you have in case they start deleting them like the did in Canada with CMKM.\n\n&amp;#x200B;\n\nRead this paper: [https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/](https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/)\n\n&amp;#x200B;\n\nNo, seriously, retard, read it. It's an article covering the research of a PhD in economics who has witnessed first hand what I'm about to tell you and is a big deal herself.\n\n&amp;#x200B;\n\nOur shares in $GME most likely don't exist. Wall St. has been perpetuating the biggest and most widespread fraud in human history. They were almost caught in 2008, but (to their relief) it only affected one sector of the economy and they were bailed out.\n\n&amp;#x200B;\n\nWhat is a fail to deliver? A fail to deliver is a concept used on Wall St. to denote when a lent share (for shorting or any other reason) isn't paid back. You would think that these companies would be mad that they're getting shafted for a share, but no, they're paid some hush money called an \"entitlement\" and they keep quiet. They keep quiet because it was never their money to begin with -- they tell the trader that they have the share and the broker pockets the entitlement.\n\n&amp;#x200B;\n\n&gt;Why naked short? When one broker can sell shares to your broker and simply fail to deliver at settlement, the broker does not have to bear the expense of stock borrowing. And the system lets them. Or they could avoid the expense of borrowing by short selling shares and marking them long. Sometimes, when the sellers really own the shares, their brokers may not transfer them to buyers. That and naked shorting both yield fails to deliver.  \n&gt;  \n&gt;If the shares ever arrive, the broker sends the money to the seller‘s broker. But once the trader knows that the broker agrees to fail to deliver his sell orders, he or she knows that all fails will persist and is free to naked short millions of shares for years to wait for the desired price drop.  \n&gt;  \n&gt;People who buy the undelivered shares get an “entitlement,” and the money they paid stays with their broker, who can use it, interest free. The dollar value of shares purchased but not received is a free loan from the investor to the broker. The investors don‘t know. The broker is not required to tell the client that he took the payment and did not receive any shares. \n\n&amp;#x200B;\n\nWe've been thinking that the big thing going on here is a naked short, but it's **so** much larger than that. My guess is that retail $GME holders on WSB alone hold over 100% of the available-to-trade shares and the brokers are losing their minds. Doesn't it seem odd that they're lying all over the news and putting articles out about \"losing interest\" and \"moving to silver\" and yelling and crying every day over the overleveraged short position of **ONE** hedge fund? It seemed odd to me, too. They're worried because they're on the verge of being found out as a system and causing a crash just like what happened in '29\n\n&amp;#x200B;\n\n&gt;But in a system wracked with fraud, traders engage in naked short selling, when they sell stock they don‘t own and never buy to deliver. So now there are two shares, the real one that was never delivered and a phantom “entitlement” given the unsuspecting buyer which is recorded as such by his broker. And which the buyer can now sell! Because the brokers pretend there are real shares there.  \n&gt;  \n&gt;Making two shares out of one is among the swindles that crashed the market in 1929. It was called “watering the stock.\n\n&amp;#x200B;\n\nThis has happened before, too. In Canada.\n\n&amp;#x200B;\n\n&gt;CMKM was a Canadian company with an interest in diamonds. The shareholders didn‘t know that mineral rights they were told about were owned by the founders, not the company. Criminal and civil complaints ensued. A reform management changed the company name to New Horizons Holdings, Inc with a plan to raise capital for the purchase of oil or gas assets. If successful, they would be able to return the shares to trading status with the hope of restoring value to shareholders.  \n&gt;  \n&gt;NHH directed all shareholders to obtain their stock certificates and exchange them for new shares. That‘s when the masses of phantom shares and corruption of some big brokers came into stark view. Many investors discovered that their brokers had taken their money and never bought or received CMKM shares.  \n&gt;  \n&gt;Trimbath, who worked investigating the scam, calls theses victims “UnShareholders,” investors who reported that their share positions were deleted by their brokers and/or where brokers refused to provide them with share certificates registered in the investors‘ names so they could meet the exchange requirements of a “bona fide shareholder.” She said, “Documents I saw suggested three brokerage firms probably took payments from investors for shares that were never received from the selling broker… Charles Schwab, Chase Bank and RBC Dain.”  \n&gt;  \n&gt;The investors had “phantom shares.” They were allocated a fail to receive on the broker‘s own books, but payment money was taken from their cash accounts, and they continued to receive statements showing share positions for CMKM.  \n&gt;  \n&gt;She said, “Investors submitted documentation showing that each of these brokers deleted their CMKM share positions at a time when we can demonstrate that the firms had no shares either in the depository or on the books of the issuer.” They deleted the evidence of the phantom shares.\\\\\n\n&amp;#x200B;\n\nThey're not obligated to tell us that they don't actually own the underlying stock certificate and they're paying \"unqualified\" dividends to us to make us think that we do -- oh, by the way, these dividends are taxed as income and aren't eligible for dividend tax rates. Another way they're ramming our ass.\n\n&amp;#x200B;\n\n&gt;When settlement failures happen, the shares you buy may not be in your brokerage account regardless of what your broker statement says.  \n&gt;  \n&gt;Let‘s say that your broker gets one of these fails to receive. First of all, they don‘t tell you that they got a fail to receive. If you were an institutional buyer or a high-value client, they will tell you that they failed to receive and they will give you some monetary compensation for the delay and inconvenience. They don‘t tell individual retail investors. If they did, they would have to share the revenue they earn on investors‘ money already paid them for the shares, since brokers don‘t have to transfer money for shares they fail to receive.  \n&gt;  \n&gt;The question then becomes, “Well, how did I get dividends?” You didn‘t really get dividends, you got “dividends in lieu.” That means the broker sent money (maybe part of *your* money) as dividends. You will know this if your 1099 from the broker says “unqualified dividends.” They are generally considered ordinary income and not eligible for dividend tax rates.  \n&gt;  \n&gt;Sometimes, a large broker with many clients seeking the same stock will receive only part of a particular share order. Some clients get real shares, others phantom entitlements. Trimbath said an investor might ask, “How did I get picked out for that?” She said, “The problem is, we don‘t know. And they won‘t tell us. If you were assigned the fail to receive, then the broker has many options, none of which they have to tell you.”\n\nOh, and they're fucking our voting rights! They're letting us vote and then throwing out the votes they don't like. Legally.\n\n&amp;#x200B;\n\n&gt;Before the 2008 crash, at an annual proxy meeting, Bank of America counted 130% of its shares voted, that is, they received 30% more votes than they had shares outstanding. That‘s just the number of people who actually voted their shares! Imagine how many shares were sold beyond what they actually authorized and issued. This violates the voting rights of shareholders and reduces effective corporate governance.  \n&gt;  \n&gt;Trimbath pointed out, Let‘s say it‘s the merger of Compaq and Hewlett Packard. Let‘s say that there are a lot of these extra shares around and they have more votes than shares coming in. And let‘s say that your broker/dealer is JP Morgan, who was actually one of the advisors on that merger deal. They stood to gain more in fees if the merger went through than if it was voted down. Do you think that they would be so careful about your vote that if you voted against something they were in favor of that they would not be tempted to only turn in the votes that they thought should be counted, those that were most favorable to their position, as opposed to trying to make sure that everything was done according to the rules. But, there are no rules! They just make them up as they go along.  \n&gt;  \n&gt;She said, They can, in fact, throw out your vote and just not count it. They can randomly assign your vote to some real proxy that wasn‘t voted. They can vote what shares they actually do have proportionally based on how many phantom votes come in. It‘s all done in secrecy. They don‘t have to tell you, they don‘t have to tell the NYSE, they don‘t have to tell anyone. They don‘t have to tell the company whose shares they voted.  \n&gt;  \n&gt;And the SEC isn‘t interested. To deal with over-voting, the SEC didn‘t say, Stop telling clients they have voting shares when they don‘t. It said, Don‘t submit more votes than shares you are holding. And brokers could choose which votes they wanted to submit!\n\n&amp;#x200B;\n\nThey even have cutsy little names for their fuckery and fraud.\n\n&amp;#x200B;\n\n&gt;Even a university economist who spent 2004 at the SEC studying fails acknowledged in so many words that the broker-dealers do it on purpose. Leslie Boni (now with a hedge fund in Southern California) attributed the extraordinary increase in settlement failures to investment decisions known as “**strategic failures**.”  \n&gt;  \n&gt;Trimbath noted that in 2007, “The Federal Reserve Bank of New York‘s Treasury Markets Practices Group (TMPG) describes several intentionally abusive practices such as **“slamming the wire**” (holding back deliveries until immediately before the close with the intention of causing settlement fails) and requests from traders for settlement operations to “**hold the box**” (a demand to delay settlement of an executed trade). The fact that these practices are colloquially named and described in such detail indicates that they are common causes of settlement failures.”\n\n&amp;#x200B;\n\nOh! Everyone saying it's illegal to naked short? Only sort of. Only for the stock of certain financial companies. That's right, they only made it illegal to drive down the valuation of their buddies. *(Edit: they did extend this rule to all companies later in the year after pressure from businesses)*\n\n&amp;#x200B;\n\n&gt;The SEC continued to declare that fails to deliver were not an indication of naked short selling. That changed when Goldman Sachs and other financial firms needed to be protected. Trimbath pointed out that not till the banks/broker-dealers began to see massive numbers of fails to deliver in their own shares did the SEC put a short-selling ban in place – but only for the shares of banks, insurance companies and securities firms, including the very culprits responsible for the dirty system.\n\n&amp;#x200B;\n\nAgain, it's a big problem.\n\n&amp;#x200B;\n\n&gt;Securities and Exchange Commission: In the first two weeks of July 2019, 914,261,864 shares valued at over $17 billion failed to deliver in settlement from the clearing house, an average of about $1.9 billion every settlement day.\n\n&amp;#x200B;\n\nAnd that's with all of the shady shit they can do to hide the numbers.\n\n&amp;#x200B;\n\n&gt;Trimbath blames the massive fails on the DTCC and its subsidiaries, DTC (Depository Trust Company), the vault that holds the shares, and NSCC (National Securities Clearing Corp), which clears and settles trades, that is, handles the exchange of money and shares which are registered in the accounts of its members, the big banks/broker-dealers.  \n&gt;  \n&gt;The Securities and Exchange Act of 1933 specifically gave the clearing house the right to require that shares and securities be delivered for settlement. It allows them to punish those who don‘t deliver by refusing to have them in the system.  \n&gt;  \n&gt;Trimbath said, “The DTCC has for years ignored that.  \n&gt;  \n&gt;She said, “The 2007 Reg SHO amendment says you cannot short again without borrowing: but only DTCC and SEC know who failed to deliver, so how is that functional?”  \n&gt;  \n&gt;Till 2013, in fact, the NSCC had a program to automatically borrow shares from DTC members to cover fails before settlement. DTC members can still lend shares from their accounts.  \n&gt;  \n&gt;She said the DTCC creates a mirage that there aren‘t any fails, or are many fewer than appears. Wall Street benefits from a service that automatically resubmits settlement failures, what the DTCC calls “fail transactions.” Many trades that fail to settle are required to be re-submitted, where they receive new settlement dates, in essence, erasing the fail to deliver by creating a new record. When this happens, the records show that the fail transactions are no longer outstanding; the next day begins with zero fails.\n\n&amp;#x200B;\n\nSome estimates put the number at 50,000% larger or **$400 billion in phantom trading per WEEK**.\n\n&amp;#x200B;\n\nThe DTCC, who is supposed to make sure that you actually have a physical stock certificate underneath what the broker tells you that you have is enabling this. They're a private corporation and they're in league with the brokers.\n\n&amp;#x200B;\n\n&gt;The answer is that the banks and brokers who use DTCC‘s services, who process trades there, who fail to deliver there, are insiders who sit on the DTCC Board of Directors. And the feeble SEC, dominated by the industry it is supposed to regulate, fails to require the DTCC to impose sanctions on errant members.\n\n&amp;#x200B;\n\nThe DTCC, the brokers, and fucking **CONGRESS** are blocking any efforts to fix this.\n\n&amp;#x200B;\n\n&gt;Harmer said in the film that the DTCC sabotaged their efforts. And that SEC chair William Donaldson also opposed them. Harmer said, To him, the whole business of trading securities belongs to the major brokers, they are the ones who are running this, and you folks down in Washington should not meddle in this or you‘re going to upset the apple cart.  \n&gt;  \n&gt;According to Harmer, They also got to Chairman Shelby.  And so, Shelby said to Bennett — I think we oughta wait and give the SEC a chance to come in and explain their position. And so, we were simply the victims of a very effectively executed strategy to make sure that there were no hearings on this, and even to make sure that Senator Bennett did not introduce the bill.  \n&gt;  \n&gt;A story in *The Washington Post* in 2012 helped explain the lack of enthusiasm in Congress for reforming the processes that lead to phantom shares. “In 2008, for instance, 17 lawmakers reported investing hundreds of thousands of dollars in short-selling funds,” including bets against U.S. Treasury bonds, the Dow Jones Industrial Average and the S&amp;P 500.  \n&gt;  \n&gt;The SEC‘s “reforms” had little effect. Compared to $6 billion in daily fails in 2003, the number was $7.4 billion for February 2020.\n\n&amp;#x200B;\n\nWe can uncover their fuckery! Demand that your broker register your certificates in your name! Show the world that we own more than 100% of $GME's float!\n\n&amp;#x200B;\n\nYou can use DRS to register your stocks in your name. Get in contact with your broker and ask them to register them in your name through the Direct Registration System.\n\n&amp;#x200B;\n\nSEC Info on DRS and how your stock is actually owned: [https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html](https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html)\n\nSEC FAQ on DRS: [https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html#faq](https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html#faq)\n\nWrite-up on how to use DRS: [https://the-international-investor.com/investment-faq/holding-shares-direct-registration](https://the-international-investor.com/investment-faq/holding-shares-direct-registration)\n\n&amp;#x200B;\n\nSource: [https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/](https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/)\n\nMore reading: [https://www.wsj.com/articles/SB943287246835296769](https://www.wsj.com/articles/SB943287246835296769)",
        "subreddit": "Wallstreetbetsnew",
        "title": "$GME Holders We are Being DEFRAUDED by the DTCC and our Broker/Lenders! What We Can Do!",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lagxns/gme_holders_we_are_being_defrauded_by_the_dtcc/",
        "created": 1612249388.0
    },
    {
        "author": "ItalianAAces",
        "created_utc": 1612216486,
        "id": "lafbid",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "HPQ Silicon Resources: Disruptive Renewable Energy Tech",
        "url": "/r/Baystreetbets/comments/l9sv9m/hpq_silicon_resources_disruptive_renewable_energy/",
        "created": 1612245286.0
    }
]