[
    {
        "author": "YahyaJ",
        "created_utc": 1618769365,
        "id": "mti1lc",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "&gt;It's not my intention to manipulate the market.  \n&gt;  \n&gt;Disclaimer I do not provide personal investment advice and I am not a qualified licensed investment advisor. I am an amateur investor. I will not and cannot be held liable for any actions you take as a result of anything you read here.  \n&gt;  \n&gt;Conduct your own due diligence, or consult a licensed financial advisor or broker before making any and all investment decisions.  \n&gt;  \n&gt;Got it? Now to the post.\n\n&amp;#x200B;\n\nDD PILLS is a new series, I will regularly try to post multiple stocks that I find interesting in one post. It takes me hours to prepare this kind of material, I hope you enjoy it! And for updates you can follow me!\n\nPlease note that what I think about a company now could change tomorrow depending on multiple factors, I can't make a post every time I find something about a stock I've talked about before in a DD, that's why I created a FREE discord server where as a community we talk about stocks and find new interesting ones, check my profile for the link.\n\n**The stocks are sorted alphabetically and not in order of importance.**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6avnj7rd2zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=9751cd1a65d8d9ecf0d16f7f67944d78dbc69cc4\n\nIf you $BLNK you might miss the first one!  \nBlink is a technical play in my opinion, the short loan rate is high (50.92%) and the short interest is one of the highest, the stock is following an upward channel and is right now at the lower end, looks good for an entry on Monday.\\*\\*My plan:\\*\\*I will watch the movement on the pre market and look for confirmation that it is going up in the early trading hours of the market, wait for a pullback and add a position later in the afternoon or the next day.\n\nhttps://preview.redd.it/9i493sgb2zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=90a33f86390129a59a0abd0f16aa790156fba878\n\n**Quick Overview**  \nBlink Charging Co is an owner, operator, and provider of electric vehicle (EV) charging services. The company offers both residential and commercial EV charging equipment, enabling EV drivers to easily recharge at various location types. Its principal line of products and services are the Blink EV charging network (the Blink Network) and EV charging equipment (also known as electric vehicle supply equipment), and EV-related services.\n\n&amp;#x200B;\n\n**New investors**  \nMajor holders that have opened new positions in BLNK / Blink Charging Co include State Street Corp, KOMP - SPDR S&amp;P Kensho New Economies Composite ETF, Group One Trading, L.p., Group One Trading, L.p., FKASX - Federated Kaufmann Small Cap Fund Class A Shares, No Street GP LP, KAUAX - Federated Kaufmann Fund Class A Shares, IMC-Chicago, LLC, IMC-Chicago, LLC, XRT - SPDR(R) S&amp;P(R) Retail ETF, Hrt Financial Lp, Antara Capital LP, ALPS ETF Trust - ALPS Clean Energy ETF, PEAK6 Investments LLC, HAIL - SPDR S&amp;P Kensho Smart Mobility ETF, Independent Advisor Alliance, Warberg Asset Management LLC, North Fourth Asset Management, LP, HSGFX - Hussman Strategic Growth Fund, and Schonfeld Strategic Advisors LLC.\n\nhttps://preview.redd.it/ggogxpja2zt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=9dcf5bf1d8423280a823a03641ca1df94907fecc\n\n**The dd pill**  \nI would define Blink Charging as a hybrid stock, it is an EV stock but at the same time a renewable energy stock. In fact it usually follows trends in both sectors and can benefit from both. Blink Charging is one of the leaders in its industry and it looks like it will be investing outside the U.S. Last week the company announced that it had installed 42 new chargers in New York and the stock price jumped 13%. Optimism about Biden's plan to build a national EV charging system may push this stock even higher. But long term investors will need to watch out for any significant corrections. Right now, BLNK’s valuation seems overstretched with a price/sales ratio of roughly 289x.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l7io0zm62zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=7a7d996d8a603826c2fb1a999b29ab22b8b30900\n\n**The second one on today's list is $ESGC**  \nI already made a DD about this company before, i sold for a profit when it started rising on a NFT rumour concerned about a fall when i noticed no official news was coming. Looking at the chart I think this week we may see a lot going on, in my opinion we’ll either see a continuation of the uptrend that we’ve seen on Friday or a further fall to the $1.36 area before a big bounce that could send this stock flying.\\*\\*My plan:\\*\\*Look what the movement will be on monday, volume will be the key on this one. If i see it going to $1.65 then i’ll wait for a small pull back to get a position. If it goes over $1.85 after I have a position at $1.6 or lower I'll start putting stop losses 11 cents below every X.X5 it reaches. If instead ESGC goes red on Monday i’ll wait for consolidation in the $1.3/1.4 area and get my position waiting for a reversal.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\nhttps://preview.redd.it/aals33b92zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=81139c1a02d2c81e97f08c43b4d411c03228615b\n\n**Quick Overview**  \nEros STX Global Corporation produces, markets, and distributes content to audiences around the world across traditional and digital media platforms. The company produces and distributes films, scripted and unscripted TV programming, and digital content across a variety of platforms. It also offers Eros Now, a subscription based OTT platform. Eros STX Global Corporation is headquartered in Burbank, California.\n\n**New investors**  \nMajor holders that have opened new positions in ESGC / Eros Stx Global Corp include Palladium Partners Llc, RIFBX - U.S. Small Cap Equity Fund, SSTIX - State Street Total Return V.I.S. Fund Class 1 Shares, Cruiser Capital Advisors, Llc, Hollencrest Capital Management, VFMO - Vanguard U.S. Momentum Factor ETF ETF Shares, Jump Financial, LLC, Truist Financial Corp, Quadrant Capital Group Llc, Regent Peak Wealth Advisors LLC, and DFAU - Dimensional US Core Equity Market ETF.\n\nhttps://preview.redd.it/3qps0ph52zt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=a4001b51a45748c25eae3e286b057b89e196c169\n\n**The dd pill**  \nBasically Eros STX is a movie producer and distributor that is trying to enter the streaming services market, only in India it has more users than Netflix has worldwide. It also has deals with Amazon and HBO to distribute its movies and content. This company is trying to show the world that it is very undervalued, the low short interest and high institutional ownership shows that institutions really believe in the success of the company.\n\n**Keep it on your watchlist, any good news could send it flying.**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rdbyrgw42zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=e0da8a3f5a22dcc924c29b5cac5004d9a5d77c5c\n\n**And here comes the third one: JAGX!**  \nThis will be a pure short swing trade for me if what I hope happens, on Friday a news about an offering dropped the stock 7.8%!!! It bounced off the low of the down channel it's in, I'll keep an eye on it this week. All it needs is volume or positive news and this could be back to $1.80/2.00 in no time!\n\nMy plan:  \nThere are many bagholders on this stock, this week there is no expected news from the company and investors' eyes are not on this type of stock. The next few days will be like a test for this stock, will it hold its value like it did before the latest news? Will it find support or will it rebound because there are still people who believe a lot in this stock? Or, as it has done many times before, will the company release good news and we will see a sudden rise? My plan is to see how it performs Monday afternoon and look for a clue that someone is loading up on this stock.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\nhttps://preview.redd.it/vnl4l9v32zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=c51ea44f8bda0d7547b34b50cea0656ddb1a7c5f\n\n**Quick Overview**  \nJaguar Health Inc is a commercial-stage pharmaceuticals company focused on developing novel, sustainably derived gastrointestinal products. The company's wholly-owned subsidiary, Napo Pharmaceuticals, Inc focuses on developing and commercializing proprietary human gastrointestinal pharmaceuticals for the marketplace from plants used traditionally in rainforest areas. It operates into two business segments namely Human health and animal health. Its Mytesi (crofelemer) product is approved by the U.S. FDA for the symptomatic relief of noninfectious diarrhea in adults with HIV/AIDS on antiretroviral therapy.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\nhttps://preview.redd.it/ns5yy4132zt61.png?width=1167&amp;format=png&amp;auto=webp&amp;s=54c1d3da39bba521c7c6ac148c23179854192eaa\n\n**The dd pill**  \nI find JAGX very interesting, many pennystocks get sudden increases in value because they are trending on social media, this one is somewhat different. There are many DDs about it on reddit yet it doesn't have a big following. JAGX's main product is Mystesi (FDA approved) and is used as an anti-diarrheal in adult HIV/AIDS patients who are on antiretroviral therapy. The company has a wholly owned European subsidiary called Napo Pharmaceuticals that specifically develops and markets treatments based on rainforest plants. This company is very interesting because Jaguar Health through Napo EU is doing research to see if Mystesi could be used to treat patients with long-term symptoms from Covid-19. In the U.S., Jaguar Health hopes to receive regulatory approval to market Mytesi as an anti-diarrheal for cancer therapy-induced diarrhea.\n\n**Something big could come from this in the coming weeks.**\n\nhttps://preview.redd.it/miv1c6d22zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=c3a87ea8a57954c551c14a0e1f61a23831058830\n\n**And the last one is a sympathy of GME!**\n\nThis is very interesting, over the past few weeks it has been reported many times that KOSS had a very high and unusual short borrow fee, on Thursday a 104% short borrow fee was reported. After the market closed on Friday it was reported that no shares were available to short. This is a candidate for the short squeeze.\n\nMy plan:  \nSocial media, social media, social media! This has a very high potential to become popular among trader groups. If unusual volume starts coming in, it could easily trap shorts and trigger a squeeze, if I see unusual volume and social media talking a lot about it, I will jump on the rocket. This is a risky stock play, without volume or interest it could collapse and go back to pennyland.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\nhttps://preview.redd.it/k4aw6pv12zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=3650ebaaa789f0cad09ae96ca11331f49cab1385\n\n**Quick Overview**  \nKoss Corp is a engaged in the design, manufacture, and sale of stereo headphones and related accessory products. It operates in the audio/video industry segment of the home entertainment industry. The company markets a line of headphones, wireless Bluetooth headphones, wireless Bluetooth speakers, computer headsets, telecommunications headsets, active noise-canceling headphones. Majority of the firm's revenue is derived from sales of stereo headphones.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\nhttps://preview.redd.it/1elo6ix02zt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=6b3fcf436a1ae845a96d21d61b2e3a019ff6494d\n\n**The dd pill**  \nKoss was founded in 1958, they are the inventors of stereos. For a while it was a leader in its industry but when competition came in and the company failed to diversify Koss had to file for bankruptcy in 1984. The following year it was back in business but its stock always failed to gain traction until this year when it went from less than a dollar to $127.45 in January. Koss right now is very competitive in the marketplace, its wireless headphones are popular on Amazon but its competitors are much bigger like Sony and Apple.\n\nhttps://preview.redd.it/zj33xbey1zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=c9697b42a69b5965afcfd2205f03d18b8ee22dcb\n\n**Keep weed stocks on your radar this week!**\n\nhttps://preview.redd.it/mg8xidzx1zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=fa2b0e19f346abc73667806f590259f0b23766bc\n\nSNDL and TLRY follow the same trend",
        "subreddit": "smallstreetbets",
        "title": "DD Pills With Simple Technical Analysis - Next Week Potential Market Movers - $BLNK $ESGC $JAGX $KOSS $APHA $SNDL $TLRY",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/mti1lc/dd_pills_with_simple_technical_analysis_next_week/",
        "created": 1618798165.0
    },
    {
        "author": "raoha",
        "created_utc": 1619810343,
        "id": "n218v5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " **E2Open ($ETWO)**\n\n**A 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY** \n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.”  \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%). \n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n* *A Snapshot of its largest customer base:*\n\nhttps://preview.redd.it/tnt9bj2uzcw61.jpg?width=1194&amp;format=pjpg&amp;auto=webp&amp;s=bee9d8d174bcfcdcef47d9cb314afaf442076213\n\n* *A Snapshot Of Their Investment Thesis:*\n\nhttps://preview.redd.it/vtoi620zzcw61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=b487f26ef0a45336fce1e5fe4276dfdff46c2d44\n\n**Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n* &amp;#x200B;\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qw6hjk2s0dw61.png?width=632&amp;format=png&amp;auto=webp&amp;s=07cd6fe3e5bc6411a01d89720a753538af77a66b\n\n*A Visual Of $ETWO 's business model:*\n\nhttps://preview.redd.it/47feijg20dw61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=c812a0dcdbc03ac6597bf85a1882d3e95f32ef31\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis. They also boast an extremely low churn rate, which is a great indicator for SaaS platforms. This is further indication that the company is due for strong future growth. Below are some visuals demonstrating the value of ETWO:\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/gt4wo6ow0dw61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=4cde77501afd710e1cf38ae27b08de0101f511ef\n\n* Attractive Long Term Financial Profile:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r4f8eme01dw61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=f9c1448878ba5aba158a79cc4b7ed9dc299cfe58\n\n* Growth and Profitability:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7h67hol21dw61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=391f2c3af69695f2b46210842afb07bc123a8cd3\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it.  If you think about that, you’ll do things differently.”  \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management solutions to the enterprise. While the Supply Chain Management space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest: \n\nhttps://finviz.com/screener.ashx?v=152&amp;f=sh\\_opt\\_option,sh\\_short\\_high&amp;o=shortinterestshare&amp;t=ETWO\n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine: \n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "wallstreetbets",
        "title": "A Deep Dive Look at: E2Open ($ETWO) - The Future of Supply Chain Management?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n218v5/a_deep_dive_look_at_e2open_etwo_the_future_of/",
        "created": 1619839143.0
    },
    {
        "author": "SnooMacarons1548",
        "created_utc": 1619619636,
        "id": "n0fvh4",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": " Alright lads, this gem of a company is what you would get if $PLTR and $GME had a baby (they may have..).\n\nBefore I go into the long ass DD, I’ll provide a quick TL;DR for all the fellow apes out there, so just scroll to the bottom!\n\nThe case for $ETWO:\n\nE2Open, or $ETWO, provides cloud-based, on-demand software for supply chains for everything from computers, electronics systems and, well, essentially any company wanting to have an edge on it’s competitors . And let’s be serious, data is the modern day oil. Here is their Investment Thesis:\n\n[https://imgur.com/M95UL86](https://imgur.com/M95UL86)\n\nAnd seeing how my only claim to success is a massive GME yolo back in November, I’ll let someone with better credentials describe this company. Goldman Sachs analyst Chris Merwin initiated coverage on $ETWO and gave it a BUY rating (note: Loop Capital also just recently upgraded it to BUY). He had this to say about it:\n\n\"E2Open is a provider of supply chain management (SCM) solutions to the enterprise. While the SCM space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn of expansion\n\nopportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"\n\nAnother notable thing worth mentioning is that the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba. In other words, $ETWO had some goliaths backing them from the start.\n\n[u/DragonfruitAccurate3](https://www.reddit.com/u/DragonfruitAccurate3/) had a solid DD on $ETWO not long ago. Instead of trying to put it in my own words, I’ll just use his, as his DD is flawless IMO:\n\n*Why E2Open is likely undervalued*\n\n*Insight Partners, the private equity firm that owns E2Open has a ridiculously strong history of taking midsized SaaS companies like E2Open from valuations of hundreds of millions to multi billion dollar valuations. Other companies in Insight Partner's portfolio include:*\n\n*- Qualtrics (invested at $850mm valuation, sold in 2018 for $8bn and 9.4x+ return)*\n\n*- Shopify (invested in 2013, IPOed at $17/share in 2015 and is now $1,225/share for a likely 100x+ return)*\n\n*- DocuSign (invested in 2017 they IPOed in 2018 at $29/share in 2018 and is now $244.93/share)*\n\n*- Twitter (invested in 2009, it was valued at $100mm in 2008 and now has a $43bn market cap)*\n\n*- Diligent (bought in 2016 for $624mm and currently valued at $4bn for a 6.4x return)*\n\n*- Chegg (invested in 2009, IPOed in 2013 at $12.50/share, currently at $92/share)*\n\n*- Alteryx (invested in 2014, IPOed in 2017 at $14/share, currently at $129/share)*\n\n*- E2Open (bought in 2015 for $273mm, current enterprise valuation is around $2.57bn for a 9.4x return)*\n\n*The top 2 managing directors of Insight Partners: Adam Berger and Deven Parekh both sit on the E2Open board. They're known as active investors heavily involved in the strategic direction and acquisition strategy of E2Open. Deven Parekh was the lead for the early Twitter investment in 2009 that saw a return north of 40,000%. The guy is nothing short of a visionary.*\n\n*The most similar company to E2Open in Insight Partner's portfolio is Diligent. They're both SaaS platforms with long sales cycles, and have almost identical revenue ($340mm for Diligent vs $335mm for E2Open), and a similar product strategy of rapid acquisition and integration. Despite the similarities, Diligent is valued substantially more ($4+bn for Diligent, while only $2.73bn for E2Open), leading one to believe that E2Open is currently undervalued.*\n\n*Further evidence of E2Open's undervaluation is in its enterprise value relative to EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). E2Open's value is only 21.3x EBITDA, which is on par with the average software EBITDA of 20-24x, while its closest peers Descartes is at 29.2x and Kinaxis is at a whopping 59.1x. Significant upside remains in E2Open's future growth.*\n\n*E2Open’s approach to acquiring industry leaders has enabled them to acquire a stable of tech clients such as AMD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.*\n\n*E2Open customers include:*\n\n[*https://imgur.com/RG6rryD*](https://imgur.com/RG6rryD)\n\n*E2Open's strategic acquisitions of the past 7 years (at least 11 companies) allows end-to-end supply chain data visibility, the holy grail for tech and consumer goods companies. This allows them to compete in the big leagues against incumbents such as SAP and Oracle while leaving single use-case disruptors in the dust.*\n\n*E2Open has yet to fully realize its data integration potential involving artificial intelligence (AI), machine learning (ML) and ESG/sustainability. E2Open has plenty of avenues to pursue multipliers in shareholder value. It wouldn't surprise me that E2Open were to acquire an AI/ML supply chain company in the following quarters to boost shareholder value.*\n\n*If E2Open successfully executes their strategy of fully integrated end-to-end supply chain visibility, it's possible that they'd be acquired by SAP, Oracle, Amazon, Shopify or even Salesforce in the coming years at multiples of their current valuation. The potential value and unique competitive advantage of the data and tech E2Open offers is far too valuable for these companies to ignore.*\n\n*Product stickiness is a key differentiator for E2Open. It boasts of gross retention rates above 95%. The exceedingly low churn rate, a key health indicator of SaaS platforms, is a strong positive indicator of future growth.*\n\n*E2Open is one of the largest software firms focused on the supply chain sector with the following actual and expected revenue and is PROFITABLE:*\n\n*2019A- 205M*\n\n*2020A- 305M*\n\n*2021E- 335M*\n\n*2022E- 367M*\n\n*Current institutional investors PRE-MERGER include Goldman Sachs, Blackstone Group, and many big filing claims coming including this recent submission:* [*https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm*](https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm)\n\nNow for the juicy bit my friends:\n\nThe SHORT SQUEEZE.\n\nThe most perplexing thing I came across while researching $ETWO was the insanely high amount of Short Interest. Here is a shot from finviz on 4/26/2021 (The day I’m writing this):\n\n[https://imgur.com/9A7W7EC](https://imgur.com/9A7W7EC)\n\nThe % of the float short is a whopping 48%! In contrast, $MVIS’s % of float shorted is a little over 19%, $CLOV is at 35% and $GME is around 20%. Stock grid has a good visual representation of $ETWO’s short %:\n\n[https://www.stockgrid.io/shortinterest/etwo](https://www.stockgrid.io/shortinterest/e2)\n\nYou will also notice, on both finviz and stockgrid, the short ratio. For you fellow apes out there who can barely read, The short ratio tells investors approximately how many days it would take short sellers to cover their positions if the price of a given stock were to increase. The higher the short ratio, the longer it will take to buy back those borrowed shares. The Short ratio for $ETWO is a whopping 7 days! In contrast, $GME’s is at 0.23 days, $MVIS is 3.4 days, and $CLOV is 4.2 days. This means it will take a full week (more than that, considering trading weeks are only 5 days) for the shorts to cover their asses. A sharp uptick in price will have them bending over in no time.\n\nAnother key indicator that convinces me that this stock is going to the moon is one of [u/DeepFuckingValue](https://www.reddit.com/u/DeepFuckingValue/) ‘s favorites: Insider Buying. The following chart shows the latest insider buyer action:\n\n[https://imgur.com/TTs5qqZ](https://imgur.com/TTs5qqZ)\n\nYou can see that insiders are buying the shit out of this stock, and not selling. It’s always a great confirmation bias when the company insiders like the stock.\n\nTL;DR:\n\n$ETWO is an upcoming Supply Chain Software company with 48% of it’s float shorted. It’s fundamentals are sound, it’s potential is huge, and it’s currently heavily undervalued. It’s\n\nbeing backed by Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.\n\nSome of it’s notable customers are: MD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.\n\nThe % of the float shortest is a whopping 48%! It’s short ratio is 7 (It will take shorts 7 days to cover their positions if the stock ticks up).\n\nEven shorter TL;DR:\n\nI like the stock. It’s undervalued. It’s about to go on a short squeeze ride to the moon, and even the big wigs over at JP Morgan are saying this thing is a steal. Oh, and it’s clients are of the likes of FB, Google, Intel, MSFT, NVDA, NKE, etc (Look at the above list for more).\n\n$ETWO Positions:\n\n12/17/21 12.5c,\n\n12/17/21 15c,\n\n12/1721 17.5c",
        "subreddit": "StockMarket",
        "title": "THE $ETWO SHORTSQUEEZE - Insanely undervalued/High quality company /w a massive 48% of it’s float shorted!",
        "url": "https://www.reddit.com/r/StockMarket/comments/n0fvh4/the_etwo_shortsqueeze_insanely_undervaluedhigh/",
        "created": 1619648436.0
    },
    {
        "author": "badpauly",
        "created_utc": 1619741977,
        "id": "n1i5gp",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "This is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares.\nIn fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information\nthat has not been made public. So for example if there are drug trial results that are bad and not public,\ninsiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good\ntrack record at timing their purchases.  All trades that are marked as part of a 10b5 plan are excluded from this report.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Shares Changed|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[NH / NantHealth Inc](https://fintel.io/n/us/nh)|1|62,500,000|62,500,000|3,906,250,000,000,000 \n[RAIN / Rain Therapeutics Inc.](https://fintel.io/n/us/rain)|4|3,050,000|17|51,850,000 \n[IMPL / Impel NeuroPharma, Inc.](https://fintel.io/n/us/impl)|3|2,375,000|15|35,625,000 \n[KNBE / KnowBe4, Inc. Class A](https://fintel.io/n/us/knbe)|1|1,875,000|16|30,000,000 \n[BECN / Beacon Roofing Supply, Inc.](https://fintel.io/n/us/becn)|1|563,611|53|29,999,999 \n[AMEH / Apollo Medical Holdings Inc](https://fintel.io/n/us/ameh)|1|100,000|24|2,450,000 \n[SWIM / Latham Group, Inc.](https://fintel.io/n/us/swim)|11|127,500|19|2,422,500 \n[ANAB / AnaptysBio Inc](https://fintel.io/n/us/anab)|2|47,700|24|1,135,948 \n[ASB / Associated Banc-Corp.](https://fintel.io/n/us/asb)|1|29,500|22|638,663 \n[BANC / Banc of California Inc](https://fintel.io/n/us/banc)|2|32,800|18|600,355 \n[TELL / Tellurian Inc](https://fintel.io/n/us/tell)|1|100,000|2|213,630  \n[ISIG / Insignia Systems, Inc.](https://fintel.io/n/us/isig)|2|31,793|5|174,710 \n[NBSE / Neubase Therapeutics Inc](https://fintel.io/n/us/nbse)|4|34,000|5|170,000 \n[TPL / Texas Pacific Land Trust](https://fintel.io/n/us/tpl)|21|87|1,613|140,326 \n[BFST / Business First Bancshares Inc](https://fintel.io/n/us/bfst)|1|4,550|24|108,882 \n[SNV / Synovus Financial Corp.](https://fintel.io/n/us/snv)|1|1,920|47|90,643 \n[FSFG / First Savings Financial Group Inc](https://fintel.io/n/us/fsfg)|1|1,063|70|74,399 \n[DMLP / Dorchester Minerals LP](https://fintel.io/n/us/dmlp)|5|4,775|15|70,981 \n[ILAL / International Land Alliance, Inc.](https://fintel.io/n/us/ilal)|1|55,208|1|70,666 \n[PQEFF / Petroteq Energy Inc](https://fintel.io/n/us/pqeff)|1|1,166,666|0|70,000 \n[PEO / Adams Natural Resources Fund Inc](https://fintel.io/n/us/peo)|2|4,500|15|66,500 \n[KIDS / Orthopediatrics Corp](https://fintel.io/n/us/kids)|3|1,400|43|63,041 \n[ADX / Adams Diversified Equity Fund Inc](https://fintel.io/n/us/adx)|1|3,000|19|57,479 \n[PWOD / Penns Woods Bancorp, Inc.](https://fintel.io/n/us/pwod)|5|2,300|23|54,065 \n[AIO / AllianzGI Artificial Intelligence &amp;amp; Technology Opportunities Fund](https://fintel.io/n/us/aio)|2|1,860|28|51,649 \n[AEF / Aberdeen Emerging Mrkts Eqty Incm Fd Inc](https://fintel.io/n/us/aef)|1|5,793|9|50,024 \n[PFIS / Peoples Financial Services Corp](https://fintel.io/n/us/pfis)|1|1,000|42|42,160 \n[COFS / Choiceone Financial Services Inc](https://fintel.io/n/us/cofs)|2|1,343|24|32,368 \n[FBP / First Bancorp](https://fintel.io/n/us/fbp)|1|2,500|13|31,338 \n[SLM / SLM Corp](https://fintel.io/n/us/slm)|1|1,500|19|28,498 \n[MBCN / Middlefield Banc Corp](https://fintel.io/n/us/mbcn)|2|1,200|22|26,640 \n[TSRI / TSR Inc](https://fintel.io/n/us/tsri)|2|3,122|8|24,976 \n[TAYD / Taylor Devices, Inc.](https://fintel.io/n/us/tayd)|12|2,000|12|23,971 \n[CCEL / CRYO-CELL International, Inc.](https://fintel.io/n/us/ccel)|4|2,453|9|22,404 \n[CBH / AllianzGI Convert &amp;amp; Income 2024](https://fintel.io/n/us/cbh)|2|1,956|10|20,408 \n[CBKM / Consumers Bancorp, Inc.](https://fintel.io/n/us/cbkm)|2|1,000|20|19,504 \n[PKBK / Parke Bancorp, Inc.](https://fintel.io/n/us/pkbk)|2|1,000|19|19,440 \n[HTLD / Heartland Express, Inc.](https://fintel.io/n/us/htld)|1|1,000|18|18,430 \n[TEL / TE Connectivity Ltd](https://fintel.io/n/us/tel)|1|118|135|15,943 \n[NCV / AGIC Convertible &amp;amp; Income Fund](https://fintel.io/n/us/ncv)|2|2,715|6|15,824\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Shares Change|Avg. Price|Value Change\n--------|-----:|-----:|-----:|--------:  \n[SITC / SITE Centers Corp.](https://fintel.io/n/us/sitc)|1|-8,500,000|14|-122,697,500 \n[SGH / Smart Global Holdings Inc](https://fintel.io/n/us/sgh)|5|-2,000,000|50|-101,000,000 \n[SCHW / Schwab Charles Corp](https://fintel.io/n/us/schw)|8|-918,144|70|-64,381,946 \n[AN / AutoNation, Inc.](https://fintel.io/n/us/an)|12|-518,009|103|-53,208,969 \n[ORCL / Oracle Corporation](https://fintel.io/n/us/orcl)|1|-700,000|74|-52,150,280 \n[EAR / Eargo Inc](https://fintel.io/n/us/ear)|18|-722,482|54|-38,818,692 \n[WHR / Whirlpool Corporation](https://fintel.io/n/us/whr)|14|-143,663|236|-33,947,789 \n[KNL / Knoll Inc](https://fintel.io/n/us/knl)|5|-1,186,679|24|-28,274,090 \n[HCA / HCA Holdings Inc.](https://fintel.io/n/us/hca)|2|-63,390|200|-12,676,717 \n[STX / Seagate Technology PLC](https://fintel.io/n/us/stx)|1|-100,000|92|-9,213,220 \n[NUE / Nucor Corporation](https://fintel.io/n/us/nue)|25|-105,113|82|-8,522,179 \n[PANL / Pangaea Logistics Solutions Ltd](https://fintel.io/n/us/panl)|1|-2,764,516|3|-8,503,651 \n[REXR / Rexford Industrial Realty Inc](https://fintel.io/n/us/rexr)|5|-144,175|55|-7,985,723 \n[GGG / Graco Inc.](https://fintel.io/n/us/ggg)|5|-102,800|77|-7,920,013 \n[QMCO / Quantum Corp](https://fintel.io/n/us/qmco)|2|-940,000|8|-7,755,000 \n[OMC / Omnicom Group Inc.](https://fintel.io/n/us/omc)|3|-82,762|81|-6,677,731 \n[STAA / STAAR Surgical Company](https://fintel.io/n/us/staa)|2|-43,383|68|-5,869,720 \n[POOL / Pool Corporation](https://fintel.io/n/us/pool)|9|-13,959|415|-5,784,685 \n[ORCC / Owl Rock Capital Corp](https://fintel.io/n/us/orcc)|2|-369,951|14|-5,351,323 \n[BSY / Bentley Systems, Incorporated Class B](https://fintel.io/n/us/bsy)|1|-87,971|51|-4,504,194 \n[DHR / Danaher Corporation](https://fintel.io/n/us/dhr)|1|-17,169|259|-4,442,633 \n[KNBE / KnowBe4, Inc. Class A](https://fintel.io/n/us/knbe)|1|-252,825|16|-4,045,200 \n[PBCT / People&amp;#x27;s United Financial, Inc.](https://fintel.io/n/us/pbct)|4|-216,390|18|-3,919,509 \n[RF / Regions Financial Corp](https://fintel.io/n/us/rf)|5|-153,435|21|-3,233,506 \n[USB / U.S. Bancorp](https://fintel.io/n/us/usb)|2|-53,385|59|-3,132,113 \n[CSX / CSX Corporation](https://fintel.io/n/us/csx)|2|-30,525|102|-3,128,259 \n[CROX / Crocs, Inc.](https://fintel.io/n/us/crox)|3|-29,678|101|-2,996,356 \n[KEY / KeyCorp](https://fintel.io/n/us/key)|2|-137,096|21|-2,930,723 \n[LMT / Lockheed Martin Corporation](https://fintel.io/n/us/lmt)|1|-6,855|372|-2,549,721 \n[APPF / AppFolio Inc](https://fintel.io/n/us/appf)|1|-17,200|147|-2,535,280 \n[GL / Globe Life Inc](https://fintel.io/n/us/gl)|2|-24,000|103|-2,477,366 \n[AMEH / Apollo Medical Holdings Inc](https://fintel.io/n/us/ameh)|1|-100,000|24|-2,450,000 \n[TBK / Triumph Bancorp Inc](https://fintel.io/n/us/tbk)|2|-24,593|91|-2,215,637 \n[ABT / Abbott Laboratories](https://fintel.io/n/us/abt)|2|-18,039|122|-2,200,758 \n[SNA / Snap-on Incorporated](https://fintel.io/n/us/sna)|3|-8,913|240|-2,129,812 \n[JFR / Nuveen Floating Rate Income Fund](https://fintel.io/n/us/jfr)|3|-221,653|10|-2,119,205 \n[WWE / World Wrestling Entertainment, Inc.](https://fintel.io/n/us/wwe)|1|-37,115|56|-2,063,594 \n[PM / Philip Morris International Inc.](https://fintel.io/n/us/pm)|1|-21,066|95|-1,990,979 \n[FHN / First Horizon Corp (Tennessee)](https://fintel.io/n/us/fhn)|1|-104,357|18|-1,908,940 \n[ARI / Apollo Commercial Real Est. Finance Inc](https://fintel.io/n/us/ari)|3|-118,410|15|-1,794,997 \n[WSFS / WSFS Financial Corporation](https://fintel.io/n/us/wsfs)|2|-31,234|51|-1,581,870\n\n*Count* column is number of transactions.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)",
        "subreddit": "StockMarket",
        "title": "Significant Insider Trading Activity (Last 7 Days)",
        "url": "https://www.reddit.com/r/StockMarket/comments/n1i5gp/significant_insider_trading_activity_last_7_days/",
        "created": 1619770777.0
    },
    {
        "author": "SnooMacarons1548",
        "created_utc": 1619633325,
        "id": "n0kylp",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " The case for $ETWO:\n\nBefore I go into the long ass DD, I’ll provide a quick TL;DR for all the fellow apes out there, so just scroll to the bottom!\n\nE2Open, or $ETWO, provides cloud-based, on-demand software for supply chains for everything from computers, electronics systems and, well, essentially any company wanting to have an edge on it’s competitors . And let’s be serious, data is the modern day oil. Here is their Investment Thesis:\n\n[https://imgur.com/M95UL86](https://imgur.com/M95UL86)\n\nAnd seeing how my only claim to success is a massive GME yolo back in November, I’ll let someone with better credentials describe this company. Goldman Sachs analyst Chris Merwin initiated coverage on $ETWO and gave it a BUY rating (note: Loop Capital also just recently upgraded it to BUY). He had this to say about it:\n\n\"E2Open is a provider of supply chain management (SCM) solutions to the enterprise. While the SCM space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn of expansion\n\nopportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"\n\nAnother notable thing worth mentioning is that the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba. In other words, $ETWO had some goliaths backing them from the start.\n\n[u/DragonfruitAccurate3](https://www.reddit.com/u/DragonfruitAccurate3/) had a solid DD on $ETWO not long ago. Instead of trying to put it in my own words, I’ll just use his, as his DD is flawless IMO:\n\n*Why E2Open is likely undervalued*\n\n*Insight Partners, the private equity firm that owns E2Open has a ridiculously strong history of taking midsized SaaS companies like E2Open from valuations of hundreds of millions to multi billion dollar valuations. Other companies in Insight Partner's portfolio include:*\n\n*- Qualtrics (invested at $850mm valuation, sold in 2018 for $8bn and 9.4x+ return)*\n\n*- Shopify (invested in 2013, IPOed at $17/share in 2015 and is now $1,225/share for a likely 100x+ return)*\n\n*- DocuSign (invested in 2017 they IPOed in 2018 at $29/share in 2018 and is now $244.93/share)*\n\n*- Twitter (invested in 2009, it was valued at $100mm in 2008 and now has a $43bn market cap)*\n\n*- Diligent (bought in 2016 for $624mm and currently valued at $4bn for a 6.4x return)*\n\n*- Chegg (invested in 2009, IPOed in 2013 at $12.50/share, currently at $92/share)*\n\n*- Alteryx (invested in 2014, IPOed in 2017 at $14/share, currently at $129/share)*\n\n*- E2Open (bought in 2015 for $273mm, current enterprise valuation is around $2.57bn for a 9.4x return)*\n\n*The top 2 managing directors of Insight Partners: Adam Berger and Deven Parekh both sit on the E2Open board. They're known as active investors heavily involved in the strategic direction and acquisition strategy of E2Open. Deven Parekh was the lead for the early Twitter investment in 2009 that saw a return north of 40,000%. The guy is nothing short of a visionary.*\n\n*The most similar company to E2Open in Insight Partner's portfolio is Diligent. They're both SaaS platforms with long sales cycles, and have almost identical revenue ($340mm for Diligent vs $335mm for E2Open), and a similar product strategy of rapid acquisition and integration. Despite the similarities, Diligent is valued substantially more ($4+bn for Diligent, while only $2.73bn for E2Open), leading one to believe that E2Open is currently undervalued.*\n\n*Further evidence of E2Open's undervaluation is in its enterprise value relative to EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). E2Open's value is only 21.3x EBITDA, which is on par with the average software EBITDA of 20-24x, while its closest peers Descartes is at 29.2x and Kinaxis is at a whopping 59.1x. Significant upside remains in E2Open's future growth.*\n\n*E2Open’s approach to acquiring industry leaders has enabled them to acquire a stable of tech clients such as AMD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.*\n\n*E2Open customers include:*\n\n[*https://imgur.com/RG6rryD*](https://imgur.com/RG6rryD)\n\n*E2Open's strategic acquisitions of the past 7 years (at least 11 companies) allows end-to-end supply chain data visibility, the holy grail for tech and consumer goods companies. This allows them to compete in the big leagues against incumbents such as SAP and Oracle while leaving single use-case disruptors in the dust.*\n\n*E2Open has yet to fully realize its data integration potential involving artificial intelligence (AI), machine learning (ML) and ESG/sustainability. E2Open has plenty of avenues to pursue multipliers in shareholder value. It wouldn't surprise me that E2Open were to acquire an AI/ML supply chain company in the following quarters to boost shareholder value.*\n\n*If E2Open successfully executes their strategy of fully integrated end-to-end supply chain visibility, it's possible that they'd be acquired by SAP, Oracle, Amazon, Shopify or even Salesforce in the coming years at multiples of their current valuation. The potential value and unique competitive advantage of the data and tech E2Open offers is far too valuable for these companies to ignore.*\n\n*Product stickiness is a key differentiator for E2Open. It boasts of gross retention rates above 95%. The exceedingly low churn rate, a key health indicator of SaaS platforms, is a strong positive indicator of future growth.*\n\n*E2Open is one of the largest software firms focused on the supply chain sector with the following actual and expected revenue and is PROFITABLE:*\n\n*2019A- 205M*\n\n*2020A- 305M*\n\n*2021E- 335M*\n\n*2022E- 367M*\n\n*Current institutional investors PRE-MERGER include Goldman Sachs, Blackstone Group, and many big filing claims coming including this recent submission:* [*https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm*](https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm)\n\nNow for the juicy bit my friends:\n\nThe SHORT SQUEEZE.\n\nThe most perplexing thing I came across while researching $ETWO was the insanely high amount of Short Interest. Here is a shot from finviz on 4/26/2021 (The day I’m writing this):\n\n[https://imgur.com/9A7W7EC](https://imgur.com/9A7W7EC)\n\nThe % of the float short is a whopping 48%! In contrast, $MVIS’s % of float shorted is a little over 19%, $CLOV is at 35% and $GME is around 20%. Stock grid has a good visual representation of $ETWO’s short %:\n\n[https://www.stockgrid.io/shortinterest/etwo](https://www.stockgrid.io/shortinterest/e2)\n\nYou will also notice, on both finviz and stockgrid, the short ratio. For you fellow apes out there who can barely read, The short ratio tells investors approximately how many days it would take short sellers to cover their positions if the price of a given stock were to increase. The higher the short ratio, the longer it will take to buy back those borrowed shares. The Short ratio for $ETWO is a whopping 7 days! In contrast, $GME’s is at 0.23 days, $MVIS is 3.4 days, and $CLOV is 4.2 days. This means it will take a full week (more than that, considering trading weeks are only 5 days) for the shorts to cover their asses. A sharp uptick in price will have them bending over in no time.\n\nAnother key indicator that convinces me that this stock is going to the moon is one of [u/DeepFuckingValue](https://www.reddit.com/u/DeepFuckingValue/) ‘s favorites: Insider Buying. The following chart shows the latest insider buyer action:\n\n[https://imgur.com/TTs5qqZ](https://imgur.com/TTs5qqZ)\n\nYou can see that insiders are buying the shit out of this stock, and not selling. It’s always a great confirmation bias when the company insiders like the stock.\n\nTL;DR:\n\n$ETWO is an upcoming Supply Chain Software company with 48% of it’s float shorted. It’s fundamentals are sound, it’s potential is huge, and it’s currently heavily undervalued. It’s\n\nbeing backed by Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.\n\nSome of it’s notable customers are: MD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.\n\nThe % of the float shortest is a whopping 48%! It’s short ratio is 7 (It will take shorts 7 days to cover their positions if the stock ticks up).\n\nEven shorter TL;DR:\n\nI like the stock. It’s undervalued. It’s about to go on a short squeeze ride to the moon, and even the big wigs over at JP Morgan are saying this thing is a steal. Oh, and it’s clients are of the likes of FB, Google, Intel, MSFT, NVDA, NKE, etc (Look at the above list for more).\n\n$ETWO Positions:\n\n12/17/21 12.5c,\n\n12/17/21 15c,\n\n12/1721 17.5c",
        "subreddit": "options",
        "title": "$ETWO DD : Unjustly shorted (48% of float), deep value company",
        "url": "https://www.reddit.com/r/options/comments/n0kylp/etwo_dd_unjustly_shorted_48_of_float_deep_value/",
        "created": 1619662125.0
    },
    {
        "author": "YahyaJ",
        "created_utc": 1618766136,
        "id": "mtgzvc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&gt;It's not my intention to manipulate the market.  \n&gt;  \n&gt;Disclaimer I do not provide personal investment advice and I am not a qualified licensed investment advisor. I am an amateur investor. I will not and cannot be held liable for any actions you take as a result of anything you read here.  \n&gt;  \n&gt;Conduct your own due diligence, or consult a licensed financial advisor or broker before making any and all investment decisions.   \n&gt;  \n&gt;Got it? Now to the post.\n\n&amp;#x200B;\n\n[DD PILLS](https://preview.redd.it/72fdnyfkpyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=dbd0d2fb2fb04a674987c370dabe5d7530cf23f2)\n\nDD PILLS is a new series, I will regularly try to post multiple stocks that I find interesting in one post. It takes me hours to prepare this kind of material, I hope you enjoy it! And for updates you can follow me!\n\nPlease note that what I think about a company now could change tomorrow depending on multiple factors, I can't make a post every time I find something about a stock I've talked about before in a DD, that's why I created a FREE discord server where as a community we talk about stocks and find new interesting ones, check my profile for the link.\n\n**The stocks are sorted alphabetically and not in order of importance.**\n\n&amp;#x200B;\n\n[BLNK RECAP](https://preview.redd.it/kr662f3spyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=3ac063bfcaf78839640c2b3d1b38e884346ca444)\n\n**If you $BLNK you might miss the first one!**  \nBlink is a technical play in my opinion, the short loan rate is high (50.92%) and the short interest is one of the highest, the stock is following an upward channel and is right now at the lower end, looks good for an entry on Monday.  \n**My plan:**  \nI will watch the movement on the pre market and look for confirmation that it is going up in the early trading hours of the market, wait for a pullback and add a position later in the afternoon or the next day.\n\n[BLNK CHART](https://preview.redd.it/q2t3db0xpyt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=545cb6f81979719cc808c12abec13ead047f9311)\n\n**Quick Overview**  \nBlink Charging Co is an owner, operator, and provider of electric vehicle (EV) charging services. The company offers both residential and commercial EV charging equipment, enabling EV drivers to easily recharge at various location types. Its principal line of products and services are the Blink EV charging network (the Blink Network) and EV charging equipment (also known as electric vehicle supply equipment), and EV-related services.\n\n&amp;#x200B;\n\n**New investors**  \nMajor holders that have opened new positions in BLNK / Blink Charging Co include State Street Corp, KOMP - SPDR S&amp;P Kensho New Economies Composite ETF, Group One Trading, L.p., Group One Trading, L.p., FKASX - Federated Kaufmann Small Cap Fund Class A Shares, No Street GP LP, KAUAX - Federated Kaufmann Fund Class A Shares, IMC-Chicago, LLC, IMC-Chicago, LLC, XRT - SPDR(R) S&amp;P(R) Retail ETF, Hrt Financial Lp, Antara Capital LP, ALPS ETF Trust - ALPS Clean Energy ETF, PEAK6 Investments LLC, HAIL - SPDR S&amp;P Kensho Smart Mobility ETF, Independent Advisor Alliance, Warberg Asset Management LLC, North Fourth Asset Management, LP, HSGFX - Hussman Strategic Growth Fund, and Schonfeld Strategic Advisors LLC.\n\n[BLNK INVESTORS](https://preview.redd.it/i9qoz7c0qyt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=752bd6ce679c42798ba278f5af481e5e1e231f31)\n\n**The dd pill**  \nI would define Blink Charging as a hybrid stock, it is an EV stock but at the same time a renewable energy stock. In fact it usually follows trends in both sectors and can benefit from both. Blink Charging is one of the leaders in its industry and it looks like it will be investing outside the U.S. Last week the company announced that it had installed 42 new chargers in New York and the stock price jumped 13%. Optimism about Biden's plan to build a national EV charging system may push this stock even higher. But long term investors will need to watch out for any significant corrections. Right now, BLNK’s valuation seems overstretched with a price/sales ratio of roughly 289x.\n\n&amp;#x200B;\n\n[ESGC RECAP](https://preview.redd.it/laodwewbqyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=97ec601d9b4beeacb34e94d0493b7800483d1ae3)\n\n**The second one on today's list is $ESGC**  \nI already made a DD about this company before, i sold for a profit when it started rising on a NFT rumour concerned about a fall when i noticed no official news was coming. Looking at the chart I think this week we may see a lot going on, in my opinion we’ll either see a continuation of the uptrend that we’ve seen on Friday or a further fall to the $1.36 area before a big bounce that could send this stock flying.  \n**My plan:**  \nLook what the movement will be on monday, volume will be the key on this one. If i see it going to $1.65 then i’ll wait for a small pull back to get a position. If it goes over $1.85 after I have a position at $1.6 or lower I'll start putting stop losses 11 cents below every X.X5 it reaches. If instead ESGC goes red on Monday i’ll wait for consolidation in the $1.3/1.4 area and get my position waiting for a reversal.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\n[ESGC CHART](https://preview.redd.it/tqhw3p1oqyt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=bd3a2dfb08bdc8abd4b556af1be08a8d1f60078d)\n\n**Quick Overview**  \nEros STX Global Corporation produces, markets, and distributes content to audiences around the world across traditional and digital media platforms. The company produces and distributes films, scripted and unscripted TV programming, and digital content across a variety of platforms. It also offers Eros Now, a subscription based OTT platform. Eros STX Global Corporation is headquartered in Burbank, California.\n\n**New investors**  \nMajor holders that have opened new positions in ESGC / Eros Stx Global Corp include Palladium Partners Llc, RIFBX - U.S. Small Cap Equity Fund, SSTIX - State Street Total Return V.I.S. Fund Class 1 Shares, Cruiser Capital Advisors, Llc, Hollencrest Capital Management, VFMO - Vanguard U.S. Momentum Factor ETF ETF Shares, Jump Financial, LLC, Truist Financial Corp, Quadrant Capital Group Llc, Regent Peak Wealth Advisors LLC, and DFAU - Dimensional US Core Equity Market ETF.\n\n[ESGC INVESTORS](https://preview.redd.it/7spsofevqyt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=32758af747a90023b919773f879c9ce24562f8c8)\n\n**The dd pill**  \nBasically Eros STX is a movie producer and distributor that is trying to enter the streaming services market, only in India it has more users than Netflix has worldwide. It also has deals with Amazon and HBO to distribute its movies and content. This company is trying to show the world that it is very undervalued, the low short interest and high institutional ownership shows that institutions really believe in the success of the company. \n\n**Keep it on your watchlist, any good news could send it flying.**\n\n&amp;#x200B;\n\n[JAGX RECAP](https://preview.redd.it/qv0nvl0dryt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=ec11f47847765bddfdae5859db2b97a6b154d8b5)\n\n**And here comes the third one: JAGX!**  \nThis will be a pure short swing trade for me if what I hope happens, on Friday a news about an offering dropped the stock 7.8%!!! It bounced off the low of the down channel it's in, I'll keep an eye on it this week. All it needs is volume or positive news and this could be back to $1.80/2.00 in no time!\n\n**My plan:**  \nThere are many bagholders on this stock, this week there is no expected news from the company and investors' eyes are not on this type of stock. The next few days will be like a test for this stock, will it hold its value like it did before the latest news? Will it find support or will it rebound because there are still people who believe a lot in this stock? Or, as it has done many times before, will the company release good news and we will see a sudden rise? My plan is to see how it performs Monday afternoon and look for a clue that someone is loading up on this stock.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\n[JAGX CHART](https://preview.redd.it/z5dlk2nhryt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=ed2f45103cc56ad9cbfc219ea7ca141f83e435ec)\n\n**Quick Overview**  \nJaguar Health Inc is a commercial-stage pharmaceuticals company focused on developing novel, sustainably derived gastrointestinal products. The company's wholly-owned subsidiary, Napo Pharmaceuticals, Inc focuses on developing and commercializing proprietary human gastrointestinal pharmaceuticals for the marketplace from plants used traditionally in rainforest areas. It operates into two business segments namely Human health and animal health. Its Mytesi (crofelemer) product is approved by the U.S. FDA for the symptomatic relief of noninfectious diarrhea in adults with HIV/AIDS on antiretroviral therapy.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\n[JAGX INVESTORS](https://preview.redd.it/cvcm1rvvryt61.png?width=1167&amp;format=png&amp;auto=webp&amp;s=d02d1c7993c46be17b7131cdf25d346724641d66)\n\n**The dd pill**  \nI find JAGX very interesting, many pennystocks get sudden increases in value because they are trending on social media, this one is somewhat different. There are many DDs about it on reddit yet it doesn't have a big following. JAGX's main product is Mystesi (FDA approved) and is used as an anti-diarrheal in adult HIV/AIDS patients who are on antiretroviral therapy. The company has a wholly owned European subsidiary called Napo Pharmaceuticals that specifically develops and markets treatments based on rainforest plants. This company is very interesting because Jaguar Health through Napo EU is doing research to see if Mystesi could be used to treat patients with long-term symptoms from Covid-19. In the U.S., Jaguar Health hopes to receive regulatory approval to market Mytesi as an anti-diarrheal for cancer therapy-induced diarrhea.\n\n**Something big could come from this in the coming weeks.**\n\n[KOSS](https://preview.redd.it/ygsgsrx0syt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=fbb57ea125f8492a14b0ce9874af42737e3ea5ff)\n\n**And the last one is a sympathy of GME!**  \nThis is very interesting, over the past few weeks it has been reported many times that KOSS had a very high and unusual short borrow fee, on Thursday a 104% short borrow fee was reported. After the market closed on Friday it was reported that no shares were available to short. This is a candidate for the short squeeze.\n\n**My plan:**  \nSocial media, social media, social media! This has a very high potential to become popular among trader groups. If unusual volume starts coming in, it could easily trap shorts and trigger a squeeze, if I see unusual volume and social media talking a lot about it, I will jump on the rocket. This is a risky stock play, without volume or interest it could collapse and go back to pennyland.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\n[KOSS CHART](https://preview.redd.it/k19v83gcsyt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=42b86ddd1a88939d9c7da273e9e1862f13ad3895)\n\n**Quick Overview**  \nKoss Corp is a engaged in the design, manufacture, and sale of stereo headphones and related accessory products. It operates in the audio/video industry segment of the home entertainment industry. The company markets a line of headphones, wireless Bluetooth headphones, wireless Bluetooth speakers, computer headsets, telecommunications headsets, active noise-canceling headphones. Majority of the firm's revenue is derived from sales of stereo headphones.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\n[KOSS INVESTORS](https://preview.redd.it/egu5drrgsyt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=ed66a4e430b25198d626cfa391421307f7e71433)\n\n**The dd pill**  \nKoss was founded in 1958, they are the inventors of stereos. For a while it was a leader in its industry but when competition came in and the company failed to diversify Koss had to file for bankruptcy in 1984. The following year it was back in business but its stock always failed to gain traction until this year when it went from less than a dollar to $127.45 in January. Koss right now is very competitive in the marketplace, its wireless headphones are popular on Amazon but its competitors are much bigger like Sony and Apple.\n\n**Keep weed stocks on your radar this week!**\n\n[WEED STOCKS!](https://preview.redd.it/xe53dqcmsyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=5f0420fb8cdc9b548a5702d2b402ec5b07f34613)",
        "subreddit": "Wallstreetbetsnew",
        "title": "DD Pills - Next Week Potential Market Movers - $BLNK $ESGC $JAGX $KOSS $APHA $SNDL $TLRY",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mtgzvc/dd_pills_next_week_potential_market_movers_blnk/",
        "created": 1618794936.0
    },
    {
        "author": "SnooMacarons1548",
        "created_utc": 1619633426,
        "id": "n0kzx6",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " The case for $ETWO:\n\nBefore I go into the long ass DD, I’ll provide a quick TL;DR for all the fellow apes out there, so just scroll to the bottom!\n\nE2Open, or $ETWO, provides cloud-based, on-demand software for supply chains for everything from computers, electronics systems and, well, essentially any company wanting to have an edge on it’s competitors . And let’s be serious, data is the modern day oil. Here is their Investment Thesis:\n\n[https://imgur.com/M95UL86](https://imgur.com/M95UL86)\n\nAnd seeing how my only claim to success is a massive GME yolo back in November, I’ll let someone with better credentials describe this company. Goldman Sachs analyst Chris Merwin initiated coverage on $ETWO and gave it a BUY rating (note: Loop Capital also just recently upgraded it to BUY). He had this to say about it:\n\n\"E2Open is a provider of supply chain management (SCM) solutions to the enterprise. While the SCM space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn of expansion\n\nopportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"\n\nAnother notable thing worth mentioning is that the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba. In other words, $ETWO had some goliaths backing them from the start.\n\n[u/DragonfruitAccurate3](https://www.reddit.com/u/DragonfruitAccurate3/) had a solid DD on $ETWO not long ago. Instead of trying to put it in my own words, I’ll just use his, as his DD is flawless IMO:\n\n*Why E2Open is likely undervalued*\n\n*Insight Partners, the private equity firm that owns E2Open has a ridiculously strong history of taking midsized SaaS companies like E2Open from valuations of hundreds of millions to multi billion dollar valuations. Other companies in Insight Partner's portfolio include:*\n\n*- Qualtrics (invested at $850mm valuation, sold in 2018 for $8bn and 9.4x+ return)*\n\n*- Shopify (invested in 2013, IPOed at $17/share in 2015 and is now $1,225/share for a likely 100x+ return)*\n\n*- DocuSign (invested in 2017 they IPOed in 2018 at $29/share in 2018 and is now $244.93/share)*\n\n*- Twitter (invested in 2009, it was valued at $100mm in 2008 and now has a $43bn market cap)*\n\n*- Diligent (bought in 2016 for $624mm and currently valued at $4bn for a 6.4x return)*\n\n*- Chegg (invested in 2009, IPOed in 2013 at $12.50/share, currently at $92/share)*\n\n*- Alteryx (invested in 2014, IPOed in 2017 at $14/share, currently at $129/share)*\n\n*- E2Open (bought in 2015 for $273mm, current enterprise valuation is around $2.57bn for a 9.4x return)*\n\n*The top 2 managing directors of Insight Partners: Adam Berger and Deven Parekh both sit on the E2Open board. They're known as active investors heavily involved in the strategic direction and acquisition strategy of E2Open. Deven Parekh was the lead for the early Twitter investment in 2009 that saw a return north of 40,000%. The guy is nothing short of a visionary.*\n\n*The most similar company to E2Open in Insight Partner's portfolio is Diligent. They're both SaaS platforms with long sales cycles, and have almost identical revenue ($340mm for Diligent vs $335mm for E2Open), and a similar product strategy of rapid acquisition and integration. Despite the similarities, Diligent is valued substantially more ($4+bn for Diligent, while only $2.73bn for E2Open), leading one to believe that E2Open is currently undervalued.*\n\n*Further evidence of E2Open's undervaluation is in its enterprise value relative to EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). E2Open's value is only 21.3x EBITDA, which is on par with the average software EBITDA of 20-24x, while its closest peers Descartes is at 29.2x and Kinaxis is at a whopping 59.1x. Significant upside remains in E2Open's future growth.*\n\n*E2Open’s approach to acquiring industry leaders has enabled them to acquire a stable of tech clients such as AMD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.*\n\n*E2Open customers include:*\n\n[*https://imgur.com/RG6rryD*](https://imgur.com/RG6rryD)\n\n*E2Open's strategic acquisitions of the past 7 years (at least 11 companies) allows end-to-end supply chain data visibility, the holy grail for tech and consumer goods companies. This allows them to compete in the big leagues against incumbents such as SAP and Oracle while leaving single use-case disruptors in the dust.*\n\n*E2Open has yet to fully realize its data integration potential involving artificial intelligence (AI), machine learning (ML) and ESG/sustainability. E2Open has plenty of avenues to pursue multipliers in shareholder value. It wouldn't surprise me that E2Open were to acquire an AI/ML supply chain company in the following quarters to boost shareholder value.*\n\n*If E2Open successfully executes their strategy of fully integrated end-to-end supply chain visibility, it's possible that they'd be acquired by SAP, Oracle, Amazon, Shopify or even Salesforce in the coming years at multiples of their current valuation. The potential value and unique competitive advantage of the data and tech E2Open offers is far too valuable for these companies to ignore.*\n\n*Product stickiness is a key differentiator for E2Open. It boasts of gross retention rates above 95%. The exceedingly low churn rate, a key health indicator of SaaS platforms, is a strong positive indicator of future growth.*\n\n*E2Open is one of the largest software firms focused on the supply chain sector with the following actual and expected revenue and is PROFITABLE:*\n\n*2019A- 205M*\n\n*2020A- 305M*\n\n*2021E- 335M*\n\n*2022E- 367M*\n\n*Current institutional investors PRE-MERGER include Goldman Sachs, Blackstone Group, and many big filing claims coming including this recent submission:* [*https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm*](https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm)\n\nNow for the juicy bit my friends:\n\nThe SHORT SQUEEZE.\n\nThe most perplexing thing I came across while researching $ETWO was the insanely high amount of Short Interest. Here is a shot from finviz on 4/26/2021 (The day I’m writing this):\n\n[https://imgur.com/9A7W7EC](https://imgur.com/9A7W7EC)\n\nThe % of the float short is a whopping 48%! In contrast, $MVIS’s % of float shorted is a little over 19%, $CLOV is at 35% and $GME is around 20%. Stock grid has a good visual representation of $ETWO’s short %:\n\n[https://www.stockgrid.io/shortinterest/etwo](https://www.stockgrid.io/shortinterest/e2)\n\nYou will also notice, on both finviz and stockgrid, the short ratio. For you fellow apes out there who can barely read, The short ratio tells investors approximately how many days it would take short sellers to cover their positions if the price of a given stock were to increase. The higher the short ratio, the longer it will take to buy back those borrowed shares. The Short ratio for $ETWO is a whopping 7 days! In contrast, $GME’s is at 0.23 days, $MVIS is 3.4 days, and $CLOV is 4.2 days. This means it will take a full week (more than that, considering trading weeks are only 5 days) for the shorts to cover their asses. A sharp uptick in price will have them bending over in no time.\n\nAnother key indicator that convinces me that this stock is going to the moon is one of [u/DeepFuckingValue](https://www.reddit.com/u/DeepFuckingValue/) ‘s favorites: Insider Buying. The following chart shows the latest insider buyer action:\n\n[https://imgur.com/TTs5qqZ](https://imgur.com/TTs5qqZ)\n\nYou can see that insiders are buying the shit out of this stock, and not selling. It’s always a great confirmation bias when the company insiders like the stock.\n\nTL;DR:\n\n$ETWO is an upcoming Supply Chain Software company with 48% of it’s float shorted. It’s fundamentals are sound, it’s potential is huge, and it’s currently heavily undervalued. It’s\n\nbeing backed by Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.\n\nSome of it’s notable customers are: MD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.\n\nThe % of the float shortest is a whopping 48%! It’s short ratio is 7 (It will take shorts 7 days to cover their positions if the stock ticks up).\n\nEven shorter TL;DR:\n\nI like the stock. It’s undervalued. It’s about to go on a short squeeze ride to the moon, and even the big wigs over at JP Morgan are saying this thing is a steal. Oh, and it’s clients are of the likes of FB, Google, Intel, MSFT, NVDA, NKE, etc (Look at the above list for more).\n\n$ETWO Positions:\n\n12/17/21 12.5c,\n\n12/17/21 15c,\n\n12/1721 17.5c",
        "subreddit": "Wallstreetbetsnew",
        "title": "$ETWO DD : Unjustly shorted (48% of float), deep value company",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n0kzx6/etwo_dd_unjustly_shorted_48_of_float_deep_value/",
        "created": 1619662226.0
    },
    {
        "author": "Keeninsight111",
        "created_utc": 1617761193,
        "id": "mlrrcl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "When you subscribe to Eros Now (E . S. G. C) for $4.99 through Amazon PRIME, why are all of Eros Now's movies and shows pulled up within the same format and look as all of Amazon PRIME movies and shows? This is very peculiar....Obviously, you can't pull up Netflix content that way, and every time you access Netflix, it has it's own unique format look....Since Eros Now's whole library has been inserted into Amazon Prime's menu format and look, it makes me wonder if Amazon is buying eros/stx",
        "subreddit": "wallstreetbets",
        "title": "is Amazon buying eros stx?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mlrrcl/is_amazon_buying_eros_stx/",
        "created": 1617789993.0
    },
    {
        "author": "Silverblade5",
        "created_utc": 1619657771,
        "id": "n0t96b",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "What do you guys think about this one? I opened a call a couple days ago and now it's up 90%. Any tips for locking in gains, or for ensuring order execution when I choose to sell?",
        "subreddit": "Wallstreetbetsnew",
        "title": "Seagate Technology STX",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n0t96b/seagate_technology_stx/",
        "created": 1619686571.0
    },
    {
        "author": "Keeninsight111",
        "created_utc": 1617747479,
        "id": "mlnfki",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "When you subscribe to Eros Now (ESGC) for $4.99 through Amazon  PRIME,  why are all of Eros Now's movies and shows pulled up within the same format and look as all of Amazon PRIME movies and shows?  This is very peculiar....Obviously,  you can't pull up Netflix content that way,  and every time you access Netflix,  it has it's own unique format look....Since Eros Now's whole library has been inserted into Amazon Prime's menu format and look,  it makes me wonder if Amazon is buying Eros STX ( ESGC)",
        "subreddit": "wallstreetbets",
        "title": "Amazon buying EROS STX? ESGC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mlnfki/amazon_buying_eros_stx_esgc/",
        "created": 1617776279.0
    },
    {
        "author": "ajcaca",
        "created_utc": 1619650814,
        "id": "n0r5k1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "*Tldr: good chance that WDC skyrockets are earnings tomorrow. I am long options and stock and will buy call spreads in the morning.*\n\nOver the past few weeks, demand for ultra fast SSD and very large capacity (16TB+) hard disk drives has skyrocketed and prices have gone up significantly.\n\nWhy? Because a new project called Chia created by Bram Cohen (the guy who invented BitTorrent) has come online and instead of proof of work it uses proof of space (ie hard drives). And it has *really* taken off.\n\nAnyway, I'm not here at all to talk about Chia - that is just context for stock plays. My interest right now is in the HDD manufacturers.\n\nSeagate (STX) announced very strong earnings last week and specifically talked about this project driving up demand and learning to a shortage of supply. The stock is up \\~12% since. Western Digital (WDC) is announcing tomorrow after market close and I think they will head towards the moon.\n\nIt's not hard to validate this hypothesis (at least the demand/supply aspect). Go try to find some 7k IO 2GB and 4GB NVME SSD cards or 16TB hard drives and see how many you can get your hands on. They are *really* hard to find right now in many countries and many stores are putting '1 item per customer' limitations on.\n\nI am a degenerate gambler so of course I am long STX and WDC mid May expiry calls as well as $50k of WDC stock going into earnings tomorrow. I'm planning to put on WDC call spreads in the morning so I have the option upside but not the vol crush after earnings.\n\nThis is my first post on WSB but I think I'm supposed to use some emojis, so here we go. 💎💎💎🚀🚀🚀🌈🌈🌈",
        "subreddit": "wallstreetbets",
        "title": "Western Digital (WDC) insane demand not priced into earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0r5k1/western_digital_wdc_insane_demand_not_priced_into/",
        "created": 1619679614.0
    },
    {
        "author": "raoha",
        "created_utc": 1619778929,
        "id": "n1r3gu",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**E2Open ($ETWO):**\n\n**An undervalued 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\n*Note: For a quicker recap, scroll to the bottom for a TL;DR - As well as for a few odd and very intriguing tidbits that i discovered while investigating this stock.*\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY** \n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.”  \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%). \n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to Wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n&amp;#x200B;\n\n* **A Snapshot of its largest customer base:**\n\nhttps://preview.redd.it/8pbrptfddaw61.jpg?width=1194&amp;format=pjpg&amp;auto=webp&amp;s=d6459803384d39f540364c16421115fbf9d138ae\n\n* **A Snapshot Of Their Investment Thesis:**\n\nhttps://preview.redd.it/jhbq07fodaw61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=d3e1948531e138578efb65c5c590b5449e94854c\n\n **Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n&amp;#x200B;\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n\n&amp;#x200B;\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\nhttps://preview.redd.it/kmd7y51seaw61.png?width=787&amp;format=png&amp;auto=webp&amp;s=0146f92628bf5c03a6e06ac38a3f78b2487f5922\n\n**A Visual Of Why $ETWO is Unique and Different From the Pack:**\n\nhttps://preview.redd.it/0tarczq2faw61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=9caa81771669fc07dd6d44b47d957d0a4c9a8be7\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis. They also boast an extremely low churn rate, which is a great indicator for SaaS platforms. This is further indication that the company is due for strong future growth. Below are some visuals demonstrating the value of ETWO:\n\n&amp;#x200B;\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/ejxqy0uvcaw61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=354beb161c3eb474a2ff5b198ed54f174df3cf3e\n\n* **Attractive Long Term Financial Profile:**\n\nhttps://preview.redd.it/0qsrtn60daw61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=8670e0a3eaa8dcef7f134d43c083bc14edc6a3e0\n\n* **Growth and Profitability:**\n\nhttps://preview.redd.it/obqk5ff9daw61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=a5f9e50f9b5c2854111bdef7d52ecfbc6d2493c9\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it.  If you think about that, you’ll do things differently.”  \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management (SCM) solutions to the enterprise. While the SCM space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest: \n\n [ETWO E2open Parent Holdings, Inc. SHort Interest (finviz.com)](https://finviz.com/quote.ashx?t=ETWO) \n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine: \n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "wallstreetbets",
        "title": "$ETWO - An undervalued Cloud-Based SaaS Platform, And The Future Of Supply Chain Management",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n1r3gu/etwo_an_undervalued_cloudbased_saas_platform_and/",
        "created": 1619807729.0
    },
    {
        "author": "cfenn1",
        "created_utc": 1618948161,
        "id": "muyqel",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’m genuinely surprised that #ESGC continues to sit so low in the market. The films #STX has put out over the last few years have been great, and they are taking their business to a mostly untapped market with huge potential. I have a feeling this stock is going to blow up. I’m glad I’ve been buying while it’s still affordable.",
        "subreddit": "wallstreetbets",
        "title": "Undiscovered stock?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/muyqel/undiscovered_stock/",
        "created": 1618976961.0
    },
    {
        "author": "Itsboomhomie",
        "created_utc": 1618847033,
        "id": "mu3fq4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey gang its **Boom** here, with a continuation of a series of DD posts for companies where I currently hold no position. No position = objective outlook. \n\n ESGC is a production company “delivering star-driven premium content to audiences across platforms worldwide”, [according to their website](https://erosstx.com/about-us/). Headquartered in Burbank, CA, ESGC develops, produces, and distribues Bollywood and Hollywood content. Eros International was an Indian mass media conglomerate and last year merged with STX Entertainment, a US production company, to form what is now ESGC. STX previously had plans to go public in 2018, but called it off citing the China-US Trade war. Then they lost funding, and their co-founder was fired due to his involvement in the college admissions bribery scandal that saw Aunt Becky serve prison time. They merged with Eros, inheriting Eros’ listing on the NYSE, and ESGC was born.\n\nInstitutions seem to like ESGC, owning 33.43% of the company, [via WhaleWisdom](https://whalewisdom.com/stock/eros). Some familiar names in there as far as penny stocks short sellers - Citadel, Susquehanna, CVI, BlackRock. The biggest institutional holder is Hony Capital, a Chinese hedge fund that [claims to be focused on long term value growth](https://www.honycapital.com/dutyinvest_en/index.aspx?nodeid=2057). Compared to last quarter, total puts dropped by almost 55%. These are still Q4 2020 numbers, and I’m interested to see how the Q1 2021 numbers would compare. What I see from institutions seems bullish.\n\nI think market and company conditions that proved to be disastrous for STX while pursuing their IPO has been a boon for Eros. The merger makes a lot of sense - Eros is a bigger player in India, while STX was sort of a Miramax-y mid-level indie that wanted to be publicly traded. For being an independent film company, STX has stuff you’ve probably heard of and/or seen - *Bad Moms, Uglydolls, Hustlers, Greenland*, and my personal favorite *Hardcore Henry*. [They just announced SNL weed-head Pete Davidson](https://deadline.com/2021/04/pete-davidson-i-slept-with-joey-ramone-netflix-stxfilms-1234734894/) for the Joey Ramone biopic that will be on Netflix. Eros Now, a Netflix-like Indian streaming service claims to have 36 million paid subscribers and has been in the region longer than both Netflix and Prime Video. So they have a Hollywood production and distribution arm coupled with an in-house streaming platform. So why is this stock in penny land?\n\nIn 2019, before merging with STX, Eros saw their shares drop over 50% in a single day - June 3, 2019 to be exact. That particular month was not kind to Eros, with shares tumbling from over $7 to below $1.50 on ratings downgrades for ongoing delays/default in debt servicing, [with Moody’s citing cash flow issues in the company](https://www.cnbctv18.com/market/stocks/why-this-media-stock-lost-80-investor-wealth-in-2019-3944881.htm). Eros shot back that their liquidity was fine, and [they were being targeted by short sellers](https://www.businesswire.com/news/home/20190715005402/en/Eros-International-Plc-Reports-Fourth-Quarter-and-Fiscal-Year-End-2019-Results) (sound familiar? Looking at you, SOS). So the stock got battered and there was probably some truth to their financing woes. In steps STX. They merge and capitalize with [$125M of new equity funding and a revamped $350M credit facility led by JP Morgan](https://www.businesswire.com/news/home/20200730005622/en/Eros-International-Plc-and-STX-Entertainment-Complete-Merger-to-Form-Eros-STX-Global-Corporation). With a pandemic slowing film production significantly, ESGC’s revenues declined, with a mild offset from Eros Now’s growing subscriber base. As of Sept 2020, they were holding $384M in total debt with $82M cash on hand, so they need to get their balance sheet in the right direction or they’ll continue to flounder. They are working with JP Morgan [“to optimize all current debt facilities”](https://finance.yahoo.com/news/erosstx-issues-fiscal-2021-interim-211700880.html) to strengthen their balance sheet.\n\nWith countries reopening as Covid abates, I think movie theaters will have an excess demand, and STX generally works with bankable stars. ESGC will need to continue to strengthen their balance sheet, but with a foothold in two of the world’s biggest film industries, I think they do have a bright future. \n\nLove ya\n\n\\- Boom",
        "subreddit": "RobinHoodPennyStocks",
        "title": "*no position DD* ESGC - balance sheet needs movie magic",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mu3fq4/no_position_dd_esgc_balance_sheet_needs_movie/",
        "created": 1618875833.0
    },
    {
        "author": "ZestycloseEast9617",
        "created_utc": 1619380298,
        "id": "myg2c8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Chia is cryptocurrency that uses hard drives instead of CPU. Hard disks are running out. Would it make sense for you to invest in Seagate?",
        "url": "https://i.redd.it/ojwc8vwijdv61.jpg",
        "created": 1619409098.0
    },
    {
        "author": "nord2rocks",
        "created_utc": 1619458403,
        "id": "mz34tw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Computer Storage Companies, Seagate and Western Digital are positioned for short and maybe long term growth",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mz34tw/computer_storage_companies_seagate_and_western/",
        "created": 1619487203.0
    },
    {
        "author": "osaruben",
        "created_utc": 1619728065,
        "id": "n1df1m",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Guy don't loose the rocket 🚀🚀🚀\nWD going to the moon. I been checking for it from last week and investing. Probably the reason the new \"chia coin\" coming soon. HDD sales are on fire. Check also Seagate stock",
        "subreddit": "wallstreetbets",
        "title": "Western Digital (WDC) #TOTHEMOON!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n1df1m/western_digital_wdc_tothemoon/",
        "created": 1619756865.0
    },
    {
        "author": "NZbarnstormer",
        "created_utc": 1619575786,
        "id": "n04hqd",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Eros STX Global Corp (NYSE:ESGC) to the moon!",
        "url": "https://www.reddit.com/r/pennystocks/comments/n04hqd/eros_stx_global_corp_nyseesgc_to_the_moon/",
        "created": 1619604586.0
    },
    {
        "author": "SnooMacarons1548",
        "created_utc": 1619633374,
        "id": "n0kz94",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " The case for $ETWO:\n\nBefore I go into the long ass DD, I’ll provide a quick TL;DR for all the fellow apes out there, so just scroll to the bottom!\n\nE2Open, or $ETWO, provides cloud-based, on-demand software for supply chains for everything from computers, electronics systems and, well, essentially any company wanting to have an edge on it’s competitors . And let’s be serious, data is the modern day oil. Here is their Investment Thesis:\n\n[https://imgur.com/M95UL86](https://imgur.com/M95UL86)\n\nAnd seeing how my only claim to success is a massive GME yolo back in November, I’ll let someone with better credentials describe this company. Goldman Sachs analyst Chris Merwin initiated coverage on $ETWO and gave it a BUY rating (note: Loop Capital also just recently upgraded it to BUY). He had this to say about it:\n\n\"E2Open is a provider of supply chain management (SCM) solutions to the enterprise. While the SCM space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn of expansion\n\nopportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"\n\nAnother notable thing worth mentioning is that the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba. In other words, $ETWO had some goliaths backing them from the start.\n\n[u/DragonfruitAccurate3](https://www.reddit.com/u/DragonfruitAccurate3/) had a solid DD on $ETWO not long ago. Instead of trying to put it in my own words, I’ll just use his, as his DD is flawless IMO:\n\n*Why E2Open is likely undervalued*\n\n*Insight Partners, the private equity firm that owns E2Open has a ridiculously strong history of taking midsized SaaS companies like E2Open from valuations of hundreds of millions to multi billion dollar valuations. Other companies in Insight Partner's portfolio include:*\n\n*- Qualtrics (invested at $850mm valuation, sold in 2018 for $8bn and 9.4x+ return)*\n\n*- Shopify (invested in 2013, IPOed at $17/share in 2015 and is now $1,225/share for a likely 100x+ return)*\n\n*- DocuSign (invested in 2017 they IPOed in 2018 at $29/share in 2018 and is now $244.93/share)*\n\n*- Twitter (invested in 2009, it was valued at $100mm in 2008 and now has a $43bn market cap)*\n\n*- Diligent (bought in 2016 for $624mm and currently valued at $4bn for a 6.4x return)*\n\n*- Chegg (invested in 2009, IPOed in 2013 at $12.50/share, currently at $92/share)*\n\n*- Alteryx (invested in 2014, IPOed in 2017 at $14/share, currently at $129/share)*\n\n*- E2Open (bought in 2015 for $273mm, current enterprise valuation is around $2.57bn for a 9.4x return)*\n\n*The top 2 managing directors of Insight Partners: Adam Berger and Deven Parekh both sit on the E2Open board. They're known as active investors heavily involved in the strategic direction and acquisition strategy of E2Open. Deven Parekh was the lead for the early Twitter investment in 2009 that saw a return north of 40,000%. The guy is nothing short of a visionary.*\n\n*The most similar company to E2Open in Insight Partner's portfolio is Diligent. They're both SaaS platforms with long sales cycles, and have almost identical revenue ($340mm for Diligent vs $335mm for E2Open), and a similar product strategy of rapid acquisition and integration. Despite the similarities, Diligent is valued substantially more ($4+bn for Diligent, while only $2.73bn for E2Open), leading one to believe that E2Open is currently undervalued.*\n\n*Further evidence of E2Open's undervaluation is in its enterprise value relative to EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). E2Open's value is only 21.3x EBITDA, which is on par with the average software EBITDA of 20-24x, while its closest peers Descartes is at 29.2x and Kinaxis is at a whopping 59.1x. Significant upside remains in E2Open's future growth.*\n\n*E2Open’s approach to acquiring industry leaders has enabled them to acquire a stable of tech clients such as AMD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.*\n\n*E2Open customers include:*\n\n[*https://imgur.com/RG6rryD*](https://imgur.com/RG6rryD)\n\n*E2Open's strategic acquisitions of the past 7 years (at least 11 companies) allows end-to-end supply chain data visibility, the holy grail for tech and consumer goods companies. This allows them to compete in the big leagues against incumbents such as SAP and Oracle while leaving single use-case disruptors in the dust.*\n\n*E2Open has yet to fully realize its data integration potential involving artificial intelligence (AI), machine learning (ML) and ESG/sustainability. E2Open has plenty of avenues to pursue multipliers in shareholder value. It wouldn't surprise me that E2Open were to acquire an AI/ML supply chain company in the following quarters to boost shareholder value.*\n\n*If E2Open successfully executes their strategy of fully integrated end-to-end supply chain visibility, it's possible that they'd be acquired by SAP, Oracle, Amazon, Shopify or even Salesforce in the coming years at multiples of their current valuation. The potential value and unique competitive advantage of the data and tech E2Open offers is far too valuable for these companies to ignore.*\n\n*Product stickiness is a key differentiator for E2Open. It boasts of gross retention rates above 95%. The exceedingly low churn rate, a key health indicator of SaaS platforms, is a strong positive indicator of future growth.*\n\n*E2Open is one of the largest software firms focused on the supply chain sector with the following actual and expected revenue and is PROFITABLE:*\n\n*2019A- 205M*\n\n*2020A- 305M*\n\n*2021E- 335M*\n\n*2022E- 367M*\n\n*Current institutional investors PRE-MERGER include Goldman Sachs, Blackstone Group, and many big filing claims coming including this recent submission:* [*https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm*](https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm)\n\nNow for the juicy bit my friends:\n\nThe SHORT SQUEEZE.\n\nThe most perplexing thing I came across while researching $ETWO was the insanely high amount of Short Interest. Here is a shot from finviz on 4/26/2021 (The day I’m writing this):\n\n[https://imgur.com/9A7W7EC](https://imgur.com/9A7W7EC)\n\nThe % of the float short is a whopping 48%! In contrast, $MVIS’s % of float shorted is a little over 19%, $CLOV is at 35% and $GME is around 20%. Stock grid has a good visual representation of $ETWO’s short %:\n\n[https://www.stockgrid.io/shortinterest/etwo](https://www.stockgrid.io/shortinterest/e2)\n\nYou will also notice, on both finviz and stockgrid, the short ratio. For you fellow apes out there who can barely read, The short ratio tells investors approximately how many days it would take short sellers to cover their positions if the price of a given stock were to increase. The higher the short ratio, the longer it will take to buy back those borrowed shares. The Short ratio for $ETWO is a whopping 7 days! In contrast, $GME’s is at 0.23 days, $MVIS is 3.4 days, and $CLOV is 4.2 days. This means it will take a full week (more than that, considering trading weeks are only 5 days) for the shorts to cover their asses. A sharp uptick in price will have them bending over in no time.\n\nAnother key indicator that convinces me that this stock is going to the moon is one of [u/DeepFuckingValue](https://www.reddit.com/u/DeepFuckingValue/) ‘s favorites: Insider Buying. The following chart shows the latest insider buyer action:\n\n[https://imgur.com/TTs5qqZ](https://imgur.com/TTs5qqZ)\n\nYou can see that insiders are buying the shit out of this stock, and not selling. It’s always a great confirmation bias when the company insiders like the stock.\n\nTL;DR:\n\n$ETWO is an upcoming Supply Chain Software company with 48% of it’s float shorted. It’s fundamentals are sound, it’s potential is huge, and it’s currently heavily undervalued. It’s\n\nbeing backed by Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.\n\nSome of it’s notable customers are: MD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.\n\nThe % of the float shortest is a whopping 48%! It’s short ratio is 7 (It will take shorts 7 days to cover their positions if the stock ticks up).\n\nEven shorter TL;DR:\n\nI like the stock. It’s undervalued. It’s about to go on a short squeeze ride to the moon, and even the big wigs over at JP Morgan are saying this thing is a steal. Oh, and it’s clients are of the likes of FB, Google, Intel, MSFT, NVDA, NKE, etc (Look at the above list for more).\n\n$ETWO Positions:\n\n12/17/21 12.5c,\n\n12/17/21 15c,\n\n12/1721 17.5c",
        "subreddit": "wallstreetbets",
        "title": "$ETWO DD : Unjustly shorted (48% of float), deep value company",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0kz94/etwo_dd_unjustly_shorted_48_of_float_deep_value/",
        "created": 1619662174.0
    },
    {
        "author": "MistrSkywalker",
        "created_utc": 1619804712,
        "id": "n1z7nv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So let me preface this with I am super Newb.\n\nI have been reading more and more about things like Filecoin and Chia and such, Where the mining is based on \"proof of storage\" as opposed to existing methods using video cards and asics. I am wondering will this become a bigger thing as some items become less profitable to mine? \n\n If this does become a larger concept, Will you see stocks of storage manufacturers like WD and Seagate and such become the new NVidia? Will Hard drives become the rare commodity that's difficult to obtain?\n\nAgain I am super newb in all this stuff, so if I have missed or misunderstood some fundamental concept I apologize.",
        "subreddit": "wallstreetbets",
        "title": "Will Drive storage stock be increasing with Storage based cryptos?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n1z7nv/will_drive_storage_stock_be_increasing_with/",
        "created": 1619833512.0
    },
    {
        "author": "tradeforprofit012",
        "created_utc": 1617263172,
        "id": "mhqayo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Xtrades Option Guru coming in with a nice day trade on STX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhqayo/xtrades_option_guru_coming_in_with_a_nice_day/",
        "created": 1617291972.0
    },
    {
        "author": "SnooMacarons1548",
        "created_utc": 1619619238,
        "id": "n0fqaj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Alright lads, this gem of a company is what you would get if $PLTR and $GME had a baby (they may have..).\n\nBefore I go into the long ass DD, I’ll provide a quick TL;DR for all the fellow apes out there, so just scroll to the bottom! \n\nThe case for $ETWO:\n\nE2Open, or $ETWO, provides cloud-based, on-demand software for supply chains for everything from computers, electronics systems and, well, essentially any company wanting to have an edge on it’s competitors . And let’s be serious, data is the modern day oil. Here is their Investment Thesis:\n\nhttps://imgur.com/M95UL86\n\nAnd seeing how my only claim to success is a massive GME yolo back in November, I’ll let someone with better credentials describe this company. Goldman Sachs analyst Chris Merwin initiated coverage on $ETWO and gave it a BUY rating (note: Loop Capital also just recently upgraded it to BUY). He had this to say about it: \n\n\"E2Open is a provider of supply chain management (SCM) solutions to the enterprise. While the SCM space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn of expansion\n\nopportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"\n\nAnother notable thing worth mentioning is that the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba. In other words, $ETWO had some goliaths backing them from the start.\n\nu/DragonfruitAccurate3 had a solid DD on $ETWO not long ago. Instead of trying to put it in my own words, I’ll just use his, as his DD is flawless IMO:\n\n*Why E2Open is likely undervalued*\n\n*Insight Partners, the private equity firm that owns E2Open has a ridiculously strong history of taking midsized SaaS companies like E2Open from valuations of hundreds of millions to multi billion dollar valuations. Other companies in Insight Partner's portfolio include:*\n\n*- Qualtrics (invested at $850mm valuation, sold in 2018 for $8bn and 9.4x+ return)*\n\n*- Shopify (invested in 2013, IPOed at $17/share in 2015 and is now $1,225/share for a likely 100x+ return)*\n\n*- DocuSign (invested in 2017 they IPOed in 2018 at $29/share in 2018 and is now $244.93/share)*\n\n*- Twitter (invested in 2009, it was valued at $100mm in 2008 and now has a $43bn market cap)*\n\n*- Diligent (bought in 2016 for $624mm and currently valued at $4bn for a 6.4x return)*\n\n*- Chegg (invested in 2009, IPOed in 2013 at $12.50/share, currently at $92/share)*\n\n*- Alteryx (invested in 2014, IPOed in 2017 at $14/share, currently at $129/share)*\n\n*- E2Open (bought in 2015 for $273mm, current enterprise valuation is around $2.57bn for a 9.4x return)*\n\n*The top 2 managing directors of Insight Partners: Adam Berger and Deven Parekh both sit on the E2Open board. They're known as active investors heavily involved in the strategic direction and acquisition strategy of E2Open. Deven Parekh was the lead for the early Twitter investment in 2009 that saw a return north of 40,000%. The guy is nothing short of a visionary.*\n\n*The most similar company to E2Open in Insight Partner's portfolio is Diligent. They're both SaaS platforms with long sales cycles, and have almost identical revenue ($340mm for Diligent vs $335mm for E2Open), and a similar product strategy of rapid acquisition and integration. Despite the similarities, Diligent is valued substantially more ($4+bn for Diligent, while only $2.73bn for E2Open), leading one to believe that E2Open is currently undervalued.*\n\n*Further evidence of E2Open's undervaluation is in its enterprise value relative to EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). E2Open's value is only 21.3x EBITDA, which is on par with the average software EBITDA of 20-24x, while its closest peers Descartes is at 29.2x and Kinaxis is at a whopping 59.1x. Significant upside remains in E2Open's future growth.*\n\n*E2Open’s approach to acquiring industry leaders has enabled them to acquire a stable of tech clients such as AMD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform.*\n\n*E2Open customers include:*\n\n[*https://imgur.com/RG6rryD*](https://imgur.com/RG6rryD)\n\n*E2Open's strategic acquisitions of the past 7 years (at least 11 companies) allows end-to-end supply chain data visibility, the holy grail for tech and consumer goods companies. This allows them to compete in the big leagues against incumbents such as SAP and Oracle while leaving single use-case disruptors in the dust.*\n\n*E2Open has yet to fully realize its data integration potential involving artificial intelligence (AI), machine learning (ML) and ESG/sustainability. E2Open has plenty of avenues to pursue multipliers in shareholder value. It wouldn't surprise me that E2Open were to acquire an AI/ML supply chain company in the following quarters to boost shareholder value.*\n\n*If E2Open successfully executes their strategy of fully integrated end-to-end supply chain visibility, it's possible that they'd be acquired by SAP, Oracle, Amazon, Shopify or even Salesforce in the coming years at multiples of their current valuation. The potential value and unique competitive advantage of the data and tech E2Open offers is far too valuable for these companies to ignore.*\n\n*Product stickiness is a key differentiator for E2Open. It boasts of gross retention rates above 95%. The exceedingly low churn rate, a key health indicator of SaaS platforms, is a strong positive indicator of future growth.*\n\n*E2Open is one of the largest software firms focused on the supply chain sector with the following actual and expected revenue and is PROFITABLE:*\n\n*2019A- 205M*\n\n*2020A- 305M*\n\n*2021E- 335M*\n\n*2022E- 367M*\n\n*Current institutional investors PRE-MERGER include Goldman Sachs, Blackstone Group, and many big filing claims coming including this recent submission: https://www.sec.gov/Archives/edgar/data/1581655/000089914021000056/c011321a.htm*\n\nNow for the juicy bit my friends:\n\nThe SHORT SQUEEZE.\n\nThe most perplexing thing I came across while researching $ETWO was the insanely high amount of Short Interest. Here is a shot from finviz on 4/26/2021 (The day I’m writing this):\n\n[https://imgur.com/9A7W7EC](https://imgur.com/9A7W7EC)\n\nThe % of the float short is a whopping 48%! In contrast, $MVIS’s % of float shorted is a little over 19%, $CLOV is at 35% and $GME is around 20%. Stock grid has a good visual representation of $ETWO’s short %: [https://www.stockgrid.io/shortinterest/](https://www.stockgrid.io/shortinterest/e2)etwo\n\nYou will also notice, on both finviz and stockgrid, the short ratio. For you fellow apes out there who can barely read, The short ratio tells investors approximately how many days it would take short sellers to cover their positions if the price of a given stock were to increase. The higher the short ratio, the longer it will take to buy back those borrowed shares. The Short ratio for $ETWO is a whopping 7 days! In contrast, $GME’s is at 0.23 days, $MVIS is 3.4 days, and $CLOV is 4.2 days. This means it will take a full week (more than that, considering trading weeks are only 5 days) for the shorts to cover their asses. A sharp uptick in price will have them bending over in no time. \n\nAnother key indicator that convinces me that this stock is going to the moon is one of u/DeepFuckingValue ‘s favorites: Insider Buying. The following chart shows the latest insider buyer action: \n\n[https://imgur.com/TTs5qqZ](https://imgur.com/TTs5qqZ)\n\nYou can see that insiders are buying the shit out of this stock, and not selling. It’s always a great confirmation bias when the company insiders like the stock. \n\nTL;DR:\n\n$ETWO is an upcoming Supply Chain Software company with 48% of it’s float shorted. It’s fundamentals are sound, it’s potential is huge, and it’s currently heavily undervalued. It’s \n\nbeing backed by Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba. \n\nSome of it’s notable customers are: MD, Facebook, Google, Intel, Microsoft, Nvidia, as well as top industrial, consumer and transportation clients such as Honda, GE, Raytheon, Gap, Nike, New Balance, CocaCola, Peloton, Tapestry (Coach), DHL, UPS, and many others. They have over 1,000+ customers and the top 100 clients have yearly subscriptions with E2Open that top $1.5mm+ in revenue each, which is substantial for any SaaS platform. \n\nThe % of the float shortest is a whopping 48%!  It’s short ratio is 7 (It will take shorts 7 days to cover their positions if the stock ticks up).\n\nEven shorter TL;DR:\n\nI like the stock. It’s undervalued. It’s about to go on a short squeeze ride to the moon, and even the big wigs over at JP Morgan are saying this thing is a steal. Oh, and it’s clients are of the likes of FB, Google, Intel, MSFT, NVDA, NKE, etc (Look at the above list for more). \n\n$ETWO Positions: \n\n12/17/21 12.5c, \n\n12/17/21 15c, \n\n12/1721 17.5c",
        "subreddit": "wallstreetbets",
        "title": "THE $ETWO SHORTSQUEEZE - Insanely undervalued/High quality company /w a massive 48% of it’s float shorted!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0fqaj/the_etwo_shortsqueeze_insanely_undervaluedhigh/",
        "created": 1619648038.0
    },
    {
        "author": "YahyaJ",
        "created_utc": 1618769365,
        "id": "mti1lc",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "&gt;It's not my intention to manipulate the market.  \n&gt;  \n&gt;Disclaimer I do not provide personal investment advice and I am not a qualified licensed investment advisor. I am an amateur investor. I will not and cannot be held liable for any actions you take as a result of anything you read here.  \n&gt;  \n&gt;Conduct your own due diligence, or consult a licensed financial advisor or broker before making any and all investment decisions.  \n&gt;  \n&gt;Got it? Now to the post.\n\n&amp;#x200B;\n\nDD PILLS is a new series, I will regularly try to post multiple stocks that I find interesting in one post. It takes me hours to prepare this kind of material, I hope you enjoy it! And for updates you can follow me!\n\nPlease note that what I think about a company now could change tomorrow depending on multiple factors, I can't make a post every time I find something about a stock I've talked about before in a DD, that's why I created a FREE discord server where as a community we talk about stocks and find new interesting ones, check my profile for the link.\n\n**The stocks are sorted alphabetically and not in order of importance.**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6avnj7rd2zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=9751cd1a65d8d9ecf0d16f7f67944d78dbc69cc4\n\nIf you $BLNK you might miss the first one!  \nBlink is a technical play in my opinion, the short loan rate is high (50.92%) and the short interest is one of the highest, the stock is following an upward channel and is right now at the lower end, looks good for an entry on Monday.\\*\\*My plan:\\*\\*I will watch the movement on the pre market and look for confirmation that it is going up in the early trading hours of the market, wait for a pullback and add a position later in the afternoon or the next day.\n\nhttps://preview.redd.it/9i493sgb2zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=90a33f86390129a59a0abd0f16aa790156fba878\n\n**Quick Overview**  \nBlink Charging Co is an owner, operator, and provider of electric vehicle (EV) charging services. The company offers both residential and commercial EV charging equipment, enabling EV drivers to easily recharge at various location types. Its principal line of products and services are the Blink EV charging network (the Blink Network) and EV charging equipment (also known as electric vehicle supply equipment), and EV-related services.\n\n&amp;#x200B;\n\n**New investors**  \nMajor holders that have opened new positions in BLNK / Blink Charging Co include State Street Corp, KOMP - SPDR S&amp;P Kensho New Economies Composite ETF, Group One Trading, L.p., Group One Trading, L.p., FKASX - Federated Kaufmann Small Cap Fund Class A Shares, No Street GP LP, KAUAX - Federated Kaufmann Fund Class A Shares, IMC-Chicago, LLC, IMC-Chicago, LLC, XRT - SPDR(R) S&amp;P(R) Retail ETF, Hrt Financial Lp, Antara Capital LP, ALPS ETF Trust - ALPS Clean Energy ETF, PEAK6 Investments LLC, HAIL - SPDR S&amp;P Kensho Smart Mobility ETF, Independent Advisor Alliance, Warberg Asset Management LLC, North Fourth Asset Management, LP, HSGFX - Hussman Strategic Growth Fund, and Schonfeld Strategic Advisors LLC.\n\nhttps://preview.redd.it/ggogxpja2zt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=9dcf5bf1d8423280a823a03641ca1df94907fecc\n\n**The dd pill**  \nI would define Blink Charging as a hybrid stock, it is an EV stock but at the same time a renewable energy stock. In fact it usually follows trends in both sectors and can benefit from both. Blink Charging is one of the leaders in its industry and it looks like it will be investing outside the U.S. Last week the company announced that it had installed 42 new chargers in New York and the stock price jumped 13%. Optimism about Biden's plan to build a national EV charging system may push this stock even higher. But long term investors will need to watch out for any significant corrections. Right now, BLNK’s valuation seems overstretched with a price/sales ratio of roughly 289x.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l7io0zm62zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=7a7d996d8a603826c2fb1a999b29ab22b8b30900\n\n**The second one on today's list is $ESGC**  \nI already made a DD about this company before, i sold for a profit when it started rising on a NFT rumour concerned about a fall when i noticed no official news was coming. Looking at the chart I think this week we may see a lot going on, in my opinion we’ll either see a continuation of the uptrend that we’ve seen on Friday or a further fall to the $1.36 area before a big bounce that could send this stock flying.\\*\\*My plan:\\*\\*Look what the movement will be on monday, volume will be the key on this one. If i see it going to $1.65 then i’ll wait for a small pull back to get a position. If it goes over $1.85 after I have a position at $1.6 or lower I'll start putting stop losses 11 cents below every X.X5 it reaches. If instead ESGC goes red on Monday i’ll wait for consolidation in the $1.3/1.4 area and get my position waiting for a reversal.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\nhttps://preview.redd.it/aals33b92zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=81139c1a02d2c81e97f08c43b4d411c03228615b\n\n**Quick Overview**  \nEros STX Global Corporation produces, markets, and distributes content to audiences around the world across traditional and digital media platforms. The company produces and distributes films, scripted and unscripted TV programming, and digital content across a variety of platforms. It also offers Eros Now, a subscription based OTT platform. Eros STX Global Corporation is headquartered in Burbank, California.\n\n**New investors**  \nMajor holders that have opened new positions in ESGC / Eros Stx Global Corp include Palladium Partners Llc, RIFBX - U.S. Small Cap Equity Fund, SSTIX - State Street Total Return V.I.S. Fund Class 1 Shares, Cruiser Capital Advisors, Llc, Hollencrest Capital Management, VFMO - Vanguard U.S. Momentum Factor ETF ETF Shares, Jump Financial, LLC, Truist Financial Corp, Quadrant Capital Group Llc, Regent Peak Wealth Advisors LLC, and DFAU - Dimensional US Core Equity Market ETF.\n\nhttps://preview.redd.it/3qps0ph52zt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=a4001b51a45748c25eae3e286b057b89e196c169\n\n**The dd pill**  \nBasically Eros STX is a movie producer and distributor that is trying to enter the streaming services market, only in India it has more users than Netflix has worldwide. It also has deals with Amazon and HBO to distribute its movies and content. This company is trying to show the world that it is very undervalued, the low short interest and high institutional ownership shows that institutions really believe in the success of the company.\n\n**Keep it on your watchlist, any good news could send it flying.**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rdbyrgw42zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=e0da8a3f5a22dcc924c29b5cac5004d9a5d77c5c\n\n**And here comes the third one: JAGX!**  \nThis will be a pure short swing trade for me if what I hope happens, on Friday a news about an offering dropped the stock 7.8%!!! It bounced off the low of the down channel it's in, I'll keep an eye on it this week. All it needs is volume or positive news and this could be back to $1.80/2.00 in no time!\n\nMy plan:  \nThere are many bagholders on this stock, this week there is no expected news from the company and investors' eyes are not on this type of stock. The next few days will be like a test for this stock, will it hold its value like it did before the latest news? Will it find support or will it rebound because there are still people who believe a lot in this stock? Or, as it has done many times before, will the company release good news and we will see a sudden rise? My plan is to see how it performs Monday afternoon and look for a clue that someone is loading up on this stock.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\nhttps://preview.redd.it/vnl4l9v32zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=c51ea44f8bda0d7547b34b50cea0656ddb1a7c5f\n\n**Quick Overview**  \nJaguar Health Inc is a commercial-stage pharmaceuticals company focused on developing novel, sustainably derived gastrointestinal products. The company's wholly-owned subsidiary, Napo Pharmaceuticals, Inc focuses on developing and commercializing proprietary human gastrointestinal pharmaceuticals for the marketplace from plants used traditionally in rainforest areas. It operates into two business segments namely Human health and animal health. Its Mytesi (crofelemer) product is approved by the U.S. FDA for the symptomatic relief of noninfectious diarrhea in adults with HIV/AIDS on antiretroviral therapy.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\nhttps://preview.redd.it/ns5yy4132zt61.png?width=1167&amp;format=png&amp;auto=webp&amp;s=54c1d3da39bba521c7c6ac148c23179854192eaa\n\n**The dd pill**  \nI find JAGX very interesting, many pennystocks get sudden increases in value because they are trending on social media, this one is somewhat different. There are many DDs about it on reddit yet it doesn't have a big following. JAGX's main product is Mystesi (FDA approved) and is used as an anti-diarrheal in adult HIV/AIDS patients who are on antiretroviral therapy. The company has a wholly owned European subsidiary called Napo Pharmaceuticals that specifically develops and markets treatments based on rainforest plants. This company is very interesting because Jaguar Health through Napo EU is doing research to see if Mystesi could be used to treat patients with long-term symptoms from Covid-19. In the U.S., Jaguar Health hopes to receive regulatory approval to market Mytesi as an anti-diarrheal for cancer therapy-induced diarrhea.\n\n**Something big could come from this in the coming weeks.**\n\nhttps://preview.redd.it/miv1c6d22zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=c3a87ea8a57954c551c14a0e1f61a23831058830\n\n**And the last one is a sympathy of GME!**\n\nThis is very interesting, over the past few weeks it has been reported many times that KOSS had a very high and unusual short borrow fee, on Thursday a 104% short borrow fee was reported. After the market closed on Friday it was reported that no shares were available to short. This is a candidate for the short squeeze.\n\nMy plan:  \nSocial media, social media, social media! This has a very high potential to become popular among trader groups. If unusual volume starts coming in, it could easily trap shorts and trigger a squeeze, if I see unusual volume and social media talking a lot about it, I will jump on the rocket. This is a risky stock play, without volume or interest it could collapse and go back to pennyland.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\nhttps://preview.redd.it/k4aw6pv12zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=3650ebaaa789f0cad09ae96ca11331f49cab1385\n\n**Quick Overview**  \nKoss Corp is a engaged in the design, manufacture, and sale of stereo headphones and related accessory products. It operates in the audio/video industry segment of the home entertainment industry. The company markets a line of headphones, wireless Bluetooth headphones, wireless Bluetooth speakers, computer headsets, telecommunications headsets, active noise-canceling headphones. Majority of the firm's revenue is derived from sales of stereo headphones.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\nhttps://preview.redd.it/1elo6ix02zt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=6b3fcf436a1ae845a96d21d61b2e3a019ff6494d\n\n**The dd pill**  \nKoss was founded in 1958, they are the inventors of stereos. For a while it was a leader in its industry but when competition came in and the company failed to diversify Koss had to file for bankruptcy in 1984. The following year it was back in business but its stock always failed to gain traction until this year when it went from less than a dollar to $127.45 in January. Koss right now is very competitive in the marketplace, its wireless headphones are popular on Amazon but its competitors are much bigger like Sony and Apple.\n\nhttps://preview.redd.it/zj33xbey1zt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=c9697b42a69b5965afcfd2205f03d18b8ee22dcb\n\n**Keep weed stocks on your radar this week!**\n\nhttps://preview.redd.it/mg8xidzx1zt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=fa2b0e19f346abc73667806f590259f0b23766bc\n\nSNDL and TLRY follow the same trend",
        "subreddit": "smallstreetbets",
        "title": "DD Pills With Simple Technical Analysis - Next Week Potential Market Movers - $BLNK $ESGC $JAGX $KOSS $APHA $SNDL $TLRY",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/mti1lc/dd_pills_with_simple_technical_analysis_next_week/",
        "created": 1618798165.0
    },
    {
        "author": "YahyaJ",
        "created_utc": 1618766136,
        "id": "mtgzvc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&gt;It's not my intention to manipulate the market.  \n&gt;  \n&gt;Disclaimer I do not provide personal investment advice and I am not a qualified licensed investment advisor. I am an amateur investor. I will not and cannot be held liable for any actions you take as a result of anything you read here.  \n&gt;  \n&gt;Conduct your own due diligence, or consult a licensed financial advisor or broker before making any and all investment decisions.   \n&gt;  \n&gt;Got it? Now to the post.\n\n&amp;#x200B;\n\n[DD PILLS](https://preview.redd.it/72fdnyfkpyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=dbd0d2fb2fb04a674987c370dabe5d7530cf23f2)\n\nDD PILLS is a new series, I will regularly try to post multiple stocks that I find interesting in one post. It takes me hours to prepare this kind of material, I hope you enjoy it! And for updates you can follow me!\n\nPlease note that what I think about a company now could change tomorrow depending on multiple factors, I can't make a post every time I find something about a stock I've talked about before in a DD, that's why I created a FREE discord server where as a community we talk about stocks and find new interesting ones, check my profile for the link.\n\n**The stocks are sorted alphabetically and not in order of importance.**\n\n&amp;#x200B;\n\n[BLNK RECAP](https://preview.redd.it/kr662f3spyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=3ac063bfcaf78839640c2b3d1b38e884346ca444)\n\n**If you $BLNK you might miss the first one!**  \nBlink is a technical play in my opinion, the short loan rate is high (50.92%) and the short interest is one of the highest, the stock is following an upward channel and is right now at the lower end, looks good for an entry on Monday.  \n**My plan:**  \nI will watch the movement on the pre market and look for confirmation that it is going up in the early trading hours of the market, wait for a pullback and add a position later in the afternoon or the next day.\n\n[BLNK CHART](https://preview.redd.it/q2t3db0xpyt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=545cb6f81979719cc808c12abec13ead047f9311)\n\n**Quick Overview**  \nBlink Charging Co is an owner, operator, and provider of electric vehicle (EV) charging services. The company offers both residential and commercial EV charging equipment, enabling EV drivers to easily recharge at various location types. Its principal line of products and services are the Blink EV charging network (the Blink Network) and EV charging equipment (also known as electric vehicle supply equipment), and EV-related services.\n\n&amp;#x200B;\n\n**New investors**  \nMajor holders that have opened new positions in BLNK / Blink Charging Co include State Street Corp, KOMP - SPDR S&amp;P Kensho New Economies Composite ETF, Group One Trading, L.p., Group One Trading, L.p., FKASX - Federated Kaufmann Small Cap Fund Class A Shares, No Street GP LP, KAUAX - Federated Kaufmann Fund Class A Shares, IMC-Chicago, LLC, IMC-Chicago, LLC, XRT - SPDR(R) S&amp;P(R) Retail ETF, Hrt Financial Lp, Antara Capital LP, ALPS ETF Trust - ALPS Clean Energy ETF, PEAK6 Investments LLC, HAIL - SPDR S&amp;P Kensho Smart Mobility ETF, Independent Advisor Alliance, Warberg Asset Management LLC, North Fourth Asset Management, LP, HSGFX - Hussman Strategic Growth Fund, and Schonfeld Strategic Advisors LLC.\n\n[BLNK INVESTORS](https://preview.redd.it/i9qoz7c0qyt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=752bd6ce679c42798ba278f5af481e5e1e231f31)\n\n**The dd pill**  \nI would define Blink Charging as a hybrid stock, it is an EV stock but at the same time a renewable energy stock. In fact it usually follows trends in both sectors and can benefit from both. Blink Charging is one of the leaders in its industry and it looks like it will be investing outside the U.S. Last week the company announced that it had installed 42 new chargers in New York and the stock price jumped 13%. Optimism about Biden's plan to build a national EV charging system may push this stock even higher. But long term investors will need to watch out for any significant corrections. Right now, BLNK’s valuation seems overstretched with a price/sales ratio of roughly 289x.\n\n&amp;#x200B;\n\n[ESGC RECAP](https://preview.redd.it/laodwewbqyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=97ec601d9b4beeacb34e94d0493b7800483d1ae3)\n\n**The second one on today's list is $ESGC**  \nI already made a DD about this company before, i sold for a profit when it started rising on a NFT rumour concerned about a fall when i noticed no official news was coming. Looking at the chart I think this week we may see a lot going on, in my opinion we’ll either see a continuation of the uptrend that we’ve seen on Friday or a further fall to the $1.36 area before a big bounce that could send this stock flying.  \n**My plan:**  \nLook what the movement will be on monday, volume will be the key on this one. If i see it going to $1.65 then i’ll wait for a small pull back to get a position. If it goes over $1.85 after I have a position at $1.6 or lower I'll start putting stop losses 11 cents below every X.X5 it reaches. If instead ESGC goes red on Monday i’ll wait for consolidation in the $1.3/1.4 area and get my position waiting for a reversal.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\n[ESGC CHART](https://preview.redd.it/tqhw3p1oqyt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=bd3a2dfb08bdc8abd4b556af1be08a8d1f60078d)\n\n**Quick Overview**  \nEros STX Global Corporation produces, markets, and distributes content to audiences around the world across traditional and digital media platforms. The company produces and distributes films, scripted and unscripted TV programming, and digital content across a variety of platforms. It also offers Eros Now, a subscription based OTT platform. Eros STX Global Corporation is headquartered in Burbank, California.\n\n**New investors**  \nMajor holders that have opened new positions in ESGC / Eros Stx Global Corp include Palladium Partners Llc, RIFBX - U.S. Small Cap Equity Fund, SSTIX - State Street Total Return V.I.S. Fund Class 1 Shares, Cruiser Capital Advisors, Llc, Hollencrest Capital Management, VFMO - Vanguard U.S. Momentum Factor ETF ETF Shares, Jump Financial, LLC, Truist Financial Corp, Quadrant Capital Group Llc, Regent Peak Wealth Advisors LLC, and DFAU - Dimensional US Core Equity Market ETF.\n\n[ESGC INVESTORS](https://preview.redd.it/7spsofevqyt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=32758af747a90023b919773f879c9ce24562f8c8)\n\n**The dd pill**  \nBasically Eros STX is a movie producer and distributor that is trying to enter the streaming services market, only in India it has more users than Netflix has worldwide. It also has deals with Amazon and HBO to distribute its movies and content. This company is trying to show the world that it is very undervalued, the low short interest and high institutional ownership shows that institutions really believe in the success of the company. \n\n**Keep it on your watchlist, any good news could send it flying.**\n\n&amp;#x200B;\n\n[JAGX RECAP](https://preview.redd.it/qv0nvl0dryt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=ec11f47847765bddfdae5859db2b97a6b154d8b5)\n\n**And here comes the third one: JAGX!**  \nThis will be a pure short swing trade for me if what I hope happens, on Friday a news about an offering dropped the stock 7.8%!!! It bounced off the low of the down channel it's in, I'll keep an eye on it this week. All it needs is volume or positive news and this could be back to $1.80/2.00 in no time!\n\n**My plan:**  \nThere are many bagholders on this stock, this week there is no expected news from the company and investors' eyes are not on this type of stock. The next few days will be like a test for this stock, will it hold its value like it did before the latest news? Will it find support or will it rebound because there are still people who believe a lot in this stock? Or, as it has done many times before, will the company release good news and we will see a sudden rise? My plan is to see how it performs Monday afternoon and look for a clue that someone is loading up on this stock.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\n[JAGX CHART](https://preview.redd.it/z5dlk2nhryt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=ed2f45103cc56ad9cbfc219ea7ca141f83e435ec)\n\n**Quick Overview**  \nJaguar Health Inc is a commercial-stage pharmaceuticals company focused on developing novel, sustainably derived gastrointestinal products. The company's wholly-owned subsidiary, Napo Pharmaceuticals, Inc focuses on developing and commercializing proprietary human gastrointestinal pharmaceuticals for the marketplace from plants used traditionally in rainforest areas. It operates into two business segments namely Human health and animal health. Its Mytesi (crofelemer) product is approved by the U.S. FDA for the symptomatic relief of noninfectious diarrhea in adults with HIV/AIDS on antiretroviral therapy.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\n[JAGX INVESTORS](https://preview.redd.it/cvcm1rvvryt61.png?width=1167&amp;format=png&amp;auto=webp&amp;s=d02d1c7993c46be17b7131cdf25d346724641d66)\n\n**The dd pill**  \nI find JAGX very interesting, many pennystocks get sudden increases in value because they are trending on social media, this one is somewhat different. There are many DDs about it on reddit yet it doesn't have a big following. JAGX's main product is Mystesi (FDA approved) and is used as an anti-diarrheal in adult HIV/AIDS patients who are on antiretroviral therapy. The company has a wholly owned European subsidiary called Napo Pharmaceuticals that specifically develops and markets treatments based on rainforest plants. This company is very interesting because Jaguar Health through Napo EU is doing research to see if Mystesi could be used to treat patients with long-term symptoms from Covid-19. In the U.S., Jaguar Health hopes to receive regulatory approval to market Mytesi as an anti-diarrheal for cancer therapy-induced diarrhea.\n\n**Something big could come from this in the coming weeks.**\n\n[KOSS](https://preview.redd.it/ygsgsrx0syt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=fbb57ea125f8492a14b0ce9874af42737e3ea5ff)\n\n**And the last one is a sympathy of GME!**  \nThis is very interesting, over the past few weeks it has been reported many times that KOSS had a very high and unusual short borrow fee, on Thursday a 104% short borrow fee was reported. After the market closed on Friday it was reported that no shares were available to short. This is a candidate for the short squeeze.\n\n**My plan:**  \nSocial media, social media, social media! This has a very high potential to become popular among trader groups. If unusual volume starts coming in, it could easily trap shorts and trigger a squeeze, if I see unusual volume and social media talking a lot about it, I will jump on the rocket. This is a risky stock play, without volume or interest it could collapse and go back to pennyland.\n\n**I’ll keep updating my thoughts and positions on discord as always.**\n\n[KOSS CHART](https://preview.redd.it/k19v83gcsyt61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=42b86ddd1a88939d9c7da273e9e1862f13ad3895)\n\n**Quick Overview**  \nKoss Corp is a engaged in the design, manufacture, and sale of stereo headphones and related accessory products. It operates in the audio/video industry segment of the home entertainment industry. The company markets a line of headphones, wireless Bluetooth headphones, wireless Bluetooth speakers, computer headsets, telecommunications headsets, active noise-canceling headphones. Majority of the firm's revenue is derived from sales of stereo headphones.\n\n**New investors**  \nMajor holders that have opened new positions in JAGX / Jaguar Animal Health, Inc. include Sassicaia Capital Advisers Llc, Claro Advisors LLC, Baxter Bros Inc, Hrt Financial Lp, Millennium Management Llc, Global Retirement Partners, LLC, Winch Advisory Services, LLC, Johnson Midwest Financial, LLC, International Assets Investment Management, Llc, and Jpmorgan Chase &amp; Co.\n\n[KOSS INVESTORS](https://preview.redd.it/egu5drrgsyt61.png?width=1163&amp;format=png&amp;auto=webp&amp;s=ed66a4e430b25198d626cfa391421307f7e71433)\n\n**The dd pill**  \nKoss was founded in 1958, they are the inventors of stereos. For a while it was a leader in its industry but when competition came in and the company failed to diversify Koss had to file for bankruptcy in 1984. The following year it was back in business but its stock always failed to gain traction until this year when it went from less than a dollar to $127.45 in January. Koss right now is very competitive in the marketplace, its wireless headphones are popular on Amazon but its competitors are much bigger like Sony and Apple.\n\n**Keep weed stocks on your radar this week!**\n\n[WEED STOCKS!](https://preview.redd.it/xe53dqcmsyt61.png?width=1584&amp;format=png&amp;auto=webp&amp;s=5f0420fb8cdc9b548a5702d2b402ec5b07f34613)",
        "subreddit": "Wallstreetbetsnew",
        "title": "DD Pills - Next Week Potential Market Movers - $BLNK $ESGC $JAGX $KOSS $APHA $SNDL $TLRY",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mtgzvc/dd_pills_next_week_potential_market_movers_blnk/",
        "created": 1618794936.0
    },
    {
        "author": "Keeninsight111",
        "created_utc": 1617761193,
        "id": "mlrrcl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "When you subscribe to Eros Now (E . S. G. C) for $4.99 through Amazon PRIME, why are all of Eros Now's movies and shows pulled up within the same format and look as all of Amazon PRIME movies and shows? This is very peculiar....Obviously, you can't pull up Netflix content that way, and every time you access Netflix, it has it's own unique format look....Since Eros Now's whole library has been inserted into Amazon Prime's menu format and look, it makes me wonder if Amazon is buying eros/stx",
        "subreddit": "wallstreetbets",
        "title": "is Amazon buying eros stx?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mlrrcl/is_amazon_buying_eros_stx/",
        "created": 1617789993.0
    },
    {
        "author": "Keeninsight111",
        "created_utc": 1617747479,
        "id": "mlnfki",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "When you subscribe to Eros Now (ESGC) for $4.99 through Amazon  PRIME,  why are all of Eros Now's movies and shows pulled up within the same format and look as all of Amazon PRIME movies and shows?  This is very peculiar....Obviously,  you can't pull up Netflix content that way,  and every time you access Netflix,  it has it's own unique format look....Since Eros Now's whole library has been inserted into Amazon Prime's menu format and look,  it makes me wonder if Amazon is buying Eros STX ( ESGC)",
        "subreddit": "wallstreetbets",
        "title": "Amazon buying EROS STX? ESGC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mlnfki/amazon_buying_eros_stx_esgc/",
        "created": 1617776279.0
    },
    {
        "author": "cfenn1",
        "created_utc": 1618948161,
        "id": "muyqel",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’m genuinely surprised that #ESGC continues to sit so low in the market. The films #STX has put out over the last few years have been great, and they are taking their business to a mostly untapped market with huge potential. I have a feeling this stock is going to blow up. I’m glad I’ve been buying while it’s still affordable.",
        "subreddit": "wallstreetbets",
        "title": "Undiscovered stock?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/muyqel/undiscovered_stock/",
        "created": 1618976961.0
    },
    {
        "author": "Itsboomhomie",
        "created_utc": 1618847033,
        "id": "mu3fq4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey gang its **Boom** here, with a continuation of a series of DD posts for companies where I currently hold no position. No position = objective outlook. \n\n ESGC is a production company “delivering star-driven premium content to audiences across platforms worldwide”, [according to their website](https://erosstx.com/about-us/). Headquartered in Burbank, CA, ESGC develops, produces, and distribues Bollywood and Hollywood content. Eros International was an Indian mass media conglomerate and last year merged with STX Entertainment, a US production company, to form what is now ESGC. STX previously had plans to go public in 2018, but called it off citing the China-US Trade war. Then they lost funding, and their co-founder was fired due to his involvement in the college admissions bribery scandal that saw Aunt Becky serve prison time. They merged with Eros, inheriting Eros’ listing on the NYSE, and ESGC was born.\n\nInstitutions seem to like ESGC, owning 33.43% of the company, [via WhaleWisdom](https://whalewisdom.com/stock/eros). Some familiar names in there as far as penny stocks short sellers - Citadel, Susquehanna, CVI, BlackRock. The biggest institutional holder is Hony Capital, a Chinese hedge fund that [claims to be focused on long term value growth](https://www.honycapital.com/dutyinvest_en/index.aspx?nodeid=2057). Compared to last quarter, total puts dropped by almost 55%. These are still Q4 2020 numbers, and I’m interested to see how the Q1 2021 numbers would compare. What I see from institutions seems bullish.\n\nI think market and company conditions that proved to be disastrous for STX while pursuing their IPO has been a boon for Eros. The merger makes a lot of sense - Eros is a bigger player in India, while STX was sort of a Miramax-y mid-level indie that wanted to be publicly traded. For being an independent film company, STX has stuff you’ve probably heard of and/or seen - *Bad Moms, Uglydolls, Hustlers, Greenland*, and my personal favorite *Hardcore Henry*. [They just announced SNL weed-head Pete Davidson](https://deadline.com/2021/04/pete-davidson-i-slept-with-joey-ramone-netflix-stxfilms-1234734894/) for the Joey Ramone biopic that will be on Netflix. Eros Now, a Netflix-like Indian streaming service claims to have 36 million paid subscribers and has been in the region longer than both Netflix and Prime Video. So they have a Hollywood production and distribution arm coupled with an in-house streaming platform. So why is this stock in penny land?\n\nIn 2019, before merging with STX, Eros saw their shares drop over 50% in a single day - June 3, 2019 to be exact. That particular month was not kind to Eros, with shares tumbling from over $7 to below $1.50 on ratings downgrades for ongoing delays/default in debt servicing, [with Moody’s citing cash flow issues in the company](https://www.cnbctv18.com/market/stocks/why-this-media-stock-lost-80-investor-wealth-in-2019-3944881.htm). Eros shot back that their liquidity was fine, and [they were being targeted by short sellers](https://www.businesswire.com/news/home/20190715005402/en/Eros-International-Plc-Reports-Fourth-Quarter-and-Fiscal-Year-End-2019-Results) (sound familiar? Looking at you, SOS). So the stock got battered and there was probably some truth to their financing woes. In steps STX. They merge and capitalize with [$125M of new equity funding and a revamped $350M credit facility led by JP Morgan](https://www.businesswire.com/news/home/20200730005622/en/Eros-International-Plc-and-STX-Entertainment-Complete-Merger-to-Form-Eros-STX-Global-Corporation). With a pandemic slowing film production significantly, ESGC’s revenues declined, with a mild offset from Eros Now’s growing subscriber base. As of Sept 2020, they were holding $384M in total debt with $82M cash on hand, so they need to get their balance sheet in the right direction or they’ll continue to flounder. They are working with JP Morgan [“to optimize all current debt facilities”](https://finance.yahoo.com/news/erosstx-issues-fiscal-2021-interim-211700880.html) to strengthen their balance sheet.\n\nWith countries reopening as Covid abates, I think movie theaters will have an excess demand, and STX generally works with bankable stars. ESGC will need to continue to strengthen their balance sheet, but with a foothold in two of the world’s biggest film industries, I think they do have a bright future. \n\nLove ya\n\n\\- Boom",
        "subreddit": "RobinHoodPennyStocks",
        "title": "*no position DD* ESGC - balance sheet needs movie magic",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mu3fq4/no_position_dd_esgc_balance_sheet_needs_movie/",
        "created": 1618875833.0
    },
    {
        "author": "ZestycloseEast9617",
        "created_utc": 1619380298,
        "id": "myg2c8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Chia is cryptocurrency that uses hard drives instead of CPU. Hard disks are running out. Would it make sense for you to invest in Seagate?",
        "url": "https://i.redd.it/ojwc8vwijdv61.jpg",
        "created": 1619409098.0
    },
    {
        "author": "nord2rocks",
        "created_utc": 1619458403,
        "id": "mz34tw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Computer Storage Companies, Seagate and Western Digital are positioned for short and maybe long term growth",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mz34tw/computer_storage_companies_seagate_and_western/",
        "created": 1619487203.0
    },
    {
        "author": "NZbarnstormer",
        "created_utc": 1619575786,
        "id": "n04hqd",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Eros STX Global Corp (NYSE:ESGC) to the moon!",
        "url": "https://www.reddit.com/r/pennystocks/comments/n04hqd/eros_stx_global_corp_nyseesgc_to_the_moon/",
        "created": 1619604586.0
    },
    {
        "author": "tradeforprofit012",
        "created_utc": 1617263172,
        "id": "mhqayo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Xtrades Option Guru coming in with a nice day trade on STX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhqayo/xtrades_option_guru_coming_in_with_a_nice_day/",
        "created": 1617291972.0
    }
]