[
    {
        "author": "cheaptissueburlap",
        "created_utc": 1638381187,
        "id": "r6knhl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nAll right guys so I'm burlap and I've been working on this Velo3d DD with a buddy of mine since a while now, I'm here to share the results but if you want the whole thing please click [here:](https://www.burlapsgambles.com/velo-3d)\n\nalso to help with the clickbait lmao you can find the source [here](https://seekingalpha.com/news/3675602-tesla-was-interested-in-buying-velo3d-though-company-didnt-want-to-sell).\n\n**Founded in 2015, Velo3d rapidly became a great contender in the additive manufacturing market. Well funded, led by a motivated and ingenious founder, Velo3d is trying to stay in the forefront of a booming industry promising a really interesting and disruptive technology that fits perfectly in the current economic conjunctures. In his short history, Velo3d capabilities has already been recognized by numerous high-profile companies, notably Space X for their new Raptor engines.**\n\n**​**\n\nTechnological moat\n\n* [*In 2019*](https://www.3dprintingmedia.network/top-metal-am-patent-holder-companies/)*,* Velo3d was the top assignee of 3D printing metals [*patents*](https://docs.google.com/document/d/1TG2Qu65m1ukZ0sAQ-MpsnZr-yBqouaFbQpVjdHNi92A/edit#heading=h.q77k08imclkr)*,* this indicate strong targeting of an emerging markets which should theoretically results in bigger market shares as the technology matures.\n* One of Velo3d main selling point is the *SupportFree™ manufacturing process and* *\"i*[*ts unique ability to print low angles and over-hangs down to zero degrees*](https://www.velo3d.com/wp-content/uploads/2021/08/Product-Brief-Sapphire-XC.pdf)*\"* which is allegedly a disruptive process offering unprecedented opportunities.  \n* The new Sapphire XC expand on the previous generation but at scale [*\"This provides users up to 5X productivity improvement and 75% cost reduction per part when compared to the existing Sapphire system\"*](https://www.velo3d.com/wp-content/uploads/2021/08/Product-Brief-Sapphire-XC.pdf)*.*\n\n*​*\n\nRecent developments\n\n***​***\n\n* As of September 2021, the company went public for a total proceed of $275m in cash and $430m in net proceeds.\n* On-going construction of a new facility for the production of over 400 SapphireXC annually.  \n* Company’s repeat purchases by existing customers and expanding customer base, [*with the addition of nine new customers so far in 2021*](https://ca.news.yahoo.com/velo3d-announces-third-quarter-2021-210500275.html), more than doubling the Company’s customer base since year end 2020. ​\n\nNoticeable partnerships​\n\n**SPACE X** \\- [Raptor Engines parts](https://www.velo3d.com/how-to-leave-your-mark-with-supportfree-metal-am/)\n\n[*\"Technology has been critical for the company’s most efficient and challenging engine, which are designed and produced around the capabilities of our manufacturing technology.\"*](https://www.velo3d.com/how-to-leave-your-mark-with-supportfree-metal-am/)\n\n*​*\n\n**Hanwan - Turbomachinery**\n\n*\"Hanwha was able to print its impeller flat to the built plate with no internal supports.\"*\n\n*​*\n\n**SierraTurbines** [- Aurelius mk1 Micro Turbines](https://ntopology.com/blog/2020/08/12/the-aurelius-mk1-turbine-core-and-our-path-to-additive-manufacturing/)\n\n*\"Consolidated 61 parts into one. 40x more efficient, 10x more power density, and 50% lighter in weight.\"*\n\n**Launcher** \\- [Liquid oxygen (LOX) turbopump](https://www.makepartsfast.com/velo3d-and-launcher-continue-to-partner-on-3d-printed-rocket-engine-components/)/ [Propellant tank](https://3dprintingindustry.com/news/launcher-partners-with-velo3d-and-ansys-to-3d-print-e-2-rocket-engine-upgrade-190746/)\n\n*\"VELO3D’s SupportFree technology made creating the part considerably less complex, time-consuming and wasteful than it would otherwise have been.\"*\n\n\\-------------------------------\n\n**Bull thesis**\n\n1. Strong macro economics tailwinds as supply chains are fragilized worldwide, Additive materials/3d printing could fill that gap between oriental parts supplier and occidental manufacturers.\n2. Strong cash position of over 275m as of November 2021, with current cashburn rates the company should be able to sustain themselves for at least the next 4 years. \n3. Offer a very disruptive technology that can be really transformative for numerous industries\n4. For fiscal year 2022, given its significant backlog and increasing demand for its Sapphire® XC solution, the Company remains confident in its ability to achieve its 2022 revenue forecast of $89 million.\n5. Growing portfolio. Recent expansion in European markets, diversified through different industries like aerospace, power generation and advanced manufacturing.\n6. Business model generating recurrent revenues that could generate better margins long-term.\n7. Elon Musk's Space X company was interested in buying Velo3D, though [company didn't want to sell.](https://seekingalpha.com/news/3675602-tesla-was-interested-in-buying-velo3d-though-company-didnt-want-to-sell)\n\n**Bear Thesis**\n\n1. Valuation is a bit rich, future growth seem priced in until at 2025 if you compare market cap to forward earnings and revenues estimates.\n2. Competition could develop a more efficient and performing technology that could price out Velo 3d current IP. \n3. Possible supply chain issues due to high reliance on partnerships for parts, have to consider the current worldwide shortage of semiconductors, chips and battery metals.\n4. [AM metal printing is still a really expensive and ](https://www.additivemanufacturing.media/articles/plotting-a-pathway-to-profitable-am)[slow process compared to more traditional manufacturing methods, per example: 1kg of iconel 718 is estimated at more than 1000$/kg of material without other costs factored in.](https://www.additivemanufacturing.media/articles/plotting-a-pathway-to-profitable-am)\n5. Requires intensive investments especially in testing, per example: [expensive computed tomography scans](https://youtu.be/XTv_myJvB3w?t=1772).\n6. Metal powders are highly dangerous and volatile substances that could become liabilities in the case of incidents and mishandling. Health and safety issues to be considered.\n\n\\-------------------------------\n\n**All right I know a lot of you have the attention span of a fully-padded helmet wearing special kid on their Add\\*rall withdrawal so now I'm sharing pictures of my buddy's work to not overload you** [**here**](https://www.burlapsgambles.com/post/velo3d-parts-overview)  \n\n\n&amp;#x200B;\n\n​I will be sharing more in the current days so If you are interested feel free to follow [my twitter account](https://twitter.com/burlapDD) or join the spacestocks discord, link is available at the bottom of this page:\n\n[https://www.burlapsgambles.com/post/velo3d-parts-overview](https://www.burlapsgambles.com/post/velo3d-parts-overview)\n\nDisclaimer: This is done as an hobby I'm currently holding warrants, this is a risky stock so my position is currently less than 4% of my portfolio.\n\nfor more DD: [https://www.burlapsgambles.com/velo-3d](https://www.burlapsgambles.com/velo-3d)",
        "subreddit": "stocks",
        "title": "Velo3d's DD part 1 - The 3d printing company that refused to be bought by space X because it knows it can aim for more.",
        "url": "https://www.reddit.com/r/stocks/comments/r6knhl/velo3ds_dd_part_1_the_3d_printing_company_that/",
        "created": 1638409987.0
    }
]