[
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272706,
        "id": "lavi6b",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Check out their website first - erosstx dotcom.\n\nEros STX Global Corporation, (“ErosSTX” or “The Company”) (NYSE: ESGC) beginning of Dirty Dishes - looking to further discussion. This is what I found. A lot of it is quotes from websites, can not confirm everything through filings. I have maintained a small position since mid january. I see a small around of risk for a potentially large reward. Not much information is available, this is what I have uncovered:\n\nShort: Streaming Service available on Amazon, Apple TV, Etc. They own rights to 90,000 films right for streaming. Release award winning content. Customers in over fourty countries. Over 37 million paid subs as of November 2020.\n\nYou’ve seen their product. Movies include 21 Bridges, Adrift, Bad Momos, Free state of jones, Hustlers, I Feel Pretty, Mile 22, Hustlers, Molly’s Game, Playmobil, Second Act, The Gift, The Space Between Us, and 90,000 more.\n\nThey are in production for products for Amazon, Netflix, USA, FX, etc.\n\nLargest streaming library in Indian languages. - twice the size of Disney.\n\nWorking with A listers on theatrical level blockbuster films - Kristen Stewart in Diana, Jason Statham in Guy Ritchie thriller.\n\nSongbird moved to Top 3 in Amazon Top Vod. Greenland at #5. Greenland is at #1 in Vudu and Fandango Now. No 8 in Apple Itunes,no 10 at Google Play. Both are doing extraordinary businesses. Give us some updated numbers damn!!!!!!\n\nGreenland is in number 1 position in Vudu's top Paid Video On Demand after 6 weeks also. Total ratings in Vudu crossed 41K.\n\nHigh February call volume indicating a probable move north of $2.50 in the next couple of weeks.\n\nNetflix worth 1000.00 per sub and we are currently at 30.00. EROS charges a fraction of what Neftlix does.\n\nA Major holder completed selling 4.3 million shares per an agreement between Creative Artist Agency and Writers Guild of America - that downward pressure has been removed. … Schedule 13D On January 19, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0582 in multiple transactions at prices ranging from $2.02 to $2.125, inclusive. On January 20, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.027 in multiple transactions at prices ranging from $2.01 to $2.095, inclusive. On January 21, 2021, the TPG Funds sold an aggregate of 850,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0559 in multiple transactions at prices ranging from $2.02 to $2.09, inclusive. On January 22, 2021, the TPG Funds sold an aggregate of 515,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0258 in multiple transactions at prices ranging from $2.00 to $2.08, inclusive. On January 25, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0605 in multiple transactions at prices ranging from $2.04 to $2.12, inclusive. On January 26, 2021, the TPG Funds sold an aggregate of 700,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0573 in multiple transactions at prices ranging from $2.02 to $2.14, inclusive. The Reporting Persons undertake to provide to the Issuer, any security holder of the Issuer, or the staff of the Commission, upon request, full information regarding the number of shares sold at each separate price within the range of each of the sales above that involved multiple transactions.” They now own 70,020,295 shares.\n\n**MOI Global Fund Manager Naveen Jeereddi at Best Ideas 2021 presentation recently Leaked -** Hedge fund manager presentation on opportunity for ErosSTX to go 3-5x higher. Low risk, high reward at current price. Highly manipulated to ride through and add on dips. About leaker (Bax28 Post), 1. Jareeddi has 7M shares with 2/3 of those pre STX merger - we all knew this 2. His listed SP is 2.68 avg 3. Presentation was to potential/current investors in his firm 4. He has an obligation to explain the firms high position in ESGC given it is currently a losing position despite a record bull market 5. He has had Hollywood connections for years - married to B list actress. In leaked video at 30:34 in video Jeereddi estimates $4-6 per share in 12-18 months, $6-8 in 2 years, and $10-15 in 3+ yrs. (Sid1988 post) summary from the Jerradi leak: 1. Management is probably in restricted period to buy more shares as per Bob to Naveen. 2. Still 40mn options as per incentive is going to add or in process to various board members as the part of merger and hence intentional price suppression. 3. 40mn subscribers (probably) by now and targeting 50mn paid subscribers by 2022 end 4. Possible 50-100mn content deal between Apple and Eros (just a hint, speculative) 5. Net debt will be 325mn usd by end of 2021 March. Indian debt will be transferred to US credit facility. 6. STX will release 8 films a year. Total 5 scripted and 6 non scripted series are in production with collaboration with Amazon, Netflix, HBO. At 42:25 Naveen was smiling to say Apple has lot of incentive if they want to acquire Eros and enter to the Indian market... this guy has almost 6% stake on our company and knows everything.\n\nAs previously announced, the Company intends to issue, pending Board approval, an additional 40 million A ordinary shares in management plan equity awards. - Slight increase in outstanding shares expected.\n\nSID1988 Post - Greenland total revenue breakdown: 100mn USD. Worldwide box office: $50-51mn PVOD box office: $13-15mn HBO deal: $25mn Amazon deal: $6-9mn Total: 100mn Budget: $35mn Profit: Over $30mn Blockbuster.\n\nSid1988 post - 40mn shares will be added in form of options packages to the board as incentives. Probably already started. And that will probably be done in money that means they will immediately sell to market. Which is what probably we are seeing the large DP shorting and those block trades. So basically it is in semi-dilution phase (already know infor on the 40mn option package). After that is cleared they will start pumping it out with all the news and investor day.\n\nInvestor day will be sometime in Q1 of 2021\n\nLast Wed, Thur and Fri was the biggest volume days we've seen since merger.\n\nCompany over $250 million revenue, targeting over 1 billion by 2023.\n\nAround 20 percent of this stock is shorted right now.\n\nProfile: Eros STX Global Corporation, (“ErosSTX” or “The Company”) (NYSE: ESGC) is a global entertainment company that acquires, co-produces and distributes films, digital content &amp; music across multiple formats such as theatrical, television and OTT digital media streaming to consumers around the world. Eros International Plc changed its name to Eros STX Global Corporation pursuant to the July 2020 merger with STX Entertainment, merging two international media and entertainment groups. The combination of one of the largest Indian OTT players and premier studio with one of Hollywood’s fastest-growing independent media companies has created an entertainment powerhouse with a presence in over 150 countries. ErosSTX delivers star-driven premium feature film and episodic content across a multitude of platforms at the intersection of the world’s most dynamic and fastest-growing global markets, including US, India, Middle East, Asia and China. The Company also owns the rapidly growing OTT platform Eros Now which has rights to over 12,000 films across Hindi and regional languages and had 211.5 million registered users and 36.2 million paying subscribers as of September 30th, 2020.\n\nYahoo News since last filing: \n\n1. December 11th, Eros Now Announces its Biggest Content Slate\n2. 20 Days Ago, Hosted Abu Dhabi T10 tournament, now official team sponsor of Team Abu Dhabi\n3. Eros Now Select available through Apple TV in 11 new Countries\n4. Horizon Line premiering on EPIX\n5. Reached 36.2 Million Subs (2 months ago)\n\nPotential Catalysts: Subscription growth and revenue per sub. PVOD results. New film releases. PR and ER from management.\n\nWhat do you guys think? Is this Rocket Worthy? The first post I saw on reddit was bashed heavily, mention toxic financing (which I cannot find) from merger of two companies a year ago. Seems there are a few bitter people who lost money or are bagholders. \n\nCrossposting to a few sites I belong to. Will update on any major findings...",
        "subreddit": "Wallstreetbetsnew",
        "title": "esgc dd",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lavi6b/esgc_dd/",
        "created": 1612301506.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272445,
        "id": "lavfbl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Eros STX Global Corporation (NYSE: ESGC) Dirty Dished",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lavfbl/eros_stx_global_corporation_nyse_esgc_dirty_dished/",
        "created": 1612301245.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272516,
        "id": "lavg2i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Eros STX Global Corporation - ESGC Dirty Dishes",
        "url": "https://www.reddit.com/r/pennystocks/comments/lavg2i/eros_stx_global_corporation_esgc_dirty_dishes/",
        "created": 1612301316.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272598,
        "id": "lavgwo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Eros STX Global Corporation - ESGC Dirty Dishes",
        "url": "https://www.reddit.com/r/stocks/comments/lavgwo/eros_stx_global_corporation_esgc_dirty_dishes/",
        "created": 1612301398.0
    },
    {
        "author": "griffin863",
        "created_utc": 1612295784,
        "id": "lb4s0y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "ESGC - Eros STX DD",
        "url": "https://www.reddit.com/r/pennystocks/comments/lb4s0y/esgc_eros_stx_dd/",
        "created": 1612324584.0
    },
    {
        "author": "JobBrooks2013",
        "created_utc": 1612276453,
        "id": "lawtd5",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "DID ANYONE ELSE SEE THAT BLIP WHEN IT HIT 0630?! IT WENT FROM $139 to $225 AND BACK DOWN IN THE BLINK OF AN EYE. What does that tel you?!?!",
        "subreddit": "wallstreetbets",
        "title": "BLIP AT 0630!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lawtd5/blip_at_0630/",
        "created": 1612305253.0
    },
    {
        "author": "Weasel-McGibblypants",
        "created_utc": 1612221839,
        "id": "lahex6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Can anyone tel me if this Biocryst hype is real?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lahex6/can_anyone_tel_me_if_this_biocryst_hype_is_real/",
        "created": 1612250639.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612274164,
        "id": "lavz0j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Can someone tel me why its dont exploding up with the stock?🚀",
        "url": "https://i.redd.it/qxsolq7cl2f61.jpg",
        "created": 1612302964.0
    },
    {
        "author": "Sufficient_Nature368",
        "created_utc": 1612368647,
        "id": "lbqzep",
        "num_comments": 182,
        "num_crossposts": 5,
        "selftext": "This will be long....Sorry in advance. I decided I'd like to research Michael Burry since I've seen so many people talking about him on here and this is just what I've discovered about him and his methods.\n\n**Quick Facts:**\n\n* Founder of hedge fund Scion Capital 2000-2008. Closed to focus on personal investments\n* Best known for seeing the subprime mortgage crisis (2007-2010) and profiting from it\n* Investment style is built upon Benjamin Graham and David Dodd’s 1934 book Security Analysis: \"All my stock picking is 100% based on the concept of a margin of safety.\"\n\n**Strategy:**\n\n* Michael Burry's strategy as he states is not very complex. He tries to buy shares of unpopular companies when the look like roadkill, and sell them when they've been cleaned up a bit. Lets take a look at his Q2 2020 Positions, top buys, and top sells. There are a few that are not big surprises but check it out.\n\n|Stock|Shares|Market Value|% of Portfolio|\n|:-|:-|:-|:-|\n|GOOG / Alphabet Inc Class C (CALL)|80,000\t| $113,089,000 | 35.87 |\n| FB / Facebook Inc (CALL) | 93,200 | $21,163,000 | 6.71 |\n| BKNG / Booking Holdings Inc (CALL) | 11,600 | $18,471,000 | 5.86 |\n| GS / Goldman Sachs Group (CALL) | 73,600 | $14,545,000 | 4.61 |\n| GME / Gamestop Corp | 2,750,000 | $11,935,000 | 3.79 |\n| WDC / Western Digital Inc (CALL) | 270,000 | $11,921,000 | 3.78 |\n| BBBY / Bed Bath &amp; Beyond Inc | 1,000,000 | $10,600,000 | 3.36 |\n| DISCA / Discovery Inc | 500,000 | $10,550,000 | 3.35 |\n| TCOM / Trip.com Inc | 325,000 | $8,424,000 | 2.67 |\n| QRVO / Qorvo Inc | 75,000 | $8,290,000 | 2.63 |\n\n* **Top Buys**\n   * GOOG / Alphabet Inc Class C (CALL)\n   * FB / Facebook Inc (CALL)\n   * BKNG / Booking Holdings Inc (CALL)\n   * GS / Goldman Sachs Group (CALL)\n   * WDC / Western Digital Inc (CALL)\n* **Top Sells**\n   * Jack / Jack In The Box Inc\n   * FB / Facebook Inc\n   * BA / Boeing Inc\n   * MAXR / Maxar Technologies Ltd\n   * QRVO / Qorvo Inc\n\nMr. Burry's weapon of choice is his **research** and that it's critical for him to understand a company's value before laying down a dime and that 100% of his stock picking is based on the concept of margin of safety introduced in the book \"Security Analysis\" which I am reading through right now and dang is it huge lol. He also states that he has his own version of their technique, but that the net is that he wants to protect his downside to prevent permanent loss of capital. Specific, known catalyst are not necessary. Sheer, outrageous value is enough.\n\nHe cares little about the level of the general market and puts few restrictions on potential investments. They can be large-cap stocks, small cap, mid cap, micro cap, tech or non-tech and finds out-of-favor industries a particularly fertile ground for best-of-breed shares at **steep discounts**.\n\n**How does he determine the discount?**\n\n* Focuses on free cash flow and enterprise value (Market capitalization less cash plus debt)\n* Screen companies by look at enterprise value/EBITDA ratio. Accepted ratio varies with the industry and it position in the economic cycle\n* If stock passes loose screen, looks harder to determine specific price and value of a company\n   * Takes into account off-balance sheet items and true free cash flow\n   * Ignores price-earning ratios\n   * Return of equity is deceptive and dangerous\n   * Prefers minimal debt\n   * Adjust book value to a realistic number\n* Invest in rare birds - asset plays, and to a lesser extent, arbitrage opportunities and companies selling at less than two-thirds of net value\n* Will mix in with companies favored by Warren Buffet **IF** they become available at good prices. Deserving of longer holding periods.\n\n**How many Stocks does he hold?**\n\n* Likes to hold 12 to 18 stocks diversified among various depressed industries, and tends to be fully invested. Provides enough room for his best ideas and helps with volatility.\n* Feels volatility is no relation to risk.\n\n**Tax Implications**\n\n* Not concerned much about tax. Know his portfolio turnover will generally exceed 50% annually, and at 20% the long-term tax benefits of low-turnover pretty much disappear.\n\n**When he buys**\n\n* He mixes barebones technical analysis into his strategy. \n* Prefers to buy within 10% to 15% of a 52-week low that has shown itself to offer some price support. If a stock other than a rare bird breaks a new low, in most cases he cuts the loss.\n   * Balances the fact that he is turning his back on potentially greater value with the fact that since implementing this rule he hasn't had a single misfortunate blow up his entire portfolio\n\n&amp;#x200B;\n\n&gt;In the end, investing is neither a science nor an art - it is a scientific art.\n\n&amp;#x200B;\n\n**Works Cited**\n\n[https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/](https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/)\n\n[https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/](https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/)\n\n[https://en.wikipedia.org/wiki/Michael\\_Burry](https://en.wikipedia.org/wiki/Michael_Burry)",
        "subreddit": "ValueInvesting",
        "title": "Michael Burry's Investment Strategy",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/lbqzep/michael_burrys_investment_strategy/",
        "created": 1612397447.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612222116,
        "id": "lahib2",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": "# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is extremely memeable, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\nTwinkies to the moon: [https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…now they’re going to make us some Tendies™ as well.\n\nFor some historical context, the company was private-equity owned for awhile and then went public via a SPAC in 2016 (before SPAC's were as cool as they are today). The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the SPAC (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the WSB pool of capital (especially since many of us have our tendies tied up in GME right now). If you’re looking for a bit of tendie diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)***\n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little tendie diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "wallstreetbets",
        "title": "Twinkies for Tendies: Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lahib2/twinkies_for_tendies_long_thesis_on_hostess/",
        "created": 1612250916.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612217235,
        "id": "lafmq2",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n[https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)***\n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "stocks",
        "title": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/",
        "created": 1612246035.0
    },
    {
        "author": "CryoSaint",
        "created_utc": 1612244335,
        "id": "laolti",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)\n\nI posted this TWNK long thesis in r/stocks, [here](https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/), but think it has a home in r/options as well given the 15% short interest, low IV, cheap options, and potential for gamma squeeze. Appreciate any and all thoughts.\n\n# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)*** \n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "wallstreetbets",
        "title": "Great info on TWNK. I did not write this!! Just copied..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laolti/great_info_on_twnk_i_did_not_write_this_just/",
        "created": 1612273135.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612218859,
        "id": "lag9pd",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "I posted this TWNK long thesis in r/stocks, [here](https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/), but think it has a home in r/options as well given the 15% short interest, low IV, cheap options, and potential for gamma squeeze. Appreciate any and all thoughts.\n\n# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n[https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)*** \n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "options",
        "title": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/options/comments/lag9pd/long_thesis_on_hostess_brands_twnk_owner_of/",
        "created": 1612247659.0
    },
    {
        "author": "HowDoesIStonks",
        "created_utc": 1612942430,
        "id": "lgom07",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I love sustainability SPACs and have already bought into most of them. So I've been looking around for more near NAV SPACs which might target an ESG or sustainability focused company and I found these four. They all have ESG mandates and/or are considering sustainability focused companies, however many are also considering other sectors as well, like FinTech, so they aren't guaranteed to go green. All are currently trading between $10-11.\n\n# ARBG : Aequi Acquisition Corp.\n\n&gt;We expect to favor potential technologically driven target companies in the consumer industry. In addition, a target company must demonstrate a dedication to Diversity, Equity and Inclusion (“DE&amp;I”) and strong Environmental, Social and Governance (“ESG”) principles. \\[...\\]  \n&gt;  \n&gt;Our acquisition and value creation strategy is to acquire a data-centric, growth-orientated consumer company in a sector such as, retail, education, financial technology, media &amp; gaming, healthcare &amp; wellness, legal, and/or procurement &amp; eco-friendly packaging.\n\nAlso\n\n&gt;In addition, our sponsor is committing to donate 10% of the founder shares it holds to advance social and economic mobility following the consummation of the initial business combination.\n\nI think that's really cool and shows they are probably serious about ESG and not just ESGwashing.\n\nLeadership: Hope S. Taitz, CEO of ELY Capital, Co-founder of Catalyst Partners, former BOD Girls Who Code. Joy Seppala, founder of SISU Capital. Previously Head of the Special Situations Investment Group at Banque Paribas.\n\n# PIAI : Prime Impact Acquisition I\n\n&gt;We believe that advances in Artificial Intelligence (AI), machine learning, cloud computing, mobile applications, automation throughout global supply chains, clean energy solutions, autonomous vehicles and the consumer and industrial IoT will drive sustained growth and accelerate the digital transformation of the enterprise and lead to significant value creation. The development and application of these new technologies are expected to create massive opportunities within new and existing sectors, such as technology, media and telecom (TMT), medicine and healthcare (Med Tech) and traditional industries (Industrial Tech).  \\[...\\]  \n&gt;  \n&gt;It is our goal to acquire companies that can evolve to exploit the opportunities and navigate the challenges of the complex, data-centric global economy. We will target companies that are benefiting from the disruptive impact of new technologies and the continuing growth in developing markets, such as China and India.  \n&gt;  \n&gt;We intend to drive long-term growth and build a successful public company through disciplined strategic execution and a commitment to environmental sustainability, social responsibility and strong corporate governance (ESG).\n\nLeadership: Mike Cordano, former President and COO of Western Digital Corporation. Mark Long, former CFO of Western Digital Corporation. Jim McLean, founder of Silicon Valley Data Capital.\n\n# MLAC : Malacca Straits Acquisition Co Ltd\n\n&gt;Our business strategy is to identify and complete our initial business combination with a company which is currently part of a Southeast Asian business conglomerate in the media, food processing, renewable energy and healthcare industries, though we will also look for opportunities outside these sectors, which we believe can be positioned for success in Southeast Asian markets as well as other markets in Asia and beyond, which is complementary to the experience of our management team.\n\nLeadership: Kenneth Ng, founder of Ark Pacific Capital Management Limited, ED of Sprint Power Technology Limited, an EV consulting and engineering services company. Previously ED of Elliott Advisors (HK) Limited, Hong Kong arm of the hedge fund Elliott Associates. Stanley Wang, founder of K2 Venture Capital Company Limited, which invests in Southeast Asian FinTech and AI companies.\n\n# AVAN : Avanti Acquisition Corp.\n\n&gt;Consistent with our strategy, we have identified the following general criteria and guidelines which we believe are important in evaluating potential target businesses. We intend to seek to acquire companies that we believe: have a clear European focus; have an identifiable current and/or future nexus with the United States making them suitable for a NYSE listing; \\[...\\] Based in part on the above general criteria and guidelines, we do not currently expect to consider target businesses that operate primarily in the following sectors: Real Estate; Banking and Insurance, except Fintech companies; Natural Resources and Infrastructure, except renewable sources of energy companies; Biotech; and Pure Media, Publishing and Advertising, except new business model or Tech angle companies.\n\nAlso an ESG mention\n\n&gt;NNS Group and Sienna Capital share the same business principles and investment approach, which include: seeking sustainable growth of portfolio assets and ultimately long-term value creation through consistent and disciplined implementation of environmental, social and governance principles and sustainable business practices;\n\nLeadership: Nassef Sawiris, founder NNS Group, former CEO of OCI NV and Orascom Construction Industries SAE. Colin Hall, former CEO  of Sienna Capital.\n\nDisclaimer: It's not a sure thing that any of these SPACs will target a green company. I am not a financial advisor. Disclosure: I bought 10 commons 50 warrants of each.",
        "subreddit": "SPACs",
        "title": "Four near NAV SPACs considering ESG and green targets",
        "url": "https://www.reddit.com/r/SPACs/comments/lgom07/four_near_nav_spacs_considering_esg_and_green/",
        "created": 1612971230.0
    },
    {
        "author": "STVMAIN",
        "created_utc": 1612188145,
        "id": "la3pea",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "some really cheap stocks $SDC, $ENDP, $WDC ,$BB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la3pea/some_really_cheap_stocks_sdc_endp_wdc_bb/",
        "created": 1612216945.0
    },
    {
        "author": "newyorkcash",
        "created_utc": 1612453417,
        "id": "lcies7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC price target raised by Baird to $85 from $50.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lcies7/wdc_price_target_raised_by_baird_to_85_from_50/",
        "created": 1612482217.0
    },
    {
        "author": "bigballsmcginty",
        "created_utc": 1612224279,
        "id": "laiada",
        "num_comments": 245,
        "num_crossposts": 0,
        "selftext": "  \n\n**Microvast DD &amp; catalysts** \n\nFirst off well done to anyone who got in on this trade. It’s been a long hold for a lot of people, if you were lucky enough to spot my DD early last week you could have got in at a very nice price. \n\nFollowing on from my DD post on Sunday I want to talk about what now know from the investor presentation and also discuss what catalysts Microvast have coming up. I think you will like what I have to say.\n\n**Takings from Microvast investors Presentation** \n\nHave been looking forward to seeing this document for 3 months now and it didn’t disappoint, we need to give big Credit to Stephen Vogel, the Tuscan team and the sponsor InterPrivate for delivering but now it’s time to focus on Microvast. I’ve linked a copy of the presentation and investors call below but here are my key takings:\n\n· Starting with the leadership it is good to see we have an extremely experienced team with lead by Yang Wu the CEO.\n\n· Company valued at $3 Billion- this was in the upper limit of what I expected but very good, gives the share price a lot of room to grow.\n\n· MicroVast at a glance- gives a real good and easy to understand high level summary of what this company is all about and where they are headed with a roadmap.\n\n· I liked how they have identified new Target markets in Passenger vehicles, Energy Storage and battery components, this will serve them well in the long run and its exciting to think how much of a market share the will be able to get with a very large addressable market.\n\n· They have best in class in battery cell technology with ultra-fast charge, high power and high energy density with a very impressive pipeline of new products and intellectual property IP on battery tech.\n\n· Massive Contract with CNHI/FPT securing a $1.5Bn contract- this Is massive as it shows a steady stream of revenue and puts the Argument that the company may be struggling with revenues to bed.\n\n· Customer partnerships with names such as IVECO, Porsche and OAHKOSH\n\n· R&amp;D partnerships with United states council for automotive research (USCAR), Argonne and most Notably BMW.\n\n· Identified $5.9Bn in possible contract revenues with visibility as far as 2025 in a fast growing sector with stable margins.\n\n· How valuation was calculated and how Microvast plan to use money raised to expand ‘world-class manufacturing facilities in the U.S. and Europe; total estimated global capacity of 9 GWh by 2022’ \n\n· Benchmark well against similar companies in terms of operations and valuation. And a 64% CAGR is Very impressive\n\nI’m very impressed with the presentation and a lot of questions surrounding the Revenues, contracts, valuation and growth have been answered.\n\n**Microvast Known Catalysts:**\n\nIn the short to medium term there a number of catalysts that I think will affect the share price positively:\n\n· A date will be set for a vote to merge and the stock price will move in anticipation to this.\n\n· I expect after the ticker change there could be a small dip in price with people taking profits, however, There is touted overwhelming interest in this SPAC in Asia (China, Japan, South Korea) by all accounts, and if true, Chinese hedge funds will make this parabolic on ticker change.\n\n· Opening of the new factory in Germany and start of production, this is expected to happen in Spring and would be a really nice catalyst to accompany the ticker change to $MVST.\n\n· Advanced discussion with two other Marquee Global customers which if executed could provide an additional $3Bn in contracted revenue through 2028. From previous DD and just connecting the dots I think these 4 are the front runners: Tesla, Mercedes, General motors and Ford.\n\n· Beginning of construction for new plant in Clarkesville, TN with production expected to in early 2022.\n\n· And last but not least CRAMER- love him or hate him his coverage of any stock gets their name out there with his large audience (HYPE).\n\n• Ark invest may also want in on the action (my own speculation)\n\nOverall it was a great day and a huge relief for everyone who has been getting nervous holding. If you managed to resist the urge to sell today I think these catalysts will make your Diamon hands even stronger.\n\nFor people who didn’t get in early I still see value here given the catalysts above and the future revenue and growth projections. My advice would be to wait for dips to add a starting position with dollar cost averaging being the tactic. If the share price opens high tomorrow wait for a opportunity to buy when the gap created trys to fill like seen today when we opened above the ATH of $20.93.\n\nI Predicted a move of 50% plus with DA announcement. Short term I can see the share price going on a run Similar like what was seen with $SHLL ($40/50+) only I have a lot more confidence in Microvast holding a high price post ticker change similar to $DKNG (holding $50 well). \n\nLong-term if you are willing to hold until 2025 I think this stock will easily surpass $100 based on the current projections. I personally will be holding the majority of my position. I took some profits today and added a new position in $COUV which is another battery play I will release DD on soon.\n\nHappy Merger Monday\n\n**Links**\n\n**1)** **http://www.microvast.com/index.php/about/investors**",
        "subreddit": "SPACs",
        "title": "Microvast Investor Presentation DD. Future catalysts and Price targets included. $THCB",
        "url": "https://www.reddit.com/r/SPACs/comments/laiada/microvast_investor_presentation_dd_future/",
        "created": 1612253079.0
    },
    {
        "author": "bigballsmcginty",
        "created_utc": 1612226565,
        "id": "laj30y",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "  \n\n**Microvast DD &amp; catalysts** \n\nFirst off well done to anyone who got in on this trade. It’s been a long hold for a lot of people, if you were lucky enough to spot my DD early last week you could have got in at a very nice price. \n\nFollowing on from my DD post on Sunday I want to talk about what now know from the investor presentation and also discuss what catalysts Microvast have coming up. I think you will like what I have to say.\n\n**Takings from Microvast investors Presentation** \n\nHave been looking forward to seeing this document for 3 months now and it didn’t disappoint, we need to give big Credit to Stephen Vogel, the Tuscan team and the sponsor InterPrivate for delivering but now it’s time to focus on Microvast. I’ve linked a copy of the presentation and investors call below but here are my key takings:\n\n· Starting with the leadership it is good to see we have an extremely experienced team with lead by Yang Wu the CEO.\n\n· Company valued at $3 Billion- this was in the upper limit of what I expected but very good, gives the share price a lot of room to grow.\n\n· MicroVast at a glance- gives a real good and easy to understand high level summary of what this company is all about and where they are headed with a roadmap.\n\n· I liked how they have identified new Target markets in Passenger vehicles, Energy Storage and battery components, this will serve them well in the long run and its exciting to think how much of a market share the will be able to get with a very large addressable market.\n\n· They have best in class in battery cell technology with ultra-fast charge, high power and high energy density with a very impressive pipeline of new products and intellectual property IP on battery tech.\n\n· Massive Contract with CNHI/FPT securing a $1.5Bn contract- this Is massive as it shows a steady stream of revenue and puts the Argument that the company may be struggling with revenues to bed.\n\n· Customer partnerships with names such as IVECO, Porsche and OAHKOSH\n\n· R&amp;D partnerships with United states council for automotive research (USCAR), Argonne and most Notably BMW.\n\n· Identified $5.9Bn in possible contract revenues with visibility as far as 2025 in a fast growing sector with stable margins.\n\n· How valuation was calculated and how Microvast plan to use money raised to expand ‘world-class manufacturing facilities in the U.S. and Europe; total estimated global capacity of 9 GWh by 2022’ \n\n· Benchmark well against similar companies in terms of operations and valuation.\n\nI’m very impressed with the presentation and a lot of questions surrounding the Revenues, contracts, valuation and growth have been answered.\n\n**Microvast Known Catalysts:**\n\nIn the short to medium term there a number of catalysts that I think will affect the share price positively:\n\n· A date will be set for a vote to merge and the stock price will move in anticipation to this.\n\n· I expect after the ticker change there could be a small dip in price with people taking profits, however, There is touted overwhelming interest in this SPAC in Asia (China, Japan, South Korea) by all accounts, and if true, Chinese hedge funds will make this parabolic on ticker change.\n\n· Opening of the new factory in Germany and start of production, this is expected to happen in Spring and would be a really nice catalyst to accompany the ticker change to $MVST.\n\n· Advanced discussion with two other Marquee Global customers which if executed could provide an additional $3Bn in contracted revenue through 2028. From previous DD and just connecting the dots I think these 4 are the front runners: Tesla, Mercedes, General motors and Ford.\n\n· Beginning of construction for new plant in Clarkesville, TN with production expected to in early 2022.\n\n· And last but not least CRAMER- love him or hate him his coverage of any stock gets their name out there with his large audience (HYPE).\n\nOverall it was a great day and a huge relief for everyone who has been getting nervous holding. If you managed to resist the urge to sell today I think these catalysts will make your Diamon hands even stronger.\n\nFor people who didn’t get in early I still see value here given the catalysts above and the future revenue and growth projections. My advice would be to wait for dips to add a starting position with dollar cost averaging being the tactic. If the share price opens high tomorrow wait for a opportunity to buy when the gap created trys to fill like seen today when we opened above the ATH of $20.93.\n\nI Predicted a move of 50% plus with DA announcement. Short term I can see the share price going on a run Similar like what was seen with $SHLL ($40/50+) only I have a lot more confidence in Microvast holding a high price post ticker change similar to $DKNG (holding $50 well). \n\nLong-term if you are willing to hold until 2025 I think this stock will easily surpass $100 based on the current projections. I personally will be holding the majority of my position. I took some profits today and added a new position in $COUV which is another battery play I will release DD on soon.\n\nHappy Merger Monday\n\n**Links**\n\n**1)** http://www.microvast.com/index.php/about/investors",
        "subreddit": "StockMarket",
        "title": "Microvast SPAC deal DD. Short-term Catalysts and Price targets included. $THCB",
        "url": "https://www.reddit.com/r/StockMarket/comments/laj30y/microvast_spac_deal_dd_shortterm_catalysts_and/",
        "created": 1612255365.0
    },
    {
        "author": "terryhughesimages",
        "created_utc": 1612357314,
        "id": "lbn148",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "shroomstocks",
        "title": "Mydecine Innovations Group Appoints Josephine Wu to Board of Directors",
        "url": "https://finance.yahoo.com/news/mydecine-innovations-group-appoints-josephine-123000484.html",
        "created": 1612386114.0
    },
    {
        "author": "StewPidassho",
        "created_utc": 1612186099,
        "id": "la31co",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I only trust Wu-Tang Financial.",
        "url": "https://www.youtube.com/watch?v=zhUnEg0he4A",
        "created": 1612214899.0
    }
]