[
    {
        "author": "CatoTheBarner",
        "created_utc": 1638479457,
        "id": "r7hfdd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Full disclosure, I work here. I've got an ESPP set up, so I do have a small percentage of GPN in my portfolio (not enough to hurt now that they're tanking lol). But generally, to my untrained eye, the financials seem at least decent. Q3 earnings report was generally positive, beat EPS and revenue estimates, and beat Q3 2020.   \n  \nQuote from the CEO: “We are pleased to have delivered the strongest performance in our history in the third quarter despite facing incremental challenges from COVID-19 during the period.\"  \n  \nFrom the CFO: “We are gratified by the strong financial performance we delivered in the third quarter, which exceeded our expectations despite the incremental impact of the pandemic. We achieved double digit adjusted net revenue growth, strong adjusted operating margin expansion and impressive adjusted earnings per share growth compared to both 2020 and 2019.”  \n  \nWhen I look at the [earnings history by quarter, I see green across the board](https://imgur.com/85hwbX3). So what am I missing here? During the pandemic, the stock price fell $87 from Feb to March (obviously). After that, it rebounded and by December was higher than it was previously. But in 2021, there has been an even greater drop off than what we saw in early 2020! So far this year, the price fell from a high of $217 in April down to about $120 today, a drop of $97 and 44.7% in less than eight months. The Q3 earnings report didn't even cause a blip of good news, it just continued to fall. What am I missing that's causing this?",
        "subreddit": "stocks",
        "title": "Can someone help me understand why GPN is performing as badly as it is?",
        "url": "https://www.reddit.com/r/stocks/comments/r7hfdd/can_someone_help_me_understand_why_gpn_is/",
        "created": 1638508257.0
    },
    {
        "author": "Forward_Living3561",
        "created_utc": 1638353814,
        "id": "r6bmob",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I am pretty sure, that every retard should be able to find his stocks in this list. This is our fate. \n\nNote: our lovely stocks like $WISH, $GME, $BABA, etc. were not included to this list, because they are not in S&amp;P500. But yes, they also have lost 50%+ from the 52WK High.\n\nNumbers were counted at 2021/12/1  \n\n\n|*Ticker*|*S&amp;P500 stock* |*% Off 52WK High*|Price/Earings and  Market Cap (B)|\n|:-|:-|:-|:-|\n|VIAC|ViacomCBS Inc |70.81%|6.06 / 20.1|\n|DISCA/DISCK |DISCOVERY COMMUNICATIONS INC.  |70.53%/66.61%|12.4 / 11.7|\n|PENN|Penn National Gaming, Inc |65.18%|21.7 / 8.6|\n|GPS|Gap, Inc.|55.62%|12.4 / 6.1|\n|BIIB |Biogen, Inc.|50.53%|23 / 34.6 |\n|LVS|Las Vegas Sands Corp.|46.92%|No earnings / 27.2|\n|TWTR|Twitter, Inc.|46.54%|No earnings / 35.1|\n|GPN|Global Payments, Inc.|46.52%|37.6 / 34.5|\n|CCL|Carnival Corporation|45.41%|No earnings / 20.5|\n|WYNN| Wynn Resorts, Limited |45.19|No earnings / 9.3|",
        "subreddit": "wallstreetbets",
        "title": "10 Top Loser Stocks in the last 52WKs in S&amp;P500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6bmob/10_top_loser_stocks_in_the_last_52wks_in_sp500/",
        "created": 1638382614.0
    }
]