[
    {
        "author": "thenudedentist",
        "created_utc": 1620095913,
        "id": "n4e3w6",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "I'm newer to the game so maybe someone can help me with this.  I am sure I am missing something basic but, looking at their revenue, NVDA is not much more than AMD.  NVDA shows $5 billion for quarterly revenue January 21 and AMD is showing $3.44 billion for the same time period. So roughly, 1.5 times as much revenue.\n\nNVDA is shown being valued at $370 billion and AMD at $97 billion.  That means NVDA is worth almost 4 times as much with only 1.5 times the revenue.  Why is this?  \n\nI like AMD and have been invested since March of last year and plan to keep buying more, but I just wonder why they are worth so much less.  Again, I am sure I am missing something very fundamental here so any input is greatly appreciated.",
        "subreddit": "stocks",
        "title": "Why is NVDA worth so much more than AMD?",
        "url": "https://www.reddit.com/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/",
        "created": 1620124713.0
    },
    {
        "author": "andrwsc",
        "created_utc": 1620104626,
        "id": "n4ggw4",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "It is common advice to simply invest in a low-cost mutual fund or ETF for the S&amp;P 500 index or perhaps for the whole market.  Warren Buffet says \"I do not think the average person can pick stocks.\"  Certainly it makes the most sense for many people to simply pick standard index funds for their 401(k), for example.\n\nBut what about the \"better than average\" investor?  Yes, I know that it may be presumptuous to assume that I could do better than professional fund managers, but it seems that it shouldn't be difficult to find companies within the S&amp;P 500 that beat the average more often than not.\n\nTo test this idea, I took a look at the S&amp;P 100 (not the full 500) and how each company did compared to the average over the past 10 years.  I picked the companies that consistently beat the average over the full 10 years, 5 years and 3 years.  Using a similar weighting as the index itself, I came up with the following portfolio of 20 stocks:\n\n* **Communication Services**: GOOG, DIS, NFLX\n* **Consumer Discretionary**: AMZN, TSLA, NKE, HD\n* **Consumer Staples**: TGT, COST\n* **Financials**: MA, V\n* **Health Care**: UNH, DHR, TMO\n* **Information Technology**: AAPL, MSFT, NVDA, ADBE\n* **Industrials**: HON, UNP\n\nI did not choose any companies from the Utilities, Materials, Real Estate or Energy sectors, but collectively these entire sectors comprise 10.1% of the S&amp;P 500.\n\nThis portfolio would have performed *significantly* better than the index over the past 10 years.  Even if you remove TSLA, the returns are about 3x over the index.\n\nThese are all well-known companies, many of whose products or services I use on a regular basis.  I know that \"past performance is no guarantee of future results\", but it seems to me that that these high performing companies are more likely to continue to beat the average than not.\n\nFor an investor that is willing to keep an eye on their portfolio and make changes when necessary, instead of forgetting about it for 10 years, why wouldn't a bucket of stocks like this be a better choice than an index fund?  Why should we settle for the average instead of going with companies that are consistently better than average?",
        "subreddit": "investing",
        "title": "Index funds or stock portfolio?",
        "url": "https://www.reddit.com/r/investing/comments/n4ggw4/index_funds_or_stock_portfolio/",
        "created": 1620133426.0
    },
    {
        "author": "Radish-Perfect",
        "created_utc": 1619894655,
        "id": "n2ojmq",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "What if I told you that Qualcomm, Intel, Skyworks, Texas Instruments, Samsung, and Analog devices all had something in common in their supply chain? They all buy their testing capital equipment from Cohu. \n\nCohu offers a few different products. All of them are within the market of testing computer chips. Why is this market important? Well on the customer end, imagine if you spent 2500$ on a laptop and the intel chip inside didn't work. You'd return it to BestBuy, who would return it to HP, who would return it to Intel. A long and expensive chain of returns for a nonfunctional product. This issue can also be more than just an inconvenience. What if you bought a self driving tesla and one of the chips in the sensors didn't work? What if a Boeing airbus had some faulty chips in the navigation system? In short, it's very important that the semi manufacturers know that their product is working when they send it out. \n\n**Bullish trends**\n\n1. Semiconductor volume is increasing in the following industries, **mobile phones** (5g needs 2x the chips), **Computing**, **Automotive** (electric and self driving need exponentially more chips than cars of the past), **Cloud computing** (basically a warehouse of semiconductors) **AI** (not sure how this works, but it's going to need computer chips). Here's my main argument: ***Each of those markets is rapidly growing, and at the same time chip volume is rising in each of those markets***. This creates a sort of exponential effect for the semiconductor chain. Not only is there a strong catalyst from increasing volume in existing markets (phones, pcs), but we also see rapidly growing new markets that also have high density. (cloud, auto). This is very bullish for the entire semi supply chain.  But the key feature that benefits testing in particular, is increasing complexity of chips. A more complex chip requires more complex testing, which demands a higher premium. \n2. Semiconductor shortage. We all know demand for computer chips is very high. And supply has just about run out. This means that prices for semiconductors should increase due to scarcity. This is great news for Cohu, as it leaves more margin to charge for testing. If you were ford would you pay a premium on chips in order to produce your vehicles?\n3. Increasing chip complexity, on smaller wafers, demands a higher price for testing. AMAT recently noted on April 6th analyst day that capital intensity (% revenue spent on capital equipment) is returning to the 2000 highs of 16%. This increased capital intensity seems especially true when we consider the global chip shortage. Intel and Nvidia are opening new fabs in the last couple months. These factories are going to require a shit-ton of capital equipment. For example TSMC announced they'll be spending $100 billion over the next 3 years on capital equipment, as their fabs have been running at 100% for months and still can't keep up with demand.\n4. Trend of strong growth. Cohu has shown strong growth in the last year. In Q1 2020, revenue was $138.9 million, and gross margin was 41.7%. Q1 2021 revenue was just reported at $225.1 million, and gross margin was 45.6%. This is annual revenue growth of 62%, and margin growth of 9%. Business outlook in only getting better as the semiconductor shortage worsens, and demand continues to grow across sectors.\n5. Very high accounts receivable. Accounts receivable is up 30% annually to 197 million$. Recurring customers represent 48% of Cohu's revenue, so this is a very strong sign in my opinion. \n\n**Bearish trends**\n\n1. The company is on a huge downturn in the last few trading days due to announcing 42-45% gross margin for Q2 instead of 45%+, like Q1. This is on increased revenue of 234-250 million forecasted for Q2. A decrease in GM on growing revenue is never a great sign. The reason for this change is that much of the forecasted growth is in the automotive segment, which is lower margin than other segments I mentioned in the last section. Essentially the chips in cars aren't as complicated as the chips in PCs or phones, so they are less expensive, and therefore have a lower margin for testing. I will point out that the firm is likely to generate more gross margin dollars next quarter than this quarter, albeit on lower gm %. (.43x240=$103.2 gm, vs this last quarter 225x.456=$102.6gm). \n2. Recent stock offering. Cohu sold 4,950,000 shares at 41$ at the start of march. This diluted the shares available, but raised $202 million for the firm. They used this to pay off debt, and fund future growth. \n3. strong competition. Cohu's main competitors are advantest, and teradyne. These are two large global firms that have significantly more financial resources than Cohu. Cohu does have some advantages over these strong competitors, it's the global leader in Radio frequency power amplifier. RF amplifiers are a key component in mobile phones, and are increasing in volume with the 5g rollout. (more chips per phone, and more complexity) Essentially Cohu is in the dominant position in this growing market. Cohu is also the leader in automotive handling. (handling is a process where chips are moved into the testing device, then sorted based on results).\n\n**Fundamental analysis**\n\nI use a ratio similar to p/e. I use gross margin/market cap. (If I was buying the whole company, I'd want to know how much profit I'm purchasing, I don't like p/e because it can be manipulated by the # of shares issued).\n\nCohu annual gm=$316,000,000. Cohu market cap=$1,925,000,000\n\n$316 million/$1925 million=6.09\n\nThis is a very attractive price/gm ratio. Lets compare it to some other companies ratios. \n\nCohu-6.09\n\naapl-19.12\n\namzn-18\n\nter-11.3\n\nadvantest-7.19\n\nswks-17.9\n\nIf cohu were trading at the same multiplier as it's large cap competitor, Teradyne, the stock price would nearly double.\n\nTaking a look at the balance sheet, Cohu is in a much better position today than 1 year ago. They have $290 million of cash, almost double from a year ago. They also have significantly lower long term debt. \\~$200 million today versus \\~$300 million a year ago. \n\n&amp;#x200B;\n\n**Technical analysis**\n\n[Cohu 1 year chart](https://preview.redd.it/pav84wurgjw61.png?width=1504&amp;format=png&amp;auto=webp&amp;s=3d65ce5a266334b6f1c8a9cd3fb344509441451e)\n\nAs we can see from the 1 year chart above, Cohu seems to find support around the $40 mark for the past 6 months. Currently it's chillin out on the support line, so this indicates to me that it's a good time to purchase cohu, as I love buying dips. We can also see it's found resistance at around $50, having tested that line 3-4 times since the start of the year. I cannot say with certainty that it will break this resistance line, but I do expect it to at least check this number again some time in the next 2-3 months. My expected range for this stock in the next 3 months is between $50 and $65, which leaves room for some nice profit if one were to buy at $40. \n\nIn conclusion, cohu is a small cap in an extremely hot market. It's got some big competitors, but it holds certain key advantages over them. The financial position of the company is really good currently, and it's growth should continue for the foreseeable future. It's strongest catalyst is that semiconductor density is increasing in existing markets, and new markets are emerging with high density, which has the potential to create enormous growth. For this reason, I think COHU is a great choice. (Even if you disagree on Cohu, you will want to have some semiconductors in your portfolio for the next few years). \n\nDisclaimer: I'm holding call options on this company. \n\ncheers",
        "subreddit": "wallstreetbets",
        "title": "Cohu; the plug for your favorite semiconductor companies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/",
        "created": 1619923455.0
    },
    {
        "author": "PerennialSynergy",
        "created_utc": 1619994371,
        "id": "n3hl1a",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Welcome,\n\nIn this analysis, we'll illustrate and explain why we have become quite bullish $NVDA in the short-term using perennial, fundamental trend analysis &amp; harmonics (based on Fibonacci symmetry) analysis synergistically. If you are reading this, we assume you have already witnessed and/or experienced the potentially powerful and remunerative effect of sound technical analysis; hence, if you have only studied classical trend analysis techniques with supportive volume flow analysis, you are in for a treat, because we potentiate the accuracy of these tools with harmonics.\n\nWe will begin with the classical, perennially-tested, fundamental trend analysis. $NVDA has been trading within a channel with the upper rail/resistance extending from Oct '18 and the lower rail/support from Apr '19, as can be viewed in Figure 1.\n\nFIGURE 1: https://imgur.com/a/b4KYX3i \n\nUpon rejection from the top rail/resistance in Sep '20, it entered into a bull flag formation; after a false breakdown from this flag &amp; a test of the multi-year channel support in early Mar '21, it surged into a major rally &amp; broke out of the flag mid-Apr '21. Next it was rejected from resistance extending from Sep '20 above the bull flag, causing it to retest the flag's upper rail (prior resistance) as support, which it did so successfully. All of this can be viewed in Figure 2 more clearly.\n\nFIGURE 2: https://imgur.com/a/a1JgUHT\n\nHenceforth, the fundamental trend analysis has allowed us to understand it's still in breakout region. Now let's thoroughly examine the short-term harmonic setups which may act as technical catalysts to fuel the breakout.\n\nOn the 45-min chart, our team has identified a bullish Gartley harmonic, which acts as the large framework--within the trend's context--of our short-term bull thesis; targets &amp; invalidation level are on the chart, seen in Figure 3. Also note that the volume flow is still positive on this time frame, despite the recent sell-off; hence, such divergence in volume flow supports the bull thesis. \n\nFIGURE 3: https://imgur.com/a/KNiobVi\n\nOn the 15-min chart (Heiken Ashi candles), our team identified a bullish ABCD harmonic, which reinforces our short-term bull thesis; again, targets &amp; invalidation level are on the chart, seen in Figure 4. Volume flow is also still largely positive/bullish, despite recent sell-off.\n\nFIGURE 4: https://imgur.com/a/yV5RIf8\n\nFinally, on the 5-min chart (Heiken Ashi candles), our team identified a bullish Deep Crab harmonic, which is why we believe it will show strength very early next week; again, targets &amp; invalidation level are on the chart, seen in Figure 5. The volume flow is tilted towards reflecting selling, which is expected on this extremely short-term time-frame; however, the selling was not significant enough to be reflected on the previous 15-min and 45-min frames analyzed previously.\n\nFIGURE 5: https://imgur.com/a/Ucu4UCd\n\nTherefore, our short-term bull thesis is frameworked by the trend-analysis (i.e. trend-analysis demonstrates $NVDA's in breakout territory), and reinforced with confluently bullish harmonic internals on multiple timeframes--the ideal, golden setup for which outperforming traders exercise the most difficult element of trading: patience.\n\n\nDISCLOSURE: We do not currently hold any position in $NVDA; however, we will be looking to enter long early in the upcoming week (i.e. Mon morning) if the price remains above the invalidation levels and below the initial targets. This is educational material, and should not be considered by the reader as financial advice; one should be sure to perform one's own due diligence before entering or exiting any position in the equities markets. \n\nAPPENDIX:\n\nHeiken Ashi: To learn more about Heiken Ashi candles (averaged candles which allow one to see \"the signal through the noise\"), refer to this educational article on Investopedia: https://www.investopedia.com/trading/heikin-ashi-better-candlestick/\n\nHarmonics: To learn more about Harmonic Patterns, refer to this fantastic educational material in the \"school\" of StockCharts: https://school.stockcharts.com/doku.php?id=trading_strategies:harmonic_patterns",
        "subreddit": "options",
        "title": "$NVDA: Short-Term Bull Thesis Formulated Synergistically Using Perennially-Tested, Fundamental Trend-Analysis with Harmonic Analysis Based on Fibonacci Symmetry (\"Sacred Geometry\")",
        "url": "https://www.reddit.com/r/options/comments/n3hl1a/nvda_shortterm_bull_thesis_formulated/",
        "created": 1620023171.0
    },
    {
        "author": "MAARJA007",
        "created_utc": 1620145686,
        "id": "n4slni",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Market is in bubble. Most tech are overbought stocks without P/E value.\n\nWarren Buffett is smart, he said that \"near-zero\" interest rates would change financial landscape and tech stocks would have good P/E . But we don't have interest rates near zero. It's 1.5-1.6%\n\nAnd because economy is booming, to cut down overheating, they must increase interest rates. This means that all tech stocks, Nvidia, Amazon, Netflix etc become even more overvalued. And having overvalued stock is very risky play.\n\nAnd of cause second thing is summer season and Covid-19. Covid-19 is about to end , people start traveling, shopping etc. This means that we don't need to use Netflix so much. And amazon. People are going to spend their money on other things. Tech becomes even more overvalued then.\n\n&amp;#x200B;\n\nDon't believe it if you don't want. Keep losing money.",
        "subreddit": "stocks",
        "title": "Warren Buffett is right about market",
        "url": "https://www.reddit.com/r/stocks/comments/n4slni/warren_buffett_is_right_about_market/",
        "created": 1620174486.0
    },
    {
        "author": "Wald_JD",
        "created_utc": 1620088889,
        "id": "n4bxnk",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I know crypto miners mostly use Nvidia or AMD GPUs to mine, but are Qualcomm GPU also heavily used to mine? I'm worry that with ETH moving from POW to POS, price of GPUs will definitely drop and this will not only impact the 2 big giants of crypto mining GPU but also Qualcomm itself.\nThoughts?",
        "subreddit": "stocks",
        "title": "Are Qualcomm graphic cards heavinly used in mining? ETH is going to POS soon and many GPU will lose lot of their values.",
        "url": "https://www.reddit.com/r/stocks/comments/n4bxnk/are_qualcomm_graphic_cards_heavinly_used_in/",
        "created": 1620117689.0
    },
    {
        "author": "winters1989",
        "created_utc": 1620087791,
        "id": "n4bkzx",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I've been looking at the top S&amp;P 500 companies over each of their life times and found these 4 to have done well:\nMSFT\t252 080%\nADBE        230 963%\nAAPL\t        101 000%\nNVDA\t 36 508%\n\n*I know past returns do not equal future gains\n\nMy goal is to put away 1500 per month for retirement and put 20% of that into those 4 companies(for wife and I). We are both 30 so we have some time to invest. \n\nIs this dumb? How risky do you guys think this is?\n\nCan you think of any stocks which would be better? Are there any in my above list you think would not be a good idea? \n\nI want to be more aggressive than just S&amp;P 500 / QQQ if this sounds like a bad idea what is a good alternative?\n\nThanks everyone!",
        "subreddit": "wallstreetbets",
        "title": "Is this investing strategy crazy for retirement?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n4bkzx/is_this_investing_strategy_crazy_for_retirement/",
        "created": 1620116591.0
    },
    {
        "author": "MAARJA007",
        "created_utc": 1619957219,
        "id": "n353j6",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "It was Friday, that's why STOCKS were down. Buy i recommend to keep buying NASDAQ STOCKS because tech is the future. No worry, we will see another 1.5% green day jump on Monday. Don't sell, just buy and hold.\nSo keep buying Pinterest, Nvidia, Facebook etc\nIgnore yields 10 years. It do nothing!",
        "subreddit": "stocks",
        "title": "Don't worry about NASDAQ, keep buying. It will be good month.",
        "url": "https://www.reddit.com/r/stocks/comments/n353j6/dont_worry_about_nasdaq_keep_buying_it_will_be/",
        "created": 1619986019.0
    },
    {
        "author": "PerennialSynergy",
        "created_utc": 1619994271,
        "id": "n3hjwl",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Welcome,\n\nIn this analysis, we'll illustrate and explain why we have become quite bullish $NVDA in the short-term using perennial, fundamental trend analysis &amp; harmonics (based on Fibonacci symmetry) analysis synergistically. If you are reading this, we assume you have already witnessed and/or experienced the potentially powerful and remunerative effect of sound technical analysis; hence, if you have only studied classical trend analysis techniques with supportive volume flow analysis, you are in for a treat, because we potentiate the accuracy of these tools with harmonics.\n\nWe will begin with the classical, perennially-tested, fundamental trend analysis. $NVDA has been trading within a channel with the upper rail/resistance extending from Oct '18 and the lower rail/support from Apr '19, as can be viewed in Figure 1.\n\nFIGURE 1: https://imgur.com/a/b4KYX3i \n\nUpon rejection from the top rail/resistance in Sep '20, it entered into a bull flag formation; after a false breakdown from this flag &amp; a test of the multi-year channel support in early Mar '21, it surged into a major rally &amp; broke out of the flag mid-Apr '21. Next it was rejected from resistance extending from Sep '20 above the bull flag, causing it to retest the flag's upper rail (prior resistance) as support, which it did so successfully. All of this can be viewed in Figure 2 more clearly.\n\nFIGURE 2: https://imgur.com/a/a1JgUHT\n\nHenceforth, the fundamental trend analysis has allowed us to understand it's still in breakout region. Now let's thoroughly examine the short-term harmonic setups which may act as technical catalysts to fuel the breakout.\n\nOn the 45-min chart, our team has identified a bullish Gartley harmonic, which acts as the large framework--within the trend's context--of our short-term bull thesis; targets &amp; invalidation level are on the chart, seen in Figure 3. Also note that the volume flow is still positive on this time frame, despite the recent sell-off; hence, such divergence in volume flow supports the bull thesis. \n\nFIGURE 3: https://imgur.com/a/KNiobVi\n\nOn the 15-min chart (Heiken Ashi candles), our team identified a bullish ABCD harmonic, which reinforces our short-term bull thesis; again, targets &amp; invalidation level are on the chart, seen in Figure 4. Volume flow is also still largely positive/bullish, despite recent sell-off.\n\nFIGURE 4: https://imgur.com/a/yV5RIf8\n\nFinally, on the 5-min chart (Heiken Ashi candles), our team identified a bullish Deep Crab harmonic, which is why we believe it will show strength very early next week; again, targets &amp; invalidation level are on the chart, seen in Figure 5. The volume flow is tilted towards reflecting selling, which is expected on this extremely short-term time-frame; however, the selling was not significant enough to be reflected on the previous 15-min and 45-min frames analyzed previously.\n\nFIGURE 5: https://imgur.com/a/Ucu4UCd\n\nTherefore, our short-term bull thesis is frameworked by the trend-analysis (i.e. trend-analysis demonstrates $NVDA's in breakout territory), and reinforced with confluently bullish harmonic internals on multiple timeframes--the ideal, golden setup for which outperforming traders exercise the most difficult element of trading: patience.\n\n\nDISCLOSURE: We do not currently hold any position in $NVDA; however, we will be looking to enter long early in the upcoming week (i.e. Mon morning) if the price remains above the invalidation levels and below the initial targets. This is educational material, and should not be considered by the reader as financial advice; one should be sure to perform one's own due diligence before entering or exiting any position in the equities markets. \n\nAPPENDIX:\n\nHeiken Ashi: To learn more about Heiken Ashi candles (averaged candles which allow one to see \"the signal through the noise\"), refer to this educational article on Investopedia: https://www.investopedia.com/trading/heikin-ashi-better-candlestick/\n\nHarmonics: To learn more about Harmonic Patterns, refer to this fantastic educational material in the \"school\" of StockCharts: https://school.stockcharts.com/doku.php?id=trading_strategies:harmonic_patterns",
        "subreddit": "StockMarket",
        "title": "$NVDA: Short-Term Bull Thesis Formulated Synergistically Using Perennially-Tested, Fundamental Trend-Analysis with Harmonic Analysis Based on Fibonacci Symmetry (\"Sacred Geometry\")",
        "url": "https://www.reddit.com/r/StockMarket/comments/n3hjwl/nvda_shortterm_bull_thesis_formulated/",
        "created": 1620023071.0
    },
    {
        "author": "BlitzReddit",
        "created_utc": 1619919412,
        "id": "n2wda7",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I've been a fellow ape since long before the the days of u/DeepFuckingValue *and* u/1ronyman*,* when we used to be praying for the mooning of $AMD, $NVDA, and our forgotten friend $JNUG. I since saw the light and YOLO'd my money into TSLA, SHOP, SQ, and some alternative assets, generating interdimensional returns of about 500% in the past year. All of this was on Robinhood. I poured my entire life savings into Robinhood. I even borrowed some money from my mom to invest. (Sadly still tied up in GME @ $380).\n\nI now wanted to buy my first home. I was excited that I could afford it with all of these gainz. I was excited I could make an all cash offer because that's what it takes with these foreign buyers running the market. But then I found out that the evil villains of RobinHood would not allow me to take my money out! RobinHood limits you from withdrawing **a MAXIMUM of $50,000 per BUSINESS DAY.** They're doing you dirty worse than they did to Harambe. \n\nWe must get the word out that **your money in RobinHood is not yours!** \n\nWhat is a good alternative to Robinhood for my $TSLA calls, $PLTR LEAPs, and box spread trades? Please advise! Ideally something I could use to buy some aternative assets too.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mvs16zcx1mw61.png?width=1170&amp;format=png&amp;auto=webp&amp;s=0fd4cb54839156215e23b2691c2841ee399af2d8\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3vt3sk4d1mw61.png?width=1170&amp;format=png&amp;auto=webp&amp;s=a4cf5e5c0d4b560d99d0eb2b09f1cf0e64650186\n\nhttps://preview.redd.it/1v6a2yvc1mw61.png?width=1170&amp;format=png&amp;auto=webp&amp;s=d024261cade9507cd4b0afe1e4ee885f008f1be2\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Me: When I started trading the classics!](https://preview.redd.it/re2wqzpczlw61.png?width=1170&amp;format=png&amp;auto=webp&amp;s=1e4752965d81f70b57e344712375f4a4335880a6)",
        "subreddit": "wallstreetbets",
        "title": "Can't buy a house with my lifesavings that's up 500% #DeleteRobinhood",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2wda7/cant_buy_a_house_with_my_lifesavings_thats_up_500/",
        "created": 1619948212.0
    },
    {
        "author": "raoha",
        "created_utc": 1620027577,
        "id": "n3qj1d",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**E2Open ($ETWO)**\n\n**A 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY**\n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.”  \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%).\n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to Wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n* *A Snapshot of its largest customer base:*\n\nhttps://preview.redd.it/uwe5biyquuw61.png?width=679&amp;format=png&amp;auto=webp&amp;s=fd2bc97da035fdd0cc0d84e11686aa40166f5c91\n\n* *A Snapshot Of Their Investment Thesis:*\n\nhttps://preview.redd.it/m1v3wk1uuuw61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=3530ce3826ed67513c7797afd4bb1a3a0d54e56a\n\n**Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\nhttps://preview.redd.it/tm9r4jdyuuw61.png?width=632&amp;format=png&amp;auto=webp&amp;s=cd452f13403ddf6f1c43151b9fca9415d9aa1826\n\n*A Visual Of $ETWO 's business model:*\n\nhttps://preview.redd.it/pts7oo10vuw61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=b50c7097f059b98ffb48f2e8134628860fccf700\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis. \n\nOne of the most important value factors for SaaS platforms is in the recurring cash flow. In $ETWO's case, this comes from it's subscription sales, which provides some much valued predictability in these uncertain times . This is another strength that $ETWO possesses, as the company boasts an extremely low churn rate - which is a an indicator of a massive moat, which can allow $ETWO to retain profits from its competitors. This only further demonstrates that the company is due for strong future growth. Below are some visuals which exemplify the value of ETWO:\n\n&amp;#x200B;\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/wirah1d2vuw61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=75ae35151c09a121def921cb6bd42c03c947c563\n\n* Attractive Long Term Financial Profile:\n\nhttps://preview.redd.it/9intlpp3vuw61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=ba50479fab89957024b271cc1223ddb2e25d83a1\n\n* Growth and Profitability:\n\nhttps://preview.redd.it/52quo145vuw61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=d93bbeb7ace2f303d45c68a5cf90bd616cff90c8\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it.  If you think about that, you’ll do things differently.”  \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management solutions to the enterprise. While the Supply Chain Management space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest:\n\n[https://finviz.com/screener.ashx?v=152&amp;f=sh\\_opt\\_option,sh\\_short\\_high&amp;o=shortinterestshare&amp;t=ETWO](https://finviz.com/screener.ashx?v=152&amp;f=sh_opt_option,sh_short_high&amp;o=shortinterestshare&amp;t=ETWO)\n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine:\n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "wallstreetbets",
        "title": "A Deep Dive Look at: E2Open ($ETWO) - The Future of Supply Chain Management?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3qj1d/a_deep_dive_look_at_e2open_etwo_the_future_of/",
        "created": 1620056377.0
    },
    {
        "author": "PerennialSynergy",
        "created_utc": 1619994314,
        "id": "n3hkd4",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Welcome,\n\nIn this analysis, we'll illustrate and explain why we have become quite bullish $NVDA in the short-term using perennial, fundamental trend analysis &amp; harmonics (based on Fibonacci symmetry) analysis synergistically. If you are reading this, we assume you have already witnessed and/or experienced the potentially powerful and remunerative effect of sound technical analysis; hence, if you have only studied classical trend analysis techniques with supportive volume flow analysis, you are in for a treat, because we potentiate the accuracy of these tools with harmonics.\n\nWe will begin with the classical, perennially-tested, fundamental trend analysis. $NVDA has been trading within a channel with the upper rail/resistance extending from Oct '18 and the lower rail/support from Apr '19, as can be viewed in Figure 1.\n\nFIGURE 1: https://imgur.com/a/b4KYX3i \n\nUpon rejection from the top rail/resistance in Sep '20, it entered into a bull flag formation; after a false breakdown from this flag &amp; a test of the multi-year channel support in early Mar '21, it surged into a major rally &amp; broke out of the flag mid-Apr '21. Next it was rejected from resistance extending from Sep '20 above the bull flag, causing it to retest the flag's upper rail (prior resistance) as support, which it did so successfully. All of this can be viewed in Figure 2 more clearly.\n\nFIGURE 2: https://imgur.com/a/a1JgUHT\n\nHenceforth, the fundamental trend analysis has allowed us to understand it's still in breakout region. Now let's thoroughly examine the short-term harmonic setups which may act as technical catalysts to fuel the breakout.\n\nOn the 45-min chart, our team has identified a bullish Gartley harmonic, which acts as the large framework--within the trend's context--of our short-term bull thesis; targets &amp; invalidation level are on the chart, seen in Figure 3. Also note that the volume flow is still positive on this time frame, despite the recent sell-off; hence, such divergence in volume flow supports the bull thesis. \n\nFIGURE 3: https://imgur.com/a/KNiobVi\n\nOn the 15-min chart (Heiken Ashi candles), our team identified a bullish ABCD harmonic, which reinforces our short-term bull thesis; again, targets &amp; invalidation level are on the chart, seen in Figure 4. Volume flow is also still largely positive/bullish, despite recent sell-off.\n\nFIGURE 4: https://imgur.com/a/yV5RIf8\n\nFinally, on the 5-min chart (Heiken Ashi candles), our team identified a bullish Deep Crab harmonic, which is why we believe it will show strength very early next week; again, targets &amp; invalidation level are on the chart, seen in Figure 5. The volume flow is tilted towards reflecting selling, which is expected on this extremely short-term time-frame; however, the selling was not significant enough to be reflected on the previous 15-min and 45-min frames analyzed previously.\n\nFIGURE 5: https://imgur.com/a/Ucu4UCd\n\nTherefore, our short-term bull thesis is frameworked by the trend-analysis (i.e. trend-analysis demonstrates $NVDA's in breakout territory), and reinforced with confluently bullish harmonic internals on multiple timeframes--the ideal, golden setup for which outperforming traders exercise the most difficult element of trading: patience.\n\n\nDISCLOSURE: We do not currently hold any position in $NVDA; however, we will be looking to enter long early in the upcoming week (i.e. Mon morning) if the price remains above the invalidation levels and below the initial targets. This is educational material, and should not be considered by the reader as financial advice; one should be sure to perform one's own due diligence before entering or exiting any position in the equities markets. \n\nAPPENDIX:\n\nHeiken Ashi: To learn more about Heiken Ashi candles (averaged candles which allow one to see \"the signal through the noise\"), refer to this educational article on Investopedia: https://www.investopedia.com/trading/heikin-ashi-better-candlestick/\n\nHarmonics: To learn more about Harmonic Patterns, refer to this fantastic educational material in the \"school\" of StockCharts: https://school.stockcharts.com/doku.php?id=trading_strategies:harmonic_patterns",
        "subreddit": "wallstreetbets",
        "title": "$NVDA: Short-Term Bull Thesis Formulated Synergistically Using Perennially-Tested, Fundamental Trend-Analysis with Harmonic Analysis Based on Fibonacci Symmetry (\"Sacred Geometry\")",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3hkd4/nvda_shortterm_bull_thesis_formulated/",
        "created": 1620023114.0
    },
    {
        "author": "raoha",
        "created_utc": 1620047820,
        "id": "n3vs4e",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " **E2Open ($ETWO)**\n\n**A 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\n&amp;#x200B;\n\n\\*Note\\* I posted this a few days ago on WSB. Mods deleted it (probably not enough rocket emojis), so I figured this might be a more suitable place for discussion!. Cheers!\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY**\n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.” \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%).\n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to Wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n* *A Snapshot of its largest customer base:*\n\nhttps://preview.redd.it/5y53bq4inww61.jpg?width=1194&amp;format=pjpg&amp;auto=webp&amp;s=1467048a3391c0da2fe641472522f200b7fcf016\n\n* *A Snapshot Of Their Investment Thesis:*\n\nhttps://preview.redd.it/7v8dt8rjnww61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=80b6e61352dd21cf6df02c9aebb4f2286fc83a01\n\n**Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\nhttps://preview.redd.it/zkuxw31onww61.png?width=632&amp;format=png&amp;auto=webp&amp;s=07d09fcf3e6f6e965ae82f6a48b77f2504896919\n\n*A Visual Of $ETWO 's business model:*\n\nhttps://preview.redd.it/2u9riftpnww61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=b4c32567357a0a5df16fe3df3efa83d2239f20c4\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis.\n\nOne of the most important value factors for SaaS platforms is in the recurring cash flow. In $ETWO's case, this comes from it's subscription sales, which provides some much valued predictability in these uncertain times . This is another strength that $ETWO possesses, as the company boasts an extremely low churn rate - which is a an indicator of a massive moat, which can allow $ETWO to retain profits from its competitors. This only further demonstrates that the company is due for strong future growth. Below are some visuals which exemplify the value of ETWO:\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/vqz514frnww61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=c7da8635fcc90ddc8313cf63284602b07a639e32\n\n* Attractive Long Term Financial Profile:\n\nhttps://preview.redd.it/ypg366qsnww61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=1a55558eaba519a8a3ac9d16fb0b0648c058a38c\n\n* Growth and Profitability:\n\nhttps://preview.redd.it/4sgqj03unww61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=f8b16e1fda840fb7d6c0fd2a7c9192dd645dfbe5\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it. If you think about that, you’ll do things differently.” \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management solutions to the enterprise. While the Supply Chain Management space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest:\n\n[https://finviz.com/screener.ashx?v=152&amp;f=sh\\_opt\\_option,sh\\_short\\_high&amp;o=shortinterestshare&amp;t=ETWO](https://finviz.com/screener.ashx?v=152&amp;f=sh_opt_option,sh_short_high&amp;o=shortinterestshare&amp;t=ETWO)\n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine:\n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "StockMarket",
        "title": "E2Open ($ETWO) - A Great Buy During The Current Global Supply Chain Crisis?",
        "url": "https://www.reddit.com/r/StockMarket/comments/n3vs4e/e2open_etwo_a_great_buy_during_the_current_global/",
        "created": 1620076620.0
    },
    {
        "author": "andystacks",
        "created_utc": 1620008142,
        "id": "n3ln7k",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "InvestmentClub",
        "title": "$NVDA: Short-Term Bull Thesis Formulated Synergistically Using Perennially-Tested, Fundamental Trend Based on Fibonacci Symmetry (\"Sacred Geometry\")",
        "url": "/r/FluentInFinance/comments/n3hlhp/nvda_shortterm_bull_thesis_formulated/",
        "created": 1620036942.0
    },
    {
        "author": "Tfamcola",
        "created_utc": 1619923897,
        "id": "n2xjvf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Keeping up with the industry I have faith in Lisa Su and all the plans for upcoming silicon production + overtaking intel rn and nvidia in the future with that giant $500 stock price, many other reasons but everyone who knows AMD prob knows these already. Is my call a good idea or a bad one",
        "subreddit": "wallstreetbets",
        "title": "I invested 17k into AMD $185 options calls for Jan 20 2023, plan on doing more at the same call price, did I do good or no?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2xjvf/i_invested_17k_into_amd_185_options_calls_for_jan/",
        "created": 1619952697.0
    },
    {
        "author": "andystacks",
        "created_utc": 1620008100,
        "id": "n3lmrz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "$NVDA: Short-Term Bull Thesis Formulated Synergistically Using Perennially-Tested, Fundamental Trend-Analysis with Harmonic Analysis Based on Fibonacci Symmetry (\"Sacred Geometry\")",
        "url": "/r/FluentInFinance/comments/n3hlhp/nvda_shortterm_bull_thesis_formulated/",
        "created": 1620036900.0
    }
]