[
    {
        "author": "earthWindFI",
        "created_utc": 1638376315,
        "id": "r6isiq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Thesis**\n\n* SIMO is a supplier of computer memory and benefits from the rise of datacenters, EV, smartphones, and other consumer tech\n* SIMO is a major supplier of Micron Technology (MU) 🚀\n* Revenues grew 100% Y/Y in Q3 2021\n* SIMO management forecasts revenue of $1.5B in 2022 (+50% growth over 2021) 🚀🚀\n* Most analysts are significantly under-pricing the company, only modelling $1B of revenue in 2022 (implying no growth) -- see sources below\n* The only analyst properly reflecting $1.5B revenue in 2022 has a **PT of $115 (60% upside) 🚀🚀**🚀\n\n&amp;#x200B;\n\n\\-----\n\n**Company Overview**\n\nSilicon Motion Technology (SIMO) is the global leader in supplying NAND flash controllers for solid state storage devices and the merchant leader in supplying SSD controllers.\n\nSIMO has the broadest portfolio of controller technologies and their controllers are widely used in embedded storage products such as SSDs and eMMC+UFS devices, which are found in smartphones, PCs and commercial and industrial applications.\n\nSIMO has have shipped over six billion NAND controllers in the last ten years, more than any other company in the world.\n\nMore NAND flash components, including current and up-coming generations of 3D flash produced by Intel, Kioxia, Micron, Samsung, SK Hynix, Western Digital and YMTC, are supported by Silicon Motion controllers than any other company. SIMO's customers include NAND flash makers, module makers, hyperscalers and OEMs. \n\nSIMO supplies customized high-performance hyperscale data center and industrial SSD solutions. SIMO's customers include most of the NAND flash vendors, storage device module makers and leading OEMs.\n\n**SIMO has a current share price of \\~$72 with a P/E ratio of \\~18x**\n\n&amp;#x200B;\n\n\\-----\n\n**Management Guidance**\n\nOn SIMO's [Q2 2021 earnings call](https://www.fool.com/earnings/call-transcripts/2021/07/30/silicon-motion-technology-corporation-simo-q2-2021/), management guided towards significant revenue growth in 2022:\n\n&gt;Based on our latest sales projection, our annual run rate is expected to be already at least $1 billion by this year's fourth quarter. **We expect sales of ultimately exceed $1 billion next year** as we add meaningful incremental foundry capacity already committed to us and from continued execution of our four prong initiative, which includes upselling a richer mix of products. Sales next year will include the rapid scaling of a higher value, high-volume PCIe Gen4 SSD controller.  \n&gt;  \n&gt;**Our customers have also provided us with purchase orders for the next year, and the order book today already exceeds $1.5 billion.** Our strong order book is a result of many years of hard work. No last minute opportunistic procurement audit of all the shelf parts by customers. We have been building our business pipeline for many years, leading to these purchase orders. Our OEM projects typically kick off one to three years before initial sales, depending on product capacity.  \n&gt;  \n&gt;**Already, our order book for next year is at least $1.5 billion, and our team is currently working to ensure we can deliver this. Next quarter, we will provide an update on our work. And at the start of next year, we will provide our official 2022 revenue guidance**.  \n&gt;  \n&gt;I will say, our client revenue will continue to grow. Although PCIe Gen3 next year growth rate will be modestly, but PCIe Gen will grow very strong to carry because we have a very large design share in PC OEM. We stated almost 50% higher by end of the next year so that we have eight different customer, five on NAND maker with our PCIe Gen4 controller and ramping next year. For eMMC+UFS, we also will grow very, very strongly. It also depends how many wafer we can secure.  \n&gt;  \n&gt;We say it's going not to grow for a certain level, **we guarantee is exceed the $1 billion of revenue next year**. But we think the backlog will continue to pile up by end of this year. But we'll continue to work very hard to secure more wafer, especially in mature technology because many eMMC are in 55, 40-nanometer and 28 meter, these mature technology wafer are in severe allocation from all foundry makers. So this is very critical, how fast we can porting, work with TSMC as well as other foundry that can grow overall the eMMC+UFS business.\n\n&amp;#x200B;\n\nThis guidance was confirmed on SIMO's [Q3 2021 earnings call](https://www.fool.com/earnings/call-transcripts/2021/10/28/silicon-motion-technology-corporation-simo-q3-2021/):\n\n&gt; In the third quarter, sales and earnings reached another quarterly company record. **Revenue grew 15% sequentially and over 100% year-over-year to $254 million**  \n&gt;  \n&gt;We expect this situation of demanding excess of supply to continue through next year since foundry capacity will likely only start improving in 2023. Our order book remains strong and continues to be well in excess of $1.5 billion for next year.   \n&gt;  \n&gt;**In the third quarter, we delivered $1 billion in revenue run rate a quarter ahead of when we had previously communicated and expect our revenue run rate to increase further in the fourth quarter** as we focus on managing our product mix, customer allocation and pricing. We have already received foundry wafer allocation for 2022. **That is incremental to what we have this year, and we are confident we can grow ourselves next year toward our $1.5 billion order book.**  \n&gt;  \n&gt;I think based on the third quarter revenue and fourth quarter guidance, we are ready at a $1 billion sale revenue rate with our current wafer supply. We have already received foundry wafer allocation for 2022 as we state. **That's incremental to what we have this year, and we are confident we can grow our sales next year to around $1.5 billion.** We believe the demand will continue to exceed supply next year, but I think we definitely will continue to negotiate and discover TSMC to gain more wafer supply. Regarding the $1.5 billion backlog, I think we -- **our backlog remained very solid with the purchase order of 2022, continued to be well in excess of $1.5 billion**. Most of the backlog consists SSD and eMMC+UFS controller order \\[Indecipherable\\] 23:35. An OEM order is strong because our customers have been gaining share, and we have been gaining share of \\[Indecipherable\\] 23:41 as these customers. We believe we have secured about 50% of all PC OEM and PCIe Gen four socket for next year. But we have seen, however, some adjustment in our order book with the softening of order for channel market product and strengthening our product for OEM customer. For example, we are seeing demand for SSD by global PC OEM continue to strengthen, our current client SSD for retail market, especially in China, softening. \n\n&amp;#x200B;\n\nI repeat: management guarantees that revenue will exceed $1B in 2022.\n\nNow what do the anal(ysts) think?\n\n&amp;#x200B;\n\n\\-----\n\n**Analyst Estimates**\n\n* Morgan Stanley research: price target of $78 with only $1B of revenue modelled in 2022 / 2023\n\nhttps://preview.redd.it/zq7z1bccey281.png?width=473&amp;format=png&amp;auto=webp&amp;s=8fe6bf8cde6597ea7db096112c377fa7771dd3c3\n\n* Bank of America research: price target of $80 with only \\~$850M of revenue modelled in 2022 / 2023\n\nhttps://preview.redd.it/ia6skvysey281.png?width=502&amp;format=png&amp;auto=webp&amp;s=f326906c0291c5bf0a9323ae7a3f7a1ecb52418b\n\nNeedham is the only analyst properly reflecting $1.5B of revenue in 2022. Key points from Needham's Oct. 28 research report:\n\n* \"$1BN In the Bag, $1.5BN In the Cards - Stock Doesn't Reflect This At All\"\n* **Price Target: $115.00**\n\n&amp;#x200B;\n\n\\-----\n\n**Recommendation**\n\nI recommend you hold shares or calls with 3-6+ months to expiry.\n\nShort term catalysts:\n\n* Nov. 30: SIMO @ the 2021 Wells Fargo Virtual TMT Summit\n* Dec. 2: SIMO @ the Credit Suisse 25th Annual Technology Conference\n* Feb. 2022: SIMO reports Q4 2021 earnings\n\n Position: I hold $70 June 2022 calls.",
        "subreddit": "wallstreetbets",
        "title": "$SIMO DD: an undervalued play in computer memory with short-term catalysts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6isiq/simo_dd_an_undervalued_play_in_computer_memory/",
        "created": 1638405115.0
    }
]