[
    {
        "author": "ZhangtheGreat",
        "created_utc": 1621386045,
        "id": "nfrmgh",
        "num_comments": 675,
        "num_crossposts": 0,
        "selftext": "I’m new to investing, and like any new investor (except for the ones who are super lucky beyond comprehension), I knew I was bound to make a few poor purchases here and there, even with all the research I did before I made my first purchase. So far, there are only three buys I regret:\n\n3) INTC - This has turned out to be a surprise disappointment at this time. In my pre-entry research, Intel had a reputation for being a safe, reliable company that would continue to steadily climb. Unfortunately, after about two days of small gains, Intel has done nothing but tumble. Still, I’m optimistic for its long term because it’s Intel, so I’m holding it.\n\n2) MRNA - Chalk this one up to bad luck. I bought Moderna to chase its earnings report, but the timing couldn’t have been worse: I got in literally MINUTES before the Biden administration announced that the US wouldn’t protect COVID vaccine patents. In a snap, MRNA tumbled 20 points, and to add insult to injury, its earnings report disappointed. Thankfully, it’s only 5 shares, but I’m stuck holding them until MRNA can climb back to 178 again.\n\n1) TSLA - Chalk this one up to being a total n00b. I bought TSLA on my 5th day in the market. I only had enough for one share, but I had to have it. Tesla had been surging for two straight days, and it looked poised to surge again for a third. I was thinking “easy $15 at least.” It turns out I wound up buying it at its peak. Since then, my one share of TSLA has tumbled $200, and with its unpredictability, who knows what direction it’s headed in? My stubbornness refuses to cut this loss, and a balanced portfolio that is gaining more than losing is allowing me to hold this share with the blind belief that it’ll see 800 again.",
        "subreddit": "stocks",
        "title": "Worst buys you’ve made this year so far",
        "url": "https://www.reddit.com/r/stocks/comments/nfrmgh/worst_buys_youve_made_this_year_so_far/",
        "created": 1621414845.0
    },
    {
        "author": "FilayJ",
        "created_utc": 1622477061,
        "id": "np6tf9",
        "num_comments": 246,
        "num_crossposts": 0,
        "selftext": "Past 2 weeks $AMD has been betting on themselves with confidence. They announced a $4B buyback and today at 10PM they are announcing other new products such as 3nm and 5nm chips. Intel states their demand is low but that seems to be from AMD eating up at their market share because AMD's forward outlook is always progressing. \n\nLooking at the chart,  breaking out of $81 you can easily see $85-$88+. \n\nhttps://www.cnbc.com/2021/05/30/wall-street-analysts-say-buy-stocks-deere-advanced-micro-devices.html\n\nhttps://www.amd.com/en/events/computex\n\nWatch at 10PM Est tonight 3/31",
        "subreddit": "wallstreetbets",
        "title": "$AMD finally breaking out",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/np6tf9/amd_finally_breaking_out/",
        "created": 1622505861.0
    },
    {
        "author": "stormpimple",
        "created_utc": 1622236890,
        "id": "nn7zx6",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "Intel is possibly the only chip maker that's fairly or under valued atm, amd is making 800m free cash flow a year and worth 90b, nvidia makes 4.3b and valued at 348b (insane) and intel has 15b free cash flow and valued at 218b, regardless of what your personal favourite brand/company is for making chips, intel is the clear winner financially and price wise. It also pays a dividend which means little but it's a bonus for what is a growing company numbers wise. I would also add I love dell and is a personal favourite stock to buy Atm but as they are not a chip maker doesn't really fit in here",
        "subreddit": "investing",
        "title": "Intel is over looked by AMD hype",
        "url": "https://www.reddit.com/r/investing/comments/nn7zx6/intel_is_over_looked_by_amd_hype/",
        "created": 1622265690.0
    },
    {
        "author": "darkfiber-",
        "created_utc": 1620142071,
        "id": "n4r47g",
        "num_comments": 155,
        "num_crossposts": 0,
        "selftext": "I read long and boring white papers from really smart people so you apes don't have to. Here's the gist.\n\n**Background:** AMD expected 37% growth this year but in Q1 revised it to 50% growth. Meanwhile, Intel expects -1% growth. Analysts continually upgrade AMD to Buy increasing price targets. The current medium target is $106 with a high of $135, the stock is at $77. Why is it so low and not moving?\n\n**Merger Arbitrage:** In October of last year AMD announced it was acquiring XLNX in an all-stock fixed ratio deal. That is, 1.72 shares of AMD for every 1 share of XLNX. This action immediately kicks off hedge fund arbitrageurs to do their thing. For the smooth brainers, Arbitrage is the trading of the same asset on different mediums to profit from the difference (I had to look it up too). \n\nAfter merger announcement, XLNX jumped to a share ratio of \\~1.55, about 10% off of the 1.72 final merger price. The 10% difference is there because of the possibility the deal will not actually close. Arbitrageurs aim to profit from this difference.\n\n&amp;#x200B;\n\n[https:\\/\\/public.tableau.com\\/profile\\/upndown#!\\/vizhome\\/XilinxAMDSharePriceRatio\\_16114624177710\\/XilinxAMDSharePriceRatio](https://preview.redd.it/wvsnql2p64x61.png?width=1184&amp;format=png&amp;auto=webp&amp;s=21b19380ad8d798a8e2c8c6d8736d97714c553cd)\n\nIn an all-stock fixed ratio merger, the hedge fund playbook is to short sell the acquiring stock, AMD, and buy the stock being acquired, XLNX. For example, they will short 1M AMD stock and buy 580k XLNX stock. They will then hold these positions until the acquisition closes, where the 580k XLNX turns into 1M AMD and then they cover their short position, pocketing the 10% price difference. So long as the deal goes through, the profits are locked in and guaranteed with this strategy, no matter how the market moves.\n\n&amp;#x200B;\n\n[https:\\/\\/papers.ssrn.com\\/sol3\\/papers.cfm?abstract\\_id=2230048](https://preview.redd.it/gi31myc384x61.png?width=640&amp;format=png&amp;auto=webp&amp;s=46b1036b008d8c9fea2f74996f7e3c5cf70410e2)\n\nWhat sucks about this is that all the short selling always causes the acquirer stock to go down. That's what's happening to AMD. AMD's daily volume is \\~50M with 20% of it being short selling. Hedge funds know people like AMD so they can play another game on top of the arbitrage which is to shoot for Max Pain. Not to be confused with the awesome video game series. Max Pain is when they can get the price of a stock to the point where the most option holders lose the most money. Meaning no matter if you bought calls or puts, you lose, they win. \n\nSo how does one win? I wouldn't recommend doing what they do because there's the potential for unlimited loss if the merger falls through. But once the merger is complete, the short selling stops and the stock normalizes. In the case of AMD, normal is 25% above the current price, that's going to be a huge jump.\n\n&amp;#x200B;\n\n[https:\\/\\/papers.ssrn.com\\/sol3\\/papers.cfm?abstract\\_id=2230048](https://preview.redd.it/xijh87hfb4x61.png?width=640&amp;format=png&amp;auto=webp&amp;s=cc144da8bbba46b37ddb59f18d306bbad6104599)\n\nI think the safe play would be to buy XLNX stock, so one gets the \\~10% discount, and buy LEAPS on AMD (long calls expiring after the merger). \n\nFor example, if one buys AMD calls at a $80 strike expiring in June 2022 for $12, if the stock were to merely normalize to $106 at the end of the year after the merger, the options would be worth $26, an easy 110% profit.\n\nThe other, more riskier option, is to buy AMD options expiring throughout the year, hoping the negative pressure of the short selling arbitrage stops before the merger. This can happen if XLNX shares get too close to the 1.72 ratio, then arbitrage doesn't work and the short selling stops which will push AMD higher. Or if AMD shares jump huge suddenly, which can happen on some amazing news, or if AMD decides to offer dividend payments, or especially if the deal falls through, which will force hedge funds to cover early, thus pushing the stock even higher all at once, to the moon.\n\nEither way, this negative pressure from arbitrage short selling has an end date. The fundamentals are so good, one could bet on it.\n\nDisclaimer: This is not financial advice. I don't really know what I'm doing. But I like the stock.  \nPositions: I'm doing both strategies and own AMD shares and call options spread across this year and next year. I also own XLNX shares.",
        "subreddit": "wallstreetbets",
        "title": "AMD: An explanation on merger arbitrage and how to play it for big gains",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n4r47g/amd_an_explanation_on_merger_arbitrage_and_how_to/",
        "created": 1620170871.0
    },
    {
        "author": "d4v1d87",
        "created_utc": 1621793839,
        "id": "njdkpf",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "Which one between TSM, INTC or Samsung electronics could be the better investment in semiconductors? Currently, TSM is the leader in the sector which a market share of 80% and they announced an investment of 100 billion for increase their production capacity; I have read they invented a new nanochip and their know how give them an advantage of years compared to competitors; TSM stocks raised more than 1000% in the last 20 years. Intel and Samsung are investing in USA because they want to decrease their addiction of semiconductor from China. Which one of these can be a good long term investment?",
        "subreddit": "stocks",
        "title": "TSM, INTC or Samsung electronics?",
        "url": "https://www.reddit.com/r/stocks/comments/njdkpf/tsm_intc_or_samsung_electronics/",
        "created": 1621822639.0
    },
    {
        "author": "current-asscoverer",
        "created_utc": 1620072470,
        "id": "n45xj8",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "Intel has risen on news that it will spend $20B on establishing chip manufacturing factories in Arizona, but this news is more bearish than bullish to me.\n\nInvesting in Intel now, is nonsensical once you consider the full situation. I reiterate my bearish position on Intel and recommend a diagonal put play.\n\nI’ve more-or-less officially been an Intel bear for a few months now. As of late, many have asked me whether I am changing my stance on Intel due to its $20B manufacturing facility (FAB) production project. As much as I would love to reverse directions and proclaim myself a born-again Intel bull, I must objectively call Intel’s announcement as another bearish catalyst. In light of this news, I am happy to double down. Today, I will explain my viewpoint.\n\n*The Fab Ahab:*\n\nAhab was the seventh king of Israel. He inherited a powerful kingdom but was eventually brought down due to his own vices and not upholding his responsibilities. Many consider Ahab to be Israel’s worst king.\n\nIntel shares many similarities with Ahab. The company easily dominated the chip kingdom with its x86 IP, but this made Intel a bit too complacent: Easy money from x86 led the company to focus more on maintaining the status quo than moving the foundry market forward. In its comfort, Intel has lost its partnership with Apple (AAPL), who has successfully developed M1, a chip much more efficient than the previously used Intel x86 chips; failed to keep up with the shrinking node trends, currently struggling to produce 10nm chips while others are working on 3nm; and has even been overtaken by AMD, which long sat in Intel’s giant shadow. Intel’s story – to me – looks like a downfall story in the making.\n\nIntel finally sees the need to fight back, and the two fabs in Arizona, due 2024, at the cost of $20B is the latest strategy. However, it is a risky strategy. Adding fabs to the business is not just a one-time cost of the $20B but requires consistent upkeep and upgrade costs, something more like $20B per year, which, over the coming decade, would be more than Intel’s total current equity. Intel is thus further adding operational costs to its business during a time when the company is expected to see shrinking revenue and earnings. Typically, the responsible reaction to such earnings decay is to cut down on costs. Intel would seemingly rather throw Hail Marys.\n\n*Hail Mary:*\n\nI call the fab announcement a Hail Mary not because adding fabs is inherently a bad idea but because Intel seems to have little time remaining on the clock to benefit from this action before it finds itself well behind its competitors. Intel should have built fabs years ago when it was still the market leader and still growing earnings. Intel could have become the go-to chip manufacturer in the US, but now it faces an uphill battle in light of how strong Taiwan Semiconductor Manufacturing Company (NYSE:TSM) and Samsung (OTC:SSNLF) have grown over the past decade.\n\nAt roughly the same time as Intel’s announcement to build fabs in Arizona, TSMC (henceforth TSM) announced its own fab construction in Arizona. Clearly, there is a rush to build fabs in the US, and the reason, too, is clear: China. The US reliance on Taiwanese fabs combined with increasing concerns over a Chinese invasion of Taiwan means that the US would love a modern fab stateside. That is, Intel’s decision to create fabs at this time was not decided in a vacuum; instead of the decision being a business-focused decision, it is a situation-focused decision – a decision of convenience rather than one for the sake of shareholders.\n\n*Intel’s Fab Focus In Question:*\n\nIntel could be attempting to cozy up to the US government with its new fabs. The Department of Defense certainly wants some fabs stateside as China’s shadow grows over Taiwan. Intel might be playing the Tesla (TSLA) game by looking for taxpayers to help subsidize its business, gaining a novel edge over AMD.\n\nIn any case, I don’t see the news fabs to be transformative for Intel in the positive sense. If Intel is really going all-in on fabs, we will need many years before we see a significant payoff. Investing in INTC now, during a time of nose-bleed tech valuations and during earnings contractions is not a smart investment decision.\n\nAnd if Intel is looking for government subsidies by being the main US chip manufacturer, this is essentially a white flag; Intel cannot compete in the game of technological advancements and needs a handicap. This is not Tesla being subsidized as it forays into a fledgling industry but an old, stubborn company attempting to stay afloat via means outside its own merits. You would be better off investing in AMD or TSMC if you want exposure in US chip design or manufacturing.\n\nOverall, I reiterate my bearish outlook on Intel relative to the rest of the chip industry. The upward momentum in Intel and its current price are not sustainable by the news: The fabs and other aspects I’ve mentioned in previous articles are perceived as bullish while they are in fact bearish.",
        "subreddit": "wallstreetbets",
        "title": "Why You Should Short The Intel Fab Play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n45xj8/why_you_should_short_the_intel_fab_play/",
        "created": 1620101270.0
    },
    {
        "author": "henrylondon1988",
        "created_utc": 1622369014,
        "id": "no814a",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "I am a new stock investor and invest heavily in semi industry. Among all my investment, Intel is the 2nd biggest position. The biggest is Nvidia, which is performing well. Intel on the other hand has lost around 8% since Feb 2021. I did double down and bought some more last week and it went up by 2%.\n\nI would like hear the opions from the others to see what I am missing about Intel.\n\nHere is what I like about Intel:\n\n1, Low P/E ratio, only 12.5 and industry average is 25. So Intel is fairly undervalued.\n\n2, Intel is the only major chip maker in the US that manufactor its own chips. Chip self-sufficiency is a major initiative of Biden adminstration and has garnered support across both parties. So there will be a lot of favourable policiy to help Intel.\n\n3, Intel still enjoys a strong position in CPU market, despite Apple M1 chips and resugency of AMD. Intel is still having the lion share of the market and can deliver their chips faster due to they own the fabs.\n\n4, I believe market mispriced Intel and underestimated the potential of Intel. Similar to Facebook, Intel have had bad reputation, a lot of it is to Intels own doing, but I feel it is overblown. The talk of Intel losing share to Nvidia and AMD is bit exaggerated in my opinion.\n\nSo my game plan is: I dont have more money to invest in intel. I have around 5000 dollar shares in Amazon and Apple, I plan to sell them and buy Intel if the prices keep falling. Any suggestions and feedback is very appreciated.",
        "subreddit": "investing",
        "title": "Intel stock falls, should I double down or sell",
        "url": "https://www.reddit.com/r/investing/comments/no814a/intel_stock_falls_should_i_double_down_or_sell/",
        "created": 1622397814.0
    },
    {
        "author": "ChaosKeeshond",
        "created_utc": 1621328056,
        "id": "nf5m0v",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "I could have just written a comment in the other thread which is blowing up rn, but it seems like everyone is getting incredibly excited over something which doesn't hold up. I'm all for loss porn, but guys please don't go all Kony 2012 hypetrain on me.\n\nGlacier Capital exists. That sentence isn't going to make me any friends, but your wallet needs to hear it. They've even written some insightful pieces which panned out as per the analyses; CVNA (link below) performed well in the short-term as predicted, but the majority shareholder and CEO sold practically all of his shares four days ago, al in line with their poor long-term outlook.\n\n[http://glaciercapital.lu/wp-content/uploads/2019/11/This-Time-is-not-Different-LP-August-2019.pdf](http://glaciercapital.lu/wp-content/uploads/2019/11/This-Time-is-not-Different-LP-August-2019.pdf)\n\nA lot of the theorising focuses on the founding year of the company. Look... the profile on Bloomberg is for a different Glacier Capital LLC. There appear to be quite a few Glacier Capital LLCs. In the US, LLC names are not unique on a federal level. Unrelated companies in different states can have exactly the same name.\n\nWhen we consider that the CEO of *the* Glacier Capital was still a university student in 2005, we can safely conclude this isn't a smoking gun and it's likely we're tripping up over unrelated companies.\n\nA dodgy SSL certificate doesn't mean the site is new either, nor does an inconclusive WHOIS lookup.\n\nRefer to this uploaded 'fact sheet' from their website 2017 which was cached by the WayBackMachine (an independent third party archiving service which does not exist to dupe diamond-handed apes on Reddit) and note the date it was set up:\n\n[https://web.archive.org/web/20171222042348/http://glaciercapital.lu/wp-content/uploads/2017/09/FINISHED-GC-Fact-Sheet.pdf](https://web.archive.org/web/20171222042348/http://glaciercapital.lu/wp-content/uploads/2017/09/FINISHED-GC-Fact-Sheet.pdf)\n\nThis tallies up with his most recent university course completion date, as visible on this business intel provider's free preview page:\n\n[https://rocketreach.co/marc-francois-daubenfeld-email\\_118042699](https://rocketreach.co/marc-francois-daubenfeld-email_118042699)\n\nIf you don't trust *their* self-reported creation date as cached in the web archive, maybe these third party sources will help:\n\n[https://opencorporates.com/companies/lu/B212426](https://opencorporates.com/companies/lu/B212426)\n\n[https://searchentities.apps.cssf.lu/search-entities/entite/details/2620136](https://searchentities.apps.cssf.lu/search-entities/entite/details/2620136)\n\nWhat does this mean for the short. Is it a bluff? Are billionaires phoning each other and bribing journos to falsify the existence of hedge funds? Idk, I'm just a sleep-deprived dickhead on stimmies who is concerned that someone on his second sunrise in one sleep cycle is exercising more calm and reason than people with 100x my net worth.\n\nBut go on, let's have a crack at this.\n\n[https://lei.report/LEI/984500BB91F55397AC42](https://lei.report/LEI/984500BB91F55397AC42)\n\nLook at the dates. When the whole GME surge was first kicking off, Glacier Capital filed to register for a 'Legal Entity Identifier' (LEI) in order to comply with 'Markets in Financial Instruments Directive II' (MiFID II), which was a tightening of regulations within the EU in 2008. LEIs are required in order to comply with MiFID II, and MiFID II needs to be complied with in order to carry out certain high risk activities, including forms/scales of derivatives.\n\n[https://www.esma.europa.eu/sites/default/files/library/esma70-145-238\\_lei\\_briefing\\_note.pdf](https://www.esma.europa.eu/sites/default/files/library/esma70-145-238_lei_briefing_note.pdf)\n\nI am not a European financial services lawyer but considering the timing of everything, it seems reasonable to assume that the short positions may be real - and if new certs were put in place just for one series of positions, then it isn't crazy to think they might be especially large.\n\nAgain, *I am not saying* that this isn't an incestuous industry or that the capital isn't coming from known players. I am specifically begging you not to be a fucking dumbfuck because of one Reddit-cum-Sherlock post so that whatever dumbass decision you make next is at least a little less erratic. I've been holding since January, I'm not telling you not to buy GME, this is not FUD. Just don't be allergic to facts. Know your risks.",
        "subreddit": "wallstreetbets",
        "title": "\"Glacier Capital\" DOES exist. Buy because you like the stock, not because of conspiracy theories held together with ducktape.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nf5m0v/glacier_capital_does_exist_buy_because_you_like/",
        "created": 1621356856.0
    },
    {
        "author": "AngeloMonharti",
        "created_utc": 1621530718,
        "id": "nh5tbi",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "I have done so much DD on this play and I really want to share it with you guys since WSB is the reason I started investing over a year ago.\n\nIn this post I'm going to not talk about some kind of currency that can get this post removed. Hint: it crashed big time yesterday. You know the one.\n\nThere is a new kind of this currency that uses a lot of computer storage space. How much? Well - 7 EXABYTES and it's currently adding 1 exabyte every 3 days. I'm going to assume you know about this currency and if not you can look through my post history and see which subreddit I've posted to recently involving this particular one.\n\n#Topics of discussion:\n\n* Why WDC is going to moon in the next 2-12 weeks\n\n* WDC Fundamentals\n\n* Bear case\n\n#If you are reading this on May 20th - you are early\n\nWDC just came off one of their best earnings beats in recent memory. WDC was a beaten-down stock in 2018 after NAND (SSD memory) prices declined, and analysts thought that HDDs (spinning disk hard drives) were going the way of the dinosaur. WDC did see a big increase in data center sales and consumer devices (think external drives for work from home setups) during Covid, but analysts priced in declining sales in 2021 as covid restrictions begin to end. By all accounts, it looked like WDC had no future growth prospects and should be some kind of dividend-yielding boomer stock. WDC reported earnings in April for the quarter ended March 31 - with revenues down only 1% compared to the 20% that analysts expected. The EPS was way higher than expected - non-gaap was expected to be around 0.68, and WDC delivered 1.02. The analysts are already wrong and they don't know what else is coming: The new currency thing that I won't name. They didn't even mention it in the earnings call. None of the investors on the line in the Q&amp;A even asked about it. It's totally under the radar. In the next quarter, WDC is going to deliver their biggest earnings beat ever, and they are going to raise their revenue guidance for the rest of the year as a result, possibly by a gigantic, unheard of margin due to the new demand caused by the currency. When this happens, this stock is going to test its ATHs at around $110 per share but I would not be surprised to see a new ATH far above anything in the past. This stock can double, and it's going to happen AT THE LATEST during WDC's next earnings call. This is expected first week of August. \n\n#Fundamentals\n\nWDC is an American company, they have been publicly traded since 1973 and they have been part of the S&amp;P 500 index since 2009. This is a solid company - we are not betting on dog shit turning to gold, we are betting on gold turning to diamond. WDC has like 64k employees, and is vertically integrated in HDDs and SDDs thanks to a long road of acquisitions like SanDisk in 2016. They own their own supply chain, so they can make bigger margins in the event of the inevitable price increases reminiscent of the GPU market thanks to another currency.\n\nWDC is close to fairly valued at the moment at about $70 per share. They saw some spikes to 75+ recently after earnings but it keeps selling off due to WDC suspending their dividend and boomers wanting out, plus S&amp;P indexes falling and selling off here and there. Suspending the dividend is MAJOR good news. This company has been stagnant for a while, but they are ready to expand. They want to be a growth company again, and they are going to get it when they realize increased HDD and SSD demand is here to stay.\n\n#The new reality is not priced in: WDC's TAM market just increased 50% and nobody knows about it\n\nAn industry expert at Forbes, Tom Coughlin, has estimated that WDC shipped 125 exabytes of HDD storage for Q1 2021. Next quarter, they are expected to ship around the same amount. WDC says there is seasonality but I really don't see it in the numbers. WDC owns somewhere about 35-40% of the HDD market, and around 17% of the SSD market.\n\nThe new currency is currently at 7 exabytes and consumes around 300+ petabytes daily at this point. Even after yesterday's events, the profitability is so high that even if it loses 50% of it's value, it's still worth buying HDDs over MSRP. Farmers can buy HDDs at $50 per TB (double the msrp market rate before the rise) and break even in 1 month. This is unheard of in the space. That's how profitable this is. While it's hard to farm solo if you are a small time farmer, it's worth it for the whales and the whales will eat HDDs until a 8TB drive goes for $400. WDC and Seagate are selling every drive they they can possibly make. If we apply WDC's market share to the current size of the network, we are looking at, conservatively, 2.5 exabytes of extra sales that is not expected or accounted for. \n\nLet's look at it another way - with 125 exabytes shipped in Q1, 90 days, that means WDC ships 1.38 exabytes daily. Half of this goes to datacenter clients in long-term contracts, so say 700 petabytes daily. If the new currency is growing at 300 petabytes daily, and 40% of those drives are WDC, that's an extra 17% more demand than anyone so far knows about. If that doesn't seem like a lot, it's because it's massively understated and not nearly as high as it is in reality.\n\nThe network space is a lagging indicator. People buy hard drives ahead of time, and fill them with plots over time. Plotting speed is the bottleneck. Behind that 7 exabytes of networks space is likely 7 exabytes empty space already purchased, waiting to be consumed, or even more. And its not only farmers buying drives - scalpers are buying drives to scalp the farmers too. Go look on amazon and tell me how many drives you see in stock that are bigger than 6 TB. They are sold out. Supply is also a bottleneck - the new currency would grow even faster if they could buy even more storage. For all intents and purposes, that 700 petabytes of storage provided to consumers daily is almost all consumed by currency farmers. If they could deliver double the storage to consumers, at 1.4 exabytes per day, they would probably still sell all of them.\n\nBut wait - there's more.\n\nWDC also makes SSDs, and Seagate does not (Seagate has 0.2% marketshare of SSDs). I didn't think the new currency would have much affect on the SSD market since the are needed in far smaller quantities than HDDs, and the go-to has mostly been enterprise drives by Intel and Samsung rather than WDC. But I was wrong. Just this morning, I was making my rounds on Amazon and noticed that WD SN750s 1TBs are almost out of stock, there are only 2 available. SN750 2TBs are out of stock. SN 850s are sold out. I'll go into why this is significant.\n\nA company called Phison makes SSD controllers. They recently said they are raising their prices 10% due to supply constraints as the new currency has driven up SSD demand. This is a big indicator that the SSD demand is actually super high. You know those SN drives I talked about earlier almost being out of stock? Yeah, WDC makes their own controllers for those. They don't need Phison. If other manufacturers have to buy more expensive controllers, WDC can just raise their prices and make that profit themselves. SSD demand is certainly less than HDD and it's lagging behind HDD, but an NVME SSD drive shortage could be right around the corner. The new currency is very intensive on the SSDs and they are destroyed quickly, so buying NVMEs are not one-time purchases, they are like the gas the fuels the car. They will need to be purchased as more and more HDDs are purchased continually.\n\n#Bear case\n\nNobody likes bears so I will address the risks quickly. The obvious risk is that the new currency is over priced and will either die out completely or crash to the point people will stop buying HDDs and the demand will only be a momentary spike in the rear view. I strongly do not believe this is the case and I think yesterday is a good test that shows that even under extreme pressure, the new currency is well positioned and strong. It's not going to 0 because of a market crash. I can go far into detail into why I believe this new currency is here to stay, and the demand will persist for potentially years, but I would have to say enough words that I think this post will just be removed.\n\nThe second risk is that NAND flash memory continues to decline in price. Since the pandemic the price has gone up, as datacenters are forced to expand, but I think the effects of the pandemic are not going to end any time soon and in fact that there will be no return to normal at all. I believe work from home is just going to be part of the future regardless of covid, which means more network and more servers and more data is going to be needed. I think the analyst expectation that revenue would collapse in 2021 as the pandemic ends and being surprised that it at least remained flat is going to be wind in WDC's sails even apart from the new currency's affects.\n\nThe third risk is management not dealing with the new currency demand well. If they are really bearish on the currency, they may not raise supply enough to capitalize on the increased demand. They may think the demand is temporary and they will be left with oversupply if they ramp now. David Goeckeler became CEO of WDC last year and he's got a background in tech of course, but more specifically in Cisco. He is known for transformational leadership and I think that shows with his decision to suspend the WDC dividend. If he is looking to transform WDC, I think this is the perfect opportunity for him. \n\n#Summary TL;DR\n\nHDD demand has sold out everything there is to sell out. Price increases are imminent, and SSDs could follow soon. All of this is due to a new currency that uses HDDs and SSDs, which is currently so profitable that whales will continue to buy them even at 30, 50 or 100% premiums. None of this was accounted for in WDC's most recent earnings call, and the price has not reacted to it yet. This thing is a ticking time bomb. WDC was already on track to a better than expected 2021 and this will launch it to interstellar space.\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀Positions🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n[157 shares (Canadians unite!)](https://i.imgur.com/6y4p3ax.jpg)\n\n[1 leap Jan '23 70c](https://i.imgur.com/SAqvMhA.jpg)\n\nI believe that this trend is lasting all year and we are going to $150+. If you want to make a short term play and go balls deep I recommend July or October calls for 80-90c. If WDC's next earnings are the catalyst, the July calls may not be the best value, but there is a pretty good chance that the market will wake up and see that WDC is killing it well before the first week of August. If you are a real smooth brain ape, you can't go wrong with shares. There is virtually no downside risk, WDC was already turning heads this year even without the new currency. STONKS ONLY GO UP",
        "subreddit": "wallstreetbets",
        "title": "Western Digital Corp ($WDC) DD - Why 2021 is going to be their best year ever and nobody knows about it yet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nh5tbi/western_digital_corp_wdc_dd_why_2021_is_going_to/",
        "created": 1621559518.0
    },
    {
        "author": "Radish-Perfect",
        "created_utc": 1619894655,
        "id": "n2ojmq",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "What if I told you that Qualcomm, Intel, Skyworks, Texas Instruments, Samsung, and Analog devices all had something in common in their supply chain? They all buy their testing capital equipment from Cohu. \n\nCohu offers a few different products. All of them are within the market of testing computer chips. Why is this market important? Well on the customer end, imagine if you spent 2500$ on a laptop and the intel chip inside didn't work. You'd return it to BestBuy, who would return it to HP, who would return it to Intel. A long and expensive chain of returns for a nonfunctional product. This issue can also be more than just an inconvenience. What if you bought a self driving tesla and one of the chips in the sensors didn't work? What if a Boeing airbus had some faulty chips in the navigation system? In short, it's very important that the semi manufacturers know that their product is working when they send it out. \n\n**Bullish trends**\n\n1. Semiconductor volume is increasing in the following industries, **mobile phones** (5g needs 2x the chips), **Computing**, **Automotive** (electric and self driving need exponentially more chips than cars of the past), **Cloud computing** (basically a warehouse of semiconductors) **AI** (not sure how this works, but it's going to need computer chips). Here's my main argument: ***Each of those markets is rapidly growing, and at the same time chip volume is rising in each of those markets***. This creates a sort of exponential effect for the semiconductor chain. Not only is there a strong catalyst from increasing volume in existing markets (phones, pcs), but we also see rapidly growing new markets that also have high density. (cloud, auto). This is very bullish for the entire semi supply chain.  But the key feature that benefits testing in particular, is increasing complexity of chips. A more complex chip requires more complex testing, which demands a higher premium. \n2. Semiconductor shortage. We all know demand for computer chips is very high. And supply has just about run out. This means that prices for semiconductors should increase due to scarcity. This is great news for Cohu, as it leaves more margin to charge for testing. If you were ford would you pay a premium on chips in order to produce your vehicles?\n3. Increasing chip complexity, on smaller wafers, demands a higher price for testing. AMAT recently noted on April 6th analyst day that capital intensity (% revenue spent on capital equipment) is returning to the 2000 highs of 16%. This increased capital intensity seems especially true when we consider the global chip shortage. Intel and Nvidia are opening new fabs in the last couple months. These factories are going to require a shit-ton of capital equipment. For example TSMC announced they'll be spending $100 billion over the next 3 years on capital equipment, as their fabs have been running at 100% for months and still can't keep up with demand.\n4. Trend of strong growth. Cohu has shown strong growth in the last year. In Q1 2020, revenue was $138.9 million, and gross margin was 41.7%. Q1 2021 revenue was just reported at $225.1 million, and gross margin was 45.6%. This is annual revenue growth of 62%, and margin growth of 9%. Business outlook in only getting better as the semiconductor shortage worsens, and demand continues to grow across sectors.\n5. Very high accounts receivable. Accounts receivable is up 30% annually to 197 million$. Recurring customers represent 48% of Cohu's revenue, so this is a very strong sign in my opinion. \n\n**Bearish trends**\n\n1. The company is on a huge downturn in the last few trading days due to announcing 42-45% gross margin for Q2 instead of 45%+, like Q1. This is on increased revenue of 234-250 million forecasted for Q2. A decrease in GM on growing revenue is never a great sign. The reason for this change is that much of the forecasted growth is in the automotive segment, which is lower margin than other segments I mentioned in the last section. Essentially the chips in cars aren't as complicated as the chips in PCs or phones, so they are less expensive, and therefore have a lower margin for testing. I will point out that the firm is likely to generate more gross margin dollars next quarter than this quarter, albeit on lower gm %. (.43x240=$103.2 gm, vs this last quarter 225x.456=$102.6gm). \n2. Recent stock offering. Cohu sold 4,950,000 shares at 41$ at the start of march. This diluted the shares available, but raised $202 million for the firm. They used this to pay off debt, and fund future growth. \n3. strong competition. Cohu's main competitors are advantest, and teradyne. These are two large global firms that have significantly more financial resources than Cohu. Cohu does have some advantages over these strong competitors, it's the global leader in Radio frequency power amplifier. RF amplifiers are a key component in mobile phones, and are increasing in volume with the 5g rollout. (more chips per phone, and more complexity) Essentially Cohu is in the dominant position in this growing market. Cohu is also the leader in automotive handling. (handling is a process where chips are moved into the testing device, then sorted based on results).\n\n**Fundamental analysis**\n\nI use a ratio similar to p/e. I use gross margin/market cap. (If I was buying the whole company, I'd want to know how much profit I'm purchasing, I don't like p/e because it can be manipulated by the # of shares issued).\n\nCohu annual gm=$316,000,000. Cohu market cap=$1,925,000,000\n\n$316 million/$1925 million=6.09\n\nThis is a very attractive price/gm ratio. Lets compare it to some other companies ratios. \n\nCohu-6.09\n\naapl-19.12\n\namzn-18\n\nter-11.3\n\nadvantest-7.19\n\nswks-17.9\n\nIf cohu were trading at the same multiplier as it's large cap competitor, Teradyne, the stock price would nearly double.\n\nTaking a look at the balance sheet, Cohu is in a much better position today than 1 year ago. They have $290 million of cash, almost double from a year ago. They also have significantly lower long term debt. \\~$200 million today versus \\~$300 million a year ago. \n\n&amp;#x200B;\n\n**Technical analysis**\n\n[Cohu 1 year chart](https://preview.redd.it/pav84wurgjw61.png?width=1504&amp;format=png&amp;auto=webp&amp;s=3d65ce5a266334b6f1c8a9cd3fb344509441451e)\n\nAs we can see from the 1 year chart above, Cohu seems to find support around the $40 mark for the past 6 months. Currently it's chillin out on the support line, so this indicates to me that it's a good time to purchase cohu, as I love buying dips. We can also see it's found resistance at around $50, having tested that line 3-4 times since the start of the year. I cannot say with certainty that it will break this resistance line, but I do expect it to at least check this number again some time in the next 2-3 months. My expected range for this stock in the next 3 months is between $50 and $65, which leaves room for some nice profit if one were to buy at $40. \n\nIn conclusion, cohu is a small cap in an extremely hot market. It's got some big competitors, but it holds certain key advantages over them. The financial position of the company is really good currently, and it's growth should continue for the foreseeable future. It's strongest catalyst is that semiconductor density is increasing in existing markets, and new markets are emerging with high density, which has the potential to create enormous growth. For this reason, I think COHU is a great choice. (Even if you disagree on Cohu, you will want to have some semiconductors in your portfolio for the next few years). \n\nDisclaimer: I'm holding call options on this company. \n\ncheers",
        "subreddit": "wallstreetbets",
        "title": "Cohu; the plug for your favorite semiconductor companies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/",
        "created": 1619923455.0
    },
    {
        "author": "Henisockle",
        "created_utc": 1620896336,
        "id": "nbc89f",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I’m still very new to investing. Wrapping up my first year. Seen around a 250% increase so far. \n\nBut I’m still discovering and learning about so many companies, good and bad. I’ve done a little digging (literally 20-30 mins) into looking into a good choice for the microchip shortage. \n\nAnd I was wondering what are some you all like or are looking at? \n\nSo far I think, Intel and $TSM seem to be the best options. TSM is one of the top semiconductor stocks. Intel is well, Intel. Been around and will be around for awhile. Only knock on Intel, is they are no longer working with Apple. But should still have an impact in supplying chips. Are there any others ones I should add to my list?",
        "subreddit": "wallstreetbets",
        "title": "Best chip shortage buy-in?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nbc89f/best_chip_shortage_buyin/",
        "created": 1620925136.0
    },
    {
        "author": "hiimdaviid",
        "created_utc": 1622318454,
        "id": "nnv59x",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Who They Are:\nEnzolytics Inc. is a Texas-based biotech company currently working on using artificial intelligence to develop affordable and effective monoclonal antibody treatments for many infectious diseases, such as HIV, rabies, influenza A and B, along with treatments for Rheumatoid arthritis and certain forms of cancer. They are also currently producing these monoclonal antibodies to treat COVID-19. They are currently at College Station in Texas A&amp;M working on these treatments.\n\nThe Team:\nCharles Cotropia (CEO): Charles Cotropia is a well-practiced lawyer, mainly specializing in intellectual property, and is the former CEO of BioClonetics Immunotherapeutics Inc before being acquired by Enzolytics.\nHarry Zhabilov (CSO and Director): Zhabilov is an experienced scientist and has experience with therapeutic proteins used to treat HIV and cancer and has several patents for these treatments.\nJoseph Cotropia, MD (Chief Medical Officer and Director): Joseph Cotropia, Charles’ brother, is well-experienced and has also worked with immunotheraputic biotechnology platforms directly related to monoclonal antibodies. He is the creator of the fully human anti-HIV monoclonal antibodies.\nGaurav Chandra, MD (Chief Operating Officer and Director) - Chandra has “extensive” experience in clinical research in Immunology and Infectious Diseases. He assists with applying the artificial intelligence to the field of biomedical therapeutic development and the company’s monoclonal antibodies.\nRonald Moss, MD (Scientific Advisor) - Moss brings experience serving in an officer position for several other biotech companies.\n\nPast Price-Action:\nAfter reaching a high of .958 in February, the stock price followed the pattern of many of the other parabolic runners in the OTC and sold off  for the weeks to come. At the time, this share price was well over the value of the company at the time as they were still in early stages in the process.\n\nHowever:\nAt the current price of .1297, there is no better stock in the OTC, without a doubt. The chart shows that a bottom has been found and the selling is finally reaching an end. \n\nWhat Makes This Stock so Great:\nEnzolytics has recently begun working with Intel, yes the Intel. Intel’s share price trades around $57 currently, and they have released a Whitepaper covering the future applications of the combination of Intel’s AI and Enzolytics’ treatments to revolutionize healthcare for infectious diseases.\n\nNow I know this sounds too good to be true, but it’s not. Recently, Clifton Roberts and Nikhil Deshpande from Intel, and Dr. Gaurav Chandra were featured on an hour-long interview by a man named James Hicks. This interview discusses the companies’ futures together and what they’re trying to accomplish and is public on YouTube, so if you don’t believe what I’m saying, you can watch and make the decision for yourself.\n\nThe Interview:\nTo summarize some of the key points and catalysts:\n-Enzolytics Clone 3 treatment demonstrated neutralization of 95% of all HIV viruses\n-Animal trials will begin next month, and they have been in talks with the FDA about expediting this\n-They have a cocktail of antibodies to target all strains and future mutations of COVID and other infectious diseases to prevent future outbreaks\n\nThere is so much to appreciate about this company, and no company in the OTC has as good a future. Intel and Enzolytics will continue to drive the treatments of infectious diseases to new levels and will carve a new path for the future of healthcare. It’s up to you whether you want to be apart of that or not.",
        "subreddit": "pennystocks",
        "title": "$ENZC - Enzolytics",
        "url": "https://www.reddit.com/r/pennystocks/comments/nnv59x/enzc_enzolytics/",
        "created": 1622347254.0
    },
    {
        "author": "LegendLarrynumero1",
        "created_utc": 1620494763,
        "id": "n7u1c0",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Positives:\n\n\nYou know this company, massive name recognition\n\nRevenues from $59B to $77B in past 5 years\n\nProfit DOUBLED from $10B to $20B in past 5 years\n\nShares outstanding decreasing!\n\nCurrent assets cover current liabilities\n\nThey have taken on more debt in past year which, with low rates, may be spur the next phase of their growth\n\nTheir industry is not going away and in very high demand\n\nFree Cash flow has gone from $12B to $21B\n\n\nNegatives:\n\nOnce a dominant player, they've slipped recently and lost their lead to competition. \n\nSeen as an older player, less advanced and ground breaking\n\nManagement shake up of recent\n\n\nSo where does that lead the stock?  \n\nUNDERVALUED!  \n\nP/E is 13\n\nP/FCF is 11\n\n\nWILD CARD:\n\nThe new CEO has a history with the company, but left for other leadership positions in the past few years.  Now he is back to LEAD and has a PLAN to bring the company back.\n\nOk, why should I believe him?\n\nYou won't get this from other Deep Dives...\n\nThe CEO grew up Amish and is very religious.  He started a organization to convert 1 Million people in silicon valley to the way of Jesus.  He has a calling in life!  He can not be seen as a loser!  His credibility is on the line!  If he brings this company back to the top, it will also bring his passion for Jesus to the front as well!  \n\nThis company is none other than...\n\nINTEL\n\nPeace out",
        "subreddit": "stocks",
        "title": "For those who keep asking for VALUE options in this market, I have the perfect one for you",
        "url": "https://www.reddit.com/r/stocks/comments/n7u1c0/for_those_who_keep_asking_for_value_options_in/",
        "created": 1620523563.0
    },
    {
        "author": "luisdanielmesa",
        "created_utc": 1622332524,
        "id": "nnz9ac",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Hi, I had luck in 2020 (the first year I went into the market with any proper amount of money). I took a €60K loan in feb. 2020, and I was able to get to around €240K by the end of the year. I took out €100K to repay the loan and finish paying a mortgate for a house I have in Mazatlán, México. I'm left with €140K.\n\nI have Realty Income, New York Mortgage Trust, AMD, Intel, Microsoft, Amazon, Good RX, Walmart and some MSCI All World ETF. I have sold all penny stocks I ever owned, and also most of the AMZN.\n\nI was wondering if I could just sell the individual shares and just buy the ETF. I'm not planning to use that money out soon, or ever. I'm happy with the dividends from the REITs, I get around €800 monthly after taxes. I make a low 6 figure salary in Europe as software developer for one of the previously mentioned companies and they also give me stock options periodically.\n\nI have no debt, and it feels weird. What would YOU do?\n\nGet in some debt, to not loose the drive?\nStay put and try FIRE?\n\nEdit: had to remove a mention to a penny stock or the bot looses its $h!7.",
        "subreddit": "stocks",
        "title": "Good luck in 2020 and what to do next.",
        "url": "https://www.reddit.com/r/stocks/comments/nnz9ac/good_luck_in_2020_and_what_to_do_next/",
        "created": 1622361324.0
    },
    {
        "author": "noveltieaccount",
        "created_utc": 1621459048,
        "id": "nghent",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "Shareholders vote NO on Intel executive compensation",
        "url": "https://sec.report/Document/0001193125-21-166587/",
        "created": 1621487848.0
    },
    {
        "author": "7LyLa",
        "created_utc": 1621298491,
        "id": "newnkq",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "The chip shortage is expected to last much longer.... Intel has addressed this issue by building several mega plants to produce more chips in the coming years.. how is this not going to send their revenue even farther ahead of AMD... what is AMD doing to address chips.... how will AMD get them in a long term shortage when their counterparts like Intel are paving the way to double revenue by having the ability to pump out their own chips... its something that crossed my mind.. but is intel not setting themselves up to literally double their revenue once these plants are complete and pumping out chips while nobody else can even get them...... what are ur thoughts on this???",
        "subreddit": "stocks",
        "title": "Intel and Something that stands out....",
        "url": "https://www.reddit.com/r/stocks/comments/newnkq/intel_and_something_that_stands_out/",
        "created": 1621327291.0
    },
    {
        "author": "HotStool",
        "created_utc": 1620157470,
        "id": "n4w8rz",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Bought 30 2 year calls on INTC a couple months ago...sold some CC’s on them and the calls are in the red currently which I’m fine with but now I just got an email saying my calls might be forced to close because the dividends are coming out on the 6th and apparently I’ll be paying the dividend?\n\nCan someone educate me on this?\n\nThis is what the email said:\n\n“INTC will lock in dividends for its shareholders on May. 6, 2021. Because of this, you’re at a much greater risk of being assigned on your short INTC calls, so you should consider closing these positions.\nIf you are early assigned and have a short equity position on May. 6, 2021, you’ll be responsible for paying the dividend instead of receiving it.\nPlease carefully review your positions and consider rolling forward or closing out some or all of the spreads with this risk in your account. You may also consider exercising the corresponding long leg of the spread prior to the ex-dividend date to capture the upcoming dividend. You can do this by reaching out to our support team. If you do not take action, we may close out positions to protect you from the upcoming dividend risk.”\n\n\nCan someone ELI5?",
        "subreddit": "options",
        "title": "PMCC dividend risk?",
        "url": "https://www.reddit.com/r/options/comments/n4w8rz/pmcc_dividend_risk/",
        "created": 1620186270.0
    },
    {
        "author": "current-asscoverer",
        "created_utc": 1620147449,
        "id": "n4tc5v",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Intel has risen on news that it will spend $20B on establishing chip manufacturing factories in Arizona, but this news is more bearish than bullish to me.\n\nInvesting in Intel now, is nonsensical once you consider the full situation. I reiterate my bearish position on Intel and recommend a diagonal put play.\n\nI’ve more-or-less officially been an Intel bear for a few months now. As of late, many have asked me whether I am changing my stance on Intel due to its $20B manufacturing facility (FAB) production project. As much as I would love to reverse directions and proclaim myself a born-again Intel bull, I must objectively call Intel’s announcement as another bearish catalyst. In light of this news, I am happy to double down. Today, I will explain my viewpoint.\n\n*The Fab Ahab:*\n\nAhab was the seventh king of Israel. He inherited a powerful kingdom but was eventually brought down due to his own vices and not upholding his responsibilities. Many consider Ahab to be Israel’s worst king.\n\nIntel shares many similarities with Ahab. The company easily dominated the chip kingdom with its x86 IP, but this made Intel a bit too complacent: Easy money from x86 led the company to focus more on maintaining the status quo than moving the foundry market forward. In its comfort, Intel has lost its partnership with Apple (AAPL), who has successfully developed M1, a chip much more efficient than the previously used Intel x86 chips; failed to keep up with the shrinking node trends, currently struggling to produce 10nm chips while others are working on 3nm; and has even been overtaken by AMD, which long sat in Intel’s giant shadow. Intel’s story – to me – looks like a downfall story in the making.\n\nIntel finally sees the need to fight back, and the two fabs in Arizona, due 2024, at the cost of $20B is the latest strategy. However, it is a risky strategy. Adding fabs to the business is not just a one-time cost of the $20B but requires consistent upkeep and upgrade costs, something more like $20B per year, which, over the coming decade, would be more than Intel’s total current equity. Intel is thus further adding operational costs to its business during a time when the company is expected to see shrinking revenue and earnings. Typically, the responsible reaction to such earnings decay is to cut down on costs. Intel would seemingly rather throw Hail Marys.\n\n*Hail Mary:*\n\nI call the fab announcement a Hail Mary not because adding fabs is inherently a bad idea but because Intel seems to have little time remaining on the clock to benefit from this action before it finds itself well behind its competitors. Intel should have built fabs years ago when it was still the market leader and still growing earnings. Intel could have become the go-to chip manufacturer in the US, but now it faces an uphill battle in light of how strong Taiwan Semiconductor Manufacturing Company (NYSE:TSM) and Samsung (OTC:SSNLF) have grown over the past decade.\n\nAt roughly the same time as Intel’s announcement to build fabs in Arizona, TSMC (henceforth TSM) announced its own fab construction in Arizona. Clearly, there is a rush to build fabs in the US, and the reason, too, is clear: China. The US reliance on Taiwanese fabs combined with increasing concerns over a Chinese invasion of Taiwan means that the US would love a modern fab stateside. That is, Intel’s decision to create fabs at this time was not decided in a vacuum; instead of the decision being a business-focused decision, it is a situation-focused decision – a decision of convenience rather than one for the sake of shareholders.\n\nIntel’s Fab Focus In Question:\n\nIntel could be attempting to cozy up to the US government with its new fabs. The Department of Defense certainly wants some fabs stateside as China’s shadow grows over Taiwan. Intel might be playing the Tesla (TSLA) game by looking for taxpayers to help subsidize its business, gaining a novel edge over AMD.\n\nIn any case, I don’t see the news fabs to be transformative for Intel in the positive sense. If Intel is really going all-in on fabs, we will need many years before we see a significant payoff. Investing in INTC now, during a time of nose-bleed tech valuations and during earnings contractions is not a smart investment decision.\n\nAnd if Intel is looking for government subsidies by being the main US chip manufacturer, this is essentially a white flag; Intel cannot compete in the game of technological advancements and needs a handicap. This is not Tesla being subsidized as it forays into a fledgling industry but an old, stubborn company attempting to stay afloat via means outside its own merits. You would be better off investing in AMD or TSMC if you want exposure in US chip design or manufacturing.\n\nOverall, I reiterate my bearish outlook on Intel relative to the rest of the chip industry. The upward momentum in Intel and its current price are not sustainable by the news: The fabs and other aspects I’ve mentioned in previous articles are perceived as bullish while they are in fact bearish.",
        "subreddit": "investing",
        "title": "Why You Should Short The Intel Fab Play",
        "url": "https://www.reddit.com/r/investing/comments/n4tc5v/why_you_should_short_the_intel_fab_play/",
        "created": 1620176249.0
    },
    {
        "author": "Revolutionary-Cry-38",
        "created_utc": 1621478486,
        "id": "ngoknc",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "It's no surprise that these semiconductors have done well over the past few years. Although these companies will have mild corrections, I think it's safe to say they will have a big impact on the technology driven future. \n\nWith that said, I'd like to get peoples opinions on the pros and cons of each of these companies. \n\nWhat products do they offer?\n\nHow is one better than the other?\n\nWill the function/price ratios of their product be cyclic or will there be a clear winner?\n\nJust to bring up a few.\n\nHere is some quick information on these companies:\n\n**NVDA**: Company focuses on GPUs. Has a great GPU for both gaming and crypto. GPUs thrive in crypto and Neural Networks (AI).\n\nMC\\~350B, EV/EBITDA\\~60, low debt, good growth\n\n**AMD:** Has made a huge push in the CPU niche and has gained popularity with the gamers. Their CPUs are valued at the best function/price ratio. Pretty sure they are working on a promising GPU.\n\nMC\\~90B, EV/EBITDA\\~40, low debt, good growth\n\n**INTC:** The most experience and clout in the industry. Look around you, you'll probably see an intel sticker. Recent restructure of company with seems promising. Heavy in the DB and cloud niche which will be massive in the future (and currently is). Also, working on GPUs, not sure on the progress.\n\nMC\\~223, EV/EBITDA\\~6.7, debt, could have less, good growth\n\n&amp;#x200B;\n\nAt first glance the cheapest to most expensive from a valuation standpoint looks as followed INTC, AMD, NVDA, respectively. \n\nLooking forward to the responses!",
        "subreddit": "StockMarket",
        "title": "Discussion on the semiconductor giants [AMD, INTC, NVDA]",
        "url": "https://www.reddit.com/r/StockMarket/comments/ngoknc/discussion_on_the_semiconductor_giants_amd_intc/",
        "created": 1621507286.0
    },
    {
        "author": "value_investor4ever",
        "created_utc": 1621706814,
        "id": "nioefm",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "Seth Klarman added heavily to his Intel position making Intel his biggest position. Here is a detailed stock analysis of Intel - business model, present and historical financials, associated risks, competition, intrinsic value and more. A value investment opportunity? Let me know your thoughts!",
        "url": "https://www.youtube.com/watch?v=CckZx5KTE0I&amp;t=26s&amp;ab_channel=InvestingUntangledInvestingUntangled",
        "created": 1621735614.0
    },
    {
        "author": "WorthyCar",
        "created_utc": 1620275326,
        "id": "n5z4od",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "$SKYT - Only Company Advance enough to build Chips for US ARMY &amp; DoD warheads\n\nhear me out you future rich ballers.\n\nA new stock has just popped out in the market. It is Sky Water Technology and they are a semiconductor manufacturer who focus on wafering and making chips advancements. They have been in the chip industry since 2006 so not a brand new play in anyway but they just recently went public at $14 per share. \n\nso before I dive into the good shit, let’s go back and talk about the cons of this stock for all the haters out there:\n\n- IPO just came out; not any balance sheet for public  \n- Chips which are made are 200-300nm; this is what intel made back in 1993 and now they make 10nm\n- Company is running is not a profitable company \n\nOkay now let’s talk about why this is a good speculative play:\n\n- Brand new foundry made in Minneapolis to build chips \n- revenue growing each year\n- ONLY COMPANY ADVANCED ENOUGH TO MAKE CHIPS FOR THE ARMY (in order to make chips for the Army, you need to be a U.S Based foundry which $SKYT is)  \n- Got a contract to experiment with radiant resistance chips for department of defense warheads\n- Shortage in Chip Industry has been a stagnant issue and will raise the price. \n\n$SKYT to me is something worth above $30+ and i personally have skin in the game so i believe that with government contracts, it can run up. \n\ndo your own due diligence and not just take my word for it.",
        "subreddit": "wallstreetbets",
        "title": "$SKYT - SKYWATER TECHNOLOGY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n5z4od/skyt_skywater_technology/",
        "created": 1620304126.0
    },
    {
        "author": "dsf2100",
        "created_utc": 1621528873,
        "id": "nh50e6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Hello everyone. I’m new to posting here and realize I can’t add links to Twitter, so I’ll just do my best to make it as convenient as possible for y’all to access the links I initially tried to include but found out weren’t allowed. \n\nI’m surprised to not see any news about this on here. \n\nIntel + Enzolytics Whitepaper: https://www.intel.com/content/dam/www/central-libraries/us/en/documents/optimizing-empathetic-ai-to-cure-deadly-diseases1.pdf\n\nGaurav Chandra is the COO, and he’s active on Twitter— check out his page to see where I’m getting part of this information from! \n\nWebsite: http://enzolytics.com/\n\nSo, I don’t think there’s any official announcement of Intel and Enzolytics partnering; however, the fact that Intel has publicly posted this Whitepaper highlighting how their AI technology works well with ENZC’s treatments, science, and team could hint towards something big in the works. \n\nFor more justification of Intel supporting Enzolytics and their team, check out this link to the COO’s LinkedIn activity where two Intel representatives commented: \n\nNikhil Deshpande, Ph.D. and Clifton Roberts. \n\nhttps://www.linkedin.com/posts/gaurav-chandra-md-mba-a8964b74_optimizing-empathetic-ai-to-cure-deadly-diseases-activity-6799003923676966912-12PJ\n\n(I think this counts as DD for the flair. Sorry if this fits under Stock Info instead. Let me know if I messed that up please!)",
        "subreddit": "pennystocks",
        "title": "Intel and Enzolytics Whitepaper $ENZC - Biotech Company with HIV + Covid Treatments (among many other diseases)",
        "url": "https://www.reddit.com/r/pennystocks/comments/nh50e6/intel_and_enzolytics_whitepaper_enzc_biotech/",
        "created": 1621557673.0
    },
    {
        "author": "628rand",
        "created_utc": 1620341985,
        "id": "n6k7wf",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": " How many total open interest calls were added on Wednesday:\n\n1. $UBER: 120,097\n2. $ASO: 62,016\n3. $AMD: 58,738\n4. $SABR: 57,272\n5. $PTON: 54,958\n6. $PLTR: 50,313\n7. $AAPL: 49,222\n8. $TPR: 47,657\n9. $UNFI: 45,317\n10. $RDFN: 42,802\n11. $BA: 38,389\n12. $CCJ: 37,345\n13. $EQT: 37,136\n14. $TSLA: 37,125\n15. $AMC: 34,520\n\nHow many total open interest puts were added on Wednesday:\n\n1. $UBER: 73,926\n2. $PFE: 65,369\n3. $AAPL: 64,635\n4. $PTON: 64,226\n5. $F: 50,188\n6. $AMD: 43,898\n7. $FCX: 34,347\n8. $TSLA: 34,192\n9. $PYPL: 33,996\n10. $RDFN: 33,054\n11. $TPR: 31,512\n12. $UNFI: 31,174\n13. $BA: 28,901\n14. $INTC: 25,468\n\n(Data from [www.stonks.fyi](https://www.stonks.fyi/))",
        "subreddit": "wallstreetbets",
        "title": "Changes to Calls/Puts Open Interest Holdings Wednesday, May 5 End of Day",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6k7wf/changes_to_callsputs_open_interest_holdings/",
        "created": 1620370785.0
    },
    {
        "author": "Vrozini",
        "created_utc": 1620464855,
        "id": "n7l8u3",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " I am very new to investing. I would like to try ETFs and am looking at the pros/cons of different ones starting with QQQ. Any advice or answers to questions is very much appreciated. \n\n**What is QQQ?**\n\nInvesco QQQ is an exchange-traded fund that tracks the Nasdaq-100 Index. The Index includes the 100 largest non-financial companies listed on the Nasdaq based on market cap.\n\nQQQ is the most direct way to “invest” into the Nasdaq-100 index as it tracks it and is passively managed. It is heavily based on technology. This seems like it can be a con as it is “less diverse” or a pro if you are bullish in tech. \n\n**Top 10 Allocation: (https://www.invesco.com/qqq-etf/en/about.html)**\n\n**AAPL: 10.95%**\n\n**MSFT: 9.50%**\n\n**AMZN: 8.32%**\n\n**TSLA: 4.24%**\n\n**FB: 3.78%**\n\n**GOOG: 3.62%**\n\n**GOOGL: 3.31%**\n\n**NVDA: 2.69%**\n\n**PYPL: 2.31%**\n\n**INTC: 2.11%**\n\n**48.11% of total stocks are in the information technology sector.**\n\n[https://www.invesco.com/qqq-etf/en/home.html](https://www.invesco.com/qqq-etf/en/home.html)\n\nIt consistently outperforms it’s common comparison being the S&amp;P 500 Index.\n\nA 10,000 dollar investment in QQQ on March 31st 2011 would become 61,493 dollars today, compared to 36,756 dollars from the S&amp;P 500 index. \n\nQQQ is considered a riskier ETF than the S&amp;P because of how technology based it is, meaning more of a capital gains ETF where S&amp;P involves more mature companies.\n\nMany people worry about a crash similar to the dot come crash where it took several years for QQQ to recover. If a crash like this happened, is that not a market wide thing? I don’t see why QQQ would be affected any worse than other stocks that crash.\n\nPersonally, I am looking to put extra monthly income in ETFs such as, ARKK, ARKG, VTI, and VXUS along with QQQ and see what that gets me in the next 3-5 years. I just don’t know at what % to balance each to have a well diversified portfolio. I would like to have QQQ be the largest percentage among these, is there a reason why that is a bad idea? Are there risks involved with QQQ that I have not found? Any other information anyone wants to share relating to QQQ  or ETFs in general is welcome.",
        "subreddit": "stocks",
        "title": "QQQ Research + Questions",
        "url": "https://www.reddit.com/r/stocks/comments/n7l8u3/qqq_research_questions/",
        "created": 1620493655.0
    },
    {
        "author": "herrsan",
        "created_utc": 1620329963,
        "id": "n6fn64",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I've been looking at $INTC for a while now, and think that they may have some moat and a couple of catalysts in the medium term: the foundry business and new management, solid revenue growth. But I can't really figure if they're cheap enough to buy at a margin of safety. (I'm pretty new to investing so I kinda lack  valuation knowledge enough to trust my own valuations)",
        "subreddit": "ValueInvesting",
        "title": "Thoughts on $INTC?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/n6fn64/thoughts_on_intc/",
        "created": 1620358763.0
    },
    {
        "author": "Thefishman1",
        "created_utc": 1621981124,
        "id": "nl1klt",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " \n\njust to clarify, other than this i am a normal teenager, I have a social life, i have a video game addiction, I am studying for my exams, I am just also interested in investing, and eventually financial freedom.\n\nSo i am 16, and am opening my first actual account with fidelity under 18 accounts. my father wants me to do this properly and be aware of the taxes and all that, unlike before (he just bought companies for me with my money) i don't know how much exactly, but my dad is willing to invest a sizable amount ( i suspect in the ball part of 10k).\n\nanyway, we plan to dollar cost average in, buy a few companies and hold long term while learning how to actually judge companies and pick good ones for the long term.\n\nmy objectives are two-fold with this;\n\nuse my skills from school and from this to actually learn about different companies by doing DD, practice reading financial documents, etc. I plan to also have a section of the portfolio be broad market ETF´s, as That seems like a secure way to go for long-term growth.\n\nhopefully, build up a somewhat sizable portfolio that I can add to during college and can help me with my long term aspirations and financial security (get a head start on compound interest)\n\nbut so far here is my plan: for my first 3 picks:\n\nAMD is currently at quite a discount at 77$ a share. It has good revenue and year after year growth. With A P/E ratio of 33, it is growing rapidly in the semiconductor market and has contracts to produce chips with both Sony and Microsoft. A rather stable company with a bright future and a competitive moat over intel, main competitor, as well.\n\nAAPL\n\nA very big household name with a strong balance sheet and solid growth, Apple seems like a relatively safe bet while still ensuring growth. its FAAANG as well, so that's good.\n\nNET\n\nA more speculative long-term play, but a company that again, has a healthy balance sheet. Growing more than 50% YoY. provides fast internet and also deals in internet safety, with an ambitious vision to build “ a better internet”.\n\nI want to make sure i have a good blend of stable picks while also investing in companies that still have room to grow.\n\nthoughts? ideas? suggestions?\n\nman, i realize how nerdy and how I sound like such a recluse. I´m honestly not.",
        "subreddit": "StockMarket",
        "title": "16 yr old getting a fidelity account...thoughts on my strat/picks?",
        "url": "https://www.reddit.com/r/StockMarket/comments/nl1klt/16_yr_old_getting_a_fidelity_accountthoughts_on/",
        "created": 1622009924.0
    },
    {
        "author": "TheyGunnedMeDown",
        "created_utc": 1621618694,
        "id": "nhy9im",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "My first time selling a cover call, I collected .18c in premium per share. By 2 o clock, if the share is trading below 56.21-56.00$, what are the likely chance of me getting assigned? Or is it anything above 56$ strike price that will get me assigned automatically?",
        "subreddit": "options",
        "title": "INTC MAY 26 56 COVERED CALL, Assigned or not.",
        "url": "https://www.reddit.com/r/options/comments/nhy9im/intc_may_26_56_covered_call_assigned_or_not/",
        "created": 1621647494.0
    },
    {
        "author": "MillennialBets",
        "created_utc": 1620159302,
        "id": "n4x0r3",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hi, r/options! This is a stock ranker that looks at all stocks that have options. Clicking on the ticker links to a search for subreddit posts mentioning the ticker with News, DD, or Discussion Flairs. The post is updated once an hour.\n\n Last update: 16:15:00\n\n\n\n**Top 5 Stocks by % Increase -**  \n\n  \n| Ticker |  Price | Change | %Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| [REED](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/REED) | 1.47 | 0.47 | +47.0% | 1.64 |\n| [STIM](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/STIM) | 14.04 | 3.89 | +38.32% | 22.43 |\n| ADMP | 1.055 | 0.2911 | +38.11% | 2.34 |\n| HBP | 5.025 | 0.835 | +19.93% | 4.6 |\n| [UFS](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/UFS) | 48.35 | 7.83 | +19.32% | 48.62 |\n\n  \n**Lowest 5 Stocks by % Decrease -**  \n\n  \n| Ticker |  Price | Change | % Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| CCXI | 26.97 | -21.85 | -44.76% | 70.29 |\n| [MAXR](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MAXR) | 29.135 | -10.095 | -25.73% | 58.74 |\n| [OCGN](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/OCGN) | 12.505 | -3.175 | -20.25% | 18.77 |\n| [BLDP](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/BLDP) | 16.25 | -4.01 | -19.79% | 42.28 |\n| [SDC](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/SDC) | 8.665 | -1.965 | -18.48% | 16.08 |\n\n\n  12 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[RKT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/RKT)|9 |1 |0 |0 |8\n[AMD](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMD)|7 |3 |1 |0 |3\n[TSLA](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TSLA)|7 |1 |1 |2 |3\n[ASO](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/ASO)|5 |3 |1 |0 |1\n[GME](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|5 |1 |2 |0 |2\n[INTC](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/INTC)|4 |2 |0 |0 |2\n[OIL](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/OIL)|4 |0 |2 |1 |1\n[MT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MT)|4 |1 |0 |2 |1\n[IP](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/IP)|4 |2 |1 |0 |1\n[CRSR](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CRSR)|4 |2 |0 |0 |2\n\n\n 48 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[GME](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|21 |5 |6 |1 |9\n[TSLA](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TSLA)|19 |6 |2 |2 |9\n[RKT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/RKT)|19 |7 |1 |0 |11\n[MT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MT)|16 |4 |3 |5 |4\n[AMD](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMD)|16 |6 |2 |0 |8\n[AAPL](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AAPL)|15 |6 |1 |0 |8\n[FB](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/FB)|12 |6 |0 |0 |6\n[MSFT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MSFT)|12 |5 |1 |3 |3\n[CLOV](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CLOV)|11 |3 |3 |2 |3\n[MVIS](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MVIS)|11 |6 |1 |1 |3",
        "subreddit": "options",
        "title": "Options Stock Ranker for May-04-2021",
        "url": "https://www.reddit.com/r/options/comments/n4x0r3/options_stock_ranker_for_may042021/",
        "created": 1620188102.0
    },
    {
        "author": "GoM4vs1",
        "created_utc": 1620872843,
        "id": "nb68rv",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "I’m a high school junior who started investing last July. I’ve always saved money and thought that investing some of the money I’ve saved and made from my job would be a good idea. When I started last summer I invested about $2,000 in AAL, CNK, NCLH, SAVE, SONY, T, and XOM. Up until the past few weeks I had only been gaining and was feeling really confident and happy with my investments. Because of this, I decided to invest another $2,000 in UBER, INTC, F, and ERIC. Pretty much this entire sum has been losing since I put it into the market but it hasn’t bothered me much as I’ve always been wanting these to be long-term investments that could benefit me after college and beyond. I wasn’t worried whatsoever until the past couple days, all my stocks even the ones I had seen as successes I bought last year, have been falling drastically. My portfolio has been up to as much as $5,200 but today after dropping  another 3.17% it’s down to 4,732.24. I could sell everything I own in the morning, put it behind me, and still make a profit of over $600 but I’m just really not sure what to do. I’m obviously very young and very new to investing and just am frightened to potentially lose all these savings that I hoped to grow to make my independent, adult life more financially secure. Any tips or advice in this unsure time is every much appreciated, thanks everyone.",
        "subreddit": "stocks",
        "title": "I’m a very young new, investor and I’m scared. Any advice is appreciated",
        "url": "https://www.reddit.com/r/stocks/comments/nb68rv/im_a_very_young_new_investor_and_im_scared_any/",
        "created": 1620901643.0
    },
    {
        "author": "Henisockle",
        "created_utc": 1620896392,
        "id": "nbc8pa",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I’m still very new to investing. Wrapping up my first year. Seen around a 250% increase so far. \n\nBut I’m still discovering and learning about so many companies, good and bad. I’ve done a little digging (literally 20-30 mins) into looking into a good choice to get into for the microchip shortage. \n\nAnd I was wondering what are some you all like or are looking at? \n\nSo far I think, Intel and $TSM seem to be the best options. TSM is one of the top semiconductor stocks. Intel is well, Intel. Been around and will be around for awhile. Only knock on Intel, is they are no longer working with Apple. But should still have an impact in supplying chips. Are there any others ones I should add to my list?",
        "subreddit": "stocks",
        "title": "Best chip shortage play?",
        "url": "https://www.reddit.com/r/stocks/comments/nbc8pa/best_chip_shortage_play/",
        "created": 1620925192.0
    },
    {
        "author": "raoha",
        "created_utc": 1620027577,
        "id": "n3qj1d",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**E2Open ($ETWO)**\n\n**A 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY**\n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.”  \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%).\n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to Wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n* *A Snapshot of its largest customer base:*\n\nhttps://preview.redd.it/uwe5biyquuw61.png?width=679&amp;format=png&amp;auto=webp&amp;s=fd2bc97da035fdd0cc0d84e11686aa40166f5c91\n\n* *A Snapshot Of Their Investment Thesis:*\n\nhttps://preview.redd.it/m1v3wk1uuuw61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=3530ce3826ed67513c7797afd4bb1a3a0d54e56a\n\n**Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\nhttps://preview.redd.it/tm9r4jdyuuw61.png?width=632&amp;format=png&amp;auto=webp&amp;s=cd452f13403ddf6f1c43151b9fca9415d9aa1826\n\n*A Visual Of $ETWO 's business model:*\n\nhttps://preview.redd.it/pts7oo10vuw61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=b50c7097f059b98ffb48f2e8134628860fccf700\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis. \n\nOne of the most important value factors for SaaS platforms is in the recurring cash flow. In $ETWO's case, this comes from it's subscription sales, which provides some much valued predictability in these uncertain times . This is another strength that $ETWO possesses, as the company boasts an extremely low churn rate - which is a an indicator of a massive moat, which can allow $ETWO to retain profits from its competitors. This only further demonstrates that the company is due for strong future growth. Below are some visuals which exemplify the value of ETWO:\n\n&amp;#x200B;\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/wirah1d2vuw61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=75ae35151c09a121def921cb6bd42c03c947c563\n\n* Attractive Long Term Financial Profile:\n\nhttps://preview.redd.it/9intlpp3vuw61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=ba50479fab89957024b271cc1223ddb2e25d83a1\n\n* Growth and Profitability:\n\nhttps://preview.redd.it/52quo145vuw61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=d93bbeb7ace2f303d45c68a5cf90bd616cff90c8\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it.  If you think about that, you’ll do things differently.”  \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management solutions to the enterprise. While the Supply Chain Management space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest:\n\n[https://finviz.com/screener.ashx?v=152&amp;f=sh\\_opt\\_option,sh\\_short\\_high&amp;o=shortinterestshare&amp;t=ETWO](https://finviz.com/screener.ashx?v=152&amp;f=sh_opt_option,sh_short_high&amp;o=shortinterestshare&amp;t=ETWO)\n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine:\n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "wallstreetbets",
        "title": "A Deep Dive Look at: E2Open ($ETWO) - The Future of Supply Chain Management?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3qj1d/a_deep_dive_look_at_e2open_etwo_the_future_of/",
        "created": 1620056377.0
    },
    {
        "author": "IntelligentCounter81",
        "created_utc": 1620090048,
        "id": "n4cbcp",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\nFellow Apes,\n\nAs you may or not know, there was a huge debate on whether or not pineapple belonged on pizza. (Bear with me...ape grew a wrinkle). I worked Intel in the USMC for years, and sometimes disinformation is a wonderful thing.\n\nThe hedgies are paying bears to post FUD and other outright nonsense. Today, during our debate, I started replying to paid bears an animated gif of pizza as a response. Others followed suit. Hear me out...\n\nWe know they get paid per interaction with Bulls/Apes. Who cares? That's just more money hedgie has to shell out NOT in shares. Can you picture KG's face when he's told, 'Sir, we are paying people for pictures of pizza!\". KG: \"What the heck does that mean?!?\" It will either stop the practice, cause hedgie to have to pay for pizza pictures, or both. Yet, giving him nothing of what we know. If he knows what we know, they can mount an offense. Just send bears food pictures.\n\nMonday - Pizza.\n\nTuesday - Taco Tuesday.\n\nWednesday - Wings.\n\nThursday - Bananas.\n\nFriday - Harambe.\n\nApe tired of playing defense.",
        "subreddit": "Wallstreetbetsnew",
        "title": "Pizza and a Movie",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n4cbcp/pizza_and_a_movie/",
        "created": 1620118848.0
    },
    {
        "author": "gagan45678",
        "created_utc": 1621893552,
        "id": "nk9kqs",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\nWith Nvidia being the creator of the GPU (Graphic Processing Unit), its benefitting from all the recent trends and ones to stay. Their chips are being used by industry leaders Amazon's AWS, Microsoft's Azure Cloud, Alphabet's Google Cloud, International Business Machines' IBM Cloud, and Alibaba Cloud.\n\nTheir GPUS are crucial in the success of AI. Everyone is trying to develop their own AI processor but at this point, the GPU is still the go to for both researchers and data centers wanting to run AI and other sophisticated algorithms. For example, it will supply NIO the electric vehicle car company in China with its chips for its newest sedan the ET7.\n\nAnother reason why everyone should own Nvidia stock is because of their GRACE CPU. Although Intel holds 90% of the CPU market, their GRACE CPU now will have 10 times the performance of any leading CPU on the market!\n\nTheres more details in the video i made below. Just wanted everyone to be aware of what Nvidia is doing and why it may be worth either having on your watch list or a stock to own. In addition they are also doing a 4 to 1 stock split on July 19th which will make each share valued at roughly $150 according to todays stock price.  \n[https://youtu.be/n5alFa4QNm8](https://youtu.be/n5alFa4QNm8)",
        "subreddit": "StockMarket",
        "title": "Why Everyone Should Own or Watch Nvidia Stock in 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/nk9kqs/why_everyone_should_own_or_watch_nvidia_stock_in/",
        "created": 1621922352.0
    },
    {
        "author": "dsf2100",
        "created_utc": 1621528424,
        "id": "nh4tod",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I’m surprised to not see any news about this on here. \n\nIntel + Enzolytics Whitepaper: https://www.intel.com/content/dam/www/central-libraries/us/en/documents/optimizing-empathetic-ai-to-cure-deadly-diseases1.pdf\n\nLink to COO’s Twitter post about this: https://twitter.com/drgauravchandra/status/1393198101683376128?s=21\n\nWebsite: http://enzolytics.com/\n\nSo, I don’t think there’s any official announcement of Intel and Enzolytics partnering; however, the fact that Intel has publicly posted this Whitepaper highlighting how their AI technology works well with ENZC’s treatments, science, and team could hint towards something big in the works. \n\nFor more justification of Intel supporting Enzolytics and their team, check out this link to the COO’s LinkedIn activity where two Intel representatives commented: \n\nNikhil Deshpande, Ph.D. and Clifton Roberts. \n\nhttps://www.linkedin.com/posts/gaurav-chandra-md-mba-a8964b74_optimizing-empathetic-ai-to-cure-deadly-diseases-activity-6799003923676966912-12PJ\n\n(I think this counts as DD for the flair. Sorry if this fits under Stock Info instead. Haven’t used this forum before!)",
        "subreddit": "pennystocks",
        "title": "Intel and Enzolytics Whitepaper $ENZC — Biotech Company with HIV + Covid Treatments (among many other diseases)",
        "url": "https://www.reddit.com/r/pennystocks/comments/nh4tod/intel_and_enzolytics_whitepaper_enzc_biotech/",
        "created": 1621557224.0
    },
    {
        "author": "raoha",
        "created_utc": 1620047820,
        "id": "n3vs4e",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " **E2Open ($ETWO)**\n\n**A 100% Cloud-Based SaaS Platform, And The Future Of Supply Chain Management**\n\n&amp;#x200B;\n\n\\*Note\\* I posted this a few days ago on WSB. Mods deleted it (probably not enough rocket emojis), so I figured this might be a more suitable place for discussion!. Cheers!\n\nWith the Global Pandemic putting unprecedented strain on the national and global supply chain, and recent events such as the Suez Canal blockage, as well as the Semiconductor Shortage, there has never been a stronger demand for Supply Chain efficiency. President Joe Biden just recently began a 100-day assessment of the risks to supply chains, noting that the US’’ need for secure, diverse, dependable goods in notable sectors such as pharmaceuticals, semis, EV batteries, and rare earth minerals. This is where E2Open ($ETWO) comes into play.\n\n**COMPANY SUMMARY**\n\n*“Leaders win through logistics. Vision, sure. Strategy, yes. But when you go to war, you need to have both toilet paper and bullets at the right place at the right time. In other words, you must win through superior logistics.” \\~ Tom Peters*\n\nEssentially an unknown up-and-coming company that provides cloud-based, on-demand supply chain software that offers customers a significant value proposition. ETWO helps customers reduce inventory costs (10-20%), reduce direct materials procurement operating costs (50%), improve inventory forecasts (15-50%), and reduce supply chain staff (15%).\n\nETWO has only recently went public on February 21’, yet this relatively new company has already acquired and secured clients such as Google, Microsoft, Nvidia, Intel, Facebook, AMD, Nike, and many more (See Image Below for a better overall picture of its customer base). Another notable point is it’s founders. According to Wikipedia, *the company was founded as a joint project of 8 major companies: Hitachi, IBM, LG Electronics, Matsushita, Nortel, Seagate, Solectron, and Toshiba.* This is no small matter, as these are massive companies that have large teams of experts making these decisions. The company is also trading very cheap in comparison to it’s fundamentals and it’s peers (Scroll down for a slightly deeper dive).\n\n* *A Snapshot of its largest customer base:*\n\nhttps://preview.redd.it/5y53bq4inww61.jpg?width=1194&amp;format=pjpg&amp;auto=webp&amp;s=1467048a3391c0da2fe641472522f200b7fcf016\n\n* *A Snapshot Of Their Investment Thesis:*\n\nhttps://preview.redd.it/7v8dt8rjnww61.png?width=1212&amp;format=png&amp;auto=webp&amp;s=80b6e61352dd21cf6df02c9aebb4f2286fc83a01\n\n**Key Qualities Of ETWO, and Competitive Advantages It Has Over Its Competitors:**\n\n* Multi-enterprise network combining data with best-in-class intelligent applications\n* integrated cloud platform delivering meaning ROI across supply chain\n* First mover advantages from data connectors and harmonization\n* Long term relationships with blue-chip, large enterprise customer base\n* Attractive industry tailwinds and large TAM with significant white space\n* Category-defining End-to-End provider of mission-critical software\n* Strong network effects enhanced by flexible and integrated data model\n\n**Key issues for current supply chains and how $ETWO is solving them:**\n\nhttps://preview.redd.it/zkuxw31onww61.png?width=632&amp;format=png&amp;auto=webp&amp;s=07d09fcf3e6f6e965ae82f6a48b77f2504896919\n\n*A Visual Of $ETWO 's business model:*\n\nhttps://preview.redd.it/2u9riftpnww61.png?width=1885&amp;format=png&amp;auto=webp&amp;s=b4c32567357a0a5df16fe3df3efa83d2239f20c4\n\n**VALUATION**\n\nThe stock itself offers value to shareholders due to it’s very cheap valuation compared to its peers, as well as it’s massive potential for growth. At its current valuation, $ETWO is trading at an estimated EV/Rev multiple of 7 compared to an average of 11.7 among it’s peers. It also boasts an EV/EBITDA of 21.3 compared to 29.2 and 59.1 from it’s two closest competitors, Descartes and Kinaxis.\n\nOne of the most important value factors for SaaS platforms is in the recurring cash flow. In $ETWO's case, this comes from it's subscription sales, which provides some much valued predictability in these uncertain times . This is another strength that $ETWO possesses, as the company boasts an extremely low churn rate - which is a an indicator of a massive moat, which can allow $ETWO to retain profits from its competitors. This only further demonstrates that the company is due for strong future growth. Below are some visuals which exemplify the value of ETWO:\n\n* Strong Performance on Key Metrics:\n\nhttps://preview.redd.it/vqz514frnww61.png?width=1838&amp;format=png&amp;auto=webp&amp;s=c7da8635fcc90ddc8313cf63284602b07a639e32\n\n* Attractive Long Term Financial Profile:\n\nhttps://preview.redd.it/ypg366qsnww61.png?width=1869&amp;format=png&amp;auto=webp&amp;s=1a55558eaba519a8a3ac9d16fb0b0648c058a38c\n\n* Growth and Profitability:\n\nhttps://preview.redd.it/4sgqj03unww61.png?width=1854&amp;format=png&amp;auto=webp&amp;s=f8b16e1fda840fb7d6c0fd2a7c9192dd645dfbe5\n\n**What Wallstreet is Saying**\n\n*“It takes 20 years to build a reputation and five minutes to ruin it. If you think about that, you’ll do things differently.” \\~ Warren Buffett,*\n\nAlthough it is a relatively new and low profile company (for now), it seems Wall Street is already taking notice. Loop Capital just recently rated it a BUY. Goldman Sachs analyst Chris Merwin also initiated coverage on $ETWO, and gave it a BUY rating as well. His words on the company:\n\n*\"E2Open is a provider of supply chain management solutions to the enterprise. While the Supply Chain Management space is relatively mature, E2Open has assembled an impressive suite or products - organically and through M&amp;A - which cover all functional areas of supply chain management, and importantly break down data silos to provide deeper insights into and efficiencies for the supply chain. With an improving cross-sell motion providing a $1bn expansion opportunity within its customer base today, we see long-term runway for at least low double digit top line growth along with 30%+ EBITDA margins through FY24. With shares trading at 6.1x/18.9x our CY22 revenue and EBITDA forecasts relative to similar growth peers median at 8.9x/22.2x we see an attractive entry point at current levels.\"*\n\n**One Final and Intriguing Note:**\n\nA few popular, and reputable websites that display a company's short interest, state that $ETWO has a whopping percentage of it’s float shorted (48% on finviz, at the time of this post).\n\nShort Interest:\n\n[https://finviz.com/screener.ashx?v=152&amp;f=sh\\_opt\\_option,sh\\_short\\_high&amp;o=shortinterestshare&amp;t=ETWO](https://finviz.com/screener.ashx?v=152&amp;f=sh_opt_option,sh_short_high&amp;o=shortinterestshare&amp;t=ETWO)\n\nI am not sure what to think about this, as I also see that the put/call ratio for ETWO is a miniscule 0.02 on Barchart. Maybe someone can comment on this and maybe shed some light.\n\nPut/Call Ratio:\n\n[https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios](https://www.barchart.com/stocks/quotes/ETWO/put-call-ratios)\n\nAnyone interested in some further reading on the company, should check out this solid write up on $ETWO, as it makes some great points that I missed in mine:\n\n[https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl\\_cc\\_neuberger\\_principal\\_holdings/](https://www.reddit.com/r/trakstocks/comments/kzmar3/pcpl_cc_neuberger_principal_holdings/)\n\n**TL;DR:**\n\nThe cheaply valued ETWO and it’s value proposition, it’s allstar customer base (Google, Microsoft, Nvidia, Intel, Facebook, etc), as well as it’s unique competitive advantage through their award winning software, offers its clients as well as its shareholders and potential shareholders, a bargain that is hard to resist. The growth potential is massive, the fundamentals are strong, and I believe we are looking at, in ETWO, the future of the supply chain management industry.\n\n*Disclosure: This is by no means financial advice. I just like the stock. I also must disclose that I have both shares and December call options for $ETWO. I am an individual investor, with no association whatsoever with the company.*",
        "subreddit": "StockMarket",
        "title": "E2Open ($ETWO) - A Great Buy During The Current Global Supply Chain Crisis?",
        "url": "https://www.reddit.com/r/StockMarket/comments/n3vs4e/e2open_etwo_a_great_buy_during_the_current_global/",
        "created": 1620076620.0
    },
    {
        "author": "disoriented_llama",
        "created_utc": 1622219558,
        "id": "nn1pno",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "\\*This is not financial advice, and I am not a financial advisor of any kind. I eat crayon sandwiches. WITH MAYO!)\n\n&amp;#x200B;\n\n1. Read the House of Cards Trilogy by u/atobitt because unless you have read it, you essentially understand nothing. \n2. Turn off margin accounts and convert to cash account. Different steps for every broker. My broker asked me to send an email to customer service. I use TD.\n3. Turn off stop losses. \n4. Get the fuck out of Robinhood. \n5. Know my sell floor. Know how to distinguish a dip from the way down from a peak. For me, this came from studying past squeeze charts and also knowing that I am hodling for a specific floor. That makes things much easier. \n6. Get as far as I can from the Original WSB sub. It is a shitshow of bad intel, shills, and losers who hate apes. \n7. Laugh at, but NEVER trust the media. Especially Rich Greenfield and Jim Cramer. Generally, whatever they say, do the opposite. \n8. Learn about Plan B and make sure to join Discords and other social networking platforms when, not if, Reddit is compromised or goes dark. \n9. Laugh at the assholes on GMEMeltdown and WallStreetBetsOGs for being so arrogant and pathetic they had to essentially make a Mean Girls table sub because they have nothing else going for them but their vitriolic, narcissistic, toxic attitudes. \n10. Buy. Hodl. Eat a pack of crayons. Wait. Sell on the way down, and live a good life doing good for other people unlike the hedge scum fucks who hoard wealth like a bunch of demented Scrooge McDucks. \n\nOh, and every so often, eat a banana, think of your fellow apes, and smile. \n\nThe End.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The Baby Ape’s Guide to the Galaxy",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/nn1pno/the_baby_apes_guide_to_the_galaxy/",
        "created": 1622248358.0
    },
    {
        "author": "Even-Independence-56",
        "created_utc": 1620246059,
        "id": "n5pjts",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Most investments like VSBLTY with incredible upside are binary(win or lose) deals, but with highly profitable, high value revenue essentially guaranteed for the next 5 years, little to no debt, CEO said no more dilution(they’re fine on cash and funding for the foreseeable future), there's a great margin of security with the bad case scenario being stagnation or the ABI deal falling out(officially signed next 30 to 45 days), which is highly unlikely considering they’ve begun installation for a few thousand stores in Peru, Mexico, Colombia and Ecuador already.\n\nVSBLTY has an intelligent, successful board. Was also founded in 2015, high barrier to entry on the business, would take years before competitors can jump in, being first is a huge advantage.\n\nLeadership team:\n\n[https://vsblty.net/why-vsblty/the-team/#:\\~:text=Jay%20Hutton&amp;text=Co%2DFounder%20and%20CEO%2C%20Jay,challenges%20inherent%20in%20their%20execution](https://vsblty.net/why-vsblty/the-team/#:~:text=Jay%20Hutton&amp;text=Co%2DFounder%20and%20CEO%2C%20Jay,challenges%20inherent%20in%20their%20execution) \n\nVSBLTY CEO Jay Hutton tries explaining how other companies are considered competitors even though they’re doing different things.\n\ninterview: [https://www.youtube.com/watch?v=W91qY3vDMUs](https://www.youtube.com/watch?v=W91qY3vDMUs)\n\nWhat does VSBLTY do?\n\nVSBLTY does security + in store/point of sale advertising.\n\nThey sell screens, software, and cameras(all in one) that advertise while providing security and real time analytics.\n\nImagine you own 10,000 retail stores, you use VSBLTY because you can get extra cash from advertisements, increased sales, and now that you have security, you can catch robbers and keep your employees safe, economic and moral incentive.\n\nNow imagine you’re an advertiser like Coca Cola. You want to advertise across thousands of stores because point-of-sale advertisements are significantly more successful than other digital advertisements for these types of brands. In fact; because point-of-sale/in store advertisements are proven to increase sales, it's actually a net negative for certain companies to not buy ad space on these screens since their sales could be easily displaced by competitors.\n\nAs an advertiser, you don’t want to buy 10,000 screens and get them installed at every store so you can advertise, it's too expensive and you also don’t know how successful they advertisements are, you’ve sent the advertisements out but you never know if they’re successful or not because you don’t receive any data(impressions, engagement, actions as a result of advertisement).\n\nVSBLTY gives precise data on if people are looking at the screen, how long they’re looking, if they made a purchase because of that advertisement. Advertisements may also change based on the viewers demographic. There's also security benefits, the built in cameras scan for high temperatures(covid) and also weapons &amp; store items like a pepsi or coke bottle.\n\nAs an advertiser you’re incentivised to use vsblty because you get the data back and know if your advertisement was successful or not. \n\nVSBLTY works with WestRock($15.3B mkt cap) for advertising connections, Intel- yes; Intel, &amp; Ability for chips and storage in cameras rather than cloud, and Grupo Modelo under Anheuser Busch($133B mkt cap) for the 50,000 store deal joint venture with Modelo &amp; Retailligent(vsblty gets 1/3 of media advertising revenue + 100% of licensing fees)\n\nBut that's all talk. Here’s the Math behind their most recent deal with Modelo:\n\nCurrent market cap is $68million usd.\n\nGoing off the lowest end of their expectations cumulatively into 2024 they’ll see $200m USD in revenue + $10m from licensing fees just from the Anheuser busch(Modelo) deal(VSBLTY gets 1/3 of joint venture ad rev, 100% of licensing fees), assuming 80% profitability (insinuated by CEO) because it’s SaaS(Software as a Service, high margins), that's about $50.4m  in net income. $50.4/4years + 10/4years = $15.1m a year net income at a pe(price to earnings) ratio of 94.02(average for a SaaS business) makes a market cap of $1,419B by 2025, about 20.86x the current market cap.\n\nThis is assuming they do literally nothing but hold up the ABI deal and hit the low end of their self-proclaimed modest estimations, if they do anything else at all it could continue to grow larger.\n\nhttps://preview.redd.it/pegt8zor0dx61.png?width=1330&amp;format=png&amp;auto=webp&amp;s=10476d7dfbb2455c78575b76185d8aa0832ce104\n\nIt will be interesting to see the thesis play out. My main concern is that their earnings expectations are overly optimistic, but we’ll know soon if their earnings expectations are honest by seeing how well they check off with the late 2020 and 2021 earnings. Also, increased covid cases/a new strain and the shut down of retail stores would be negative for obvious reasons, but it would likely only delay future earnings, they were able to survive the original shutdown just fine.\n\nAdditionally, Grupo Modelo under ABI will be buying 9.9% of the company through warrants at $67cents USD:\n\nhttps://preview.redd.it/gfpk8d0q0dx61.png?width=1704&amp;format=png&amp;auto=webp&amp;s=1ddecfe937d0dcb18d6665dbc0214071e9763a0e\n\nThis is particularly interesting that ABI wants a part of the deal, the fact that they’re putting their money on the line investing in the company speaks louder than words.\n\nIf they hit expectations, really great upside, 20.86x by my estimates.\n\n[https://vsblty.net/wp-content/uploads/2021/03/VSBY3.30.21-1.pdf](https://vsblty.net/wp-content/uploads/2021/03/VSBY3.30.21-1.pdf) page 13 for data on expectations\n\nTL;DR, read it. Could be your biggest mistake if you don’t.",
        "subreddit": "pennystocks",
        "title": "VSBGF, Disruptive in-store ad/security company with 20x upside potential.",
        "url": "https://www.reddit.com/r/pennystocks/comments/n5pjts/vsbgf_disruptive_instore_adsecurity_company_with/",
        "created": 1620274859.0
    },
    {
        "author": "GiuseppinaMcgrady",
        "created_utc": 1620654397,
        "id": "n94tgz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "CSE: GSQ \n\nRecently on May 5th, Gamesquare partnered with Even Matchup Gaming that owns and operates the largest fighting game tournament in Canada and also the largest Super Smash Bros. event in New York. There seems to be a constant with new and bright items on their plate.\n\nGamesquare Esports flew over my head for a while until I did some digging into some broadcasted tournaments. Some of the biggest names you've always heard of are organized by this company to allow it to happen. Names such as Dr. D, CodeRed, League of Legends, Crossfire, Twitch, and Steam. They have also worked alongside some of the industry monsters like AMD, Valve, Intel and Blizzard. Already a proven track record and the industry is only getting bigger.\n\nThey don't quite run these entire brands themselves, but they work directly with them and their clients to bring content from across the globe to your screen that you probably spend too much time on.\n\nTheir agency CodeRed Esports runs events such as\n\n* Blizzcon\n* Quakecon\n* $20M The International\n\nGamesquare itself was shortlisted the 2018 and 2019 Esports Supporting Agency of the year.\n\nWith all that being said, market cap is well undervalued at $21M. Less than a week ago, they reported a 97% YoY Revenue growth in Q1 2021. The entire E-sports industry created almost a billion USD un revenue\n\nThis can be attributed to the recent appointment of former FaZe Clan CFO as CEO of Gamesquare.\n\nThe firm already reaches 65+M unique viewers a month with a reported proprietary technology that enables the lowest cost ad campaigns under high quality resolutions.\n\n&amp;#x200B;\n\nStay safe, this is not financial advice!",
        "subreddit": "pennystocks",
        "title": "Gamesquare bringing a new partnership to the table! Great promise",
        "url": "https://www.reddit.com/r/pennystocks/comments/n94tgz/gamesquare_bringing_a_new_partnership_to_the/",
        "created": 1620683197.0
    },
    {
        "author": "hugosilvarocha",
        "created_utc": 1620034171,
        "id": "n3ryun",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " Dear friends, the best dividend stock to buy now on the 1st Week of May 2021 with dividends above &gt;5% with quarterly payments is $VNO and other stocks this week are $INTC, $WMT, $PFE, $AAPL and $ET. Know what is going to happen this week with the market analysis of $SPX500 and $BTC, check my portfolio performance and how to copy trade and simulate. You can check all this on the video below.\n\nhttps://preview.redd.it/0ubhz6fsjvw61.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=ba1c18a85876cb158686fb416aada81b5d5aad8f\n\nhttps://youtu.be/T1fY0VRJRjI",
        "subreddit": "pennystocks",
        "title": "BEST DIVIDENDS STOCKS TO BUY NOW | 1st Week of May 2021 | Market and Analysis",
        "url": "https://www.reddit.com/r/pennystocks/comments/n3ryun/best_dividends_stocks_to_buy_now_1st_week_of_may/",
        "created": 1620062971.0
    },
    {
        "author": "disoriented_llama",
        "created_utc": 1622221955,
        "id": "nn2lfm",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "*This is not financial advice, and I am not a financial advisor of any kind. I eat crayon sandwiches. WITH MAYO!)\n\n&amp;#x200B;\n\n1. Read the House of Cards Trilogy by u/atobitt because unless you have read it, you essentially understand nothing. \n2. Turn off margin accounts and convert to cash account. Different steps for every broker. My broker asked me to send an email to customer service. I use TD.\n3. Turn off stop losses. \n4. Get the fuck out of Robinhood. \n5. Know my sell floor. Know how to distinguish a dip from the way down from a peak. For me, this came from studying past squeeze charts and also knowing that I am hodling for a specific floor. That makes things much easier. \n6. Get as far as I can from the Original WSB sub. It is a shitshow of bad intel, shills, and losers who hate apes. \n7. Laugh at, make memes of, but NEVER trust the media. Especially Rich Greenfield and Jim Cramer. Generally, whatever they say, do the opposite. \n8. Learn about Plan B and make sure to join Discords and other social networking platforms when, not if, Reddit is compromised or goes dark. \n9. Laugh at the assholes on GMEMeltdown and WallStreetBetsOGs for being so arrogant and pathetic they had to essentially make a Mean Girls table sub because they have nothing else going for them but their vitriolic, narcissistic, toxic personas, and their microscopic peckers. \n10. Buy. Hodl. Eat a pack of crayons. Wait. Sell on the way down, and live a good life doing good for other people unlike the hedge scum fucks who hoard wealth like a bunch of demented Scrooge McDucks. \n\nOh, and every so often, as we depart for new moons and distant horizons, eat a banana, think of your fellow apes, and smile. Even though we may never meet, we will always be right there beside you. It's our turn now. Don't fuck it up.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The Baby Ape's Guide to the Galaxy",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/nn2lfm/the_baby_apes_guide_to_the_galaxy/",
        "created": 1622250755.0
    },
    {
        "author": "JohnLouis24",
        "created_utc": 1620498767,
        "id": "n7vfd5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "The following is an excerpt taken from StockTwits user “DTGoody”\n\n*The Problem*\n\nIoT devices are a powerful new technology, however, they also create new opportunity for hackers as billions of new entry points that can result in devastating losses for the businesses using them. An enormous and growing unmet need for effective cybersecurity for IoT is demonstrated very clearly by the soaring number of breaches that continue to result in millions of dollars per incident and billions of dollars in losses every year. \n\nAs Niraj Kadakia of IBM Business Development and Embedded Analytics stated above, we clearly have vulnerabilities and a big unmet need for improved secure IoT solutions. \n\n*The Solution*\n\nLife On Earth, Inc. (LFER: OTC) recently announced their Binding Letter of Intent to purchase 100% of SmartAxiom, Inc., a provider of patented technologies based cyber security with unbreakable block chain based IoT solutions for multiple industries that include machine to machine (M2M) communications. \n\nThere are competing cybersecurity solutions for IoT, however, none yet seems to work well enough to prevent hackers from stealing valuable data. \n\nSmartAxiom has built a patented solution based on the decentralized ledger of Blockchain that is getting the attention of big users such as, CSCO, INTC, IBM, MRVL, TOY, HPE, Volvo, Mazda, Xerox, MSFT, Amazon Web Services, Renesas, NXP, NuLeds, boa, Globe Teleservices. \n\nThe next excerpt (below) is from StockTwits user “Chris T” - He does a good job on explaining the significance of the recent $1.6M investment made on LFER by Joseph A:\n\nFor those who don't know who Joseph Abrams is.....see below: \n\nSource:https://www.cicerotransact.com/team \n\nJoe Abrams is co-founder of The Software Toolworks, a publicly held developer, publisher, and distributor of educational and entertainment software, which was sold to Pearson, Plc. for $462 million. Mr. Abrams also co-founded Intermix, the predecessor company to MySpace, which was sold to News Corp. in 2005 for $580 million. He has also served on the Board of Advisors for Akeena Solar and and was an adviser to ZAAG, assisting in public offerings, acquisitions and capital raisings. \n\nMr. Abrams specializes in emerging growth companies in several areas including: technology, drug discovery technology services, consumer products,big data and online job placement. Mr. Abrams also sits on University of Rochester Simon School of Business Executive Advisory Committee.",
        "subreddit": "pennystocks",
        "title": "$LFER - Plans to acquire SmartAxiom Inc. (HUGE NEWS)",
        "url": "https://www.reddit.com/r/pennystocks/comments/n7vfd5/lfer_plans_to_acquire_smartaxiom_inc_huge_news/",
        "created": 1620527567.0
    },
    {
        "author": "LazyHater",
        "created_utc": 1621442867,
        "id": "ngasvr",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "AMD wants to spend $4b on buybacks when they have only $2b on hand and btw c o m p e t i t i o n. Intel be opening plants in America and AMD be like ima buy my own shares. The buyback bet is not applicable in a rate hike environment, it just limits the downside. They dont even have the money ffs.",
        "subreddit": "wallstreetbets",
        "title": "AMD buybacks are trash",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ngasvr/amd_buybacks_are_trash/",
        "created": 1621471667.0
    },
    {
        "author": "UndergroundTD",
        "created_utc": 1621898411,
        "id": "nkb9wx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Gonna blow up and smoke you all out.  In for some intel coming up.... CHECK OUT OGI",
        "subreddit": "wallstreetbets",
        "title": "OGI CANNABIS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nkb9wx/ogi_cannabis/",
        "created": 1621927211.0
    },
    {
        "author": "Old_Prospect",
        "created_utc": 1622129760,
        "id": "nma4tj",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Greetings Gents,\n\nFirst off, this is not professional financial advice…invest at your own peril. \n\nI'm a day early for my 2-week interval here, but I'm going on vacation tmrw. I'll make this quick...\n\n**Quick explanation (skip if you’ve seen this before):** \n\nTaking a look at the market sector strengths in relation to the SPY. Then going from there.\n\nFor a little more info, see first post [here.](https://www.reddit.com/r/thetagang/comments/ncz2jj/relative_rotation_graphs_5142021/)\n\nCredits: [Stockcharts.com](https://Stockcharts.com)\n\n**S&amp;P ETFs:**\n\n|XLB --&gt;   Materials|XLI --&gt;   Industrials|XLRE --&gt; Real   Estate|\n|:-|:-|:-|\n|XLE --&gt; Energy|XLF --&gt;   Financials|XLK --&gt; Tech|\n|XLC --&gt; Communications|XLP --&gt; Consumer   Staples|XLU --&gt;   Utilities|\n|XLV --&gt; Health   Care|XLY --&gt; Consumer   Discretionary||\n\n&amp;#x200B;\n\n[Daily](https://preview.redd.it/ia53lg7glo171.png?width=563&amp;format=png&amp;auto=webp&amp;s=d7bdb6a6877f67ab18503e9fdbf0d697bec06774)\n\n[Weekly](https://preview.redd.it/ftje9jzjlo171.png?width=559&amp;format=png&amp;auto=webp&amp;s=1bdba9b1c407ef7e89c13b9c963c39a994116fb1)\n\n# Discussion:\n\n**What’s a good bet in the short term?**\n\nConsumer Discretionary (XLY) and Tech (didn’t think I’d be saying that) is looking pretty nice in the short term. The follow companies in Tech (XLK) have shown some strength and gone on a bit of a run.\n\nhttps://preview.redd.it/utk79n1qlo171.png?width=624&amp;format=png&amp;auto=webp&amp;s=c33200cbf190f0898afe16c76a22a9353257f036\n\nThe following companies are showing signs they may run up in the coming months. Personally, I’d narrow my research to these companies. I’m a semiconductor nerd, so I’m happy to see signs of a turnaround in INTC, AMD, and MU.\n\nhttps://preview.redd.it/sz9ubhkslo171.png?width=624&amp;format=png&amp;auto=webp&amp;s=43812473c30a230ed2108ef37c6954bb2e3cda64\n\n**What’s a good bet in the long term?**\n\nUtilities (XLU), Consumer Staples (XLP), and Healthcare (XLV) all look like good sectors for long term bets. The problem is that they are starting to underperform the SPY in the short term.\n\nXLRE seems to be floating around with the SPY, and slightly outperforming in the short term. \n\nPersonally, I’m going to focus on short term investments within strong short term sectors until I see the trajectory for these long term plays start to turn around in the short term.\n\n**This is a Casino Sir - My Bets/Positions:**\n\n**XLK -– Long Call - 7/16 @ 0.7 delta**\n\n**XLY -– Long Call - 7/16 @ 0.7 delta**\n\nWanted to enter a PAYC PCS but the B/A was too wide.\n\n**MU –- PCS – 7/16 @ 0.7 delta for credit &gt; 1/3 strike width**\n\n“The men who have succeeded are men who have chosen one line and stuck to it.” – Some Rich Asshole \n\n**Can I get a TL;DR?**\n\n*TL;DR – Ride waves to the moon. Check my positions.* 🏄🚀🌕",
        "subreddit": "wallstreetbets",
        "title": "Relative Rotation Graphs: 5/27/2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nma4tj/relative_rotation_graphs_5272021/",
        "created": 1622158560.0
    },
    {
        "author": "TreeHugChamp",
        "created_utc": 1620288721,
        "id": "n62c3i",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I am not a financial advisor and this is not financial advice. I wanted to provide a different perspective on investing that might entertain or help others. Nothing I say should be considered fact, but instead my opinion. There is no guarantee of returns, but I believe my method lowers the long term risk while maximizing on potential less volatile gains. I do not have any positions in these companies, but I intend to add some or all of these positions to my portfolio.        \n\nMy thesis is generated around the semiconductor meeting held by the White House. I believe the White House tipped their hand into which companies will be their preferred partners of the future. This article will provide a layout of which stocks may be considered attractive from a long term speculative point of view. https://www.bloomberg.com/news/articles/2021-04-09/white-house-to-host-over-a-dozen-companies-at-chips-meeting.          \n\nStellantis NV, General Motors, Cummins and Ford: old school American companies with a large number of employees and a large supply chain that relies on Ford and GM to remain in business. I believe they were invited to the meeting because of their relationship with Biden from the Obama administration. Gas for tronics 2.0?       \n\nAlphabet: tech company that has government contracts. Can provide unique insight into current and future trends based on search history.           \n\nDell, HP, Medtronic: computer and medical equipment manufacturers. It’s interesting how Nvidia and AMD were left off the invite list.         \n\nMicron, Taiwan Semiconductor, Samsung, Intel: semiconductor manufacturers. We all know about the chip shortage.       \n\nAT&amp;T: possible link to 5g capabilities/access. I’m wondering who the government is going to give their grant money to for providing rural areas with affordable internet and broadband.         \n\nNorthrop Grumman: we all know about the b-21. I believe that is likely why they got the invite, but there is also the potential that they are developing the 6th gen fighter of choice for the military.         \n\nNo price points, no buy or sell recommendations, do your own research if you’re looking for reasons to buy or sell.",
        "subreddit": "wallstreetbets",
        "title": "A Tree Hugging guide towards speculative long investing.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n62c3i/a_tree_hugging_guide_towards_speculative_long/",
        "created": 1620317521.0
    },
    {
        "author": "Murky_Treacle_8621",
        "created_utc": 1620215616,
        "id": "n5e444",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Is AMD, NVDA, or INTEL the Best Buy right now?",
        "url": "https://www.reddit.com/r/investing/comments/n5e444/is_amd_nvda_or_intel_the_best_buy_right_now/",
        "created": 1620244416.0
    },
    {
        "author": "VastTerror",
        "created_utc": 1619983400,
        "id": "n3dqza",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Intel to invest $600 million to expand chip, Mobileye R&amp;D in Israel",
        "url": "https://www.reddit.com/r/investing/comments/n3dqza/intel_to_invest_600_million_to_expand_chip/",
        "created": 1620012200.0
    },
    {
        "author": "disoriented_llama",
        "created_utc": 1620906075,
        "id": "nbemyr",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "TL; DR: Join r/TheGloryHodl. Maybe learn shit. Maybe not. \n\nIf anyone here is interested in being a part of a smaller, information only, semi-private sub—kind of like a library for apes who wear monocles and spinny hats—check out r/TheGloryHodl. It’s for AMC and GME holders alike. Many of us hold both, myself included. \n\nr/TheGloryHodl is for those among us who really like research and reading and investigating shit. It’s like a library...But it smells worse.\n\nAt r/TheGloryHodl, we compile information like the autists we are and stare at it all while ribbons of drool hang from our gaping ape mouths for hours on end. Pretty productive, right? Anyway, we can use a little help from some more experienced apes out there. I know there are a lot of subs, but the point of this one is to collect information from all of them and get it in one place. It’s probably a stupid idea, but I find it more efficient than reading endless sub feeds trying to find DD and stuff. \n\nAnyway, everyone can view the information r/TheGloryHodl, but not everyone can post because we want to try and keep shills and bad intel out. Hope it helps those of us who have too many kids, too many wives, and too many wives boyfriends to take care of. \n\nCheers,\nMister Llama",
        "subreddit": "Wallstreetbetsnew",
        "title": "TheGloryHodl (A library for apes!)",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/nbemyr/thegloryhodl_a_library_for_apes/",
        "created": 1620934875.0
    },
    {
        "author": "JorbarTrader",
        "created_utc": 1622149597,
        "id": "nmhn8n",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "INTEL Strangle Strategy",
        "url": "https://www.reddit.com/gallery/nmhn8n",
        "created": 1622178397.0
    },
    {
        "author": "JorbarTrader",
        "created_utc": 1622149465,
        "id": "nmhlkl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "INTEL Option Strategy",
        "url": "https://www.reddit.com/r/options/comments/nmhlkl/intel_option_strategy/",
        "created": 1622178265.0
    },
    {
        "author": "Playful_Ruin",
        "created_utc": 1622120740,
        "id": "nm70j0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC current price is way high for what AMC is worth , people will not go back to movie theatres any time soon if all , AMC is the next kodak , stay away from this and invest your hard earned money in growth stocks like apple , google , tesla , and intel Be careful apes",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nm70j0/amc_current_price_is_way_high_for_what_amc_is/",
        "created": 1622149540.0
    },
    {
        "author": "current-asscoverer",
        "created_utc": 1620157893,
        "id": "n4wfiy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Intel has risen on news that it will spend $20B on establishing chip manufacturing factories in Arizona, but this news is more bearish than bullish to me.\n\nInvesting in Intel now, is nonsensical once you consider the full situation. I reiterate my bearish position on Intel and recommend a diagonal put play.\n\nI’ve more-or-less officially been an Intel bear for a few months now. As of late, many have asked me whether I am changing my stance on Intel due to its $20B manufacturing facility (FAB) production project. As much as I would love to reverse directions and proclaim myself a born-again Intel bull, I must objectively call Intel’s announcement as another bearish catalyst. In light of this news, I am happy to double down. Today, I will explain my viewpoint.\n\n*The Fab Ahab:*\n\nAhab was the seventh king of Israel. He inherited a powerful kingdom but was eventually brought down due to his own vices and not upholding his responsibilities. Many consider Ahab to be Israel’s worst king.\n\nIntel shares many similarities with Ahab. The company easily dominated the chip kingdom with its x86 IP, but this made Intel a bit too complacent: Easy money from x86 led the company to focus more on maintaining the status quo than moving the foundry market forward. In its comfort, Intel has lost its partnership with Apple (AAPL), who has successfully developed M1, a chip much more efficient than the previously used Intel x86 chips; failed to keep up with the shrinking node trends, currently struggling to produce 10nm chips while others are working on 3nm; and has even been overtaken by AMD, which long sat in Intel’s giant shadow. Intel’s story – to me – looks like a downfall story in the making.\n\nIntel finally sees the need to fight back, and the two fabs in Arizona, due 2024, at the cost of $20B is the latest strategy. However, it is a risky strategy. Adding fabs to the business is not just a one-time cost of the $20B but requires consistent upkeep and upgrade costs, something more like $20B per year, which, over the coming decade, would be more than Intel’s total current equity. Intel is thus further adding operational costs to its business during a time when the company is expected to see shrinking revenue and earnings. Typically, the responsible reaction to such earnings decay is to cut down on costs. Intel would seemingly rather throw Hail Marys.\n\n*Hail Mary:*\n\nI call the fab announcement a Hail Mary not because adding fabs is inherently a bad idea but because Intel seems to have little time remaining on the clock to benefit from this action before it finds itself well behind its competitors. Intel should have built fabs years ago when it was still the market leader and still growing earnings. Intel could have become the go-to chip manufacturer in the US, but now it faces an uphill battle in light of how strong Taiwan Semiconductor Manufacturing Company (NYSE:TSM) and Samsung (OTC:SSNLF) have grown over the past decade.\n\nAt roughly the same time as Intel’s announcement to build fabs in Arizona, TSMC (henceforth TSM) announced its own fab construction in Arizona. Clearly, there is a rush to build fabs in the US, and the reason, too, is clear: China. The US reliance on Taiwanese fabs combined with increasing concerns over a Chinese invasion of Taiwan means that the US would love a modern fab stateside. That is, Intel’s decision to create fabs at this time was not decided in a vacuum; instead of the decision being a business-focused decision, it is a situation-focused decision – a decision of convenience rather than one for the sake of shareholders.\n\n*Intel’s Fab Focus In Question:*\n\nIntel could be attempting to cozy up to the US government with its new fabs. The Department of Defense certainly wants some fabs stateside as China’s shadow grows over Taiwan. Intel might be playing the Tesla (TSLA) game by looking for taxpayers to help subsidize its business, gaining a novel edge over AMD.\n\nIn any case, I don’t see the news fabs to be transformative for Intel in the positive sense. If Intel is really going all-in on fabs, we will need many years before we see a significant payoff. Investing in INTC now, during a time of nose-bleed tech valuations and during earnings contractions is not a smart investment decision.\n\nAnd if Intel is looking for government subsidies by being the main US chip manufacturer, this is essentially a white flag; Intel cannot compete in the game of technological advancements and needs a handicap. This is not Tesla being subsidized as it forays into a fledgling industry but an old, stubborn company attempting to stay afloat via means outside its own merits. You would be better off investing in AMD or TSMC if you want exposure in US chip design or manufacturing.\n\nOverall, I reiterate my bearish outlook on Intel relative to the rest of the chip industry. The upward momentum in Intel and its current price are not sustainable by the news: The fabs and other aspects I’ve mentioned in previous articles are perceived as bullish while they are in fact bearish.",
        "subreddit": "StockMarket",
        "title": "Why You Should Short the Intel Fab Play",
        "url": "https://www.reddit.com/r/StockMarket/comments/n4wfiy/why_you_should_short_the_intel_fab_play/",
        "created": 1620186693.0
    },
    {
        "author": "dsf2100",
        "created_utc": 1621609121,
        "id": "nhuiy1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "Further Confirmation of Enzolytics $ENZC and Intel Collaboration",
        "url": "https://i.redd.it/fciqy0hymh071.jpg",
        "created": 1621637921.0
    },
    {
        "author": "JorbarTrader",
        "created_utc": 1622149372,
        "id": "nmhk8l",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Option Strategy Strangle #INTC",
        "url": "https://www.reddit.com/r/options/comments/nmhk8l/option_strategy_strangle_intc/",
        "created": 1622178172.0
    },
    {
        "author": "UnfairWorldliness426",
        "created_utc": 1622112761,
        "id": "nm4riq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "If [$Wish] Goes to 50$ I will quit my job, piss on my bosses desktop and fuck his wife in my new Lambos [Intel then, I'm broke :D ]",
        "url": "https://i.redd.it/xo5u6hmb8n171.jpg",
        "created": 1622141561.0
    },
    {
        "author": "628rand",
        "created_utc": 1620341950,
        "id": "n6k7hi",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " How many total open interest calls were added on Wednesday:\n\n1. $UBER: 120,097\n2. $ASO: 62,016\n3. $AMD: 58,738\n4. $SABR: 57,272\n5. $PTON: 54,958\n6. $PLTR: 50,313\n7. $AAPL: 49,222\n8. $TPR: 47,657\n9. $UNFI: 45,317\n10. $RDFN: 42,802\n11. $BA: 38,389\n12. $CCJ: 37,345\n13. $EQT: 37,136\n14. $TSLA: 37,125\n15. $AMC: 34,520\n\nHow many total open interest puts were added on Wednesday:\n\n1. $UBER: 73,926\n2. $PFE: 65,369\n3. $AAPL: 64,635\n4. $PTON: 64,226\n5. $F: 50,188\n6. $AMD: 43,898\n7. $FCX: 34,347\n8. $TSLA: 34,192\n9. $PYPL: 33,996\n10. $RDFN: 33,054\n11. $TPR: 31,512\n12. $UNFI: 31,174\n13. $BA: 28,901\n14. $INTC: 25,468\n\n(Data from [www.stonks.fyi](https://www.stonks.fyi/))",
        "subreddit": "Wallstreetbetsnew",
        "title": "Changes to Calls/Puts Open Interest Holdings Wednesday, May 5 End of Day",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n6k7hi/changes_to_callsputs_open_interest_holdings/",
        "created": 1620370750.0
    },
    {
        "author": "is_this_the_restroom",
        "created_utc": 1620905976,
        "id": "nbem12",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Symbol\tType\tChange%\tStrike\tPrice\tOI\tVolume\npenn\tcall\t3350\t74.00\t3.24\t69\t69\nhd\tput\t15300\t260.00\t0.05\t154\t154\nhd\tput\t5800\t265.00\t0.05\t236\t232\ntwtr\tcall\t1033\t46.00\t4.80\t34\t80\ntwtr\tcall\t1220\t49.00\t2.07\t198\t219\nriot\tcall\t3500\t17.00\t9.35\t36\t38\nriot\tcall\t1112\t26.00\t1.60\t1,928\t2,224\nintc\tcall\t3025\t53.50\t0.70\t500\t691\nfubo\tput\t1449\t19.50\t0.93\t1,162\t12,247\nxom\tcall\t1152\t59.00\t1.26\t501\t578\namzn\tput\t2850\t3,580.00\t418.45\t59\t129\namzn\tput\t4800\t3,585.00\t436.44\t49\t117\namzn\tput\t1433\t3,595.00\t432.86\t46\t95\ndis\tcall\t3350\t157.50\t20.85\t69\t70\nqqq\tput\t9836\t260.00\t0.01\t1,093\t50\nqqq\tput\t8393\t295.00\t0.21\t37,373\t2,269\nqqq\tput\t1415\t300.00\t0.35\t32,310\t20,561\nqqq\tput\t1287\t334.00\t17.45\t5,146\t81\nqqq\tput\t5987\t340.00\t23.05\t5,296\t226\nqqq\tput\t2452\t345.00\t28.23\t536\t122\nqqq\tput\t1259\t346.00\t17.28\t299\t10\nqqq\tput\t3800\t348.00\t31.20\t78\t30\nqqq\tcall\t1984\t352.00\t0.01\t1,647\t5\nqqq\tcall\t4425\t360.00\t0.01\t1,403\t6\ngoog\tput\t3750\t2,045.00\t0.65\t154\t201\ngoog\tput\t1200\t2,055.00\t0.90\t13\t13\ngoog\tcall\t1700\t2,242.50\t22.08\t18\t27\ngoog\tcall\t1733\t2,245.00\t18.50\t55\t91\ngoog\tcall\t1200\t2,247.50\t18.27\t13\t33\ngoog\tcall\t2633\t2,262.50\t15.70\t82\t103\ngoog\tcall\t1455\t2,305.00\t2.40\t280\t326\nnlok\tcall\t3497\t26.00\t0.30\t1,223\t1,431\nlmnd\tcall\t1300\t55.00\t7.00\t28\t36\nlmnd\tcall\t1820\t60.00\t2.35\t480\t999\nlmnd\tcall\t4988\t65.00\t0.60\t1,272\t4,188\n\nI'm looking at buying some 300P on QQQ. [https://optionsentiment.live/s/qqq](https://optionsentiment.live/s/qqq)\n\nIt seems to be up in pre-market so that should allow me to buy at a little discount (closed at 316, up to 318 in pre-market). \n\nWith how red both asia and the eu have been, it's looking like a decent down day today, and the QQQ 300Ps looks super liquid. \n\nWhat are your guys' thoughts?",
        "subreddit": "options",
        "title": "Options OI change strong changes detected for May 13th with expiration on May 14th",
        "url": "https://www.reddit.com/r/options/comments/nbem12/options_oi_change_strong_changes_detected_for_may/",
        "created": 1620934776.0
    },
    {
        "author": "628rand",
        "created_utc": 1620341905,
        "id": "n6k70b",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " How many total open interest calls were added on Wednesday:\n\n1. $UBER: 120,097\n\n2. $ASO: 62,016\n\n3. $AMD: 58,738\n\n4. $SABR: 57,272\n\n5. $PTON: 54,958\n\n6. $PLTR: 50,313\n\n7. $AAPL: 49,222\n\n8. $TPR: 47,657\n\n9. $UNFI: 45,317\n\n10. $RDFN: 42,802\n\n11. $BA: 38,389\n\n12. $CCJ: 37,345\n\n13. $EQT: 37,136\n\n14. $TSLA: 37,125\n\n15. $AMC: 34,520\n\nHow many total open interest puts were added on Wednesday:\n\n1. $UBER: 73,926\n\n2. $PFE: 65,369\n\n3. $AAPL: 64,635\n\n4. $PTON: 64,226\n\n5. $F: 50,188\n\n6. $AMD: 43,898\n\n7. $FCX: 34,347\n\n8. $TSLA: 34,192\n\n9. $PYPL: 33,996\n\n10. $RDFN: 33,054\n\n11. $TPR: 31,512\n\n12. $UNFI: 31,174\n\n13. $BA: 28,901\n\n14. $INTC: 25,468\n\n(Data from [www.stonks.fyi](https://www.stonks.fyi/))",
        "subreddit": "options",
        "title": "Changes to Calls/Puts Open Interest Holdings Wednesday, May 5 End of Day",
        "url": "https://www.reddit.com/r/options/comments/n6k70b/changes_to_callsputs_open_interest_holdings/",
        "created": 1620370705.0
    },
    {
        "author": "disoriented_llama",
        "created_utc": 1620907914,
        "id": "nbf6hd",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "TL; DR: Join r/TheGloryHodl. Maybe learn shit. Maybe not. \n\nIf anyone here is interested in being a part of a smaller, information only, semi-private sub—kind of like a library for apes who wear monocles and spinny hats—check out r/TheGloryHodl. It’s for AMC and GME holders alike. Many of us hold both, myself included. \n\nr/TheGloryHodl is for those among us who really like research and reading and investigating shit. It’s like a library...But it smells worse.\n\nAt r/TheGloryHodl, we compile information like the autists we are and stare at it for hours on end while ribbons of drool hang from our gaping ape mouths. Pretty productive, right? Anyway, we can use a little help from some more experienced apes out there. I know there are a lot of subs, but the point of this one is to collect information from all of them and get it in one place. It’s probably a stupid idea, but I find it more efficient than reading endless sub feeds trying to find DD and stuff. \n\nAnyway, everyone can view the information r/TheGloryHodl, but not everyone can post \n/comment because we want to try and keep shills and bad intel out. Hope it helps those of us who have too many kids, too many wives, and too many wives boyfriends to take care of. \n\nCheers,\nMister Llama",
        "subreddit": "Wallstreetbetsnew",
        "title": "TheGloryHodl (A library for apes!)",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/nbf6hd/thegloryhodl_a_library_for_apes/",
        "created": 1620936714.0
    },
    {
        "author": "disoriented_llama",
        "created_utc": 1620930665,
        "id": "nbno9n",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "TL; DR: Join r/TheGloryHodl. Maybe learn shit. Maybe not. \n\nIf anyone here is interested in being a part of a smaller, information only, semi-private sub—kind of like a library for apes who wear monocles and spinny hats—check out r/TheGloryHodl. It’s for AMC and GME holders alike. Many of us hold both, myself included. \n\nr/TheGloryHodl is for those among us who really like research and reading and investigating shit. It’s like a library...But it smells worse.\n\nAt r/TheGloryHodl, we compile information like the autists we are and stare at it for hours on end while ribbons of drool hang from our gaping ape mouths. Pretty productive, right? Anyway, we can use a little help from some more experienced apes out there. I know there are a lot of subs, but the point of this one is to collect information from all of them and get it in one place. It’s probably a stupid idea, but I find it more efficient than reading endless sub feeds trying to find DD and stuff. \n\nAnyway, everyone can view the information r/TheGloryHodl, but not everyone can post \n/comment because we want to try and keep shills and bad intel out. Hope it helps those of us who have too many kids, too many wives, and too many wives boyfriends to take care of. \n\nCheers,\nMister Llama",
        "subreddit": "Wallstreetbetsnew",
        "title": "TheGloryHodl (A library for apes!)",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/nbno9n/thegloryhodl_a_library_for_apes/",
        "created": 1620959465.0
    },
    {
        "author": "AngeloMonharti",
        "created_utc": 1621525074,
        "id": "nh3fd0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I have done so much DD on this play and I really want to share it with you guys since WSB is the reason I started investing over a year ago.\n\nIn this post I'm going to not talk about some kind of currency that can get this post removed. Hint: it crashed big time yesterday. You know the one.\n\nThere is a new kind of this currency that uses a lot of computer storage space. How much? Well - 7 EXABYTES and it's currently adding 1 exabyte every 3 days. I'm going to assume you know about this currency and if not you can look through my post history and see which subreddit I've posted to recently involving this particular one.\n\n#Topics of discussion:\n\n*Why WDC is going to moon in the next 2-12 weeks\n\n*WDC Fundamentals\n\n*Bear case\n\n**If you are reading this on May 20th - you are early**\n\nWDC just came off one of their best earnings beats in recent memory. WDC was a beaten-down stock in 2018 after NAND (SSD memory) prices declined, and analysts thought that HDDs (spinning disk hard drives) were going the way of the dinosaur. They did saw a big increase in data center sales and consumer devices (think external drives for work from home setups) but analysts priced in declining sales in 2021 as covid restrictions begin to end. By all accounts, it looked like WDC had no future growth prospects and should be some kind of dividend-yielding boomer stock. WDC reported earnings in April for the quarter ended March 31 - with revenues down only 1% compared to the 20% that analysts expected. The EPS was way higher than expected - non-gaap was expected to be around 0.68, and WDC delivered 1.02. The analysts are already wrong and they don't know what else is coming: The new currency thing that I won't name. They didn't even mention it in the earnings call. None of the investors on the line in the Q&amp;A even asked about it. It's totally under the radar. In the next quarter, WDC is going to deliver their biggest earnings beat ever, and they are going to raise their revenue guidance for the rest of the year as a result, possibly by a gigantic, unheard of margin due to the new demand caused by the currency. When this happens, this stock is going to test its ATHs at around $110 per share but I would not be surprised to see a new ATH far above anything in the past. This stock can double, and it's going to happen AT THE LATEST during WDC's next earnings call. This is expected first week of August. \n\n#Fundamentals\n\nWDC is an American company, they have been publicly traded since 1973 and they have been part of the S&amp;P 500 index since 2009. This is a solid company - we are not betting on dog shit turning to gold, we are betting on gold turning to diamond. WDC has like 64k employees, and is vertically integrated in HDDs and SDDs thanks to a long road of acquisitions like SanDisk in 2016. They own their own supply chain, so they can make bigger margins in the event of the inevitable price increases reminiscent of the GPU market thanks to another currency.\n\nWDC is close to fairly valued at the moment at about $70 per share. They saw some spikes to 75+ recently after earnings but it keeps selling off due to WDC suspending their dividend and boomers wanting out, plus S&amp;P indexes falling and selling off here and there. Suspending the dividend is MAJOR good news. This company has been stagnant for a while, but they are ready to expand. They want to be a growth company again, and they are going to get it when they realize increased HDD and SSD demand is here to stay.\n\n#The new reality is not priced in: WDC's TAM market just increased 50% and nobody knows about it\n\nAn industry expert at Forbes, Tom Coughlin, has estimated that WDC shipped 125 exabytes of HDD storage for Q1 2021. Next quarter, they are expected to ship around the same amount. WDC says there is seasonality but I really don't see it in the numbers. WDC owns somewhere about 35-40% of the HDD market, and around 17% of the SSD market.\n\nThe new currency is currently at 7 exabytes and consumes around 300+ petabytes daily at this point. Even after yesterday's events, the profitability is so high that even if it loses 50% of it's value, it's still worth buying HDDs over MSRP. Farmers can buy HDDs at $50 per TB (double the msrp market rate before the rise) and break even in 1 month. This is unheard of in the space. That's how profitable this is. While it's hard to farm solo if you are a small time farmer, it's worth it for the whales and the whales will eat HDDs until a 8TB drive goes for $400. WDC and Seagate are selling every drive they they can possibly make. If we apply WDC's market share to the current size of the network, we are looking at, conservatively, 2.5 exabytes of extra sales that is not expected or accounted for. \n\nLet's look at it another way - with 125 exabytes shipped in Q1, 90 days, that means WDC ships 1.38 exabytes daily. Half of this goes to datacenter clients in long-term contracts, so say 700 petabytes daily. If the new currency is growing at 300 petabytes daily, and 40% of those drives are WDC, that's an extra 17% more demand than anyone so far knows about. If that doesn't seem like a lot, it's because it's massively understated and not nearly as high as it is in reality.\n\nThe network space is a lagging indicator. People buy hard drives ahead of time, and fill them with plots over time. Plotting speed is the bottleneck. Behind that 7 exabytes of networks space is likely 7 exabytes empty space already purchased, waiting to be consumed, or even more. And its not only farmers buying drives - scalpers are buying drives to scalp the farmers too. Go look on amazon and tell me how many drives you see in stock that are bigger than 6 TB. They are sold out. Supply is also a bottleneck - the new currency would grow even faster if they could buy even more storage. For all intents and purposes, that 700 petabytes of storage provided to consumers daily is almost all consumed by currency farmers. If they could deliver double the storage to consumers, at 1.4 exabytes per day, they would probably still sell all of them.\n\nBut wait - there's more.\n\nWDC also makes SSDs, and Seagate does not (Seagate has 0.2% marketshare of SSDs). I didn't think the new currency would have much affect on the SSD market since the are needed in far smaller quantities than HDDs, and the go-to has mostly been enterprise drives by Intel and Samsung rather than WDC. But I was wrong. Just this morning, I was making my rounds on Amazon and noticed that WD SN750s 1TBs are almost out of stock, there are only 2 available. SN750 2TBs are out of stock. SN 850s are sold out. I'll go into why this is significant.\n\nA company called Phison makes SSD controllers. They recently said they are raising their prices 10% due to supply constraints as the new currency has driven up SSD demand. This is a big indicator that the SSD demand is actually super high. You know those SN drives I talked about earlier almost being out of stock? Yeah, WDC makes their own controllers for those. They don't need Phison. If other manufacturers have to buy more expensive controllers, WDC can just raise their prices and make that profit themselves. SSD demand is certainly less than HDD and it's lagging behind HDD, but an NVME SSD drive shortage could be right around the corner. The new currency is very intensive on the SSDs and they are destroyed quickly, so buying NVMEs are not one-time purchases, they are like the gas the fuels the car. They will need to be purchased as more and more HDDs are purchased continually.\n\n#Bear case\n\nNobody likes bears so I will address the risks quickly. The obvious risk is that the new currency is over priced and will either die out completely or crash to the point people will stop buying HDDs and the demand will only be a momentary spike in the rear view. I strongly do not believe this is the case and I think yesterday is a good test that shows that even under extreme pressure, the new currency is well positioned and strong. It's not going to 0 because of a market crash. I can go far into detail into why I believe this new currency is here to stay, and the demand will persist for potentially years, but I would have to say enough words that I think this post will just be removed.\n\nThe second risk is that NAND flash memory continues to decline in price. Since the pandemic the price has gone up, as datacenters are forced to expand, but I think the effects of the pandemic are not going to end any time soon and in fact that there will be no return to normal at all. I believe work from home is just going to be part of the future regardless of covid, which means more network and more servers and more data is going to be needed. I think the analyst expectation that revenue would collapse in 2021 as the pandemic ends and being surprised that it at least remained flat is going to be wind in WDC's sails even apart from the new currency's affects.\n\n#Summary TL;DR\n\nHDD demand has sold out everything there is to sell out. Price increases are imminent, and SSDs could follow soon. All of this is due to a new currency that uses HDDs and SSDs, which is currently so profitable that whales will continue to buy them even at 30, 50 or 100% premiums. None of this was accounted for in WDC's most recent earnings call, and the price has not reacted to it yet. This thing is a ticking time bomb. WDC was already on track to a better than expected 2021 and this will launch it to interstellar space.\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀Positions🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n[157 shares (Canadians unite!)](https://i.imgur.com/6y4p3ax.jpg)\n\n[1 leap Jan '23 70c](https://i.imgur.com/SAqvMhA.jpg)\n\nI believe that this trend is lasting all year and we are going to $150+. If you want to make a short term play and go balls deep I recommend July or October calls for 80-90c. If WDC's next earnings are the catalyst, the July calls may not be the best value, but there is a pretty good chance that the market will wake up and see that WDC is killing it well before the first week of August. If you are a real smooth brain ape, you can't go wrong with shares. There is virtually no downside risk, WDC was already turning heads this year even without the new currency. STONKS ONLY GO UP",
        "subreddit": "wallstreetbets",
        "title": "Western Digital Corporation ($WDC) DD - Why 2021 is going to be their best year ever and nobody knows about it yet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nh3fd0/western_digital_corporation_wdc_dd_why_2021_is/",
        "created": 1621553874.0
    },
    {
        "author": "andysinclair",
        "created_utc": 1621599923,
        "id": "nhr98c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Adobe came out on top and not surprisingly Exxon was bottom.\n\nIn the table below the 2nd column is the Total ESG Risk Score (from Sustainlytics) and the 3rd column is \"difference from peers\".\n\nA low risk score is \"good\" and vice-versa; for the peer comparison a negative number means the company has a better ESG rating than other companies in its industry/sector and vice-versa.\n\nAmazon stands out as particularly bad versus its peers whereas NVIDIA is doing particularly well.\n\nTesla for all its environmental credentials is down near the bottom, although the bottom 5 is dominated by pharma.\n\nI go into some detail on how I built this on my blog: [https://blog.excelpricefeed.com/2021/05/21/getting-started-in-ethical-investing](https://blog.excelpricefeed.com/2021/05/21/getting-started-in-ethical-investing)\n\nCompany | Total ESG Risk Score | Difference to Peers\n\n|Adobe Inc.|11|\\-8|\n|:-|:-|:-|\n|The Home Depot, Inc.|12|\\-5|\n|Cisco Systems, Inc.|12|\\-5|\n|NVIDIA Corporation|13|\\-9|\n|Microsoft Corporation|15|\\-4|\n|Mastercard Incorporated|16|\\-2|\n|The Walt Disney Company|16|\\-1|\n|Apple Inc.|17|0|\n|Intel Corporation|17|\\-5|\n|Berkshire Hathaway Inc.|17|\\-4|\n|Visa Inc.|17|\\-1|\n|Netflix, Inc.|17|2|\n|PayPal Holdings, Inc.|18|\\-1|\n|Verizon Communications Inc.|18|\\-4|\n|AT&amp;T Inc.|19|\\-3|\n|Comcast Corporation|19|4|\n|UnitedHealth Group Incorporated|21|\\-2|\n|Alphabet Inc.|22|4|\n|Pfizer Inc.|25|\\-3|\n|Facebook, Inc.|25|6|\n|The Procter &amp; Gamble Company|25|1|\n|The Coca-Cola Company|25|\\-2|\n|Bank of America Corporation|26|0|\n|Amazon.com, Inc.|27|11|\n|JPMorgan Chase &amp; Co.|28|2|\n|AbbVie Inc.|29|2|\n|Johnson &amp; Johnson|30|2|\n|Abbott Laboratories|30|7|\n|Tesla, Inc.|31|5|\n|Exxon Mobil Corporation|35|\\-3|",
        "subreddit": "investing",
        "title": "I looked at the top 30 stocks in the S&amp;P500 and performed some ESG analysis in Excel.",
        "url": "https://www.reddit.com/r/investing/comments/nhr98c/i_looked_at_the_top_30_stocks_in_the_sp500_and/",
        "created": 1621628723.0
    },
    {
        "author": "AshleyTheHumqn",
        "created_utc": 1620063689,
        "id": "n429s9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "need real info &amp; intel but effing reddit confuses me. not trying to break any rules but lets eff the SNDL shooters",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n429s9/need_real_info_intel_but_effing_reddit_confuses/",
        "created": 1620092489.0
    },
    {
        "author": "Stargate-Operations",
        "created_utc": 1622504223,
        "id": "npge65",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Anyone have any good intel on sonm (sonim technology)? Only news I came across is a couple new board members on the team, they sold new products overseas and 10million dollar agreement with t-mobile partners. Let me know whether it's a worthless stock or if it will see the light very soon.",
        "subreddit": "wallstreetbets",
        "title": "Sonm?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/npge65/sonm/",
        "created": 1622533023.0
    },
    {
        "author": "laniakea888",
        "created_utc": 1620320398,
        "id": "n6bzfp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Title says it all!",
        "subreddit": "wallstreetbets",
        "title": "Is it right time to YOLO on Intel (INTC) ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6bzfp/is_it_right_time_to_yolo_on_intel_intc/",
        "created": 1620349198.0
    },
    {
        "author": "UnfairWorldliness426",
        "created_utc": 1622113417,
        "id": "nm4xr0",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "If [$Wish] Goes to 50$ I will quit my job, piss on my bosses desktop and fuck his wife in my new Lambos [Intel then, I'm broke :D ]",
        "url": "https://v.redd.it/bl3olycdan171",
        "created": 1622142217.0
    },
    {
        "author": "Sad-Ad6176",
        "created_utc": 1622134662,
        "id": "nmbyhd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "TAWNF climbed 40% real quick any Intel on this stock?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nmbyhd/tawnf_climbed_40_real_quick_any_intel_on_this/",
        "created": 1622163462.0
    },
    {
        "author": "Stargate-Operations",
        "created_utc": 1622504939,
        "id": "npgm2y",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Anyone have any good intel on sonm (sonim technology)? Only news I came across is a couple new board members on the team, they sold new products overseas and 10million dollar agreement with t-mobile partners. Let me know whether it's a worthless stock or if it will see the light very soon.",
        "subreddit": "wallstreetbets",
        "title": "Sonm? (Sonim Technology)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/npgm2y/sonm_sonim_technology/",
        "created": 1622533739.0
    },
    {
        "author": "AshleyTheHumqn",
        "created_utc": 1620063523,
        "id": "n4276y",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "SNDL shorts (wall street / top brokerages / 'the man') continue to rise.. can we give them a little bull slap please =)\n\n&amp;#x200B;\n\n;-\\*",
        "subreddit": "wallstreetbets",
        "title": "need real info &amp; intel but effing reddit confuses me. not trying to break any rules but lets eff the SNDL shooters",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n4276y/need_real_info_intel_but_effing_reddit_confuses/",
        "created": 1620092323.0
    },
    {
        "author": "UncleMoonSoon",
        "created_utc": 1620741536,
        "id": "n9xmcs",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "($RLC) iExec collaborated with @intel to release a ‘trusted compute’ solution for blockchain (TEE using Intel SGX) iExec is also a service provider for Intel, offering a Decentralized Marketplace for #AI models. Bright future, I’m all in. 🙏🏽",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9xmcs/rlc_iexec_collaborated_with_intel_to_release_a/",
        "created": 1620770336.0
    },
    {
        "author": "smartass7549",
        "created_utc": 1622144867,
        "id": "nmfv2v",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Should we be concerned when the CFO and CMO just sold over $2M in shares of their own company this week? Anyone have some possible intel here ?  $Z",
        "subreddit": "wallstreetbets",
        "title": "Zillow",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nmfv2v/zillow/",
        "created": 1622173667.0
    },
    {
        "author": "Willing-Astronomer77",
        "created_utc": 1621953807,
        "id": "nkrdzj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Can Intel make a come back? Suggestions please?!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nkrdzj/can_intel_make_a_come_back_suggestions_please/",
        "created": 1621982607.0
    },
    {
        "author": "D3G3N_18",
        "created_utc": 1622492825,
        "id": "npcjq7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Listen you absolute tards. \n\nI would write down all of my research in detail, but if i know anything about WSB Apes, you prolly won't read it all so: \n\n1. 4Billion buyback\n2. Keynote Tomorrow, promising \"new tech\"\n3. ANOTHER Intc setback, at this point, AMD is taking on NVDA. Intc is dead\n4. Merger is going to be completed very soon\n5. Best CEO in the Sector\n6. Shitadel Shorts\nfinally, gut instinct says TSLA Model S running AMD chips👀",
        "subreddit": "wallstreetbets",
        "title": "AMD Gamma Squeeze 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/npcjq7/amd_gamma_squeeze/",
        "created": 1622521625.0
    },
    {
        "author": "NathMcLovin",
        "created_utc": 1622227765,
        "id": "nn4q7r",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[Part 1](https://www.reddit.com/r/wallstreetbets/comments/nn4j10/fsr_fisker_inc_duediligence_part_1/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\n*continued from part 1*\n\nTargeting Fisker Ocean to be the world's most sustainable vehicle. Product focus goes well-beyond zero emissions at the tailpipe. Some examples are: \n\n• Vegan leather seats and interiors \n\n• Rubber from tire manufacturing waste, suede interior trim from recycled polyester, carpets from fishing nets and bottles recycled from ocean waste \n\n• Setting strict purchasing standards and working with suppliers to value environment and social impact throughout the supply chain \n\n• Full Lifecycle Analysis of cradle-to-cradle emissions in process.. Asset-light strategy itself is ESG-forward (i.e. no new brick-and-mortar) \n\n• Fully-digital OEM, not requiring typical manufacturing, dealer, or service networks \n\n• Minimizing our impact through utilization of existing facilities \n\n• Enables affordable zero-emission mobility for the mass-market Building internal capability to measure, value, and report on ESG impact areas \n\n(See Responsible Supplier Policy further below)\n\n• Director of ESG (formerly at Nike) in place as of November 2020\n\n## 2021 Q1 Earnings call (18th May) Quotes:\n\n**Henrik Fisker**\n\n* In fact, we are already working on fulfilling 2023 safety rating for Five Star.\n* And also engineering powertrain modeling supports our expected range and acceleration, we'll have up to 350 mile range and top vehicle will do zero to 60 in less than four seconds.\n* Most car companies start in one market but we’re just actually going to do simultaneously Europe and U.S.\n* We are talking about several hundred thousands of volumes already now we're seeing suppliers giving us great deals on various parts, the volume also sharing between the two vehicles and future vehicles. Bottom line, we have ***turned estimates and targets into reality***.\n* We have a clear plan in place for all the 1,600 components that goes into a vehicle. Nearly all of the vehicle cost are now based on hard vendor quotes or contracts and support our previously communicated costs, pricing and profitability goals.\n\n(*The average car is made up of about 1,800 separate parts. This includes some large components, such as the engine, which is inserted as a unit during the car-making process but contains thousands of individual pieces itself.)*\n\n*From Google search:*\n\nhttps://preview.redd.it/zp0yomndiw171.png?width=556&amp;format=png&amp;auto=webp&amp;s=0f3619849f16cbe513fa1983daea148a0cfbcbd7\n\n* We have over 200 people in the company and they're all of the highest caliber. We do take a little longer to hire people because we wanted the absolute best.\n* Hiring definitely accelerated since January. We added about 10 people per month in Q4 last year and 25 per month so far in 2021. Engineering is in a great place.\n* Now we build out sales and marketing talent, and we've already started to hire quite a lot of marketing people, both here in the U.S. as well as in the EU – in Europe. And as you know, California, it is the best place to attract talent.\n* Now, I feel really good about over 16,000 reservations. One thing just to kind of give a little comparison *when the Tesla model S was 18 months, about 18 months before SOP (start of production), Tesla had about 3,400 orders, we’re about 18 months before SOP and we have 16,000 orders.*\n* I think that's pretty amazing specifically if some people say, there's a crowded market out there. And on top of that, particularly if you have barely marketed the vehicle, we really start to ramp up the marketing in November when we show the car at the LA Auto Show where we actually have quite a few surprises which I think will add a lot of extra reservation and interest in the vehicle.\n* When it comes to our portfolio expansion, we are fully on plan for delivering four different vehicles by 2025.\n* As you might've read it, we had kicked off the PEAR program and completed a binding agreement with Foxconn. This vehicle would be quite unique. It's in great shape for launch in Q4 2023, as we are about 30 months out.\n* **I personally think this is my best design work ever. - Henrik Fisker**\n* I think we will easily be able to sell *more than 250,000 vehicles of that a year.*\n* I will challenge anyone to show me a $37,500 SUV that even comes close to the Ocean.\n\n**Burkhard Huhnke (CTO)**\n\n* We need to own the relevant software stack, the customer can see and experience every day like the user interface and the overall customer experience\n* We want to pursue opportunities to ***monetize*** product upgrades and other digital data services.\n* And in order to accomplish that goal, we need to, number one, own the PIPE that delivers the data back and forth from the vehicle.\n* We are building our Fisker software excellence centers with programmers and data scientists in San Francisco, Silicon Valley and in India.\n\n**Geeta Gupta-Fisker**\n\n* Our balance sheet remains extremely strong with $985 million cash and no debt, basically flat versus December 31, 2020 as $89 million of inflows came in from warrant exercises, this incremental cash offsets our Q1 spending.\n* Our current cash reserves are sufficient to ***fully fund the Ocean program to start a production***. *And to be very clear, we have no need to raise additional capital in 2021*.\n* We are particularly excited about our cost position on batteries. Once an agreement is reached on localized PEAR production, we will share more details around our favorable position on batteries and our supplier partner.\n* I want to highlight the cashless warrant exercise we executed in March and April. The choice to only allow cashless exercises mitigated dilution to our shareholders by 2.5 points and also signaled confidence in a balance sheet, future spending plans and access to capital.\n* Finally, we are very excited to have reached a binding agreement that Foxconn to develop a second platform, FP28 with the initial vehicle launching in third quarter 2023.\n* Our overall priority KPIs are number one, a stellar product; number two, our bill of materials that underpins market-leading gross margins; number three, started production on time and number four overall program costs and in that order of priority.\n* We also reported a non-cash expense associated with the public and private boards. I just want to remind everybody that our net loss totaled $176.8 million and $0.63 loss per share, however, excluding $145.2 million non-cash non-operational loss, reflecting changes in fair value or convertible equity securities and embedded derivatives our net loss actually totaled $31.6 million, a $0.11 loss per share. As of April 2019, these public and private bonds were fully retired and being listed. So we should not see any of this activity in that line item going forward.\n* We expect the balance of this year's aggregate spending to be roughly steady across the remaining three quarters of 2021. SG&amp;A should moderately increase sequentially due to higher headcount. R&amp;D spend will be a bit heavy in Q2 and Q3 than Q4, due to timing of incremental supply ED&amp;T and a prototype testing and validation program. We would expect CapEx to be somewhat lower in Q2 than in Q1.\n* Overall, I'm extremely proud of the entire Fisker team for all the accomplishments we have in 2021 and the plans we've established to execute a fantastic profitable product on time and on budget.\n\nQ&amp;A:\n\n* How many parts are in this car?\n\n*Geeta Gupta-Fisker*\n\nOver 1,600 parts, Adam, that includes obviously all the systems and they may have additional substance, but it's about 1,600, including subsistence.\n\n* Could you say the company is fully funded through launch of PEAR or is that a totally different situation now and we need to see how those capital commitments play out into next year?\n\n*We do not need to raise any additional capital in 2021* to either fund Ocean or PEAR. As you know, we took an additional $89 million that brought our cash reserves to a very healthy balance sheet of $985 million. We forecast that – or we gave the guidance today, an additional $30 million, which goes to operating expenses to the PEAR program. So given the fact that we are leveraging our existing asset base, we are on track for pear, we’re on track for Ocean.\n\nSo at this point in time, we're investing 100s of millions of dollars in production, tooling and equipment, some of that you see in our Q1 numbers. And a lot of this can be financed at a low cost in a variety of these in a ESG forward manner. Number two, we again have a significant amount of IP that's in both the FM29 and FP28 programs and we still have not evaluated whether we licensed them out or not. Number three, we control all our emission credits and there are *opportunities to monetize these* ahead of time, if we wanted to. And again, I want to remind everybody my comments last time that capital markets continue to believe that electrification is the future of automotive.\n\n* I think there at least mentioned some additional deals for fleet in the Europe in Q2, maybe talk a little bit about those deals? And are they – some of those in the reservation numbers?\n\nYes, so we actually hired a specific person over in Europe to pursue the fleet deals and we are pursuing the top 100 companies in Europe with a highest ESG goals that actually want to go fully electric. And I think we will be announcing some interesting deals here in the near future. It's a little too early to talk about it right now, but I see an incredible positive trend, because when you look at the European market in our segment of vehicle, about *half of all vehicles sold in Europe* are actually feed deals, and our vehicle is perfect position for that.\n\n* First on the Ocean, any update on when we'll see, or you will launch the kind of full configurator for all the trim combinations? And then secondly on the FP28, anything you could share in terms of targeted range and performance for the starting price?\n\n*Henrik Fisker*\n\nYes.\n\nSo on the Ocean, we are sort of waiting on still November, because we got some pretty significant news on technology that we're going to show it on the Ocean in – at November at the LA auto show.\n\nSo we have decided to actually make that coincide with our app and website update, will you then be able to fully configure the vehicle colors, options, packages, we'll announce details of specifications, details of the pricing and everything is pretty much in line with our forecast.\n\nSo you'll unfortunately have to wait until November, but it really is born out of the fact that we added some new technology features in the vehicle that we think is going to really put us way ahead of the competition, so we don't want to show that too early. When it comes to the PEAR program, as I mentioned, this is kind of a really revolutionary program. \n\nIn terms of investment, the big investment will really start happening in 2023 and at that point, Fisker is making a *wholesome revenue*.\n\n* Questions on chip supply and how Fisker plans to secure supply in that third area. Burkhard?\n\nYes, happy to take that. The so-called chip shortages, it's a difficult challenge for the industry, but its not really a shortage, the result of the choice by the chip industry to repurpose capacity towards higher value consumer electronics chips and translate from low margin legacy automotive microcontrollers and let's say 28 nanometer nodes and higher.\n\nSo the general industries, this situation will work itself out over the next 12 months. But even if it doesn't, we see a few reasons that will be less impacted than most if at all.\n\nLet me explain, number one, we have the luxury of finalizing the concept phase for the Ocean, the full knowledge of this situation to our own context in our own partners. This allowed us to make design and supply chain choices that focused on needs to areas of supply chain, if they need supply for chips.\n\nFor example, we are in-sourcing the weaker control module chipset through our partner, Magna.\n\nAnother example is in displays, we are also playing a short term, in designing the components right now and sourcing semiconductors based on what is readily available.\n\nSo number two, we always have plans in electrical and computer architecture that is more centralized.\n\nWe are focused on high-performance domain controllers based on most modern SoCs.\n\nSo this is to the extent, it’s a general chat with a Mobileye vision systems, the solid-state for the radar sensors, powertrain ECU, 5G connectivity module and these chips are *not in short supply.*\n\nWikipedia:\n\n*(Mobileye is an Israeli subsidiary of Intel that develops self-driving cars and advanced driver-assistance systems. Mobileye headquarters and main Research &amp; Development centre is located in Jerusalem operating under the company name Mobileye Vision Technology Ltd.)*\n\nSo finally, and probably most importantly in comparison to other startups is our partner network, is Magna and Foxconn financially invested in our ability to satisfy demand.\n\nWe have *two partners with deep influence and a vested interest in ensuring supply commitments for all components*, not just chips. We've always seen multiple instances where this has helped us.\n\n* Next question is do you have a definite date to begin production of the Ocean? What's your plan to show early prototype version for the vehicle and what government subsidies do you anticipate?\n\nWe have very high confidence, as I mentioned early in our Q4 2022 SOP next year in fact, the actual SOP date is November 17 next year, if you want to have an exact date. And I'm super confident supported by Magna that we will actually make that big.\n\nSecondly, we started initial deliveries, both in U.S. and five key European markets also end of next year. And then more importantly, a full run rate production will happen in the first half of 2023. That's something that no other EV startups have done. And I think quite frankly, will only be possible with somebody like Magna, in terms of demonstrating vehicles. I mentioned already we'll show first production vehicles in November. We're planning then to show it in Europe shortly after the beginning of next year. And then in Q1 next year, we'll actually get the first journalist and some analysts in the vehicles and drive them, first demonstrate our vehicles and quite frankly both Burkhard and me, we already drove our powertrain. It's unbelievable the powertrain. It actually makes you feel like a Formula One driver because we have some really unique electronics in this powertrain that allows you to handle this vehicle on the limit in such an amazing way. I can't wait for people to try it. It's unbelievable in this class, so I'm super excited about it. Again, remember our vehicles starts at 37,500 in U.S.\n\nNow, finally, in terms of subsidiaries we believe we are legible for all the subsidiaries that are available at least the way it is today. And that includes in Europe. And just to give an example in Germany with subsidiaries, our vehicles will be priced to low €32,000.\n\nNow, for anybody on this call, you go and take a look at, what'd you get for €32,000 in Germany, and that's including near that total, which has sales tax in Germany, which is pretty high.\n\nSo that's an incredible competitive vehicle. And that's why Germany is one of the first countries we're going to launch in Europe as well and where we've gotten a lot of orders from already a lot of reservations.\n\n* **Fisker is now one of the most-shorted stocks on the market. Does the company have any plan to help protect shareholder value against short selling and manipulation?**\n\nAbsolutely.\n\nWe are only thinking of long-term shareholder value. Now the challenge is there are so many new mobility and EV companies that are using the SPAC method to raise capital. As we've seen in the last few months and several companies along the way have changed their strategies or targets. Now not only casting doubt on all EV players, it is also putting everyone in the same bucket. The only differentiator is execution and the ability of an experienced and dedicated company like Fisker to deliver quarter-on-quarter. And we are doing exactly that.\n\nJust want to remind everybody that we knew we needed to raise $1 billion. And we did exactly that to ***de-risk*** whilst we're not generating any revenue over the next few months. Number two, our original targets are still intact.\n\nOur original business model has not changed. We have not changed goalposts and are now based primarily on contracts, not just estimates. Number three, we have kept true to our asset-light business model in a positive way, by signing two partners, to be able to deliver the cars we planned for in our original filing, which is why we have the ability to forecast updated guidance on the PEAR program. Number four, in 2021, our milestone, delivery and spending very much on target with our guidance. We are disciplined. We are an experienced management team that knows what they're doing.\n\nSo credibility does not happen overnight. And we intend to continue to put out our proof points that we're not part of this crowded startup, inexperienced EV space. And it is no doubt. ***It will be reflected in our stock price***, in the medium, and in the longer term, we care for all our stakeholders and we are building the company for long-term success.\n\n(Henrik) - I just want to add something what Geeta just said, I know that there's some hedge funds that needs to go out and do some shorting, but I actually feel sorry for the people who's invest in those because it's clear that some of those shorts, they just are very superficial. They don't have deep knowledge of how the complex the automotive industry is. And I think if you spend a little bit of time understanding our business relationship with Foxconn and Magna, *you will quickly understand that you stand to lose a lot of money if you show it against Fisker*, but hey, that's my opinion and I hope we can prove everybody wrong.\n\n## 2020 Q4 Earnings call (26th February 2021) Quotes:\n\n**Henrik Fisker**\n\n* Daily reservations rate up 400% sustainably since we listed publicly. And we are now at about 12,467 total reservations.\n* I personally sit in engineering meetings, starting from five or six in the morning to late at night.\n* And I do that, because I want to be available for the team to make decisions right there and then with zero theocracy and that is really something that enable us to cut development time in half. It also allows us to make technology decisions within 18 months before we launch the vehicle. And that has already paid dividend in analyzing market segments improving range and acceleration, state-of-the-art ADAS, which we call FI Pilot, and then modern electric architecture. In today's world, locking the product 2.5 to three years ahead of time is just going to lead to obsolete products.\n* So our second priority is to increase the brand awareness and drive the next wave of reservation growth. I'm really pleased with the uptake we've had in the reservation so far, considering, a lot of these reservations were made two years before we launched the vehicle with pretty much zero marketing dollars\n* We did find out that a majority of the reservation holders are men. And it actually is interesting because it allows us to make targeted marketing towards women, because we actually think, and I personally think that Fisker Ocean is also perfect for women. So we are going to create some targeted marketing in certain areas, which is normally very difficult when you don't exactly know who's interested in your vehicle, or if you don't understand who actually have not ordered the vehicle and why not. But those sorts of things we can figure out.\n* I would suspect that there's a good chance our launch will be just before November this year, coinciding with the Los Angeles Auto Show.\n* Our strategy has always been to actually have several multiple partners, talking about different platforms for different vehicle segments. And we have announced the second part now Foxconn and we are in constant conversation with other groups about other very exciting projects. And there's something of course that we will talk about when we are ready. But it's always been part of our business model.\n* We will prove that we are serious about being on time as a startup and that's something that I personally will make sure. I follow up on every single day in the company seven days a week.\n\n**Burkhard Huhnke**\n\n* ADAS, FI Pilot, the Fisker Intelligent Pilot is the first system integrating digital imaging radar and *one of the first programs to use mobileyes next-gen camera and chipset.* It's run on a single domain controller and integrated by Magna Electronics\n* Speaking of connectivity, the goal is for Fisker Ocean to become a mobile device.\n* We are developing a next generation electrical architecture centered around several domain controllers supporting the major subsystems. That system is connected to the cloud by a 5G data pipeline developed by our edge computing team. The state-of-the-art collection and machine learning to analyze overall system performance to support predictive maintenance and over-the-air software updates to optimize range and performance. And to *enable new revenue streams* by offering upgrades to features and functions, and integrating third-party services. Notably, the upfront investments we are making in these technologies go beyond the Ocean, and subsystems like user interface, FI-Pilot, and powertrain applies for future vehicles as well. Overall, I anticipate we will execute a sustainable SUV that truly stands out from the competitive landscape we see in 2020. And beyond, and will be profitable at an affordable price. \n\n**Geeta Gupta-Fisker**\n\n* We have laid out our 2021 guidance today. And while actual results may differ from those we project, these goals are my **personal commitments to all Fisker stakeholders** that I will work very hard and relentlessly to achieve.\n* We also completed the Volkswagen parts insuring agreement for the Fisker Ocean program last year.\n* As a startup, we need to maximize the ROI on our assets. Every day with my finance team, I look at opportunities to make our cash go further and get a multiple return for every dollar we spend. In that spirit, we are exploring other opportunities, such as *monetizing a future emission credits*, or even licencing the FM29 platform to other potential partners.\n* Our Q4 results were in line with internal expectations at the start of the quarter. Operationally the increase in R&amp;D and SG&amp;A expense in Q4 2020 versus prior periods were primarily a result of the Ocean program gaining momentum in Q4. At the end of 2020, we were 101 employees full time, and as of today, we are 148.\n* While we cannot guarantee everything will go to plan, we are *highly confident that the many unknowns and risks that all startups face are more limited by Fisker* due to our unique business model.\n\nQ&amp;A:\n\n* So can you help us understand to what extent the MoU with Foxconn may change your 2025 delivery target?\n\nIf all goes well, which I hope it will, we actually could see us **surpassing** our original goal of 250,000 by 2025.\n\n* I just want to talk strategically, as we think about your growth over the next few years. And the revenue opportunities beyond the sale of the vehicle, and maybe specifically I was hoping to get an update on your latest thoughts on like the flexible lease model, Geeta, you mentioned some software opportunity that you're pursuing as well, as well as are there any potential options for your customers to share their vehicles through peer to peer and other constructs like that just want to get a sense of – those thoughts I mean in terms of the larger opportunity beyond the vehicle sale itself.\n\nSo the whole idea about our flexible lease is that, we own the asset, and we lease this vehicle out over probably from the beginning to the end of his life. And it could be somewhere between 12 to 15 years. And you could see, let's say, maybe eight to 10 people getting into this vehicle over those 15 years. And if you imagine that the first person leases this vehicle, and as they are enjoying this vehicle, they're deciding to purchase some feature over the air for $1,000 and enjoying that feature. They then hand this vehicle back, let's say after two years, we now lease it out to another person. But before we send this out to for another lease, for a slightly lower price, we reset the vehicle to zero if you want, which means if this person, the second person wants to lease this vehicle, then there they are *again paying* for that feature that we have already developed. And that shows you the *potential of selling a feature multiple times over the life of the vehicle*, of course, also potentially upgrading this feature to give it even more value. But it shows you the mobility revenue, that is possible when we own this fleet, and we operate the vehicle. And we also think that our vehicles after four or five years will be way more attractive as a used vehicle in this lease form versus any other competitor, because *our vehicles going to be maintained by us*. the OEM. And it'll be on the full warranty because we maintain it. And that I think, is really going to be a unique competitive advantage.\n\n(Geeta):\n\nYeah, additional revenue opportunities, as I mentioned earlier, of course, is emission credits, which are clearly assets that we would generate, we are looking at even potentially pre selling some of these emission credits. And I think some other companies have shown that can be a great potential to generate revenue. And as I also mentioned that there are opportunities for us to share the FM 29 platform.\n\nSo that's another potential source of revenue.\n\nAnother areas into a direct to customer and we have our own app where we engage with our customers on a regular basis, we are exploring whether we should look at the business of captive *insurance*, which shared risk with various underwriters.\n\n* I think the press release mentioned some ongoing discussions for fleet reservations. Maybe you could share an update on maybe the size or timing around what we might expect around growth in fleets.\n\nYeah, we see this as an incredibly promising market specifically in Europe, because in Europe, it's more normal than ever, large corporations actually are offering their employees a lease vehicle as part of retaining or attracting employees. And we have already we have just added a specific salesperson for fleet sales in Europe started a few weeks ago.\n\nSo that's something that we're going to go aggressive into and beyond discussions with several groups over there and I have high hopes for this because our vehicle as the perfect size in Europe is obviously built in Europe.\n\nSo I think this could be a very attractive avenue for growing sales for us.\n\n* Let's assume the MOU moves forward, okay, and it seems like that that process is moving fairly aggressively as is your motto to move fast. But you'd be running two major projects by the middle of the year or later this year with two separate manufacturing partners in two different regions at scale. It's an amazing opportunity to take your technology and business model to scale to get jumped on competitors while managing the risk. But I'm wondering if your current capital base is set up to run these two programs simultaneously, or whether there may be a need, or opportunity to bring in more capital to ensure your financial strength of a partner during this important time of execution? So can you remind us how you think about minimum cash levels as well, Geeta? And anything else you might give us? Are you able to give us right now in terms of, if the MOU moves forward, how your projections of cash consumption by orders of magnitude could change this year?\n\nLet me just start by saying that we actually already have started this program. And the good news is that I'm pretty low patent the company, and I do close these jobs.\n\nSo that's a good start.\n\nAnd so that's not a big influence right now, as we're in the design phase. But you're absolutely right, eventually we're going to have to spend some money on this project.\n\nOne of the unique things I just want to highlight in this program is that *Foxconn has committed to invest in this program*. And that's something we're going to be going into details over as we move forward. But the program is on full speed, we're extremely excited about it. And a personal electric automotive revolution is something that I think is needed and really could change the market dynamics, specifically, if you talk about more mass market or higher volume in the right price segment, and this vehicle will be priced well below the ocean. And I think that's where the real opportunity is.\n\n(Geeta Gupta-Fisker)\n\nI want to confirm that I'm a fairly **risk averse CFO**, whilst we have a CEO who looks at very exciting products, I am a risk averse CFO, looking at a balance sheet and investments that give us the right ROI.\n\nSo first of all, we have **no debt**. We ended the year with over $1 billion, we have a clean balance sheet.\n\nSo you're absolutely right, how would you look at resources for two programs? First of all, we are looking at how we maximize existing resources in both the company. Both the companies have existing IP, they have existing capabilities, and that's what the next few months will be spent. At the end of these next few months, we will clearly identify what investments both company needs to make.\n\nNow let's talk a little bit about our existing balance sheet.\n\nSo today, we will -- in this year, we will be investing hundreds of millions of dollars in production tooling and equipment that *we will own*.\n\nOur discussions indicate that these can be potentially financed at low cost in a variety of ways if we want to do that, specifically for ESG forward company, then again, I'd mentioned about emission credits that can be monetized.\n\nNow, both the companies are committed to investing. It's not just Fisker investing. And as we all would agree, capital markets have decided that electrification is the future of automotive. And once we achieve some of our key R&amp;D and production milestones, if we see both the need and an opportunity to further bolster our already strong balance sheet, we will do that in an efficient way.\n\n* I'm thinking that there could be a battery shortage, a very serious supply demand imbalance as we see EV demand and then the number of EV entrance promising such large volumes. Now, you've got -- again, you got to jump on this, and I would imagine that Magna and Foxconn are two partners that if they tell someone we need the batteries, is it that something you want to try to do. But, am I crazy? From your lens Geeta or Henrik, you think their battery shortage. Where would you rate battery shortage risk on a scale of one to 10? And how can you assure us here that that's not a gating factor for you? I'm talking cell supply specifically, as you know, to make good on your SOP and ramp efficaciously.\n\nSo, we have already nominated our cell supplier, and it is one of the largest cell suppliers in the world that we’ve worked quite a long time with. And I, at this point, do not really see an issue for us for Fisker. And the reason is that this supplier is very well known for both Magna and Foxconn, as you said.\n\nSo it's not like either the three companies have to go in -- on a cold call there.So for Fisker, I don't see it as an issue. Now, can it be issues for other companies entering this space? Possibly. I also think it depends on how fast, of course, the EV growth is on each continent. Now we have seen that, for instance, in Europe, there is a lot of new factories being set up, as well as in Asia. I actually think the one that's lacking behind right now is the US. And that's just talking generally about battery, battery cell and battery pack production.\n\nSo, we are already in discussions with our nominated cell supplier about setting up battery cell and battery pack manufacturing, both in potential Europe and the US.\n\nSo it's definitely something where you've got to have a tight knit relationship with long-term in mind to make sure you have what you need. Geeta, you have a few things.\n\nYou're absolutely right by your sceptic, because whilst we've been talking to multiple battery companies, they've been burnt by many OEMs, who haven't delivered on the volumes that they requested. And as a result, what we found is all the battery companies are very, very selective in who they want to work with. And when you want to have a capacity lockdown, you have to have relationships.\n\nYou also have to have a desirable product that the battery companies will want their batteries to be in, because they've heard this story before that somebody wants to make an EV. But fundamentally, nobody wants to buy.\n\nSo it's not just the function of locking capacity, but it's exciting battery suppliers, bringing them with you on the journey, making them believe that this will be a win-win. And of course, there's only one company that's been able to do that, and we are very confident we will be the second one.\n\n* Guys, retail investors are important to us. They make up a big percentage of our shareholder base, and I solicited some questions, we'll try to do some rapid fire, so we can get back to the analyst queue. But I'm just going to ask a few. I'm going to start with one. We heard you talking on social media about an IT center you're establishing in India, can you give us a little bit more detail on that?\n\nSo, it's actually not an IT center, it’s a Software Development Centre that we intend to grow. With our source code in San Francisco Silicon Valley, we're building up the software surveillance teams, which will focus A, on embedded software in the cloud domains and B, on secure data pipeline from the cost of the cloud, and C, edge computing capabilities, including machine learning in the back end of our Fisker Cloud. And in India, we will find all the additional smart talents and resources, we need to further develop our software competences in these areas.\n\nSo from the embedded automotive operating system experts and programmers to data analysts and data scientists.\n\n## 10-K Key notes:\n\n**Growth Strategy**\n\nOur first vehicle will be the Fisker Ocean, an all-electric premium SUV that is expected to have a starting price of $37,499 in the U.S. market before federal and state incentives are applied (we expect to initiate sales with all of our currently allocated EV credits – $7,500 on the first 200,000 delivered vehicles). The Ocean will have at least three option packages, with prices anticipated to range from a base price of $37,499 to approximately $69,900 for the most highly-contented trim level.\n\nWe are planning to develop several unique option packages to broaden the market appeal of the Fisker Ocean, including an anticipated extreme off-road package, which Fisker refers to as Force E.\n\nThe Fisker Ocean has many selling points that will set Fisker apart from its competitors, including:\n\n•*California Mode.* California Mode (patent-pending) delivers an open-air experience with the push of one button. California Mode enables all of the vehicle’s windows – side windows, sunroof and the rear hatch window – to open simultaneously. This feature allows for long items (like a surfboard) to be transported by placing them through the rear window without having to drive with an open hatch. This feature will not work as well on an ICE vehicle as exhaust fumes could enter the cabin.\n\n•*Extra wide track.* For the size of the vehicle and category, We believe the Ocean’s extra wide track will, among other technical features, give the Ocean best-in-class ride and handling while maintaining the same tire aspect ratios. The wide track on sports cars contribute to a visual powerful “stance,” and we believe this will further distinguish the Ocean’s design. It has also allowed for a more dramatically sculptured body side design and, combined with the dynamic silhouette, we believe it has achieved a class-leading aesthetically arresting and emotional design.\n\n* *Fixed hood.* Major electronic components have been moved under the hood to increase the interior space. The Ocean therefore does not need a traditional opening hood, where extra cost is spent on hinges and seals. This means the Ocean has fewer cut lines in the front end of the car, simplifying the design.\n\n•*User Interface.* The Ocean features a large curved center screen with integrated haptic buttons. We have done extensive design development on the highest quality UI to enhance the driving experience. We believe combining a large touch screen with several haptic buttons provides drivers a user-friendly interface that allows drivers to access the most-often-used functions while maintaining their eyes on the road.\n\n•*Autonomy.* We believe autonomous driving technology will ultimately be regulated, produced in high volume by a few large automotive companies, and be available to everyone. We believe it will be able to offer state-of-the-art autonomous driving features through a partnership with industry-leading OEMs and tier-one automotive suppliers. The Ocean will be launched with Fisker Intelligent (FI) Pilot, which will deliver industry-unique features and experiences, including over-the-air updates. The Ocean will be engineered with hardware to support future upgrades, higher levels of autonomy and advanced driver assistance features, delivered through post-production software-based updates. Fisker and Magna are working together to develop an industry-unique feature set and a suite of software packages powered by a scalable domain controller architecture. We intend to equip Fisker Ocean with a class-competitive suite of Advanced Driving Assistance features supported by a sensor suite that includes state-of-the-art computer vision technology and digital imaging radar.\n\n•S*olar roof.* The Fisker brand is a pioneer in full length curved solar roof design and integration into a passenger vehicle. We believe that we can continue this leadership and will be providing an optional solar roof with state-of-the-art PV solar cells. The solar roof makes a strong personal statement for those customers that want to fully optimize for zero emissions and sustainability.(See Patents further below)\n\n•*Vegan interior.* We are planning to offer a full vegan interior on the Fisker Ocean and there will be no leather or animal sourced materials available on any Fisker Ocean model.\n\n•*Recycled materials in the interior.* Fisker plans to introduce carpets made from recycled plastic bottles and fishing nets from the world’s oceans. We are also looking at introducing several other recycled materials throughout the Fisker Ocean.\n\n•*Sustainability.* We aim to make the Fisker Ocean the world’s most sustainable vehicle, measured by how many components use recycled materials, the fact that we offer a full-length solar roof option, and the fact that we plan on using existing manufacturing capacity rather than building new plants. In addition, we will work with all of our suppliers to try to make them use the most sustainable manufacturing methods possible.\n\n&amp;#x200B;\n\nThus concludes part 2 of my $FSR due-diligence, hope you are all enjoying it so far,\n\n NathMcLovin!",
        "subreddit": "wallstreetbets",
        "title": "$FSR (Fisker Inc) due-diligence part 2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nn4q7r/fsr_fisker_inc_duediligence_part_2/",
        "created": 1622256565.0
    },
    {
        "author": "TrYeX1",
        "created_utc": 1620750759,
        "id": "na13tp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "How will the semiconductor shortage affect the stocks of TSMC/AMD/INTEL etc",
        "url": "https://www.reddit.com/r/stocks/comments/na13tp/how_will_the_semiconductor_shortage_affect_the/",
        "created": 1620779559.0
    },
    {
        "author": "Websters_invester",
        "created_utc": 1621196621,
        "id": "ndx2ox",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "There is a small tech firm located in Bay Area that is trading for $3 a share and has over 1 billion from fidelity abd 665 million from vanguard. This company has  contracts with apple, and is said to create 50k jobs. I cannot figure out who this company is.  I do know he is responsible for the chassies and what’s inside the computers from intel, ibm, samsung, Microsoft.",
        "subreddit": "investing_discussion",
        "title": "Researching upcoming revolutionary investments",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ndx2ox/researching_upcoming_revolutionary_investments/",
        "created": 1621225421.0
    },
    {
        "author": "porkchopper82",
        "created_utc": 1622375178,
        "id": "no9hxo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Understand that apes are not Wallstreetbets. This group banned the talked of AMC for many months. After the initial FOMO run up of GME, which still has not squeezed, this group was compromised.  They have been watching you every day as you post your plans. They have even posed as fellow tards and tricked all of you.  All the apes left this group. We went to private discord servers and other groups. Wallstreetbets is being used to try and mitigate fallout of what's coming. You original retards know this. You have seen the change. Be aware. GME has yet to squeeze. Stop posting your positions and gains/losses. Don't give them the intel they need to win. Don't like what im saying, fuck you. You know the plan. we HODL. Fuck the noise. Fuck the FUD. We are not selling.",
        "subreddit": "wallstreetbets",
        "title": "Hey Media, and Kevin Oleary, If you want to learn about WallstreetBets......",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/no9hxo/hey_media_and_kevin_oleary_if_you_want_to_learn/",
        "created": 1622403978.0
    },
    {
        "author": "Tfamcola",
        "created_utc": 1619923897,
        "id": "n2xjvf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Keeping up with the industry I have faith in Lisa Su and all the plans for upcoming silicon production + overtaking intel rn and nvidia in the future with that giant $500 stock price, many other reasons but everyone who knows AMD prob knows these already. Is my call a good idea or a bad one",
        "subreddit": "wallstreetbets",
        "title": "I invested 17k into AMD $185 options calls for Jan 20 2023, plan on doing more at the same call price, did I do good or no?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2xjvf/i_invested_17k_into_amd_185_options_calls_for_jan/",
        "created": 1619952697.0
    },
    {
        "author": "The_StankBurrito",
        "created_utc": 1620618433,
        "id": "n8v6kd",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Open for Discussion: Now is the time to protest and let people know about how hedge funds are going to try illegal shit like using insider intel profits against companies like AMC,GME,etc.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n8v6kd/open_for_discussion_now_is_the_time_to_protest/",
        "created": 1620647233.0
    },
    {
        "author": "UncleMoonSoon",
        "created_utc": 1620741599,
        "id": "n9xn5h",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "($RLC) iExec collaborated with @intel to release a ‘trusted compute’ solution for blockchain (TEE using Intel SGX) iExec is also a service provider for Intel, offering a Decentralized Marketplace for #AI models. Bright future, I’m all in. 🙏🏽",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9xn5h/rlc_iexec_collaborated_with_intel_to_release_a/",
        "created": 1620770399.0
    },
    {
        "author": "bitsnhelices",
        "created_utc": 1621006807,
        "id": "ncbkhr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "What if INTEL decides it wants to move into the virtual space?",
        "url": "https://www.reddit.com/r/stocks/comments/ncbkhr/what_if_intel_decides_it_wants_to_move_into_the/",
        "created": 1621035607.0
    },
    {
        "author": "TrYeX1",
        "created_utc": 1620750828,
        "id": "na14sj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "How will the semiconductor shortage affect the stocks of TSMC/AMD/INTEL etc",
        "url": "https://www.reddit.com/r/stocks/comments/na14sj/how_will_the_semiconductor_shortage_affect_the/",
        "created": 1620779628.0
    },
    {
        "author": "Appropriate_Ad1077",
        "created_utc": 1620824323,
        "id": "nao20w",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "any current thoughts/intel on cvm?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nao20w/any_current_thoughtsintel_on_cvm/",
        "created": 1620853123.0
    },
    {
        "author": "zincelements",
        "created_utc": 1621264181,
        "id": "neirml",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "$ENZC - Biotech Company working with intel. Worth a look !",
        "url": "https://www.reddit.com/r/pennystocks/comments/neirml/enzc_biotech_company_working_with_intel_worth_a/",
        "created": 1621292981.0
    },
    {
        "author": "JWKirby",
        "created_utc": 1621443940,
        "id": "ngb8x9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "KT Corp. is launching AMD processor-based virtual server IaaS products for the first time in the country's cloud operators.  AMD servers are 80% of the existing same-specification server fee, freeing up high-performance computing resources at an affordable price for enterprise customers.\nAMD servers can be applied to a variety of business applications, including the general web, middleware, as well as databases and big data analytics.\nExisting systems can also be easily migrated to industry-standard x86 architectures, making them suitable for customers who need better performance for the price.  KT's self-validation shows that AMD servers perform at the same level as Intel server CPU cascades operating on the KT Cloud D1 platform. As a result, enterprise customers preparing for large-scale deployments are expected to significantly reduce their total cost of ownership (TCO) by utilizing AMD servers.  AMD servers are available on the D1 platform in the KT Cloud, which is more secure and flexible than regular public cloud zone. After launch, the company plans to continue to expand not only the D1 platform, but also kt G-Cloud and F-Cloud.  The D1 platform is built with physical security equipment such as IPS, firewalls, and VPNs for excellent security stability.  In addition, up to 15 DMZ and private networks can be flexibly created, and all network and firewall policies can be easily set up within the cloud console. In addition to servers of the same specifications as previous servers, they also offer high-spec servers with up to 128vCore x 256GB of memory.\n\n\nhttps://m.stock.naver.com/item/main.nhn#/stocks/030200/news/0004641532/office/014",
        "subreddit": "stocks",
        "title": "KT launches AMD server cloud product",
        "url": "https://www.reddit.com/r/stocks/comments/ngb8x9/kt_launches_amd_server_cloud_product/",
        "created": 1621472740.0
    },
    {
        "author": "d4v1d87",
        "created_utc": 1621793381,
        "id": "njder3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "TSM, INTC or Samsung electronics?",
        "url": "https://www.reddit.com/r/StockMarket/comments/njder3/tsm_intc_or_samsung_electronics/",
        "created": 1621822181.0
    },
    {
        "author": "expert-piker",
        "created_utc": 1619999359,
        "id": "n3j33u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "$SMH poots? (Intel CEO Says Chip Shortage Will Persist for ‘CoupleofYears’)",
        "url": "https://www.bloomberg.com/news/articles/2021-05-02/intel-s-new-ceo-won-t-be-anywhere-near-as-focused-on-buybacks",
        "created": 1620028159.0
    },
    {
        "author": "laniakea888",
        "created_utc": 1620347025,
        "id": "n6lxcs",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Is it right time to YOLO on Intel (INTC)?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6lxcs/is_it_right_time_to_yolo_on_intel_intc/",
        "created": 1620375825.0
    },
    {
        "author": "_foldLeft",
        "created_utc": 1621253364,
        "id": "neeinl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Recently I've been trying to put my thoughts and analysis down in writing, instead of just living in my head, as a way to fully think through what's rolling around in my head as I look at charts, read articles, listen to podcasts, etc. Every so often I start to see an opportunity to re-assemble my view of the market and make some assertions, and I think after last week this is one of those times.  \n&amp;nbsp;\n\nSo I want to start by giving some disclosure on my recent positioning and what _I'm_ trying to get out of this. In mid-late April, I switched into short positions on all indices and got long a VIX, all through longer-dated options. We were chopping around ATHs, things looked stretched, stocks were selling off on huge earnings beats and seasonality was something to consider.   \nSo I took the viewpoint then that we'd see some downside volatility sometime in May, and I was anticipating a 5-10% pullback when all was said and done. Well, three weeks later we've had a move to the downside, but things kind of look different now and while I unwound some of my shorts last week I'm trying to determine if this sell off is done or if we're due for a larger downside move. \n\n###Let’s start with a look at overall market performance by sector\n\n[Sector Performance, 1y](https://imgur.com/LJ0t7jN)\n\n[Sector Performance,  2021 YTD](https://imgur.com/lEBNPW2)\n\nI’m using ARKK here as a proxy for high-growth, unprofitable companies since that’s a lot of what they own.  \nSome notes:  \n\n- Tech, and in particular, unprofitable tech, has underperformed YTD since about mid-Feb.\n- Financials, Industrials, and Energy have out-performed and this is very clear on the YTD chart.  \n\nThis reflation trade started in about mid-February and is what has been leading these indices higher while last year’s growth trade has lagged and given back.\n\n###Now let’s look at index performance:\n\n[SPY 1y](https://imgur.com/6mXqqVF)\n\n[QQQ 1y](https://imgur.com/NVWss5e)\n\n[IWM 1y](https://imgur.com/SylCIJy)\n\nI've tried to highlight ranges, pullbacks, and bounces in these.  \nTake-Aways:  \n\n- QQQ, IWM have been in this kind of “chop zone” since about mid-Feb, and technicals look somewhat bearish here.\n- SPY has maintained performance, and along with the DOW (not pictured) has led the market higher\n- Looking at the charts, every pullback has been bought and we can’t seem to get any meaningful breakdown. Buy the dip has to continue to be the mantra.  \n\nComparing these to our sector charts, we can see we need to look at more than one thing to tell a story. These indices, due in part to how they are constructed, do not highlight the rotation and churn that’s been going on - the rotation out of high growth stocks into value with the latter responsible for driving the market higher as of late.  \n\nTo further illustrate that last point, let’s look at just one section of the market as an example:\n\n[Small Cap Growth vs Small Cap Value, Selected Indices 1y](https://imgur.com/LJmHP8r)\n\nComparing two of the most popular small cap growth ETFs against two of the most popular small cap value ETFs showcases the recent outperformance of the value trade in place of the growth trade which did so well post-crash. \n\n##The Recent Pullback and What to do Next\n\nSo I think a good place to start with respect to _what next?_ is to rehash this last week. Starting off with a downside move, this accelerated Wednesday as the market “reacted” to the CPI data. I use quotes here because I don’t fully buy the inflation narrative that the media is spinning and I think for the most part neither does the market. Inflation is a whole separate post, that I may do at some point.  \nAnyway, we followed this sharp downside move with a sharp upside move and by the end of the week the damage wasn’t all that bad. However, this snap-back may be concerning in terms of legitimacy and at least as far as QQQ and IWM go we’re still looking bearish. \n\nTo get an idea if the selling here might be done or not, I thought it worth a look at some of QQQ's largest components individually:\n\n[AAPL 1y](https://imgur.com/Z0Bh0mD)\n\n[INTC 1y](https://imgur.com/VOwvNhH)\n\n[NVDA 1y](https://imgur.com/OmqYSET)\n\n[FB 1y](https://imgur.com/4JgNVxl)\n\nAlong with some others not shown here, these show a common pattern: all sitting at some kind of support level.  \nIf we see a breakdown below these levels... watch out. But I have a feeling we're largely done here. \n\n###Building a Thesis\n\nI'm just gonna throw down some bullet points here based on the charts above, market sentiment, and some stuff I've been reading: \n\n- Value over growth is still the trend and looks to remain that way - the \"reflation trade\" is the trend and no reason to fight it.\n- Tech / growth seems to be at support, and may indicate the recent selling here is done, but that doesn't mean we're going to be seeing ATHs again here anytime soon.\n- Need to watch out for Fed tapering talk. There is talk that the Fed will need to at least taper it’s QE programs at some point and some expectation that could start to be communicated as early as June. Market reaction here will be interesting.\n- Inflation reactions. Along with the bond market and Fed, I may believe that surprising inflation data will be temporary and normalize but we could see short-term volatility around these events while the greater market digests it.\n- The leading sectors, banks and industrials, were looking pretty stretched at the beginning of this week. Ending largely unchanged, the volatility has helped reset some of those overbought indicators though they are still high. I think weakness here could lead to a greater sell-off and performance of these is something to closely watch.\n- Consider seasonality. We’re entering a time period where historically we often see sideways movement or some downside until the fall. It’s something to consider when positioning and planning time horizon on short-term trades going forward.\n- **Buy The Fucking Dip**. I have to echo the same sentiment that many others have: you can have a bearish view on this market given all the bullshit, but there is no way in hell you can't be long right now. Stay with the trend.\n&amp;nbsp;\n\nI think right now if you’re long you need to be long banks, industrials, energy, SPY. I would stay away from growth and tech - until we see these push ATHs e.g. IWM, QQQ break out of their ranges to the upside, stay out or short them.",
        "subreddit": "wallstreetbets",
        "title": "Market Review: A look at recent trends, performance, and some assumptions on where we go from here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/neeinl/market_review_a_look_at_recent_trends_performance/",
        "created": 1621282164.0
    },
    {
        "author": "_foldLeft",
        "created_utc": 1621200953,
        "id": "ndylww",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Recently I've been trying to put my thoughts and analysis down in writing, instead of just living in my head, as a way to fully think through what's rolling around in my head as I look at charts, read articles, listen to podcasts, etc. Every so often I start to see an opportunity to re-assemble my view of the market and make some assertions, and I think after last week this is one of those times.  \nHopefully this doesn't end up too disjointed - I'm trying to put this together in the midst of a hangover either from last night, my second covid shot yesterday, or some combination of both, and I'm finding it a bit difficult to be any kind of articulate.  \n&amp;nbsp;\n\nSo I want to start by giving some disclosure on my recent positioning and what _I'm_ trying to get out of this. In mid-late April, I switched into short positions on all indices and got long a VIX, all through longer-dated options. We were chopping around ATHs, things looked stretched, stocks were selling off on huge earnings beats and seasonality was coming upon us.   \nSo I took the viewpoint then that we'd see some downside volatility sometime in May, and I was anticipating a 5-10% pullback when all was said and done. Well, three weeks later we've had a move to the downside, but things kind of look different now and while I unwound some of my shorts last week I'm trying to determine if this sell off is done or if we're due for a larger downside move. \n\n###Let’s start with a look at overall market performance by sector\n\n[Sector Performance, 1y](https://imgur.com/LJ0t7jN)\n\n[Sector Performance,  2021 YTD](https://imgur.com/lEBNPW2)\n\nI’m using ARKK here as a proxy for high-growth, unprofitable companies since that’s a lot of what they own.  \nSome notes:  \n\n- Tech, and in particular, unprofitable tech, has underperformed YTD since about mid-Feb.\n- Financials, Industrials, and Energy have out-performed and this is very clear on the YTD chart.  \n\nThis reflation trade started in about mid-February and is what has been leading these indices higher while last year’s growth trade has lagged and given back.\n\n###Now let’s look at index performance:\n\n[SPY 1y](https://imgur.com/6mXqqVF)\n\n[QQQ 1y](https://imgur.com/NVWss5e)\n\n[IWM 1y](https://imgur.com/SylCIJy)\n\nI've tried to highlight ranges, pullbacks, and bounces in these.  \nTake-Aways:  \n\n- QQQ, IWM have been in this kind of “chop zone” since about mid-Feb, and technicals look somewhat bearish here.\n- SPY has maintained performance, and along with the DOW (not pictured) has led the market higher\n- Looking at the charts, every pullback has been bought and we can’t seem to get any meaningful breakdown. Buy the dip has to continue to be the mantra.  \n\nComparing these to our sector charts, we can see we need to look at more than one thing to tell a story. These indices, due in part to how they are constructed, do not highlight the rotation and churn that’s been going on - the rotation out of high growth stocks into value with the latter responsible for driving the market higher as of late.  \n\nTo further illustrate that last point, let’s look at just one section of the market as an example:\n\n[Small Cap Growth vs Small Cap Value, Selected Indices 1y](https://imgur.com/LJmHP8r)\n\nComparing two of the most popular small cap growth ETFs against two of the most popular small cap value ETFs showcases the recent outperformance of the value trade in place of the growth trade which did so well post-crash. \n\n##The Recent Pullback and What to do Next\n\nSo I think a good place to start with respect to _what next?_ is to rehash this last week. Starting off with a downside move, this accelerated Wednesday as the market “reacted” to the CPI data. I use quotes here because I don’t fully buy the inflation narrative that the media is spinning and I think for the most part neither does the market. Inflation is a whole separate post, that I may do at some point.  \nAnyway, we followed this sharp downside move with a sharp upside move and by the end of the week the damage wasn’t all that bad. However, this snap-back may be concerning in terms of legitimacy and at least as far as QQQ and IWM go we’re still looking bearish. \n\nTo get an idea if the selling here might be done or not, I thought it worth a look at some of QQQ's largest components individually:\n\n[AAPL 1y](https://imgur.com/Z0Bh0mD)\n\n[INTC 1y](https://imgur.com/VOwvNhH)\n\n[NVDA 1y](https://imgur.com/OmqYSET)\n\n[FB 1y](https://imgur.com/4JgNVxl)\n\nAlong with some others not shown here, these show a common pattern: all sitting at some kind of support level.  \nIf we see a breakdown below these levels... watch out. But I have a feeling we're largely done here. \n\n###Building a Thesis\n\nI'm just gonna throw down some bullet points here based on the charts above, market sentiment, and some stuff I've been reading: \n\n- Value over growth is still the trend and looks to remain that way - the \"reflation trade\" is the trend and no reason to fight it.\n- Tech / growth seems to be at support, and may indicate the recent selling here is done, but that doesn't mean we're going to be seeing ATHs again here anytime soon.\n- Need to watch out for Fed tapering talk. There is talk that the Fed will need to at least taper it’s QE programs at some point and some expectation that could start to be communicated as early as June. Market reaction here will be interesting.\n- Inflation reactions. Along with the bond market and Fed, I may believe that surprising inflation data will be temporary and normalize but we could see short-term volatility around these events while the greater market digests it.\n- The leading sectors, banks and industrials, were looking pretty stretched at the beginning of this week. Ending largely unchanged, the volatility has helped reset some of those overbought indicators though they are still high. I think weakness here could lead to a greater sell-off and performance of these is something to closely watch.\n- Consider seasonality. We’re entering a time period where historically we often see sideways movement or some downside until the fall. It’s something to consider when positioning and planning time horizon on short-term trades going forward.\n- **Buy The Fucking Dip**. I have to echo the same sentiment that many others have: you can have a bearish view on this market given all the bullshit, but there is no way in hell you can't be long right now. Stay with the trend.\n&amp;nbsp;\n\nI think right now if you’re long you need to be long banks, industrials, energy, SPY. I would stay away from growth and tech - until we see these push ATHs e.g. IWM, QQQ break out of their ranges to the upside, stay out or short them.",
        "subreddit": "wallstreetbets",
        "title": "Market Review: A look at recent trends, performance, and some assumptions on where we go from here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ndylww/market_review_a_look_at_recent_trends_performance/",
        "created": 1621229753.0
    },
    {
        "author": "Big80sweens",
        "created_utc": 1621344621,
        "id": "nfas23",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "CanadianInvestor",
        "title": "Converge Technology Solutions Corp. Achieves Titanium Partner Status with Intel Corporation",
        "url": "https://ca.finance.yahoo.com/news/converge-technology-solutions-corp-achieves-123000480.html",
        "created": 1621373421.0
    },
    {
        "author": "Commander_zx7",
        "created_utc": 1621695820,
        "id": "nikj5t",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I have recently dipped my toes in directly trading stocks and wanted to get the opinion of some more experienced tech traders.\n\nTL;DR is Intel a good buy for long term holding? (1-3 years) \n\nThey release their earnings last month and they outperformed analysts projections but they were down from last year which imho was not surprising given everything going on.   Despite outperforming projections the price still was dropping.\n\nWe also know Intel price is far below its rival AMD and far below Nvidia who recently announced its ARM deal. \n\nIntel has recently lagged behind in tech advances such node size reduction however they have made a lot of investments recently and imho are wisely seeing the growing demand for chips globally and getting more into fabs..\n\nIntel is also close to releasing in the next year or so their GPU which is meant to directly compete with AMD and Nvidia in. Gaming, compute and A.I ( I am also sure people will use it for Cryptocurrency as long as it is efficient enough).\n\nImho it’s a major plus that Intel is investing in more fabs, not only due to growing chip demand but also for the GPU market as both AMD and Nvidia out source the fab operation. Intel is positioned to undercut prices and on the GPU market which they will likely due to gain market share and will have the fab strength the adapt to demand quickly. \n\nJust my thoughts, what do you all think?  Buy, Sell or Hold?",
        "subreddit": "wallstreetbets",
        "title": "Newbie need advice on Intel.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nikj5t/newbie_need_advice_on_intel/",
        "created": 1621724620.0
    },
    {
        "author": "emailalmighty",
        "created_utc": 1621877231,
        "id": "nk3bb9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Background on the subject, \n\n[https://tickertape.tdameritrade.com/market-news/semiconductor-stocks-rare-earth-elements-chip-shortage-18629](https://tickertape.tdameritrade.com/market-news/semiconductor-stocks-rare-earth-elements-chip-shortage-18629)\n\n[2012 map about foreign investment of China + 2019 map about rare earths distribution.](https://preview.redd.it/mubqw1qgm3171.png?width=784&amp;format=png&amp;auto=webp&amp;s=1f5db88e41ba3f497145d0d60dc2ef3d6b5210ff)\n\nGlobal semiconductor shortage:  \n[https://hbr.org/2021/02/why-were-in-the-midst-of-a-global-semiconductor-shortage](https://hbr.org/2021/02/why-were-in-the-midst-of-a-global-semiconductor-shortage)\n\n  \nJuice:\n\n[https://www.nasdaq.com/market-activity/stocks/intc/real-time](https://www.nasdaq.com/market-activity/stocks/intc/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/tsm/real-time](https://www.nasdaq.com/market-activity/stocks/tsm/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/qcom/real-time](https://www.nasdaq.com/market-activity/stocks/qcom/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/avgo/real-time](https://www.nasdaq.com/market-activity/stocks/avgo/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/mu/real-time](https://www.nasdaq.com/market-activity/stocks/mu/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/txn/real-time](https://www.nasdaq.com/market-activity/stocks/txn/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/asx/real-time](https://www.nasdaq.com/market-activity/stocks/asx/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/nvda/real-time](https://www.nasdaq.com/market-activity/stocks/nvda/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/stm/real-time](https://www.nasdaq.com/market-activity/stocks/stm/real-time)  \n[https://www.nasdaq.com/market-activity/stocks/nxpi/real-time](https://www.nasdaq.com/market-activity/stocks/nxpi/real-time)  \n\n\nGreeks shortcut: [Stochastic Momentum Index](https://www.netpicks.com/stochastic-momentum-index/)\n\nBrief tests:\n\n[SMI of TSM, one day](https://preview.redd.it/6laeazrcr3171.png?width=2148&amp;format=png&amp;auto=webp&amp;s=e3a184b2573256097abec437d58f23417690d04d)\n\n[SMI of NXPI, one month](https://preview.redd.it/9xuzx7llr3171.png?width=2140&amp;format=png&amp;auto=webp&amp;s=68d80373283fbdba6e20b8165978cd5b83da9947)\n\nResearch about what companies have solid bonds with the Chinese government, computers, phones, car makers, and even plain chips.\n\nMaybe unethical by chauvinist standards, but surely profitable.\n\nI can't bet, I'm married, have 2 kids and my income is too low to gamble, this is for you who can afford to risk a bit.\n\nSorry for the shitty maps, I'm unable to find better ones.",
        "subreddit": "wallstreetbets",
        "title": "Semiconductors = Rare Earths = China probably owns the world by now = Take advantage on that",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nk3bb9/semiconductors_rare_earths_china_probably_owns/",
        "created": 1621906031.0
    },
    {
        "author": "LittleManStan1",
        "created_utc": 1622479002,
        "id": "np7isu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Intel reiterates chip supply shortages could last several years",
        "url": "https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/intel-reiterates-chip-supply-shortages-032043602.html",
        "created": 1622507802.0
    },
    {
        "author": "current-asscoverer",
        "created_utc": 1620157842,
        "id": "n4weqz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Why You Should Short the Intel Fab Play",
        "url": "https://www.reddit.com/r/stocks/comments/n4weqz/why_you_should_short_the_intel_fab_play/",
        "created": 1620186642.0
    },
    {
        "author": "d4v1d87",
        "created_utc": 1621793771,
        "id": "njdjto",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "TSM, INTC or Samsung electronics?",
        "url": "https://www.reddit.com/r/StockMarket/comments/njdjto/tsm_intc_or_samsung_electronics/",
        "created": 1621822571.0
    },
    {
        "author": "godisdildo",
        "created_utc": 1619863183,
        "id": "n2fchi",
        "num_comments": 185,
        "num_crossposts": 0,
        "selftext": "Reading through this sub you get the feeling that everyone “knows” it but no one is exactly giving a single reason for why, other than “it should because of high valuations”.\n\nIt reads as a lot of wishful thinking and arrogance. Where the hell do you place Apple, the largest company in the world growing 50%?  \n\nGrowth has outperformed value for 20 years, and the winners of the dot com crash , like Apple, Microsoft and Amazon, have outperformed everything by a huge margin in the last 30 years. \n\nEither the valuation methods were good to use and it’s just that the type of company that wins the future has so much higher margins and network effects that the definition of key value metrics has to change, OR (like many here seem to suggest), somehow this will all “regress to the mean” and somehow Sysco, public enterprise group, and Cincinnati Financial (great companies I also own) will eventually outperform the other ones I mention?\n\nGive me a break, it has nothing to do with finance and everything to do with business model. If you can’t understand how business has changed finance, then you will continue to underperform by relying on outdated financial discipline viewpoints.",
        "subreddit": "investing",
        "title": "Not a single one of you are able to argue why “growth will collapse”",
        "url": "https://www.reddit.com/r/investing/comments/n2fchi/not_a_single_one_of_you_are_able_to_argue_why/",
        "created": 1619891983.0
    },
    {
        "author": "nobjos",
        "created_utc": 1619875150,
        "id": "n2i6oj",
        "num_comments": 180,
        "num_crossposts": 0,
        "selftext": "This post is in continuation of a series of posts I made in the previous weeks. The response I received was amazing and lot of you were asking for continued weekly updates. So here goes!\n\n**Most Discussed Stocks of the Week**\n\nhttps://preview.redd.it/tymisf4seiw61.png?width=623&amp;format=png&amp;auto=webp&amp;s=1aa1cef4c9a92f4863d89db376e4b86acf9380c9\n\n Microvision has overtaken GME to become the most discussed stock. This is the first time since Jan’21 that any stock has overtaken GME in the number of mentions (Not even the $100B Coinbase IPO could do it). Clover health has fallen from 3rd position last week to 7th this week. Coinbase also dropped out of the top 10 and is now in the 12th position. All the others are the usual stocks in the top 10 list except for Microsoft. They booked their biggest revenue growth since 2018 but down 3%+ after hours. \n\n **Top Growing Stocks of the Week** \n\nhttps://preview.redd.it/obttnaoueiw61.png?width=624&amp;format=png&amp;auto=webp&amp;s=c8e0b1a918c030d69646aa7f4915def8c13f1007\n\n Above is the list of stocks that have exploded in the number of mentions throughout social media.\n\n**MicroVision ($MVIS)** has been trending for the last two weeks. To say that the stock had a wild ride for the last 2 weeks would be an understatement. The stock went from having less than 500 mentions to more than 15,000 mentions in the last 2 weeks. The sentiment has also been affected by the recent drop going from 24% last week to 15% this week.\n\n**Globalstar ($GSAT)** is a Mobile satellite service company incorporating themselves into many new areas. GSAT was up 50% on Monday causing the spike in chatter. There has been a lot of discussion on the company trading at a value less than what their satellites currently in orbit are worth.\n\n**Nokia($NOK)** has beaten all expectations in earnings report and the stock jumped 11%. Their net profit increased more than 11-fold to 375 million euros ($455 million) which was well above analysts' estimates for adjusted profit of 90 million euros. The extremely bullish outlook is also reflected in the sentiment figures.\n\n**Ocugen($OCGN)** was trending mainly due to their partnership with an Indian firm – Bharat Biotech which produces Covaxin. The vaccine was found to neutralize a new type of Covid-19 variant and Dr. Fauci has said that this might be very important against the current pandemic. Ocugen is planning to bring this COVID-19 vaccine to the US, pending FDA authorization.\n\n**Amazon($AMZN)** was generating discussions due to its pending earnings report. There was a lot of speculative talk about a stock split. But they delivered beats on overall revenue and AWS revenue and far exceeded EPS estimate for Q1 2021.\n\n**SOME FAQ’s:**\n\nHow does the program work: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth. I added sentiment analysis to the findings so as to check the general sentiment (whether what is being talked about the stock is positive or negative).\n\nCan I use the code/is it open source: Yes.\n\nWhat is sentiment: It's calculated using natural language processing with a modified version of vadersentiment. You get pre-trained models which classify whether a given statement is positive or negative. I have modified it to analyse financial comments also ( eg. Calls, puts, moon, gain, loss etc). It then classifies the statement between -100% and +100% depending on if it's negative or positive respectively. The numbers you are seeing here is the average across all the comments.\n\nThank you for reading!\n\n*Disclaimer: I am not a financial advisor.*",
        "subreddit": "wallstreetbets",
        "title": "I analyze mentions and sentiment of stocks across Reddit and Twitter! This week's most discussed and top growing stocks!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2i6oj/i_analyze_mentions_and_sentiment_of_stocks_across/",
        "created": 1619903950.0
    },
    {
        "author": "donemessedup123",
        "created_utc": 1619919512,
        "id": "n2we74",
        "num_comments": 139,
        "num_crossposts": 0,
        "selftext": "Not asking for recommendations but curious to hear thoughts. FAAMG, as Goldman sachs defines as Facebook, Amazon, Apple, Microsoft, and Google (Alphabet), have been among the most dominant players in terms of growth, volume and market cap.\n\nAll of them have an arguably strong role to play in our society in the many years to come. \n\nI am curious to hear if anyone is particularly bullish or bearish on the outlook for any of these mammoth companies? \n\nDome focus questions: Do you think either of them are particularly positioned to dominate a new sector? Have some grown so large that they will stagnant from here? Do some now face legal risks because of alleged anti-competitiveness?",
        "subreddit": "stocks",
        "title": "Which FAAMG stocks do you think have the most potential 5-10 years?",
        "url": "https://www.reddit.com/r/stocks/comments/n2we74/which_faamg_stocks_do_you_think_have_the_most/",
        "created": 1619948312.0
    },
    {
        "author": "electricp0ww0w",
        "created_utc": 1619872336,
        "id": "n2hg4j",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "\nBackstory - Got into investing at the start of the year. Rode the gamestop train and was immensly annoyed at the manipulation taking place on it. Got out for a £5k profit.\n\nGot back on the gamestop train and am sitting at a £200 loss.\n\nGot onto the meme train of a certain stock running this week that deals with Lidar tech. Had 5k profit, was too greedy, got tied up and couldnt check my profile, ended up with a 2k loss.\n\nI really struggle with taking profits. It's probably greed. This is the biggest part of my investing life that I need to work on. I always think \"hmmm 20% profit, thats good, but 25% is better\". This mindset screws me every time, to the point I end up taking a loss, or taking a tiny profit because I held on and lost the big profit.\n\nOn the back of this week, I threw a yolo at Amazon 2 hours before earnings and made about £600 with an £18,000 play. Sold the next day.\n\nNow, this next thing is what really pissed me off - When I first started investing, I wanted to do my own DD.\n\nI found a British company called Scirocco Energy. It was a pennystock, trading around the $1 mark, but they had a couple of things I liked. Some mining operations set up for a few years down the line, and it looked pretty slick with some reasonable figures. It was my very first investment, and I put about £30 in, just so I could say I was \"in the market\".\n\nIt traded sideways FOREVER. Until all of a sudden, the other day, it went skyward, 60% in a single day, On no news at all. it was obvious it was being pumped and dumped. I sold and took my tiny $16 profit.\n\nIt irked me though. Someone has found this stock, pumped it up to high heaven and is in the process of dumping it. There's zero regulation. Nobody gives a toss. Nobody cares.\n\nLook at gamestop. Brokers literally turned off the market for a couple of days and caused retail a world of pain.\n\nThe mavis was another glorified pumped up memestock.\n\nIt just stinks.\n\nSo, I'm kinda done with this short term investing.\n\nI'm looking for a long term investment, something I can throw that £18,000 back in and do a Buffet on it. Leave it for a year or two and see what happens. Something which is only gonna go up, even if it is at a very slow rate. Low risk, low reward is fine by me, because my anxiety can't take any more of the huge changes in price on meme stocks.\n\nSuggestions anyone? Stick it all back in amazon? Microsoft? Some ETF that i'm unaware of? Maybe even BRK.B?\n\nI hope this doesn't come across as salty ranting tears because I lost money, in reality, my £30k profile has probably broken even (maybe a tiny loss) since I started investing, but it's really opened my eyes to how it all works, and how much of a casino it all is.\n\nI've got a couple of meme-ish long positions which hopefully might come good this year, but I need some stability in my life.",
        "subreddit": "stocks",
        "title": "I'm disillusioned with the market as a whole. Any recommendation for foolproof, low risk, boomer stock for a big investment?",
        "url": "https://www.reddit.com/r/stocks/comments/n2hg4j/im_disillusioned_with_the_market_as_a_whole_any/",
        "created": 1619901136.0
    },
    {
        "author": "shellycya",
        "created_utc": 1619879741,
        "id": "n2jk2k",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "First DD about something I'm familiar with.\n\nI am currently in FAANG tickers plus MSFT. Earnings were good but the stock is either not moving, or went up and came back down. I’m planning to sell everything I’m green in and move the majority over to something that has been killing it which is lumber. It can add some more variety to this sub.\n\nMy husband is in the industry (his company is not publicly traded) and things have been good and bad. It’s been good because people have been paying ridiculous prices for houses. Combine that with the building material shortage and he has been able to raise his profit margins. Very nice commission checks coming home.\n\nIt’s bad because there is not enough lumber for everyone and he’s been having hard conversations with builders who don’t get that they will have to slow down because product is running out.\n\nHere are how lumber futures have been doing.\n\n5 Day – 9.45%\n\n1 Month – 48.41%\n\n3 Month – 69.36%\n\nYTD – 72.15%\n\n1 Year – 359.39%\n\nIf anyone knows how to invest in futures without receiving actual product I would love to know. Don’t want to be that guy that got a bunch of oil delivered to him.\n\nWith how things are going we are going to continue to see a rise in lumber for at least through the summer. The biggest problem is obtaining Engineered Wood Products (EWP) and OSB. Home Depot has quadrupled the price of OSB over the past year. There is also a resin shortage that is needed to make these products. Timber is cheap but the bottleneck is sawmills. Either they have reduced capacity due to covid or they are switching business to OSB because it is more profitable.\n\nI’m looking at companies such as $BCC (38% last 3 months), $WY (23% last 3 months), $LPX (71% last 3 months). They have had great runs and are currently in a dip from the last few days. (Hopefully a dip and not the top).\n\nFirst companies that will be screwed sooner than later will most likely be home builders. They will soon realize they have been building houses for free and will get hit first. They try to hit a 35% profit margin. That margin is eroding by rising costs but they are under contract. Contracts last about 6 months. So expect their profits to go down. Unless they have been really good at guessing lumber futures and buying appropriately.\n\nHome builders have been hitting highs and could be shorted or have puts placed on them. Just look at the top 10 list of publicly traded developer stocks. Be careful with timing. They’ve had big jumps this last week.\n\nBear case: The fed could finally raise interest rates which would decrease demand and let supply catch up. More investment can go into building out saw mills. Builders can get creative and use different materials. This is where steel gang can benefit. Supply could eventually catch up but it may take some time. This is a several month play for now.\n\nCurrent position is shares in $BCC. I've seen nice steady rise over the last few months.\n\nTLDR: Lumber has been on a great run and is getting more scarce. Buy lumber tickers such as $BCC, $WY and $LPX and puts on big home developers. Mid term play.",
        "subreddit": "stocks",
        "title": "Let's talk Lumber Gang! Bullish on $BCC and $LPX. Bearish on Home Builders.",
        "url": "https://www.reddit.com/r/stocks/comments/n2jk2k/lets_talk_lumber_gang_bullish_on_bcc_and_lpx/",
        "created": 1619908541.0
    },
    {
        "author": "European_DGI",
        "created_utc": 1619965846,
        "id": "n37i2d",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "Why I bought Microsoft stock after their quarterly earnings (DCF &amp; EV/EBITDA fair value analysis) | Sunday with eDGI ☕",
        "url": "https://youtu.be/8yOzp5ePOA4",
        "created": 1619994646.0
    },
    {
        "author": "Kuentai",
        "created_utc": 1619979678,
        "id": "n3cfag",
        "num_comments": 454,
        "num_crossposts": 0,
        "selftext": "tldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow\n\n&amp;#x200B;\n\nThe issues with the livestock and fishing industries have been blowing up lately, we are running out of fish and livestock is one of the leading causes of climate change. The question remains, how do we solve the problem. Some say 'do less, eat less' but I'd argue that this is anathema to humanity and obviously isn't going to work fast enough. We can solve this problem, like everything, with technology. Make something better and cheaper and the majority will follow. \n\n&amp;#x200B;\n\nThis technology exists (lab grown/clean meat) and has been hitting the front page of reddit and international press almost daily at this point. Particularly because of the recent Netflix fishing documentary and Bill Gates letter. There is currently only one way to get in on the ride as a dirty retail investor. If this interests you, get ready for a deep dive.\n\n&amp;#x200B;\n\nI've been keeping an eye on and researching the lab grown meat industry for the last few years waiting for them to solve a technical and moral problem that was holding it back (FBS). Luckily this problem has largely been solved by each lab grown meat company individually, who have each finished developing their own solutions. Making Lab Grown Meat officially (and rebranded as) 'Clean Meat' and 'Cruelty Free.'\n\n&amp;#x200B;\n\nMany of these companies are building factories and aiming for product release **by the end of the year**. Basically a metric ton of [funding](https://agronomics.im/) was handed out in 2020 once these companies solved the FBS problem, massively accelerating their progress to the market.\n\n&amp;#x200B;\n\n\n**Important Points:**\n\n[Global meat, poultry and seafood market is growing to $7.3 trillion.](https://www.grandviewresearch.com/press-release/global-meat-poultry-seafood-market)\n\n**That's a lot of money.**\n\n&amp;#x200B;\n\n[Up to 99% of meat farming in America is factory farming.](https://www.sentienceinstitute.org/us-factory-farming-estimates)\n\n**Vast majority of consumers do not care about quality, just price.**\n\n&amp;#x200B;\n\n[According to American Human's survey nearly 95% of participants are \"very concerned\" about the welfare of farm animals.](https://awionline.org/sites/default/files/uploads/documents/fa-consumer_perceptionsoffarmwelfare_-112511.pdf)\n\n**People feel guilty about it.**\n\n&amp;#x200B;\n\n[84% of vegetarians return to eating meat.](https://www.thehealthy.com/food/vegetarians-vegans-go-back-meat/)\n\n**Buuuut people want/need meat.**\n\n&amp;#x200B;\n\n[\"If 1955 beef production practices were used today, we’d need 165 million more acres of land to produce the same output.\"](https://washingtoncitypaper.com/article/200456/could-we-survive-without-factory-farming-the-low-price-of/)\n\n**Producing meat at todays consumption level ethically is impossible.**\n\n&amp;#x200B;\n\n[Animal Husbandry is the second largest contributer to human made greenhouse gas emissions and the leading cause of deforestation, water and air pollution.](https://climatenexus.org/climate-issues/food/animal-agricultures-impact-on-climate-change/)\n\n**Legislation incoming.**\n\n&amp;#x200B;\n\n[Future Meat Technologies](https://www.future-meat.com/) says [its cultured products will take up 99% less land, 96% less freshwater and emit 80% less greenhouse gases than traditional meat production](https://www.cnbc.com/2019/10/19/lab-grown-meat-could-exacerbate-climate-change-scientists-say.html)\n\n**Self reported but reasonable when taking into account future economies of scale.**\n\n&amp;#x200B;\n\nSo, what to do.\n\nPeople don't like doing less, people don't like feeling bad, solve the problem as ever with technology.\n\nWe simply skip the cow and grow the burger.\n\n&amp;#x200B;\n\n**Is there competition from Big Meat?**\n\nAs of yet, no, in fact, the opposite. Everyone knows the story of how the auto industry has been trying to crush or minimise electric cars for the last hundred years and are only recently and extremely reluctantly developing their own.\n\nNot so with the meat industry, big players have instead invested directly into the growing new industry, could there be a greater approval than multi million investment, green lit by analysts and board, from the industry you intend to displace?\n\n[https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697](https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697)\n\nBig Players supporting the tech\n\nBill Gates, Richard Branson, Founder of Google, Richard Reed (innocent drinks)\n\n&amp;#x200B;\n\n**Optimistic speculation**\n\nCurrently the tech is in infancy and producing simple produce, however there is little perceivable upper limit for the technology, want a perfect Wagyu steak for half the price of a real cheap offcut? Achievable. Exotic blends of Quail and Puffin? Why not. A Woodpecker steak the size of a small child? Let me get the extra large vat ready. As with most technologies the upper ceiling is a considerable distance away, but with the number of competitors and roughly 250 million of funding in 2020 alone, the rate of progress is blistering. It's just a matter of time.\n\n&amp;#x200B;\n\n**Problems**\n\nIck factor.\n\nSolution = Used to be 'Lab Grown Meat.' Now it's being labelled as 'Clean Meat.' Currently 99.99% of budget is spent on R&amp;D and funding as it should be. As they begin to come to market more will be spent on marketing, outreach etc...\n\nPersonally everyone I've talked to starts with the ick reaction, then shortly after admits they'd try it, then after debating the 'important points' believes in it's inevitability.\n\nCriticism of carbon footprint = solved by intentionally linking up with renewable energy sources. Vast majority of companies are in it to solve the environmental problem and will make these moves.\n\n&amp;#x200B;\n\n**The Stock**\n\n**Agronomics - ANIC**\n\nhttps://agronomics.im/\n\nAs of this post bouncing to around 28,50GBX on the London Stock Exchange.\nThis is the only method a retail investor can get into the scene, will provide shareholders with exposure to a concentrated portfolio of companies in this area. In laymans it is like a lab grown meat etf. \n\n&amp;#x200B;\n\n**Current Weighting**\n\nLinks to each company here:\nhttps://agronomics.im/portfolio/\n\n**22.67% BlueNalu**, Inc, '**Cellular Aquaculture**' Fish stocks are dwindling and riddled with mercury and various extra toxins, not to mention the huge press and documentary situation lately on overfishing etc...  Solves all of these problems. BlueNalu is currently one of the most promising of the bunch, aiming to release cultured fish to the market by the end of the year.\n\n11.55% Meatable BV, focusing on cultivated beef and pork\n\n10.53% Other alternative protein investments \n\nShiok Meats, developing cultured seafood with a focus on shrimp.\n\nOritain, data science to prevent fraud in food supply chains.\n\nLegenDairy Foods, creating real, non cruelty dairy using fermentation techniques\n\nGALY, producing cotton grown in a lab\n\nBond Pet Foods, Plant based and Cultured pet food\n\n9.71% Solar Foods Oy, growing protein using a similar method to yeast to create protein powder, ultra low cost\n\n8.70% Cash balances\t\n \n7.92% Foods United, rebranded as LiveKindly, focusing on plant-based chicken\n\n7.92% Tropic Biosciences UK Limited, Using CRISPR and other techniques to produce high performing varieties of tropical crops \n\n6.60% Vitrolabs Inc, Lab grown leather.\n\n5.67% Mosa Meats B.V., working on cultured beef burgers\n\n5.28% Supermeat the Essence of Meat, cultured chicken, available in a restauraunt in Tel Aviv\n\n3.45% Legacy portfolio\t \n\n&amp;#x200B;\n\n**Big Players in Agronomics**\n\nRichard Reed - Chairman = Might know him as the founder of Innocent Drinks, Europes largest and most environmentally sustainable juice company, sold for $600m, now focuses on VC, finding and helping early stage consumer goods companies. Working on Graze, Deliveroo and Tails.\n\t- Taking consumer goods companies and turning them into global successes is like breathing to this guy.\n\nJim Mellon - Non Executive Director = Oxford grad billionaire investor, a true believer.\n\t- Truly believes in the tech and direction, huge resources to push these companies forwards and make it a reality. Has been consistently right for decades. One of the first to see the potential of SIlicon Valley.\n \"You can play with the samples in the lab, it will be a very short amount of time till we see these products dispersed.\"\n\n&amp;#x200B;\n\n**End Notes**\n\nIf that wasn't enough, here's a quote from Winston 'fucking' Churchill\n\n“\\[w\\]e shall escape the absurdity of growing a whole chicken in order to eat the breast or wing, by growing these parts separately under a suitable medium”.\n\n[https://www.nationalchurchillmuseum.org/fifty-years-hence.html](https://www.nationalchurchillmuseum.org/fifty-years-hence.html)\n\n&amp;#x200B;\n\nWhat does it taste like?\nThe chicken tastes like Chicken apparently. The beef tastes like beef. I'm done with links, google it you lazy apes.\n\n&amp;#x200B;\n\nFinal note: This is a long term speculative tech play that if you agree with the above is the equivalent to being able to buy a piece of almost all silicon valley companies back in 2001\n\n&amp;#x200B;\n\ntldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow",
        "subreddit": "wallstreetbets",
        "title": "Clean Meat is at the brink of revolutionising the livestock and fishing industries, expected to hit the market this year. How to get in as a dirty retailer.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3cfag/clean_meat_is_at_the_brink_of_revolutionising_the/",
        "created": 1620008478.0
    }
]