[
    {
        "author": "ImpossiblePasta333",
        "created_utc": 1620609343,
        "id": "n8scfl",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "Hey MouthBreathers, listen up. If you sold Nokia during the run-up then you just hate money. NOK got caught up in the GME saga and now the stock has a stink on it thanks to the mainstream media and others who don’t understand how a Short Squeeze works, and how GME went parabolic in one week. Let's keep in mind, there were some good and truthful DD posts on NOK in December/January, and some great fucking DD on Nok in the last couple months. I suspect it went from $4 to $9 just from the massive influx of new members checking out our old posts, trying to find an affordable seat on the Rocketship. No, Nokia doesn't have a ton of short interest. But I still really like the stock and I’d like to tell you why, and a little bit about our future re: John Titor\n\n\\&gt;Let's not forget about when this wasn't ALL about fucking the shorts, jeezus christ.. NOK is different from that bullshit, because it truly has deep fucking value. And believe me, this goes DEEP.. They don't manufacture or sell phones anymore. The only connection they have in making and selling phones is the Nokia brand name being licensed out to a Taiwanese manufacturing company called HDM Global. Almost all the company's revenue comes from Wireless Network Infrastructure and Internet Routing Equipment. Let's go back and track this evolution --&gt; In 2010 this only generated 30% of its revenue (Networking Products, Cellular Base Stations, etc) -- In 2020 this made them 85% of their revenue!! Nokia transformed itself into Wireless Technology Company you fucking retards!! They did this through a series of Autistic Acquisitions \"AA\" -- In April of 2011 they acquired the Wireless Network Infrastructure Assets of Motorola Solutions (this basically gave Nokia all of Motorola's 2G 3G 4G assets) --&gt; In August of 2013 Nokia acquired Nokia/Siemens Network joint venture and renamed the division \"Nokia Networks\" and that same year Nokia sold its entire mobile phone division to Microsoft --&gt; The in early 2016, Nokia agreed to acquire Alcatel-Lucent for $15.6 Billion which gave then all of their Wireless Technology, Routers, Switches, and Optical Tech within Alcatel as well as Bell Labs (formerly an Alcatel-Lucent division) -- This final deal gave Nokia the massive scale they have now to compete with the industry giants like Ericsson and Huawei head to fucking head (yeah.. this is real you idiots) And we know that Huawei is literally banned in multiple countries around the world soo... So where am I going with this, and why will they emerge as one of most important companies the near future?? \\*\\*REEFSHARK - AI DRIVEN 5G WIRELESS NETWORKS - NETWORK SLICING - AND THE POWER OF THE FUTURE\\*\\* Take an extra retard pill for the rest of this DD post, you're gonna need it. They have been building themselves up to this moment. ReefShark is the key here, 5G Network is the door, and AI Driven 5G Network Slicing is the living room of the future. Nokia has this proprietary chip that will play a big role in how 5G will be available. It will ease the load of 5G Network rollout because it has a 50%-%60 reduction in energy use, which is an outstanding selling point to the industries looking to tap into 5G bandwidth. It is the most efficient chip of its kind, by far, with the added benefit of boosting antenna performance. This efficiency is necessary to the way different industries and companies will utilize the 5G Network. They will go through MVNO (MOBILE VIRTUAL NETWORK OPERATOR) to basically rent out their 5G bandwidth from a cloud. This is called \\*Network Slicing\\* for all u chimps out there. For example, Tesla will rent out their own slice of dedicated 5G Bandwidth. More than 1,000 companies use MVNO already and most apes have not even heard of it yet. Here is how Nokia fits into all of this techy garbage: NOK IS ALREADY THE BIGGEST PLAYER IN THIS MARKET SPACE (they made up $4.5 billion of the $66.9 billion of \"Telecom Software and Services\" in 2019) AND \\*REEFSHARK\\* MAKES THEM THE UNCHALLENGED LEADER IN THIS EVERGROWING MARKET WITH AI POWERED NETWORK CAPABILITIES&lt;\n\n\\*\\*\\*BONUS LEVEL\\*\\*\\* Last year NASA selected Nokia's Bell Labs division to supply the 4G LTE communications network for the moon soon. No joke, the ACTUAL Moon, not emoji moon. Before the end of 2022, they will put a highly functioning 4G network on the lunar surface in preparation for the planned 2024 return mission to the Moon. Drop the crayons for a second and think about this... Ok now eat the red one (it's the same colors as your wife's butthole after her bf leaves your driveway in his big loud pickup truck) Your stupid little smooth brain is probably wondering what all this old 4G talk is about with all the 5G shit rolling out nationwide, changing the course of history... Answer--&gt; the lunar surface is relatively flat so there won't be interference with the cheaper, more practical 4G network. We are talking about putting a mobile network into space you retards so stfu. The signal will travel further, it just makes more sense. They must start somewhere, though this will evolve into 5G up there eventually. \\*\\*NASA could've given this contract to anyone, but THEY CHOSE NOKIA because they believe in them!! They believe Nokia has the best performing Wireless Network Equipment.. So I like the fucking stock ok?!! --&gt; Insert Rocket Emojis, Fire, Boom, Flags, all that shit right here &lt;--\n\nThe time to buy in is now..",
        "subreddit": "wallstreetbets",
        "title": "$NOK DeeDee: Get Your Diamond Hands Off Me You Damn Dirty Ape$",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n8scfl/nok_deedee_get_your_diamond_hands_off_me_you_damn/",
        "created": 1620638143.0
    },
    {
        "author": "ImpossiblePasta333",
        "created_utc": 1620612127,
        "id": "n8t57e",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "  \n\nHey MouthBreathers, listen up. If you sold Nokia during the run-up then you just hate money. NOK got caught up in the GME saga and now the stock has a stink on it thanks to the mainstream media and others who don’t understand how a Short Squeeze works, and how GME went parabolic in one week. Let's keep in mind, there were some good and truthful DD posts on NOK in December/January, and some great fucking DD on Nok in the last couple months. I suspect it went from $4 to $9 just from the massive influx of new members checking out our old posts, trying to find an affordable seat on the Rocketship. No, Nokia doesn't have a ton of short interest. But I still really like the stock and I’d like to tell you why, and a little bit about our future re: John Titor\n\n\\&gt;Let's not forget about when this wasn't ALL about fucking the shorts, jeezus christ.. NOK is different from that bullshit, because it truly has deep fucking value. And believe me, this goes DEEP.. They don't manufacture or sell phones anymore. The only connection they have in making and selling phones is the Nokia brand name being licensed out to a Taiwanese manufacturing company called HDM Global. Almost all of the company's revenue comes from Wireless Network Infrastructure and Internet Routing Equipment. Let's go back and track this evolution --&gt; In 2010 this only generated 30% of its revenue (Networking Products, Cellular Base Stations, etc) -- In 2020 this made them 85% of their revenue!! Nokia transformed itself into a Wireless Technology Company you fucking retards!! They did this through a series of Autistic Acquisitions \"AA\" -- In April of 2011 they acquired the Wireless Network Infrastructure Assets of Motorola Solutions (this basically gave Nokia all of Motorola's 2G 3G 4G assets) \n\n\\--&gt; In August of 2013 Nokia acquired Nokia/Siemens Network joint venture and renamed the division \"Nokia Networks\" and that same year Nokia sold its entire mobile phone division to Microsoft --&gt; Then, in early 2016, Nokia agreed to acquire Alcatel-Lucent for $15.6 Billion which gave them all of their Wireless Technology, Routers, Switches, and Optical Tech within Alcatel as well as Bell Labs (formerly an Alcatel-Lucent division) -- This final deal gave Nokia the massive scale they have now to compete with the industry giants like Ericsson and Huawei head to fucking head (yeah.. this is real you idiots) And we know that Huawei is literally banned in multiple countries around the world soo... So where am I going with this, and why will they emerge as one of most important companies the near future?? \\*\\*REEFSHARK - AI DRIVEN 5G WIRELESS NETWORKS - NETWORK SLICING - AND THE POWER OF THE FUTURE\\*\\* Take an extra retard pill for the rest of this DD post, you're gonna need it. They have been building themselves up to this moment. ReefShark is the key here, 5G Network is the door, and AI Driven 5G Network Slicing is the living room of the future. Nokia has this proprietary chip that will play a big role in how 5G will be available. It will ease the load of 5G Network rollout because it has a 50%-%60 reduction in energy use, which is an outstanding selling point to the industries looking to tap into 5G bandwidth. It is the most efficient chip of its kind, by far, with the added benefit of boosting antenna performance. This efficiency is necessary to the way different industries and companies will utilize the 5G Network. They will go through MVNO (MOBILE VIRTUAL NETWORK OPERATOR) to basically rent out their 5G bandwidth from a cloud. This is called \\*Network Slicing\\* for all u chimps out there. For example, Tesla will rent out their own slice of dedicated 5G Bandwidth. More than 1,000 companies use MVNO already and most apes have not even heard of it yet. Here is how Nokia fits into all of this techy garbage: NOK IS ALREADY THE BIGGEST PLAYER IN THIS MARKET SPACE (they made up $4.5 billion of the $66.9 billion of \"Telecom Software and Services\" in 2019) AND \\*REEFSHARK\\* MAKES THEM THE UNCHALLENGED LEADER IN THIS EVERGROWING MARKET WITH AI POWERED NETWORK CAPABILITIES&lt;\n\n\\*\\*\\*BONUS LEVEL\\*\\*\\* Last year NASA selected Nokia's Bell Labs division to supply the 4G LTE communications network for the moon soon. No joke, the ACTUAL Moon, not emoji moon. Before the end of 2022, they will put a highly functioning 4G network on the lunar surface in preparation for the planned 2024 return mission to the Moon. Drop the crayons for a second and think about this... Ok now eat the red one (it's the same colors as your wife's butthole after her bf leaves your driveway in his big loud pickup truck) Your stupid little smooth brain is probably wondering what all this old 4G talk is about with all the 5G shit rolling out nationwide, changing the course of history... Answer--&gt; the lunar surface is relatively flat so there won't be interference with the cheaper, more practical 4G network. We are talking about putting a mobile network into space you retards so stfu. The signal will travel further, it just makes more sense. They must start somewhere, though this will evolve into 5G up there eventually. \\*\\*NASA could've given this contract to anyone, but THEY CHOSE NOKIA because they believe in them!! They believe Nokia has the best performing Wireless Network Equipment.. So I like the fucking stock ok?!! --&gt; Insert Rocket Emojis, Fire, Boom, Flags, all that shit right here &lt;--\n\nThe time to buy in is now..",
        "subreddit": "smallstreetbets",
        "title": "Classic Bets - $NOK DeeDee",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/n8t57e/classic_bets_nok_deedee/",
        "created": 1620640927.0
    },
    {
        "author": "-Carthagodelendaest",
        "created_utc": 1622209465,
        "id": "nmy5e3",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hey guys,\n\nI invite you to look at this stock as it might be flying under the radar. A lot of this info comes from the presentation they released yesterday (link: [https://player.vimeo.com/video/554778399](https://player.vimeo.com/video/554778399) ) and  I strongly recommend to watch it to get a better picture of the company and their products. Just a heads up, I don't think you can make a quick buck here. In my opinion, this is a long-term investment akin to MVIS, if you bought it years ago.\n\nEnter Lightwave Logic Inc. (OTCQX: LWLG) -   a technology platform company, leveraging its proprietary technology  platform to develop next-generation electro-optic polymers which  increase the efficiency of internet infrastructure by converting data  into optical signals, allowing more data to be transmitted at  significantly higher speeds and with less power than existing solutions.\n\nThe Company’s current focus is on the datacom and telecommunications hardware supply chain for the 100 Gbps and 400 Gbps fiber optics  communications market, seeking to integrate its proprietary materials  into the devices that comprise key components in today’s internet  infrastructure. Lightwave Logic’s unique value proposition, including  ease of manufacture relative to traditional solutions, has driven  **several tier-1 and tier-2** potential strategic partners in the data and  telecommunications markets to enter into non-disclosure agreements  (NDAs) with Lightwave Logic to evaluate its technology for use in their  devices, validating the demand for the Company’s solution in the  marketplace. The Company expects to introduce its technology into the  commercial marketplace in the near future.\n\nIn plain English, they design hardware that allows to transmit data faster and in larger volumes, a need, that is growing by the day. Just think by how much this industry has grown in the last year since the pandemic started. A lot of companies have shifted from office to the work-from-home model. In other words, I believe this is the right time to bet on this industry.\n\nSome good moments I personally find very attractive:\n\n* One thing I read that I really liked is that they have in-house materials synthesis, device/package design, wafer fabrication and testing capabilities at its Englewood, Colorado headquarters, which basically means they don't depend as much on widely accepted supply-outsourcing standards.\n* They uplisted from OTCQB to OTCQX in Dec. 2020 and they did it without any share manipulation, which exposed the stock to a larger market audience. Next, they plan on moving up to Nasdaq and most of the requirements have been already met (see below). All they need to hit is a higher PPS, which should be achievable considering the smart leading team and recent achievements.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vjwm9u6h2v171.png?width=504&amp;format=png&amp;auto=webp&amp;s=5207c82c33801af5b8ca63accd928d4cd5e98b32\n\n* Financials: $6.5 million cash on hand. $0.9M in debt.  O/S - 103m, Float - 87m.  Fantastic structure and only $148M market cap.\n\nhttps://preview.redd.it/kbmta45i2v171.png?width=372&amp;format=png&amp;auto=webp&amp;s=8c3d532707d8dece849eb3e7c7d1b7ed6cbd06d6\n\n&amp;#x200B;\n\n* The management team seems to be very level-headed and doesn't throw out a lot of buzz word news to pump and dump. Just look at some of the people on the board: [https://www.lightwavelogic.com/about-us/leadership/](https://www.lightwavelogic.com/about-us/leadership/)\n\nThe CEO is a knowledgeable and recognized expert in the industry.  His career started with the British Government in 1977 in  telecommunications and he did research at their prestigious labs (RSRE  Malvern) in the early 1980s and worked at AT&amp;T Bell Labs (1985-1989)  in photonics. At Motorola in the 1990s he drove the development,  including co-authorship of the first patent, of the oxide VCSEL diode  laser which is now used in laser mice, 3D sensing/FaceID in mobile  phones, optical interconnects with volumes over 1B units. From 2005-2010  he led the USA trade association in optoelectronics (OIDA) and  represented the optoelectronics industry on Capitol Hill. He has run  technical start-ups and commercialized optoelectronic and photonics  technology into manufacturing. He was voted PIC (Photonic Integrated  Circuit) business leader of the year by the PIC International Conference  in 2018. He is a technical expert to the European Commission and a  Fellow of IEEE and OSA. \n\nNot so great moments:\n\n* The company is not yet generating any revenue. They have been developing their product for years and the time to commercialize it is coming soon.\n* Hard to assess their ability to market the product although they do claim to have been working with some tier 1 and tier 2 potential partners.\n\nI wish I understood more about the product itself but I don't have any technical background so I still have a lot of digging to fully understand the picture by piecing together whatever bits I find on the internet. Right now, I'm relying on feedback and opinions of the public. If any of you has any expertise in it, please chime in! here is a link to their white papers: [https://www.lightwavelogic.com/resource-center/technical-presentations-white-papers/](https://www.lightwavelogic.com/resource-center/technical-presentations-white-papers/)",
        "subreddit": "pennystocks",
        "title": "Lightwave Logic Inc. - Bridging Data Islands at High Speed. 🚨 $0.9M Debt, $6.5M cash in hand",
        "url": "https://www.reddit.com/r/pennystocks/comments/nmy5e3/lightwave_logic_inc_bridging_data_islands_at_high/",
        "created": 1622238265.0
    },
    {
        "author": "ImpossiblePasta333",
        "created_utc": 1620612314,
        "id": "n8t71u",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hey MouthBreathers, listen up. If you sold Nokia during the run-up then you just hate money. NOK got caught up in the GME saga and now the stock has a stink on it thanks to the mainstream media and others who don’t understand how a Short Squeeze works, and how GME went parabolic in one week. Let's keep in mind, there were some good and truthful DD posts on NOK in December/January, and some great fucking DD on Nok in the last couple months. I suspect it went from $4 to $9 just from the massive influx of new members checking out our old posts, trying to find an affordable seat on the Rocketship. No, Nokia doesn't have a ton of short interest. But I still really like the stock and I’d like to tell you why, and a little bit about our future re: John Titor\n\n\\&gt;Let's not forget about when this wasn't ALL about fucking the shorts, jeezus christ.. NOK is different from that bullshit, because it truly has deep fucking value. And believe me, this goes DEEP.. They don't manufacture or sell phones anymore. The only connection they have in making and selling phones is the Nokia brand name being licensed out to a Taiwanese manufacturing company called HDM Global. Almost all of the company's revenue comes from Wireless Network Infrastructure and Internet Routing Equipment. Let's go back and track this evolution --&gt; In 2010 this only generated 30% of its revenue (Networking Products, Cellular Base Stations, etc) -- In 2020 this made them 85% of their revenue!! Nokia transformed itself into a Wireless Technology Company you fucking retards!! They did this through a series of Autistic Acquisitions \"AA\" -- In April of 2011 they acquired the Wireless Network Infrastructure Assets of Motorola Solutions (this basically gave Nokia all of Motorola's 2G 3G 4G assets) \n\n\\--&gt; In August of 2013 Nokia acquired Nokia/Siemens Network joint venture and renamed the division \"Nokia Networks\" and that same year Nokia sold its entire mobile phone division to Microsoft --&gt; Then, in early 2016, Nokia agreed to acquire Alcatel-Lucent for $15.6 Billion which gave them all of their Wireless Technology, Routers, Switches, and Optical Tech within Alcatel as well as Bell Labs (formerly an Alcatel-Lucent division) -- This final deal gave Nokia the massive scale they have now to compete with the industry giants like Ericsson and Huawei head to fucking head (yeah.. this is real you idiots) And we know that Huawei is literally banned in multiple countries around the world soo... So where am I going with this, and why will they emerge as one of most important companies the near future?? \\*\\*REEFSHARK - AI DRIVEN 5G WIRELESS NETWORKS - NETWORK SLICING - AND THE POWER OF THE FUTURE\\*\\* Take an extra retard pill for the rest of this DD post, you're gonna need it. They have been building themselves up to this moment. ReefShark is the key here, 5G Network is the door, and AI Driven 5G Network Slicing is the living room of the future. Nokia has this proprietary chip that will play a big role in how 5G will be available. It will ease the load of 5G Network rollout because it has a 50%-%60 reduction in energy use, which is an outstanding selling point to the industries looking to tap into 5G bandwidth. It is the most efficient chip of its kind, by far, with the added benefit of boosting antenna performance. This efficiency is necessary to the way different industries and companies will utilize the 5G Network. They will go through MVNO (MOBILE VIRTUAL NETWORK OPERATOR) to basically rent out their 5G bandwidth from a cloud. This is called \\*Network Slicing\\* for all u chimps out there. For example, Tesla will rent out their own slice of dedicated 5G Bandwidth. More than 1,000 companies use MVNO already and most apes have not even heard of it yet. Here is how Nokia fits into all of this techy garbage: NOK IS ALREADY THE BIGGEST PLAYER IN THIS MARKET SPACE (they made up $4.5 billion of the $66.9 billion of \"Telecom Software and Services\" in 2019) AND \\*REEFSHARK\\* MAKES THEM THE UNCHALLENGED LEADER IN THIS EVERGROWING MARKET WITH AI POWERED NETWORK CAPABILITIES&lt;\n\n\\*\\*\\*BONUS LEVEL\\*\\*\\* Last year NASA selected Nokia's Bell Labs division to supply the 4G LTE communications network for the moon soon. No joke, the ACTUAL Moon, not emoji moon. Before the end of 2022, they will put a highly functioning 4G network on the lunar surface in preparation for the planned 2024 return mission to the Moon. Drop the crayons for a second and think about this... Ok now eat the red one (it's the same colors as your wife's butthole after her bf leaves your driveway in his big loud pickup truck) Your stupid little smooth brain is probably wondering what all this old 4G talk is about with all the 5G shit rolling out nationwide, changing the course of history... Answer--&gt; the lunar surface is relatively flat so there won't be interference with the cheaper, more practical 4G network. We are talking about putting a mobile network into space you retards so stfu. The signal will travel further, it just makes more sense. They must start somewhere, though this will evolve into 5G up there eventually. \\*\\*NASA could've given this contract to anyone, but THEY CHOSE NOKIA because they believe in them!! They believe Nokia has the best performing Wireless Network Equipment.. So I like the fucking stock ok?!! --&gt; Insert Rocket Emojis, Fire, Boom, Flags, all that shit right here &lt;--\n\nThe time to buy in is now..",
        "subreddit": "Wallstreetbetsnew",
        "title": "Nokia... Cheese... And the Reality of the Company's Value",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n8t71u/nokia_cheese_and_the_reality_of_the_companys_value/",
        "created": 1620641114.0
    },
    {
        "author": "CatSE---ApeX---",
        "created_utc": 1620567045,
        "id": "n8ean8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Develop. | Repr.Co. | R&amp;D Lab. | Commercializ.\n:--|:--:| :--:|:--:\nTelegraph | West Union | 1840 | 1860\nTelephone | AT&amp;T | 1876 | 1920\nWireless | Marconi | 1895 | 1912\nRadio | Westinghouse | 1896 | 1920\nMovies | Disney | 1900 | 1929\nTelevision | NBC | 1925 | 1941\nAdvertising | Interpublic group | 1800 | 1920\nInternet | AOL | 1974 | 1985\nCellphones | Motorola | 1985 | 1995\nSmartphones | Apple | 2007 | 2010\nComputer Search | Google | 1995 | 2000\nSocial media | Facebook | 2005 | 2010\nSat global 5g | AST | 2013 | 2023",
        "subreddit": "wallstreetbets",
        "title": "Communications Services Sector next Tier is 5g global connectivity. First mover advantage $ASTS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n8ean8/communications_services_sector_next_tier_is_5g/",
        "created": 1620595845.0
    },
    {
        "author": "Ossie182",
        "created_utc": 1620163058,
        "id": "n4yjwm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "CanadianInvestor",
        "title": "unminable miner msi laptop multiple running safe?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n4yjwm/unminable_miner_msi_laptop_multiple_running_safe/",
        "created": 1620191858.0
    }
]