[
    {
        "author": "yeahyeah2468",
        "created_utc": 1628411102,
        "id": "p0aylx",
        "num_comments": 1285,
        "num_crossposts": 0,
        "selftext": "Obviously, listing companies that are currently already super close to a 1 trillion market cap is not really helpful. \n\nA trillion isn’t wha it used to be, lol, but I’m curious what you all are thinking when it comes to companies with a 1 trillion market cap in 5 years. \n\nMy personal picks:\n\n- SHOP\n- NVDA\n\nWhat are your picks?",
        "subreddit": "stocks",
        "title": "Which stock, currently well below a 1 trillion $ market cap, do you see reaching that market cap within 5 years?",
        "url": "https://www.reddit.com/r/stocks/comments/p0aylx/which_stock_currently_well_below_a_1_trillion/",
        "created": 1628439902.0
    },
    {
        "author": "Unusual-Whales",
        "created_utc": 1629467874,
        "id": "p85qae",
        "num_comments": 538,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Pelosi buys huge $NVDA plays",
        "url": "https://www.reddit.com/r/stocks/comments/p85qae/pelosi_buys_huge_nvda_plays/",
        "created": 1629496674.0
    },
    {
        "author": "doggy_lovers",
        "created_utc": 1628873191,
        "id": "p3ozbg",
        "num_comments": 515,
        "num_crossposts": 0,
        "selftext": "I am interested in hearing a bull case for doordash. I've seen many youtube videos, reddit posts, and more always dump this stock yet this stock is trading at a high valuation at 18 times sales which implies at least 20-25% sales growth for the next 10 years based on my model. Even Uber, which I consider to be massively overvalued, is trading only 17 billion more for postmates and most dominant ride haling service. \n\nWith earnings miss, i would thought that this stock would go down, but instead as of writing this post it is up 1.5% while airbnb is down on better earnings. Even Disney stock, which crushed earnings, is only up 1.8% as of writing this, and trades at a more reasonable valuation. In my opinion, you cant miss earnings, and expect to go up, yet DoorDash did and the guidance wasnt that great either. \n\nSo why did doordash go up today on earnings? I didn't see any reddit post on doordash earnings, in fact I rarely hear anyone talk about this stock which is surprising considering its a 62 billion growth company. ( i hear more people discuss corsair which is a 2 billion company)\n\n I would like to hear your thoughts on why this stock is worth the price, I always like to hear bull cases, on companies I find overvalued (like i read other people's post on crowdstrike, nvidia, moderna so even thought I find those stocks are overvalued I understand the market valuation is so high on those companies.) \n\nIn short, I am interested in hearing a bull case for doordash and why doordash went up on earnings while most stocks went down on earnings (like sofi, ttcf, which is consider to be reasonable valuation)",
        "subreddit": "stocks",
        "title": "How is DoorDash a 62 billion company?",
        "url": "https://www.reddit.com/r/stocks/comments/p3ozbg/how_is_doordash_a_62_billion_company/",
        "created": 1628901991.0
    },
    {
        "author": "Unusual-Whales",
        "created_utc": 1629466442,
        "id": "p85apw",
        "num_comments": 439,
        "num_crossposts": 1,
        "selftext": "Pelosi has purchased huge nearly $1.5 million in $NVDA.\n\nShe also purchased 50 $NVDA call options at strike $100 and expiry 09/16/2022.\n\nThis is wild.\n\nLink: unusualwhales.com/i_am_the_senate",
        "subreddit": "options",
        "title": "Pelosi buys long $NVDA contracts",
        "url": "https://www.reddit.com/r/options/comments/p85apw/pelosi_buys_long_nvda_contracts/",
        "created": 1629495242.0
    },
    {
        "author": "Alecurtis1",
        "created_utc": 1629339207,
        "id": "p75p3u",
        "num_comments": 413,
        "num_crossposts": 0,
        "selftext": "I’ve had $1,000 sitting in my account for months now as I’ve been researching about day trading, options trading, basically everything I feel I need to know. I feel like I’m ready to finally start trying to put money out, but I can’t seem to work the courage to actually do it. For example, NVIDIA smashed there earnings so I feel like I should do a OOTM call, but don’t want to pull the trigger because if it doesn’t execute then I lose $200-$300. (a 1/3 of my account value) If anyone has advice to a beginner trader and how to better research stocks, read graphs, or just get past the fear of initially starting and worry about failing, I’d love to hear it.",
        "subreddit": "options",
        "title": "Advice for a 20 year old starting with $1,000",
        "url": "https://www.reddit.com/r/options/comments/p75p3u/advice_for_a_20_year_old_starting_with_1000/",
        "created": 1629368007.0
    },
    {
        "author": "Cygopat",
        "created_utc": 1629727722,
        "id": "pa0kix",
        "num_comments": 341,
        "num_crossposts": 0,
        "selftext": "NVDA market cap:  $535,91B \n\nTSM market cap:  $517,93B \n\nASML market cap: $333,46B \n\nINTC market cap: $213,92B \n\nI fully realize that the term \"semiconductor\" is no more fully accurate for NVDA as it has been expanding heavily on the software side, yet that software is based on them selling chips so I still think its the correct category of industries for NVDA and a very interesting observation of what the market things the future of these companies holds.",
        "subreddit": "investing",
        "title": "As I'm writing this NVDA has overtaken TSM as the world's most valuable semiconductor company",
        "url": "https://www.reddit.com/r/investing/comments/pa0kix/as_im_writing_this_nvda_has_overtaken_tsm_as_the/",
        "created": 1629756522.0
    },
    {
        "author": "turdoe",
        "created_utc": 1630034272,
        "id": "pcf16a",
        "num_comments": 298,
        "num_crossposts": 0,
        "selftext": "It's in everything nowadays, AMD will be in the new Teslas, graphics cards, phones, tablet, 5G, any \"smart\" device pretty much need these guys, but the question is will these guys be driving SPY or would SPY/VOO still be a better option in the like 10-15 years? Thinking about CHPS/SOXX as well. What do you guys think?\n\n[https://www.hitachi-hightech.com/global/products/device/semiconductor/life.html#:\\~:text=CPUs%20that%20operate%20personal%20computers,LED%20bulbs%20also%20use%20semiconductors](https://www.hitachi-hightech.com/global/products/device/semiconductor/life.html#:~:text=CPUs%20that%20operate%20personal%20computers,LED%20bulbs%20also%20use%20semiconductors).\n\nSemi-conductor/processors will be behind every technological advance we have, fields like AI, LoT look super interesting. \n\n[https://www.financialexpress.com/investing-abroad/stockal-specials/semiconductor-industry-key-growth-drivers-and-the-changing-trends-an-overview/2287214/](https://www.financialexpress.com/investing-abroad/stockal-specials/semiconductor-industry-key-growth-drivers-and-the-changing-trends-an-overview/2287214/)",
        "subreddit": "stocks",
        "title": "Is the semiconductor/processor industry (NVDA, AMD, TSM, QCOM) a no-brainer investment for a 10+ yr time frame?",
        "url": "https://www.reddit.com/r/stocks/comments/pcf16a/is_the_semiconductorprocessor_industry_nvda_amd/",
        "created": 1630063072.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1629165023,
        "id": "p5u8n4",
        "num_comments": 249,
        "num_crossposts": 0,
        "selftext": "25% of my portfolio is made up of MSFT AAPL and GOOGL.  How am I doing?\n\nIf I include NVDA it's 30% of my portfolio.  So far in 1.5 years I've done very well.\n\nI do lose more in sell offs then VTI usually, but I feel ok with it.\n\nAm I ok for the next 5 to 10 years?",
        "subreddit": "stocks",
        "title": "25% of my portfolio is MSFT AAPL and GOOGL. Am I in trouble?",
        "url": "https://www.reddit.com/r/stocks/comments/p5u8n4/25_of_my_portfolio_is_msft_aapl_and_googl_am_i_in/",
        "created": 1629193823.0
    },
    {
        "author": "r2002",
        "created_utc": 1629931315,
        "id": "pbmbzk",
        "num_comments": 223,
        "num_crossposts": 0,
        "selftext": "[Source](https://finance.yahoo.com/news/u-near-deal-nvidia-supercomputer-190754396.html?.tsrc=rss):\n\n&gt;The U.S. Department of Energy is nearing a deal to purchase a supercomputer made with chips from Nvidia Corp and Advanced Micro Devices Inc as a key lab waits for a larger supercomputer from Intel Corp that has been delayed for months, two people familiar with the matter told Reuters.\n\n&gt;The Nvidia and AMD machine, to be called Polaris, will not be a replacement for the Intel-based Aurora machine slated for the Argonne National Lab near Chicago, which was poised to be the nation's fastest computer when announced in 2019.\n\n&gt;Instead, Polaris, which will come online this year, will be a test machine for Argonne to start readying its software for the Intel machine, the people familiar with the matter said.\n\nA more technical breakdown can be found from the [DOE's lab's website](https://www.anl.gov/article/us-department-of-energys-argonne-national-laboratory-and-hewlett-packard-enterprise-prepare-for).\n\nTo be clear, the Intel deal is merely delayed, but not canceled. How does this change the narrative of Nvda/AMD versus Intel in the high-end server and super computer space? Are these kind of delays very common? I.E It's not a big deal.\n\nOr did Intel just messed up a very visible and prestigious deal that will accelerate nvda/amd's surge to capture Intel market share?",
        "subreddit": "investing",
        "title": "Department of Energy will buy an Nvidia-AMD powered supercomputer because Intel is months late on delivery",
        "url": "https://www.reddit.com/r/investing/comments/pbmbzk/department_of_energy_will_buy_an_nvidiaamd/",
        "created": 1629960115.0
    },
    {
        "author": "sokolpl",
        "created_utc": 1629036480,
        "id": "p4u3ud",
        "num_comments": 209,
        "num_crossposts": 0,
        "selftext": "NVDA is realizing their earnings report on Monday after hours. According to Nasdaq we should expect a very good qt for them because of the explosive growth in the first qt of about 84% and are expecting 6.3b in revenue which would be increase of 63% over the prior year period revenue of 3.37b. Additionally, the chip giant had pointed out in April this year that 85% of its installed base is yet to upgrade to an RTX series card. The demand for data center GPUs is expected to grow at an annual rate of 43.5% through 2026 to $26.2 billion. \n\nWhat are your thoughts on the upcoming earnings, for me it looks alluring given the recent split and the stock being more affordable to investors.",
        "subreddit": "stocks",
        "title": "NVIDIA earnings coming up on Monday.",
        "url": "https://www.reddit.com/r/stocks/comments/p4u3ud/nvidia_earnings_coming_up_on_monday/",
        "created": 1629065280.0
    },
    {
        "author": "circdenomore",
        "created_utc": 1630158910,
        "id": "pda6xl",
        "num_comments": 187,
        "num_crossposts": 0,
        "selftext": "How many of us have googled: “how much would 10k invested in AAPL in 1990 be worth today?” (in addition to “how do I get my wife to let her boyfriend peg me?”).\n\nWith automation, AI, ML becoming more widely adopted across industries in the decade ahead, and NVDA’s strong grounding all of the above, I am convinced NVDA will be the AAPL growth story of this generation. Please change my mind. \n\nPositions: couple thousand shares @~40 (post-split)",
        "subreddit": "wallstreetbets",
        "title": "Change my mind: NVDA the AAPL of this generation",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pda6xl/change_my_mind_nvda_the_aapl_of_this_generation/",
        "created": 1630187710.0
    },
    {
        "author": "Warren_MuffClit",
        "created_utc": 1629398994,
        "id": "p7l0qt",
        "num_comments": 160,
        "num_crossposts": 0,
        "selftext": "All year for about 13 months now I've  been heavy on growth. I've come close to my position nearly doubling in value, and then lost all my profits in February. Shot back up in June and then crumbled back close to break even again recently.\n\nI have learned a lot over the year. A lot about growth vs value and the importance of fundamentals.  I've made some mistakes like fomoing but I think now it's made me a smarter investor.\n\n\nI recently basically liquidated all my shares and moved to a  cash position on everything bar some dividend stocks and some safe tech like AAPL and NVDA( up a good few percent on both so a massive correction to breakeven wouldn't even worry me. \n\nI'm in my 20s and my total investment worth is about 15k including My recent cash position. \n\nI sold tesla today and this hurt. I will be buying back. I must think it's way too risky in the short term. And I also need a house so the 15k would be close to a deposit down payment. But I'm not against going all in on an undervalued company such as HPQ(price to earnings is like 10 and they pay dividends.)\n\nI made some profits off Chinese EV. But personally I feel that is one of the most dangerous sectors in the market. Especially with what's going on with CCP recently.\n\n\nJust wanted to make this to  see if there is similar sentiment about thinking valuations have gone absolutely insane in growth stocks , tech and EV.\n\n\nI am now a bear on the market as a whole. And take my advise. I used to think dividend or value plays were a real boring way to invest. They seemed it in 2020. But in 21 they are a far better play.\n\n\nMy advice: inflation is going to wreck growth in the short term. And I'd keep some cash aside for dips if you are an investor. I can't shake the feeling the market is being propped up so artificially, and we are in for a serious correction.\n\n\nLove to hear from you guys and don't feel like you can't dm me or comment some questions..\n\nBTW I'm not into memes. Its cool if you are but my post isn't signalling the MO ASS because I think we are in for a correction or crash. In fact i think stocks like amc and gme will suffer like growth will as well. If this takes place.",
        "subreddit": "stocks",
        "title": "So I'm gradually becoming a boomer investor.",
        "url": "https://www.reddit.com/r/stocks/comments/p7l0qt/so_im_gradually_becoming_a_boomer_investor/",
        "created": 1629427794.0
    },
    {
        "author": "GrapeJuicex",
        "created_utc": 1629318935,
        "id": "p6zn4k",
        "num_comments": 158,
        "num_crossposts": 0,
        "selftext": "Revenue of $6.51B beats a $6.33B consensus. \n\nNon-GAAP EPS of $1.04 beats a $1.02 consensus.\n\nFQ3 guiding revenue of $6.8B, plus or minus 2%. above a $6.57B consensus.\n\nData Center segment revenue rose 16% Q/Q and 35% Y/Y to $2.37B, topping a $2.27B consensus.\n\nGaming segment revenue rose 11% Q/Q and 85% Y/Y in FQ2 to $3.06B, topping a $2.98B consensus.\n\nAutomotive revenue came in at $152M -- down 1% Q/Q, up 37% Y/Y and below a $164M consensus.\n\nThe Professional Visualization segment, which covers workstation GPUs and other offerings for visual creators, saw revenue grow 40% Q/Q and 156% Y/Y to $519M. That soundly beat a $364M consensus.\n\nNvidia adds that sales of its CMP GPUs, which target crypto miners, accounted for $266M of this total. This compares with FQ1 CMP revenue of $155M.\n\nThe \"OEM and Other\" segment, which among things covers non-gaming PC GPUs, posted revenue of $409M. That's up 25% Q/Q and 180% Y/Y, but below a $463M consensus.\n\n\nhttps://www.thestreet.com/investing/nvidia-q2-live-blog-eric-jhonsa",
        "subreddit": "stocks",
        "title": "NVDA beats earnings estimates",
        "url": "https://www.reddit.com/r/stocks/comments/p6zn4k/nvda_beats_earnings_estimates/",
        "created": 1629347735.0
    },
    {
        "author": "SimoHayha360",
        "created_utc": 1629812009,
        "id": "panf65",
        "num_comments": 157,
        "num_crossposts": 0,
        "selftext": "This post isn't meant for apes that are currently busy throwing their money on some commie stock that el presidente Xi is hell bent on f*cking over. This post also isn't meant for those who can't read newspapers and failed to spot this:\n\nhttps://www.barrons.com/articles/intel-stock-chips-defense-51629757043?siteid=yhoof2\n\nShort story:\n\n˝Intel said Monday it had landed a U.S. Department of Defense pact for an undisclosed sum to manufacture advanced microchips through its contract-manufacturing unit for the first phase of a broader program.˝\n\nFirst phase of a broader program...\n\nFinally somebody figured out that having most of microchips being produced on an island that China has a hard on for isn't the best idea.  \n\nAs part of governments ˝made in America˝ program Intel will invest in new factories in Arizona and expand existing capacity. \n\nOn Taiwan they screwed over Apple and AMD and booked most of TSMC's 3nm capacity for the next year.\n\nIn Q1 2022 they will also release their new gpus. Rumors say that Intel's top of the range gpu is on par with Nvidia's 3070. \n\nIf they manage to pull that one of and flood the market with a decent number of graphic cards - they will be flying to the moon just based on that one.  \n\nPlus generally speaking they are swimming in cash.\n\nYeah I know this post is a bit gay and requires reading one linked article but I just had to post some fucking alternative to endless stream of posts about fucking BABA - a company that can be fucking delisted with one snap of Xi's fingers.\n\nEverybody is talking about how cheap $160 BABA is and I'm just here facepalming at endless stream of people basically giving away their money to Xi. \n\nWISH literally just happened... Did apes learn anything? Nope they collected what remained of their bananas and are rushing to hand them over to daddy Xi... \n🗽🦍🍌😑⛩⛩🏯⛩⛩\n\nRegret not buying nVidia, Microsoft or AMD when they were $50?",
        "subreddit": "wallstreetbets",
        "title": "INTEL is $50 bucks just saying...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/panf65/intel_is_50_bucks_just_saying/",
        "created": 1629840809.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1629593985,
        "id": "p931xm",
        "num_comments": 156,
        "num_crossposts": 0,
        "selftext": "I say it doesn't make that much difference imo anymore.  5 stocks can make a better return then 30 stocks and vise versa.\n\nI think it depends more on the companies you choose and luck, unless you REALLY know what you're doing.\n\nFor example which portfolio below will do better in 5 years?\n\n5 stock:\nMSFT GOOGL NVDA UNH AAPL\n\nOr\n10 stock:\nMSFT GOOGL NVDA UNH AAPL SHW WMT ASML JPM CLF",
        "subreddit": "stocks",
        "title": "30 stocks vs. 20 stocks vs. 10 stocks vs. 5 stocks vs. 4 stocks. Which will make a better return in 10 years?",
        "url": "https://www.reddit.com/r/stocks/comments/p931xm/30_stocks_vs_20_stocks_vs_10_stocks_vs_5_stocks/",
        "created": 1629622785.0
    },
    {
        "author": "fredczar",
        "created_utc": 1628416773,
        "id": "p0bziw",
        "num_comments": 137,
        "num_crossposts": 0,
        "selftext": "Listing out my gripe here. I met a few value investors recently and I can't help but feel that they have this 'high and mighty' or 'know-it-all' aura that I find revolting. I shared with them that I used to be deep in TSLA (I sold them all off at 500% gain), and now in NVDA (got them way before split) and few other growth stocks popular in many of the investing subreddits, and all they did was scoff and then proceed to talk down on my approach. They even tried 'coaching' me on investing, to which I agreed because I believe that there's always knowledge that I can attained, however, it felt like a cell group meeting where they feed each other with confirmation biases.\n\nI personally hold some value stocks myself and I understand the need to look long-term when it comes to investing. But honestly, what's wrong with riding on some growth stocks for short-term gains? I genuinely feel that they are annoyed that basic investors like me are making some decent returns while they are still stuck with their marginal returns due to their stubborn philosophy in investing, and trying to read too deep in annual and financial reports. Where else for me, I get all the info I need from the simple metrics provided by Morningstar, reading financial news and of course awesome subreddit communities like this.\n\nAnyone else have such experience dealing with value investors?\n\nPS. I hate the fact that they always quote Warren Buffett, Peter Lynch and Charlie Munger like as though they are some financial messiah.",
        "subreddit": "stocks",
        "title": "Opinion: Value Investors are cultish and snobbish in general",
        "url": "https://www.reddit.com/r/stocks/comments/p0bziw/opinion_value_investors_are_cultish_and_snobbish/",
        "created": 1628445573.0
    },
    {
        "author": "WackyTrader",
        "created_utc": 1629079751,
        "id": "p56tq1",
        "num_comments": 129,
        "num_crossposts": 0,
        "selftext": "Alright so what I was thinking to do, is to automatically put $1500 into index funds and ETFs, such as VOO, ARKK and QQQ. The other $1500 I was planning to put into individual stocks. I was thinking about NVDA and AMD (due to their intense growth and demand), AAPL (we always need iPhones and they have a cult following, and something simple such as Rogers and Bell (two telecommunication companies based in Canada that run a monopoly). I was thinking of keeping the rest of the money for riskier plays such as options, meme stocks and so on. What do you guys think? Any help, advice and stock picks would be greatly appreciated!",
        "subreddit": "StockMarket",
        "title": "I have $3500 to invest, need guidance and advice...",
        "url": "https://www.reddit.com/r/StockMarket/comments/p56tq1/i_have_3500_to_invest_need_guidance_and_advice/",
        "created": 1629108551.0
    },
    {
        "author": "PositiveKarmaaa",
        "created_utc": 1628688287,
        "id": "p2d08l",
        "num_comments": 124,
        "num_crossposts": 0,
        "selftext": "I’ve been an Intel user since forever. \n\nAfter seeing all the NVDA/AMD news for the past few weeks, I even considered  upgrading my Intel CPU to an AMD CPU. This makes me wonder, what happened to the great Intel?  Are they stoned?\n\n&amp;#x200B;\n\n\\---Promise or Non-sense?--- \n\n&amp;#x200B;\n\n# INTC is beaten badly on the market.\n\nThe most demand for semiconductors is from business instead of gamers/ individuals. Intel has been losing their customers as they lost competition. \n\nOn the other hand, AMD gradually over the quarters, showing innovation with a cutting-edge chip and in other sectors. \n\n&amp;#x200B;\n\n# Buy Intel’s dip instead of AMD or NVDA?\n\nIt’s a big no for me. \n\nDon’t get me wrong, Intel is far from dead or less competitive. Balance sheet is great and the new CEO looks pretty promising. \n\nHowever, the big question - Will INTC go back to their glory days?  \n\nNot gonna happen if they don’t show any innovation. I’m laying my hands off for now.\n\n&amp;#x200B;\n\n# Don’t panic if you have INTC, here’s why.\n\nIf you already got some INTC on your hand, don’t sell just yet. INTC is kind of overlooked due to how great NVDA and AMD did recently. However, if you do hold INTC, best case scenario INTC gets back on their feet and stomps AMD and NVDA. \n\nWorst case? \n\nThey stay like this for a couple more years. Nothing really bad would happen for a company with such cash in hand. If they use the cash the right way, many things could be achieved.  \n\nWhat do you guys think? Do you still have faith in our good ol’ intel ?",
        "subreddit": "StockMarket",
        "title": "Intel(INTC): The once-popular kid who’s left behind now",
        "url": "https://www.reddit.com/r/StockMarket/comments/p2d08l/intelintc_the_oncepopular_kid_whos_left_behind_now/",
        "created": 1628717087.0
    },
    {
        "author": "rotflolmaomgeez",
        "created_utc": 1628031113,
        "id": "oxf19e",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "# TLDR: If you like free money - buy XLNX and wait.\n\nFor context, AMD announced Xilinx acquisition in october last year: [https://www.amd.com/en/press-releases/2020-10-27-amd-to-acquire-xilinx-creating-the-industry-s-high-performance-computing](https://www.amd.com/en/press-releases/2020-10-27-amd-to-acquire-xilinx-creating-the-industry-s-high-performance-computing)\n\nThe acquisition is an all-stock deal, which means for every Xilinx stock you will get exactly 1.7234 of AMD stock after the merger is completed. The merger is planned to be completed by the end of the year, and it has been reiterated during 2 of the previous earning calls.\n\n&amp;#x200B;\n\n# What is there to gain?\n\nAMD stock is trading today at $112. Xilinx today is trading at $146. This means a ratio of 1.30 instead of 1.7234. Buying Xilinx you are buying AMD stocks for $85 after merger happens. This is 30% upside of free monies.\n\n&amp;#x200B;\n\n# What is there to lose?\n\nIf AMD/XILINX deal doesn't go through, XLNX will most likely jump straight back to pre-merger announcement territory, it will probably end up around $110-$115.\n\n&amp;#x200B;\n\n# What could stop the merger from happening?\n\nThere are several regulators that have to approve merger. Most of the important ones already did:\n\n[https://www.reddit.com/r/AMD\\_Stock/comments/n9xnu2/regulatory\\_approval\\_status](https://www.reddit.com/r/AMD_Stock/comments/n9xnu2/regulatory_approval_status)\n\nHowever it hasn't been approved by China yet: [https://www.enterpriseai.news/2021/07/01/with-approvals-in-from-the-ec-and-the-uk-amds-35b-acquisition-of-xilinx-now-up-to-china/](https://www.enterpriseai.news/2021/07/01/with-approvals-in-from-the-ec-and-the-uk-amds-35b-acquisition-of-xilinx-now-up-to-china/)\n\nThe moment China approves the deal, Xilinx stock will jump very close to 1.7234 multiple of AMD (and possibly drag AMD down a bit, however merger approval is *good news* for AMD as well).\n\n&amp;#x200B;\n\n# What are the chances China does not approve of the deal?\n\nOf course it's a gamble with high US-China tensions, but let's take a look at some facts. In 2019 Chinese antitrust committee reviewed 465 deals. It approved all of them (!!).\n\n[https://www.lexology.com/library/detail.aspx?g=1421064d-d8f4-4591-963c-d0d65999ff57](https://www.lexology.com/library/detail.aspx?g=1421064d-d8f4-4591-963c-d0d65999ff57)\n\nIn 2020 they reviewed 458 deals. Out of all of them, they rejected a single one (DouYu merger with Huya, both Chinese companies).\n\n[https://www.gibsondunn.com/antitrust-in-china-2020-year-in-review/](https://www.gibsondunn.com/antitrust-in-china-2020-year-in-review/)\n\nThis means only one rejection out of 923 deals!\n\nNvidia purchased Mellanox in 2020 and it was conditionally approved through China. This is equivalent of AMD/XLNX deal. AMD owns ATI, which was started by Chinese Canadians. Both Xilinx and AMD are US based. They already have heavy business connections with China. I'm not bold enough to estimate the odds, but the facts suggest they're quite high!\n\n&amp;#x200B;\n\n# If this is such a good deal, why is nobody else buying XLNX?\n\nThey were, but had to cover their shorts! The most common way to play XLNX/AMD merger is to go short AMD and long XLNX, and that's what most investors did. However, with recent magnificient AMD run up after Q2 earnings call they were forced to cover their short positions as they became too expensive to hold till the merger. And I have proof that prices were closely correlated until very recently, let's take a look at this XLNX/AMD ratio graph: [https://public.tableau.com/app/profile/upndown/viz/XilinxAMDSharePriceRatio\\_16114624177710/XilinxAMDSharePriceRatio](https://public.tableau.com/app/profile/upndown/viz/XilinxAMDSharePriceRatio_16114624177710/XilinxAMDSharePriceRatio)\n\nUp until very recently the deal was oscilating within 1.5-1.6 area and after recent AMD run up it's been lagging strongly behind. Unless there's some hidden factor major investors know about but not common folks, this is literally the best time in history to buy XLNX to convert into AMD after the merger.\n\n&amp;#x200B;\n\nPositions: XLNX leaps, XLNX stock, AMD stock",
        "subreddit": "wallstreetbets",
        "title": "Way to acquire AMD stocks at 25% discount!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oxf19e/way_to_acquire_amd_stocks_at_25_discount/",
        "created": 1628059913.0
    },
    {
        "author": "LoneTempleGuard",
        "created_utc": 1628604804,
        "id": "p1q05b",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "An emphasis on the overlooked part of the title. I plan on buying her a decent amount of AAPL MSFT and NVDA. I am looking for stocks that will help diversify her portfolio as well as provide big growth in the long term.",
        "subreddit": "stocks",
        "title": "Just created a custodial brokerage account for my newborn daughter. What are some overlooked stocks that could have large gains in 20 years?",
        "url": "https://www.reddit.com/r/stocks/comments/p1q05b/just_created_a_custodial_brokerage_account_for_my/",
        "created": 1628633604.0
    },
    {
        "author": "stereoeraser",
        "created_utc": 1629917185,
        "id": "pbhkwd",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Am I late to the NVDA party? I really like this company.",
        "url": "https://i.redd.it/qqp9pmk3vjj71.jpg",
        "created": 1629945985.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1628188728,
        "id": "oyorqa",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "We all know that AMD is a great company. Its last earning surprise and its great growth guidance led the price to go 30% up. Additional bullish news about MacPro is also boosting this price up with 4x higher volume. \n\nHowever, we all gotta know that we always need to \"sell the news\", and \"sell the greed\" in order to make profits(especially options) because realistically, institutions and big hands have better models, connections, business relationships, and platforms which bring the fastest and newest information to them so they can take their profits out faster than one another. Most stocks are already priced in when its bullish news comes out, and I think AMD would not be an exception.\n\nReasons:\n\n1. The price is already too high, Quarterly RSI:82, 350.55 P/E, (Remember, Nvidia is still strong enough to keep their #1 position for a while).\n2. 76% owned by institutions (most of us can't buy or sell faster than them. Too risky to fight with them. That is why \"sell the news\", and \"sell the greed\" became quotes for retail investors aka ants). \n3. The current market sentiment is not bullish enough. We all know that the whole market went up too much since the COVID due to low interest rate and stimulus checks. Institutions and big hands all perceive that there will be a huge correction before the end of this year, but they can't start a big sell off now because thankfully the Fed and retail investors are helping them to take little more profits before they eventually start selling off. Therefore, I think AMD's current price rise was high enough to be the peak before it drops. \n\n[sourced by \\\\\"forecasts.org\\\\\"](https://preview.redd.it/anekyswaykf71.png?width=1222&amp;format=png&amp;auto=webp&amp;s=6e680a785d30f55216511aeee2fa0a035c548b55)\n\nAs you can see by this forecasts, S&amp;P 500 index keeps decreasing from August 2021 to January 2022, and then bouncing back from February 2022. It is just a forecast, but if the Fed says they will actually start considering about tapering in next year or something, there will be a high chance that the market goes down like this forecast values. \n\n4. AMD needs a healthy correction before it goes up again. Every stock needs a correction in order to prevent its froth. \n\nI hope that Bulls do not hate me by this DD because I love AMD too! \n\nI used to kept my long position until yesterday and sold at $119 and bought some puts with a small amount.\n\nI just want to do both ways to maximize my profits though. Indeed, I am going to buy Calls again later when it dips.\n\nOh btw, I'm the one who wrote Micron DD if anyone saw it lol Let's go Micron too!! It is a solid stock. \n\nThis is not a financial advice, just a DD. Thank you guys :D\n\nBless all you investors aka ants!!!!!!!! Let's do this!!!!!!!",
        "subreddit": "wallstreetbets",
        "title": "AMD PUT DD (Sell the NEWS, Sell the GREED before it TANKSS)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyorqa/amd_put_dd_sell_the_news_sell_the_greed_before_it/",
        "created": 1628217528.0
    },
    {
        "author": "redlux03",
        "created_utc": 1629298020,
        "id": "p6smq1",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/hvi5wy7np4i71.png?width=2000&amp;format=png&amp;auto=webp&amp;s=0fd8e60a479d30fea9b6e63e815b09c72a898471\n\n  As today Nvidia will present their fundamentals for Q2 2021, we expect a significantly grow in earnings, most likely the expectations will be crushed, as AMD did 3 weeks ago.\n\nCorona\\`s main economic impact is the increased need of electronic chips especially high computing power like GPU.\n\nFor those who don\\`t know, there is an absolute chip shortage in the market right now. Auto chips, to new consoles, and any kind of electronics.\n\nNvidia as the current market leader in the area of GPU is expanding in all diffrent kinds of business not only gaming but as artificial intelligence, machine learning, cloud computing, big data and/or the greater use of data through 5G, which is probably leading to exponential growth in those young markets.\n\nNvidia spent 3.92 billion U.S. dollars on research and development in their 2021 fiscal year, an increase from the 2.83 billion U.S. dollars that was spent  on R&amp;D in 2020.  \n\nNvidia is not only a good bet in going short, but will probably going upwards in mid and especially in long term.\n\nLet's GO!!  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀",
        "subreddit": "wallstreetbets",
        "title": "Nvidia earnings today Q2/21!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p6smq1/nvidia_earnings_today_q221/",
        "created": 1629326820.0
    },
    {
        "author": "LegendaryHODLer",
        "created_utc": 1627856532,
        "id": "ow1qpf",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "# Last Week's Review\n\nWe hit some home-runs last week with AMD, CLF, and TLRY. All of which were up over 20% at one point. The other names are not doing too bad either and IMO still “consolidating” with their charts &amp; technicals. Here’s a snapshot of the ticker performance from the last two weeks. In the same time-period SPY has gone up 3%.\n\nhttps://preview.redd.it/b0g8wtx6mte71.png?width=774&amp;format=png&amp;auto=webp&amp;s=28e727f9ead432e46e22074c9489e03a8fbc44f0\n\n&amp;#x200B;\n\nI exited my position on CLF as I felt it was beginning to get into the “red zone” I talk about. The ticker has been on an unbelievable uptrend since the start of the year and the chart is beautiful. However, I highlighted below a short-term risk area after the stock has shot up 30% in 7 days (due to good earnings as well). It’s nearing the top of the trend channel and could potentially see a reversal. Either way, I protected my trade.\n\n&amp;#x200B;\n\nBefore we get into the tickers for this week here's a breakdown of some of my charting rules and terminology.\n\n# Chart Guidelines &amp; Terms\n\nI use the term \"meme stock\" loosely as these aren't necessarily meme companies. I really mean that the ticker has a HIGH PROBABILITY to trend on social media and the stock price could be affected by social sentiment. The watchlist I give is usually comprised of tickers that have taken a breather after getting too hot from a social aspect.\n\n&amp;#x200B;\n\nMoving along, I like to look at my charts from a risk-reward perspective.\n\n\"Red Zones\" are high-risk lotto plays.\n\n\"Orange Zones\" are a bit of a mixed bag between being too hot or early in the trend.\n\n\"Green Zone\" is where I try to buy. These trades are never guaranteed (nothing in life is), but from a risk-to-reward point of view they are in my favor.\n\n&amp;#x200B;\n\nAs always, this is not financial advice or a recommendation to buy or sell a stock. Please do your own research before entering any positions.\n\n&amp;#x200B;\n\n# The Meme List\n\n&amp;#x200B;\n\n**Skillz Inc (SKLZ)**\n\nI categorize this play on the meme stock list because SKLZ has been known to trend on various social media outlets and gain momentum through retail traders. This is a lucrative play and considered a YOLO with earnings coming up on Tuesday after the close. Looking at the chart the stock price is back to 3-month lows and where it was trading last December.\n\nIt’s current valuation at $14 is still pretty rich (5b market cap off 270m in sales), but should the stock continue to drop it might become quite favorable. This ticker traded at $45 back in February and is down 60% since.\n\nThere are many doubters in the viability of this company’s business model, but for a high-risk, high-reward play I like it at this current price. Having said that, ARK ETFs currently hold about 20 million shares of SKLZ.\n\nhttps://preview.redd.it/j7ns8wfcnte71.png?width=2558&amp;format=png&amp;auto=webp&amp;s=98f2044dc2a34e2b8b1df98f8b2a8a22f5a98070\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Peloton (PTON)**\n\nPTON chart looks ready for another break-out to the upside. This could be a potential “fear of lockdown” play and any news of Covid variants will cause this to pop. Glancing at the fundamentals the company has quite a strong balance sheet with very little debt, and strong growth. Most analyst’s concerns on this name are regarding if the growth is actually sustainable for the long-term.\n\nAt $118 per share the stock is nearing the bottom of the channel for it’s most recent trend over the last 3 months.\n\nhttps://preview.redd.it/xlljgnkdnte71.png?width=2558&amp;format=png&amp;auto=webp&amp;s=377b626ef469edf1bef1f1e57f63bb872cb7ad39\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**FuboTV (FUBO)**\n\nLast, but not least on the meme’s list we have FUBO. Remember the meme’s list are tickers that have the potential to gain momentum through retail traders and popularity. This can sometimes be a driving force and the truth is you need to be in on these names BEFORE the hype-train leaves the station.\n\nFUBO had exceptionally strong performance back in December last year when it hit $60 per share. Concerns over the company’s growth and sustainability have knocked the share price down by 60% and currently sits at $26. IMO we could be entering a green zone as the stock has traded sideways for a month now. FUBO reports earnings August 10.\n\nhttps://preview.redd.it/hhhr705ente71.png?width=2554&amp;format=png&amp;auto=webp&amp;s=1a63ee2d3908f955b45ee2ad8afdee4fc882da56\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# The BTFD List\n\n&amp;#x200B;\n\n**Teladoc (TDOC)**\n\nTDOC is one of the leaders in the “tele-health” industry. It gained momentum and popularity throughout lockdowns, but as the world-reopened the stock price has tumbled. In March, Amazon also announced their entry into the tele-health services and investors did not like this increase in competition.\n\nThis is a risky play and is potentially reliant on the lockdown catalyst, but at $148 per share and a 50% haircut from it’s 52-week high, I will be looking to enter this position.\n\nhttps://preview.redd.it/mu0ufnpfnte71.png?width=2556&amp;format=png&amp;auto=webp&amp;s=19e074e533d51665dd9a9273c59bb3dcc5acb142\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**American Airlines (AAL)**\n\nAmerican airlines is a re-opening play. Travel is nearly back to pre-pandemic levels and most “re-opening” stocks are still trading at a discount due to future uncertainties.\n\nThe chart for most airlines will be quite similar to each other, and in my opinion the worst is behind us. I’m looking for short-term upside on this one before the trend breaks down again.\n\nhttps://preview.redd.it/urudccegnte71.png?width=2554&amp;format=png&amp;auto=webp&amp;s=94cac360b0279142c64e47042c42fdd996f85c07\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Micron Technology (MU)**\n\nOut of all the semi-conductor plays it always seems like MU gets no love. AMD and NVDA are performing very strong, but MU seems to be the laggard. MU is trading at a PE of 21 while NVDA and AMD trade at 92 and 37, respectively.\n\nMU just posted very solid earnings and the macro environment should be a strong driver of growth for semi-conductors in general. There has been a chip-shortage for some time now affecting many industries and all this pent up demand will last into 2022.\n\nI thought this stock was going to continue it’s breakout at $95 a share, but it broke down starting in April and may have found a bottom at $77. I like MU here and might enter a position.\n\nhttps://preview.redd.it/oegg5jwgnte71.png?width=2550&amp;format=png&amp;auto=webp&amp;s=eb72bd73ec1eedbeebad5b81c17168db4c370d16\n\n&amp;#x200B;\n\n# Closing Thoughts\n\nThat’s the end for this week. Remember, investing is about PAYtience because it pays to be patient. There are A LOT of uncertainties in this market right now which means it is not the time for crazy YOLOs. We have risks from inflation, covid, rates &amp; QE tapering, re-opening risk (or lack of going back to “normal”).\n\nThe VIX might not be close to the highs, but volatility is STILL HERE. We are seeing 2-5% daily swings in a lot of stocks right now. If anyone remembers before the pandemic you would be lucky to see a 2% move in most names.\n\nHope you all had a great weekend and I’ll be back next week. Just FYI I might start adding a mid-week update some of the weeks to spot existing up-trends, down-trends, or tickers hyped on social media.",
        "subreddit": "options",
        "title": "I scanned over 150 charts this weekend. Here are some good setups I found to BTD (or sell CSPs): SKLZ, PTON, FUBO, TDOC, AAL, MU",
        "url": "https://www.reddit.com/r/options/comments/ow1qpf/i_scanned_over_150_charts_this_weekend_here_are/",
        "created": 1627885332.0
    },
    {
        "author": "henrynyguyen",
        "created_utc": 1628866694,
        "id": "p3mans",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "Hi everyone, I’m a 20 years old college student with a tech heavy portfolio: \n22% GOOG, AAPL, MSFT /\n7% FB /\n7% TGT / \n6% NVDA / \n6% VOOG (I’m thinking about closing this portion because 50% of holdings are the same individuals stocks, but I’m afraid to miss out the rest + less volatile than the individual ones) /\n4% TEAM /\n3% ABBV /\n1% CRWD (I’m looking for 5+ years of holding) \n\nI’m looking to invest more in the fintech/banking industry. However, the bank stocks aren’t looked really good right now. I personally like JPM (had a position and sold at 160) and SQ, but I’m open for more suggestions (and even ETFs)! \n\nThank you and have a nice day!",
        "subreddit": "stocks",
        "title": "Please help me diversify my portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/p3mans/please_help_me_diversify_my_portfolio/",
        "created": 1628895494.0
    },
    {
        "author": "ZiRoRi",
        "created_utc": 1630163440,
        "id": "pdbigj",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "As many of y'all know $AAPL has been trading sideways for a month now, with other major tech stocks like MSFT and NVDA leaving AAPL in the dust. This honestly leads us to wonder when the next ATH will be, when will $AAPL hit 155, 160? $AAPL reached ATH recently near $151\\~ range and seems to be consolidating for now. \n\nWhile looking at open interests on AAPL options today, I noticed a whopping volume of 210k for 9/17 150c volume. Are the hedgies or MM's blasting $AAPL up to new ATH soon?  Yes even though $AAPL's trading average is 70\\~80M shares per day, an influx of 150 ITM calls will create 21M more shares that need to be covered. (Not including the other weeklies 150c's) That's 1/3\\~1/4 of the daily average. I strongly believe that if there is a major push to $150 on $AAPL, $AAPL can finally retest ATH. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[210,7k Open Interest on 150c 9.17](https://preview.redd.it/atwvd21z64k71.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=8c3ec125ef3d36292651803581e9a33e199734fe)\n\n  \n\n\n[9\\/17 Option Chain](https://preview.redd.it/vj52r6i574k71.jpg?width=786&amp;format=pjpg&amp;auto=webp&amp;s=66666769df21085c96176d737c423e9f1a4652a1)\n\n  \n\n\n[9\\/03 Option Chain](https://preview.redd.it/qijslw1874k71.jpg?width=828&amp;format=pjpg&amp;auto=webp&amp;s=bd7ec3c54fcdad7f15f45f54ef271bce013093e1)\n\nThoughts on whether this would be a catalyst to finally pushing $AAPL out of 150\\~ range?",
        "subreddit": "wallstreetbets",
        "title": "$AAPL 210K 9/17 OPEN INTEREST CALL OPTIONS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdbigj/aapl_210k_917_open_interest_call_options/",
        "created": 1630192240.0
    },
    {
        "author": "danf78",
        "created_utc": 1628043754,
        "id": "oxiuqt",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "AMD has had an incredible run these past few days, following their phenomenal earnings. The question is: how much more can it go? Well, I put together some quick numbers and it seems it is still very cheap. I focused on Market Cap / Turnover, which is a ratio that I personally like a lot.\n\n\tNVDA\n\n|Year|Turnover|Growth|\n|:-|:-|:-|\n|2018|11,716||\n|2019|10,918|\\-6.8%|\n|2020|16,675|52.7%|\n|TTM|19,256|15.5%|\n|2018-Today||64.36%|\n|Market Cap|492B||\n|MC / TO|25.6||\n\n\t\n\nAMD\n\n|Year|Turnover|Growth|\n|:-|:-|:-|\n|2018|6,475||\n|2019|6,731|3.9%|\n|2020|9,763|45%|\n|TTM|13,340|36.6|\n|2018-Today||106%|\n|Market Cap|132B||\n|MC / TO|9.9||\n\n&amp;#x200B;\n\nAs you can see above, MC/TO ratio on NVDIA is almost 3x higher than on AMD despite AMD having higher recent growth. It is obvious that this is not the only ratio that matters and other factors come into play when pricing a stock, but AMD is an incredible growth stock and I strongly believe it will keep crushing on Turnover and closing the MC/TO gap to NVDA. Even a small increase from 9.9 to 12 would mean an additional 20% in stock price assuming current Turnover, which will be history very soon given the rapid growth.\n\nFinally, it is important to note that NVDA is up 45% in the past 6 months vs 28% for AMD and this is mostly due to the XLNX acquisition, which brought concerns to investors. Recent numbers from XLNX have given some comfort to the market.\n\nTL/DR: AMD still cheap. I see $150 in the horizon.",
        "subreddit": "wallstreetbets",
        "title": "Why I think AMD still has a lot of room to keep going up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oxiuqt/why_i_think_amd_still_has_a_lot_of_room_to_keep/",
        "created": 1628072554.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1627822959,
        "id": "ovrq37",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\n\tHow did Intel's co-founder predict the semiconductor chip shortage of 2020-21? Intel has been making some big moves these past few months. CEO Patrick Gelsinger is doing everything from building infrastructure and acquiring companies to signing contracts and securing partnerships. Intel is on track to stay ahead of the competition.  \n\n**Moore's Law**\n\nMoore's Law states three things:\n\n* The number of transistors on a microchip doubles every two years\n* Research and development increase the speed and capability of technology\n* The growth of microprocessors is exponential. \n\nWho created Moore's Law? Gordon E. Moore, co-founder of Intel... Learn more about Moore's Law \\[here.\\](https://www.investopedia.com/terms/m/mooreslaw.asp)\n\n**Government Intervention Timeline**\n\n*March 31, 2021* \\[Source\\](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/)\n\n* White House proposes a $50B subsidy plan for research and development to strengthen the U.S supply chain under the CHIPS Act.\n   * The CHIPS Act *(June 11, 2020)* offers a tax income credit for semiconductor equipment and manufacturing.\n\n*April 12, 2021* \\[Source 1\\](https://www.youtube.com/watch?v=sWAa10ljxLA) \\[Source 2\\](\\[Source\\](https://www.ttnews.com/articles/biden-reassures-chip-summit-bipartisan-support-new-funds)\n\n* Biden joins the Virtual CEO Summit on \"Semiconductor Supply Chain Resilience.\"\n* Biden states that this plan is a \"once-in-a-generation investment in America's future.\"\n* CEOs who attended the meeting include General Motors CEO Mary Barra, Ford Motor CEO James D. Farley, and Alphabet and Google CEO Sundar Pichai.\n* Companies invited to join the call were Dell, Intel, Medtronic Plc, Northrop Grumman, HP, Micron Technology Inc., Taiwan Semiconductor Manufacturing Co., AT&amp;T, and Samsung.\n\n*TL;DR-* The semiconductor chip shortage has emphasized securing U.S global chip supply. The White House has laid out a $50B subsidy plan to help boost research and development in the semiconductor industry. The White House met with top CEOs from around the globe who seek a piece of the pie. \n\n**Intel Major News Timeline**\n\n*March 9, 2021* \\[Source\\](https://itpeernetwork.intel.com/ibm-hybrid-cloud/)\n\n* Intel partners with IBM\n\n*March 23, 2021* \\[Source\\](https://www.reuters.com/world/asia-pacific/intel-doubles-down-chip-manufacturing-plans-20-billion-new-arizona-sites-2021-03-23/)\n\n* Intel plans to spend $20B in development in Arizona\n\n*April 12, 2021*\n\n* Intel is in talks with Ford (F) and General Motors (GM) \n\n*May 2, 2021* \\[Source\\]*(*https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Intel plans to spend $3.5B on development in New Mexico\n* Intel plans to spend $10B on development in Israel \n\n*June 22, 2021* \\[Source\\](https://www.reuters.com/technology/sifive-aims-challenge-arm-with-new-tech-pairs-with-intel-effort-2021-06-22/)\n\n* Intel in talks to buy SiFive\n\n*July 15, 2021* \\[Source\\](https://www.wsj.com/articles/intel-is-in-talks-to-buy-globalfoundries-for-about-30-billion-11626387704)\n\n* Intel in talks to buy GlobalFoundries\n\n*July 28, 2021* \\[Source\\]*(*https://finance.yahoo.com/news/intel-ceo-we-have-100-companies-that-want-us-to-make-their-chips-120023723.html)\n\n* Intel secures Qualcomm contract\n* Intel partners with Amazon\n\n**General Motors Contract**\n\n*May 6, 2021* \\[Source\\](https://gmauthority.com/blog/2021/05/general-motors-is-stockpiling-unfinished-vehicles-due-to-microchip-shortage/)\n\n1. General Motors has a stockpile of tens of thousands of unfinished vehicles without semiconductor chips\n2. The unfinished vehicles are stored in Mexico, Texas, Missouri, Indiana, and Illinois\n\n**Ford Contract**\n\n*July 16, 2021* \\[Source\\](https://www.caranddriver.com/news/a37050732/ford-dealerships-chip-supply-shortage/)\n\n1. Ford also has a huge stockpile of unfinished cars that lack semiconductor chips\n2. Ford is running low on storage space\n3. Ford plans to ship unfinished vehicles to Dealerships\n4. Ford will pay for the training and labor costs at dealerships\n\n**Key Financial Metrics (Current)**\n\n* Market Cap (MKT Cap)- 215B\n* EPS (Dilution)- $4.50\n* Return on Equity (ROE)- 23.15\n* Return on Assets (ROA)- 12.30\n* Return on Investment (ROI)- 16.29\n* Dividend Yield- 2.59%\n\n**Financial Statement Highlights (Current)**\n\n* *Total Revenue (TR)-* 77.7B\n* *EBITDA Margin- 32*.06%\n* Gross Margin- 55.6%\n* Price to Earnings Ratio (PE)- 11.93\n* Price to Sales Ratio (PS)- 2.84\n* Price to Book Ratio (PB)- 2.56\n\n**Balance Sheet Highlights (Current)**\n\n* Total Liabilities- 69.39B\n* Long Term Debt (LTD)- 31.71B\n* Debt to Equity Ratio (DE)- 0.37\n\n**Competitors**\n\n* Taiwan Semiconductor Manufacturer (TSM)\n* Samsung\n* Advanced Micro Devices (AMD) Fabless\n* Nvidia (NVDA) Fabless\n\n\\*Fabless means they don't produce their semiconductor chips\n\n**Taiwan Semiconductor Manufacturing (TSM)**\n\n*May 2, 2021* \\[Source\\](https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Taiwan Semiconductor Manufacturing (TSM) plans to spend $100B on-chip research and manufacturing\n* TSM plans to build a new factory in Arizona\n\n*May 31, 2021* \\[Source\\](https://fortune.com/2021/05/31/amd-tesla-contract-chips-infotainment-system-lisa-su/)\n\n* AMD partners with Tesla\n\n**Samsung**\n\nFebruary 10, 2021 \\[Source\\]https://www.anandtech.com/show/16483/samsung-in-the-usa-a-17-billion-usd-fab-by-late-2023)\n\n* Samsung to invest $17B in development in the U.S\n* Potential sites include Texas, Arizona, and New York\n* Samsung has since lost key U.S customers like IBM and Qualcomm to Intel and Nvidia and Tesla to TSM.\n\nMay 13, 2021 \\[Source\\](https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo)\n\n* Samsung to invest $101B in research and development in the semiconductor market\n\n**Bullish Case:**\n\n* Strong demand for semiconductor chips\n* U.S $50B semiconductor industry subsidy plan\n* Intel's Recent acquisitions, partnerships, and contracts\n\n**Bearish Case:**\n\n* Asia is the current \"epicenter\" of global chip production\n* The U.S is playing catch up\n* Competition from TSM and Samsung\n\n**Conclusion**\n\n\t CEO Patrick Gelsinger has been making some big moves these past couple of months. Intel is securing its foothold in the semiconductor industry by building infrastructure, acquiring companies, and signing contracts. \n\n\tIntel wants to increase chip output and drive down its average costs to stay ahead of the competition. Intel is expanding into the automotive, consumer electronics, and foundries industry. Intel faces stiff competition from Taiwan Semiconductor Manufacturing (TSM) and Samsung. All three companies have announced plans to increase research development by 2023-24.\n\n\tMoore's Law is key to understanding how the chip shortage occurred and how to prevent it from happening again. Intel, TSM, and Samsung have all announced multibillion-dollar research and development plans in the U.S. The market for semiconductor chips is increasing exponentially.\n\n\tThe U.S has been falling behind countries like Asia in the global semiconductor market. The U.S aims to secure global chip supply through its U.S $50B subsidy plan. The subsidy plan will boost the research and development of semiconductors in the U.S. Companies like Intel, TSM, and Samsung are now chomping at the bits.\n\n\tThe global market for semiconductors is growing exponentially. The recent semiconductor chip shortage is proof of Moore's law. The U.S plans to expand into the global market through a $50B subsidy plan to attract research development to the U.S. Chips are as essential to our everyday lives as water. You control the chips, you control the future.\n\n*\\*\\*This is not investment advice. I am not an expert. Do your research.\\*\\**",
        "subreddit": "investing",
        "title": "Intel Due Diligence (INTC)",
        "url": "https://www.reddit.com/r/investing/comments/ovrq37/intel_due_diligence_intc/",
        "created": 1627851759.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1629166287,
        "id": "p5ulcu",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "Shares of Chinese electric-vehicle maker NIO were weak Monday after a fatal accident involving a NIO car with self-driving features.\n\nThe fatal crash of a NIO ES8 sport-utility vehicle took place last week in China. The SUV is equipped with several driver assistance functions, including features enabled by Intel (ticker: INTC) division Mobileye, that enable some forms of autonomous driving. NIO’s driver assistance functions are called NIO Pilot and employ cameras as the so-called eyes of the car.\n\nNIO has other autonomous-driving technology, referred to as NAD, such as radar, lidar—a laser-based radar—and camera vision, as well as computing power provided partly by Nvidia (NVDA) to process all the data points coming at the car.\n\nThe NAD features don’t appear to be available on all NIO vehicles, including the ES8. All autonomous driving systems require the driver to pay attention to the road at all times.\n\nNIO responded to a request for comment with a Weibo post in Chinese. The post indicates the company is cooperating with police regarding the investigation.\n\nThe global automotive industry is still wrestling with regulatory and branding issues surrounding autonomous technology. Self-driving features, such as adaptive cruise control and lane-keeping assistance, make driving safer as long as systems are used as intended. But drivers might rely too much on the features when systems are dubbed pilot or autopilot. Government safety regulators, such as the National Highway Traffic Safety Administration, are still drafting plans to prepare for the introduction of more advanced self-driving features.\n\nLink: [https://www.barrons.com/articles/nio-stock-price-self-driving-crash-51629118508](https://www.barrons.com/articles/nio-stock-price-self-driving-crash-51629118508)",
        "subreddit": "wallstreetbets",
        "title": "A driver died in a car crash involving a Nio car activated with driver-assistance feature",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p5ulcu/a_driver_died_in_a_car_crash_involving_a_nio_car/",
        "created": 1629195087.0
    },
    {
        "author": "jaamr15",
        "created_utc": 1629154595,
        "id": "p5r925",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "First, no one cares about earnings miss in this market when it relates to tech stocks. If so, $NVDA, $AMZN, $GOOG and the like would soar to infinity beyond every earnings report but often go down after record breaking earnings. Why? Because of buying the rumor and selling the news and forward projections.\n\nThese companies are established and have to work hard to establish how they are going to continue growing at that pace, but for newer companies earnings miss are not only expected but a shakeout of weak paper hands. Remember $TSLA anyone?\n\nSo let's talk about $RBLX, who just post earnings announcement.\n\nHere is the TLDR;\n\nQ2 was less growth than Q1 compared to last year 🤦- well duh!?!?\n\nLast Q2 was Apr 2020 - June 2020 which encompassed a rapid growth period for Roblox during the lockdowns.\n\nHere's the incredibly bullish thing though - **there was growth** 🚀🚀🚀.  The bears against this suggest that it was just a pandemic play and that it faced strong headwinds because of that. Yet, despite the economy vast re-opening and $DIS exploding it's park attendance with blowout earnings, $RBLX still experienced vast growth YoY in the headwind environment. I think this will only continue to curve upwards as pandemic surge data moves out of focus. For the short-term and my tendies, the earnings call tomorrow will make a big impact whether this will print or not. The Delta variant is growing lockdown concerns again too. Either way, more lockdowns or not, $RBLX is a strong play with lots of insider buying too. There has to be something that Nancy and Cathie know. $85+ let's go 🚀🚀🚀! \n\n&amp;#x200B;\n\nThe details are below for those wanting to see the comparison between Q2 report and Q1 report:\n\n* Revenue **increased** **127%** over Q2 2020 to $454.1 million \\[Compared to last Q1: 147% growth from Q1 YoY\\]\n* Net Loss for Q2 2021 was $140.1 million \\[Compared to last Q1: Net Loss for Q1 2021 was $134.2 million\\]\n* Net cash provided by operating activities **increased** **64%** over Q2 2020 to $191.2 million \\[Compared to last Q1: Nearly 300% YoY\\]\n* **Bookings** **increased 35%** over Q2 2020 to $665.5 million \\[Compared to last Q1: 161% over Q1 2020 to $652.3 million\\]\n* **Free Cash Flow** **increased** **more** **than** **70%** over Q2 2020 to $168.0 million \\[Compared to last Q1: 310%\\]\n* Average Daily Active Users (DAUs) were 43.2 million, an increase of **29% year over year** \\[Compared to last Q1: 79% growth over Q1 2020\\]\n* **42% growth in DAUs outside** of the **US/Canada** compared to Q2 2020 \\[Compared to Q1: YoY 87% growth in DAUs outside of the US/Canada\\]\n* **46% growth in DAUs** **over** **the age of 13** compared to Q2 2020 \\[Compared to Q1: 111% YoY growth in DAUs over the age of 13\\] \n* Hours Engaged were 9.7 billion, an increase of 13% year over year primarily driven by \\[Compared to Q1: Hours Engaged were 9.7 billion, an increase of 98% year over year primarily driven by\\]:\n   * 27% growth in engagement in markets outside of the US/Canada compared to Q2 2020 \\[Q1: 104% YoY growth in engagement in markets outside of the US/Canada\\]\n   * 29% growth from users over the age of 13 compared to Q2 2020 \\[Q1: 128% YoY growth from users over the age of 13\\]\n* Average Bookings per DAU (ABPDAU) was $15.41, a slight increase year over year \\[Average Bookings per DAU (ABPDAU) was $15.48, an increase of 46% year over year\\]",
        "subreddit": "wallstreetbets",
        "title": "Roblox ($RBLX) - Ready for take off",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p5r925/roblox_rblx_ready_for_take_off/",
        "created": 1629183395.0
    },
    {
        "author": "Pyrraxe",
        "created_utc": 1629744182,
        "id": "pa62en",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "NVDA long position. Never selling!",
        "url": "https://i.redd.it/xjaus98ok5j71.jpg",
        "created": 1629772982.0
    },
    {
        "author": "allieguti3rrez",
        "created_utc": 1629599240,
        "id": "p94bz0",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "I’m pretty new to investing, but have a few extra hundred to put in this week. My long-term stocks are pretty set (VTI, GOOGL, AAPL, MSFT, etc). Planning to pick up more NVDA, BLK already. Debating on CARR, ALGN, just wondering if there are any decent ones to consider.",
        "subreddit": "stocks",
        "title": "Suggestions on what fairly low-risk shares to pick up?",
        "url": "https://www.reddit.com/r/stocks/comments/p94bz0/suggestions_on_what_fairly_lowrisk_shares_to_pick/",
        "created": 1629628040.0
    },
    {
        "author": "nairdaswollaf",
        "created_utc": 1629602487,
        "id": "p9542v",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Shoulda bought calls. AMD / NVDA gains.",
        "url": "https://i.redd.it/gvs1kglbvti71.jpg",
        "created": 1629631287.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1630129024,
        "id": "pd43rm",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "Ok.  I've made some good gains over the last 1.6 years I've invested. For me at least.  I think I'm up maybe 50%.  I have no real way of knowing since I'm always adjusting equity/cash allocation depending how nervous I am.\n\nWell I'm a nervous person by nature but now I feel as if we may be in for a 30 to 50% market crash maybe next month so I feel a need to trim again.\n\nI have a lot of long stocks shares in my taxable that I could sell to cash.\n\nIs it stupid thoufh to trim MSFT, AAPL, and GOOGL where most of my money is?\n\nMy riskier one is NVDA.  I'm up 90% and it's 7% of my portfolio! \n\nI believe in all these companies long term but would rather be a little in cash to pick up shares for cheap if we crash next month 50%! Or even if only 20% correction!\n\nSo right now I'm about 12% cash.\n\nI also have FSMEX (medical devices fund) in Roth. I have 10% VTI. I have about 40% portfolio altogether in companies like SHW, HD, UNH, Carr, TMO.\n\nSo should I trim and go to 30% cash and the rest in equity?\n\nLike I said.  I'm about 12% cash right now.  I just feel that if we correct I can get into MSFT GOOGL cheaper.\n\nThanks,\nNervous Nelly.",
        "subreddit": "stocks",
        "title": "Guys (and gals) I'm getting nervous!",
        "url": "https://www.reddit.com/r/stocks/comments/pd43rm/guys_and_gals_im_getting_nervous/",
        "created": 1630157824.0
    },
    {
        "author": "shafdaddy",
        "created_utc": 1628778632,
        "id": "p30zyt",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "Thinking about buying TSM instead of other semi-conductor companies like Nvidia/AMD/Intel. Have some political concerns between Taiwan/China, but I am wondering if now is the right time to buy. \n\nOpen\t115.55\n\n52-wk high\t142.20\n\n52-wk low\t75.98",
        "subreddit": "stocks",
        "title": "TSM? Is now a good entry point to buy?",
        "url": "https://www.reddit.com/r/stocks/comments/p30zyt/tsm_is_now_a_good_entry_point_to_buy/",
        "created": 1628807432.0
    },
    {
        "author": "meowman3000",
        "created_utc": 1629297551,
        "id": "p6sh59",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "I'm wondering if Intel producing its own GPU is a good sign, and will perhaps be able to compete with Nvidia.  They own the fabs, they own much of the enterprise, and they will even begin producing other companies chips in their fabs; which they rapidly under construction, funded by the US government.\n\nIs this a good reason to be bullish for Intel, assuming their new fabs are will be competitive?  Nvidia is now trading 2.5x higher than Intel with 1/3 the revenue.\n\n[https://www.intel.com/content/www/us/en/newsroom/news/introducing-discrete-graphics-brand-intel-arc.html](https://www.intel.com/content/www/us/en/newsroom/news/introducing-discrete-graphics-brand-intel-arc.html)",
        "subreddit": "stocks",
        "title": "Intel Arc GPU's",
        "url": "https://www.reddit.com/r/stocks/comments/p6sh59/intel_arc_gpus/",
        "created": 1629326351.0
    },
    {
        "author": "LividFist2",
        "created_utc": 1628552368,
        "id": "p1ddl3",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "From what I have read, it is generally good to engage in more \"risks\" in the roth as a result of the tax advantages you gain, so I was planning on avoiding etf/funds. (Let me know if that is stupid.) I still want to be semi-conservative so I was thinking of putting 50% of the portfolio into blue chip and then the rest in stocks of companies I've followed for a while, mostly large cap. \n\nI really appreciate critiques / insight. I have a 401k that is very conservative. \n\n 1. 10% MSFT\n\n 2. 10% AAPL\n\n 3. 10% AMZN \n\n 4. 10% GOOG \n\n 5. 10% V \n\n 6. 5% SE\n\n 7. 5% SQ\n\n 8. 5% TTD\n\n 9. 5% SHOP\n\n 10. 5% UPST\n\n 11. 5% PAVM \n\n 12. 5% ROKU\n\n 13. 5% Z\n\n 14. 5% PLTR\n\n 15. 5% NVDA",
        "subreddit": "StockMarket",
        "title": "I'm a 25 year old who is about to open a roth account and was hoping to gain insight with respect to my portfolio plan. I appreciate the input!",
        "url": "https://www.reddit.com/r/StockMarket/comments/p1ddl3/im_a_25_year_old_who_is_about_to_open_a_roth/",
        "created": 1628581168.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1627823623,
        "id": "ovrw2l",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\n\tHow did Intel's co-founder predict the semiconductor chip shortage of 2020-21? Intel has been making some big moves these past few months. CEO Patrick Gelsinger is doing everything from building infrastructure and acquiring companies to signing contracts and securing partnerships. Intel is on track to stay ahead of the competition.  \n\n**Moore's Law**\n\nMoore's Law states three things:\n\n* The number of transistors on a microchip doubles every two years\n* Research and development increase the speed and capability of technology\n* The growth of microprocessors is exponential. \n\nWho created Moore's Law? Gordon E. Moore, co-founder of Intel... Learn more about Moore's Law \\[here.\\](https://www.investopedia.com/terms/m/mooreslaw.asp)\n\n**Government Intervention Timeline**\n\n*March 31, 2021* \\[Source\\](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/)\n\n* White House proposes a $50B subsidy plan for research and development to strengthen the U.S supply chain under the CHIPS Act.\n   * The CHIPS Act *(June 11, 2020)* offers a tax income credit for semiconductor equipment and manufacturing.\n\n*April 12, 2021* \\[Source 1\\](https://www.youtube.com/watch?v=sWAa10ljxLA) \\[Source 2\\](\\[Source\\](https://www.ttnews.com/articles/biden-reassures-chip-summit-bipartisan-support-new-funds)\n\n* Biden joins the Virtual CEO Summit on \"Semiconductor Supply Chain Resilience.\"\n* Biden states that this plan is a \"once-in-a-generation investment in America's future.\"\n* CEOs who attended the meeting include General Motors CEO Mary Barra, Ford Motor CEO James D. Farley, and Alphabet and Google CEO Sundar Pichai.\n* Companies invited to join the call were Dell, Intel, Medtronic Plc, Northrop Grumman, HP, Micron Technology Inc., Taiwan Semiconductor Manufacturing Co., AT&amp;T, and Samsung.\n\n*TL;DR-* The semiconductor chip shortage has emphasized securing U.S global chip supply. The White House has laid out a $50B subsidy plan to help boost research and development in the semiconductor industry. The White House met with top CEOs from around the globe who seek a piece of the pie. \n\n**Intel Major News Timeline**\n\n*March 9, 2021* \\[Source\\](https://itpeernetwork.intel.com/ibm-hybrid-cloud/)\n\n* Intel partners with IBM\n\n*March 23, 2021* \\[Source\\](https://www.reuters.com/world/asia-pacific/intel-doubles-down-chip-manufacturing-plans-20-billion-new-arizona-sites-2021-03-23/)\n\n* Intel plans to spend $20B in development in Arizona\n\n*April 12, 2021*\n\n* Intel is in talks with Ford (F) and General Motors (GM) \n\n*May 2, 2021* \\[Source\\]*(*https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Intel plans to spend $3.5B on development in New Mexico\n* Intel plans to spend $10B on development in Israel \n\n*June 22, 2021* \\[Source\\](https://www.reuters.com/technology/sifive-aims-challenge-arm-with-new-tech-pairs-with-intel-effort-2021-06-22/)\n\n* Intel in talks to buy SiFive\n\n*July 15, 2021* \\[Source\\](https://www.wsj.com/articles/intel-is-in-talks-to-buy-globalfoundries-for-about-30-billion-11626387704)\n\n* Intel in talks to buy GlobalFoundries\n\n*July 28, 2021* \\[Source\\]*(*https://finance.yahoo.com/news/intel-ceo-we-have-100-companies-that-want-us-to-make-their-chips-120023723.html)\n\n* Intel secures Qualcomm contract\n* Intel partners with Amazon\n\n**General Motors Contract**\n\n*May 6, 2021* \\[Source\\](https://gmauthority.com/blog/2021/05/general-motors-is-stockpiling-unfinished-vehicles-due-to-microchip-shortage/)\n\n1. General Motors has a stockpile of tens of thousands of unfinished vehicles without semiconductor chips\n2. The unfinished vehicles are stored in Mexico, Texas, Missouri, Indiana, and Illinois\n\n**Ford Contract**\n\n*July 16, 2021* \\[Source\\](https://www.caranddriver.com/news/a37050732/ford-dealerships-chip-supply-shortage/)\n\n1. Ford also has a huge stockpile of unfinished cars that lack semiconductor chips\n2. Ford is running low on storage space\n3. Ford plans to ship unfinished vehicles to Dealerships\n4. Ford will pay for the training and labor costs at dealerships\n\n**Key Financial Metrics (Current)**\n\n* Market Cap (MKT Cap)- 215B\n* EPS (Dilution)- $4.50\n* Return on Equity (ROE)- 23.15\n* Return on Assets (ROA)- 12.30\n* Return on Investment (ROI)- 16.29\n* Dividend Yield- 2.59%\n\n**Financial Statement Highlights (Current)**\n\n* *Total Revenue (TR)-* 77.7B\n* *EBITDA Margin- 32*.06%\n* Gross Margin- 55.6%\n* Price to Earnings Ratio (PE)- 11.93\n* Price to Sales Ratio (PS)- 2.84\n* Price to Book Ratio (PB)- 2.56\n\n**Balance Sheet Highlights (Current)**\n\n* Total Liabilities- 69.39B\n* Long Term Debt (LTD)- 31.71B\n* Debt to Equity Ratio (DE)- 0.37\n\n**Competitors**\n\n* Taiwan Semiconductor Manufacturer (TSM)\n* Samsung\n* Advanced Micro Devices (AMD) Fabless\n* Nvidia (NVDA) Fabless\n\n\\*Fabless means they don't produce their semiconductor chips\n\n**Taiwan Semiconductor Manufacturing (TSM)**\n\n*May 2, 2021* \\[Source\\](https://venturebeat.com/2021/05/02/intel-will-invest-3-5-billion-in-new-mexico-chip-factory/)\n\n* Taiwan Semiconductor Manufacturing (TSM) plans to spend $100B on-chip research and manufacturing\n* TSM plans to build a new factory in Arizona\n\n*May 31, 2021* \\[Source\\](https://fortune.com/2021/05/31/amd-tesla-contract-chips-infotainment-system-lisa-su/)\n\n* AMD partners with Tesla\n\n**Samsung**\n\nFebruary 10, 2021 \\[Source\\]https://www.anandtech.com/show/16483/samsung-in-the-usa-a-17-billion-usd-fab-by-late-2023)\n\n* Samsung to invest $17B in development in the U.S\n* Potential sites include Texas, Arizona, and New York\n* Samsung has since lost key U.S customers like IBM and Qualcomm to Intel and Nvidia and Tesla to TSM.\n\nMay 13, 2021 \\[Source\\](https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo)\n\n* Samsung to invest $101B in research and development in the semiconductor market\n\n**Bullish Case:**\n\n* Strong demand for semiconductor chips\n* U.S $50B semiconductor industry subsidy plan\n* Intel's Recent acquisitions, partnerships, and contracts\n\n**Bearish Case:**\n\n* Asia is the current \"epicenter\" of global chip production\n* The U.S is playing catch up\n* Competition from TSM and Samsung\n\n**Conclusion**\n\n\t CEO Patrick Gelsinger has been making some big moves these past couple of months. Intel is securing its foothold in the semiconductor industry by building infrastructure, acquiring companies, and signing contracts. \n\n\tIntel wants to increase chip output and drive down its average costs to stay ahead of the competition. Intel is expanding into the automotive, consumer electronics, and foundries industry. Intel faces stiff competition from Taiwan Semiconductor Manufacturing (TSM) and Samsung. All three companies have announced plans to increase research development by 2023-24.\n\n\tMoore's Law is key to understanding how the chip shortage occurred and how to prevent it from happening again. Intel, TSM, and Samsung have all announced multibillion-dollar research and development plans in the U.S. The market for semiconductor chips is increasing exponentially.\n\n\tThe U.S has been falling behind countries like Asia in the global semiconductor market. The U.S aims to secure global chip supply through its U.S $50B subsidy plan. The subsidy plan will boost the research and development of semiconductors in the U.S. Companies like Intel, TSM, and Samsung are now chomping at the bits.\n\n\tThe global market for semiconductors is growing exponentially. The recent semiconductor chip shortage is proof of Moore's law. The U.S plans to expand into the global market through a $50B subsidy plan to attract research development to the U.S. Chips are as essential to our everyday lives as water. You control the chips, you control the future.\n\n*\\*\\*This is not investment advice. I am not an expert. Do your research.\\*\\**",
        "subreddit": "smallstreetbets",
        "title": "Intel Due Diligence (INTC)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ovrw2l/intel_due_diligence_intc/",
        "created": 1627852423.0
    },
    {
        "author": "Spiritual-Prize-4491",
        "created_utc": 1628991422,
        "id": "p4kh0l",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "This is not financial advice.\n\n**TL;DR;**\n\n&amp;#x200B;\n\n1. 10% Profit Margin at any time\n2. COVID fucks shit up, even if you get extra money from it.      Things will likely go back\n3. Growth looks intact, and the optionality is plentiful\n4. The insiders, including Paypal Mafia people, they are      betting big and I think they know things about WISH we don't.\n5. APP Ranking slump seems temporary, and people in the      industry think it is so. It doesn't matter if the money printer is turned      on.\n6. Stock seems cheap enough that crusty value investors      might buy it\n7. BUY THE DIP ?\n\n&amp;#x200B;\n\n# 1. Can $WISH Make Money?\n\nInvesting in growth is all well and good, but can they actually make money? Will the advertising spend forever be higher than the customer value?\n\nHere's the 1Q earnings call link: [https://ir.wish.com/events/event-details/wishs-first-quarter-2021-conference-call](https://ir.wish.com/events/event-details/wishs-first-quarter-2021-conference-call). In it at \\~27:00 the CFO says: \"When we slowed down growth we became extremely profitable\". Waaat? Surely they have been growing all along? On annual data it doesn't look like it.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zq13fp5qdfh71.png?width=624&amp;format=png&amp;auto=webp&amp;s=e7b5f919264746e89a02f9776499f5b140b86a0a\n\nI reckon a lot of market participants see this and conclude WISH is dead. However, if we look at the quarterly data we find a gem.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lv3atb1rdfh71.png?width=624&amp;format=png&amp;auto=webp&amp;s=b3367cd5304631ba0ef2cabf4ac5e94a1fa0f5d4\n\nSo in 1H 2019, when there's no Covid, and they turn the advertising off, they make money. A lot of money. From operations they make $109M, on $870M revenue. At least 10% profit margin overall, and that's in 2019, with no covid. Our revenue is much higher now, and a lot of costs are fixed, and Covid effects will go away eventually.\n\nAnd before you say that Q2 2019 revenue decreased, this quarter is always lower, as the CFO stated in the Q1 2021 earnings call, which brings me on to the next point.\n\nTakeaway: ***10% Profit Margin at any time.***\n\n#  2. Fucking COVID, and Everyone Panicking.\n\nCovid fucked a lot of shit up. Q2 is supposed to bring in less revenue than Q1. When the revenue collapsed to the natural take-up the CEO probably shit himself because he's buried in the monthly numbers. He himself said that in the 3 quarters up to July monthly users are down a large number and he now won't give any guidance.\n\nSee here the revenue for every Q, early years I used (annual rev)/4. Q2 2020 is messed up, it's way too high. Q2 2020 is supposed to be below Q1, instead it's $300M (70%) too high.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/auxqya7sdfh71.png?width=624&amp;format=png&amp;auto=webp&amp;s=b084f7b870598b7646ec766ea28e7e6640a23583\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qf5szltsdfh71.png?width=624&amp;format=png&amp;auto=webp&amp;s=0d3e1712fa84e0b9d2635d048c44c2db8c1a0c7b\n\nThe earnings call was a shitshow of pessimism, they had so much positive to talk about that they didn't elaborate on, and so the optics are really bad, and I think it's mostly because the revenue got a huge artificial boost from Covid, very similar to the \"insert shitcoin\" bubble for NVDA and AMD if you want a case study.\n\nWhen the revenue boost ended, the revenue declined, and everyone panics, twitter is full of retards saying that revenue is decreasing and $WISH is dead. I don't think there's much to panic about: look at the revenue graph, look at the covid graph. Why panic?\n\nTakeaway: ***Covid fucks shit up, even if you get extra money from it. Things will likely go back.***\n\n \n\n# 3. Does $WISH Still Grow?\n\nIn this market everyone wants growth. After they see consistent growth they then say things along the lines of \"What's the TAM?\" or \"TAM Big\" or \"TAM HUGE\" or \"I Love TAM\". TAM Being total addressable market.\n\nThe app, in its current shitty state, was able to grow revenues for half a decade at least (it's longer, but S-1 only goes so far back). There's also no way they have completely captured all their potential TAM yet. The revenues aren't entirely the app revenue, but even so, bearing in mind the pandemic of doom, I think the revenue from the core marketplace is respectable and doesn't show signs of a true fuckup like the earnings call sounded like. The revenue is almost as high as Covid-everyone-at-home-time 1H 2020.\n\n \n\nhttps://preview.redd.it/wbkxequtdfh71.png?width=624&amp;format=png&amp;auto=webp&amp;s=342ef998ed921fc7425b975af36423febd9d88a4\n\nNot to mention the optionality that is possible with this company. They built a whole logistics business from scratch, and that revenue just exploded, and now the number one complaint isn't shipping times any more. That is quite a drastic and striking way to solve a problem, yet these guys just went and solved it. I never heard of Wish till a year ago, I live in the middle of nowhere, I look for WISH pickup locations and WTF, there's 6 within a few miles of me. I order something, and the lady at the pickup shop says first thing: \"is it a WISH parcel? or...\".\n\nTheres also 1Sansome, built from zero, and is growing just fine. What happens when 1Sansome uses the WISH logistics network and always arrives sooner than Shein? Or where you can pick up the clothes from a WISH store?\n\nThen there's finance stuff. Jackie Reses is a business rock star, and she's on the $WISH team. What's this payment services license in the EU? What are they doing with that? What sort of product/service could they offer with this to buyers or sellers? IDK what they are cooking up, but the potential is there, and just the exact perfect person so happens to be there to execute it.\n\nTakeaway: ***Growth looks intact, and the optionality is plentiful.***\n\n \n\n# 4. But the Insiders are Selling! It's a Sinking Ship!\n\nIf anyone tells you this you should congratulate yourself, because you have 100% identified a true specimen of sheeple. It could be family, friends, relatives, I'm very sorry for your loss if it is a loved one, but if they say the insider selling is an issue, there is nothing that can be done, they are sheeple and probably can't think for themselves.\n\n\"Insider selling\" was selling stock for tax reasons. On some data feeds it looks like insider selling because the CFO fucked up the paperwork. The CFO probably got kicked out for this reason.\n\nI don't know for sure and I don't care about this, because the insiders are so heavily invested in this company it's basically a part of them. If you invest in $WISH you are investing alongside Peter Thiel, Joe Lonsdale, Peter Szulczewski, the Galileo fund guy, Danny(one of the founders), etc. \n\nThe insider investors are not sitting still either, they are deeply involved. How did Jackie Reses get there, for example.\n\nAnother thing about these insiders, you're dealing with the Paypal Mafia here, I think they know what they are doing. Go and read the Mafia Bosses book, you'll find that this guy doesn't diversify at all, he bets big when he thinks he'll win. Even better, lets look at what public stuff his fund is invested in: \n\n  \n   \n \n\nhttps://preview.redd.it/fr818pqudfh71.png?width=624&amp;format=png&amp;auto=webp&amp;s=c3a82c236a227ab7c077d9d53c74b004c3ef873e\n\nTakeaway: ***The insiders, including Paypal Mafia people, they are betting big and I think they know things about WISH we don't.***\n\n  \n\n# 5. But the App Ranking? \n\nI can't think of any other reason other than the android advertising space got competitive. Advertising spend on Android went up a lot from the IOS privacy update. Though if I take a quote from this article: [https://www.forbes.com/sites/johnkoetsier/2021/05/19/ios-145-causes-massive-shift-in-ad-spend-to-android/](https://www.forbes.com/sites/johnkoetsier/2021/05/19/ios-145-causes-massive-shift-in-ad-spend-to-android/)\n\n“It's early days,” he added. “As more users adopt 14.5 and marketers get comfortable with the new normal on iOS, most of us expect ad spend on iOS to fully recover.”\n\nThis being a quote from a senior guy in that business. The viewership on IOS is really huge, it doesn't seem likely that advertising money permanently moves to android.\n\nAlso if you turn off the advertising, WISH already has a clientele, you don't need big advertising budget for that.\n\nTakeaway: ***This seems temporary, and people in the industry think it is so. It doesn't matter if the money printer is turned on.***\n\n&amp;#x200B;\n\n# 6. Crusty Old Value Investing Thinking\n\nI want to calculate a very rough price I think this business is worth. Then I buy below this, something about intelligent investor, margin of safety, uncle Buffett, MicHaEl burrry, Charlie \"I Love Costco\" Munger, etc. I want the calculation as simple as possible so that I don't have to think about this. I want a valuation that is roughly what we can reasonably assume, I'm not looking for the worst or best case scenario, because I don't want to think too much about this.\n\nI know they can get 10%+ margin at any time because it's been done, they spend a whole 6 month period with the advertising turned off and it made 10%. In the Avory&amp;Co research ([https://docsend.com/view/r35zrpbdzftxbeb2](https://docsend.com/view/r35zrpbdzftxbeb2)) they think they can get 15-20% margin. WISH thinks it can get 20%+ margin eventually, which I think makes sense as Ebay has a similar profit margin.\n\nOK so how about the revenue? We can safely assume it'll make $3Bn soon. How big can it get? IDK, let's assume there's no financial crash and it gets to $5Bn at some point. Remember they grew at 20%+ a year for a decade already. At a 10% margin that's $500M per year.\n\nOK so what multiple? 20 seems fine. Remember the business can grow. Over the last 10 years the P/E distribution appears like below.\n\n   \n \n\nhttps://preview.redd.it/bnf9o12wdfh71.png?width=624&amp;format=png&amp;auto=webp&amp;s=5a45da67844444f34e07fbecb35b7a6017384e60\n\n[Code from here](https://github.com/Damonlee92/Build_Your_Own_AI_Investor_2021/tree/main/Chapter_4_to_6_AI_and_Backtesting)\n\n**Quick and dirty rough future value: $5Bn \\* 0.1 \\* 20 = $10Bn.**\n\n**Current Market Cap = $4.7Bn.**\n\nBefore the value investors come out of the woodwork and complain, yes I know it may very well not grow, in which case use a revenue of $3Bn and you still get to a value of $6Bn, in which case there's upside from here.\n\nAlso they have no debt, they can take a loan any time for $300M. Even if there is a financial crisis, they can sit and do nothing for 2 years, and in all that time the optionality of the stuff all these very capable people is given no value, which is retarded. We're talking about Reses and Paypal mafia here, in a service that no one else has, that Amazon wanted to pay $10Bn for some years ago and the CEO walked away from.\n\nIf a financial crisis hits the multiple is going to decrease, but the company itself will likely do just fine, and grow afterwards, since the formula already works. When good times come back what multiple do you think the market will give this company?\n\nTakeaway: ***This seems cheap enough that crusty value investors might buy it***\n\n&amp;#x200B;\n\n#  7. Relative To The Rest Of The Stock Market\n\nNKLA is an actual fraud, has less cash, no revenue, and a gravity powered truck. It's market cap? $3.8Bn\n\nLuckin Coffee Inc. is an actual fraud, might get fucking delisted from the stock exchange. It has negative Gross margins. It has $500M revenue. It's market cap? $3.75Bn\n\nLet's take a look at some Price/Sales ratios, This table isn't totally correct because I was taking the peak P/S ratios (to study the price run-ups), I can't be arsed to get the current numbers, do it yourself. Even if you half all of the other P/S numbers, the P/S for WISH is retarded.\n\n \n\nhttps://preview.redd.it/c6s964xwdfh71.png?width=313&amp;format=png&amp;auto=webp&amp;s=50e9953187d0e0bbe963c52f6d68a7a53a981a43\n\n \n\nhttps://preview.redd.it/1ni00zjxdfh71.png?width=596&amp;format=png&amp;auto=webp&amp;s=6d24d9fd59ee97b92409f051acf3183f74855612\n\n&gt;I approve this message.  \n&gt;  \n&gt;Helping to spread the good word. Taken from a [wish subreddit](https://www.reddit.com/r/Wishstock/comments/p45p1k/wish_dd/) written by [u/still\\_ninja5708](https://www.reddit.com/user/still_ninja5708)",
        "subreddit": "wallstreetbets",
        "title": "$WISH - you don't need to understand or like the business for it to succeed",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4kh0l/wish_you_dont_need_to_understand_or_like_the/",
        "created": 1629020222.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1630093615,
        "id": "pculwn",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "I have had a 90% return in NVDA in my taxable in about 1 year.\n\nI had a some cash ing Roth and although I already have 6.7% of portfolio in NVDA I said \" what the heck I'll up it to about 9%!\".\n\nMy ROTH position I'm sort of viewing as a short term position to generate some more cash. So I don't know how long I'll hold it.\n\nI got in in Roth position at $218 and now we're at $224 I think.\n\nSo my question is.  If we correct or the market crashes, is there a good chance Nvidia makes it back to $218 at very least?  Even if months away some time?\n\nIf stocks make it to a certain share price are the odds that even with a correction they'll get to that price SOME DAY in the future? Even if a few years away?",
        "subreddit": "stocks",
        "title": "If a stock gets to a certain share price and then we correct, is there a good chance it'll get back to that price some day?",
        "url": "https://www.reddit.com/r/stocks/comments/pculwn/if_a_stock_gets_to_a_certain_share_price_and_then/",
        "created": 1630122415.0
    },
    {
        "author": "MonoDun",
        "created_utc": 1630274728,
        "id": "pe4uov",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Tesla's Musk signals concerns over Nvidia deal for UK chip maker",
        "url": "https://www.reuters.com/technology/teslas-musk-signals-concerns-over-nvidia-deal-uk-chip-maker-the-telegraph-2021-08-29/",
        "created": 1630303528.0
    },
    {
        "author": "smellyfussy_parts",
        "created_utc": 1629900701,
        "id": "pbc105",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "NVDA YOLO. The post earnings re-up. My favorite stock baby!",
        "url": "https://i.redd.it/8qypgux2iij71.jpg",
        "created": 1629929501.0
    },
    {
        "author": "Pharmer314",
        "created_utc": 1629770913,
        "id": "pae3qe",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "14.5K on NVDA calls. Sold at 14.5K!",
        "url": "https://i.redd.it/jgzv7wo5s7j71.jpg",
        "created": 1629799713.0
    },
    {
        "author": "TigerBlood1910",
        "created_utc": 1629752181,
        "id": "pa8ntn",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Updated NVDA post. From 400 - 10K (At a total 14K, but I pulled 4K out). Will be going on vacation from the Wendy’s dumpster.",
        "url": "https://www.reddit.com/gallery/pa8ntn",
        "created": 1629780981.0
    },
    {
        "author": "Nice_Theta",
        "created_utc": 1630182524,
        "id": "pdhaa3",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I posted [my July earnings trading report](https://www.reddit.com/r/thetagang/comments/ov71vv/my_july_earnings_report/) last month, and many of you were kind enough to share your thoughts with me.\n\nTLDR: My July results were almost a scratch, $93 into a positive column, and I was undecided if trading earnings is a worthwhile thing.\n\nFast forward to the end of August… I couldn’t keep away from earnings, just love trading them.\n\nHere are my August stats:\n\n* 21 earnings trades (short condors and strangles, all small positions, average BPu $532.85 per position)\n* 19 wins and 2 losses. A win rate - 90%. Better than July’s 77%. A little experience helps!\n* My wins brought in $567.68\n* Losses took away $104.00\n* Net profit $463.68.\n\nWins: ABNB, BBY, CRM, CSCO, DASH, GPS, HPQ, INTU, M, MRVL, NVDA, PTON, SNOW, SPLK, TGT, TJX, ULTA, URBN, WDC\n\nLosses: LOW, JWN\n\nThe wins are great - no doubt. But it is the losses that are really interesting and have a high learning value. My losses show my indecision between two lines of thought: to defend a losing trade or to exit ASAP to minimize the loss. I have seen convincing arguments for both approaches, and am not yet sure where I stand on this.\n\nI managed my losing LOW trade fairly well in the beginning, brought it from several hundred down to around $30 loss. I could have brought it to a win, but I made a mistake - misread where I was standing and exited for a small loss. I learned how to read the position correctly and did another losing trade right - turned it into a win.\n\nI decided to take a loss on JWN because my overall win rate for August was around 93% and I thought I could afford a small loss. But now I think it could’ve been managed and perhaps turned. But we’ll never know if it could and if I had the skill to do it.\n\nWhere do you stand on this question? Do you defend? Or take a loss and move on to the next trade?",
        "subreddit": "options",
        "title": "My August earnings report",
        "url": "https://www.reddit.com/r/options/comments/pdhaa3/my_august_earnings_report/",
        "created": 1630211324.0
    },
    {
        "author": "sharco",
        "created_utc": 1629919728,
        "id": "pbigd4",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "NVDA, First 10 Bagger. Opened last week, and closed some of the contracts",
        "url": "https://i.redd.it/6miewlll2kj71.jpg",
        "created": 1629948528.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1628886734,
        "id": "p3tifa",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I only really know about pe, which I've noticed is different in different sectors.\n\nFor someone who doesn't want to spend a lot of time analyzing a company, what are some quick things to look at besides PE?\n\nMost of the companies I've invested in are the big names like MSFT GOOGL PYPL NVDA UNH HD etc, so I really just more or less trust that these companies will continue to do well, at least for another 5 years or so.\n\nSo what are some basics to get to know to slowly learn about analysing a company.\n\nI'd rather not get into reading all the 10k papers, conference calls, free cash flow, etc right now.  I just want to start out slow.\n\nThanks.",
        "subreddit": "ValueInvesting",
        "title": "First thing(s) to look at when evaluating a company?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/p3tifa/first_things_to_look_at_when_evaluating_a_company/",
        "created": 1628915534.0
    },
    {
        "author": "MikeyBugs",
        "created_utc": 1630000338,
        "id": "pc4qbo",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I know what they say about advice here - that it's all opinions and they all be taken with many grains of salt - but I'm at a loss (no pun intended) here. \n\n\nI have 2 Microsoft options, Sept 24 $330 Call and Oct 11 $335 Call and a Nvidia option Oct 1 $265 Call. All were purchased on Monday. At first, Nvidia was rocketing up and had made a gain of about $50. Microsoft lagged and started dipping down. Now Nvidia is down into the red and both Microsoft options have lost about $45 each. \n\nI've been saying I want to hold the options so I could sell them just before the expirations but I'm worried that I might end up losing $200 or more. I could simply let them expire but then I get nothing out of it. Or I could sell them now and cut my loses but then I might miss a rise. I'm wondering what other people here think. I'm kind of leaning towards holding but, again, I'm worried that they'll simply keep dropping until expiration. \n\nLink is to a screenshot of the three options, 2 stocks. \n\n[Options](https://i.imgur.com/F2hSXlL.png)",
        "subreddit": "stocks",
        "title": "Microsoft and Nvidia Options. Losing and looking for advice",
        "url": "https://www.reddit.com/r/stocks/comments/pc4qbo/microsoft_and_nvidia_options_losing_and_looking/",
        "created": 1630029138.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628111182,
        "id": "oy2d8t",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, August 4, 2021**\n\nToday was another choppy day, with stocks ending the day mixed, with the Nasdaq (QQQ) climbing 0.14% while the S&amp;P 500 (SPY) and Dow Jones (DIA) fell 0.48% and 0.89% respectively. The Russell 2000 (IWM), which tracks the performance of small-cap stocks, fell 1.25%. It seems market participants were disappointed by a report from ADP, a leading employment services company, which estimated that private employers added half the expected amount of jobs in July. This sets a negative backdrop for the official July Jobs Report, set to be released this Friday. \n\nADP, a leading payroll and human services software company, released its July 2021 Employment Report, which estimated that private employers added only 330,000 jobs in July, less than half the 690,000 gain expected by economists. While ADP’s report isn’t 100% accurate, it’s usually fairly close and sets a negative backdrop for the official July Job Report on Friday. ADP’s report shows that the labor market imbalances stemming from the coronavirus pandemic remain. Moreover, with concerns surrounding the Delta variant increasing, that could be a relatively new factor adding more pressure. Here is the entire report: [https://adpemploymentreport.com/](https://adpemploymentreport.com/)\n\nConcerns surrounding the highly contagious coronavirus Delta variant continue to rise, with Florida emerging as the US’ new epicenter for the disease. Cases in Florida have jumped dramatically, going from 2432 on July 1 to 38,776 on July 30 and have so far had three consecutive days of record infections. Thankfully, however, despite the surge in cases, the death rate has so far remained stable and relatively low, a sign that the vaccines are very effective at preventing hospitalizations and serious death. \n\nSo far, 59% of the companies in the S&amp;P 500 (SPY) have reported Q2 earnings, with 88% of these beating analyst expectations, according to FactSet. This quarter is shaping up to be another record-breaking one, with corporate earnings growth rate expected to accelerate 85%, which would be the biggest jump since the Q4 2009. \n\nHowever, it is important to note that, despite beating earnings expectations, a number of these companies have pulled back, with tepid outlooks moving forward overshadowing strong results. Moving forward, given that most companies have so far exceeded pre-pandemic levels and the current quarter has an easy comparison to last year, expectations for growth are inevitably going to moderate. This said, I think the pullback in some stocks following earnings is an overreaction. \n\n**Highlights**\n\n* Shares of Lyft (LYFT) fell roughly 10% despite posting its first profitable quarter. Earnings are very weird.\n* Shares of GM slipped 8% after posting earnings.\n* Shares of NovaVax (NVAX) gapped up roughly 20$ after the company announced an agreement with the EU to sell up to 200 million COVID vaccines. \n* Shares of some Chinese companies somewhat after pulling back yesterday following signaling that the CCP may be targeting video game companies next as the regulatory crackdown on tech stocks continues. Yesterday, shares of Tencent (TCEHY) and other tech stocks fell after a state-media called video games \"spiritual opium\". This prompted Tencent to say it will limit gaming time for minors and may even ban those under 12 from its platform. \n* Shares of Robinhood (HOOD) gapped up again today, rising roughly 50% today.\n* Federal Reserve Vice Chair Richard Clarida said Wednesday the central bank is still on track to begin raising rates off their current near-zero levels in 2023, as long as the economic recovery remains on its current trajectory. He said “While, as Chair Powell indicated last week, we are clearly a ways away from considering raising interest rates and this is certainly not something on the radar screen right now, if the outlook for inflation and outlook for unemployment I summarized earlier turn out to be the actual outcomes for inflation and unemployment realized over the forecast horizon, then I believe that these three necessary conditions for raising the target range for the federal funds rate will have been met by year-end 2022.”\n* \\*\\***Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Akami Technologies (AKAM) with two target raises. Stock currently around $112\n   * Piper Sandler from $130 to $132 at Overweight\n   * Truist Securities from $130 to $140 at Buy\n* Alnylam Pharma (ALNY) with two target raises. Stock currently around $184\n   * Barclays from $196 to $216 at Overweight\n   * Morgan Stanley from $224 to $234\n* Arista Networks (ANET) target raised by Argus from $360 to $440 at Buy. Stock currently around $382\n* AstraZeneca (AZN) target raised by SVB Leerink from $63 to $69 at Outperform. Stock currently around $57\n* Caesars Entertainment (CZR) with two target raises. Stock currently around $85\n   * Morgan Stanley from $124 to $127 at Overweight\n   * Stifel Nicolaus from $125 to $130 at Outperform\n* DuPont (DD) target raised by Citigroup from $96 to $102 at Buy. Stock currently around $74\n* MicroChip Technology (MCHP) with a host of target raises. Consensus price target $190 at Buy. Stock currently around $148\n* Nvidia (NVDA) target raised by Rosenblatt Securities from $200 to $250 at Buy. Stock currently around $202\n* NXP Semiconductors (NXPI) with a host of target raises. Consensus price target $240 at Outperform. Stock currently around $212\n* SolarEdge Technologies (SEDG) target raised by Susquehanna from $325 to $350 at Outperform. Stock currently around $292\n* Square (SQ) target raised by Barclays from $340 to $345 at Overweight. Stock currently around $266\n\n“The way to get started is to quit talking and start working.” - Walt Disney",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, August 4, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/oy2d8t/here_is_a_market_recap_for_today_wednesday_august/",
        "created": 1628139982.0
    },
    {
        "author": "gorays21",
        "created_utc": 1629046046,
        "id": "p4x07i",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "This week will be somewhat interesting(although not as crazy as last few weeks) because this week earnings include 2 of the most mentioned companies on reddit:\n\n&amp;#x200B;\n\n* Nvidia\n* Roblox\n* Walmart\n* Macy's\n* Target\n* Cisco\n* Foot locker\n\nHere is the full list:\n\n [pjyvtisbz8h71.png (950×515) (redd.it)](https://i.redd.it/pjyvtisbz8h71.png)",
        "subreddit": "stocks",
        "title": "This weeks earnings!",
        "url": "https://www.reddit.com/r/stocks/comments/p4x07i/this_weeks_earnings/",
        "created": 1629074846.0
    },
    {
        "author": "donkstonksinc",
        "created_utc": 1629744479,
        "id": "pa65x1",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Been option trading for about a year now... new to posting. Been burned a few times getting greedy holding my ITM calls for too long. What are your thoughts on holding these guys?  \n\n\nI think there will potentially be a dip tomorrow or Wednesday but I think both of these strikes should still be ITM regardless but maybe less profit? Trying to figure out if I just need to take the money and run before I lose all my unrealized gains per usual.",
        "subreddit": "options",
        "title": "Have NVDA $207c options and AMD $108c options expiring this week. Hold or take gains?",
        "url": "https://www.reddit.com/r/options/comments/pa65x1/have_nvda_207c_options_and_amd_108c_options/",
        "created": 1629773279.0
    },
    {
        "author": "Test-Ing2K",
        "created_utc": 1629896057,
        "id": "pbamc0",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Coffee can Investing is a popular book by the Indian author Saurabh Mukherjea.having analyzed Indian stocks, he found that companies that met these criteria over a 5 year period were likely to beat the stock market by 15-20%. \n\nMany of the companies who met this criteria were also in boring industries: undergarments,steel pipes, paints.\n\nI'm looking for US stocks that meet these criteria. Some that I've found (barring FAANG - Nvidia not Netflix) are JYNT, HDB, XPEL, Inmode and Progyny.\n\nAny others you can find?",
        "subreddit": "stocks",
        "title": "'Coffee Can Investing' : Companies with 10% rev growth + 15% ROCE over 5 yrs + strong moat",
        "url": "https://www.reddit.com/r/stocks/comments/pbamc0/coffee_can_investing_companies_with_10_rev_growth/",
        "created": 1629924857.0
    },
    {
        "author": "Louisthehippo",
        "created_utc": 1629749502,
        "id": "pa7svm",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I’ve recently come to the conclusion that my Depot is invested  too high in tech.\n\nI’ve got a All World ETF plus several single positions in tech company’s like Apple,MSFT, Nvda, TSM and PLTR + a few other. Overall I would say my stock portfolio is 70% in tech.\n\n\nIf you look up in the world etf also the 10 biggest positions are mainly tech.\n\nSo I want to mix things up a little bit and bring in some other blue chip or solid stocks NOT from tech sector.\n\nSince everything nowadays IS tech and also performance on the stock market / news are mainly about the big tech company’s it’s very hard to do research or find a solid company with solid earning outside of Tech.\n\nWhat are some options / stocks I could consider in other areas?",
        "subreddit": "stocks",
        "title": "What are some Blue Chip company’s other then Tech ?",
        "url": "https://www.reddit.com/r/stocks/comments/pa7svm/what_are_some_blue_chip_companys_other_then_tech/",
        "created": 1629778302.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629838242,
        "id": "paw0k9",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, August 24, 2021**\n\nStocks continued their strong performance, recovering from jitteriness last week to reach new intraday record highs in the S&amp;P 500 (SPY) and Nasdaq (QQQ). The Dow Jones (DIA) traded modestly even and remains roughly $2 from its record high. The Russell 2000 (IWM) which tracks the performance of small-caps, continued rallying after steeply underperforming last week, climbing roughly 3% in the last two days. After an initial shock following the release of the Federal Reserve’s July meeting minutes, it seems fears over the taper timeline have receded for the moment. As I have been saying, I remain unfazed by any talk about a potential taper timeline. On a personal note, I remain bullish until discussion about an interest rate hike begins, and will reconsider my position then. Looking ahead, Fed Chair Jerome Powell is scheduled to give his annual Jackson Hole speech on Thursday.\n\nThis earnings season has been a smashing, record-breaking success. 91% of companies in the SPY have reported, with 87% of those outperforming estimates in revenue. The blended, year-over-year earnings growth rate is an eye-popping 85.1%, absolutely smashing original estimates of 66.5%. What is most remarkable is this comes among a resurgence of coronavirus cases due to the delta variant, supply-side disruptions, and labor market imbalances in the US. \n\nKeith Lerner, Chief Market Strategist at Truist Financial, gave this take about earnings, “We think the primary trend is higher. We’re only about one year into this economic expansion. Expansions typically last about five years, And the earnings season which we just got out of was phenomenal. Even if it’s peak growth, we still think it’s going to be strong growth. You have earnings moving forward and then you look at the relative comparison of stocks relative to bonds and they’re still attractive. Overall, we think the right position is to be overweight stocks.”\n\nUS Crude oil prices gained for a second straight session, building on advances after recently hitting a seven-day consecutive losing streak. West Texas intermediate crude oil rose by nearly 3% on Tuesday to settle at $67.54 a barrel. Brent crude, the international standard, also gained to top $71 per barrel.\n\nEnergy prices gained as optimism mounted over a pick-up in consumer mobility following the full FDA approval of Pfizer's coronavirus vaccine. U.S. crude oil prices have so far risen 39% for the year-to-date.\n\n**Highlights**\n\n* Shares of “meme stocks” like AMC and Gamestop (GME) and others had a great day today, building on advances in recent sessions. \n* Shares of travel and leisure companies are rebounding following the FDA’s full approval of their coronavirus vaccine, which hopefully encourages more vaccinations and allows the country to reopen faster\n* Shares of Airbnb (ABNB) gapped up more than 8% amid this broader rebound by travel and leisure stocks\n* According to the Department of Commerce, sales of new homes unexpectedly rose in July, suggesting some firming up in housing market activity amid high prices and low inventory. New home sales increased 1.0% in July compared to June, bringing sales to a seasonally adjusted annual rate of 708,000. Consensus economists were looking for a rate of 697,000 homes. Sales in June were also upwardly revised to a seasonally adjusted annualized rate of 701,000, from the 676,000 previously reported. \n* Shares of Chinese companies rebounded somewhat following an intense sell-off amid regulatory pressure from the government. \n* Shares of Peloton (PTON) rose after the company announced it was restarting sales of its treadmill following a recall earlier in the year \n* Alphabet’s (GOOG, GOOGL) self-driving spin-off Waymo is starting testing in San Francisco with the aim to start a robotaxi service within the next 3 years.\n* The U.S. Department of Energy is nearing a deal to purchase a supercomputer made with chips from Nvidia Corp and Advanced Micro Devices Inc as a key lab waits for a larger supercomputer from Intel Corp that has been delayed for months\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices.\\*\\***\n* AutoDesk (ADSK) target raised by Barclays from $340 to $370 at Overweight. Stock currently around $340\n* Charter Communications (CHTR) target raised by Pivotal Research from $820 to $1000 at Buy. Stock currently around $793\n* Dollar General (DG) target raised by Telsey Advisory Group from $235 to 260 at Outperform. Stock currently around $232\n* MongoDB (MDB) target raised by Morgan Stanley from $377 to $410 at Overweight. Stock currently around $384\n* Reaty Income (O) target raised by Mizuho from $77 to $81 at Buy. Stock currently around $70\n* Palo Alto Networks (PANW) with a host of target raises after demolishing earnings. Average price target $480 at Outperform. Stock currently around $441 after jumping up 18%\n* Ulta Beauty (ULTA) target raised by Deutsche Bank from $410 to $417 at Buy. Stock currently around $374\n\n“In the middle of difficulty lies opportunity.” - Albert Einstein",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, August 24, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/paw0k9/here_is_a_market_recap_for_today_tuesday_august/",
        "created": 1629867042.0
    },
    {
        "author": "thereisnospooongeek",
        "created_utc": 1628386629,
        "id": "p05q7h",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " I have been investing for the past couple of years and started with a diverse portfolio to reduce the risk factors.\n\nOver the course of years, I have done a detailed analysis of 7 companies that I believe have tremendous space to grow. I'm aware that I will be increasing the risk of my portfolio by changing from a diversified to a concentrated portfolio but I'm taking this calculated risk after spending ample time to study the same.\n\nI work in the cloud and IoT space and I understand the business quite well. It is also easier to track and I will be able to attend all the investor calls and track them very closely. The below snapshot is my current portfolio and I'm planning to do the allocation as mentioned below.\n\n1. Cloud: $NET -20%\n2. Finance $SQ - 15%\n3. Clean Energy $ENPH -15%\n4. eCommerce $SE- 15%\n5. Cloud $DDOG - 15%\n6. Semiconductor $NVDA - 10%\n7. EV $TSLA - 10%\n\nI could be biased since I have picked these stocks after a detailed analysis. I would like to understand more and get some feedback about this rebalancing strategy. I have been holding all of the above stocks for more than 1 year and it's been working great for me.\n\nPlease share your thoughts.\n\nCurrent Portfolio looks like this:[https://imgur.com/a/yK8aQhY](https://imgur.com/a/yK8aQhY)",
        "subreddit": "StockMarket",
        "title": "Seven Horses: Diverse portfolio to concentrated high conviction portfolio. Your thoughts?",
        "url": "https://www.reddit.com/r/StockMarket/comments/p05q7h/seven_horses_diverse_portfolio_to_concentrated/",
        "created": 1628415429.0
    },
    {
        "author": "Temp_678543",
        "created_utc": 1629395970,
        "id": "p7k20r",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Replace SQ with any other ticker that seem so obvious now - TSLA, NVDA, AMD...  We all like to day dream about how we ****should**** have invested in something just a few years ago.  Well, this is our chance to preemptively avoid that regret 3-5 years from now.\n\nWhat are some companies that we will be kicking ourselves for not getting into 3-5 years from now?\n\nObviously, there is some assumptions being made here but I'm curious as to what secular trends will be big 3-5 years from today.\n\nI'll provide my take - I think data analytics companies (Palantir, C3AI, other startups) and cloud security (CRWD) will continue to grow.  I also think Robinhood, despite the negative sentiment right now, will continue to climb higher especially as trading volumes in digital assets increase.",
        "subreddit": "stocks",
        "title": "In hindsight, I should have dumped all of my savings in SQ three years ago...",
        "url": "https://www.reddit.com/r/stocks/comments/p7k20r/in_hindsight_i_should_have_dumped_all_of_my/",
        "created": 1629424770.0
    },
    {
        "author": "Silverfox1921",
        "created_utc": 1629481458,
        "id": "p8a5rs",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Nvidia Gains as Pelosi News Outweighs U.K. Antitrust Warning on ARM Deal",
        "url": "https://finance.yahoo.com/news/nvidia-gains-pelosi-news-outweighs-092424827.html",
        "created": 1629510258.0
    },
    {
        "author": "helloroarkitty",
        "created_utc": 1630108662,
        "id": "pcz5um",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "my positions are garbage but NVDA!! would be broke af without that bet",
        "url": "https://www.reddit.com/gallery/pcz5um",
        "created": 1630137462.0
    },
    {
        "author": "FallenWiFi",
        "created_utc": 1628881676,
        "id": "p3rup6",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "I have been on this sub for a good while before the GME hype. I always loved seeing a wide variety of tickers that I could get info on, but recently everything has been flooded with GME. If there has one thing I have learned from this sub, it is that you should be skeptical of advice on here, and I have lots of questions to ask. \n\nI opened a TDAmeritrade account and have already bought NVDA and I am planning to get APPL or MSFT, but I’m interested in taking some risk in GME.",
        "subreddit": "wallstreetbets",
        "title": "I just turned 18. Convince me to buy GME.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p3rup6/i_just_turned_18_convince_me_to_buy_gme/",
        "created": 1628910476.0
    },
    {
        "author": "zatrades",
        "created_utc": 1629062167,
        "id": "p51yn3",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Not all chip stocks are trending up. Charts of some of the largest components in SMH. ( NVDA, ASML, INTC, MU ) These are all 6 months charts. I will be looking for swing trades if they drop due to overall market weakness.  Which would you buy, if any? Please share your thoughts. Charts from stockcharts.\n\nASML up 32% in 6 months.\n\n[ ASML up 32&amp;#37; in 6 months ](https://preview.redd.it/p7xd3uov7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=51fe8a4afbd11959cbe14078cad9466445dd33de)\n\n&amp;#x200B;\n\nIntel down 13.5% in 6 months.\n\n&amp;#x200B;\n\n[ Intel down 13.5&amp;#37; in 6 months ](https://preview.redd.it/u1vy9jvw7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=c768d0458bf6d24a50ea667654737aa9501c5d20)\n\nNvidia up 35%.\n\n&amp;#x200B;\n\n[ Nvidia up 35&amp;#37; ](https://preview.redd.it/i2zsujpx7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=57ee5355c833158225818ff7fb8e08a1372a8005)\n\nMicron down 19.5%.\n\n&amp;#x200B;\n\n[ Micron down 19.5&amp;#37; ](https://preview.redd.it/0vi9wruy7lh71.png?width=700&amp;format=png&amp;auto=webp&amp;s=95f836972bc6d1d1b1608ad2a506bd7594fe88f5)\n\nWhich would you buy, if any? Please share your thoughts.",
        "subreddit": "StockMarket",
        "title": "Chip stocks SMH. ( NVDA, ASML, INTC, MU )",
        "url": "https://www.reddit.com/r/StockMarket/comments/p51yn3/chip_stocks_smh_nvda_asml_intc_mu/",
        "created": 1629090967.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629405501,
        "id": "p7n4zk",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, August 19, 2021**\n\nStocks finished mixed today in a choppy session, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) recovering some losses after yesterday’s session, closing 0.17% and 0.47% higher respectively. On the other hand, the Dow Jones (DIA) fell modestly, closing 0.18% down while the Russell 2000 (IWM), which tracks the performance of small-caps, continued underperforming, closing 1.21% down today and almost 5% down this week. Market participants continue to digest the implication of the Federal Reserve’s July Meeting Minutes, which showed there are increasing discussions surrounding a potential taper timeline, with members suggesting they could begin this year if the current pace of economic recovery continues.  The most important thing is the Fed re-committed to maintaining the interest rate near-zero until at least 2023. That will be the real test for equities in my opinion. \n\nYesterday’s meeting minutes suggested members of the Federal Reserve were advancing the debate over the timing and scope of tapering the pace of the pandemic-era asset purchasing program. In the latest minutes, the Fed said, “looking ahead, most participants noted that, provided that the economy were to evolve broadly as anticipated, they judged it could be appropriate to start reducing the pace of asset purchases this year.”As I said above, this makes a lot of sense judging how the economy has also so far rebounded at a faster pace than expected. Given this record-breaking quarter in terms of corporate earnings and improving labor market conditions, the economy is beginning to be able to stand on its own without all the pandemic-era support. However, while progress has been made, the Fed’s goal has not yet been reached. The meeting minutes said, “ most participants judged that the Committee’s standard of “substantial further progress” toward the maximum-employment goal had not yet been met.” \n\nToday, the Labor Department released their Weekly Unemployment Report, which, along with other recent reports, vindicates the Fed’s assessment that the labor market has substantially recovered from heights of the pandemic-induced recession. Initial Unemployment claims came in at 348,000, the lowest level since March 2020 and better than the 364,000 expected and 377,000 the previous week. Continuing claims came in at 2.82 million, roughly in line with the 2.8 million expected\n\nIn order to stave off another “taper tantrum” and directly address interest rates concerns, the minutes explicitly stressed the need to “reaffirm the absence of any mechanical link between the timing of tapering and that of an eventual increase in the target range for the federal funds rate.” Participants voted to maintain the interest rate near zero. I cannot stress this enough, potential interest rate hikes in 2023 will be the real test for equities. Until then I remain very bullish and will continue buying up every dip (has worked wonderfully so far). Of this, the meeting minutes said, “A couple of participants also noted that a tapering of asset purchases did not amount to a tightening of the stance of monetary policy and instead only implied that additional monetary accommodation would be provided at a slower rate.”\n\nOn inflation, the minutes said “With regard to inflation, participants commented that recent inflation readings had been boosted by the effects of supply bottlenecks and labor shortages and were likely to be transitory” and “Some other participants emphasized that recent high inflation readings had largely been driven by price increases in a handful of categories. These participants pointed out that there was no evidence of broad-based price pressures or of inappropriately high longer-term inflation expectations. Several participants also commented that price increases concentrated in a small number of categories were unlikely to change underlying inflation dynamics sufficiently to overcome the possibility of a persistent downward bias in inflation, as might be associated with the effective lower bound.” However, other participants, like St. Louis President James Bullard, raised concerns about recent inflationary readings and the need for the Federal Reserve to be ready and able to act if current circumstances change.\n\nIn short, the meeting minutes showed there was some divide in opinion among members, with the only thing unanimously agreed on was that interest rates will remain near-zero for the foreseeable future. One quote I think highlights the minutes well is this one, “A few participants expressed concerns that maintaining highly accommodative financial conditions might contribute to a further buildup in risk to the financial system that could impede the attainment of the Committee’s dual-mandate goals. In contrast, a few other participants suggested that preparations for reducing the pace of asset purchases should encompass the possibility that the reductions might not occur for some time and highlighted the risks that rising COVID-19 cases associated with the spread of the Delta variant could cause delays in returning to work and school and so damp the economic recovery.”\n\nI recommend everyone read the full meeting minutes, it's really not that long and super insightful: [https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf](https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf)\n\n**Highlights**\n\n* In more earnings news, shares of Robinhood (HOOD) fell 10% after reporting earnings while my favorite stock Nvidia (NVDA) rose 4% after smashing earnings estimates and raising guidance moving ahead.\n* The Nigerian government said it expected to lift its ban on Twitter (TWTR) by the end of the year.\n* The SEC charged 3 former Netflix (NFLX) employees and two of their associates for insider trading accumulating $3 million.\n* The Federal Trade Commission filed a new version of its antitrust lawsuit against Facebook (FB) on Thursday, seeking to jump-start its case with bolstered allegations that the company is abusing a monopoly position in social media.\n* Tesla (TSLA) is holding an event, billed AI Day, in order to promote and showcase its AI technology. This comes amid an investigation by The National Highway Traffic Safety Safety Administration over Tesla assisted-driving technology\n* Toyota, Volkswagen (VWAGY), Ford Motors (F) have been forced to cut production once again due to the global shortage in semiconductors.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Analog Devices (ADI) with a host of target raises. Average price target $200 at Buy. Stock currently around $167\n* Atmos Energy (ATO) target raised by Morgan Stanley from $119 to $125 at Overweight. Stock currently around $98\n* Digital Realty Trust (DLR) target raised by Citigroup from $160 to $179 at Buy. Stock currently around $163\n* FirstEnergy (FE) target raised by Morgan Stnaley from $46 to $48 at Overweight. Stock currently around $39\n* KeySight Technologies (KEYS) with a host of target raises. Average price target $190 at Buy. Stock currently around $167\n* Lowe’s (LOW) target raised by Credit Suisse from $208 to $220 at Outperform. Stock currently around $202\n* Nvidia (NVDA) with a host of target raises following blow-out earnings. Average price target $235 at Buy. Stock currently around $198. I love this stock so much\n* Philip Morris International (PM) target raised by Deutsche Bank from $114 to $120 at Buy. Stock currently around $101\n* SolarEdge Technologies (SEDG) target raised by Morgan Stanley from $310 to $318 at Overweight. Stock currently around $262\n* Target (TGT) with three price target raises. Stock current around $245\n   * Raymond James from $252 to $285 at Strong-Buy\n   * Credit Suisse from $283 to $286 at Outperform\n   * Citigroup from $258 to $287 at Buy. \n* The TJX Companies (TJX) with a host of target raises. Average price target $85 at Outperform. Stock currently around $73.50\n\n“It is the mark of an educated mind to be able to entertain a thought without accepting it.” Aristotle",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, August 19, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p7n4zk/here_is_a_market_recap_for_today_thursday_august/",
        "created": 1629434301.0
    },
    {
        "author": "LegendaryHODLer",
        "created_utc": 1629673294,
        "id": "p9n21y",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "# Last Week’s Review\n\nThe SPY and QQQ ended flat last week while IWM and small-caps closed down -1%. The market did not react well to the Fed hinting of a potential taper by the end of 2021 or early 2022. Growth names took a beating, but most of last week’s list performed relatively well being down only 2-3%.\n\nJackson hole Fed meeting, virtually, is taking place this Friday August 28 and will be a big tell in what’s to happen next for the market. They will discuss economic policies that, as we know, rule over the stock market and dictate where valuations should be. If you are an investor this will be a key event to keep an eye on. Due to the meeting I will be trading light this week, but I’ve still put together a few names on my watch-list down below.\n\n&amp;#x200B;\n\nThe market is in a peculiar place. We have:\n\n* Retail sales lower than expected\n* China retail sales lower than expected\n* China stocks still in hot lava\n* Fed saying it’s time to taper\n* Inflation being transitory and also maybe not transitory\n* Covid news flip-flopping daily between good and bad\n\n&amp;#x200B;\n\nThere is more information than the market can even digest, which is a possible factor for this increase in volatility and choppiness.\n\n&amp;#x200B;\n\nI want to eventually get into all the details of how I find stocks to choose from. It’s really nothing fancy like boilinger bands or ichimoku clouds, but rather simple technicals such as support and resistance lines, moving averages, and trend channels.\n\n&amp;#x200B;\n\nThere will never be a clear leading indicator of when to buy or sell a stock for max profit. Most of it is knowing about the stock/company and finding a reasonable entry point for it, like we’ve been doing with out “Buy The Dip” charts. Next week I’ll cover some of these charting and technicals a bit more in-depth, but for now I’ll leave you with several questions I ask myself before entering the play.\n\n&amp;#x200B;\n\n* Is the company fundamentally strong? If not, am I playing a bounce or what is my game-plan, aka how long will I hold the position?\n* Is the stock in an up-trend? If yes, is it near the top of the channel, or at the lower trend-line and a decent entry?\n* Is the stock in a down-trend? Has the stock price settled or bottomed? If yes a base might be forming. If not, am I catching this knife because I think the share price over-reacted to bad news? Is the company still trading at ridiculous PE or P/S? Did the company’s moat get threatened? Has growth slowed?\n* Am I trading on stock hype? Has the hype died off and provided a potential entry, AKA my green/orange/red zones? Am I FOMOing into the trade or should I re-visit this stock in 7 days and see if it’s still something I want to buy.\n\n&amp;#x200B;\n\nThese are all important questions to ask yourself before you enter any position. Figure out your game-plan and strategy and fine-tune it into something that works for you.\n\n&amp;#x200B;\n\nWhat do a pizza, gambling, and tech stock have in common? Nothing, but let’s buy the Fing dip.\n\n&amp;#x200B;\n\n# The MEME List\n\n**DraftKings (DKNG)**\n\nhttps://preview.redd.it/8s5zajbrpzi71.png?width=2254&amp;format=png&amp;auto=webp&amp;s=dd20aed890bd535e8de05ed1fdd9dabd3cd27899\n\nDKNG had a great run up to $70 earlier this year, but since then it saw a steady decline, with most other growth stocks, back to the $40 level. Looking at the 50 EMA line it was clear that it was in a downtrend, but it just recently crossed back over. I wouldn't say an uptrend is confirmed just yet, but we are almost there. This may prove to be a good entry and I'm willing to take the risk on this fairly risk-averse play.\n\nThere is potential it could drop back to $45 level, but IMO this could also be a $75 stock. I see 10-20% downside risk with 50% potential upside and that is a risk-reward I prefer.\n\n&amp;#x200B;\n\n**Snowflake (SNOW)**\n\nhttps://preview.redd.it/yqpiwkyrpzi71.png?width=2266&amp;format=png&amp;auto=webp&amp;s=566d8b20a657abf145c1b299142dfbb6fc1fca5d\n\nThe over-hyped IPO of SNOW that shot the stock up to over $400 per share and eventually into a quick reversal back to the high $200's. I added an orange zone box to show where the stock started to bottom out. SNOW has lost most of it’s volatility that surrounded the IPO and since May has been on a SLOW grind back up. SNOW is down 8% over the last 5-trading sessions and is sitting at the 50 EMA (orange line). I'll be looking for a bounce off this line.\n\n&amp;#x200B;\n\n# The BTFD List\n\n**Paypal (PYPL)**\n\nhttps://preview.redd.it/9y31ffispzi71.png?width=2266&amp;format=png&amp;auto=webp&amp;s=7752d2fdaf2c6cb822a8b90a1684dddea361f93a\n\nPaypal stock dropped recently on earnings after Ebay announced a transition to their own managed payments system. PYPL did post impressive earnings, but had soft guidance for Q4 and the stock tumbled.\n\nUnlike meme stocks PYPL's trends have been steady and consistent. Looking at the chart it just recently dipped below the 50 EMA to potentially form a reversal (but not yet), and is sitting at the 100 EMA where I am looking for a bounce. Should we lose this level I might exit the position as the trend would be confirmed to the downside and potentially $240.\n\n&amp;#x200B;\n\n**Dominoes Pizza (DPZ)**\n\nhttps://preview.redd.it/oouz0k4tpzi71.png?width=2270&amp;format=png&amp;auto=webp&amp;s=c2bf6d69ce71c1c22ac70f6683a482c4b0b41157\n\nLed by international expansions and strong domestic growth Dominoes pizza has been one of the most out-performing stocks of 2021. Similar to PYPL above it has been on an extremely consistent uptrend. The recent 5% dip has given an entry point and IMO any dip to the 50 EMA can also provide an entry. The stock is also hitting some over-sold indicators which would agree with my bias.\n\n&amp;#x200B;\n\n**Taiwan Semis Manufacturing (TSM)**\n\nhttps://preview.redd.it/lv8267stpzi71.png?width=2262&amp;format=png&amp;auto=webp&amp;s=68bdfd8e676eef73ca3bb7b27f4d2387a1772736\n\nThe semi-shortage has been affecting many industries. With how cyclical production can be analysts are nervous about the over-production and over-supply that might eventually hit. However, I expect chip demand to remain robust for the foreseeable future. TSM was trading in a range for almost 6 months and oversold levels are starting to show, but IMO this is a value play. TSM trading at a much lower PE relative to their competitors of NVDA and AMD, and not getting much love. To be able to buy this name back at almost the same price as 9 months ago is a value entry.\n\n&amp;#x200B;\n\nThat’s the end of this week’s edition! Hope you all are able to take something away from it. For those that are interested in the memes I’ll be bringing some of those back as well. Hope you had a great weekend all and see you next week!",
        "subreddit": "options",
        "title": "I scanned over 150 charts this weekend. Here are some good setups I found to BTFD (or sell CSPs): DKNG, SNOW, DPZ, PYPL, TSM",
        "url": "https://www.reddit.com/r/options/comments/p9n21y/i_scanned_over_150_charts_this_weekend_here_are/",
        "created": 1629702094.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629079259,
        "id": "p56ozu",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p56ozu/historical_post_earnings_moves_mega_compilation/",
        "created": 1629108059.0
    },
    {
        "author": "finkalot1",
        "created_utc": 1629805240,
        "id": "pallvi",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "12 yrs 8 mths of 💎🙌 on NVDA",
        "url": "https://i.redd.it/5wah4488maj71.jpg",
        "created": 1629834040.0
    },
    {
        "author": "Hellforasailor",
        "created_utc": 1629424719,
        "id": "p7sqk7",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I can understand the OnlyFans ban and agree with it.\n\nLet me explain:\n\nSome OnlyFans content with girls showing boobies that may not always be showing boobies is cool.\n\nOnlyfans content with a person spinning on an improvised “sexy” machine while simultaneously getting (redacted) while also getting (redacted) while also promoting it at every available opportunity is a little much.\n\nI think that the super hardcore stuff does pigeon hole OnlyFans a bit when there is a larger marketable audience out there to connect personalities with fans for customized content.\n\nI’m sure there will be a place where all of that content is okay and I believe strongly in giving women a place to feel safe and express themselves.\n\nIn order to have a safe space for expression I would tend to think that there is an added pressure to women who got on the site to share more mild content to feel pressured to push boundaries they would otherwise not have or didn’t intend to.\n\nConsidering the ape brains of most males especially from the comfort of online anonymity those entertainers that push milder content would be subject to more outlandish requests based on the prevalence of more hardcore content on the platform.\n\nUltimately I don’t think OnlyFans intended to be a place for hardcore content and didn’t model itself as a porn site.  I think that there adjustment was not knee jerk and the vision of what they would like to provide as a service long term required some clarification (or resetting).\n\nIf you are worried about being displaced as an entertainer I would like to also commend you for your ingenuity as well and this post is not meant to be negative.  If you are successful on the platform you have obviously shown a knack for marketing, and are aware of capitalizing on a trend.  These things are rarely taught and I believe that whatever the next move looks like will be successful for you.\n\nAlso NVDA 9/3 210c",
        "subreddit": "wallstreetbets",
        "title": "OnlyFans Did Nothing Wrong",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p7sqk7/onlyfans_did_nothing_wrong/",
        "created": 1629453519.0
    },
    {
        "author": "joethemaker22",
        "created_utc": 1627832573,
        "id": "ovuesj",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "My portfolio is mega cap tech heavy and it has worked out over the last 8 months with the runups FB, AAPL, NVDA, MSFT have had but I feel it is time to diversify but when I look at stocks in sectors like energy and financials I notice they had runups already and have been moving sideways over the last few weeks near their ATH. Is it worth it to buy those and risk downside if they start to miss earnings when their earnings comps become 2021 instead of Y/Y comps to a pandemic year. Just to not be so tech heavy?",
        "subreddit": "stocks",
        "title": "Is it worth it to diversify into sectors that are moving sideways or in a downtrend?",
        "url": "https://www.reddit.com/r/stocks/comments/ovuesj/is_it_worth_it_to_diversify_into_sectors_that_are/",
        "created": 1627861373.0
    },
    {
        "author": "Sudden_Culture_4497",
        "created_utc": 1628116139,
        "id": "oy400b",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Am I doing options right? Up $100k off AMD and NVDA calls over the last month",
        "url": "https://i.redd.it/v3t409yn3ff71.jpg",
        "created": 1628144939.0
    },
    {
        "author": "Beautiful-Ad-8447",
        "created_utc": 1629998938,
        "id": "pc49gm",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Is Nvidia (NVDA) a buy after its impressive Q2 earnings?\n\n# Last earnings:\n\n* Q2 Figures:\n\nFor the quarter that ended on August 1st, Nvidia generated a record $6.51 billion in revenues, exceeding the expected $6.33 billion. Revenue rose 68% annually whereas, in the previous quarter, sales grew 84%. Adjusted earnings amounted to $1.04, exceeding expectations of $1.01.\n\n&amp;#x200B;\n\n* Graphics Segment:\n\nThe segment which is primarily made up of graphics cards grew 87% to $3.91 billion or more descriptively, faster than the compute and network segment, which includes chips for data centers, which grew 46% to $2.6 billion.\n\n&amp;#x200B;\n\n* Gaming Market\n\nWhen it comes to markets, gaming was one of the highlights, its sales went up 85% compared to last year and reached $3.06 billion. This increase is owed both to GeForce graphics card sales and the chips it sells to game console makers, such as the processor which is at the heart of the Nintendo Switch.\n\n&amp;#x200B;\n\n* Data Center Business\n\nDue to graphics cards for data centers, both industrial use and among cloud providers, this business also hit an all-time high as it grew 35% annually to $2.37 billion.\n\n&amp;#x200B;\n\n* Professional Visualization\n\nThe segment that consists mostly of graphics cards for high-end professional workstations went up 156% annually to $519 million. Its automotive business remains a small portion of the company's sales, with sales of $152 million, down sequentially from the previous quarter but up 37% from last year's respective quarter that was shaped by the global pandemic that halted auto production.\n\n&amp;#x200B;\n\n* CPM Fell Short\n\nThe company's new Cryptocurrency Mining Processor (CMP), the dedicated chips it makes for cryptocurrency mining, failed to hit Nvidia's own predictions. It reported $266 million in cryptocurrency card sales, as opposed to $400 million it predicted, making the prediction 33% off. CMP sales were likely impacted by China's cryptocurrency crackdown as miners were selling off used graphics processing units.\n\nNvidia says its cryptocurrency cards are an effort to ensure there is sufficient chip supply for gamers and it applied software to its GPUs to prevent them from mining cryptocurrencies. Going forward, Nvidia's CFO, Colette Kress, expects a \"minimal contribution\" from CMP sales.\n\n&amp;#x200B;\n\n# Potential Dangers :\n\nSupply issues that began late last year are still in the air, as Nvidia's latest line of graphics cards has remained mostly sold out in stores and it was seeing longer lead times throughout its supply chain. But this is not a surprise as the company announced back in May that it expected supply issues to persevere throughout the second half of the year. This time around, it revealed it expects GPU supply constraints for the ‘vast majority of 2022 as well.\n\n&amp;#x200B;\n\n#  Catalysts:\n\nData centers -- the computing units that form the backbone of cloud computing -- are also ramping up their use of GPUs, putting them to work as computing accelerators to handle complex workloads and applications like artificial intelligence (AI).\n\nNvidia has had a flurry of innovation on this front in recent years, unleashing a slew of new chips designed for these data center customers. It also made the acquisition of networking hardware company Mellanox early last year to bolster this emerging area of expertise. As a result, the data center segment hauled in $2.37 billion in sales in Q2 and has been steadily catching up to the gaming unit in size.\n\nFor comparison, when the cryptocurrency crash of 2018 sent Nvidia sliding backward (during Nvidia's fiscal 2019), data centers represented only about one-quarter of total revenue. They now account for more than one-third of the total.\n\nNvidia is only just getting started on this front, too. Some of its more recent hardware announcements for data centers haven't even begun to be commercialized yet. This is a huge segment of the semiconductor industry that has long been dominated by **Intel**. Tens of billions in annual sales are up for grabs if Nvidia's innovations can continue to steadily garner momentum. \n\n# TLDR:\n\nFor the undergoing quarter, Nvidia expects $6.8 billion in revenue exceeding Refinitiv expectations of $6.5 billion. The company is in a period of sustained, massive growth in its business as semiconductors are in short supply across the globe while the demand for the kind of processors it specializes in is skyrocketing. Not surprisingly, over the last year, its shares are up over 57%. Granted, another uptick in cryptocurrency activity would help, but it isn't a primary catalyst for this chip designer. This is the best long-term semiconductor investment around, as it benefits from multiple secular growth trends in the global economy.",
        "subreddit": "wallstreetbets",
        "title": "Nvidia (NVDA): Buy a share and you own the future",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pc49gm/nvidia_nvda_buy_a_share_and_you_own_the_future/",
        "created": 1630027738.0
    },
    {
        "author": "Zenny_100",
        "created_utc": 1628901043,
        "id": "p3xtpp",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "So my current portfolio is: TQQQ 37%, AAPL 7%, MSFT 7%, NVDA 7%, IIPR 7%, ABR 7%, V 7%, ABBV 7%, SBUX 7% and NOBL 7%. \n\nI know I’m tech heavy and know the risks of the leverage etf, but should I diversify for the sake of diversifying into sectors that I don’t have or should I focus on investing in what I know/use? I’m 33 btw if that helps and this is in a Roth. Thank you for anyone taking the time to read and answer.",
        "subreddit": "stocks",
        "title": "Help/advice please",
        "url": "https://www.reddit.com/r/stocks/comments/p3xtpp/helpadvice_please/",
        "created": 1628929843.0
    },
    {
        "author": "TigerBlood1910",
        "created_utc": 1629730022,
        "id": "pa1aow",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Thanks NVDA (3K - 10K)",
        "url": "https://www.reddit.com/gallery/pa1aow",
        "created": 1629758822.0
    },
    {
        "author": "UltimateTraders",
        "created_utc": 1630286891,
        "id": "pe87yn",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Hello everyone and thank you for your time. I come to you with a serious issue because the NASDAQ, SP500 and Dow 30 keep making record highs almost daily and many stocks are near 52 week lows. Many months ago maybe all the time pre March 2021 I used the 3 as indicators when I traded to cool down, stay on the sidelines or jump in a trade. Unfortunately for me, I do not trade SPY/VOO I know the SP is the most popular indicator but what can you look at when your watch lists have a sea of red and these 3 indexes are making new highs?\n\nI have also tried using the NASDAQ 100 which is cap weighted \\[Which means MSFT, AAPL, FB, GOOG, NVDA\\] mean so much more for this index, as they do on the SP..\n\nSo I ask is there a NASAQ 1000? I have also tried the Russell 1,000 and 2,000 and they can be green and my stocks red. Some of the stuff on the Nasdaq which I refer to \\[BCOV, COMP, CPNG, CRSR, GRPN, HIMS, KNBE, TIGR, PUBM\\] These are just some on my watch list near 52 week lows while the indexes mega caps, blue chips are making all time highs… to be honest other watch lists have a lot of red… but the blue chips are making highs…\n\nI am sure maybe someone may have an ETF or mutual fund that may cover Nasdaq 500-2000? I mainly trade Nasdaq which is growth and tech oriented. Thank you for your help.",
        "subreddit": "stocks",
        "title": "Hello everyone, is there an ETF, Mutual fund that you follow during the market day? The DOW, SP, NASDAQ hit records but not what I trade",
        "url": "https://www.reddit.com/r/stocks/comments/pe87yn/hello_everyone_is_there_an_etf_mutual_fund_that/",
        "created": 1630315691.0
    },
    {
        "author": "Aggressive_Watch3782",
        "created_utc": 1627930116,
        "id": "owl1kd",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "My stock broker called me and said “Hey, I think you should sell a 100 shares of Nvidia! Cost me $20.00 per share in 2015! So, I would get close to $20,000 sounds good right? \nBig picture problem I see right away! $20,000 puts me in a higher tax bracket first off, 2nd tax implications would shrink it down to about $16,000 or more? Taxes are not my thing other than to avoid them. 3rd and most importantly NVIDIA has been the best stock in the market for years! I want more not less! Other than his self-serving “I own too much I have to unload some” tough luck bud! I wish I had your problem.\nMy question is: time to get a new broker or continue doing my own research and utilize Schwab and avoid the broker fees completely. I honestly, believe I have my finger on the pulse of the market better than he does. His parting comment was I’m doing this for all my clients. Your position is too big, time to diversify and you still have plenty left. \nWe all see the direction\nOf computing A/I, machine learning and Autonomous driving. Are going to just explode in the next couple of years. There is not a company even close to the moat they have created via GPU’S and gaming. \nI’m switching to Schwab, same exact guidance =None\nNo fee seals it! Please let me know if you agree or am I just dumb?",
        "subreddit": "wallstreetbets",
        "title": "Can you believe this!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/owl1kd/can_you_believe_this/",
        "created": 1627958916.0
    },
    {
        "author": "RunjumpFly1",
        "created_utc": 1629980022,
        "id": "pby97u",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I have studied some DDs here of the stocks near $50B market cap. I'm looking for niche high growth micro/small/large stocks. I feel that PATH and SNPS are industry leaders in their domain and may allocate 40% of my investable money to them. Is it likely that they can 5-10X in the decade and match something like NVDA in market cap?\n\nPlease note I'm new to US market and I don't have any position currently. I'm not shilling the mentioned stocks and genuinely interested to know the subs opinion. Please suggest other niche high growth stocks with low competition.",
        "subreddit": "stocks",
        "title": "Niche high growth stocks with low competition",
        "url": "https://www.reddit.com/r/stocks/comments/pby97u/niche_high_growth_stocks_with_low_competition/",
        "created": 1630008822.0
    },
    {
        "author": "BC1096",
        "created_utc": 1628490730,
        "id": "p0vvlt",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I know a silent minority loaded up on NVDA shares/options last week. How are we feeling going into this week?\n\nMy contracts started off HOT but took a beating on Friday, but thankfully still up around 45%. I feel like we should be safe, maybe a 208 this week, but who knows.\n\nIt’s a solid company, and the ARM deal should go through. Plus it’s a guarantee they are going to crush earnings like they always do.\n\nFeels like a situation where it’s hard to walk away with a loss, that’s why my calls are longer out then I usually play.\n\nNVDA gang, are we good?",
        "subreddit": "wallstreetbets",
        "title": "NVDA gang, how are we feeling?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p0vvlt/nvda_gang_how_are_we_feeling/",
        "created": 1628519530.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1629166252,
        "id": "p5ul1o",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Shares of Chinese electric-vehicle maker NIO were weak Monday after a fatal accident involving a NIO car with self-driving features.  \n\n\nThe fatal crash of a NIO ES8 sport-utility vehicle took place last week in China. The SUV is equipped with several driver assistance functions, including features enabled by Intel (ticker: INTC) division Mobileye, that enable some forms of autonomous driving. NIO’s driver assistance functions are called NIO Pilot and employ cameras as the so-called eyes of the car.  \n\n\nNIO has other autonomous-driving technology, referred to as NAD, such as radar, lidar—a laser-based radar—and camera vision, as well as computing power provided partly by Nvidia (NVDA) to process all the data points coming at the car.  \n\n\nThe NAD features don’t appear to be available on all NIO vehicles, including the ES8. All autonomous driving systems require the driver to pay attention to the road at all times.  \n\n\nNIO responded to a request for comment with a Weibo post in Chinese. The post indicates the company is cooperating with police regarding the investigation.  \n\n\nThe global automotive industry is still wrestling with regulatory and branding issues surrounding autonomous technology. Self-driving features, such as adaptive cruise control and lane-keeping assistance, make driving safer as long as systems are used as intended. But drivers might rely too much on the features when systems are dubbed pilot or autopilot. Government safety regulators, such as the National Highway Traffic Safety Administration, are still drafting plans to prepare for the introduction of more advanced self-driving features.\n\nLink: [https://www.barrons.com/articles/nio-stock-price-self-driving-crash-51629118508](https://www.barrons.com/articles/nio-stock-price-self-driving-crash-51629118508)",
        "subreddit": "stocks",
        "title": "A driver died in a car crash involving a Nio car activated with driver-assistance feature",
        "url": "https://www.reddit.com/r/stocks/comments/p5ul1o/a_driver_died_in_a_car_crash_involving_a_nio_car/",
        "created": 1629195052.0
    },
    {
        "author": "Ok-Seaworthiness2487",
        "created_utc": 1629564683,
        "id": "p8uvqv",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": " I got into the stock market just over 2 months ago. I've just been investing in large trustworthy companies like Microsoft, Adobe, Nvidia; and two index funds SPY and QTEC. It's been going really good so far, profiting $85 in these 2 months with just $2000. I invest about $1000 each month. I have $1000 in Bitcoin too, but I'm just testing that one out right now. \n\nIs it wise to use the stock market as a savings for a down payment on my first house? It wouldn't be for another 2 years that I actually start seriously looking at houses. Should I also have a bank savings account, in case something goes bad with the market? If so, what percentage stock vs. savings is ideal?",
        "subreddit": "StockMarket",
        "title": "Should I invest in stocks as savings for house?",
        "url": "https://www.reddit.com/r/StockMarket/comments/p8uvqv/should_i_invest_in_stocks_as_savings_for_house/",
        "created": 1629593483.0
    },
    {
        "author": "Sean2257",
        "created_utc": 1629744305,
        "id": "pa63u3",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "\nI realise my portfolio is pretty tech heavy, and I'm looking to diversify a bit. I'm 20, and I have €23K of savings I'm looking to invest. The plan is to to invest this, and then not look at the account for 10 years. Medium risk.\n\nPart of me wants to just double down on MSFT and AAPL because I love the stocks, but that's probably a bad idea. No ETFS because they're taxed to fuck here in Ireland.\n\n\nMSFT - 53% = €4,800\nAAPL - 35% = €3,103\nNVDA - 9%  =  €782\nASTS -  2.5% = €222\n   \n\nThanks.",
        "subreddit": "stocks",
        "title": "Help me improve my portfolio.",
        "url": "https://www.reddit.com/r/stocks/comments/pa63u3/help_me_improve_my_portfolio/",
        "created": 1629773105.0
    },
    {
        "author": "SignificanceOk1462",
        "created_utc": 1628000773,
        "id": "ox4l1y",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Picked it up at .30",
        "subreddit": "options",
        "title": "Nvda 210 strike 8/6 exp",
        "url": "https://www.reddit.com/r/options/comments/ox4l1y/nvda_210_strike_86_exp/",
        "created": 1628029573.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629492102,
        "id": "p8dj0n",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, August 20, 2021**\n\nStocks rose today, recovering some of the losses from earlier this week as market participants shake off some taper concerns. Market participants continue to weigh several factors affecting the market, including but not limited to (1) the taper timeline, (2) record-breaking corporate earnings, (3) and surging coronavirus delta variant infections. \n\nThe S&amp;P 500 (SPY) rose 0.79% today, recovering earlier losses, but finished the week 0.31% down. The Nasdaq (QQQ) rose 1.04% today and staged a remarkable comeback this week, coming from 2% down Thursday to finishing 0.01% higher. The Dow Jones (DIA) rose 0.65% today but finished the week 0.96% down, underperforming the other two major indexes. The Russell 2000 (IWM), which tracks the performance of small-caps, rose 1.68% today but finished the week 1.98% down.\n\nOn Wednesday, meeting minutes suggested members of the Federal Reserve were advancing the debate over the timing and scope of tapering the pace of the pandemic-era asset purchasing program. In the latest minutes, the Fed said, “looking ahead, most participants noted that, provided that the economy were to evolve broadly as anticipated, they judged it could be appropriate to start reducing the pace of asset purchases this year.”As I said above, this makes a lot of sense judging how the economy has also so far rebounded at a faster pace than expected. Given this record-breaking quarter in terms of corporate earnings and improving labor market conditions, the economy is beginning to be able to stand on its own without all the pandemic-era support. However, while progress has been made, the Fed’s goal has not yet been reached. The meeting minutes said, “ most participants judged that the Committee’s standard of “substantial further progress” toward the maximum-employment goal had not yet been met.” \n\nIn order to stave off another “taper tantrum” and directly address interest rates concerns, the minutes explicitly stressed the need to “reaffirm the absence of any mechanical link between the timing of tapering and that of an eventual increase in the target range for the federal funds rate.” Participants voted to maintain the interest rate near zero. I cannot stress this enough, potential interest rate hikes in 2023 will be the real test for equities. Until then I remain very bullish and will continue buying up every dip (has worked wonderfully so far). Of this, the meeting minutes said, “A couple of participants also noted that a tapering of asset purchases did not amount to a tightening of the stance of monetary policy and instead only implied that additional monetary accommodation would be provided at a slower rate.”\n\nRead the full meeting minutes here: [https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf](https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210728.pdf)\n\nAs of yesterday, 91% of companies in the SPY have reported Q2 earnings, with 87% of these topping consensus estimates on earnings per share, according to data compiled by FactSet. The expected, year-over-year overall growth rate for the SPY currently stands at 89.3%, the fastest increase since the Q4 2009. David Kostin, Chief US Equity Strategist at Goldman Sachs, said “In an earnings season with many surprises – including the highest frequency of EPS \\[earnings per share\\] beats in our 22-year data history – one of the most notable was the surge in corporate buyback activity. Strong corporate equity demand is one reason we forecast a 5% return to our SPY year-end target of $470”\n\nThe U.S. now has an average of 143,827 new COVID-19 cases per day as of yesterday, a rate that has doubled in a little over two weeks, the number of hospitalized is at a six month high, and roughly 911 people are dying each day, triple the death rate seen in late July. For context, the US was averaging roughly 20,000 new cases per day on July 1.\n\nHowever, while this is definitely not good, it is important to mention that cases remain highly concentrated in areas of high vaccine hesitancy. According to John Hopkins University, almost ⅓ of all COVID hospitalizations in the US are in Texas or Florida. \n\nAccording to data analysis by the Associated Press using data through May 2021, shows that 98.9% of those hospitalized with COVID are unvaccinated (only 1,200 of 107,000 hospitalizations as of May 2021). Dr. Rochelle Wolensky, Director of the Center for Disease Control and Prevention (CDC), said “There is a clear message that is coming through: This is becoming a pandemic of the unvaccinated. Our biggest concern is we are going to continue to see preventable cases, hospitalizations and sadly deaths among the unvaccinated.”\n\n**Highlights**\n\n* The price of digital currencies surged after Coinbase (COIN) announced it was investing $500 million and would allocate 10% of quarterly profits into a digital currency portfolio. \n* Yesterday was Tesla AI Day, in which the company unveiled new technologies and ideas the company is working on. Among the most interesting was a humanoid robot that will be operated using Tesla’s full-self driving technology (FSD). The robot is designed to do “dangerous, repetitive, boring tasks” according to Elon Musk. Interesting to say the least.\n* Microsoft (MSFT) boosted the price of Office 365 for the first time since the service was launched a decade ago. This caused the surge to spike to a new all-time high. The company said collaboration tools now used by more than 250 million monthly active users\n* After 70 years, the MLB dropped Topps as the creator of the iconic baseball cards. As a result, Topps merger into the market was terminated a day before shareholders were set to vote.\n* Shares of Nvidia (NVDA) continued beasting after smashing earnings and raising guidance moving forward. I love this stock so much\n* Shares of Alibaba (BABA) continue to bleed among the regulatory crackdown by the Chinese Communist Party. The stock is now way below even March 2020 level and is trading at the lowest level since June 2019.\n* Facebook (FB) unveiled a new product called “Horizon Workrooms”, which is a VR powered, remote work app that uses the company Oculus Rift headset. Zuckerberg called it the first step in building a “metaverse”, which is a collectively-shared virtual space where people are able to interact using avatars. This seems like the next big trend among giant internet companies.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AbbVie (ABBV) target raised by SVB Leerink from $145 to $148 at Outperform. Stock currently around $119\n* Applied Materials (AMAT) with two target raises. Stock currently around $127\n   * Mizuho from $158 to $161 at Buy\n   * Morgan Stanley from $139 to $150 at Equal-Weight\n* Invitation Homes (INVH) target raised by Morgan Stanley from $45 to $48.50 at Overweight. Stock currently around $40.50\n* Microsoft (MSFT) with two target raises. Stock currently around $304\n   * UBS Group from $325 to $350 at Buy\n   * Wedbush from $325 to $350 at Outperform\n* Peloton Interaction (PTON) target raised by MKM Partners from $110 to $130 at Buy. Stock currently around $108\n* Sherwin Williams (SHW) target raised by Morgan Stanley from $315 to $345 at Overweight. Stock currently around $307\n* Tapestry (TPR) target raised by Robert W Baird from $58 to $60 at Outperform. Stock currently around $40.50\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices not a risk, but it is an opportunity. Where else do you look for cheap stocks?” - Li Lu",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, August 20, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p8dj0n/here_is_a_market_recap_for_today_friday_august_20/",
        "created": 1629520902.0
    },
    {
        "author": "Immediate-Cow4999",
        "created_utc": 1628060842,
        "id": "oxn5ws",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Nvidia (NVDA) Takeover of Arm May Be Blocked by UK",
        "url": "https://www.bloomberg.com/news/articles/2021-08-03/u-k-considers-blocking-nvidia-s-takeover-of-arm-over-security",
        "created": 1628089642.0
    },
    {
        "author": "Ti84andKush",
        "created_utc": 1628182945,
        "id": "oymr08",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Ive been wondering about this strategy, but I lack the experience to be able to really evaluate it, so I hope I can gain some insight here.  \nSo lets say you take a volatile stock or an etf that has a high return over the last 5 years. And then dedicate a fraction of your portfolio into atm/otm put options, for example a 100 put contract to cover for 40 shares, would you be over insured or could you actually use the leverage of the puts to make a windfall in a sudden bear market?   \n\n\nThe strategy that I am looking for would seek to cover all losses of 20% at any given point and make a windfall for losses of 40% or more. Im not exactly sure what the best percentage is to dedicate annually but lets say 5% as that is a conventional amount. This is not a lot and would not allow you to buy itm puts to cover your shares, also it would constitute significant drag and would require a performant underlying to ensure that on average years a decent return can still be made despite the cost.   \n\n\nI was playing around with a put option calculator noticed that buying more puts than shares held would result in a greater win if the market tanks due to the leverage. Also weeklies appear cheaper than longer term options as this continuous purchase strategy could try and eliminate premiums on theta and could therefore get better strikes. I am interested what you guys think about buying \"overprotection\" this way, say 50 stocks per 100 contract, 40 per 100 seems to be a bit sweeter even. Depending on market sentiment this ratio could be adjusted by buying or selling shares depending what direction is more anticipated.  \n\n\nFor example take $nvda at a price of 200, 40 shares cost 8000$. 5% insurance would be around 400$ annually. This would result in 7,69$ insurance per week or 8cents per option. 8 cents could buy a strike of 167.5 (right now). Buying this contract for the course of the week, would permit losses of up to 20% and then gradually reduce them due to the profit of the options until a potential maximum return of +100% is made if nvda goes all the way to 0 (and the 167.5 put goes to 16,750). This appears to me to be a really interesting strategy, but I am sure I am missing something because it seems too good to be true.   \n\n\nIs it because of coincidence that I found a good price strike combination (and could this work on \"the right\" picks) or will this always fail because puts just happen to be cheap right now and in times where these drops might happen put prices will have already increased to an unusable level? Also will weeklies work or is it better to buy more time? Also I thought about transaction costs, but that would be 1 contract per week, therefore about 52$ a year lets say, but maybe there are issues finding people selling weeklies every week. Is there anything else I am missing? Is there anything similar I could look into or any change you could recommend?  \n\n\nIn anyway thank you for your attention, I look forward to hearing from you and hope I can learn something from your insights and experiences.",
        "subreddit": "options",
        "title": "Is a hedging strategy with more atm/otm puts than shares good long term insurance and able to provide windfalls?",
        "url": "https://www.reddit.com/r/options/comments/oymr08/is_a_hedging_strategy_with_more_atmotm_puts_than/",
        "created": 1628211745.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1628802845,
        "id": "p391q5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, August 12, 2021**\n\nStocks largely finished higher, with all three major indexes managing to close out the day in the green. The S&amp;P 500 (SPY) and Dow Jones (DIA) once again recorded fresh intraday highs.  The Nasdaq (QQQ) broke two consecutive red days and finished higher today. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed relative to the major indexes, closing the day 0.26% down. It seems a pattern has emerged in the last week or so, in which the market pulls back early in the morning before reversing to the upside. Market participants continue to weigh new economic data and corporate earnings with concerns around the coronavirus Delta variant and potential inflationary pressures. \n\nYesterday, The Labor Department reported Wednesday that its consumer price index (CPI) rose 5.4% in July from a year earlier, in line with June’s figure and matching the largest jump since August 2008. The government said CPI increased 0.5% on a month-over-month basis, matching a consensus forecast from economists surveyed by Dow Jones.\n\nCore CPI which excludes energy and food, rose by 0.3% last month, shy of a forecasted 0.4% increase and well below June’s rise of 0.9%. The core figure is up 4.3% over the last year, a slight deceleration from June’s 4.5%. Economists often consider core CPI to be a more reliable indicator since it’s insulated from the frequent swings in petroleum and food prices. It’s encouraging to see prices slowly moderate as the economic recovery continues to mature and pent-up consumer demand is increasingly released. \n\nThe US Senate gave surprisingly bipartisan approval to a $1 trillion infrastructure bill. The bill appropriates money to rebuild the nation’s roads and bridges, fund climate initiatives, and bolster the nation’s broadband infrastrucutre. The vote, 69-30, was uncommonly bipartisan given the seeming contention the Republicans had for the initial drafts of the infrastructure bill. President Biden said, “This historic investment in infrastructure is what I believe you, the American people, want, what you’ve been asking for for a long, long time.” Mitch McConnell, who earlier in the year publicly declared “100% of my focus is on stopping this new administration” said of the deal, “I was proud to support today’s historic  bipartisan infrastructure and prove that both sides of the political aisle can still come together around common-sense solutions.” The bill appropriates money to rebuild the nation’s roads and bridges, bolster public transportation, fund climate initiatives, and bolster the nation’s broadband and 5G infrastrucutre. Here is a full list of what is included: [https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/](https://www.whitehouse.gov/briefing-room/statements-releases/2021/06/24/fact-sheet-president-biden-announces-support-for-the-bipartisan-infrastructure-framework/)\n\n**Highlights**\n\n* A slew of corporate earnings continues, with notable names like ContextLogic (WISH), SoFi Technologies (SOFI), Disney (DIS), Rocket Mortgage (RKT) and Airbnb (ABNB) reporting\n   * WISH and SOFI both plummeted after earnings\n* Shares of Micron Technology (MU) continued its steep pullback, falling more than 7% today after analysts at Morgan Stanley downgraded the stock citing fears of deceleration in DRAM sales. Worse day in the stock since March 2020\n* Financial stocks continued their rally as the benchmark 10-year Treasury yield continues its rebound from six month lows. \n* Producer prices rose 1.0% month-on-month in July, the Labor Department reported Thursday. This matched June's monthly rise, and came in ahead of the 0.6% rise expected. \n* U.K. antitrust officials said they could call on Facebook Inc. to unwind its acquisition of Giphy, a provider of popular animated images, after provisionally finding that the deal would harm competition between social-media platforms and in the display advertising market.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices**\n* Chipotle (CMG) target raised by Piper Sandler from $2100 to $2235 at Overweight. Stock currently around $1875\n* Deckers Outdoor (DECK) target raised by the UBS Group from $470 to $540 at Buy. Stock currently around $430\n* Nvidia (NVDA) with three target raises. Stock currently around $198\n   * UBS Group from $184 to $230 at Buy\n   * Wells Fargo from $219 to $245 at Overweight\n   * Evercore ISI from $187.5 v $250 at Outperform\n* Maravai Lifesciences (MRVI) target raised by Morgan Stanley from $54 to $62 at Overweight. Stock currently around $55\n* Synopsys (SNPS) target raised by Wells Fargo from $310 to $325 at Overweight. Stock currently around $292\n\n“To Bear Trials with a Calm Mind Robs Misfortune of its strength and burden.” — Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, August 12, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p391q5/here_is_a_market_recap_for_today_thursday_august/",
        "created": 1628831645.0
    },
    {
        "author": "k1yo2-purl-all-k",
        "created_utc": 1628621216,
        "id": "p1vkeh",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hello Canadian Investors,\n\nI am looking for some advice here...\n\nBackground: \nI completed my undergrad back in 2017 and got a full time job to save money for grad school. Then I put most of that money in my TFSA. The Canadian TFSA was mostly weed stocks, and I didn't cash out during the weeks leading up to legalization. Live and learn. Today I'm down 40% on it, hoping one day it will come back up.\n\nNow, the good part. I also bought several American stocks, namely Tesla, Apple, Nvidia and lately Moderna and BioNTech. I just graduated from grad school and I'm already working in my field making 25$/hr, 70$/hr as of October. \nMy American TFSA is up 150% and if I sell everything I can pay off a student line of credit I got through my bank. \n\nHere's why I'm looking for advice: \n- Any interest from that sLOC isn't tax deductible because it isn't considered a student loan. \n- Interest rate on the LOC is 4%. Profit rate on the TFSA is higher than that for sure, but it's a gamble.\n- I haven't seen my American TFSA go above 155%, which is why I'm inclined to sell everything and reduce my student debt considerably. \n- I could hold and use the TFSA for a down payment on a house in a couple of years, and just pay my LOC with money that comes in through work. \n\n\nWhat is the most sensible thing to do here? \na. Sell it all/pay off debt/rebuild the TFSA as new money comes in.\nor\nb. Hold/pay off LOC as new money comes in? \n\nI know we can't predict the market, and I figured I could ask here in case there's something else I should consider before making a decision.\n\n\nThanks for reading and sorry for the formatting, I'm on mobile.",
        "subreddit": "CanadianInvestor",
        "title": "Cash out TFSA to pay off student LOC?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/p1vkeh/cash_out_tfsa_to_pay_off_student_loc/",
        "created": 1628650016.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629055108,
        "id": "p4ztl6",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4ztl6/historical_post_earnings_moves_mega_compilation/",
        "created": 1629083908.0
    },
    {
        "author": "nugenttw",
        "created_utc": 1630100773,
        "id": "pcwvr6",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I have 1000 shares of Nvidia at $202.16 I bought in July. I thought it was going down for a few months, so I sold 10 covered calls due in mid October for $11k with a strike price of $202.5. Now the price is at $226, and I would be positive $25k if I didn't have the covered call. If the price stays the same, I'm sure I'll get executed on and make the $11k covered call premium, and nothing else. \n\nHowever, if the big crash happens before mid October and Nvidia doesn't go up until 5 years from now, I will be very upset. I was considering buying back my covered call for a $16,000 loss, and then selling Nvidia for a $25,000 gain. This would get me out of the market in case of a crash or correction so I can capitalize on the dip.\n\nIf I do this, will it count as a wash sale, and I only owe  taxes on the $9k net profit, or will I owe taxes on the gross $25k profit? \n\nThanks,",
        "subreddit": "stocks",
        "title": "Question about Taxes on Covered Calls",
        "url": "https://www.reddit.com/r/stocks/comments/pcwvr6/question_about_taxes_on_covered_calls/",
        "created": 1630129573.0
    },
    {
        "author": "thereisnospooongeek",
        "created_utc": 1628386550,
        "id": "p05ph7",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " I have been investing for the past couple of years and started with a diverse portfolio to reduce the risk factors.\n\nOver the course of years, I have done a detailed analysis of 7 companies that I believe have tremendous space to grow. I'm aware that I will be increasing the risk of my portfolio by changing from a diversified to a concentrated portfolio but I'm taking this calculated risk after spending ample time to study the same.\n\nI work in the cloud and IoT space and I understand the business quite well. It is also easier to track and I will be able to attend all the investor calls and track them very closely. The below snapshot is my current portfolio and I'm planning to do the allocation as mentioned below.\n\n1. Cloud: $NET -20%\n2. Finance $SQ - 15%\n3. Clean Energy $ENPH -15%\n4. eCommerce $SE- 15%\n5. Cloud $DDOG - 15%\n6. Semiconductor $NVDA - 10%\n7. EV $TSLA - 10%\n\nI could be biased since I have picked these stocks after a detailed analysis. I would like to understand more and get some feedback about this rebalancing strategy. I have been holding all of the above stocks for more than 1 year and it's been working great for me.\n\nPlease share your thoughts.\n\nCurrent Portfolio looks like this:[https://imgur.com/a/yK8aQhY](https://imgur.com/a/yK8aQhY)",
        "subreddit": "stocks",
        "title": "Seven Horses: Diverse portfolio to concentrated high conviction portfolio. Your thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/p05ph7/seven_horses_diverse_portfolio_to_concentrated/",
        "created": 1628415350.0
    },
    {
        "author": "cclagator",
        "created_utc": 1629052259,
        "id": "p4yyb7",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was higher by about 0.7%, in line with the 0.8% expected move options were pricing.\n\n**This Week – SPY** options are once again pricing less than a 1% move (in either direction) for the upcoming week. With the SPY around $445 that corresponds to about **$442** as a *bearish expected move* and **$449** as a *bullish expected move*.\n\n**Implied Volatility** – The VIX was lower on the week, closing around 15.50. That is below its historical average and index/etf expected moves for the next week are tight as a result. The futures curve is upward sloping with December VIX futures around 22.\n\n**Expected Moves for This Week** (via Options AI):\n\n* SPY **0.7%**\n* QQQ **1%**\n* IWM **1.7%**\n* DIA **0.9%**\n\n&amp;#x200B;\n\n### In the News\n\nRobinhood (HOOD) was down about $5 last week. Options were pricing about an $8 move. As is often the case with meme stocks option implied volatility falls when the stocks go lower. HOOD has been no exception. Weekly at-the-money options started last week about 155 vol. The weeklies for this week are around 115 vol. Options were pricing about a 15% move last week. This week they are pricing about an 11% move:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qu59wp9mekh71.png?width=565&amp;format=png&amp;auto=webp&amp;s=4a51ad69536d9442e7ffdeb824397fd0b52442e5\n\n&amp;#x200B;\n\n### Expected Moves for Companies Reporting Earnings\n\nSome earnings of note this week include Nvidia, Cisco, Home Depot and Target. Links go to the Options AI Calendar which is free to use and you can search for other stocks of interest.\n\nTuesday\n\n**Home Depot** HD / [Expected Move: **2.8%**](https://tools.optionsai.com/earnings/HD) / Recent moves: -1%, -3%, -3%\n\n**Walmart** WMT / [Expected Move: **3%**](https://tools.optionsai.com/earnings/WMT) / Recent moves: +2%, -6%, -2%\n\nWednesday\n\n**Target** TGT / [Expected Move: **4.5%**](https://tools.optionsai.com/earnings/TGT) / Recent moves: +6%, -7%, +2%\n\n**Lowe’s** LOW / [Expected Move: **4%**](https://tools.optionsai.com/earnings/LOW) / Recent moves: -4%, -8%, 0%\n\n**TJ Max** TJX / [Expected Move: **3.3%**](https://tools.optionsai.com/earnings/TJX) / Recent moves: -1%, +2%, -5%\n\n**Nvidia** NVDA / [Expected Move: **4.8%**](https://tools.optionsai.com/earnings/NVDA) / Recent moves: -1%, -8%, 0%\n\n**Cisco** CSCO / [Expected Move: **3.3%**](https://tools.optionsai.com/earnings/CSCO) / Recent moves: +1%, -3%, +7%\n\nThursday\n\n**Macy’s** M / [Expected Move: **8.6%**](https://tools.optionsai.com/earnings/M) / Recent moves: +4%, +2%, +1%\n\n**Applied Materials** AMAT / [Expected Move: **4.5%**](https://tools.optionsai.com/earnings/AMAT) / Recent moves: -1%, +5%, +4%\n\nFriday\n\n**Deere** DE / [Expected Move: **3.7%**](https://tools.optionsai.com/earnings/DE) / Recent moves: +1%, +10%, -2%",
        "subreddit": "options",
        "title": "Expected moves this week, SPY, HOOD, earnings from NVDA, CSCO, TGT, HD and more",
        "url": "https://www.reddit.com/r/options/comments/p4yyb7/expected_moves_this_week_spy_hood_earnings_from/",
        "created": 1629081059.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1629922215,
        "id": "pbjalm",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, August 25, 2021**\n\nStocks continued their momentum, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) once again reaching intraday record highs. It seems market participants have looked past the Federal Reserve’s July meeting minutes, which included language signaling that tapering may begin sooner rather than later, and continue to digest Q2 record-breaking earnings season and new developments coming out of Washington D.C. Looking ahead, market participants await Fed Chair Jerome Powell annual Jackson Hole speech, scheduled this Friday morning.\n\nThis earnings season has been a smashing, record-breaking success. 91% of companies in the SPY have reported, with 87% of those outperforming estimates in revenue. The blended, year-over-year earnings growth rate is an eye-popping 85.1%, absolutely smashing original estimates of 66.5%. What is most remarkable is this comes among a resurgence of coronavirus cases due to the delta variant, supply-side disruptions, and labor market imbalances in the US. \n\nUS Crude oil prices continued gaining, building on advances after recently hitting a seven-day consecutive losing streak. West Texas intermediate crude oil rose by nearly 3% on Tuesday to settle at $67.54 a barrel. Brent crude, the international standard, also gained to top $71 per barrel.\n\nEnergy prices gained as optimism mounted over a pick-up in consumer mobility following the full FDA approval of Pfizer's coronavirus vaccine. U.S. crude oil prices have so far risen 39% for the year-to-date.\n\nYesterday, The House of Representatives voted to adopt a $3.5 trillion budget resolution, taking a major step toward enacting President Biden’s ambitious economic agenda that calls for increased spending on education, health care and renewable energy. The 220-212 vote, which fell along partisan lines, was originally delayed after a group of moderate Democrats said they would not approve the budget until the infrastructure bill was voted on. \n\nFollowing the vote, House Speaker Nancy Pelosi said, “Passing an infrastructure bill is always exciting for what it means in terms of jobs and commerce in our country.” President Biden thanked every member of the House, saying, “There were differences. Strong points of view. They’re always welcome. What’s important is that we came together to advance our agenda.”\n\nFederal Reserve's virtual Jackson Hole Symposium, which kicks off on Thursday. After last week's July Federal Open Market Committee meeting minutes came off as more hawkish than many market participants were expecting, more clues on the path forward for monetary policy remain a key focal point. Namely, traders are looking to see whether central bank officials signal when they will announce and implement tapering of pandemic-era quantitative easing.\n\n**Highlights**\n\n* Mortgage applications unexpectedly rose, according to data from the Mortgage Bankers Association. Overall applications were up 1.6% during the week ended August 20, following a drop of 3.9% during the previous week. Home purchases led the advances, with these rising 3% week-on-week on a seasonally adjusted basis to reach the highest level since early July.\n* Western Digital (WDC) is in advanced talks to merge with Japanese semiconductor company Kioxia in a deal valued roughly $20 billion.\n* Shares of Nvidia (NVDA) continued absolutely beasting, which makes me so happy. As I have said before, NVDA is by far my favorite stock in the market.\n* President Joe Biden called cybersecurity a \"core national security challenge\" in a meeting with leaders from Silicon Valley, the water and energy sectors, the banking and insurance industries and academic institutions on Wednesday to discuss [shoring up the nation's cybersecurity.](https://www.cnn.com/2021/05/12/politics/cybersecurity-executive-order/index.html) IMO cybersecurity stocks are a great place to look into for future value.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Advance Auto Parts (AAP) with a host of target raises. Average price target $240 at Outperform. Stock currently around $212\n* Affirm (AFRM) target raised by Bank of America from $71 to $82 at Buy. Stock currently around $72\n* Best Buy (BBY) with two target raises. Stock currently around $121\n   * Jefferies Financial from $136 to $145 at Buy\n   * Telsey Advisory Group from $140 to $150 at Outperform\n* Digital Realty Trust (DLR) target raised by Barclays from $177 to $178 at Overweight. Stock currently around $159\n* Intuit (INTU) with a host of target raises. Average price target $650 at Buy. Stock currently around $557\n* Marvell Technology (MRVL) target asied by Susquehanna from $64 to $72 at Positive. Stock currently around $63\n* Pinduoduo (PDD) target raised by Bank of America from $143 to $148 at Buy. Stock currently around $97\n\n“It is the mark of an educated mind to be able to entertain a thought without accepting it” - Aristotle",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, August 25, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pbjalm/here_is_a_market_recap_for_today_wednesday_august/",
        "created": 1629951015.0
    },
    {
        "author": "IAmPattycakes",
        "created_utc": 1629734865,
        "id": "pa2y1x",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Hey all, I’m just some tech nerd who likes to dabble in investing and \"investing.\" However, there is a company that I’m interacting with that, frankly, I’m surprised hasn’t blown up higher than they are. Figured I’d share it on a much more popular place, because I think it deserves a little love. \n\nAmbarella ($AMBA) is a somewhat small (3.4B market cap as of writing this) semiconductor company that seems to be very focused on creating the best computer vision processors out there. They also make really good, normal application processors that have fantastic video processing capabilities. I've gotten my hands on them a bit, not as much as I would like, but I see some promise in their new stuff and think they're undervalued. \n\n# Competition:\n\nBasically if you think of AI vision processing you probably have the one behemoth in mind: Nvidia. How the hell is this company that's worth 1/200th of Nvidia going to compete? Well it comes down to architecture. Nvidia slams the same design from their top end A series card to their lowest end GPU, designed for hardcore parallel processing like you would expect a GPU to be. This works for sure, but it is inefficient for pure vision processing, compared to a purpose built processor. Ambarella can do stereoscopic vision processing in their highest end processor in a silicon die that's probably at least 5x smaller than Nvidia's highest end processor, at likely significantly less cost too. That's a big deal for both power efficiency, and pure cost. \n\nAMBA is also one of two companies that has an AI vision and video processing API with AWS. I bet you can guess the other one. That's great for developers to get used to the ecosystem, and easy access to new talent that may be able to bring their employer in. \n\nI am unaware of any other company that has nearly the level of ability in their processors for computer vision. With the constant increase of self driving startups out there, I can only imagine that AMBA playing at the top of the field alone will be huge, as not every single company can afford hundreds of millions to design their own silicon, like Tesla did after moving away from NVDA. \n\n# Catalysts:\n\nAMBA is holding their earnings one week from now, August 31st. This will be the first earnings that they are going to have been working with ARVL and KeepTruckin. KeepTruckin handles 90,000 drivers in the US currently, and ARVL has at least 10k sales planned in the future. I’ll let those people talk more about what’s going on there, I’m not up to date with the car manufacturer space and I’m pretty sure that they were a meme stock at some point, so they’ll probably go crazy talking about all their sales that I’m hoping they get. \n\nHaving more customers as a semiconductor company creating products on high end process nodes is *basically free* when you’re running in lower quantities. Why? How? Well it just comes down to the massive non-recurring costs in semiconductor manufacturing. This is something the semiconductor people know well, but I’ll give a rough outline for those of you not in the know. Manufacturing silicon on the most cutting edge nodes is insanely expensive, even if you’re just wanting to produce one single die, you’re spending tens, or hundreds of millions of dollars just to make the patterns to make your chip. For TSMC 7nm it’s likely in the hundred to hundreds of millions of dollars that you have to spend once. Every single wafer you buy gets made with those patterns. Each wafer costs money of course, but each one pales in comparison to the amount you spend in the actual photomasks to make your chips.\n\nIf they end up selling more chips, the NR costs get spread out over more, allowing either more competitive pricing if they want, or just more profit. With what is probably 100k of their top end chip sales public, that's a big deal for AMBA as each of their chips costs probably ~$50 to make, and probably sells for significant multiples of that. They are also definitely selling many more than that in more low-end devices like security cameras and action cameras, but that's not the high end flashy cool tech so I'm not gonna bore everyone with that. \n\n# Future: \n\nThis is more of a \"what I see and what I want\" kinda section. I'm very much an outsider, and it's very hard to get any word from the company, so everything here should be taken with a grain of salt. \n\nI can definitely see AMBA upping their software friendliness and taking a page out of Nvidia's book and making a Jetson competitor. As I said in the title, they're a very quiet company. I would have never heard about them had I not been working with building software for action cameras. Getting their products and software into the hands of real developers to create products with their chips, regardless of if they sell 100 or 100k would be good for sales directly, and massive for brand recognition. AMBA is competing directly with custom silicon, like what's in Tesla, Waymo in my opinion, and if they can get a good enough product that it's worth these big companies not spending hundreds of millions to make their own silicon and instead just using the CV2 processor or whatever comes next, that's be great. I'm seeing the same thing that happened way back in the 90s with companies that had their own custom processors just moving to Intel or AMD because it just didn't make sense to spend the money designing and building their own processor when they could just use someone else's. If AMBA could become the Intel or AMD of computer vision, that's be pretty huge. \n\n## Position and plan\n\nWhat am I planning on doing? Well, hodling my 100 shares. I’m no rich man, and frankly although I think this earnings will be fantastic, good news isn’t always correlated with good stock price. So dumb shares it is, no options or anything. ",
        "subreddit": "smallstreetbets",
        "title": "$AMBArella, the quiet computer vision company",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/pa2y1x/ambarella_the_quiet_computer_vision_company/",
        "created": 1629763665.0
    },
    {
        "author": "IComeToWSBToLaugh",
        "created_utc": 1628527248,
        "id": "p155cn",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Greetings!\n\nHave you ever felt bored of FAANG being hyped by millennials and Gen X ?\n\nWell fear no more, for this is the new FAANG\n\nA sexy mix of e-commerce, AI, chips + processors, tv + streaming monetization, EV manufacturing, future healthcare and internet software.\n\nS - Shopify\n\nP - Palantir\n\nA - AMD\n\nR - Roku\n\nT - Tesla\n\nA - Amazon\n\nN - Nvidia\n\n&amp;#x200B;\n\nP - Pacific Biosciences\n\nA - Alphabet Inc\n\nC - CRM Salesforce\n\nT - Teladoc\n\n&amp;#x200B;\n\nThe SPARTAN PACT\n\n&amp;#x200B;\n\nAnd if that seemed too boring, here is the more degenerate version:\n\nAdditional fintech, dying companies, healthcare, gaming, monetization of made up money trading, EV and alternate energy.\n\nS - Shopify\n\nP - Palantir\n\nA - AMD\n\nR - Roku\n\nT - Tesla\n\nA - Amazon\n\nN - Nvidia\n\n&amp;#x200B;\n\nP - Pacific Biosciences\n\nA - AMC\n\nC - CRM Salesforce\n\nT - Teladoc\n\n&amp;#x200B;\n\nG - Google\n\nG - Gamestop\n\n&amp;#x200B;\n\nC - Coinbase\n\nC - Clover Health\n\nC - Crispr Therapeutics\n\nC - Clean Energy\n\nX - Xpeng\n\nX - XL Fleet\n\n&amp;#x200B;\n\nThe SPARTAN PACT GG 420\n\n&amp;#x200B;\n\n(Whoever comments that 420 is CDXX is anti-vax unironically, checkmate)",
        "subreddit": "stocks",
        "title": "Forget FAANG, here is the SPARTAN PACT &amp; SPARTAN PACT GG 420",
        "url": "https://www.reddit.com/r/stocks/comments/p155cn/forget_faang_here_is_the_spartan_pact_spartan/",
        "created": 1628556048.0
    },
    {
        "author": "SHTOINKS191",
        "created_utc": 1628581720,
        "id": "p1kmk7",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I am sitting here preforming my nightly Tendies analysis of different stocks and I believe I have found the perfect storm.  I am entering into a position tomorrow.  The due diligence below is my personal opinion and is by no means financial advice. \n\nT (Technical Analysis): The ticker has clearly broken above the EMA and the 50 day moving average. The MA appears to be curling pretty quickly in the upward direction, along with a close at the average last Friday and a clear bounce upwards yesterday.  I believe that if we can break above the 14.80-15.00 range that the stock will be quickly headed towards 25.20 (ATH), if that happens to break then there is a good chance this continues to go parabolic.   To cap it off, all of this has occurred with MUCH higher than average volume, signaling that this is most likely a legit break out. \n\n&amp;#x200B;\n\nE (EV):  The EV space has been absolutely HOT recently.  Given the recent runs up for TSLA and the LCID IPO, there is a lot of attention in this sector for good reason.   With a very high barrier to entry in electric charging, MVST sits far ahead of its competition.  They are focused on fast charging, which is what is needed before the globe transitions to all electric vehicles.  In my opinion, it would be smart for Tesla to look into buying this company out to further their transition into a future energy business of the world.  Charging stations will replace all your local Shell gas stations in the future, mark my words. \n\n&amp;#x200B;\n\nN (News): This one is pretty simple, the infrastructure bill  is expected to be passed any day now.  This bill may include up to 85 billion for the charging companies.  Putting this large number aside, it is a sign that further is to come in the future and that instead of credits towards cars specifically, there may be more money going towards the charging end.  \n\n&amp;#x200B;\n\nD (Downside): With pretty heavy support around $9 this represents a downside of approximately 30%.  However, with the electric industry bound to be over a trillion dollar industry (in my opinion), this represents a very high upside for both the short term and the long term.  If the stock does happen to reject at its all time highs, then this would still be a much better risk to return ratio.  Anyways, you really thing Microvast at a 4.1 billion dollar valuation is fair compared to Nikola who may potentially go bankrupt?\n\n&amp;#x200B;\n\nI (Innovation):  There is not much to say here.  Its fucking electric.  \n\n&amp;#x200B;\n\nE (Earnings): There is little word on earnings and I do not want to make any predictions that I cannot 100% confirm.  I know that there has been rumor about them releasing their earnings report very very soon and I bet this stock could run up on this rumor and into the eventual date.\n\n&amp;#x200B;\n\nS (Short Interest): The most recent short interest report I have seen shows the short interest to be around 9%, but some have rumored for it to be much higher.  With more and more interest in the stock, it is bound that some better numbers will start to come out soon.  I don't think the institutions want these numbers out, because they know what we will do.  Even putting short squeeze potential aside, this is an ACTUAL company with tons of growth ahead.  Remember when NVDA had market caps of 50 billion?  EV is the next round of innovation to come.  \n\n&amp;#x200B;\n\nDo with this info as you wish and do not make your decision based on me, I may be falling asleep as I write this.  I will see you all at market open.  Cheers and goodnight.",
        "subreddit": "wallstreetbets",
        "title": "MVST Tendies Analysis (DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1kmk7/mvst_tendies_analysis_dd/",
        "created": 1628610520.0
    },
    {
        "author": "AnonCrip",
        "created_utc": 1629009137,
        "id": "p4og2d",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I wanna know your guys thoughts on earnings this week. Specifically Walmart, target, roblox, and Nvidia. In the past year, walmart and target started at close prices but target surged and did well executing. Do you guys think walmart could make a comeback of sorts and do well on earnings? Also, do you guys think target will continue their good work and do well? Nvidia? It's been doing well and it should be doing better than amd, which is doing great. And roblox, it's new but could it move on earnings? I wanna make some earnings plays this week let me know your guys thoughts! Thanks",
        "subreddit": "StockMarket",
        "title": "Thoughts on earnings this week?",
        "url": "https://www.reddit.com/r/StockMarket/comments/p4og2d/thoughts_on_earnings_this_week/",
        "created": 1629037937.0
    },
    {
        "author": "snkbrdng",
        "created_utc": 1627931303,
        "id": "owlglg",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Ok idiots listen up AMD is now headed to $269 before EOY.\n\nHere is why:\n1) Intel is getting pantsed by AMD\n2) NVDA is the benchmark stock for AMD to compare against\n3) XLNX merger closes in November (potentially earlier)\n\nFor you non nerds: Smart Intel engineers went to go to work for Facebook, Amazon, Google, Tesla. The idiots that remained screwed up massively over the last 2 years getting ready for the next generations of chips.\nSemiconductor manufacturing is complicated and takes 3 years to work out the kinks on the new technology. TSMC is good and Intel sucks. This will continue for 2-3 more years minimum.\n\n\n1.AMD revenue growth. Last week announced 99% yearly growth. Still room to grow after pulling down Intel’s pants (10% market share for EPYC today, every cloud and enterprise customer is now validating EPYC).\n\n2. NVIDIA is run by the Elon Musk of the semiconductor industry. Jensen has been CEO longer than all the other semiconductor CEOs combined (Internet+Broadcom+Qualcomm+AMD+TSMC+AMD). NVDA earned their 94 p/e. Whose next? AMD\n\n3. Big players are arbitraging XLNX acquisition. Once this selling pressure disappears (presumably around merger closing) it’s gonna rip.\n\nAt the end of this (rev growth, reduced selling pressure, P/E matching NVDA today) AMD will be at $269.",
        "subreddit": "wallstreetbets",
        "title": "AMD Target Price $269 DD 8/2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/owlglg/amd_target_price_269_dd_82/",
        "created": 1627960103.0
    },
    {
        "author": "KodKodKO",
        "created_utc": 1628766884,
        "id": "p2xplx",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": " \n\nTaking Druckenmiller's approach, if you had to go5️⃣stocks for5️⃣years, what would you hold?  \nNo F̶A̶A̶N̶G̶M̶  \n☁🔐 : [$NET](https://twitter.com/search?q=%24NET&amp;src=cashtag_click)  \n💻🎮 : [$NVDA](https://twitter.com/search?q=%24NVDA&amp;src=cashtag_click)  \n💸🏛 : [$SQ](https://twitter.com/search?q=%24SQ&amp;src=cashtag_click)  \n📦📭 : [$SE](https://twitter.com/search?q=%24SE&amp;src=cashtag_click)  \n☁📲📼 : [$TWLO](https://twitter.com/search?q=%24TWLO&amp;src=cashtag_click)  \nHonorable mention - ⚡🚗: [$TSLA](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click)  \n\\*too early to pick 🧬?\n\nYour5️⃣for5️⃣?  \nmaybe 🔟 for 🔟?",
        "subreddit": "wallstreetbets",
        "title": "5️⃣stocks for5️⃣years",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2xplx/5stocks_for5years/",
        "created": 1628795684.0
    },
    {
        "author": "Groovy-Tony",
        "created_utc": 1628523959,
        "id": "p1424x",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Looking at buying some options call today leading up to Nvidias upcoming earnings announcement on Aug 18th. Considering ITM calls 39 days out for an expiry on 9/17, strike price of $202.50. I'm curious if anyone else has played Nvidia options in the past,  and how the the stock performed leading up to and after earnings.",
        "subreddit": "options",
        "title": "Nvidia Options leading up to earnings",
        "url": "https://www.reddit.com/r/options/comments/p1424x/nvidia_options_leading_up_to_earnings/",
        "created": 1628552759.0
    },
    {
        "author": "Triple_Theta",
        "created_utc": 1628103328,
        "id": "oxzlpe",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "\n$218 Friday, options should be worth $13/per\n\nThese Market leaders need to rotate, taking turns driving higher.   NVDA already had a pullback from its highs a few days ago, momentum is returning.\n\nInstead of fomoing into AMD, this is a better entry.",
        "subreddit": "options",
        "title": "NVDA 205c 8/6 @ 1.20",
        "url": "https://www.reddit.com/r/options/comments/oxzlpe/nvda_205c_86_120/",
        "created": 1628132128.0
    },
    {
        "author": "JamesFBaker",
        "created_utc": 1628607607,
        "id": "p1qwnz",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I am still very bullish on semiconductors and have been buying AMD (and later TSMC) for quite some time. After the recent run in AMD I sold a part of my position, figuring it might cool off and I could take some profits. While I was thinking about where I wanted to reinvest I started to think about Nvidia which became quite interesting after their recent split. I kinda also wanted ASML and finally did some DD on Intel (Intel could go either way). At this point I figured, I might as well just buy a semiconductor ETF and play it safe. Year to date TSMC and AMD were both outperformed by VanEck Vectors Semiconductor UCITS ETF (VVSM) anyway, so I would have made more if the same amount of cash would have gone in the ETF. The ETF has a 0.35% fee so I should keep that in mind. And yes, YTD NVIDIA and ASML were the better choice, but I've been in AMD a bit longer and TSMC might have been a bad choice (bought in february). \n\nI see three options next (10+ year investment horizon + DCA for these):\n\n1. Invest in TSMC, AMD, NVIDIA, ASML and let them ride. \n\n2. Play it safe and go for the ETF that consists of 10.8% NVIDIA, 10.5% ASML, 9.3% TSMC, 8.7% Intel, 6.11% AMD and a bunch of others (25 positions total) in the same sector. \n\n3 A bit more risk/reward: pick a potential winner and go all in with either NVIDIA, ASML or AMD. \n\nSo what would you do? And did you experience the same in another sector where your portfolio was basically becoming an ETF, what did you do?",
        "subreddit": "stocks",
        "title": "When a portfolio becomes an ETF, should you just go for the ETF?",
        "url": "https://www.reddit.com/r/stocks/comments/p1qwnz/when_a_portfolio_becomes_an_etf_should_you_just/",
        "created": 1628636407.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "created_utc": 1627971659,
        "id": "owxhxu",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "\n\nSHANGHAI, Aug 3 (Reuters) - China's regulatory agency is launching an investigation into chip distributors in the auto industry, citing suspicions of price gouging, it said on Tuesday.\n\nThe action by the State Administration For Market Regulation (SAMR) is the latest in a regulatory crackdown following a range of companies and industries targeted over the past year as the Chinese government clamps down on industry.\n\n\"In response to prominent problems such as speculation and high prices in the automotive chip market, the State Administration of Market Supervision has recently filed an investigation on car chip distributors,\" the agency said.\n\nThe firms were suspected of driving up prices, based on price monitoring and reporting clues, it added in its statement, and vowed to investigate and punish illegal acts such as hoarding, price-gouging and collusion.\n\nA global shortage of chips that began last December has disrupted supply chains and the hardware sector worldwide. Though initially concentrated in the automotive sector, it has since spread to affect a wide range of gadgets.\n\nPanic about supply uncertainty has occasionally led chip buyers and distributors to purchase more chips than they need, creating a vicious cycle that further drives up prices.\n\nIn June, the chief executive of chipmaker Intel said he expected the shortage to hit bottom by year-end, with the market retuning to normalcy only by 2023.\n\nIn April China's regulator imposed a record fine of $2.75 billion on e-commerce giant Alibaba for engaging in anti-competitive practices.\n\nhttps://www.reuters.com/technology/china-regulator-investigate-auto-chip-distributors-suspicion-price-gouging-2021-08-03/\n\n**Ok, this is getting a bit out of hand. A constant barrage of bearish news coming out of China after some stabilizing that happened at the end of last week. Not sure what the endgame here is for China or the CCP. On one hand, it makes no sense for them to lose the confidence of foreign investors with moves like this. Are they pushing the boundaries of patience of investors? Or is this a deliberate attempt to crackdown on each sector one by one?**\n\n*Stocks likely to be affected by this: AMD, INTC, QCOM, NVDA. If you know some others that are a part of the cars in China, please post them in the comments*",
        "subreddit": "investing",
        "title": "China regulator to probe auto chip distributors over price-gouging suspicions",
        "url": "https://www.reddit.com/r/investing/comments/owxhxu/china_regulator_to_probe_auto_chip_distributors/",
        "created": 1628000459.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1629060777,
        "id": "p51jh6",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More**\n\n&amp;nbsp;\n\nWhat’s poppin’ bull gang, Flux here with your weekly Historical Post Earnings Moves spreadsheet! Last weeks theme was selling options, and boy did we sell! **$APPS short strangles returned close to 100%, with $BIDU following closely behind netting around 80%. Meme stocks also had muted volatility. I sold an $AMC 34 strangle for $630, and although I closed early, I was given the opportunity to close it out at the end of the week for mere pennies on the dollar. Last but not least, a long strangle on $UPST would’ve netted you a whopping 460% return!** Unfortunately for us, earnings season is slowly coming to a close, meaning the quality of our plays will be diminishing greatly! Those looking to trade this week should proceed with caution, as there isn’t much of an edge to be gained this time round. If you wish to track my trades and try them out for yourself, feel free to check out the community links on my profile! Let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **This week is an awful week to play earnings.** Most companies are low quality, and don’t have historically big moves. Options are also priced properly in most cases, meaning there isn’t much edge to be gained on the buy side or the sell side. It’s literally all just gambling, and as a result I’m probably gonna sit this week out entirely. Pay little attention to the sample plays below, as I’ve only included them for inspiration, and in case anyone sees something I may have missed.\n\n&amp;nbsp;\n\n- **Selling $DNUT puts may prove to be profitable.** Although justified, Krispy Kreme has been on a downtrend since its IPO. $DNUT is literally hemorrhaging money and fundamentally the company is a terrible investment. A couple of years ago they actually went private after defrauding investors, doing shady audit practices, and literally using company money to buy back stores owned by family members of the executive board for FIVE TIMES what they were worth. More info on that [here.](https://www.cfo.com/risk-compliance/2009/03/three-krispy-kreme-ex-execs-settle-sec-charges/) Nowadays, the stock is priced as what it is - a fraudulent, cash burning business. Earnings is priced to fail, and as a result, any semblance of positive news will likely send us going upwards. If you have the balls, selling puts may prove to be profitable. The 15P is going for $0.80 giving you a breakeven of around 5.5%. You can even pickup pennies in front of the steamroller and sell the 12.5P for $0.05, giving you a breakeven of 17%. Everyone is expecting $DNUT to fail, so if we get even a smidge of positive news, we’re going up.\n\n&amp;nbsp;\n\n- **$CSCO options are inefficiently priced.** This is literally the only pricing inefficiency at the time of writing. Options are pricing a 2% move, while historically Cisco moves around 5%. Given that prices remain the same or get cheaper by earnings, a strangle should net you some nice profits. If you’re poor or want a binary directional play, I’d look to buy puts. $CSCO is at ATHs so we’re probably gonna do the classic “dump after earnings regardless of the outcome“ thing that everyone seems to get tricked by. Regardless, at the time of writing, $CSCO strangles give us nice edge.\n\n&amp;nbsp;\n\nAll that being said, there aren’t many trades to run this time round! If I notice anything extra during this week, I’ll look to keep you guys posted on my socials. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out my Twitter or Discord! Links can be found in the sheet or on my profile.\n\n&amp;nbsp;\n\n---\n\n#Summary and Conclusion\n\nAll in all, pretty awful week for trading. Most tickers are complete garbage, and there’s little edge to be gained among those that aren’t. No shame in sitting this one out! That being said, if you see any appealing plays I’ve missed, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1e4dnc6QvdsztXrn41DBf1ycFdfcaP37pdW87wVsypSQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 6) - $RBLX, $NVDA, $WMT, $HD, $CSCO, $TGT, $LOW and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p51jh6/historical_post_earnings_moves_mega_compilation/",
        "created": 1629089577.0
    },
    {
        "author": "kribz666",
        "created_utc": 1629162240,
        "id": "p5tgrb",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "# Utilities\n\n[$CWCO](https://earninngs-watcher.tech/#/company?symbol=cwco) release on 2021-08-17 - Market cap: 194M$ - average movement around earnings 3.6%\n\n# Consumer Cyclical\n\n[$HD](https://earninngs-watcher.tech/#/company?symbol=HD) release on 2021-08-17 - Market cap: 329B$ - average movement around earnings 2.7%\n\n[$TJX](https://earninngs-watcher.tech/#/company?symbol=TJIX)release on 2021-08-17 - Market cap: 78.6B$ - average movement around earnings 4.8%\n\n# Healthcare\n\n[$PINC](https://earninngs-watcher.tech/#/company?symbol=PINC) release on 2021-08-17 - Market cap: 4.27B$ - average movement around earnings 8.6%\n\n[$TLGT](https://earninngs-watcher.tech/#/company?symbol=cwco) release on 2021-08-17 - Market cap: 56M$ - average movement around earnings 11.1%\n\n# Industrials\n\n[$NDSN](https://earninngs-watcher.tech/#/company?symbol=NDSN) release on 2021-08-17 - Market cap: 12.9B$ - average movement around earnings 4.4%\n\n[$SMED](https://earninngs-watcher.tech/#/company?symbol=smed) release on 2021-08-17 - Market cap: 198M$ - average movement around earnings 12.2%\n\n# Technology\n\n[$NVDA](https://earninngs-watcher.tech/) release on 2021-08-17 - Market cap: 460B$ - average movement around earnings 6.1%\n\n[$ADI](https://earninngs-watcher.tech/) release on 2021-08-17 - Market cap: 62.1B$ - average movement around earnings 4.2%\n\n[$SNPS](https://earninngs-watcher.tech/) release on 2021-08-17 - Market cap: 40.6B$ - average movement around earnings 4.9%\n\n# Communication Services\n\n[$SLGG](https://earninngs-watcher.tech/) release on 2021-08-17 - Market cap: 201M$ - average movement around earnings 15.7%\n\n# Consumer Defensive\n\n[$WMT](https://earninngs-watcher.tech/) release on 2021-08-17 - Market cap: 392B$ - average movement around earnings 3.0%\n\n[$JBSS](https://earninngs-watcher.tech/) release on 2021-08-17 - Market cap: 1.05B$ - average movement around earnings 12.1%",
        "subreddit": "smallstreetbets",
        "title": "All Stocks Reporting Earnings Tomorrow (by Sector and Market Cap)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/p5tgrb/all_stocks_reporting_earnings_tomorrow_by_sector/",
        "created": 1629191040.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1628619701,
        "id": "p1v23r",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "W￼ith Apple‘s iPhone typical fall launch is fast approaching, details about the device’s new capabilities have started to leak out.\n\nAs consumers and gadget fans pore over the tidbits for taste of what Apple’s (ticker: AAPL) latest pocket computetr will have in store, chip investors too are scrutinizing the trickle of information. In a Tuesday report, Bloomberg News said the new Apple phones will feature new video and camera features, a faster Apple-designed chip to power the gadget, and new screen technology. Apple will keep the same iPhone dimensions and designs as last year’s models, the report said.\n\nBased on the scarce available details, the exact makeup of the guts of the next line of iPhones is highly speculative at this point. But, investors know a few things already based on past designs and the bare-bones description. \n\nOne of the biggest changes in recent memory was the iPhone’s adoption of 5G technology, requiring a batch of new chips to support the fast uplink speed. For many phones, including Apple’s, that tended to mean much more silicon overall, which was good news for the chip makers that supply Apple with parts.\n\nFor the 5G modems themselves, the iPhone 12 contained chips made by Qualcomm (QCOM), which suggests it too will likely supply the iPhone’s 5G wireless chip—at least for now. Apple has reportedly launched its own effort to design wireless radios, so that may change in the future. The chip giant has made other chips for the iPhones such as power modules. \n\nSkyworks Solutions (SWKS) and Qorvo (QRVO) make radio-related iPhone components, too, and have both been historic suppliers. Broadcom (AVGO) also has made wireless chips and other iPhone components. Barclays chip analyst Blayne Curtis has staked Qorvo has his favorite of the batch of Apple suppliers he watches.\n\nFor the new camera, it’s possible Texas Instruments (TXN) could play a role, as it has supplied the power-management chip for previous iterations of the iPhone camera. Its chips that help with battery-charging have also been spotted in past phones.\n\nMemory-wise, according to an iFixit teardown, the last iPhone used random access memory made by Micron Technology (MU). Micron has said the 5G upgrade cycle has benefited it because new generation phones typically carry more RAM than their 4G counterparts. The iPhone 12’s flash storage was produced by closely held Kioxia Holdings, a Japanese memory maker that has been considering an initial public offering in recent months.\n\nWe know Apple is designing the chips that power its phones, and has for several generations, effectively cutting out Qualcomm from the processor part of iPhone revenue. Taiwan \nSemiconductor Manufacturing (TSM), has made the chip in the past, and it is all but certain to be making the latest iPhone processors.\n\nSource: Barron's\n\nSome of the semi stocks mentioned in this article are still worth to buy. qcom, tsm, mu, skws and qrvo are all trading between 20 to 30 pe. The revenue growth for these stocks are still attractive. With apple releasing the new iphones at September, these stocks will definitely benefit from the ongoing 5G trend.",
        "subreddit": "stocks",
        "title": "Apple Suppliers That Could Benefit New iPhone Models",
        "url": "https://www.reddit.com/r/stocks/comments/p1v23r/apple_suppliers_that_could_benefit_new_iphone/",
        "created": 1628648501.0
    },
    {
        "author": "babbldev",
        "created_utc": 1629132051,
        "id": "p5jthx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Most pessimistic tickers in last week's news (8/9-8/13):**\n\n1. $OCGN Ocugen\n2. $AAP Advanced Auto Parts\n3. $ARE Alexandria Real Estate\n4. $ETSY Etsy\n5. $AMZN Amazon\n6. $SWKS Skyworks Solutions\n7. $PTON Peloton\n8. $CMCSA Comcast Communications\n9. $BR Broadridge\n10. $CHTR Charter Communications\n11. $TXN Texas Instruments\n\n**Most optimistic tickers in last week's news (8/9-8/13):**\n\n1. $WBA Walgreens Boots Alliance\n2. $QQQ\\* Invesco QQQ\n3. $MRVL Marvell Technology\n4. $TTD Trade Desk Inc.\n5. $WFC Wells Fargo\n6. $AMD Advanced Micro Devices\n7. $D Dominion Energy\n8. $CB Chubb Ltd.\n9. $CVS CVS Health\n10. $CRO Cirralto\n11. $XRP Ripple Coin\n\n *Source: 2,534 finance articles scraped from Benzinga, YahooFinance, MarketWatch, +53 others. Tickers corresponding sentiment expressed for each ticker shown below.* \n\nhttps://preview.redd.it/05q93u7dzqh71.jpg?width=826&amp;format=pjpg&amp;auto=webp&amp;s=7f6c7e937bcbe138447398842d10431935b4216a\n\nhttps://preview.redd.it/no611w7dzqh71.jpg?width=825&amp;format=pjpg&amp;auto=webp&amp;s=fd65e4264475b022e01acdcfa3128bd8e468a8ba",
        "subreddit": "StockMarket",
        "title": "Stocks with most optimistic &amp; pessimistic sentiment in news coverage over the past week:",
        "url": "https://www.reddit.com/r/StockMarket/comments/p5jthx/stocks_with_most_optimistic_pessimistic_sentiment/",
        "created": 1629160851.0
    },
    {
        "author": "stockplanner",
        "created_utc": 1628811901,
        "id": "p3btje",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Long Afternoon Watchlist $AAPL $ABBV $ACN $AMT $BDX $BHP $CCI $SWKS",
        "url": "https://youtube.com/watch?v=SVN2kuJxETA&amp;feature=share",
        "created": 1628840701.0
    },
    {
        "author": "AthleteHuman8233",
        "created_utc": 1628527613,
        "id": "p159pk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "eToro was founded as RetailFX in 2007[11] in Tel Aviv, by brothers Yoni Assia and Ronen Assia together with David Ring.[12]\n\nIn 2010, the firm released the eToro OpenBook social investment platform, along with its CopyTrading feature, that enables investors to view, follow and copy the network's top traders automatically.[13] Later that year, the firm released its first Android app for access via mobile devices.[14]\n\nBetween 2007 and 2013, the company raised $31.5 million in four rounds of funding.[15][16] In December 2014, it raised $27 million from Russian and Chinese investors.[17] In December 2017, it joined CoinDash as partners to develop Blockchain-based social trading.[18] In 2018, it raised a further $100 million in a private funding round.[19] Overall, more than $162 million has been invested in the company by investment firms Spark Capital, SBI Holdings, Germany’s CommerzVentures, Chinese bank Ping An Insurance, Russian state-owned financial firm Sberbank,[20] Korea Investment Partners, technology-focused BRM Group, and China Minsheng Financial Holdings.[5][21][22]\n\nIn 2013, the firm introduced the capability to invest in stocks and CFDs, with an initial offering of 110 stock products.[23] The same year, it was authorized to offer its services in the UK by the FCA regulatory authority, under the subsidiary eToro UK.[24] In January 2014, the firm added cryptocurrencies to its investment instruments.[25][26]\n\nIn April 2014, the firm added 130 British and German stocks composing the FTSE 100 Index and the DAX30 indices to the company's stock selection.[27]\n\nIn 2017, it launched a CopyPortfolio feature, enabling investors to copy investment portfolios from the best-performing traders.[28]\n\nIn 2018, it launched a cryptcurrency wallet for Android and iOS.[29][30] In May 2018, it entered the US market by offering 10 cryptocurrencies:[31] In November 2018, it announced the launch of GoodDollar, a non-profit, open-source community project aimed to reduce global wealth inequality through universal basic income (UBI) using blockchain technology.[32]\n\nIn March 2019, eToro acquired Danish blockchain company Firmo for an undisclosed sum.[33][34] In October 2019, eToro released a sentiment-based crypt portfolio using AI technology to evaluate Twitter's current positive or negative impressions of digital assets.[35] In November 2019, the firm acquired Delta, a crypt portfolio tracker application company, based in Belgium.[36][37]\n\nAs of May 2020, the firm had 13 million registered accounts.[38] In March 2021, eToro announced that it is planning to become a publicly traded company through a reverse subsidiary merger with FinTech Acquisition Corp V (NASDAQ:FTCV), a Special Purpose Acquisition Company (SPAC) backed by former Bancorp CEO Betsy Z. Cohen.[39][40] The combined company will operate as eToro Group Ltd and have an implied estimated enterprise value of $10.4 billion at closing with $650 million in funding coming from private investment in public equity (PIPE) from Softbank Vision Fund 2,[41] Third Point, Fidelity Management, Wellington Management, ION Investment Group and Research Co.[42][43]",
        "subreddit": "wallstreetbets",
        "title": "What are your thoughts on Etoro?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p159pk/what_are_your_thoughts_on_etoro/",
        "created": 1628556413.0
    },
    {
        "author": "GreenTecher",
        "created_utc": 1627826865,
        "id": "ovsr1i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Most investors have probably never heard of exosomes until Codiak’s (NASDAQ: CDAK) chief exec, Doug Williams, made his pitch about this cool molecules at the JP Morgan conference two weeks ago. So for starters, let's define what is an exosome. Exosomes are extracellular vesicles (EVs) of endosomal origin that range in size between 30 and 150nm. Exosomes are secreted by a wide range of cells, since virtually all living cells utilize exosome-mediated communication. Exosomes carry cell-specific cargos of proteins, lipids, and nucleic acids that are selectively taken up by recipient cells.  In essence, these are a critical building block of organic life and have a myriad of unexplored biopharma applications.  \n\nThe cargo contained within exosomes can offer information for a wide range of diseases, therefore exosomes can also act as prognostic indicators and predictors of a patient’s response to a specific course of treatment.  Exosome-based diagnostics are minimally invasive, offering both ease-of-use and speed of detection. Numerous approaches are being researched for creating drug-loaded exosomes and they can exert powerful effects. For example, if a patient has a disease caused by a missing or defective protein or microRNA, the patient’s exosomes can be isolated, modified with the appropriate siRNA or protein, and injected back into the patient for treatment.\n\nFor these reasons, exosomes have gone from being overlooked to rapidly gaining momentum as a novel strategy for accessing the therapeutic effects of cells without the risks and difficulties of administering cells to patients.  Exosome-related technologies have been developing rapidly over the past few years. Substantial growth is expected for the market as they get highly integrated into the elite healthcare fields such as liquid biopsy, precision medicine and regenerative medicine.\n\nWithin the past 5 years, there have been at least 7 major partnership deals within the exosome industry, 8 large venture capital events, and 2 landmark acquisitions.  Today, the exosome industry is witnessing rising numbers of clinicals trials investigating exosome therapeutics and diagnostics. Here are some listed companies taking exosome science to the next level:\n\n**Innocan Pharma (CSE: INNO) (FSE: IP4) (OTCQB: INNPF) Combining Exosomes &amp; CBD**\n\nInnocan Pharma, in collaboration with a Tel Aviv university team, is developing a revolutionary cell therapy - based technology, loaded with CBD (Cannabidiol), designed to target coronavirus infected lung cells and central nervous system diseases. Innocan’s CLX Therapy holds the potential to provide a highly synergistic effect of anti-inflammatory properties and help in the recovery of infected lung cells. This product is planned to act as a \"guided missile\" to the infected lungs, combining the cell healing properties of exosomes and the anti-inflammatory properties of CBD.\n\nInnocan's CBD Loaded Exosome (CLX) Therapy project demonstrates the capability of having reliable large-scale production of exosomes and is an important milestone in the CLX Therapy development process. Innocan managed to produce trillions of exosomes in a short period of time in a 3-dimensional bioreactor, and that may lead to economic large-scale exosome production for the CLX. This achievement is expected to pave the way for larger tests and studies.  Combine its CLX program R&amp; with their established credentials as a cannabis/CBD powerhouse, and in a final evaluation this company holds a lot of long-term promise for making strong and early inroads into the exosome market.\n\n**Sarepta Therapeutics (NASDAQ: SRPT) and Codiak BioSciences (NASDAQ: CDAK)**\n\nOn June 22, 2020, Sarepta Therapeutics and Codiak BioSciences signed a global research and option agreement to design and develop engineered exosome therapeutics to deliver gene therapy, gene editing and RNA technologies for neuromuscular diseases. The engineered exosome approach offers the potential to effectively deliver genetic therapeutics without triggering the adaptive immune response. The two-year agreement includes up to five neuromuscular targets. Codiak is eligible to receive up to $72.5 million in upfront and near-term license payments plus research funding.  That equates to a lot of capital that, if invested wisely, can go back into research for the next generation of exosome studies and clinical trials.\n\n**Jazz Pharmaceuticals (NASDAQ: JAZZ) and Codiak BioSciences (NASDAQ: CDAK)**\n\nOn January 03, 2019, Jazz Pharmaceuticals and Codiak BioSciences signed a strategic collaboration agreement focused on the research, development and commercialization of exosome therapeutics to treat cancer. Codiak granted Jazz an exclusive, worldwide, royalty-bearing license to develop, manufacture and commercialize therapeutic candidates directed at five targets to be developed using Codiak’s engEx precision engineering platform for exosome therapeutics. The targets focus on oncogenes that have been well validated in hematological malignancies and solid tumors but have been undruggable with current modalities. Codiak received a $56 million upfront payment.\n\nIn sum, the companies explored above are all approaching the budding exosome industry from different angles.  Innocan’s point-of-departure is CBD and its range of applications in the biomed/pharma sectors. Likewise, Codiak, Sarepta, and Jazz are all making powermoves to determine the efficacy of exosome therapies in diverse areas such as immune disorders and hematological malignancies.",
        "subreddit": "investing_discussion",
        "title": "Emerging Bulls (INNO SRPT CDAK JAZZ) in the Biopharma Exosome Market",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ovsr1i/emerging_bulls_inno_srpt_cdak_jazz_in_the/",
        "created": 1627855665.0
    }
]