[
    {
        "author": "Karnes",
        "created_utc": 1621389765,
        "id": "nfsy3g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Boston, MA, based Investment company Whale Rock Capital Management LLC (Current Portfolio) buys Alphabet Inc, Wayfair Inc, Facebook Inc, Applied Materials Inc, Workday Inc, sells Square Inc, Tesla Inc, NXP Semiconductors NV, Match Group Inc, Zoom Video Communications Inc during the 3-months ended 2021Q1, according to the most recent filings of the investment company, Whale Rock Capital Management LLC. As of 2021Q1, Whale Rock Capital Management LLC owns 49 stocks with a total value of $12.2 billion. \n\nThese are the details of the buys and sells.\nNew Purchases: GOOGL, W, AMAT, WDAY, ORCL, TWTR, ASML, MSFT, NCNO, CPNG, XM, AFRM, ACVA, TBA, OLO, DLB,\nAdded Positions: FB, BEKE, AMZN, ZEN, TWLO, BILL, SMAR, TRIP, BILI\n\nReduced Positions: TSLA, CRWD, TSM, PENN, SE, CREE, DIS, PINS, FIVN, PTON, MELI, CVNA, MDB, COUP, SHOP, PDD, AI, DASH, ABNB\n\nSold Out: SQ, NXPI, MTCH, ZM, UBER, ZS, CRUS, EXPE, FTCH, NVDA, JD, EGHT, OKTA, SNAP, MPWR, NET, ROOT, OZON, YSG,\n\nThese are the top 5 holdings of Whale Rock Capital Management LLC\nAmazon.com Inc (AMZN) - 213,351 shares, 5.43% of the total portfolio. Shares added by 33.66%\n\nAlphabet Inc (GOOGL) - 288,966 shares, 4.90% of the total portfolio. New Position\n\nTesla Inc (TSLA) - 873,195 shares, 4.80% of the total portfolio. Shares reduced by 46.96%\n\nBill.com Holdings Inc (BILL) - 3,905,451 shares, 4.67% of the total portfolio. Shares added by 11.17%\n\nWayfair Inc (W) - 1,608,311 shares, 4.16% of the total portfolio. New Position\n\nSource:  https://www.gurufocus.com/news/1432419/whale-rock-capital-management-llc-buys-alphabet-inc-wayfair-inc-facebook-inc-sells-square-inc-tesla-inc-nxp-semiconductors-nv",
        "subreddit": "stocks",
        "title": "Whale Rock Capital adds Alphabet to its holdings - 288,966 shares (4.9% of the total portfolio), making it the second largest holding.",
        "url": "https://www.reddit.com/r/stocks/comments/nfsy3g/whale_rock_capital_adds_alphabet_to_its_holdings/",
        "created": 1621418565.0
    },
    {
        "author": "muppetonastring",
        "created_utc": 1622481111,
        "id": "np8aks",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Question about MPWR - Monolithic Power System Inc",
        "url": "https://www.reddit.com/r/StockMarket/comments/np8aks/question_about_mpwr_monolithic_power_system_inc/",
        "created": 1622509911.0
    },
    {
        "author": "Kuentai",
        "created_utc": 1619979678,
        "id": "n3cfag",
        "num_comments": 454,
        "num_crossposts": 0,
        "selftext": "tldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow\n\n&amp;#x200B;\n\nThe issues with the livestock and fishing industries have been blowing up lately, we are running out of fish and livestock is one of the leading causes of climate change. The question remains, how do we solve the problem. Some say 'do less, eat less' but I'd argue that this is anathema to humanity and obviously isn't going to work fast enough. We can solve this problem, like everything, with technology. Make something better and cheaper and the majority will follow. \n\n&amp;#x200B;\n\nThis technology exists (lab grown/clean meat) and has been hitting the front page of reddit and international press almost daily at this point. Particularly because of the recent Netflix fishing documentary and Bill Gates letter. There is currently only one way to get in on the ride as a dirty retail investor. If this interests you, get ready for a deep dive.\n\n&amp;#x200B;\n\nI've been keeping an eye on and researching the lab grown meat industry for the last few years waiting for them to solve a technical and moral problem that was holding it back (FBS). Luckily this problem has largely been solved by each lab grown meat company individually, who have each finished developing their own solutions. Making Lab Grown Meat officially (and rebranded as) 'Clean Meat' and 'Cruelty Free.'\n\n&amp;#x200B;\n\nMany of these companies are building factories and aiming for product release **by the end of the year**. Basically a metric ton of [funding](https://agronomics.im/) was handed out in 2020 once these companies solved the FBS problem, massively accelerating their progress to the market.\n\n&amp;#x200B;\n\n\n**Important Points:**\n\n[Global meat, poultry and seafood market is growing to $7.3 trillion.](https://www.grandviewresearch.com/press-release/global-meat-poultry-seafood-market)\n\n**That's a lot of money.**\n\n&amp;#x200B;\n\n[Up to 99% of meat farming in America is factory farming.](https://www.sentienceinstitute.org/us-factory-farming-estimates)\n\n**Vast majority of consumers do not care about quality, just price.**\n\n&amp;#x200B;\n\n[According to American Human's survey nearly 95% of participants are \"very concerned\" about the welfare of farm animals.](https://awionline.org/sites/default/files/uploads/documents/fa-consumer_perceptionsoffarmwelfare_-112511.pdf)\n\n**People feel guilty about it.**\n\n&amp;#x200B;\n\n[84% of vegetarians return to eating meat.](https://www.thehealthy.com/food/vegetarians-vegans-go-back-meat/)\n\n**Buuuut people want/need meat.**\n\n&amp;#x200B;\n\n[\"If 1955 beef production practices were used today, we’d need 165 million more acres of land to produce the same output.\"](https://washingtoncitypaper.com/article/200456/could-we-survive-without-factory-farming-the-low-price-of/)\n\n**Producing meat at todays consumption level ethically is impossible.**\n\n&amp;#x200B;\n\n[Animal Husbandry is the second largest contributer to human made greenhouse gas emissions and the leading cause of deforestation, water and air pollution.](https://climatenexus.org/climate-issues/food/animal-agricultures-impact-on-climate-change/)\n\n**Legislation incoming.**\n\n&amp;#x200B;\n\n[Future Meat Technologies](https://www.future-meat.com/) says [its cultured products will take up 99% less land, 96% less freshwater and emit 80% less greenhouse gases than traditional meat production](https://www.cnbc.com/2019/10/19/lab-grown-meat-could-exacerbate-climate-change-scientists-say.html)\n\n**Self reported but reasonable when taking into account future economies of scale.**\n\n&amp;#x200B;\n\nSo, what to do.\n\nPeople don't like doing less, people don't like feeling bad, solve the problem as ever with technology.\n\nWe simply skip the cow and grow the burger.\n\n&amp;#x200B;\n\n**Is there competition from Big Meat?**\n\nAs of yet, no, in fact, the opposite. Everyone knows the story of how the auto industry has been trying to crush or minimise electric cars for the last hundred years and are only recently and extremely reluctantly developing their own.\n\nNot so with the meat industry, big players have instead invested directly into the growing new industry, could there be a greater approval than multi million investment, green lit by analysts and board, from the industry you intend to displace?\n\n[https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697](https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697)\n\nBig Players supporting the tech\n\nBill Gates, Richard Branson, Founder of Google, Richard Reed (innocent drinks)\n\n&amp;#x200B;\n\n**Optimistic speculation**\n\nCurrently the tech is in infancy and producing simple produce, however there is little perceivable upper limit for the technology, want a perfect Wagyu steak for half the price of a real cheap offcut? Achievable. Exotic blends of Quail and Puffin? Why not. A Woodpecker steak the size of a small child? Let me get the extra large vat ready. As with most technologies the upper ceiling is a considerable distance away, but with the number of competitors and roughly 250 million of funding in 2020 alone, the rate of progress is blistering. It's just a matter of time.\n\n&amp;#x200B;\n\n**Problems**\n\nIck factor.\n\nSolution = Used to be 'Lab Grown Meat.' Now it's being labelled as 'Clean Meat.' Currently 99.99% of budget is spent on R&amp;D and funding as it should be. As they begin to come to market more will be spent on marketing, outreach etc...\n\nPersonally everyone I've talked to starts with the ick reaction, then shortly after admits they'd try it, then after debating the 'important points' believes in it's inevitability.\n\nCriticism of carbon footprint = solved by intentionally linking up with renewable energy sources. Vast majority of companies are in it to solve the environmental problem and will make these moves.\n\n&amp;#x200B;\n\n**The Stock**\n\n**Agronomics - ANIC**\n\nhttps://agronomics.im/\n\nAs of this post bouncing to around 28,50GBX on the London Stock Exchange.\nThis is the only method a retail investor can get into the scene, will provide shareholders with exposure to a concentrated portfolio of companies in this area. In laymans it is like a lab grown meat etf. \n\n&amp;#x200B;\n\n**Current Weighting**\n\nLinks to each company here:\nhttps://agronomics.im/portfolio/\n\n**22.67% BlueNalu**, Inc, '**Cellular Aquaculture**' Fish stocks are dwindling and riddled with mercury and various extra toxins, not to mention the huge press and documentary situation lately on overfishing etc...  Solves all of these problems. BlueNalu is currently one of the most promising of the bunch, aiming to release cultured fish to the market by the end of the year.\n\n11.55% Meatable BV, focusing on cultivated beef and pork\n\n10.53% Other alternative protein investments \n\nShiok Meats, developing cultured seafood with a focus on shrimp.\n\nOritain, data science to prevent fraud in food supply chains.\n\nLegenDairy Foods, creating real, non cruelty dairy using fermentation techniques\n\nGALY, producing cotton grown in a lab\n\nBond Pet Foods, Plant based and Cultured pet food\n\n9.71% Solar Foods Oy, growing protein using a similar method to yeast to create protein powder, ultra low cost\n\n8.70% Cash balances\t\n \n7.92% Foods United, rebranded as LiveKindly, focusing on plant-based chicken\n\n7.92% Tropic Biosciences UK Limited, Using CRISPR and other techniques to produce high performing varieties of tropical crops \n\n6.60% Vitrolabs Inc, Lab grown leather.\n\n5.67% Mosa Meats B.V., working on cultured beef burgers\n\n5.28% Supermeat the Essence of Meat, cultured chicken, available in a restauraunt in Tel Aviv\n\n3.45% Legacy portfolio\t \n\n&amp;#x200B;\n\n**Big Players in Agronomics**\n\nRichard Reed - Chairman = Might know him as the founder of Innocent Drinks, Europes largest and most environmentally sustainable juice company, sold for $600m, now focuses on VC, finding and helping early stage consumer goods companies. Working on Graze, Deliveroo and Tails.\n\t- Taking consumer goods companies and turning them into global successes is like breathing to this guy.\n\nJim Mellon - Non Executive Director = Oxford grad billionaire investor, a true believer.\n\t- Truly believes in the tech and direction, huge resources to push these companies forwards and make it a reality. Has been consistently right for decades. One of the first to see the potential of SIlicon Valley.\n \"You can play with the samples in the lab, it will be a very short amount of time till we see these products dispersed.\"\n\n&amp;#x200B;\n\n**End Notes**\n\nIf that wasn't enough, here's a quote from Winston 'fucking' Churchill\n\n“\\[w\\]e shall escape the absurdity of growing a whole chicken in order to eat the breast or wing, by growing these parts separately under a suitable medium”.\n\n[https://www.nationalchurchillmuseum.org/fifty-years-hence.html](https://www.nationalchurchillmuseum.org/fifty-years-hence.html)\n\n&amp;#x200B;\n\nWhat does it taste like?\nThe chicken tastes like Chicken apparently. The beef tastes like beef. I'm done with links, google it you lazy apes.\n\n&amp;#x200B;\n\nFinal note: This is a long term speculative tech play that if you agree with the above is the equivalent to being able to buy a piece of almost all silicon valley companies back in 2001\n\n&amp;#x200B;\n\ntldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow",
        "subreddit": "wallstreetbets",
        "title": "Clean Meat is at the brink of revolutionising the livestock and fishing industries, expected to hit the market this year. How to get in as a dirty retailer.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3cfag/clean_meat_is_at_the_brink_of_revolutionising_the/",
        "created": 1620008478.0
    }
]