[
    {
        "author": "freehouse_throwaway",
        "created_utc": 1609881296,
        "id": "kr7ze8",
        "num_comments": 181,
        "num_crossposts": 0,
        "selftext": "* The market opened slightly red but quickly reversed because JPow realized this was no way to start a New Year, with Chadsdaq and S&amp;P being propelled to green status thanks to Tim Apple and gang. DOW got further lifted by action from BA, GS, CVX, and INTC (who's really only being carried by MU). Small caps eclipsed SPX and IXIC today with RUT/IWM up as high as almost 2% during intraday high as value play starts looking more appealing. RUT closed up 1.7% and IWM closed up 1.61%.\n\n* \"I'm totes not dead.\" Says Jack Ma, according to a person familiar with the situation who's relaying the info to a CNBC  reporter on Ma's whereabouts. The beleaguered CEO who's in the crosshair of the CCP is keeping it easy and out of the limelight after running afoul of his overlords by talking up CCP's heavy handed action towards Ant Group. Who knew if your fucking financial empire touches the livelihood of 90% of the country there may be consequences if you don't toe the line. BABA closed the day up 5.51% to $240. Meanwhile, PDD touches new ATH and closed the day up 12.24% to $187 while JD is up 10.61% to $95.\n\n* The Chinese ADR/ADS sector gets a lift today partly thanks to NYSE's overnight about-face on delisting Chinese Telecoms. BILI hits new ATH and closed up 8.15% to $102.46 thanks to favorable reception from their secondary listing on the Heng Sheng\n\n* Semi sector is on a run today thanks to MU, with Citi upping, NAND and DRAM manufacturer from Sell all the way up to Buy with a PT of freaking $100 as we enter another cyclical season. RBC Capital also raised PT from $57 to $83, Deutsche Bank from $75 to $83. Will MU $90 be back in favor and no longer a meme strike? Find out later this week. F in the chat for MartyMoho. If only he bought fooking shares and ride through two more additional cyclical season and a global pandemic. Ez dub. MU closed up 4.33% to $77, LRCX closed up 3.46% to $494, and AMAT closed up 3% to $89. MU reports earnings this Thursday after market close.\n\n* GM pop 2% when news broke at 10:29 on positive US sales number from Q4, while shares were fading slightly as the market digest the news, eventually the positive momentum took over and shares closed the day up 2.84% to $41.66. ROKU pop to close up 5.44%, closing at $335 thanks to WFC analyst raising PT from $275 to $414 (yep) and keeping his overweight rating. \n\n* Today's big movers: FUBO was up as high as 21%, M-A-R-A was up as high 23% while B-N-G-O drilled more than -30% during intraday lows after an initial halt in the early mornings. FUBO closed up 12.83% to $27.35, M-A-R-A closed up 23.43% to $13.59, and B-N-G-O closed down -31.25% to $4.95.\n\n* The GA run-off election is on the market mindset as voters are heading to the polls. Meanwhile, Congress is set to confirm Biden's win over Trump, a procedural formality that generally receives little news coverage but not in the current timeline. Expect POTUS to rage over Pence on Twitter later tonight if the latter confirms Biden's Electoral College win. Look to weed and clean energy sector for pops if the Dems somehow wins both seat. No doubt many WSBer have already loaded up on FDs to showcase the sick gains porn tomorrow if the magic happens.\n\n* In WSB meme stock land, PLTR is up more than 5% but those with OTM Jan 15 calls are likely having their ass handed to them by the greeks, while a similar story exist over at GME as the stock fades away morning gain to close the day up 0.70% as theta rampage $20c, $22c, and $23c (if your strike is even further out then RIP to you). MT and steel gang are faring better, with the stock retaking yesterday's high and closed up 2.84% to 24.63. Steel prices continues to rip and earnings will be early next month on Feb 11th.\n\n* The DOW closed up 167 pts to 0.55%, Nasdaq up 120 pts to 0.95%, S&amp;P up 26 pts to 0.71%, and RUT closed up 33 pts to 1.71%. Notable numbers tomorrow: ADP employment report at 8:15 AM ET, factory orders at 10 AM ET, EIA draw at 10:30 AM, and FOMC minutes at 2PM ET. \n\n(Yesterday's [recap](https://www.reddit.com/r/wallstreetbets/comments/kqi8e8/reeeeeeeeecap_of_todays_and_recent_market_driving/)).",
        "subreddit": "wallstreetbets",
        "title": "Reeeeeeeeecap of today's market driving news (Jan 5, 2021 after market close)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kr7ze8/reeeeeeeeecap_of_todays_market_driving_news_jan_5/",
        "created": 1609910096.0
    },
    {
        "author": "Delta_KVTA",
        "created_utc": 1611772014,
        "id": "l6b43i",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "With all the madness surrounding GME, BB, AMC, NOK, EXPR, KOSS and other  potential short squeezes (disclosure: I'm in on AMC and BB), I thought  it might be nice to take a step back and look at stocks that would be  good to hold for longer than a week. I'm relatively new to investing,  but browsing forums, reading charts, and doing (somewhat amateur) DD, I  think I have a list of some good investments that can be held for a year  or longer. I'm not posting a full DD for each company, just some points  I find interesting, mostly the values and projections for each. For  disclosure's sake, I am NOT currently invested in any of these companies  except for MRNA and RVP.\n\nFLGT:\n\nIf  hearing \"sales growth of 880%\" doesn't perk up your ears I don't know  what will, the last 12 months have been booming for Fulgent Genetics.  They have exceeded analysts projected earnings estimates by 501% and  277% the last two quarters. This fella is undervalued with those  numbers, even with the stock price up 60% in January alone. Currently  going for about $83 but valued around $140. If you buy now you would be  buying at the top, but it's still projected to go higher.\n\nMRNA:\n\nThis  is one of the two stocks on this list that I am currently invested in  (approx 9% of my portfolio). While not \\*quite\\* as impressive as FLGT's  880% sales growth, Moderna's 826% sales growth over the last year is  still fantastic. One of the most undervalued stocks on this list with  the current price only about 53% of it's current value, Moderna has a  lot of potential. MRNA is up 55% already in 2021. Moderna reported only  $60 million in sales in 2019, but are projected to have between 1.5 to  15 billion in 2021. That's a huge window, but even if they hit the  lowest projection it will be fantastic for the company. Again, you would  be buying high if you went in now, but it looks like right now is the  lowest it will be for the foreseeable future.\n\nNVAX:\n\nThis  company fascinates me the most on this list. The current price is less  than half of the current value. Phenomenal upside potential, with unreal  sales growth in the last 12 months at 999%. Novavax stock has rocketed  1302% in the last year. Reported 2019 sales of 18.7 million with 2021  sales projections ranging from 1.2 to 4.7 billion. While 999% sales  growth was impressive, the projected annual sales growth is an  astounding 2,815%. I almost wonder if this one is too good to be true,  which is why I haven't invested yet, but I am beyond tempted.\n\nHZO:\n\nUp  34% this month. Reported earnings the last two quarters exceeded  analyst projections by 120% and 177%. Undervalued with excellent sales  growth. The current quarter looks like it might be mediocre for  MarineMax, but the year-long forecasts look great. Undervalued by about  33%, the potential upside for MarineMax is solid.\n\nDQ:\n\nDaqo  New Energy's stock has been exploding, up 910% in the past year. It's  slightly undervalued, currently selling for around $100 but valued  closer to $118. They have had sales growth of 51% over the last year  with projected rates going much, much higher. One to keep an eye on.\n\nMKSI:\n\nMKS  Instruments is the first stock listed that offers a dividend. At $0.80  annually per share with a dividend growth of 10%, it's a nice cherry on  top to what looks like a good investment. Up 13% this year, MKSI has a  median projected growth of 17% for the next 12 months. Their earnings  exceeded projections all of the last four quarters each between 8% and  36%. MKSI has been in a dip the last week, down about 10%. If you're  thinking about buying, now would be a good time.\n\nRVP:\n\nThe  second stock I am invested in on this list (approx 16% of my  portfolio), Retractable Technologies stock is up 50% in January. I see  an earnings growth rate around 40% after they had 133% sales growth over  the last 12 months. Like all these other picks, RVP is undervalued,  presently going for $16 with a current value closer to $26.\n\nLRCX:\n\nUp  12% this month, Lam Research doesn't have numbers quite as sexy as the  others on this list but it's worth looking at. Earnings exceeded  forecasts by 9% and 17% the last two quarters. Undervalued by about  $170, I see LRCX having plenty of room to grow, especially with their  earnings projected to grow by 45%.\n\nWILD CARD: PLTR\n\nPalantir  Tech isn't really a wild card, but it breaks from the rest of the list  by being massively OVERvalued at $38, when the current value is much  closer to $3. It's up 61% in January, but 12 months projections look  grim, with even the best outlooks predicting a 20% decrease in stock  price. The reason I put it on this list is because I do think it will  grow years from now, mostly from what happened earlier this week. Lots  of people, especially software developers, were amazed with Palantir's  Gotham presentation, many of them saying it could be a major player in  the future. I think the stock price will definitely decline, which is  why I'm not buying in now, but it will be worth revisiting when it  drops.\n\nLike I said, very amateur  DD done for these guys, primarily looking at past and projected sales  and stock price vs value, with some consideration given to price  volatility, price decline resistance, dividends, and timing price  trends. Let me know what you think.",
        "subreddit": "investing",
        "title": "My thoughts on some good future stocks - give me your opinions",
        "url": "https://www.reddit.com/r/investing/comments/l6b43i/my_thoughts_on_some_good_future_stocks_give_me/",
        "created": 1611800814.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1609969085,
        "id": "krxtqk",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, January 6, 2020**\n\nAfter climbing throughout the day, stocks pulled back in the last few hours of the session as turmoil in Washington D.C. escalated. The S&amp;P 500 (SPY) finished 0.56% up, the Dow Jones (DIA) 1.43% up, and the Nasdaq (QQQ) finished 1.39% down.\n\nToday, as lawmakers debated President-Elect Biden’s election victory, protesters in support of Donald Trump broke through the barricades and flooded the Capitol Building. In response, the building was placed under lockdown and Trump deployed the national guard and other law enforcement agencies to control the chaos. According to the Associated Press, one person was shot in a violent clash with the police. The unnamed person was rushed to the hospital, though their condition is not known. Mayor Muriel Bowser ordered a city-wide curfew from 6 p.m. until 6 a.m.\n\nIn Georgia, Democratic Raphel Warnock defeated incumbent Kelly Koeffler to win one of the two Senate seats in the state. This gives Democrats 49 seats to the Republicans 50, with one seat still hanging in the balance. The race between incumbent Republican David Perdue and Democratic challenger Jon Ossoff remains too close to call at the time of writing and will decide which party has the majority position. Remember, in the case of a 50/50 tie, the Vice-President (Kamala Harris after January 20) casts the tie-breaking vote. \n\nAs of Monday morning, the first doses of a COVID-19 vaccine had been given to more than 4.5 million people in the U.S., far below the Trump Administration promise of vaccinating 20 million Americans by years-end. Dr. Anthony Fauci said President-elect Joe Biden’s goal of ramping up distribution to vaccinate 100 million people in his first 100 days was a “realistic goal,” according to an interview with ABC on Sunday. \n\n**Highlights**\n\n* The New York Stock Exchange announced it would delist three Chinese telecommunication companies in an effort to comply with President Donald Trump’s executive order from November banning U.S. investment in companies that were said to support China’s military. The companies are: China Mobile, China Telecom, China Unicom\n* European Union’s drug regulators approved Moderna’s COVID-19 vaccine, making it the second available in the bloc\n* U.S. officials are considering delisting Alibaba (BABA) and Tencent (TCEHY) from the stock market, according people familiar with the matter. (Reported in an article by Benzinga)\n* According to a report, the recent SolarWinds (SWI) hack affected the US Department of Justice.\n* NIO has entered into a contract with battery supplier CATL for procuring a production line of lithium iron phosphate batteries for cheaper vehicles, Chinese media reported.\n* Analog Devices (ADI) target raised by Keycorp from $160 to $175 at Overweight. Stock currently  around $148.\n* Alx Oncology (ALXO) target raised by Cantor  Fitzgerald from $64 to $103 at Overweight. Stock currently around $85.\n* American Express (AXP) target raised by  Deutsche Bank from $108 to $131. Stock currently around $119.\n* Coupa Software (COUP) target raised by Keycorp from $365 to $400 at Overweight. Stock currently around $333\n* CyberArk Software (CYBR) target raised by Barclays from $118 to $175 at Overweight. Stock currently around $152.\n* JP Morgan (JPM) target raised by Deutsche Bank from $120 to $142 at Buy. Stock currently around $125.\n* Lam Research (LRCX) target raised by Keycorp from $472 to $519 at Overweight. Stock currently around $494.\n* NXP Seminconductors (NXPI) target raised by Keycorp from $190 to $195 at Overweight. Stock currently around $165.\n* On Semiconductor (ON) target raised by Keycorp from $37 to $40 at Overweight. Stock currently around $33.\n* Palo Alto Networks (PANW) target raised by Barclays from $325 to $420 at Overweight. Stock currently around $350.\n* Qualcomm (QCOM) target raised by Keycorp from $175 to $180 at Overweight. Stock currently around $152.\n\n\"If you set your goals ridiculously high and it's a failure, you will fail above everyone else's success.\" -James Cameron",
        "subreddit": "StockMarket",
        "title": "Daily Market Recap - Wednesday, January 6, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/krxtqk/daily_market_recap_wednesday_january_6_2021/",
        "created": 1609997885.0
    },
    {
        "author": "Take_Notice_Walk",
        "created_utc": 1611289698,
        "id": "l2g0bp",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "A lot of people here have said that ASML has a monopoly on EUV lithography. And companies like TSM and Intel have to order from ASML. They make it like ASML is a must if you want to play semis/chip stocks.\n\nBut I read that Lam Research is doing EUV lithography as well and have partnered with ASML to develop products.\n\nLRXC seems to have better value and a slightly better dividend. ASML already has a huge market cap.\n\nDoes ASML really have a monopoly? Do you see them out growing LAM Research?\n\nThoughts? Which do you prefer?",
        "subreddit": "stocks",
        "title": "ASML or LRXC (Lam Research), which do you think is better?",
        "url": "https://www.reddit.com/r/stocks/comments/l2g0bp/asml_or_lrxc_lam_research_which_do_you_think_is/",
        "created": 1611318498.0
    },
    {
        "author": "Delta_KVTA",
        "created_utc": 1611770109,
        "id": "l6ac9d",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "With all the madness surrounding GME, BB, AMC, NOK, EXPR, KOSS and other potential short squeezes (disclosure: I'm in on AMC and BB), I thought it might be nice to take a step back and look at stocks that would be good to hold for longer than a week. I'm relatively new to investing, but browsing forums, reading charts, and doing (somewhat amateur) DD, I think I have a list of some good investments that can be held for a year or longer. I'm not posting a full DD for each company, just some points I find interesting, mostly the values and projections for each. For disclosure's sake, I am NOT currently invested in any of these companies except for MRNA and RVP. \n\nFLGT:\n\nIf hearing \"sales growth of 880%\" doesn't perk up your ears I don't know what will, the last 12 months have been booming for Fulgent Genetics. They have exceeded analysts projected earnings estimates by 501% and 277% the last two quarters. This fella is undervalued with those numbers, even with the stock price up 60% in January alone. Currently going for about $83 but valued around $140. If you buy now you would be buying at the top, but it's still projected to go higher.\n\nMRNA:\n\nThis is one of the two stocks on this list that I am currently invested in (approx 9% of my portfolio). While not \\*quite\\* as impressive as FLGT's 880% sales growth, Moderna's 826% sales growth over the last year is still fantastic. One of the most undervalued stocks on this list with the current price only about 53% of it's current value, Moderna has a lot of potential. MRNA is up 55% already in 2021. Moderna reported only $60 million in sales in 2019, but are projected to have between 1.5 to 15 billion in 2021. That's a huge window, but even if they hit the lowest projection it will be fantastic for the company. Again, you would be buying high if you went in now, but it looks like right now is the lowest it will be for the foreseeable future.\n\nNVAX:\n\nThis company fascinates me the most on this list. The current price is less than half of the current value. Phenomenal upside potential, with unreal sales growth in the last 12 months at 999%. Novavax stock has rocketed 1302% in the last year. Reported 2019 sales of 18.7 million with 2021 sales projections ranging from 1.2 to 4.7 billion. While 999% sales growth was impressive, the projected annual sales growth is an astounding 2,815%. I almost wonder if this one is too good to be true, which is why I haven't invested yet, but I am beyond tempted.\n\nHZO:\n\nUp 34% this month. Reported earnings the last two quarters exceeded analyst projections by 120% and 177%. Undervalued with excellent sales growth. The current quarter looks like it might be mediocre for MarineMax, but the year-long forecasts look great. Undervalued by about 33%, the potential upside for MarineMax is solid. \n\nDQ:\n\nDaqo New Energy's stock has been exploding, up 910% in the past year. It's slightly undervalued, currently selling for around $100 but valued closer to $118. They have had sales growth of 51% over the last year with projected rates going much, much higher. One to keep an eye on.\n\nMKSI:\n\nMKS Instruments is the first stock listed that offers a dividend. At $0.80 annually per share with a dividend growth of 10%, it's a nice cherry on top to what looks like a good investment. Up 13% this year, MKSI has a median projected growth of 17% for the next 12 months. Their earnings exceeded projections all of the last four quarters each between 8% and 36%. MKSI has been in a dip the last week, down about 10%. If you're thinking about buying, now would be a good time.\n\nRVP:\n\nThe second stock I am invested in on this list (approx 16% of my portfolio), Retractable Technologies stock is up 50% in January. I see an earnings growth rate around 40% after they had 133% sales growth over the last 12 months. Like all these other picks, RVP is undervalued, presently going for $16 with a current value closer to $26. \n\nLRCX:\n\nUp 12% this month, Lam Research doesn't have numbers quite as sexy as the others on this list but it's worth looking at. Earnings exceeded forecasts by 9% and 17% the last two quarters. Undervalued by about $170, I see LRCX having plenty of room to grow, especially with their earnings projected to grow by 45%. \n\nWILD CARD: PLTR\n\nPalantir Tech isn't really a wild card, but it breaks from the rest of the list by being massively OVERvalued at $38, when the current value is much closer to $3. It's up 61% in January, but 12 months projections look grim, with even the best outlooks predicting a 20% decrease in stock price. The reason I put it on this list is because I do think it will grow years from now, mostly from what happened earlier this week. Lots of people, especially software developers, were amazed with Palantir's Gotham presentation, many of them saying it could be a major player in the future. I think the stock price will definitely decline, which is why I'm not buying in now, but it will be worth revisiting when it drops. \n\nLike I said, very amateur DD done for these guys, primarily looking at past and projected sales and stock price vs value, with some consideration given to price volatility, price decline resistance, dividends, and timing price trends. Let me know what you think.",
        "subreddit": "wallstreetbets",
        "title": "My thoughts on some good future stocks - give me your opinions",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6ac9d/my_thoughts_on_some_good_future_stocks_give_me/",
        "created": 1611798909.0
    },
    {
        "author": "thebeastiestmeat",
        "created_utc": 1611874723,
        "id": "l7bokw",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "https://www.google.com/amp/s/www.barrons.com/amp/articles/15-tech-stock-show-signs-of-a-potential-short-squeeze-51611829801\n\nA link to a Barrons article mentioning 15 other short squeeze candidates besides GME.\nThese are \"potential short squeeze candidates in names where investors have made big and incorrect short calls. That means looking for rising stocks with the largest short positions measured by dollar value.\" \n\nIf you don't have an account with Barrons, here they are:\nDDD\nBB\nSPWR\nDQ\nMSTR\nAMAT\nLIVI\nLRCX\nTSM\nMDLA\nCRNC\nINTC\nKLAC\nTWLO\nESTC",
        "subreddit": "Wallstreetbetsnew",
        "title": "Short Squeeze Candidates in January DDD BB and others",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/l7bokw/short_squeeze_candidates_in_january_ddd_bb_and/",
        "created": 1611903523.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1611415373,
        "id": "l3dybt",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 25th, 2021.\n\n# **Apple and Tesla earnings, along with the Fed and GDP will drive markets in the week ahead - [(Source)](https://www.cnbc.com/2021/01/22/apple-and-tesla-earnings-vaccine-news-and-the-fed-will-be-focus-of-markets-in-week-ahead.html)**\n*****\n&gt; Stimulus euphoria may be waning, but investors will have plenty to focus on in the week ahead, as a blast of earnings news hits, the Federal Reserve meets and new data will show the state of the economy at the end of the year.\n*****\n&gt; Stocks gained in the past week on optimism for a $1.9 trillion stimulus package, proposed by President Joe Biden. But by Friday, the market lost steam amid increased concerns about the pandemic’s economic impact, and as it seemed Biden would not have an easy time getting the stimulus plan approved.\n*****\n&gt; Apple, Facebook, Microsoft, Tesla and more than 100 other S&amp;P 500 companies report earnings in the biggest rush of earnings reports this quarter.\n*****\n&gt; The pandemic will also be a factor as travel restrictions and lockdowns threaten the global economy, and worries remain over the speed of vaccine distributions.\n*****\n&gt; But there is hope that Johnson and Johnson will release positive news on its vaccine results soon, and if that’s the case it could signal another source of vaccines will be available. The J&amp;J vaccine would be a single shot, as opposed to the currently available double-shot vaccines.\n*****\n&gt; “We expect to see their results,” said Art Hogan, chief market strategist at National Securities. “That could be super bullish.” The company reports earnings on Tuesday.\n*****\n&gt; Hogan said the market may also respond to Covid news. He said the seven-day average in new Covid cases fell below the 14-day average this past week for the first time since Thanksgiving, and if that continues, it could indicate a peak.\n*****\n&gt; If the virus news improves, the market could resume its grind higher in the coming week, said Hogan.\n*****\n&gt; # Economy\n&gt; As for the economy, the first look at fourth quarter real gross domestic product comes Thursday, and it is expected to show growth of 4.7%, according to the CNBC/Moody’s Analytics Rapid Update survey. For the year, the economists surveyed expect GDP contracted by 3.5%. The economists forecast 5% growth for 2021.\n*****\n&gt; Consumers pulled back at the end of the fourth quarter, evidenced by a surprise 0.7% decline in December retail sales reported this past week, after a negative November.\n*****\n&gt; “You’re really going to see a loss of momentum throughout the quarter,” said Kevin Cummins, chief U.S. economist at NatWest Markets. “It’s a set up for a really weak Q1.” PMI data shows manufacturing activity has been strong, but labor market data is weak and consumer spending is disappointing.\n*****\n&gt; “You’ve got to juxtapose what’s happening with the vaccine and the virus with what’s happening with underlying data. We’ve definitely seen a lot of the things that could spark a pullback,” said Lori Calvasina, chief U.S. equity strategist at RBC.\n*****\n&gt; Calvasina and other strategists expect a sell-off early in the year.\n*****\n&gt; Stocks hit new highs across the major indices Wednesday, as Biden was inaugurated, and many technicians see the market as overbought. The catalyst for a pullback is not clear, but strategists expect the market to gain this year and say a buying opportunity would open up with any decline.\n*****\n&gt; “Do we start to see stuff showing up in that data that makes us question that recovery?” said Calvasina. “My assumption is we’re going to get a lot of volatility in that data, and we’re going to get some downdrafts but it’s not going to be bad enough to erase this upward trajectory we’ve seen in the economy since the second quarter.”\n*****\n&gt; # Fed ahead\nThe Fed is also a powerful backstop for the market, and economists don’t expect the Fed to take any action or change in its dovish tone when it releases its statement Wednesday afternoon, following its two-day meeting.\n*****\n&gt; “I don’t see them making many changes,” said Cummins of NatWest. “They’ll probably acknowledge just the fact that employment was weak.\n*****\n&gt; “It’s going to be pretty clear cut,” he added. “I think Powell will sound similar to what he sounded like in September.” Cummins said the Fed chairman is likely to say the economic outlook depends on the course of the virus and vaccine.\n*****\n&gt; There is also durable goods data Wednesday and personal income and spending data on Friday. The Fed’s favorite inflation gauge, the PCE deflator is also released Friday, and Powell will surely be asked Wednesday afternoon about inflation, which is increasingly being priced into market expectations.\n*****\n&gt; Powell is also likely to be asked his views on fiscal stimulus, which could end up being smaller than some expect.\n*****\n&gt; Hogan of National Securities said the market traded lower on Friday on expectations the package could be smaller and take longer than expected to gain approval.\n*****\n&gt; “I think the realism of saying $1.9 trillion and doing $1.9 trillion are two different things,” he said. “We fall into that trap all the time.”\n*****\n&gt; “What’s happening now is there is no magic wand here,” Hogan added. “It’s not to say there’s no stimulus. It’s just a matter of how long it will take and how much there will be. There’s a little bit of realism.”\n*****\n&gt; Matt Maley, chief market strategist at Miller Tabak, said a pullback could be sparked if bitcoin starts to fall more sharply, since some investors would sell stock in response. “When there’s no bid in bitcoin they have to sell something, and they sell stock,” said Maley.\n*****\n&gt; Bitcoin has had a wild early ride in 2021. The cryptocurrency hit a record high of $41,973 on Jan. 12, according to data from Coin Metrics. Days later, it fell about 15%, wiping out as much as $200 billion in just 24 hours.\n*****\n&gt; Bitcoin then regained some of its losses, surging to near $40,000 before another reversal. On Friday, it was trading at $33,200 after dipping below $30,000.\n*****\n&gt; “If this thing starts tanking again, it’s going to cause some forced selling and it’s going to cause some selling in the stock market,” said Maley, adding it will be important to hold the low from Thursday night.\n*****\n&gt; He said the short position in the dollar is also an overcrowded trade that could turn quickly. A resulting short squeeze could cause a dollar rally that would be negative for the stock market. He also is watching Tesla, which reports earnings on Wednesday.\n*****\n&gt; “I think whether it be bitcoin, the dollar, Tesla, one of these crowded trades...it’s going to turn the narrative that’s permeating right now, and if we don’t get a surprise the market will continue to push higher,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/eO7d7Zq.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/1GWbub4.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/tyhAE90.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/vbOa37l.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8HqdRsR.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/NZeUiVr.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/6E5RdpT.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/3Igc9Mf.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/hBm7jZ6.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/6jxbrCb.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/5SrZWIY.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/PwdsNDj.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/nseHMnr.png))**\n\n*****\n\n&gt; # February Almanac: Worst S&amp;P 500 Month of Post-Election Years\n\n&gt; Even though February is right in the middle of the Best Six Months, its long-term track record, since 1950, is rather tepid. February ranks no better than sixth and has posted meager average gains except for the Russell 2000. Small cap stocks, benefiting from “January Effect” carry over; tend to outpace large cap stocks in February. The Russell 2000 index of small cap stocks turns in an average gain of 1.0% in February since 1979—just the sixth best month for that benchmark.\n\n&gt; February’s post-election year performance since 1950 is miserable, ranking dead last for S&amp;P 500, NASDAQ and Russell 2000. Average losses have been sizable: -1.5%, -3.3% and -1.6% respectively. February ranks tenth for DJIA in post-election years with an average loss of 1.1%. February 2001 and 2009 were exceptionally brutal. NASDAQ dropped 22.4% in February 2001, its third worst monthly loss ever.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/d4b3e8cda0a49d76ee55a9768e6c579a/153e22faa5d70761-e1/s400x600/32c0464083a6087a711ac381b9350a1420626ac6.jpg))**\n\n*****\n\n&gt; # Housing Closes Out 2020 on a Positive Note\n\n&gt; Housing closed out 2020 on an extremely positive note as both Housing Starts and Building Permits topped forecasts by more than 100K. Since 2002, there have only been ten other months where both reports topped forecasts by more than 100K, and today's report was the third time it happened in the last 12 months!\n\n&gt; The table below breaks down the details of the December report in terms of both single and multi-family units and regions. One of the clear areas of strength was in single-family starts and permits. On a y/y basis, both were up over 25%, and relative to November, starts were up 12% while permits rose 7.8%. Multi-family units, meanwhile, both saw declines with notable weakness in multi-family starts. On a regional basis, most areas of the country saw strength although starts and permits were down m/m and y/y in the Northeast.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Housing-Starts-Details.png))**\n\n&gt; Given its overall size, you can easily make the case that as goes the housing market, so goes the economy, and history tends to bear this out. The top chart shows the 12-month average of Housing Starts going back to 1967 with recessions overlaid in gray. With the exception of the latest downturn, every prior recession was preceded by a rollover in Housing Starts. Given the sudden onset of the pandemic, housing played no role in the current recession, but once the lockdowns started, the residential housing market wasn't immune to the weakness. Whatever weakness there was didn't last long. As shown in the second chart below, less than a year after the recession started, both the 12-month average of Housing Starts and Building Permits have now moved back above their pre-pandemic highs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Housing-Starts-and-Business-Cycle.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Housing-Starts-and-Business-Cycle-Last-10-Years.png))**\n\n&gt; While Housing Starts and Building Permits are both at new multi-year highs, on a population-adjusted basis, they're still closer to levels typically associated with recessions than expansions. After adjusting for population growth, Housing Starts would need to come in above 1.9 million just to keep up with population growth.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Housing-Starts-Population-Adjusted.png))**\n\n&gt; As for the stocks of homebuilders, the performance of the iShares Home Construction ETF (ITB) tends to track trends in Housing Starts and Building Permits pretty closely, so it's no surprise that it also traded to a new all-time high on Thursday for the first time in three months. As long as interest rates don't see a sudden spike higher, trends in place for the residential housing market remain positive.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Housing-Starts-vs-ITV.png))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Building-Permits-vs-ITV.png))**\n\n*****\n\n&gt; # Impressive Reading From The Philly Fed\n\n&gt; Of the several strong economic data points to have been released today, perhaps the strongest relative to expectations was the Philadelphia Fed's monthly survey on the region's manufacturing sector. The headline index was expected to rise from 11.1 to 11.8. Instead, it more than doubled expectations rising to 26.5. That is the highest reading since last February just before the pandemic's full impact was felt. Overall, the report showed the region's manufacturing sector experienced strong growth in January with accelerating growth in demand, prices, and employment.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Philly-Fed-HL.png))**\n\n&gt; In the table below, we break down the various sub-indices of the report. Nearly every component experienced a month over month increase that ranks in the top few percentiles of their respective histories. That also left most indices in the top decile of their historic ranges. That compares to last month in which most readings were far more moderate. Although most indices for current conditions saw impressive readings, the indices for expectations were much more mixed with a larger number falling than rising MoM. Given every one of these indices remains positive, though, the region's manufacturers still have an overall optimistic outlook.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Philly-Fed-Table1.png))**\n\n&gt; Of all the sub-indices, the New Orders index saw one of the most significant increases in January rising 28.1 percentage points from a barely expansionary reading of 1.9 to a much stronger reading of 30. Going back over the past couple of years, the only times this index was higher was in October (32.9) and February (30.7) of last year. That indicates very strong new order growth after a slowdown in December.\n\n&gt; Similarly, the index for unfilled orders was the only index in contractionary territory (those below zero) last month, but there was a massive improvement this month as the index surged to a reading of 25.6. Both the level of the index and the monthly change stand in the top 1% of all readings going back through the history of the survey which began in 1968. The only times the index has been higher was in August of 1972 (26) and January (29.6) and March (45.1) of 1973. In other words, New Orders remain strong while Unfilled Orders are bouncing back at a historic rate.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Philly-Fed-Orders.png))**\n\n&gt; While the unfilled orders index reached one of the highest readings on record, the index for Delivery Times actually hit a new record. The index rose 12.7 points to a record high of 30; surpassing the previous record of 21.3 from October of 2017. Higher readings in this index indicate that supplier lead times are longer and vice versa for lower readings. That means a historic number of respondents are seeing delays in their supply chains.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Philly-Fed-Deliveries.png)**\n\n&gt; Perhaps to get ahead of the growing demand and longer lead times, businesses are also reporting higher inventories. That index rose to the highest level since September of 2019 which also stands in the top 5% of all readings in the history of the data.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Philly-Fed-Inv.png)**\n\n&gt; Given the stronger demand and tighter supply lines, prices have also been accelerating. Both Prices Paid and Prices Received experienced some of their largest monthly increases on record after rising 20.5 points in January. At 45.4, the index for Prices Paid is at its highest level since August of 2018. Those price increases are also getting passed along to customers as the index for Prices Received is at the highest level since February of 1989. These results echo some other hints of more inflationary conditions like the New York Fed's readings last week and the ISM services and manufacturing report earlier this month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/01/012121-Philly-Fed-Prices.png)**\n\n*****\n\n&gt; # Real-time COVID-19 Data Suggests Final Peak May Be Here\n\n&gt; It has been exactly one year since the first COVID-19 case in the United States was reported to the Centers for Disease Control (CDC), and to say the world as we know it has been completely changed would be an understatement. Thankfully, we may finally be seeing the light at the end of the tunnel.\n\n&gt; With the rollout of multiple approved vaccines underway, some real-time COVID-19 indicators and mobility-related data points have put in their final highs (or lows). As shown in the LPL chart of the day, restrictions implemented at the end of 2020 appear to be helping to curb the spread of the virus, as new COVID-19 cases and those currently hospitalized have been on the decline.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/01/1.22.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; Meanwhile, the positive rate has also declined despite daily tests near all-time highs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/01/1.22.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; However, while COVID-19 data has been improving, real-time economic indicators like OpenTable reservations show businesses continue to struggle as restrictions on activities to curb the late-2020 surge remain in place.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/01/1.22.21-Blog-Chart-3.png?ssl=1))**\n\n&gt; Similarly, the number of people getting on airlines has fallen back to mid-October levels after the holiday bump. Domestic air travel activity remains 64% below pre-pandemic levels.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/01/1.22.21-Blog-Chart-4.png?ssl=1))**\n\n&gt; “The good news is that cases are declining and vaccine distribution is increasing, but service industries and air travel are clearly still under a lot of pressure,” said LPL Research Chief Market Strategist Ryan Detrick. “While manufacturing and housing data remain firm, recent data on the job market and consumer spending have been choppy.”\n\n&gt; It’s very encouraging to see COVID-19 cases and hospitalizations improving, a trend we hope will continue until this pandemic ends for good. In the meantime, we will continue to follow high-frequency data to gauge the recovery’s progress. The next report card comes next week with the release of fourth quarter 2020 gross domestic product (GDP).\n\n&gt; We’ll also be closely watching developments in Washington, DC. The economy’s bridge to the other side will likely get stronger in the coming weeks with more stimulus—potentially to the tune of another $700 billion to $1 trillion.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending January 22nd, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.24.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AAPL** \n&gt; * **$TSLA** \n&gt; * **$AMD** \n&gt; * **$FB** \n&gt; * **$MSFT** \n&gt; * **$JNJ** \n&gt; * **$GE** \n&gt; * **$BA** \n&gt; * **$MMM** \n&gt; * **$T** \n&gt; * **$LMT** \n&gt; * **$VZ** \n&gt; * **$DHI** \n&gt; * **$AAL** \n&gt; * **$MCD** \n&gt; * **$ABT** \n&gt; * **$FCX** \n&gt; * **$KMB** \n&gt; * **$AXP** \n&gt; * **$RTX** \n&gt; * **$NEE** \n&gt; * **$XLNX** \n&gt; * **$V** \n&gt; * **$SBUX** \n&gt; * **$CAT** \n&gt; * **$LRCX** \n&gt; * **$MA** \n&gt; * **$OFG** \n&gt; * **$NOW** \n&gt; * **$NDAQ** \n&gt; * **$NVS** \n&gt; * **$PLD** \n&gt; * **$PII** \n&gt; * **$MKC** \n&gt; * **$BMRC** \n&gt; * **$ALK** \n&gt; * **$SHW** \n&gt; * **$TXN** \n&gt; * **$NEP** \n&gt; * **$LUV **\n&gt; * **$BOH** \n&gt; * **$LLY** \n&gt; * **$SWKS** \n&gt; * **$PGR** \n&gt; * **$PHG**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/hBm7jZ6.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/X2a6Awd.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/eACodIM.jpg))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES FOR FINANCIAL COMPANIES ONLY FOR THE NEXT 4 WEEKS!](https://i.imgur.com/aC5hzkZ.jpg))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES FOR NASDAQ 100 COMPANIES ONLY FOR THE NEXT 4 WEEKS!](https://i.imgur.com/zIQniHK.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.25.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/8R46aDj.png))\n\n&gt; # ***Monday 1.25.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/f3YFp1i.png))\n\n*****\n\n&gt; # ***Tuesday  1.26.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/dU2uEBa.png))\n\n&gt; # ***Tuesday 1.26.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NnafTFh.png))\n\n*****\n\n&gt; # ***Wednesday 1.27.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/5cGqHaC.png))\n\n&gt; # ***Wednesday 1.27.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/83z1Sc4.png))\n\n*****\n\n&gt; # ***Thursday 1.28.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/awFue6C.png))\n\n&gt; # ***Thursday 1.28.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/INHVHTh.png))\n\n*****\n\n&gt; # ***Friday 1.29.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/j11gRzS.png))\n\n*****\n\n&gt; # ***Friday 1.29.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Apple, Inc. $139.07\n**Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Wednesday, January 27, 2021. The consensus earnings estimate is $1.39 per share on revenue of $102.61 billion and the Earnings Whisper ® number is $1.52 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 72.14% with revenue increasing by 11.75%. The stock has drifted higher by 25.2% from its open following the earnings release to be 31.7% above its 200 day moving average of $105.61. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 21, 2021 there was some notable buying of 77,658 contracts of the $140.00 call expiring on Friday, January 29, 2021. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Tesla, Inc. $846.64\n**Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, January 27, 2021. The consensus earnings estimate is $0.99 per share on revenue of $9.98 billion and the Earnings Whisper ® number is $1.11 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 50.99% with revenue increasing by 35.16%. Short interest has increased by 6.1% since the company's last earnings release while the stock has drifted higher by 91.6% from its open following the earnings release to be 121.4% above its 200 day moving average of $382.35. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, December 28, 2020 there was some notable buying of 24,031 contracts of the $600.00 call expiring on Friday, January 20, 2023. Option traders are pricing in a 8.5% move on earnings and the stock has averaged a 8.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Advanced Micro Devices, Inc. $92.79\n**Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 26, 2021. The consensus earnings estimate is $0.47 per share on revenue of $3.01 billion and the Earnings Whisper ® number is $0.50 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 46.88% with revenue increasing by 41.51%. Short interest has increased by 127.5% since the company's last earnings release while the stock has drifted higher by 13.2% from its open following the earnings release to be 26.8% above its 200 day moving average of $73.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, January 19, 2021 there was some notable buying of 32,049 contracts of the $90.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 8.7% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Facebook Inc. $274.50\n**Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, January 27, 2021. The consensus earnings estimate is $3.22 per share on revenue of $26.26 billion and the Earnings Whisper ® number is $3.46 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.78% with revenue increasing by 24.56%. Short interest has increased by 10.5% since the company's last earnings release while the stock has drifted sidways from its open following the earnings release to be 10.2% above its 200 day moving average of $249.17. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, January 11, 2021 there was some notable buying of 27,886 contracts of the $265.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Microsoft Corp. $225.95\n**Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, January 26, 2021. The consensus earnings estimate is $1.64 per share on revenue of $40.12 billion and the Earnings Whisper ® number is $1.77 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.61% with revenue increasing by 8.71%. Short interest has increased by 11.8% since the company's last earnings release while the stock has drifted higher by 8.8% from its open following the earnings release to be 10.1% above its 200 day moving average of $205.31. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 21, 2021 there was some notable buying of 19,283 contracts of the $225.00 call expiring on Friday, January 29, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Johnson &amp; Johnson $163.55\n**Johnson &amp; Johnson (JNJ)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, January 26, 2021. The consensus earnings estimate is $1.81 per share on revenue of $21.73 billion and the Earnings Whisper ® number is $2.03 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.72% with revenue increasing by 4.74%. Short interest has increased by 17.6% since the company's last earnings release while the stock has drifted higher by 9.8% from its open following the earnings release to be 10.8% above its 200 day moving average of $147.62. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 14, 2021 there was some notable buying of 10,418 contracts of the $175.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 4.2% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JNJ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # General Electric Co. $11.11\n**General Electric Co. (GE)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, January 26, 2021. The consensus earnings estimate is $0.08 per share on revenue of $21.27 billion and the Earnings Whisper ® number is $0.11 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 61.90% with revenue decreasing by 18.93%. Short interest has decreased by 8.1% since the company's last earnings release while the stock has drifted higher by 47.9% from its open following the earnings release to be 44.8% above its 200 day moving average of $7.67. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, January 19, 2021 there was some notable buying of 53,597 contracts of the $9.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 7.9% move on earnings and the stock has averaged a 5.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Boeing Co. $205.84\n**Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 27, 2021. The consensus estimate is for a loss of $1.78 per share on revenue of $15.07 billion and the Earnings Whisper ® number is ($1.06) per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 23.61% with revenue decreasing by 15.86%. Short interest has decreased by 5.4% since the company's last earnings release while the stock has drifted higher by 34.5% from its open following the earnings release to be 17.6% above its 200 day moving average of $175.05. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, January 5, 2021 there was some notable buying of 23,876 contracts of the $200.00 call and 23,850 contracts of the $200.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 5.3% move on earnings and the stock has averaged a 3.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # 3M Company $169.04\n**3M Company (MMM)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, January 26, 2021. The consensus earnings estimate is $2.19 per share on revenue of $8.49 billion and the Earnings Whisper ® number is $2.31 per share. Investor sentiment going into the company's earnings release has 62% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 12.31% with revenue increasing by 4.67%. Short interest has increased by 27.4% since the company's last earnings release while the stock has drifted higher by 2.8% from its open following the earnings release to be 5.1% above its 200 day moving average of $160.85. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, January 21, 2021 there was some notable buying of 7,624 contracts of the $200.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MMM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # AT&amp;T Corp. $28.93\n**AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:25 AM ET on Wednesday, January 27, 2021. The consensus earnings estimate is $0.73 per share on revenue of $44.54 billion and the Earnings Whisper ® number is $0.75 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 17.98% with revenue decreasing by 4.87%. The stock has drifted higher by 4.0% from its open following the earnings release to be 2.2% below its 200 day moving average of $29.58. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, January 14, 2021 there was some notable buying of 66,855 contracts of the $28.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 4.3% move on earnings and the stock has averaged a 3.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning January 25th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/l3dybt/wall_street_week_ahead_for_the_trading_week/",
        "created": 1611444173.0
    },
    {
        "author": "Take_Notice_Walk",
        "created_utc": 1611287532,
        "id": "l2feub",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "ASML vs LRCX?",
        "url": "https://www.reddit.com/r/stocks/comments/l2feub/asml_vs_lrcx/",
        "created": 1611316332.0
    },
    {
        "author": "Delta_KVTA",
        "created_utc": 1611770098,
        "id": "l6ac3z",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With all the madness surrounding GME, BB, AMC, NOK, EXPR, KOSS and other potential short squeezes (disclosure: I'm in on AMC and BB), I thought it might be nice to take a step back and look at stocks that would be good to hold for longer than a week. I'm relatively new to investing, but browsing forums, reading charts, and doing (somewhat amateur) DD, I think I have a list of some good investments that can be held for a year or longer. I'm not posting a full DD for each company, just some points I find interesting, mostly the values and projections for each. For disclosure's sake, I am NOT currently invested in any of these companies except for MRNA and RVP. \n\nFLGT:\n\nIf hearing \"sales growth of 880%\" doesn't perk up your ears I don't know what will, the last 12 months have been booming for Fulgent Genetics. They have exceeded analysts projected earnings estimates by 501% and 277% the last two quarters. This fella is undervalued with those numbers, even with the stock price up 60% in January alone. Currently going for about $83 but valued around $140. If you buy now you would be buying at the top, but it's still projected to go higher.\n\nMRNA:\n\nThis is one of the two stocks on this list that I am currently invested in (approx 9% of my portfolio). While not \\*quite\\* as impressive as FLGT's 880% sales growth, Moderna's 826% sales growth over the last year is still fantastic. One of the most undervalued stocks on this list with the current price only about 53% of it's current value, Moderna has a lot of potential. MRNA is up 55% already in 2021. Moderna reported only $60 million in sales in 2019, but are projected to have between 1.5 to 15 billion in 2021. That's a huge window, but even if they hit the lowest projection it will be fantastic for the company. Again, you would be buying high if you went in now, but it looks like right now is the lowest it will be for the foreseeable future.\n\nNVAX:\n\nThis company fascinates me the most on this list. The current price is less than half of the current value. Phenomenal upside potential, with unreal sales growth in the last 12 months at 999%. Novavax stock has rocketed 1302% in the last year. Reported 2019 sales of 18.7 million with 2021 sales projections ranging from 1.2 to 4.7 billion. While 999% sales growth was impressive, the projected annual sales growth is an astounding 2,815%. I almost wonder if this one is too good to be true, which is why I haven't invested yet, but I am beyond tempted.\n\nHZO:\n\nUp 34% this month. Reported earnings the last two quarters exceeded analyst projections by 120% and 177%. Undervalued with excellent sales growth. The current quarter looks like it might be mediocre for MarineMax, but the year-long forecasts look great. Undervalued by about 33%, the potential upside for MarineMax is solid. \n\nDQ:\n\nDaqo New Energy's stock has been exploding, up 910% in the past year. It's slightly undervalued, currently selling for around $100 but valued closer to $118. They have had sales growth of 51% over the last year with projected rates going much, much higher. One to keep an eye on.\n\nMKSI:\n\nMKS Instruments is the first stock listed that offers a dividend. At $0.80 annually per share with a dividend growth of 10%, it's a nice cherry on top to what looks like a good investment. Up 13% this year, MKSI has a median projected growth of 17% for the next 12 months. Their earnings exceeded projections all of the last four quarters each between 8% and 36%. MKSI has been in a dip the last week, down about 10%. If you're thinking about buying, now would be a good time.\n\nRVP:\n\nThe second stock I am invested in on this list (approx 16% of my portfolio), Retractable Technologies stock is up 50% in January. I see an earnings growth rate around 40% after they had 133% sales growth over the last 12 months. Like all these other picks, RVP is undervalued, presently going for $16 with a current value closer to $26. \n\nLRCX:\n\nUp 12% this month, Lam Research doesn't have numbers quite as sexy as the others on this list but it's worth looking at. Earnings exceeded forecasts by 9% and 17% the last two quarters. Undervalued by about $170, I see LRCX having plenty of room to grow, especially with their earnings projected to grow by 45%. \n\nWILD CARD: PLTR\n\nPalantir Tech isn't really a wild card, but it breaks from the rest of the list by being massively OVERvalued at $38, when the current value is much closer to $3. It's up 61% in January, but 12 months projections look grim, with even the best outlooks predicting a 20% decrease in stock price. The reason I put it on this list is because I do think it will grow years from now, mostly from what happened earlier this week. Lots of people, especially software developers, were amazed with Palantir's Gotham presentation, many of them saying it could be a major player in the future. I think the stock price will definitely decline, which is why I'm not buying in now, but it will be worth revisiting when it drops. \n\nLike I said, very amateur DD done for these guys, primarily looking at past and projected sales and stock price vs value, with some consideration given to price volatility, price decline resistance, dividends, and timing price trends. Let me know what you think.",
        "subreddit": "wallstreetbets",
        "title": "My thoughts on some good future stocks - give me your opinions",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6ac3z/my_thoughts_on_some_good_future_stocks_give_me/",
        "created": 1611798898.0
    }
]