[
    {
        "author": "relias119",
        "created_utc": 1611247651,
        "id": "l227kd",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "**What you need to know:**\n\n*Processing img dyy8vg81gpc61...*\n\nPLTR is experiencing a heavy strong trend with a bull and flag. It's broken support this morning and is back up. PLTR has had positive momentum, tons of new contracts and lots of volume. It's been in this pennant and is due for a breakout. PLTR's Demo day is the 26th of Jan and earnings is Feb 11. Demo day is gonna showcase new Palantir products and outline what PLTR has in store for 2021. \n\n**A case for longs:**\n\nPalantir aims to put together software that compiles data that provides insights into potential problems, solutions to these problems, and help solve complex, real-world problems. This data and analytics is fully interactive, and machine-assisted. So far, Gotham and Foundry are Palantir's products. Gotham is the military/government grade software and Foundry is the commercial equivalent. Apollo is a program that essentially removes the need for support teams when Gotham and Foundry need an update. Apollo gives Foundry and Gotham users the luxury of updating their software like it's an IOS update. These three products are the fundamentals of PLTR\n\nPalantir's goal in the commercial and govt space is to grow in scope and scale. This prepares them for a horizontal integration. They are trying to build a wide moat for themselves in order to secure an opportunity for vertical integration as well. By preparing themselves for both vertical and horizontal integration, they are going down a road not dissimilar to that of Standard Oil. There is not a doubt in my mind that this company is run by people who know what they're doing. \n\nPLTR is now the biggest company involved in government data. The US cannot afford to have PLTR go under, and thus it will never go away- the only way is up. The real question is, how fast is it going up?\n\n\"Looking ahead, Palantir is poised to become the default central operating system for data across the U.S. government and its allies. The company also aspires to be the central operating system for data at large businesses and even entire industries. To appreciate Palantir's ambition with regard to B2B big data, it may be helpful to recall how much economic benefit has been captured by Microsoft (MSFT) after Windows OS took the lead over MacOS of Apple (AAPL) in the PC era, and by Google and Apple in the consumer mobile phone age with their respective Android and iOS operating systems.\"\n\nCompetitors in this niche tech field are quickly swatted away. BAH and ACN lack the technical power and can't compete with PLTR pricing. Even defense contractors such as RTX, BAH, SAIC, and BAESF cannot compete with the costs and user-responsiveness of PLTR. You might ask why a big shot like google isn't stepping in to work with the government, to which I would chuckle and remind you that google stated they think the pentagon is \"unethical\" and prefer to work with the Chinese government on Project Dragonfly ([https://en.wikipedia.org/wiki/Dragonfly\\_(search\\_engine)](https://en.wikipedia.org/wiki/Dragonfly_(search_engine))). \n\nI'll go ahead and rattle off some quick deductions of mine. They have an aggressive merger and acquisition campaign. To grow into adjacent verticals, they absorb companies that are already there, quickening the speed they grow at. They are Capital-light and operationally efficient. Their ROI is very high and they can sell their product with existing hardware for as long as they are the best program to use. Meaning their software needs to be installed once but can be sold as many times as they like, as long as they keep their shit together. They are seriously dominating domestically in their niche. Their wide moat due to the M&amp;A campaign and good management for vertical + horizontal growth gives them a monopolistic outlook. They are in the captains chair. \n\n**Forward thinking**\n\nPLTR's last Q described sales growth of 46% in international sales. They want to move into Canada, Australia, UK, France and other allies of the U.S. They will very likely establish themselves there as well. They have a Foundry Joint Venture contract in Japan with Sampo Holdings for the wellbeing of the Japanese people. It was $500M. They are likely looking for a contract with Japan's government as well. \n\nMy short-term PT for PLTR is $34, passing ATH. This pennant is a strong trend and it is gonna break out hard. All signs point towards a bullish breakout so I'm loaded up on calls, overexposing myself three times with what I'm usually comfortable with exposing myself to. \n\nLong term, I can imagine PLTR breaking $100 within 2 years. With a growing need of govt software and national security, *PLTR's value can only go up*\n\n**TLDR: PLTR $34 by early Feb.**",
        "subreddit": "wallstreetbets",
        "title": "PLTR gang will rise again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l227kd/pltr_gang_will_rise_again/",
        "created": 1611276451.0
    },
    {
        "author": "Sensei071",
        "created_utc": 1610566145,
        "id": "kwnv0p",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "DMYI is the third SPAC of DMY Technology Group with solid management (including former CFO of Oracle and Accenture) and decent SPAC track record.\n\nDMY’s first SPAC, DYMT (now RSI post-merger) is now trading at above $22. DMY’s second SPAC, DMYD (going to merge with Genius Sport) is now trading at above $16. DMYI is trading at $11 but hasn’t announced a target just yet. But it has been confirmed that DMYI is targeting AI/cloud/quantum computing which is likely more disruptive and higher growth than the first two SPACs which targeted online gambling/sports betting.\n\nFor DMYI, I feel like the slight premium price for a SPAC without target announcement is justified given what I discussed above. I expect target announcement this quarter and the rewards are high with minimal risks based on the current share price.",
        "subreddit": "SPACs",
        "title": "DMYI - Under the radar SPAC",
        "url": "https://www.reddit.com/r/SPACs/comments/kwnv0p/dmyi_under_the_radar_spac/",
        "created": 1610594945.0
    },
    {
        "author": "nhlsm_666",
        "created_utc": 1610328914,
        "id": "kus7pp",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "1968 exhibitors:[https://digital.ces.tech/exhibitors](https://digital.ces.tech/exhibitors)\n\nKeynotes Schedules: [https://ces.tech/Conference/Keynote-Addresses.aspx](https://ces.tech/Conference/Keynote-Addresses.aspx)\n\nDoes anyone have some thoughts? It's an extensive list and I honestly don't know what to expect.\n\nSome big names I saw are WM, AMD, Accenture, BBY, MSFT and etc.",
        "subreddit": "stocks",
        "title": "CES is tomorrow. Thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/kus7pp/ces_is_tomorrow_thoughts/",
        "created": 1610357714.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1610819112,
        "id": "kynghz",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "stocks",
        "title": "Accenture Stock",
        "url": "https://www.reddit.com/r/stocks/comments/kynghz/accenture_stock/",
        "created": 1610847912.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1610819012,
        "id": "kynfap",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "stocks",
        "title": "Accenture",
        "url": "https://www.reddit.com/r/stocks/comments/kynfap/accenture/",
        "created": 1610847812.0
    },
    {
        "author": "MicrodoseHQ",
        "created_utc": 1611585011,
        "id": "l4ox8x",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "shroomstocks",
        "title": "UPDATE: Awakn Appoints James Collins, Ex-Accenture Strategy MD, as Chief Operating Officer",
        "url": "https://microdose.buzz/news/awakn-appoints-james-collins-ex-accenture-strategy-md-as-chief-operating-officer/",
        "created": 1611613811.0
    },
    {
        "author": "Krek20",
        "created_utc": 1611350267,
        "id": "l2xa7n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Zuora is a cloud based enterprise software company that creates and provides software for businesses to launch and manage their subscription-based services. Zuora provides it services to large companies like Zoom, Phillips, AT&amp;T, Visa, and many more.\n\n\nVasundhara Sawalka on Zuora:\n\n“Significant contributions from its system integration partner base, which includes Accenture, Capgemini, Deloitte, EY and PwC, are major growth drivers. These companies are experiencing solid consumer demand for subscription and revenue automation, which in turn is expected to boost the expansion of Zuora’s enterprise clientele in 2021”.",
        "subreddit": "wallstreetbets",
        "title": "Zuora: Tech Stock That Shows Promising Gains For 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l2xa7n/zuora_tech_stock_that_shows_promising_gains_for/",
        "created": 1611379067.0
    },
    {
        "author": "Masculiknitty",
        "created_utc": 1611639383,
        "id": "l579ij",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**This is not investment advice. Do your own due diligence.**\n\n&amp;#x200B;\n\n**Ticker:** CBAHU\n\n**Price:** $10.85 (at time of this post)\n\n**Trust:** \\~$420 million\n\n**IPO Date:** Dec-11-2020\n\n**Website**: [https://cbreacquisitionholdings.com/home/default.aspx](https://cbreacquisitionholdings.com/home/default.aspx)\n\n**Highlights:** \n\n· Sponsor and Team: CBRE is the largest commercial real estate investment firm\n\n· $11 warrant exercise, NOT $11.50\n\n· ¼ warrant per unit\n\n· 10-year founder share conversion incentive structure\n\n**Prospectus:** [https://sec.report/Document/0001193125-20-316011/#toc](https://sec.report/Document/0001193125-20-316011/#toc)\n\n**Whales:** \n\n· Empyrean Capital - 2,064,511 shares or 5.1%\n\n· Integrated Core Strategies – 1,652,600 or 4.1%\n\n**Disclosure:**\n\nNo Position but hoping to purchase \\~500-800 units today Jan-26-2021\n\n&amp;#x200B;\n\n**Excerpts from the 424B prospectus:**\n\n**THE SPONSOR**\n\nThe parent of our sponsor, CBRE, is the world’s largest commercial real estate services and investment firm, based on 2019 revenue, with leading global market positions in leasing, property sales, occupier outsourcing, property management, valuation and other business lines. We believe we will be able to leverage the advantages that CBRE holds by virtue of its industry-leading position to not only source highly attractive acquisition candidates but also support the acquired company’s future growth. We will leverage the strategic advantages that CBRE has to offer.\n\n**MANAGEMENT**\n\n**Directors and Executive Officers**\n\nOur officers, directors and director nominees are as follows:\n\n*Processing img tdox0sdx4md61...*\n\n**Robert E. Sulentic** serves as the Chair of our Board of Directors and has been President &amp; Chief Executive Officer of CBRE Group, Inc. since December 2012. Mr. Sulentic began his real estate career with Trammell Crow Company in 1984 as an Industrial Leasing Agent in Houston, Texas. Over the next 23 years he served in various leadership positions at Trammell Crow Company and rose to President and CEO in 2000 and Chair of the Board in 2002. He served in those roles when Trammell Crow Company merged with CBRE in late 2006. Mr. Sulentic is a member of the CBRE Group, Inc. Board of Directors and also served as the independent Chair of the Board of Staples, Inc. until its acquisition by Sycamore Partners, a private equity firm, in 2017. Mr. Sulentic received an M.B.A. from Harvard Business School and a B.A. from Iowa State University. He was selected to serve on our board of directors due to his experience as a leader in the real estate industry.\n\n**William F. Concannon** serves as our Chief Executive Officer and a Director. Mr. Concannon is CBRE’s Global Group President, Clients and Business Partners, where he drives the firm’s engagement strategy for CBRE’s largest occupier and investor clients, as well as with key strategic partners. He has been with CBRE since its acquisition of the Trammell Crow Company in 2006. Before assuming his current role, he served as Global CEO of CBRE’s GWS business segment, a global, integrated, full-service real estate outsourcing business serving the world’s largest real estate occupiers. He serves on the board of Charles Rivers Associates (NASDAQ: [CRAI](https://sec.report/Ticker/CRAI)). Mr. Concannon received a B.S. from Providence College. He was selected to serve on our board of directors due to his experience as a leader in the real estate industry.\n\n**Cash J. Smith** serves as our President, Chief Financial Officer and Secretary. Mr. Smith joined CBRE in 2012 and was Global Head of Mergers &amp; Acquisitions with responsibility for CBRE’s mergers and acquisitions activity globally. He was also responsible for CBRE’s property technology and venture-capital investments, including serving on multiple boards related to CBRE’s direct investments. Mr. Smith received an M.B.A. from Duke University and a B.S. from Georgia Institute of Technology. He was selected to serve as an officer due to his experience in the real estate industry and in sourcing, diligencing, negotiating, closing and integrating mergers and acquisitions.\n\n**Emma E. Giamartino** serves as a member of the Board of Directors. Ms. Giamartino is CBRE’s Executive Vice President of Corporate Development and Global Head of Mergers &amp; Acquisitions. She began her career at CBRE in February 2018, as Head of Mergers &amp; Acquisitions in the Americas. Prior to joining CBRE, Ms. Giamartino served as Director of Corporate Development at Verizon Communications, from 2015 to 2018, where she completed transactions across telematics, IoT, media, software and the core network. Previously, she worked in Nomura’s technology, media and telecommunications investment banking group, covering a wide range of sectors, including data and information services, software, media and digital content platforms, from 2010 to 2015. Ms. Giamartino received an M.B.A. from Columbia Business School and a B.S.E. from Duke University. She was selected to serve on our board of directors due to her experience in sourcing, diligencing, negotiating, closing and integrating mergers and acquisitions.\n\n**David S. Binswanger**, Senior Executive Vice President at Lincoln Property Company (“LPC”), an international real estate firm, will serve as a director following this offering. At LPC, Mr. Binswanger is responsible for the firm’s operations and principal acquisition and development projects throughout the U.S. west region. He also directs the delivery of all services to LPC’s clients in the west, including commercial real estate owners, investors, lenders and occupiers. Mr. Binswanger joined LPC in 1998 and has held various senior level positions within operations and finance, including Vice President of Finance and Executive Vice President overseeing the firm’s Southern California business unit. He received a B.B.A. from Southern Methodist University. He was selected to serve on our board of directors due to his experience as a real estate operator, with responsibility for significant acquisition and development projects.\n\n**Sarah E. Coyne**. Vice President at Value Act Capital, an investment company, will serve as a director following this offering. At ValueAct Capital, Ms. Coyne is responsible for evaluating investment opportunities and managing a diverse portfolio of investments and has been with the firm since September 2017. Prior to ValueAct, she served as Associate in the Technology, Media &amp; Telecommunications private equity group at KKR, from July 2015 to July 2017, and before that, a member of the Technology, Media &amp; Telecommunications investment banking group at Goldman Sachs, from July 2013 to March 2015. Ms. Coyne received a B.S. from the University of Pennsylvania’s Wharton School of Business. Ms. Coyne was selected to serve on our board of directors due to her experience in public and private investments, finance, accounting and mergers and acquisitions.\n\n**Jamie J. Hodari**, CEO and Co-founder of Industrious, a flexible workspace provider, will serve as director following this offering. Since 2013 at Industrious, he has led the growth to over 90 locations across more than 45 cities. Prior to this role, he served as CEO of Kepler from 2011 to 2013, a hedge fund analyst at Birch Run Capital from 2010 to 2011, a corporate lawyer at Sullivan &amp; Cromwell from 2009 to 2010, and a reporter for the Times of India from 2004 to 2005. He holds a J.D. from Yale Law School, an M.P.P. from Harvard University and a B.A. from Columbia University. Mr. Hodari was selected to serve on our board of directors due to his experience in entrepreneurship, venture capital financing and the evolving commercial real estate industry.\n\n**Michael J. Ellis**, Executive Vice President and Chief Customer &amp; Digital Officer at Johnson Controls, an international conglomerate that produces fire, heating, ventilation, air conditioning and security equipment for buildings, will serve as a director following this offering. At Johnson Controls, which he joined in 2019, Mr. Ellis oversees digital strategy, innovation and execution, working closely with customers to drive new growth and value opportunities across the globe. Prior to this role, he served as Global Managing Director of Accenture, from 2018 to 2019, and, before that, was President, Chairman and CEO of ForgeRock, a global digital security software company, from 2012 to 2018. Mr. Ellis received B.S. and B.A. from the University of Minnesota. Mr. Ellis was selected to serve on our board of directors due to his experiences in the global ecosystem of smarter buildings and the digitalization of the operations of commercial real estate.\n\n**SAILSM Securities**\n\nEach SAILSM security has an offering price of $10.00 and consists of one share of Class A common stock and **one-fourth of one redeemable warrant**. Each whole warrant entitles the holder thereof to purchase one share of Class A common stock at a price of **$11.00 per share**, subject to adjustment as described in this prospectus. Pursuant to the warrant agreement, a warrant holder may exercise its warrants only for a whole number of shares of our Class A common stock. This means only a whole warrant may be exercised at any given time by a warrant holder.\n\n***Alignment shares conversion***\n\nTLDR; If the share price performs well, they get a lot more shares. If it doesn't they get very few shares. The threshold price for comparison adjusts every year.\n\nOn the last day of each measurement period, which will occur **annually over ten fiscal years** following consummation of our initial business combination (and, with respect to any measurement period in which we have a change of control or in which we liquidate, dissolve or wind up, on the business day immediately prior to such event instead of on the last day of such measurement period), 201,250 alignment shares (or, 175,000 if the over-allotment option is not exercised) will automatically convert, subject to adjustment as described herein, into shares of our Class A common stock (“conversion shares”), as follows:\n\n• if the sum (such sum, the “Total   Return”) of (i) the VWAP, calculated in accordance with “—Volume   weighted average price” below, of shares of our Class A common stock for   the final fiscal quarter in such measurement period and (ii) the amount   per share of any dividends or distributions paid or payable to holders of our   Class A common stock, the record date for which is on or prior to the   last day of the measurement period, does not exceed the price threshold (as   defined below), the number of conversion shares for such measurement period   will be 2,013 shares of Class A common stock (or 1,750 if the   over-allotment option is not exercised);\n\n• if the Total Return exceeds the   price threshold but does not exceed an amount equal to 130% of the price   threshold, then the number of conversion shares for such measurement period   will be the greater of (i) 2,013 shares of Class A common stock (or   1,750 if the over-allotment option is not exercised) and (ii) 20% of the   difference between the Total Return and the price threshold, multiplied by   (A) the sum (such sum (as proportionally adjusted to give effect to any   stock splits, stock capitalizations, stock combinations, stock dividends,   reorganizations, recapitalizations or any such similar transactions), the   “Closing Share Count”) of (x) the number of shares of Class A   common stock outstanding immediately after the closing of this offering (including   any exercise of the over-allotment option) and (y) if in connection with   the initial business combination there are issued any shares of Class A   Common Stock or Equity-Linked Securities (as defined below), the number of   shares of Class A common stock so issued and the maximum number of   shares of Class A common stock issuable (whether settled in shares or in   cash) upon conversion or exercise of such Equity-Linked Securities, divided   by (B) the Total Return; and\n\n• if the Total Return exceeds an  amount equal to 130% of the price threshold, then the number of conversion  shares for such measurement period will be the greater of (i) 2,013 shares of   Class A common stock (or 1,750 if the over-allotment option is not exercised) and (ii) the sum of (x) 20% of the difference between an amount equal to 130% of the price threshold and the price threshold and (y)   30% of the difference between the Total Return and an amount equal to 130% of   the price threshold, multiplied by (A) the Closing Share Count, divided by (B) the Total Return.\n\n• The term “measurement period”  means (i) the period beginning on the date of our initial business   combination and ending with, and including, the first fiscal quarter following the end of the fiscal year in which we consummate our initial  business combination and (ii) each of the nine successive   four-fiscal-quarter periods.\n\n• The “price threshold” will  initially equal $10.00 for the first measurement period and will thereafter   be adjusted at the beginning of each subsequent measurement period to be  equal to the greater of (i) the price threshold for the immediately  preceding measurement period and (ii) the VWAP for the immediately  preceding measurement period (in each case, as proportionally adjusted to   give effect to any stock splits, stock capitalizations, stock combinations,  stock dividends, reorganizations, recapitalizations or any such similar  transactions).\n\n• For purposes of the above  calculation, “Equity-Linked Securities” means securities (other than the   public warrants and the private placement warrants) issued by the company  and/or any entities that (after giving effect to completion of the initial  business combination) are subsidiaries of the company that are directly or  indirectly convertible into or exercisable for shares of Class A common   stock, or for a cash settlement value in lieu thereof.\n\n• The foregoing calculations will be  based on our fiscal year and fiscal quarters, which may change as a result of  our initial business combination. Each conversion of alignment shares will  apply to the holders of alignment shares on a *pro rata* basis.  If, upon conversion of any alignment shares, a holder would be entitled to  receive a fractional interest in a share, we will round down to the nearest   whole number of the number of shares of Class A common stock to be  issued to such holder.\n\n&amp;#x200B;\n\n**This is not investment advice. Do your own due diligence.**",
        "subreddit": "SPACs",
        "title": "CBAHU Prospectus Highlights",
        "url": "https://www.reddit.com/r/SPACs/comments/l579ij/cbahu_prospectus_highlights/",
        "created": 1611668183.0
    },
    {
        "author": "ElonMusssssskl",
        "created_utc": 1611841771,
        "id": "l6x1da",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**DXC Technology** \\- only 28$ before Mike Salvino will sell assets nearly 5 bln $  \nAtos want to buy DXC with 2x bonus to price - ?!?!??!\n\n**Cloudera** received SOC-2 certificate, so it will be best CDP in the world\n\n**Ozon** \\- new Russian Amazon, can skyrocket like Jumia Technologies (African Amazon)\n\nDXC Technology - provides a multi-tier set of IT solutions for businesses in various industries: AI, analytics, partner ecosystem, cloud technologies, multi-cloud environment and migration, Internet of Things (IoT).\n\nTrading plan:\n\nBuy at $ 29.5 with a target price of $ 90, expected 3x growth over a 2-3 month horizon. We will exit the deal as the market situation develops; growth to a long-term goal of $ 90 by 275% is possible. We limit the risks at the level of $ 28.5 or 15%.\n\nReasons for growth:\n\n• Partnership with Microsoft\n\n• Teaming up with Infinia ML\n\n• Fast business recovery\n\n• Share buyback program\n\n• Fundamental underestimation\n\nFrom September 2018 to March 2020, DXC shares fell 92% due to an accelerated reorientation from IT outsourcing to the cloud, a significant increase in debt and lower profit forecasts. At the moment the company is successfully recovering. New CEO Mike Salvino previously led outsourcing for Accenture and has a track record of completing similar operations to stabilize the business.\n\nManagement announced major sales of non-core assets worth approximately $ 5 billion, more than 80% of current market capitalization, the proceeds from which will be used to pay off debt and buy back more than 1/3 of the outstanding shares in the next 10 months, which is a strong supporting factor.\n\nDXC now has about 6,000 clients, of which more than 200 are in the Fortune 500. On December 2, DXC announced a strategic partnership with Microsoft for flexible workspaces powered by DXC MyWorkStyle using artificial intelligence. DXC supports more than 1,000 customers in 67 countries, and virtually manages over 7.2 million devices and 1.3 million desktops, nearly double that of its closest competitor. DXC also manages over 8.2 million Microsoft Office 365 and Teams jobs.\n\nOn November 25, investors welcomed the news that DXC is using Infinia ML's machine learning capabilities to automate and predict behavior. Meanwhile, the DXC OmniLocation software environment is in demand from customers in the wave of business digitalization - it digitizes infrastructure, assets and operations, provides near-real-time process visualization and corporate data integration, uses geomatics - analytics and geospatial data management.\n\nFundamental analysis\n\nDXC stock is fundamentally undervalued, which is extremely rare in the industry, given the expected earnings from the trends of general digitalization and the transition to clouds, amplified by COVID. The expected price-to-earnings ratio (Forward P / E) per share is 6.8 - 4 times cheaper than the market average and 6 times better than the industry average. The price-to-earnings (P / S) ratio is 0.32, which in itself is an excellent indicator, 10 times cheaper than the US market norm. P / BV = 1.4 - 4 times cheaper than competitors.\n\nIn terms of price-to-free cash flow (P / FCF) ratio, it is 2 times cheaper than the industry. Earnings per share (EPS) is expected to rise by 68.39% next year. Quotations were constrained by the level of debt, which, as indicated above, are going to be cut. The average purchase price of the investment fund Greenlight Capital is $ 36 per share, which is 48% higher than current prices.\n\nTechnical analysis\n\nQuotes exceeded the resistance level of $ 21 and consolidated above the exponential moving averages for 20 and 200 days, the intersection of which signals the beginning of an upward trend and becomes the current strong support level",
        "subreddit": "wallstreetbets",
        "title": "New SkyRockets !!! 🚀🚀🚀🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6x1da/new_skyrockets/",
        "created": 1611870571.0
    },
    {
        "author": "AlyssonNunes",
        "created_utc": 1611762783,
        "id": "l67daa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "    NIO - GOOGL - MSFT - ROST - AAPL - HD - MA - ACN - MNST - DIS - ANSS - V - NKE\n    NTDOY - NFLX - ALGN - COST - NICE - ROL - TSLA - ROKU - ENPH - IRBT - NET - GRWG\n    PSA - PLD - O - AMT - WPC - MPW\n\nHello friends, I'm from Brazil and I'm studing stocks to begin investing. Those are some stocks that I'm analising / wanting to buy, so probably this is my future portfolio.\n\nLike any other newbie I want to read comments of those more experienced.\n\nThen please I seek your guidance, those stocks are good buys? Should I not buy some of then? Which? The number of stocks/reits are ok? Any other tip?\n\n&amp;#x200B;\n\nThanks in advance. And sorry for the bad english.",
        "subreddit": "stocks",
        "title": "New investor - Please help with my Portfolio.",
        "url": "https://www.reddit.com/r/stocks/comments/l67daa/new_investor_please_help_with_my_portfolio/",
        "created": 1611791583.0
    },
    {
        "author": "Rocketpod_",
        "created_utc": 1609883643,
        "id": "kr8tck",
        "num_comments": 204,
        "num_crossposts": 0,
        "selftext": "Imagine if you got in to Tesla, Amazon, Google, Netflix - before they were big. This is your chance.\n\n1. Can be used in literally any industry for any purpose\n2. Essentially reusing the same product, meaning there's no giant R&amp;D &amp; Production fees for each contract since things can be reused.\n3.  They've only recently been transitioning to civil and private contracts over government ones and look how profitable they are now, at the BEGINNING. \n4. Machine Learning Analytics and Data Aggregation is already HUGE! It will continue to grow every year. It's genuinely one of the greatest achievements in our time. *\"Person with XYZ , maybe 10% of R, at ABC? Okay they will probably do JKL.\"* This data and prediction is priceless to **everyone**. We could literally have machines choosing a treatment plan for patients and medicating them in real-time with the technology we have RIGHT NOW if we had the data and the guts to do it. We're already seeing AI assisted imaging being used to point out areas of interest in X-Rays.\n5. This company WILL be successful. It ALREADY is successful. Peter Thiel would have jumped ship a long time ago if it wasn't. \n6. The intelligence community wouldn't have been using it for 20 years if it wasn't worth it and couldn't keep up.\n\nGoogle when it first was founded wasn't the powerhouse it is today - and I bet analysts still were saying \"But look at their performance *right now!* It's not worth that! The stock is overvalued!!!!!\". \n\nPeople with any sort of tech background are **connecting the dots,** looking at other prominent technology companies as examples, and are willing to pay what these analysts say is \"premium\" or \"overpriced\".  Adobe, IBM, Google, Amazon, Tesla, etc. The list goes on.   \nThese analysts are only paying attention to the past and the present, not the future. \n\nIf it goes down a few days, weeks, months, after you bought it THATS OKAY. It will turn green eventually.\n\nPalantir is the future. Sell your chump stocks to buy more PLTR.\n\nWe begin lift off on demo day. Buy your tickets now. 🚀🚀🚀 🚀 🚀🚀🚀🚀 🚀 🚀",
        "subreddit": "wallstreetbets",
        "title": "All the PLTR bear \"analysts\" are out of touch and have no idea what they're talking about",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kr8tck/all_the_pltr_bear_analysts_are_out_of_touch_and/",
        "created": 1609912443.0
    },
    {
        "author": "PeterLundLV",
        "created_utc": 1610083637,
        "id": "ksw0my",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "I’d pick the following:\n\n1 - AAPL. Solid innovation, product pipeline, cash on hand, and consumer network. Services business will continue to grow and they could jump into other highly profitable categories as well, thanks to robust cash balances and R&amp;D teams. \n\n2 - TSLA. Still a lot of upside. Yes the valuation is crazy high, but they continue impress consumers and investors. They used to be mistaken as a software company that wishes they were a car company. Now people confuse them for a car company. They are far and away the worlds leading sustainable energy company and nobody is close behind them. \n\n3 - TTD. Lots of good growth this past year, but tons of runway in the digital streaming ad space. It’s TTD or Google. I like what TTD has to offer. Solid mgmt team.\n\nHonorable mentions. NIO, NCNO, UPST, ADBE, SHOP, MSFT, PYPL.",
        "subreddit": "investing",
        "title": "If you only get 3 stocks to buy and hold for the next five years, what are they?",
        "url": "https://www.reddit.com/r/investing/comments/ksw0my/if_you_only_get_3_stocks_to_buy_and_hold_for_the/",
        "created": 1610112437.0
    },
    {
        "author": "rkolodzi",
        "created_utc": 1610553994,
        "id": "kwjgsm",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "Deep Lake Capital Acquisition Corp. (DLCAU)  FINTECH PLAY\n\njust came out 5 minutes ago. The unit is trading very close to NAV. only at 10.55 right now for the Share AND the warrant.\n\nfree alpha: getting the entire unit is where the gains come from. You can sell the share at MINIMUM small gain, and then the warrants are free, absolutely zero risk.  \n\n\nDeep Lake Capital Acquisition, a blank check company led by former PayPal executives targeting the fintech sector, raised $180 million by offering 18 million units at $10. Each unit consists of one share of common stock and one-half of a warrant, exercisable at $11.50.  \n\n\nThe company is led by **CEO and Chairman Mark Lavelle**, who most recently was SVP of Commerce Cloud at Adobe and previously held various roles at eBay and PayPal; **President and Director Gary Marino**, who most recently served as EVP and Chief Commercial Officer at PayPal, where he worked for 11 years; and **CFO and Director Michael Cyrus**, co-founder and Partner at 7 Continents Global Expeditionary Operations. The company plans to target businesses in the financial technology, ecommerce software, and data and analytics sectors with enterprise values between $750 million to $1.5 billion.  \n\n\nDeep Lake Capital Acquisition plans to list on the Nasdaq under the symbol [DLCAU](https://www.renaissancecapital.com/Profile/DLCAU). Citi and Jefferies acted as lead managers on the deal.\n\n&amp;#x200B;\n\nJust started out with 5000 units",
        "subreddit": "SPACs",
        "title": "Great New SPAC UNIT close to NAV . PAYPAL MAFIA. Deep Lake Capital Acquisition Corp. (DLCAU)",
        "url": "https://www.reddit.com/r/SPACs/comments/kwjgsm/great_new_spac_unit_close_to_nav_paypal_mafia/",
        "created": 1610582794.0
    },
    {
        "author": "TheRedditRef",
        "created_utc": 1610940017,
        "id": "kzlxmu",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "DISCLAIMER *READ BEFORE YOU RESPOND*: My previous two posts and the massive receipt of messages have taught me a few lessons on how to manage you fucking idiots. \n1) I DO NOT PROVIDE SELL POINTS: when I make these posts, I’m telling you that within the period till expiration,  your call will be GREEN at some POINT. Stocks are typically sinusoidal on a trend line, so if you continue to HOLD once already green then you are have a HIGH chance of getting FUCKED. \n2) TAKE NOTE OF THE EXPIRATION DATE: Do not come onto my post, or message me before this period ends saying how I’ve cost you money. I don’t give a fuck if you can only afford weeklies, so don’t bitch that the stock doesn’t turn instantly to cater to your pathetic bank account \n3) I CANNOT PREDICT OVERALL MARKET SENTIMENT OR COMPANY NEWS, THE DATE OF THIS POST, IS THE DATE OF MY RESEARCH: Tomorrow we could find out this company has committed major fraud, or it’s CEO is involved in a human trafficking ring, I have the news I pay for and what’s offered for free. I will never pick dog shit companies, but I cannot add variables to my analysis that don’t exist. \n\n\n\nI’m back again, I hope that everyone got into my last recommendation (BBY) because it paid as most of them will. \n\nNext on the list is ADBE, as most companies with similar attributes, we see exceptional performance, exceptional management, and with further advancements in technology and office efficiency, the future is bright for Adobe. \n\nAdobe is once again back at the 440-460 range, below yearly trend averages, and since august has been fluctuating between the 440 and 510 range. We’re going to capitalize on this fluctuation, and on it’s current loss in bullish theta value. I recommend entering March ATM or ITM positions, and be ready for the possibility of holding through a level off or continued fall to the 445-450 range. I describe my trading strategy more in other posts, so feel free to look back if interested. If you’re someone with a big boy bank account and options knowledge feel free to message me for my recommendations on writing options or spreads, although I’m realizing that crowd is pretty much non-existent on this thread. \n\nThis is an easy one for a number of reasons, Adobe is essential, has a strong price floor, and despite minimal overall stock performance in the August to current period, we still see strong institutional backing and investment even from some of the most pessimistic of them all. I highly recommend capitalizing on this next fluctuation. \n\nThank you for those who have supported my posts and actually read the information, I’m truly rooting for you all and will continue to provide free money alerts as consistently as I see them.",
        "subreddit": "wallstreetbets",
        "title": "FREE MONEY ALERT [3]: Adobe ($ADBE) 3/19 450C",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kzlxmu/free_money_alert_3_adobe_adbe_319_450c/",
        "created": 1610968817.0
    },
    {
        "author": "NeoGenMike",
        "created_utc": 1610667027,
        "id": "kxhq40",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I've been reevaluating my protfolio and I'm 30 and tech heavy.\n\nIn my regular brokerage my techs are Amazon(21%),  Adobe(13%), Microsoft(7%), Apple(5%), Nvidia(2% for everything else), Cloudflare, Attlassian, Nintendo and a few others I like with about 65k distributed between them. The last few years have been VERY well to me because of this and these are all great companies that will probably be around for the next ten years, but I'm getting little worried about the bigger pullback that may or may not happen.\n\nI know plenty of other stocks within different sectors with similar gain and I've been debating on moving some of the money from my techs into those (Maybe half) because if things do drop then tech (The big winner) is probably going to be what is hit the hardest. But I'm just a joe everyman speculating about the market. Even without a pullback incoming do you think this current distribution is a bad idea?",
        "subreddit": "investing",
        "title": "Is 50% in tech too much?",
        "url": "https://www.reddit.com/r/investing/comments/kxhq40/is_50_in_tech_too_much/",
        "created": 1610695827.0
    },
    {
        "author": "DominatingLobster",
        "created_utc": 1611476012,
        "id": "l3vhoc",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "**Disclaimer:** \n\nI am a SWE College Student and not a Financial Analyst. I did this DD because I am passionate about tech and I think investing in tech firms would be a fun hobby in addition to my main job. This is for practice only and not financial advice. Any advice you all can give to improve my analysis would be greatly appreciated! \n\n**Background:**\n\nWhat is Dynatrace? Dynatrace is a product that seeks to track and analyze IT operations. It is an all-in-one product that has features for infrastructure monitoring, application security, business analytics, cloud automation, and more. In practical terms, Dynatrace helps automate DevOps processes, gives business insights, measures how new features are adopted by customers, and helps track vulnerabilities in your software. Here is a youtube demo video:\n\n[https://www.youtube.com/watch?v=0ihCziAJ07U](https://www.reddit.com/r/wallstreetbets/%22)\n\n**Other Players:**\n\nThe recent field of IT operations monitoring and analytics has seen a raping growth in the number of players. Its competitors include Splunk (IPO Date: 4/18/2012), New Relic (IPO Date: 12/12/2014), Elastic (IPO Date: 10/5/2018), Datadog (IPO Date: 4/19/2019), Sumo Logic (IPO Date: 9/17/2020) among others. Dynatrace is one of the newer players in this space, going public on 8/1/2019. \n\n**The Bull Case:**\n\nPersonally, I believe that Dynatrace is one of the stronger players in this field, and I think that there is a lot of room to grow. The reasons are as follows:  \n\n1. Strong Financials: Over the past year, Dynatrace has consistently beat the consensus EPS estimates by a significant margin. According to MarketBeat, in the most recent Earnings release on 10/28/2020, the consensus EPS estimate was $0.10 and the reported EPS was $0.18, beating the estimate by 80%. Of course, one argument could be that these earnings are inflated by the number of companies switching to technology and the cloud due to the coronavirus, but this trend has started as early as 2019, and in the 10/30/2019 Earnings release, the expected EPS was $0.04 and the reported EPS was $0.06, beating the estimate by 50%. One thing that interested me was that Dynatrace is one of the few software firms that are actually profitable, and has an annual recurring revenue growth rate of around 30%. Other big names in this space, such as Splunk and Datadog, have remained unprofitable by EBIT and GAAP measures respectively. Of course, Datadog’s numbers are deceptive, in that its unprofitability lies in their heavy stock compensation and it has a YOY growth rate of 83%. Dynatrace’s growth numbers do appear weak in comparison, but I believe that this is set to change. According to the Motely Fool, Dynatrace is seeking to grow its sales team by 20-25%. Currently, Dynatrace has a 70% win rate with enterprises they engage with, and if they are able to target more customers, I can see their revenue growth increasing as well. Currently Dynatrace has a market cap of 12.71 billion with a P/E ratio of 160.90. Compared to Datadog, which has a market cap of 31.98 billion with a P/E ratio of 548.84. This makes it seem undervalued in comparison. \n2. Strong Feature Set: I think that Dynatrace measures up to the heavy hitters in the data analytics software field. For example, we have Splunk, a data management and monitoring tool. With Splunk, you store logs and metrics and can create dashboards using the data you have ingested. Dynatrace offers similar features and includes features for the heavy lifting of acquiring the data through monitoring as well. The Dynatrace website has a comparison to Datadog as well. With Datadog, you have the data monitoring service, but you require analysts to interpret the data. Dynatrace offers artificial intelligence to interpret the data and answer questions. This is also just personal preference, but I think the UI is clean and attractive, a well-built product from an engineering perspective. Their tech stack is modern as well, from their job postings and StackShare, I gather they use Typescript, Node.js, React.js with D3.js for their graphing and charting. Honestly, their data visualizations are some of the best I have ever seen.\n3. Customer Sentiment: Dynatrace has a strong base of customers, supporting software and non tech giants as well. Customers include SAP, Citrix, Samsung, Adobe, Ebay, Experian, Abercrombie and Fitch, U-Haul, Porsche, and more. In G2 and Gartner, the product is rated 4.5 stars out of 5 with 973 reviewers and 1210 reviewers respectively. In both sites, competitors are usually rated around the same or lower, usually with much fewer reviews. Overall, I think the general customer consensus is that Dynatrace one of the best products in the market for its specific field.\n4.  Analyst Sentiment: According to MarketWatch, Dynatrace has a low price target of $40, a median price target of $50, and a high price target of $59 dollars. Its current price is $45.18. If analysts are correct about these prices, then we are seeing a potential 11.50% downside in the low price target, a 10.67% upside in the median price target, and a 30.59% upside in the high price target. According to the Wall Street Journal, 17 analysts have given a Buy rating, 2 analysts have given an overweight rating, and 2 analysts have given a Hold Rating. Recent Buy ratings have come from Rosenblatt Securities and Truist Securities. Rosenblatt Securities’ thesis is that Dynatrace is positioned to grow as it expands its total addressable market to $32 billion by breaking into the cloud application security market. Truist Securities’ thesis is that Dynatrace, following its transition to a subscription model is well positioned for substantial growth and profitability into the future. To add to this point, Truist Securities shows that subscription revenue has grown 36% YOY. \n\n**The Bear Case:**\n\nOf course, I think that any stock deserves a healthy bit of skepticism before investing. The most obvious points I can see are:\n\n1.  Crowded Market: The competitors I listed in the Other Players category are just the ones I could immediately think of from the top of my head from recruiting. There are definitely a lot more players and I expect consolidation in this field. After all, who needs 5 different IT monitoring tools? If Dynatrace is unable to innovate fast enough compared to its competitors, I can see this stock price plunging fast. Furthermore, this doesn’t even include the internal processes tech companies use to track and monitor their infrastructure. In other words, there are a lot of players fighting for what may be a smaller number of customers. \n2.  Market Forces: Even with strong earnings numbers, Dynatrace plunged with the market the last time an earnings report came. Earnings occurred 10/28/2020 and Dynatrace’s stock dropped 11% the same day. I assume this is due to uncertainty in the market as it was around the time of election but it is still concerning that it dropped so heavily despite a strong earnings report.\n3. Price: Despite being highly regarded on G2, one of the main complaints that users had were that this product is expensive compared to the competition. Dynatrace may argue that its full feature set is a justification for the price, but if users decide that they don’t need certain features or use other services to compensate, they are likely to go to one of its many competitors. This does not bode well if the market consolidation hypothesis is true, as being a jack of all trades without having a specific niche may actually end up harming Dynatrace in the long run. Another issue I see is that Datadog was able to discover a good niche among small and mid sized companies. Dynatrace's cost may inhibit it from competing with Datadog in that niche. Although perhaps this may not be too large of a concern as they are mostly competing for the world's largest 15,000 global enterprises which can afford the cost.\n\n**Upcoming News:**\n\nThe most important upcoming date is 2/3/2021. Hopefully without another election looming in the future, a strong earnings can push this stock up past its $50 price target. \n\n**Current Positions:** \n\n10 Shares at $46.98. After Apple and Microsoft Earnings, I plan to reinvest the money I have in them to buy more Dynatrace to hopefully bring the total to \\~$1k in preparation for earnings. I’m a poor college student but if I had more to invest I would.  \n\n&amp;#x200B;\n\nIf I missed anything or you guys have any feedback I would greatly appreciate it!\n\n&amp;#x200B;\n\nTL;DR: Dynatrace 🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "Dynatrace DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l3vhoc/dynatrace_dd/",
        "created": 1611504812.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1609689923,
        "id": "kpn2s9",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "What's up fellas at Options. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n&amp;#x200B;\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|WORK - Slack Technologies Inc - Class A|20.7B|$42.24|9%|\n|SPY - SSgA Active Trust - SSGA SPDR S&amp;P 500|330B|$373.88|16%|\n|VZ - Verizon Communications Inc|243B|$58.75|18%|\n|PEP - Pepsico Inc.|205B|$148.42|19%|\n|TM - Toyota Motor Corporation - ADR|252B|$154.57|20%|\n|COST - Costco Wholesale Corp|167B|$376.75|20%|\n|WMT - Walmart Inc|408B|$144.15|21%|\n|PG - Procter &amp; Gamble Co.|345B|$139.14|21%|\n|HD - Home Depot, Inc.|286B|$265.62|21%|\n|WM - Waste Management, Inc.|49.8B|$117.93|21%|\n|ORCL - Oracle Corp.|190B|$64.69|21%|\n|CSCO - Cisco Systems, Inc.|189B|$44.73|22%|\n|HSY - Hershey Company|31.7B|$152.33|22%|\n|MCD - McDonald\\`s Corp|160B|$214.58|22%|\n|KO - Coca-Cola Co|236B|$54.84|22%|\n|KR - Kroger Co.|24.2B|$31.76|23%|\n|QQQ - Invesco Capital Management LLC - Invesco QQQ Trust Series 1|153B|$314.19|23%|\n|NKE - Nike, Inc. - Class B|222B|$141.47|25%|\n|YUM - Yum Brands Inc.|32.7B|$108.56|25%|\n|MMM - 3M Co.|101B|$174.79|25%|\n|JNJ - Johnson &amp; Johnson|414B|$157.38|26%|\n|LOW - Lowe\\`s Cos., Inc.|118B|$160.51|26%|\n|T - AT&amp;T, Inc.|205B|$28.76|26%|\n|V - Visa Inc - Class A|482B|$218.73|26%|\n|MO - Altria Group Inc.|76.2B|$41.00|26%|\n|TGT - Target Corp|88.4B|$176.53|27%|\n|ABT - Abbott Laboratories|194B|$109.49|27%|\n|IWM - BlackRock Institutional Trust Company N.A. - BTC iShares Russell 2000|58.7B|$196.06|27%|\n|DE - Deere &amp; Co.|84.3B|$269.05|27%|\n|CVS - CVS Health Corp|89.4B|$68.30|27%|\n|BMY - Bristol-Myers Squibb Co.|140B|$62.03|27%|\n|DPZ - Dominos Pizza Inc|15.1B|$383.46|27%|\n|HSBC - HSBC Holdings plc - ADR|106B|$25.91|28%|\n|BX - Blackstone Group Inc (The) - Class A|43.7B|$64.81|28%|\n|DLTR - Dollar Tree Inc|25.4B|$108.04|28%|\n|ADBE - Adobe Inc|240B|$500.45|28%|\n|AZN - Astrazeneca plc - ADR|131B|$49.98|29%|\n|MSFT - Microsoft Corporation|1.68T|$222.83|29%|\n|SBUX - Starbucks Corp.|125B|$107.05|29%|\n|JPM - JPMorgan Chase &amp; Co.|387B|$127.07|29%|\n|HPQ - HP Inc|31.7B|$24.59|29%|\n|IBM - International Business Machines Corp.|112B|$125.88|29%|\n|UNH - Unitedhealth Group Inc|333B|$350.68|29%|\n|PFE - Pfizer Inc.|205B|$36.81|30%|\n|SNE - Sony Corporation. - ADR|127B|$101.10|30%|\n|DELL - Dell Technologies Inc - Class C|53.1B|$73.29|30%|\n|MA - Mastercard Incorporated - Class A|353B|$356.94|31%|\n|TXN - Texas Instruments Inc.|151B|$164.19|31%|\n|CRM - Salesforce.Com Inc|204B|$222.53|31%|\n|CAT - Caterpillar Inc.|98.9B|$182.02|31%|\n|BK - Bank Of New York Mellon Corp|37.6B|$42.44|31%|\n|BAC - Bank Of America Corp.|262B|$30.31|31%|\n|FDX - Fedex Corp|68.8B|$259.62|32%|\n|GS - Goldman Sachs Group, Inc.|90.7B|$263.71|32%|\n|ATVI - Activision Blizzard Inc|71.8B|$92.84|32%|\n|GOOGL - Alphabet Inc - Class A|1.18T|$1752.52|32%|\n|GOOG - Alphabet Inc - Class C|1.18T|$1753.86|32%|\n|WMB - Williams Cos Inc|24.3B|$20.05|32%|\n|UPS - United Parcel Service, Inc. - Class B|146B|$168.40|32%|\n|DIS - Walt Disney Co (The)|328B|$181.18|32%|\n|EA - Electronic Arts, Inc.|41.6B|$143.73|33%|\n|DD - DuPont de Nemours Inc|52.2B|$71.11|33%|\n|MS - Morgan Stanley|124B|$68.53|34%|\n|BKNG - Booking Holdings Inc|91.2B|$2224.35|34%|\n|GILD - Gilead Sciences, Inc.|73B|$58.27|34%|\n|NVDA - NVIDIA Corp|323B|$522.43|36%|\n|AMAT - Applied Materials Inc.|78.9B|$86.37|36%|\n|LULU - Lululemon Athletica inc.|43.5B|$348.13|36%|\n|AMZN - Amazon.com Inc.|1.63T|$3258.85|36%|\n|CMG - Chipotle Mexican Grill|38.8B|$1386.71|37%|\n|WDAY - Workday Inc - Class A|43.1B|$239.89|37%|\n|C - Citigroup Inc|128B|$61.66|37%|\n|GOLD - Barrick Gold Corp.|40.5B|$22.78|37%|\n|SPLK - Splunk Inc|27.5B|$169.99|37%|\n|EBAY - EBay Inc.|34.6B|$50.24|38%|\n|FOXA - Fox Corporation - Class A|17.3B|$29.12|38%|\n|TSM - Taiwan Semiconductor Manufacturing - ADR|565B|$109.04|38%|\n|AAPL - Apple Inc|2.26T|$132.65|38%|\n|BABA - Alibaba Group Holding Ltd - ADR|630B|$232.73|39%|\n|DB - Deutsche Bank AG|22.5B|$10.90|39%|\n|GM - General Motors Company|59.6B|$41.64|39%|\n|NOW - ServiceNow Inc|107B|$550.43|39%|\n|TTWO - Take-Two Interactive Software, Inc.|23.9B|$207.84|39%|\n|XOM - Exxon Mobil Corp.|174B|$41.22|40%|\n|F - Ford Motor Co.|34.3B|$8.79|40%|\n|QCOM - Qualcomm, Inc.|172B|$152.50|40%|\n|LOGI - Logitech International S.A.|16.8B|$97.21|40%|\n|LUV - Southwest Airlines Co|27.5B|$46.61|40%|\n|ARKF - ARK ETF Trust - ARK Fintech Innovation ETF|1.94B|$49.71|40%|\n|FB - Facebook Inc - Class A|780B|$273.59|40%|\n|ULTA - Ulta Beauty Inc|16.2B|$287.25|40%|\n|INTC - Intel Corp.|204B|$49.84|41%|\n|ARKW - ARK Investment Management LLC - ARK Next Generation Internet ETF|5.3B|$146.36|41%|\n|LVS - Las Vegas Sands Corp|45.5B|$59.60|41%|\n|WFC - Wells Fargo &amp; Co.|125B|$30.18|41%|\n|PZZA - Papa John\\`s International, Inc.|2.8B|$84.90|41%|\n|PYPL - PayPal Holdings Inc|274B|$234.58|41%|\n|MELI - MercadoLibre Inc|83.5B|$1673.23|41%|\n|WBA - Walgreens Boots Alliance Inc|34.5B|$39.88|41%|\n|ALLY - Ally Financial Inc|13.3B|$35.66|42%|\n|FIT - Fitbit Inc - Class A|1.67B|$6.80|42%|\n|TWTR - Twitter Inc|43.1B|$54.15|43%|\n|BP - BP plc - ADR|69.3B|$20.52|44%|\n|NFLX - NetFlix Inc|239B|$541.00|44%|\n|TEVA - Teva- Pharmaceutical Industries Ltd. - ADR|10.5B|$9.65|45%|\n|OKTA - Okta Inc - Class A|30.8B|$254.33|45%|\n|JD - JD.com Inc - ADR|137B|$87.96|45%|\n|RH - RH - Class A|9.13B|$447.52|45%|\n|PCG - PG&amp;E Corp.|24.7B|$12.46|45%|\n|EXPE - Expedia Group Inc|18B|$132.40|46%|\n|VALE - Vale S.A. - ADR|88.6B|$16.76|46%|\n|PBR - Petroleo Brasileiro S.A. Petrobras - ADR|23.5B|$11.23|46%|\n|UBER - Uber Technologies Inc|90B|$51.00|46%|\n|BA - Boeing Co.|121B|$214.06|47%|\n|ESTC - Elastic N.V|12.8B|$146.13|47%|\n|DBX - Dropbox Inc - Class A|7.01B|$22.18|48%|\n|SMAR - Smartsheet Inc - Class A|8.47B|$69.29|48%|\n|DOCU - DocuSign Inc|41.5B|$222.41|48%|\n|NOK - Nokia Corp - ADR|2.57B|$3.91|48%|\n|UAA - Under Armour Inc - Class A|7.22B|$17.17|48%|\n|TEAM - Atlassian Corporation Plc - Class A|30.9B|$234.14|49%|\n|SHAK - Shake Shack Inc - Class A|3.25B|$84.78|49%|\n|GE - General Electric Co.|94.6B|$10.80|49%|\n|MU - Micron Technology Inc.|84B|$75.19|49%|\n|YETI - YETI Holdings Inc|5.96B|$68.47|49%|\n|SHOP - Shopify Inc - Class A|136B|$1131.95|49%|\n|DAL - Delta Air Lines, Inc.|25.6B|$40.21|49%|",
        "subreddit": "options",
        "title": "Weekend IV Report - Tickers with low IV and cheap premiums",
        "url": "https://www.reddit.com/r/options/comments/kpn2s9/weekend_iv_report_tickers_with_low_iv_and_cheap/",
        "created": 1609718723.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649285,
        "id": "kpdy03",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://Stamps.com) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "SecurityAnalysis",
        "title": "Looking for Old Investment Letters on Companies (Case Studies)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kpdy03/looking_for_old_investment_letters_on_companies/",
        "created": 1609678085.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1609770292,
        "id": "kq9p1z",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": " **TL:DR is at the bottom**\n\nHello, welcome to my second deep dive write up.\n\nMy   name’s Mark and I’m an accountant with a passion for investing. About   two years ago, I used to work as an auditor at a public accounting firm   and have been behind the scenes at many different publicly traded and   privately held companies in the U.S. My goal is to bring my unique   perspective from that past experience, my current experience working in a   new role at a large corporation, and my understanding of accounting to   help break down some of the most exciting growth stocks on the market   today.\n\nI’m a long-term investor. I   am focused on finding great companies and holding them for a long  time.  I’m willing to endure volatility, crazy price drops, and  everything  that comes with this approach as long as the facts that led  me to  originally invest and believe in that company have not changed.  If you  want to learn more about this approach. I recommend reading the  book  “100 Baggers” by Chris Mayer.\n\n**Introduction**\n\nI’m   excited to share with you all my stock pick for this month,  Smartsheet.  I’m always looking for investment ideas. I run stock  screeners with  different criteria (mostly focused on revenue growth),  scan Twitter,  talk to professionals in different industries, and try to  observe what  products or services are getting popular with my friends  and family. One  of the best investment decisions I’ve made to date came  after I talked  to my friend about a drink he was drinking on the golf  course. Shout out  to you Celsius (CELH)! With that being said, you  never know where your  next good investment idea is going to come from.\n\nIn   the case of Smartsheet, I became aware of the company through a stock   screener. I was drawn to the relatively small market cap ($8.6B),  strong  revenue growth (roughly 35%), and the fact that it’s a  subscription  business model (SaaS). Once I became aware of these facts,  it cued me to  take a deeper dive. The more I learned about Smartsheet,  the more I  liked. Management talks a lot about empowering people and  that really  struck a chord with me. In different roles I’ve had as a  teacher, tutor,  and supervisor, I’ve always found empowering people to  be one of the  most important keys to success. I will touch on this more  later in the  write up.\n\nAnother  positive signal I  got about Smartsheet came unexpectedly one evening. I  was sitting in  the kitchen and my girlfriend was cooking dinner. I was  watching an  interview on my phone with Mark Mader, the CEO of  Smartsheet. My  girlfriend overheard the word “Smartsheet” mentioned in  the video and  said “Are they talking about the Smartsheet with the blue  check mark?”. I  had to Google their logo but yes, it turns out we were  thinking about  the same Smartsheet. I asked her how she knew about it.  She said “My  company just transitioned all of our work onto  Smartsheet. I really love  it. Our marketing department is really  excited about it because it  makes their job way easier and more  enjoyable.” Hearing this just  motivated me to learn more about  Smartsheet.\n\n**The Thesis Statement**\n\nFor   every stock pick I make, I want to provide a quick thesis statement   that can serve as a reminder for why I’m buying and holding that stock   for the long term. I’ll always aim to make it just a few sentences long   so it can easily be remembered and internalized. This helps during  times  when the price may sporadically drop and you need to remember why   you’re holding this position.\n\nThe thesis statement I have come up with for Smartsheet is as follows:\n\n*“Smartsheet:   A leader in collaborative work management (CWM) software. As the  global  workforce becomes more decentralized through remote work,  managers and  executives now more than ever need a tool to digitally  consolidate their  teams, projects and deadlines. Smartsheet is that  tool and is  innovating to offer businesses even more ways to get the  most out of  their teams.”*\n\nI  think this  thesis statement really captures the essence of what  Smartsheet does. If  you go to Smartsheet’s website and look at the  “About” page, you will  find their “About” statement which says  “Smartsheet is the enterprise  platform for dynamic work that aligns  people and technology so your  entire business can move faster, drive  innovation, and achieve more.”  Notice how their statement emphasizes  helping businesses move faster,  drive innovation, and achieve more.\n\nIn   my thesis statement, I mention that Smartsheet is a leader in the CWM   software space. But how do I know this? Well, a highly reputable   independent research firm named Forrester conducted a study on the CWM   space based off different criteria including collaboration, enterprise   capabilities, UI/user experience, planned enhancements and number of   customers just to name a few of the factors considered. I put the   companies that were identified from the study in the order of their   ranking below. As you can see, Smartsheet is firmly planted as a leader   in the space at 2nd place. Let’s use our common sense for a second. At   the beginning stages of a remote work revolution, do we want to invest   in an up and coming SaaS company that focuses on providing firms with   resources to digitally manage their teams, digitally manage   work/projects, and digitally collaborate to get work done? I think the   answer should be a resounding yes. But what about these other companies   on the list. Let’s break them down 1 by 1:\n\n* Workfront   was recently bought by Adobe. If you want to invest in Workfront,  you’d  have to invest in the much larger company of Adobe. It wouldn’t  be a  pure play investment into the CWM space.\n* Smartsheet is 2nd and of course, they are public :)\n* Wrike is private\n* ServiceNow   – CWM is just one small piece of their total      offerings. Investing   here would not be a pure play into the CWM space.  Also, the company  is  already quite large ($106B market cap)\n* Asana   is public but just IPO’d on 9/30/20 about 3 months ago. We don’t have   much data to track their performance as a      publicly traded company.   Furthermore, although they actually would be a pure play investment  into  the CWM space, they’re not a leader and rank behind Smartsheet in   several of Forrester’s categories. Why invest in the 2nd best when you   can invest in the best?\n* Monday.com is private\n* Microsoft – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space.\n* Atlassian   – This company does primarily focus on CWM but I have a couple  problems  with them as an investment. 1) They’re ranked way beneath  Smartsheet.  2) They’re already too big for me to confidently say they  can 10x  (market cap already $58B).\n\nNow   that we’ve established that Smartsheet is a leader in the CWM space  and  that they’re arguably the best publicly available pure-play  investment  in this space let’s understand why this is important. Other  than the  obvious reason that we’re in the beginning stages of a remote  work  revolution, why is this important?\n\nWell,   let’s take a look at this quote from Mark Mader, Smartsheet CEO,  during  the last earnings call (Q3 FY21) that occurred on December 7th,  2020:\n\n“Leaders  are recognizing  they need to shift more workloads to asynchronous work,  work that is  documented, automated, tracked with dashboards, and where  priorities  are clearly defined. They understand that by empowering their  teams  with no-code solutions that facilitate asynchronous work, cycle  times  will be improved, a deeper sense of ownership will be created, and   prioritization and accountability will be insured. Smartsheet is   ideally suited to help enterprises work more asynchronously to derive   the benefits from doing so.”\n\nKey word here: Asynchronous. Asynchronous communication is different from Synchronous communication. Here is the difference:\n\nAsynchronous: email, message boards, dashboards, etc.\n\nSynchronous: video conferencing, chat, audio calls, etc.\n\nAny   communication that doesn’t require a real-time response can be   considered asynchronous, like the examples in the picture above.   Synchronous communication is any communication that happens in real   time, thereby allowing for immediate responses, see examples above. As   part of my research on Smartsheet, I read an E-Book that was written by   the original co-founders of Smartsheet, Mark Mader the current CEO and   Brent Frei who is no longer with the company. They wrote the E-Book in   2007 just a couple of years after the 2005 founding. The E-Book is   called “The Power of Done”. The moral of the book is that Mark and Brent   noticed through their own experience, and through different research   studies on work place productivity, that the rise in technology in the   early 21st century was actually making employees less productive. This   is a quote from their E-Book:\n\n“According   to Basex, a research firm focusing on the knowledge economy,   interruptions from email, cell phones, instant messaging, text messaging   and blogs eat up nearly 30 percent of each day; on an annualized  basis,  this represents a loss of 28 billion hours for the entire U.S.   workforce, or a $588 billion cost to the American economy.”\n\nThey   mention in their book that although there has been a lot of advances  in  work technology such as email, word processing, and spreadsheets,  there  hadn’t at that time been any great applications created for  teamwork  collaboration or task management. The fact that technology  advances  helped the world create tools to enhance productivity but also  deterred  productivity at the same time is what Mark and Brent referred  to as the  productivity paradox. They wanted to do something about it  and thus they  founded Smartsheet.\n\n**How Smartsheet makes money**\n\nAt   the very least, before you invest in a company, you better understand   how they make money. In Chris Mayers’ excellent book, 100 Baggers, that  I  mentioned above, he continually references top line revenue growth  as  one of the main common indicators of a possible 100 Bagger. This  isn’t  to tell you that any stock I pick will be a 100 Bagger just  because it  has great top line revenue growth, but if I am looking at a  growth stock  to hold for the long term, revenue growth is one of the  first things I  look at.\n\nBefore I  talk about the  revenue streams of Smartsheet, I want to share a little  bit about the  actual product that they sell to earn this revenue.  Co-Founder/CEO Mark  Mader realized that a lot of work in the corporate  world was being done  on spreadsheets such as Microsoft Excel. However,  he realized that these  spreadsheets were largely static and not  necessarily used to their full  potential. He wanted to help people get  more out of their use of  spreadsheets. As a result, we now have  Smartsheets which is a cloud  based platform that can be accessed by all  employees of the company no  matter where they are with live  information about project statuses,  meeting times and work that is  assigned to each employee just to name a  few uses. Users can choose  their way of viewing this information with  different views such as  calendar view, grid view, card view, and Gantt  view.\n\nThe  idea is that by  enhancing the availability and quality of asynchronous  information  available to all members of a team about the status of a  project, the  tasks assigned, and the timelines, the less synchronous  communication  will be needed which allows employees to spend more time  doing what  they’re hired to do – get work done. Think about how  wasteful it is to  hire a highly talented engineer but then make him  spend half his day  preparing for and doing status update meetings and  hunting people down  to see where they’re at with their assignments.  What if all this  information was available for him, his managers, and  his staff to see  within Smartsheet without having to bother each other  and waste precious  work hours that could be used for coding, designing,  and producing?  That’s what Smartsheet looks to achieve.\n\nFor   Smartsheet, their means of making money is quite simple. As I  mentioned  earlier, they are a Software as a Service (SaaS) company.  Whenever you  see SaaS, that means subscription revenue and in my  opinion that’s a  very good thing. With a subscription business model,  the revenue is  going to be recurring every year and that type of  reliability (combined  with growth of course) is something you want as  an investor.\n\nSmartsheet’s  primary  source of revenue is the sale of subscriptions to their  cloud-based  Collaborative Work Management (CWM) platform. Customers and  potential  customers begin their engagement with the Smartsheet platform  by either  signing up for a free trial, purchasing a subscription on the   Smartsheet website, going through a sales rep, or they are exposed to   Smartsheet by collaborating with a Company/Individual that uses   Smartsheet.  For subscriptions, customers select the plan that meets   their needs and can begin using Smartsheet within minutes.\n\nSmartsheet   offers four subscription levels: Individual, Business, Enterprise, and   Premier, the pricing for which varies by the capabilities provided.   Customers can also purchase connectors, which provide data integration   and automation to third-party applications.\n\nThe   Connectors part of the business is something I find really  interesting.  Basically, Smartsheet has made deals with most of the top  work  productivity and communication software companies in the world to  allow  their customers to use those applications within their Smartsheet  user  interface. This helps position Smartsheet as the true “command  center”  platform while the products of the other companies become  ancillary  pieces. You’ll see this on the link above but some products  that  Smartsheet sells Connectors for include Adobe Creative Cloud,  Microsoft  Dynamics 365, Salesforce, Jira Software, Slack, and Skype  just to name a  few.\n\nI think that  being able to  sell these Connectors as ancillary pieces to the  Smartsheet user  experience is so beneficial to Smartsheet because a lot  of these  companies that people may perceive as “Smartsheet  competitors” actually  become a piece of the Smartsheet platform and can  be sold by Smartsheet  as a supplemental revenue stream. This neutral  angle that Smartsheet is  able to come from by selling Connectors to  their perceived “competitors”  reminds me a little bit of how Roku  (ROKU) is able to earn revenue off  of selling a Netflix subscription on  their platform. I think just the  fact that all these big companies  like Adobe, Jira, Salesforce, etc.  allow their products to be  integrated into Smartsheet shows that there  is a high value proposition  in the Smartsheet platform and that they  would risk alienating their  customers if they didn’t allow for their  products to be integrated with  Smartsheet.\n\nOn  top of the  Connectors to third party vendors that Smartsheet is able to  sell,  Smartsheet is also able to sell upgrades to their own internal   plug-ins. Smartsheet has some impressive proprietary plug-ins they can   sell to their customers. For example, in May 2019, Smartsheet acquired   10,000ft which augmented their product portfolio by providing resource   allocation and planning. The name “10,000ft” is meant to be analogous to   having a high level view of your company and all resources available   within your company and how to deploy them.\n\nAlso,   in September 2020, Smartsheet acquired Brandfolder, Inc. which  provides  a centralized platform to organize, discover, control,  distribute, and  measure all forms of digital content. Combining  Brandfolder capabilities  with Smartsheet allows them to create dynamic  solutions that manage  workflows around content and collaboration. This  goes back to what I  said earlier in the article about how my girlfriend  had mentioned that  her company’s marketing team was “really excited  about Smartsheet  because it makes their job way easier and more  enjoyable.” She told me  that before Smartsheet, her company’s marketing  team had to constantly  hunt down members of the creative team  (photographers, graphic  designers) to receive the latest photos,  videos, and digital designs  they were working on. She said it was a big  pain for them trying to  share this content over email and SharePoint.  Now, all of the content is  inside of Smartsheet and the marketing team  can access it at any time.  They can leave comments on the content,  route to appropriate individuals  for approvals, and have better insight  into the status of all digital  content that is being worked on. The  acquisition of Brandfolder is  really what allows Smartsheet to stand  out in this department.\n\nNobody   really talks about it, but digital content is so important these days   for companies in terms of controlling their brand image, putting out   quality advertisements, and presenting their product in as positive of a   light as possible. The fact that Smartsheet has a strong proprietary   plug-in for this with Brandfolder is very promising. During Smartsheet’s   FY21 Engage Customer Conference, Anna Griffin, Smartsheet Chief   Marketing Officer said that the global annual marketing spend is $500B   for companies around the world. She said the role of the marketing   department is changing from sole content creator to Editor in Chief. All   kinds of teams within companies these days are putting out content  that  effects the company’s brand. Sales is running social media  campaigns,  product marketing is putting out blog posts and podcasts,  and R&amp;D is  teasing new product experiences in app. It can get  really difficult for  the company’s Marketing/Branding team to stay on  top of all this  without a centralized digital content collaboration  platform like  Brandfolder in Smartsheet. This is just one reason why I  think  Smartsheet has a lot of growth opportunities in the future.\n\nAs   you can see, Smartsheet has a lot to offer to companies with their  core  CWM platform, the Connectors they can sell, and the internal  upgrades  available such as 10,000ft and Brandfolder. On top of that,  Smartsheet  also provides WorkApps, a proprietary no-code platform that  empowers  users to build intuitive web and mobile applications that  streamline  business and simplify collaboration. There are so many  instances within  companies where an app needs to be built to streamline  a workflow.  Traditionally, companies need to engage their IT  departments and the  coders that sit within these departments to build  these apps. This  places a lot of strain on IT departments and takes  away time they can be  spending on more complex/mission critical  projects. Mark Mader is aware  of this and thus is heavily pushing  no-code as a solution for companies  now and in the future. He believes  that everyday non-coder employees  know their jobs/workflows best and  thus if you empower them to build  their own apps with a no-code  platform they will produce better and more  relevant apps to help get  work done than an IT department employee who  doesn’t even do the job  that the app is being built for. Also, he  believes this will reduce  strain on IT departments and allow them to  focus on more complex and  mission critical projects.\n\nHere   is a quote from the Director of Sales (Hina Patel) at a Smartsheet   customer, Cisco (NASDAQ: CSCO): “I have been waiting for a solution like   WorkApps that can give us quick and easy access to the content we  need,  when and where we need it,” said Hina Patel, Director of Sales   Operations at Cisco. “The ability to take our Smartsheet assets, along   with other tools we use, and package an entire solution in an intuitive   app will make it even easier to drive active participation from  everyone  involved in the process, no matter their role.” As you can  see, the  value proposition of WorkApps and the Smartsheet platform  appears to be  high.\n\nLastly,  Smartsheet also  generates revenue from Professional Services which is  essentially  providing training and customized consulting to Smartsheet  customers  that want to get more out of the Smartsheet platform. In the  most recent  quarter, Q3 FY21, Professional Services accounted for 8.2%  of revenue.  Here is the breakout from the most recent quarter:\n\nSubscription revenue = $90,890M for 91.8% of total revenue\n\nProfessional services revenue = $8,043M for 8.2% of total revenue\n\nThis   is the end of my first article about Smartsheet. My goal is to drop   Part 2 within the next week. The focus of Part 2 will be an in depth   answer of the question – “Can we 10x from here?”\n\n**TL:DR**\n\n* This is Part 1 of my two part deep dive on Smartsheet (Ticker: SMAR).\n* This first part introduces you to (1) me, (2) the company, (3) my thesis on the company, and (4) digs into how they make money.\n* Part  2 (to be released later this week) will go in depth to explore the  question “Can we 10x from here?”\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I   am not a financial advisor and this is not investment advice. These  are  just my opinions to help facilitate learning and discussion.\n\n**Disclosure:**   I have no position in Smartsheet. I do plan to initiate a long  position  when the markets open again in 2021.  I wrote this article  myself, and  it expresses my own opinions. I am not receiving  compensation for it. I  have no business relationship with any company  whose stock is mentioned  in this article.",
        "subreddit": "SecurityAnalysis",
        "title": "Deep Dive Research About a Collaborative Work Management Company Poised to Benefit off the Remote Work Trend. NYSE Listed.",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kq9p1z/deep_dive_research_about_a_collaborative_work/",
        "created": 1609799092.0
    },
    {
        "author": "OfficerTruth",
        "created_utc": 1609942360,
        "id": "krolzd",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": " \n\n# APXT \n\n11/30/20 425 Filing:\n\nTranscript of APXT merging with AvePoint\n\n“AvePoint is the leading cloud software company for data governance and management in the Microsoft Cloud ecosystem. When we were looking for a company to merge with, we had five criteria. We wanted a company who is growing fast; profitable in a large market with great technology and experienced technical leadership and we found all five, check, check, check, check, check. So, we’re very excited about merging with AvePoint.” \n\n  \nKey Points: AvePoint is still an emerging SaaS company with 19 years of experience. They’ve met high growth criteria and have the resources of a large company, working in tandem with Microsoft and have access to software components where businesses only focus on one or two components.\n\n“We now have to file the merger proxy with the SEC and the deal is expected to close in the first quarter.” Excited for this merger as APXTU and APXTW now will be convertible as they expire 30 days after the complete business merger. It also gives us some time to do further research on AvePoint if necessary.\n\nAVPT new ticker symbol\n\n“Cloud software is growing very fast within the enterprise software world and there are 212 cloud software companies today that are public and if you use those criteria of scale, $150 million up in revenue in that range. Growth, 25% or faster growth and profitable, 10% or higher profit margin. Only five of those 212 companies meet that criteria and AvePoint will be the sixth. We’re growing our ARR and our recurring revenue by 30%. We have a 14% profit margin and we have a very large market in the Microsoft ecosystem.” \n\nKey Points: Some major statistics not only showing the rapid emergence of these companies in software and cloud computing, but also showing how AvePoint has been very successful in an increasingly diluted market. \n\n12/07/20 8K Filing:\n\nStock: APXT\n\nWarrants: APXTW\n\nUnits: APXTU\n\nUnits contain ½ a Warrant. One warrant redeemable for Class A stock at $11.50 share price.\n\n11/24/20 425 Filing:\n\n“Yes. Over 50% of our revenue comes from regulated industry, so public sector as an individual vertical is the biggest industry for us. That’s U.S. government, Western European government, Japanese, Singapore, Australia, and New Zealand government, then followed closely by financial services, healthcare, pharma, so very much regulated industries, manufacturing as well. Because again, our pedigree, where we started from is that we very much focus around Microsoft enterprise content management that was SharePoint on-prem and then we moved to cloud.” \n\nKey Points: AvePoint is similar to Palantir with respects to having contracts and recurring revenue with governments. AvePoint provides their services more globally as well as having a variety of services to offer.\n\n“If I can add, to follow-up on that, we’re growing our enterprise sales team by 50%, which is going to give us tremendous leverage and getting more new customers.” \n\nKey Points: Marketing will increase, 80% of their revenue is recurring, AvePoint is now increasing their marketing efforts. Small businesses are also a great niche they pointed out during the call. Although slightly different needs, AvePoint has software for everyone.\n\n“In this program, we’re top five globally, in the same group as DocuSign, Adobe, so asymmetrically, we’re very, very important to the Microsoft sales team, but today, less than 10% of revenue come from referrals that way. We are looking to significantly scale our business, as we said, the addressable market is so vast. Just Teams active user seats alone is 150 million; Office 365, in aggregate, is 250 million. We have 7 million today and we want to grow very, very quickly. The best way to capture that market share, it’s channel, it’s scaling through indirect sales, so that’s what we’re doing.” \n\nKey Points: Working with Microsoft, AvePoint has grown into their own shell, only having 10% of  revenue coming from the Microsoft partnership. High growth and strong self-reliance show a growing company who can fend its own against competition.\n\n“We have point competitors in the enterprise space, because we are offering the end-to-end information management story with a singular SaaS multi-tenant platform. For example, we have, just in the back of the enterprise space, we can compete against Commvault, for example, if Commvault is backing up the entirety of the enterprise. They will use Commvault for backup, but then they will use us for governance, right, for other aspects of our information management capabilities .” \n\nKey Points: AvePoint provides all different software needs, competing with other companies not on the entire software package, but certain aspects such as data management or cloud allocation. They can work with competition and their niche is really that they have everything so they can profit from a variety of softwares.\n\nFound under 11/23/30 8K Filing\n\n[https://www.sec.gov/Archives/edgar/data/0001777921/000121390020038639/ea130364ex99-2\\_apextech.htm](https://www.sec.gov/Archives/edgar/data/0001777921/000121390020038639/ea130364ex99-2_apextech.htm)\n\nAn interesting presentation on AvePoint acquisition. I didn’t look through the whole thing, lots of statistics, but I’ve gained from the discussion in 425 Filings that they’ve been successful and can continue to grow through the COVID-19 Pandemic and then as businesses still require cloud management and data storage.",
        "subreddit": "StockMarket",
        "title": "APXT Deep Dive Analysis",
        "url": "https://www.reddit.com/r/StockMarket/comments/krolzd/apxt_deep_dive_analysis/",
        "created": 1609971160.0
    },
    {
        "author": "websur",
        "created_utc": 1610997015,
        "id": "l01d91",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I'm looking at Adobe, and I don't understand how it's constantly getting poor ratings. Currently sitting at an support after 6 months of trading side ways, it seems like quite a pickup. Adobe isn't going to fail and despite not making ridiculous \"covid growth,\" it still outperformed the S &amp; P by nearly 2 times this past year. What am I missing? I understand the risk is always set forth, but for a mid-long play, how does this fail?",
        "subreddit": "stocks",
        "title": "Adobe soon to run",
        "url": "https://www.reddit.com/r/stocks/comments/l01d91/adobe_soon_to_run/",
        "created": 1611025815.0
    },
    {
        "author": "bridgeheadone",
        "created_utc": 1610486797,
        "id": "kw14xr",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I’m not going to present my  full DD on this as it’s mostly messy notes and spreadsheets. However, there are few things I want to highlight why I think this company should be valued higher.\n\n1) Consistently high annual growth to shareholders, actually besting Apple by 3% per year on average (25% since IPO)\n\n2) Very strong fundamentals, although P/E ratio\nis high at 45 the PEG ratio isn’t, it’s 1.6 (non GAAP adjusted) which is significantly lower than for example Microsoft, Google, Facebook etc which are trading well above 2 and up to 4.\n\n3) A balance sheet to die for, positive net debt. Yes. They have more cash than debt. They also buy back a ton of stock with this cash. \n\n4) Profit margin of 40% and FCF margin about the same so the profit is real. Real yummy cash flow. Consistent margin improvement, 20 to 40% and improving even more.\n\n5) Set up for future trends with growing social media usage and a SaaS business model. Can expand document signing business, lots of total accessible market available in all parts of the business.\n\n6) With their cash flow, balance sheet and size they could be an aggressive acquirer. DocuSign should tremble. A combined offer of cash and Adobe shares could easily sway DOCU sharesholders for example.\n\nIt seems like they have been a little forgotten. I think this is a good opportunity to get in. I have a price target of 600 in December and continuous 20% annual returns. \n\nPosition: 60 ADBE shares @468",
        "subreddit": "stocks",
        "title": "ADBE - Adobe, what’s not to like?",
        "url": "https://www.reddit.com/r/stocks/comments/kw14xr/adbe_adobe_whats_not_to_like/",
        "created": 1610515597.0
    },
    {
        "author": "louis_lafaille",
        "created_utc": 1611106033,
        "id": "l0yhp9",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "[Previously, on Guess the Company](https://www.reddit.com/r/StockMarket/comments/kydve1/guess_the_company_8_due_diligence_ticker_trivia/)\n\nHi fellow kids, I'm back again today with yet another DD where I reveal the ticker at the end rather than the beginning.\n\nLet's see how quickly you can figure out which company this is:\n\n\\-This California company began listing on NASDAQ last year by merging with a Special Purpose Acquisition Company (SPAC)\n\n\\-It received more than $600 million from the merger with the SPAC, giving it an enterprise value of over $4 billion.\n\n\\-This EV company expects to generate $1.43b of revenue by 2024, and $2.34b by 2025\n\n\\-This company had 2 changes of CEOs within a year\n\n\\-Its newest CEO compared himself to Elon Musk, whose involvement in Tesla drastically changed its trajectory and transformed it into the EV behemoth it is today\n\n\\-Its founders split off from struggling EV startup Faraday Future, who are also going public via a SPAC\n\n\\-Apple reportedly tried to buy this company last year, but was turned down\n\n\\-This company differentiates itself from other EV companies with its subscription-only model and unique \"skateboard\" design\n\n\\-Hyundai and Kia have struck a deal with this company to use this skateboard platform for their own electric vehicles\n\n\\-Limited production of their super-configurable vehicle with begin in 2022, with full-scale production coming in 2023\n\nHave you made your guess yet?\n\nIf you guessed &gt;!GOEV (Canoo Inc)!&lt;, you are correct!\n\n&gt;!Outlook for GOEV: The main problem that people seem to have with Canoo is its polarizing vehicle design--to put it gently.  As Tony Aquila have pointed out, however, Canoo's true potential lies in its skateboard platform technology. Its steel-by-wire system adds versatility by eliminating the mechanical steering connections between the cabin and skateboard, which means that the steering wheel can moved to anywhere in the vehicle cabin. While I am personally not a fan of its lifestyle vehicle designs, I believe that the skateboard platform will be tremendously useful as a \"canvas\" on which companies like Apple can paint their EV designs.!&lt;\n\n&gt;!The fact that Apple sought out to acquire this company speaks volumes about its potential. The fact Canoo turned them down is proof enough to me that they truly believe they have something special going on. If you saw my DD on Adobe Systems, you may recall that Adobe's founders turned down Steve Job's offer to buy them out in 1982 for $5 million. Today, Adobe is worth over $200 billion. !&lt;\n\n&gt;!HCAC / GOEV's stock price has been a rollercoaster ride since the merger announcement, hitting $22 in early December, bottoming at $12.50 in early Jan, recovering to $19 on rumors of partnerships with Apple/Hyundai, and falling again to where it is today at $16.68. If you believe in this company's long term prospect, however, you can ignore the noise and hold on tight to your shares.  (I will not be providing a price target because I am holding GOEV)!&lt;\n\nDisclaimer:  This is not financial or investment advice.",
        "subreddit": "StockMarket",
        "title": "Guess the Company #9 (due diligence / ticker trivia)",
        "url": "https://www.reddit.com/r/StockMarket/comments/l0yhp9/guess_the_company_9_due_diligence_ticker_trivia/",
        "created": 1611134833.0
    },
    {
        "author": "Zonties",
        "created_utc": 1610507172,
        "id": "kw7jm9",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "(I posted this in the day trading forum, noticed there are more people here.)\n\n\nWas just curious if anyone had any suggestions, Ever since adobe permanently disabled flash, shcwab has had a 40 second delay on their CNBC feed with new version. It used to be only 2 seconds before flash was axed.\n\nMy at&amp;t tv is delayed by 12 seconds. Ameritrade on thinkorswim is even worse now than schwab, 1 minute delay. Getting it fast w/minimal buffer allows quick trades to be capitalized on from what they say(cramer, josh brown, weiss, etc) or when they release \"breaking news\" right after i get it on other sources, which leads to very predictable scalping.\n\ndoes anyone know how to get a faster feed now given the situation; does the cnbc pro subscription service have a live feed? I've never tried it. It's 300 a year. Or maybe another online stream that doesn't have buffering? I can't be the only person looking for a solution. Lags eliminate the opportunity for these trades.",
        "subreddit": "stocks",
        "title": "live stream CNBC for trading or way of viewing with minimal buffering/lag?",
        "url": "https://www.reddit.com/r/stocks/comments/kw7jm9/live_stream_cnbc_for_trading_or_way_of_viewing/",
        "created": 1610535972.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1610472481,
        "id": "kvw5kq",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "What's up fellas at smallstreetbets. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|FIT - Fitbit Inc - Class A|1.72B|$7.00|17%|\n|VZ - Verizon Communications Inc|238B|$57.41|18%|\n|SPY - SSgA Active Trust - SSGA SPDR S&amp;P 500|334B|$378.37|18%|\n|COST - Costco Wholesale Corp|161B|$364.76|20%|\n|PG - Procter &amp; Gamble Co.|342B|$138.03|21%|\n|TM - Toyota Motor Corporation - ADR|250B|$153.69|21%|\n|WMT - Walmart Inc|417B|$147.30|21%|\n|WM - Waste Management, Inc.|49.5B|$117.05|22%|\n|PEP - Pepsico Inc.|196B|$142.08|22%|\n|ORCL - Oracle Corp.|186B|$62.99|22%|\n|KR - Kroger Co.|24.2B|$31.80|23%|\n|HD - Home Depot, Inc.|292B|$270.95|23%|\n|MCD - McDonald\\`s Corp|160B|$213.97|23%|\n|KO - Coca-Cola Co|216B|$50.16|24%|\n|HSY - Hershey Company|31.2B|$150.03|24%|\n|LOW - Lowe\\`s Cos., Inc.|122B|$166.23|25%|\n|MMM - 3M Co.|95.3B|$165.35|25%|\n|T - AT&amp;T, Inc.|206B|$28.86|25%|\n|NKE - Nike, Inc. - Class B|231B|$146.85|25%|\n|BMY - Bristol-Myers Squibb Co.|147B|$64.86|26%|\n|QQQ - Invesco Capital Management LLC - Invesco QQQ Trust Series 1|151B|$314.87|26%|\n|YUM - Yum Brands Inc.|32.5B|$107.49|26%|\n|MO - Altria Group Inc.|76.9B|$41.39|26%|\n|BX - Blackstone Group Inc (The) - Class A|42.3B|$62.84|27%|\n|JNJ - Johnson &amp; Johnson|420B|$159.25|27%|\n|V - Visa Inc - Class A|469B|$213.05|27%|\n|DPZ - Dominos Pizza Inc|15.4B|$390.63|27%|\n|DLTR - Dollar Tree Inc|26.4B|$112.18|28%|\n|IBM - International Business Machines Corp.|115B|$128.37|28%|\n|TGT - Target Corp|97.8B|$195.56|28%|\n|CVS - CVS Health Corp|99.6B|$75.99|28%|\n|HPQ - HP Inc|33.2B|$25.80|28%|\n|IWM - BlackRock Institutional Trust Company N.A. - BTC iShares Russell 2000|64.4B|$207.60|28%|\n|DE - Deere &amp; Co.|92.7B|$294.31|29%|\n|JPM - JPMorgan Chase &amp; Co.|421B|$137.91|29%|\n|MSFT - Microsoft Corporation|1.64T|$217.83|30%|\n|UNH - Unitedhealth Group Inc|342B|$360.05|30%|\n|PFE - Pfizer Inc.|210B|$37.69|30%|\n|CSCO - Cisco Systems, Inc.|192B|$45.53|30%|\n|DELL - Dell Technologies Inc - Class C|54.8B|$75.88|30%|\n|WORK - Slack Technologies Inc - Class A|20.6B|$42.19|31%|\n|ADBE - Adobe Inc|228B|$474.27|31%|\n|ABT - Abbott Laboratories|196B|$110.53|32%|\n|GILD - Gilead Sciences, Inc.|78.3B|$62.84|32%|\n|MA - Mastercard Incorporated - Class A|344B|$348.85|32%|\n|TXN - Texas Instruments Inc.|157B|$171.46|32%|\n|FDX - Fedex Corp|65B|$245.07|33%|\n|CRM - Salesforce.Com Inc|200B|$218.42|33%|\n|SNE - Sony Corporation. - ADR|131B|$103.74|33%|\n|BAC - Bank Of America Corp.|286B|$33.01|33%|\n|AZN - Astrazeneca plc - ADR|133B|$50.61|33%|\n|GOOGL - Alphabet Inc - Class A|1.19T|$1762.33|34%|\n|BK - Bank Of New York Mellon Corp|40.4B|$45.43|34%|\n|SBUX - Starbucks Corp.|122B|$104.48|34%|\n|GOOG - Alphabet Inc - Class C|1.19T|$1770.89|34%|\n|ATVI - Activision Blizzard Inc|70.3B|$91.00|34%|\n|DIS - Walt Disney Co (The)|324B|$179.01|35%|\n|UPS - United Parcel Service, Inc. - Class B|140B|$161.28|35%|\n|MS - Morgan Stanley|138B|$75.97|36%|\n|GS - Goldman Sachs Group, Inc.|101B|$293.19|36%|\n|LULU - Lululemon Athletica inc.|45.2B|$361.90|36%|\n|WDAY - Workday Inc - Class A|41.2B|$229.25|36%|\n|BKNG - Booking Holdings Inc|91B|$2219.47|36%|\n|WBA - Walgreens Boots Alliance Inc|41.2B|$47.66|36%|\n|DD - DuPont de Nemours Inc|61.6B|$84.11|37%|\n|HSBC - HSBC Holdings plc - ADR|112B|$27.54|37%|\n|C - Citigroup Inc|138B|$66.37|38%|\n|EA - Electronic Arts, Inc.|40.9B|$141.03|39%|\n|GOLD - Barrick Gold Corp.|41.8B|$23.55|39%|\n|AMAT - Applied Materials Inc.|89.6B|$97.78|39%|\n|EBAY - EBay Inc.|37.2B|$54.07|39%|\n|ULTA - Ulta Beauty Inc|16.3B|$289.55|39%|\n|AMZN - Amazon.com Inc.|1.56T|$3115.62|40%|\n|SPLK - Splunk Inc|26.9B|$167.31|40%|\n|FOXA - Fox Corporation - Class A|18B|$30.39|40%|\n|CAT - Caterpillar Inc.|105B|$193.79|40%|\n|WFC - Wells Fargo &amp; Co.|137B|$33.27|40%|\n|QCOM - Qualcomm, Inc.|176B|$155.97|41%|\n|PZZA - Papa John\\`s International, Inc.|3.07B|$93.28|41%|\n|WMB - Williams Cos Inc|26.1B|$21.54|41%|\n|ARKF - ARK ETF Trust - ARK Fintech Innovation ETF|2.09B|$50.96|41%|\n|XOM - Exxon Mobil Corp.|198B|$47.02|41%|\n|CMG - Chipotle Mexican Grill|39.2B|$1401.31|42%|\n|NVDA - NVIDIA Corp|337B|$546.22|42%|\n|TTWO - Take-Two Interactive Software, Inc.|23.7B|$206.99|42%|\n|INTC - Intel Corp.|211B|$51.56|42%|\n|AAPL - Apple Inc|2.17T|$129.09|42%|\n|NOW - ServiceNow Inc|102B|$524.21|42%|\n|ALLY - Ally Financial Inc|14B|$37.45|43%|\n|LUV - Southwest Airlines Co|28B|$47.40|43%|\n|PCG - PG&amp;E Corp.|24.2B|$12.16|43%|\n|BP - BP plc - ADR|82.3B|$24.38|43%|\n|F - Ford Motor Co.|36.3B|$9.28|43%|\n|LOGI - Logitech International S.A.|17.6B|$102.08|44%|\n|PYPL - PayPal Holdings Inc|278B|$238.09|44%|\n|ARKW - ARK Investment Management LLC - ARK Next Generation Internet ETF|5.69B|$154.83|44%|\n|MU - Micron Technology Inc.|88B|$78.56|45%|\n|TSM - Taiwan Semiconductor Manufacturing - ADR|636B|$122.58|45%|\n|MELI - MercadoLibre Inc|87.8B|$1763.60|45%|\n|PBR - Petroleo Brasileiro S.A. Petrobras - ADR|23.9B|$11.40|46%|\n|DISH - Dish Network Corp - Class A|17.2B|$32.77|47%|\n|FB - Facebook Inc - Class A|733B|$256.58|47%|\n|OKTA - Okta Inc - Class A|30.6B|$251.97|47%|\n|NFLX - NetFlix Inc|221B|$498.61|47%|\n|BA - Boeing Co.|117B|$206.85|48%|\n|RH - RH - Class A|9.97B|$487.07|48%|\n|ESTC - Elastic N.V|13.1B|$149.75|49%|\n|BABA - Alibaba Group Holding Ltd - ADR|615B|$226.72|49%|\n|GM - General Motors Company|64.4B|$45.13|49%|\n|GE - General Electric Co.|100B|$11.51|49%|\n|FEYE - FireEye Inc|5.23B|$23.14|49%|\n\n&amp;#x200B;",
        "subreddit": "smallstreetbets",
        "title": "IV Report - Tickers with low IV and cheaper premiums",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/kvw5kq/iv_report_tickers_with_low_iv_and_cheaper_premiums/",
        "created": 1610501281.0
    },
    {
        "author": "tinyraccoon",
        "created_utc": 1609832114,
        "id": "kqtdae",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "The analytics company stock has been on a roller coaster for the past year, to say the least.  Oddly, while most companies announce guidance on earnings day, AYX tends to make unscheduled guidance announcements, having done so at least twice already.  Also, their CEO got replaced by Mark Anderson from Palo Alto Networks (whom I learned also was at Anaplan for hardly six months before being sacked).  Today, they hired a new Chief Revenue Officer (didn't even know that was a thing).\n\nMy investment thesis was that with COVID-19 about to come to an end (seemingly so anyway), companies will need analytics to better assess the post-COVID world and to identify ways forward.  AYX is rated by Gartner to be one of the better analytics tools.  I know that AYX has an unusual method of revenue recognition by recognizing revenue up front as opposed to over the life of the contract, which means that getting new contracts is crucial to AYX (though it might not be as much for some other company like say ADBE).  Apparently, today's guidance reflects that the analytics headwinds might last longer than expected.    \n\nAnyway, I am roughly at break even and am wondering if any of you have insights into the company or its prospects.  Any help you can give would be much appreciated.",
        "subreddit": "stocks",
        "title": "Thoughts on $AYX",
        "url": "https://www.reddit.com/r/stocks/comments/kqtdae/thoughts_on_ayx/",
        "created": 1609860914.0
    },
    {
        "author": "DumplingGoddessTe",
        "created_utc": 1610723228,
        "id": "kxwbo6",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Friday, 15 January 2021\n\n*Live Updates*\n\n&amp;#x200B;\n\n**First Post:**\n\n[https://www.reddit.com/r/wallstreetbets/comments/kuwg1e/i\\_have\\_a\\_discount\\_trading\\_bot\\_which\\_gives\\_out/](https://www.reddit.com/r/wallstreetbets/comments/kuwg1e/i_have_a_discount_trading_bot_which_gives_out/)\n\n&amp;#x200B;\n\n**Background:**\n\n* My discount bot to help /r/wallstreetbets. It took me almost a year to develop it to my standard.\n* My private codes was used to develop it, and it's very unlikely I will sell it off to anyone or publish the code freely as it took me way too long to develop it. I rather post updates freely, at no cost to anyone than give out the code.\n* I will not be posting this hourly. It just too long to load everything up maybe in the future. I will post during open though.\n* Discord and telegram admins, don't try to monetize my bot suggestions to vulnerable people, when you don't even own the codes behind it.\n* There are a lot of SPY500/\"boomer\" companies within the bot, I thought about removing it but many people preferred that I kept it in there.\n* There won't be any sell signals, as stocks only go up, so I rather just do a discount algorithm.\n* Batch 1 = Algorithm/Bot + Human Judgement\n* Batch 2 = Algorithm/Bot Judgement Only\n* This is a one man bot.\n\n&amp;#x200B;\n\n**Bot Overview**:\n\nIt's showing an opportunity that you may have missed otherwise, so you can decide for yourself if you want to pursue the discount of a stock for potential profits. Backtesting has not been done, do not YOLO your life savings into whatever stated risking it all.  Rather use this as a side tool.\n\n&amp;#x200B;\n\n**Key:**\n\n* Pharma companies are very risky.\n* Meme/Hype stocks are very risky.\n* Companies that you don't know how they work are very risky.\n* Follower companies are very risky because they join the hype train (what NKLA is to TSLA).\n* I have a very low amount in options (less than $500), and I have 100k+ in shares and cash.\n* When doing options have a lot of collateral, so you don't hit margin call.\n* Take the \"Calls\" as very discounted, and \"Potentially A Call\" as somewhat discounted.\n* Old money companies are slow. While tech companies are fast-paced.\n* Only invest in companies that you do know and see potential in.\n* You don't have to invest every day, only when you see the potential.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;***At Close of Thursday***\n\n&amp;#x200B;\n\n**Batch 1:**\n\n* Data Processing &amp; Outsourced Services\tMA\tMastercard Inc\n* Financial Exchanges &amp; Data\tMKTX\tMarketAxess Holdings Inc.\n* Financial Exchanges &amp; Data\tMSCI\tMsci Inc\n* BMS\tBraemar Shipping Services plc\n* CSRA\tCisadane Sawit Raya PT\n\n*Maybe*:\n\n* CRSR\tCorsair Gaming Inc\n* TWTR\tTwitter Inc\n* Data Processing &amp; Outsourced Services\tFLT\tFleetCor Technologies, Inc.\n* Data Processing &amp; Outsourced Services\tGPN\tGlobal Payments Inc\n* Data Processing &amp; Outsourced Services\tJKHY\tJack Henry &amp; Associates, Inc.\n* Environmental &amp; Facilities Services\tROL\tRollins, Inc.\n* Financial Exchanges &amp; Data\tCME\tCME Group Inc\n* Health Care Equipment\tBDX\tBecton Dickinson and Co\n* Health Care Equipment\tDXCM\tDexCom, Inc.\n* Industrial Conglomerates\tROP\tRoper Technologies Inc\n* Interactive Media &amp; Services\tTWTR\tTwitter Inc\n* Internet Services &amp; Infrastructure\tVRSN\tVerisign, Inc.\n* Managed Health Care\tHUM\tHumana Inc\n* Pharmaceuticals\tPRGO\tPerrigo Company PLC\n* Restaurants\tDPZ\tDomino's Pizza, Inc.\n* Restaurants\tMCD\tMcdonald's Corp\n* Research &amp; Consulting Services\tINFO\tIHS Markit Ltd\n* TYL\tTyler Technologies, Inc.\n* DPZ\tDomino's Pizza, Inc.\n* DXCM\tDexCom, Inc.\n* JKHY\tJack Henry &amp; Associates, Inc.\n* GPN\tGlobal Payments Inc\n* FB\tFacebook, Inc. Common Stock\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Batch 2:**\n\n&amp;#x200B;\n\nCall:\n\n* Facebook, Inc. Common Stock\tFB\n* Automatic Data Processing Inc\tADP\n* Fidelity National Information Servcs Inc\tFIS\n* Brown-Forman Corporation Class B\tBF.B\n* MarketAxess Holdings Inc.\tMKTX\n* S&amp;P Global Inc\tSPGI\n* Twitter Inc\tTWTR\n* HRL\n* Kraft Heinz Co\tKHC\n* IHS Markit Ltd\tINFO\n* Coca-Cola Co\tKO\n* MarketAxess Holdings Inc.\tMKTX\n* IHS Markit Ltd\tINFO\n\n&amp;#x200B;\n\nPotential Call:\n\n* Air Transport Services Group Inc.\tATSG\n* Adobe Inc\tADBE\n* Paycom Software Inc\tPAYC\n* salesforce .com, inc.\tCRM\n* Tyler Technologies, Inc.\tTYL\n* Las Vegas Sands Corp.\tLVS\n* Fiserv Inc\tFISV\n* Global Payments Inc\tGPN\n* Mastercard Inc\tMA\n* Paychex, Inc.\tPAYX\n* Cintas Corporation\tCTAS\n* Alliant Energy Corporation\tLNT\n* American Electric Power Company Inc\tAEP\n* Consolidated Edison, Inc.\tED\n* Dominion Energy Inc\tD\n* Entergy Corporation\tETR\n* WEC Energy Group Inc\tWEC\n* Moody's Corporation\tMCO\n* Msci Inc\tMSCI\n* Atmos Energy Corporation\tATO\n* Church &amp; Dwight Co., Inc.\tCHD\n* Kimberly Clark Corp\tKMB\n* Roper Technologies Inc\tROP\n* W W Grainger Inc\tGWW\n* Verisign, Inc.\tVRSN\n* Ball Corporation\tBLL\n* Ameren Corp\tAEE\n* CenterPoint Energy Inc\tCNP\n* NiSource Inc.\tNI\n* Pinnacle West Capital Corporation\tPNW\n* Campbell Soup Company\tCPB\n* General Mills, Inc.\tGIS\n* J M Smucker Co\tSJM\n* Kellogg Company\tK\n* Domino's Pizza, Inc.\tDPZ\n* Realty Income Corp\tO\n* Pfizer Inc.\tPFE\n* Atmos Energy Corporation\tATO\n* Msci Inc\tMSCI\n* SBA Communications Corporation\tSBAC\n* Alliant Energy Corporation\tLNT\n* Global Payments Inc\tGPN\n* Church &amp; Dwight Co., Inc.\tCHD\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;***At Open of Friday***\n\n&amp;#x200B;\n\n**Batch 1:**\n\n* NRGU\tMicroSectors U S Big Oil Index 3X Leveraged ETN\n* DIG\tProShares Ultra Oil &amp; Gas\n* CSRA\tCisadane Sawit Raya PT\n\nMaybe:\n\n* GUSH\tDirexion Daily S&amp;P Oil &amp; Gas Exp &amp; Prod Bl 2X Shs\n* ERX\tDirexion Daily Energy Bull 2x Shares\n* WTI\tW&amp;T Offshore, Inc.\n* BP\tBP plc\n* Aerospace &amp; Defense\tTDG\tTransDigm Group Incorporated\n* Diversified Banks\tWFC\tWells Fargo &amp; Co\n* Integrated Oil &amp; Gas\tHES\tHess Corp.\n* Oil &amp; Gas Equipment &amp; Services\tHAL\tHalliburton Company\n* Oil &amp; Gas Equipment &amp; Services\tFTI\tTechnipFMC PLC\n* Oil &amp; Gas Exploration &amp; Production\tDVN\tDevon Energy Corp\n* Oil &amp; Gas Exploration &amp; Production\tEOG\tEOG Resources Inc\n* WCG\tWebcentral Group Ltd\n* ADS\tAlliance Data Systems Corporation\n* RIG\tTransocean LTD\n* MAC\tMacerich Co\n* HP\tHelmerich &amp; Payne, Inc.\n* ARG\tArgos Resources Ltd\n\n&amp;#x200B;\n\n**Batch 2:**\n\n&amp;#x200B;\n\nCall:\n\n* Automatic Data Processing Inc\tADP\n* Fidelity National Information Servcs Inc\tFIS\n* Brown-Forman Corporation Class B\tBF.B\n* MarketAxess Holdings Inc.\tMKTX\n* S&amp;P Global Inc\tSPGI\n* Facebook, Inc. Common Stock\tFB\n* Twitter Inc\tTWTR\n* IHS Markit Ltd\tINFO\n* Kraft Heinz Co\tKHC\n* Coca-Cola Co\tKO\n* Hormel Foods Corp\tHRL\n* MarketAxess Holdings Inc.\tMKTX\n* Kraft Heinz Co\tKHC\n\n&amp;#x200B;\n\nPotential Call:\n\n* Air Transport Services Group Inc.\tATSG\n* Adobe Inc\tADBE\n* Paycom Software Inc\tPAYC\n* salesforce .com, inc.\tCRM\n* Las Vegas Sands Corp.\tLVS\n* Fiserv Inc\tFISV\n* Global Payments Inc\tGPN\n* Mastercard Inc\tMA\n* Paychex, Inc.\tPAYX\n* Cintas Corporation\tCTAS\n* Alliant Energy Corporation\tLNT\n* American Electric Power Company Inc\tAEP\n* Consolidated Edison, Inc.\tED\n* salesforce .com, inc.\tCRM\n* Msci Inc\tMSCI\n* SBA Communications Corporation\tSBAC\n* Dominion Energy Inc\tD\n* Entergy Corporation\tETR\n* WEC Energy Group Inc\tWEC\n* SBA Communications Corporation\tSBAC\n* Moody's Corporation\tMCO\n* Msci Inc\tMSCI\n* Atmos Energy Corporation\tATO\n* Church &amp; Dwight Co., Inc.\tCHD\n* Kimberly Clark Corp\tKMB\n* Roper Technologies Inc\tROP\n* W W Grainger Inc\tGWW\n* Verisign, Inc.\tVRSN\n* Ball Corporation\tBLL\n* Domino's Pizza, Inc.\tDPZ\n* Realty Income Corp\tO\n* Ameren Corp\tAEE\n* CenterPoint Energy Inc\tCNP\n* NiSource Inc.\tNI\n* Pinnacle West Capital Corporation\tPNW\n* Campbell Soup Company\tCPB\n* Domino's Pizza, Inc.\tDPZ\n* Paycom Software Inc\tPAYC\n* Las Vegas Sands Corp.\tLVS\n* Atmos Energy Corporation\tATO\n* General Mills, Inc.\tGIS\n* Kellogg Company\tK\n* Pfizer Inc.\tPFE\n* Alliant Energy Corporation\tLNT\n* Global Payments Inc\tGPN\n* Church &amp; Dwight Co., Inc.\tCHD\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Update:**\n\nIt will be posted on WSB approx one hour before open, and the prices at open will be added within the hour of open.\n\nI will update as I go. For feedback, live updates, backups throughout the day check /r/WallStreetTrader or my post history.\n\nClose Batch 1 added: 8:32 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nClose Batch 2 added: 8:41am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nWaiting for open sync.\n\nClose Batch 1 added: 9:52 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA\n\nClose Batch 2 added: 10:05 am Friday, 15 January 2021 (GMT-5) Time in New York, NY, USA",
        "subreddit": "wallstreetbets",
        "title": "Post #5 Friday: I have a discount trading bot which gives out daily (well hourly discounts for the stock market). Here’s what the bot stated under discounted companies...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kxwbo6/post_5_friday_i_have_a_discount_trading_bot_which/",
        "created": 1610752028.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1609764721,
        "id": "kq865j",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**TL:DR is at the bottom**\n\nHello, welcome to my second deep dive write up.\n\nMy name’s Mark and I’m an accountant with a passion for investing. About two years ago, I used to work as an auditor at a public accounting firm and have been behind the scenes at many different publicly traded and privately held companies in the U.S. My goal is to bring my unique perspective from that past experience, my current experience working in a new role at a large corporation, and my understanding of accounting to help break down some of the most exciting growth stocks on the market today.\n\nI’m a long-term investor. I am focused on finding great companies and holding them for a long time. I’m willing to endure volatility, crazy price drops, and everything that comes with this approach as long as the facts that led me to originally invest and believe in that company have not changed. If you want to learn more about this approach. I recommend reading the book “100 Baggers” by Chris Mayer.\n\n**Introduction**\n\nI’m excited to share with you all my stock pick for this month, Smartsheet. I’m always looking for investment ideas. I run stock screeners with different criteria (mostly focused on revenue growth), scan Twitter, talk to professionals in different industries, and try to observe what products or services are getting popular with my friends and family. One of the best investment decisions I’ve made to date came after I talked to my friend about a drink he was drinking on the golf course. Shout out to you Celsius (CELH)! With that being said, you never know where your next good investment idea is going to come from.\n\nIn the case of Smartsheet, I became aware of the company through a stock screener. I was drawn to the relatively small market cap ($8.6B), strong revenue growth (roughly 35%), and the fact that it’s a subscription business model (SaaS). Once I became aware of these facts, it cued me to take a deeper dive. The more I learned about Smartsheet, the more I liked. Management talks a lot about empowering people and that really struck a chord with me. In different roles I’ve had as a teacher, tutor, and supervisor, I’ve always found empowering people to be one of the most important keys to success. I will touch on this more later in the write up.\n\nAnother positive signal I got about Smartsheet came unexpectedly one evening. I was sitting in the kitchen and my girlfriend was cooking dinner. I was watching an interview on my phone with Mark Mader, the CEO of Smartsheet. My girlfriend overheard the word “Smartsheet” mentioned in the video and said “Are they talking about the Smartsheet with the blue check mark?”. I had to Google their logo but yes, it turns out we were thinking about the same Smartsheet. I asked her how she knew about it. She said “My company just transitioned all of our work onto Smartsheet. I really love it. Our marketing department is really excited about it because it makes their job way easier and more enjoyable.” Hearing this just motivated me to learn more about Smartsheet.\n\n**The Thesis Statement**\n\nFor every stock pick I make, I want to provide a quick thesis statement that can serve as a reminder for why I’m buying and holding that stock for the long term. I’ll always aim to make it just a few sentences long so it can easily be remembered and internalized. This helps during times when the price may sporadically drop and you need to remember why you’re holding this position.\n\nThe thesis statement I have come up with for Smartsheet is as follows:\n\n*“Smartsheet: A leader in collaborative work management (CWM) software. As the global workforce becomes more decentralized through remote work, managers and executives now more than ever need a tool to digitally consolidate their teams, projects and deadlines. Smartsheet is that tool and is innovating to offer businesses even more ways to get the most out of their teams.”*\n\nI think this thesis statement really captures the essence of what Smartsheet does. If you go to Smartsheet’s website and look at the “About” page, you will find their “About” statement which says “Smartsheet is the enterprise platform for dynamic work that aligns people and technology so your entire business can move faster, drive innovation, and achieve more.” Notice how their statement emphasizes helping businesses move faster, drive innovation, and achieve more.\n\nIn my thesis statement, I mention that Smartsheet is a leader in the CWM software space. But how do I know this? Well, a highly reputable independent research firm named Forrester conducted a study on the CWM space based off different criteria including collaboration, enterprise capabilities, UI/user experience, planned enhancements and number of customers just to name a few of the factors considered. I put the companies that were identified from the study in the order of their ranking below. As you can see, Smartsheet is firmly planted as a leader in the space at 2nd place. Let’s use our common sense for a second. At the beginning stages of a remote work revolution, do we want to invest in an up and coming SaaS company that focuses on providing firms with resources to digitally manage their teams, digitally manage work/projects, and digitally collaborate to get work done? I think the answer should be a resounding yes. But what about these other companies on the list. Let’s break them down 1 by 1:\n\n* Workfront was recently bought by Adobe. If you want to invest in Workfront, you’d have to invest in the much larger company of Adobe. It wouldn’t be a pure play investment into the CWM space.\n* Smartsheet is 2nd and of course, they are public :)\n* Wrike is private\n* ServiceNow – CWM is just one small piece of their total      offerings. Investing here would not be a pure play into the CWM space.  Also, the company is already quite large ($106B market cap)\n* Asana is public but just IPO’d on 9/30/20 about 3 months ago. We don’t have much data to track their performance as a      publicly traded company. Furthermore, although they actually would be a pure play investment into the CWM space, they’re not a leader and rank behind Smartsheet in several of Forrester’s categories. Why invest in the 2nd best when you can invest in the best?\n* Monday.com is private\n* Microsoft – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space.\n* Atlassian – This company does primarily focus on CWM but I have a couple problems with them as an investment. 1) They’re ranked way beneath Smartsheet. 2) They’re already too big for me to confidently say they can 10x (market cap already $58B).\n\nNow that we’ve established that Smartsheet is a leader in the CWM space and that they’re arguably the best publicly available pure-play investment in this space let’s understand why this is important. Other than the obvious reason that we’re in the beginning stages of a remote work revolution, why is this important?\n\nWell, let’s take a look at this quote from Mark Mader, Smartsheet CEO, during the last earnings call (Q3 FY21) that occurred on December 7th, 2020:\n\n“Leaders are recognizing they need to shift more workloads to asynchronous work, work that is documented, automated, tracked with dashboards, and where priorities are clearly defined. They understand that by empowering their teams with no-code solutions that facilitate asynchronous work, cycle times will be improved, a deeper sense of ownership will be created, and prioritization and accountability will be insured. Smartsheet is ideally suited to help enterprises work more asynchronously to derive the benefits from doing so.”\n\nKey word here: Asynchronous. Asynchronous communication is different from Synchronous communication. Here is the difference:\n\nAsynchronous: email, message boards, dashboards, etc. \n\nSynchronous: video conferencing, chat, audio calls, etc. \n\nAny communication that doesn’t require a real-time response can be considered asynchronous, like the examples in the picture above. Synchronous communication is any communication that happens in real time, thereby allowing for immediate responses, see examples above. As part of my research on Smartsheet, I read an E-Book that was written by the original co-founders of Smartsheet, Mark Mader the current CEO and Brent Frei who is no longer with the company. They wrote the E-Book in 2007 just a couple of years after the 2005 founding. The E-Book is called “The Power of Done”. The moral of the book is that Mark and Brent noticed through their own experience, and through different research studies on work place productivity, that the rise in technology in the early 21st century was actually making employees less productive. This is a quote from their E-Book:\n\n“According to Basex, a research firm focusing on the knowledge economy, interruptions from email, cell phones, instant messaging, text messaging and blogs eat up nearly 30 percent of each day; on an annualized basis, this represents a loss of 28 billion hours for the entire U.S. workforce, or a $588 billion cost to the American economy.”\n\nThey mention in their book that although there has been a lot of advances in work technology such as email, word processing, and spreadsheets, there hadn’t at that time been any great applications created for teamwork collaboration or task management. The fact that technology advances helped the world create tools to enhance productivity but also deterred productivity at the same time is what Mark and Brent referred to as the productivity paradox. They wanted to do something about it and thus they founded Smartsheet.\n\n**How Smartsheet makes money**\n\nAt the very least, before you invest in a company, you better understand how they make money. In Chris Mayers’ excellent book, 100 Baggers, that I mentioned above, he continually references top line revenue growth as one of the main common indicators of a possible 100 Bagger. This isn’t to tell you that any stock I pick will be a 100 Bagger just because it has great top line revenue growth, but if I am looking at a growth stock to hold for the long term, revenue growth is one of the first things I look at.\n\nBefore I talk about the revenue streams of Smartsheet, I want to share a little bit about the actual product that they sell to earn this revenue. Co-Founder/CEO Mark Mader realized that a lot of work in the corporate world was being done on spreadsheets such as Microsoft Excel. However, he realized that these spreadsheets were largely static and not necessarily used to their full potential. He wanted to help people get more out of their use of spreadsheets. As a result, we now have Smartsheets which is a cloud based platform that can be accessed by all employees of the company no matter where they are with live information about project statuses, meeting times and work that is assigned to each employee just to name a few uses. Users can choose their way of viewing this information with different views such as calendar view, grid view, card view, and Gantt view. \n\nThe idea is that by enhancing the availability and quality of asynchronous information available to all members of a team about the status of a project, the tasks assigned, and the timelines, the less synchronous communication will be needed which allows employees to spend more time doing what they’re hired to do – get work done. Think about how wasteful it is to hire a highly talented engineer but then make him spend half his day preparing for and doing status update meetings and hunting people down to see where they’re at with their assignments. What if all this information was available for him, his managers, and his staff to see within Smartsheet without having to bother each other and waste precious work hours that could be used for coding, designing, and producing? That’s what Smartsheet looks to achieve.\n\nFor Smartsheet, their means of making money is quite simple. As I mentioned earlier, they are a Software as a Service (SaaS) company. Whenever you see SaaS, that means subscription revenue and in my opinion that’s a very good thing. With a subscription business model, the revenue is going to be recurring every year and that type of reliability (combined with growth of course) is something you want as an investor.\n\nSmartsheet’s primary source of revenue is the sale of subscriptions to their cloud-based Collaborative Work Management (CWM) platform. Customers and potential customers begin their engagement with the Smartsheet platform by either signing up for a free trial, purchasing a subscription on the Smartsheet website, going through a sales rep, or they are exposed to Smartsheet by collaborating with a Company/Individual that uses Smartsheet.  For subscriptions, customers select the plan that meets their needs and can begin using Smartsheet within minutes.\n\nSmartsheet offers four subscription levels: Individual, Business, Enterprise, and Premier, the pricing for which varies by the capabilities provided. Customers can also purchase connectors, which provide data integration and automation to third-party applications.\n\nThe Connectors part of the business is something I find really interesting. Basically, Smartsheet has made deals with most of the top work productivity and communication software companies in the world to allow their customers to use those applications within their Smartsheet user interface. This helps position Smartsheet as the true “command center” platform while the products of the other companies become ancillary pieces. You’ll see this on the link above but some products that Smartsheet sells Connectors for include Adobe Creative Cloud, Microsoft Dynamics 365, Salesforce, Jira Software, Slack, and Skype just to name a few.\n\nI think that being able to sell these Connectors as ancillary pieces to the Smartsheet user experience is so beneficial to Smartsheet because a lot of these companies that people may perceive as “Smartsheet competitors” actually become a piece of the Smartsheet platform and can be sold by Smartsheet as a supplemental revenue stream. This neutral angle that Smartsheet is able to come from by selling Connectors to their perceived “competitors” reminds me a little bit of how Roku (ROKU) is able to earn revenue off of selling a Netflix subscription on their platform. I think just the fact that all these big companies like Adobe, Jira, Salesforce, etc. allow their products to be integrated into Smartsheet shows that there is a high value proposition in the Smartsheet platform and that they would risk alienating their customers if they didn’t allow for their products to be integrated with Smartsheet.\n\nOn top of the Connectors to third party vendors that Smartsheet is able to sell, Smartsheet is also able to sell upgrades to their own internal plug-ins. Smartsheet has some impressive proprietary plug-ins they can sell to their customers. For example, in May 2019, Smartsheet acquired 10,000ft which augmented their product portfolio by providing resource allocation and planning. The name “10,000ft” is meant to be analogous to having a high level view of your company and all resources available within your company and how to deploy them. \n\nAlso, in September 2020, Smartsheet acquired Brandfolder, Inc. which provides a centralized platform to organize, discover, control, distribute, and measure all forms of digital content. Combining Brandfolder capabilities with Smartsheet allows them to create dynamic solutions that manage workflows around content and collaboration. This goes back to what I said earlier in the article about how my girlfriend had mentioned that her company’s marketing team was “really excited about Smartsheet because it makes their job way easier and more enjoyable.” She told me that before Smartsheet, her company’s marketing team had to constantly hunt down members of the creative team (photographers, graphic designers) to receive the latest photos, videos, and digital designs they were working on. She said it was a big pain for them trying to share this content over email and SharePoint. Now, all of the content is inside of Smartsheet and the marketing team can access it at any time. They can leave comments on the content, route to appropriate individuals for approvals, and have better insight into the status of all digital content that is being worked on. The acquisition of Brandfolder is really what allows Smartsheet to stand out in this department. \n\nNobody really talks about it, but digital content is so important these days for companies in terms of controlling their brand image, putting out quality advertisements, and presenting their product in as positive of a light as possible. The fact that Smartsheet has a strong proprietary plug-in for this with Brandfolder is very promising. During Smartsheet’s FY21 Engage Customer Conference, Anna Griffin, Smartsheet Chief Marketing Officer said that the global annual marketing spend is $500B for companies around the world. She said the role of the marketing department is changing from sole content creator to Editor in Chief. All kinds of teams within companies these days are putting out content that effects the company’s brand. Sales is running social media campaigns, product marketing is putting out blog posts and podcasts, and R&amp;D is teasing new product experiences in app. It can get really difficult for the company’s Marketing/Branding team to stay on top of all this without a centralized digital content collaboration platform like Brandfolder in Smartsheet. This is just one reason why I think Smartsheet has a lot of growth opportunities in the future.\n\nAs you can see, Smartsheet has a lot to offer to companies with their core CWM platform, the Connectors they can sell, and the internal upgrades available such as 10,000ft and Brandfolder. On top of that, Smartsheet also provides WorkApps, a proprietary no-code platform that empowers users to build intuitive web and mobile applications that streamline business and simplify collaboration. There are so many instances within companies where an app needs to be built to streamline a workflow. Traditionally, companies need to engage their IT departments and the coders that sit within these departments to build these apps. This places a lot of strain on IT departments and takes away time they can be spending on more complex/mission critical projects. Mark Mader is aware of this and thus is heavily pushing no-code as a solution for companies now and in the future. He believes that everyday non-coder employees know their jobs/workflows best and thus if you empower them to build their own apps with a no-code platform they will produce better and more relevant apps to help get work done than an IT department employee who doesn’t even do the job that the app is being built for. Also, he believes this will reduce strain on IT departments and allow them to focus on more complex and mission critical projects.\n\nHere is a quote from the Director of Sales (Hina Patel) at a Smartsheet customer, Cisco (NASDAQ: CSCO): “I have been waiting for a solution like WorkApps that can give us quick and easy access to the content we need, when and where we need it,” said Hina Patel, Director of Sales Operations at Cisco. “The ability to take our Smartsheet assets, along with other tools we use, and package an entire solution in an intuitive app will make it even easier to drive active participation from everyone involved in the process, no matter their role.” As you can see, the value proposition of WorkApps and the Smartsheet platform appears to be high.\n\nLastly, Smartsheet also generates revenue from Professional Services which is essentially providing training and customized consulting to Smartsheet customers that want to get more out of the Smartsheet platform. In the most recent quarter, Q3 FY21, Professional Services accounted for 8.2% of revenue. Here is the breakout from the most recent quarter:\n\nSubscription revenue = $90,890M for 91.8% of total revenue\n\nProfessional services revenue = $8,043M for 8.2% of total revenue\n\nThis is the end of my first article about Smartsheet. My goal is to drop Part 2 within the next week. The focus of Part 2 will be an in depth answer of the question – “Can we 10x from here?”\n\n  **TL:DR**\n\n* This is Part 1 of my two part deep dive on Smartsheet (Ticker: SMAR). \n* This first part introduces you to (1) me, (2) the company, (3) my thesis on the company, and (4) digs into how they make money.\n* Part 2 (to be released later this week) will go in depth to explore the question “Can we 10x from here?” If you enjoyed this article and want to make sure you catch Part 2, [subscribe here.](https://onthemarkpicks.com/subscribe-today/) \n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I am not a financial advisor and this is not investment advice. These are just my opinions to help facilitate learning and discussion.\n\n**Disclosure:** I have no position in Smartsheet. I do plan to initiate a long position when the markets open again in 2021.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.",
        "subreddit": "investing",
        "title": "Smartsheet (NYSE: SMAR) – Deep Dive Research – Part 1",
        "url": "https://www.reddit.com/r/investing/comments/kq865j/smartsheet_nyse_smar_deep_dive_research_part_1/",
        "created": 1609793521.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649315,
        "id": "kpdyaa",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://stamps.com/) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "investing",
        "title": "Looking for Old Investment Letters for the Following Companies",
        "url": "https://www.reddit.com/r/investing/comments/kpdyaa/looking_for_old_investment_letters_for_the/",
        "created": 1609678115.0
    },
    {
        "author": "reddit_commenter_1",
        "created_utc": 1610049304,
        "id": "ksl7lp",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**TL:DR is at the bottom**\n\nHello, welcome to my second deep dive write up.\n\nMy name’s Mark and I’m an accountant with a passion for investing. About two years ago, I used to work as an auditor at a public accounting firm and have been behind the scenes at many different publicly traded and privately held companies in the U.S. My goal is to bring my unique perspective from that past experience, my current experience working in a new role at a large corporation, and my understanding of accounting to help break down some of the most exciting growth stocks on the market today.\n\nI’m a long-term investor. I am focused on finding great companies and holding them for a long time. I’m willing to endure volatility, crazy price drops, and everything that comes with this approach as long as the facts that led me to originally invest and believe in that company have not changed. If you want to learn more about this approach. I recommend reading the book “100 Baggers” by Chris Mayer.\n\n**Introduction**\n\nI’m excited to share with you all my stock pick for this month, Smartsheet. I’m always looking for investment ideas. I run stock screeners with different criteria (mostly focused on revenue growth), scan Twitter, talk to professionals in different industries, and try to observe what products or services are getting popular with my friends and family. One of the best investment decisions I’ve made to date came after I talked to my friend about a drink he was drinking on the golf course. Shout out to you Celsius (CELH)! With that being said, you never know where your next good investment idea is going to come from.\n\nIn the case of Smartsheet, I became aware of the company through a stock screener. I was drawn to the relatively small market cap ($8.6B), strong revenue growth (roughly 35%), and the fact that it’s a subscription business model (SaaS). Once I became aware of these facts, it cued me to take a deeper dive. The more I learned about Smartsheet, the more I liked. Management talks a lot about empowering people and that really struck a chord with me. In different roles I’ve had as a teacher, tutor, and supervisor, I’ve always found empowering people to be one of the most important keys to success. I will touch on this more later in the write up.\n\nAnother positive signal I got about Smartsheet came unexpectedly one evening. I was sitting in the kitchen and my girlfriend was cooking dinner. I was watching an interview on my phone with Mark Mader, the CEO of Smartsheet. My girlfriend overheard the word “Smartsheet” mentioned in the video and said “Are they talking about the Smartsheet with the blue check mark?”. I had to Google their logo but yes, it turns out we were thinking about the same Smartsheet. I asked her how she knew about it. She said “My company just transitioned all of our work onto Smartsheet. I really love it. Our marketing department is really excited about it because it makes their job way easier and more enjoyable.” Hearing this just motivated me to learn more about Smartsheet.\n\n**The Thesis Statement**\n\nFor every stock pick I make, I want to provide a quick thesis statement that can serve as a reminder for why I’m buying and holding that stock for the long term. I’ll always aim to make it just a few sentences long so it can easily be remembered and internalized. This helps during times when the price may sporadically drop and you need to remember why you’re holding this position.\n\nThe thesis statement I have come up with for Smartsheet is as follows:\n\n*“Smartsheet: A leader in collaborative work management (CWM) software. As the global workforce becomes more decentralized through remote work, managers and executives now more than ever need a tool to digitally consolidate their teams, projects and deadlines. Smartsheet is that tool and is innovating to offer businesses even more ways to get the most out of their teams.”*\n\nI think this thesis statement really captures the essence of what Smartsheet does. If you go to Smartsheet’s website and look at the “About” page, you will find their “About” statement which says “Smartsheet is the enterprise platform for dynamic work that aligns people and technology so your entire business can move faster, drive innovation, and achieve more.” Notice how their statement emphasizes helping businesses move faster, drive innovation, and achieve more.\n\nIn my thesis statement, I mention that Smartsheet is a leader in the CWM software space. But how do I know this? Well, a highly reputable independent research firm named Forrester conducted a study on the CWM space based off different criteria including collaboration, enterprise capabilities, UI/user experience, planned enhancements and number of customers just to name a few of the factors considered. I put the companies that were identified from the study in the order of their ranking below. As you can see, Smartsheet is firmly planted as a leader in the space at 2nd place. Let’s use our common sense for a second. At the beginning stages of a remote work revolution, do we want to invest in an up and coming SaaS company that focuses on providing firms with resources to digitally manage their teams, digitally manage work/projects, and digitally collaborate to get work done? I think the answer should be a resounding yes. But what about these other companies on the list. Let’s break them down 1 by 1:\n\n* Workfront was recently bought by Adobe. If you want to invest in Workfront, you’d have to invest in the much larger company of Adobe. It wouldn’t be a pure play investment into the CWM space.\n* Smartsheet is 2nd and of course, they are public :)\n* Wrike is private\n* ServiceNow – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space. Also, the company is already quite large ($106B market cap)\n* Asana is public but just IPO’d on 9/30/20 about 3 months ago. We don’t have much data to track their performance as a publicly traded company. Furthermore, although they actually would be a pure play investment into the CWM space, they’re not a leader and rank behind Smartsheet in several of Forrester’s categories. Why invest in the 2nd best when you can invest in the best?\n* Monday.com is private\n* Microsoft – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space.\n* Atlassian – This company does primarily focus on CWM but I have a couple problems with them as an investment. 1) They’re ranked way beneath Smartsheet. 2) They’re already too big for me to confidently say they can 10x (market cap already $58B).\n\nNow that we’ve established that Smartsheet is a leader in the CWM space and that they’re arguably the best publicly available pure-play investment in this space let’s understand why this is important. Other than the obvious reason that we’re in the beginning stages of a remote work revolution, why is this important?\n\nWell, let’s take a look at this quote from Mark Mader, Smartsheet CEO, during the last earnings call (Q3 FY21) that occurred on December 7th, 2020:\n\n“Leaders are recognizing they need to shift more workloads to asynchronous work, work that is documented, automated, tracked with dashboards, and where priorities are clearly defined. They understand that by empowering their teams with no-code solutions that facilitate asynchronous work, cycle times will be improved, a deeper sense of ownership will be created, and prioritization and accountability will be insured. Smartsheet is ideally suited to help enterprises work more asynchronously to derive the benefits from doing so.”\n\nKey word here: Asynchronous. Asynchronous communication is different from Synchronous communication. Here is the difference:\n\nAsynchronous: email, message boards, dashboards, etc.\n\nSynchronous: video conferencing, chat, audio calls, etc.\n\nAny communication that doesn’t require a real-time response can be considered asynchronous, like the examples in the picture above. Synchronous communication is any communication that happens in real time, thereby allowing for immediate responses, see examples above. As part of my research on Smartsheet, I read an E-Book that was written by the original co-founders of Smartsheet, Mark Mader the current CEO and Brent Frei who is no longer with the company. They wrote the E-Book in 2007 just a couple of years after the 2005 founding. The E-Book is called “The Power of Done”. The moral of the book is that Mark and Brent noticed through their own experience, and through different research studies on work place productivity, that the rise in technology in the early 21st century was actually making employees less productive. This is a quote from their E-Book:\n\n“According to Basex, a research firm focusing on the knowledge economy, interruptions from email, cell phones, instant messaging, text messaging and blogs eat up nearly 30 percent of each day; on an annualized basis, this represents a loss of 28 billion hours for the entire U.S. workforce, or a $588 billion cost to the American economy.”\n\nThey mention in their book that although there has been a lot of advances in work technology such as email, word processing, and spreadsheets, there hadn’t at that time been any great applications created for teamwork collaboration or task management. The fact that technology advances helped the world create tools to enhance productivity but also deterred productivity at the same time is what Mark and Brent referred to as the productivity paradox. They wanted to do something about it and thus they founded Smartsheet.\n\n**How Smartsheet makes money**\n\nAt the very least, before you invest in a company, you better understand how they make money. In Chris Mayers’ excellent book, 100 Baggers, that I mentioned above, he continually references top line revenue growth as one of the main common indicators of a possible 100 Bagger. This isn’t to tell you that any stock I pick will be a 100 Bagger just because it has great top line revenue growth, but if I am looking at a growth stock to hold for the long term, revenue growth is one of the first things I look at.\n\nBefore I talk about the revenue streams of Smartsheet, I want to share a little bit about the actual product that they sell to earn this revenue. Co-Founder/CEO Mark Mader realized that a lot of work in the corporate world was being done on spreadsheets such as Microsoft Excel. However, he realized that these spreadsheets were largely static and not necessarily used to their full potential. He wanted to help people get more out of their use of spreadsheets. As a result, we now have Smartsheets which is a cloud based platform that can be accessed by all employees of the company no matter where they are with live information about project statuses, meeting times and work that is assigned to each employee just to name a few uses. Users can choose their way of viewing this information with different views such as calendar view, grid view, card view, and Gantt view.\n\nThe idea is that by enhancing the availability and quality of asynchronous information available to all members of a team about the status of a project, the tasks assigned, and the timelines, the less synchronous communication will be needed which allows employees to spend more time doing what they’re hired to do – get work done. Think about how wasteful it is to hire a highly talented engineer but then make him spend half his day preparing for and doing status update meetings and hunting people down to see where they’re at with their assignments. What if all this information was available for him, his managers, and his staff to see within Smartsheet without having to bother each other and waste precious work hours that could be used for coding, designing, and producing? That’s what Smartsheet looks to achieve.\n\nFor Smartsheet, their means of making money is quite simple. As I mentioned earlier, they are a Software as a Service (SaaS) company. Whenever you see SaaS, that means subscription revenue and in my opinion that’s a very good thing. With a subscription business model, the revenue is going to be recurring every year and that type of reliability (combined with growth of course) is something you want as an investor.\n\nSmartsheet’s primary source of revenue is the sale of subscriptions to their cloud-based Collaborative Work Management (CWM) platform. Customers and potential customers begin their engagement with the Smartsheet platform by either signing up for a free trial, purchasing a subscription on the Smartsheet website, going through a sales rep, or they are exposed to Smartsheet by collaborating with a Company/Individual that uses Smartsheet. For subscriptions, customers select the plan that meets their needs and can begin using Smartsheet within minutes.\n\nSmartsheet offers four subscription levels: Individual, Business, Enterprise, and Premier, the pricing for which varies by the capabilities provided. Customers can also purchase connectors, which provide data integration and automation to third-party applications.\n\nThe Connectors part of the business is something I find really interesting. Basically, Smartsheet has made deals with most of the top work productivity and communication software companies in the world to allow their customers to use those applications within their Smartsheet user interface. This helps position Smartsheet as the true “command center” platform while the products of the other companies become ancillary pieces. You’ll see this on the link above but some products that Smartsheet sells Connectors for include Adobe Creative Cloud, Microsoft Dynamics 365, Salesforce, Jira Software, Slack, and Skype just to name a few.\n\nI think that being able to sell these Connectors as ancillary pieces to the Smartsheet user experience is so beneficial to Smartsheet because a lot of these companies that people may perceive as “Smartsheet competitors” actually become a piece of the Smartsheet platform and can be sold by Smartsheet as a supplemental revenue stream. This neutral angle that Smartsheet is able to come from by selling Connectors to their perceived “competitors” reminds me a little bit of how Roku (ROKU) is able to earn revenue off of selling a Netflix subscription on their platform. I think just the fact that all these big companies like Adobe, Jira, Salesforce, etc. allow their products to be integrated into Smartsheet shows that there is a high value proposition in the Smartsheet platform and that they would risk alienating their customers if they didn’t allow for their products to be integrated with Smartsheet.\n\nOn top of the Connectors to third party vendors that Smartsheet is able to sell, Smartsheet is also able to sell upgrades to their own internal plug-ins. Smartsheet has some impressive proprietary plug-ins they can sell to their customers. For example, in May 2019, Smartsheet acquired 10,000ft which augmented their product portfolio by providing resource allocation and planning. The name “10,000ft” is meant to be analogous to having a high level view of your company and all resources available within your company and how to deploy them.\n\nAlso, in September 2020, Smartsheet acquired Brandfolder, Inc. which provides a centralized platform to organize, discover, control, distribute, and measure all forms of digital content. Combining Brandfolder capabilities with Smartsheet allows them to create dynamic solutions that manage workflows around content and collaboration. This goes back to what I said earlier in the article about how my girlfriend had mentioned that her company’s marketing team was “really excited about Smartsheet because it makes their job way easier and more enjoyable.” She told me that before Smartsheet, her company’s marketing team had to constantly hunt down members of the creative team (photographers, graphic designers) to receive the latest photos, videos, and digital designs they were working on. She said it was a big pain for them trying to share this content over email and SharePoint. Now, all of the content is inside of Smartsheet and the marketing team can access it at any time. They can leave comments on the content, route to appropriate individuals for approvals, and have better insight into the status of all digital content that is being worked on. The acquisition of Brandfolder is really what allows Smartsheet to stand out in this department.\n\nNobody really talks about it, but digital content is so important these days for companies in terms of controlling their brand image, putting out quality advertisements, and presenting their product in as positive of a light as possible. The fact that Smartsheet has a strong proprietary plug-in for this with Brandfolder is very promising. During Smartsheet’s FY21 Engage Customer Conference, Anna Griffin, Smartsheet Chief Marketing Officer said that the global annual marketing spend is $500B for companies around the world. She said the role of the marketing department is changing from sole content creator to Editor in Chief. All kinds of teams within companies these days are putting out content that effects the company’s brand. Sales is running social media campaigns, product marketing is putting out blog posts and podcasts, and R&amp;D is teasing new product experiences in app. It can get really difficult for the company’s Marketing/Branding team to stay on top of all this without a centralized digital content collaboration platform like Brandfolder in Smartsheet. This is just one reason why I think Smartsheet has a lot of growth opportunities in the future.\n\nAs you can see, Smartsheet has a lot to offer to companies with their core CWM platform, the Connectors they can sell, and the internal upgrades available such as 10,000ft and Brandfolder. On top of that, Smartsheet also provides WorkApps, a proprietary no-code platform that empowers users to build intuitive web and mobile applications that streamline business and simplify collaboration. There are so many instances within companies where an app needs to be built to streamline a workflow. Traditionally, companies need to engage their IT departments and the coders that sit within these departments to build these apps. This places a lot of strain on IT departments and takes away time they can be spending on more complex/mission critical projects. Mark Mader is aware of this and thus is heavily pushing no-code as a solution for companies now and in the future. He believes that everyday non-coder employees know their jobs/workflows best and thus if you empower them to build their own apps with a no-code platform they will produce better and more relevant apps to help get work done than an IT department employee who doesn’t even do the job that the app is being built for. Also, he believes this will reduce strain on IT departments and allow them to focus on more complex and mission critical projects.\n\nHere is a quote from the Director of Sales (Hina Patel) at a Smartsheet customer, Cisco (NASDAQ: CSCO): “I have been waiting for a solution like WorkApps that can give us quick and easy access to the content we need, when and where we need it,” said Hina Patel, Director of Sales Operations at Cisco. “The ability to take our Smartsheet assets, along with other tools we use, and package an entire solution in an intuitive app will make it even easier to drive active participation from everyone involved in the process, no matter their role.” As you can see, the value proposition of WorkApps and the Smartsheet platform appears to be high.\n\nLastly, Smartsheet also generates revenue from Professional Services which is essentially providing training and customized consulting to Smartsheet customers that want to get more out of the Smartsheet platform. In the most recent quarter, Q3 FY21, Professional Services accounted for 8.2% of revenue. Here is the breakout from the most recent quarter:\n\nSubscription revenue = $90,890M for 91.8% of total revenue\n\nProfessional services revenue = $8,043M for 8.2% of total revenue\n\nThis is the end of my first article about Smartsheet. My goal is to drop Part 2 within the next week. The focus of Part 2 will be an in depth answer of the question – “Can we 10x from here?”\n\n**TL:DR**\n\n* This is Part 1 of my two part deep dive on Smartsheet (Ticker: SMAR).\n* This first part introduces you to (1) me, (2) the company, (3) my thesis on the company, and (4) digs into how they make money.\n* Part 2 (to be released later this week) will go in depth to explore the question “Can we 10x from here?”\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I am not a financial advisor and this is not investment advice. These are just my opinions to help facilitate learning and discussion.\n\n**Disclosure:** I am long Smartsheet. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.",
        "subreddit": "investing",
        "title": "Smartsheet (NYSE: SMAR) – Deep Dive Research – Part 1",
        "url": "https://www.reddit.com/r/investing/comments/ksl7lp/smartsheet_nyse_smar_deep_dive_research_part_1/",
        "created": 1610078104.0
    },
    {
        "author": "PAPEGACLAP777777777",
        "created_utc": 1611251081,
        "id": "l23h3k",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Is Adobe worth the expensive price tag?",
        "url": "https://www.reddit.com/r/stocks/comments/l23h3k/is_adobe_worth_the_expensive_price_tag/",
        "created": 1611279881.0
    },
    {
        "author": "cpa_for_the_people_",
        "created_utc": 1609772334,
        "id": "kqab21",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " **TL:DR is at the bottom**\n\nHello, welcome to my second deep dive write up.\n\nMy   name’s Mark and I’m an accountant with a passion for investing. About   two years ago, I used to work as an auditor at a public accounting firm   and have been behind the scenes at many different publicly traded and   privately held companies in the U.S. My goal is to bring my unique   perspective from that past experience, my current experience working in a   new role at a large corporation, and my understanding of accounting to   help break down some of the most exciting growth stocks on the market   today.\n\nI’m a long-term investor. I   am focused on finding great companies and holding them for a long  time.  I’m willing to endure volatility, crazy price drops, and  everything  that comes with this approach as long as the facts that led  me to  originally invest and believe in that company have not changed.  If you  want to learn more about this approach. I recommend reading the  book  “100 Baggers” by Chris Mayer.\n\n**Introduction**\n\nI’m   excited to share with you all my stock pick for this month,  Smartsheet.  I’m always looking for investment ideas. I run stock  screeners with  different criteria (mostly focused on revenue growth),  scan Twitter,  talk to professionals in different industries, and try to  observe what  products or services are getting popular with my friends  and family. One  of the best investment decisions I’ve made to date came  after I talked  to my friend about a drink he was drinking on the golf  course. Shout out  to you Celsius (CELH)! With that being said, you  never know where your  next good investment idea is going to come from.\n\nIn   the case of Smartsheet, I became aware of the company through a stock   screener. I was drawn to the relatively small market cap ($8.6B),  strong  revenue growth (roughly 35%), and the fact that it’s a  subscription  business model (SaaS). Once I became aware of these facts,  it cued me to  take a deeper dive. The more I learned about Smartsheet,  the more I  liked. Management talks a lot about empowering people and  that really  struck a chord with me. In different roles I’ve had as a  teacher, tutor,  and supervisor, I’ve always found empowering people to  be one of the  most important keys to success. I will touch on this more  later in the  write up.\n\nAnother  positive signal I  got about Smartsheet came unexpectedly one evening. I  was sitting in  the kitchen and my girlfriend was cooking dinner. I was  watching an  interview on my phone with Mark Mader, the CEO of  Smartsheet. My  girlfriend overheard the word “Smartsheet” mentioned in  the video and  said “Are they talking about the Smartsheet with the blue  check mark?”. I  had to Google their logo but yes, it turns out we were  thinking about  the same Smartsheet. I asked her how she knew about it.  She said “My  company just transitioned all of our work onto  Smartsheet. I really love  it. Our marketing department is really  excited about it because it  makes their job way easier and more  enjoyable.” Hearing this just  motivated me to learn more about  Smartsheet.\n\n**The Thesis Statement**\n\nFor   every stock pick I make, I want to provide a quick thesis statement   that can serve as a reminder for why I’m buying and holding that stock   for the long term. I’ll always aim to make it just a few sentences long   so it can easily be remembered and internalized. This helps during  times  when the price may sporadically drop and you need to remember why   you’re holding this position.\n\nThe thesis statement I have come up with for Smartsheet is as follows:\n\n*“Smartsheet:   A leader in collaborative work management (CWM) software. As the  global  workforce becomes more decentralized through remote work,  managers and  executives now more than ever need a tool to digitally  consolidate their  teams, projects and deadlines. Smartsheet is that  tool and is  innovating to offer businesses even more ways to get the  most out of  their teams.”*\n\nI  think this  thesis statement really captures the essence of what  Smartsheet does. If  you go to Smartsheet’s website and look at the  “About” page, you will  find their “About” statement which says  “Smartsheet is the enterprise  platform for dynamic work that aligns  people and technology so your  entire business can move faster, drive  innovation, and achieve more.”  Notice how their statement emphasizes  helping businesses move faster,  drive innovation, and achieve more.\n\nIn   my thesis statement, I mention that Smartsheet is a leader in the CWM   software space. But how do I know this? Well, a highly reputable   independent research firm named Forrester conducted a study on the CWM   space based off different criteria including collaboration, enterprise   capabilities, UI/user experience, planned enhancements and number of   customers just to name a few of the factors considered. I put the   companies that were identified from the study in the order of their   ranking below. As you can see, Smartsheet is firmly planted as a leader   in the space at 2nd place. Let’s use our common sense for a second. At   the beginning stages of a remote work revolution, do we want to invest   in an up and coming SaaS company that focuses on providing firms with   resources to digitally manage their teams, digitally manage   work/projects, and digitally collaborate to get work done? I think the   answer should be a resounding yes. But what about these other companies   on the list. Let’s break them down 1 by 1:\n\n* Workfront   was recently bought by Adobe. If you want to invest in Workfront,  you’d  have to invest in the much larger company of Adobe. It wouldn’t  be a  pure play investment into the CWM space.\n* Smartsheet is 2nd and of course, they are public :)\n* Wrike is private\n* ServiceNow   – CWM is just one small piece of their total      offerings. Investing   here would not be a pure play into the CWM space.  Also, the company  is  already quite large ($106B market cap)\n* Asana   is public but just IPO’d on 9/30/20 about 3 months ago. We don’t have   much data to track their performance as a      publicly traded company.   Furthermore, although they actually would be a pure play investment  into  the CWM space, they’re not a leader and rank behind Smartsheet in   several of Forrester’s categories. Why invest in the 2nd best when you   can invest in the best?\n* Monday.com is private\n* Microsoft – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space.\n* Atlassian   – This company does primarily focus on CWM but I have a couple  problems  with them as an investment. 1) They’re ranked way beneath  Smartsheet.  2) They’re already too big for me to confidently say they  can 10x  (market cap already $58B).\n\nNow   that we’ve established that Smartsheet is a leader in the CWM space  and  that they’re arguably the best publicly available pure-play  investment  in this space let’s understand why this is important. Other  than the  obvious reason that we’re in the beginning stages of a remote  work  revolution, why is this important?\n\nWell,   let’s take a look at this quote from Mark Mader, Smartsheet CEO,  during  the last earnings call (Q3 FY21) that occurred on December 7th,  2020:\n\n“Leaders  are recognizing  they need to shift more workloads to asynchronous work,  work that is  documented, automated, tracked with dashboards, and where  priorities  are clearly defined. They understand that by empowering their  teams  with no-code solutions that facilitate asynchronous work, cycle  times  will be improved, a deeper sense of ownership will be created, and   prioritization and accountability will be insured. Smartsheet is   ideally suited to help enterprises work more asynchronously to derive   the benefits from doing so.”\n\nKey word here: Asynchronous. Asynchronous communication is different from Synchronous communication. Here is the difference:\n\nAsynchronous: email, message boards, dashboards, etc.\n\nSynchronous: video conferencing, chat, audio calls, etc.\n\nAny   communication that doesn’t require a real-time response can be   considered asynchronous, like the examples in the picture above.   Synchronous communication is any communication that happens in real   time, thereby allowing for immediate responses, see examples above. As   part of my research on Smartsheet, I read an E-Book that was written by   the original co-founders of Smartsheet, Mark Mader the current CEO and   Brent Frei who is no longer with the company. They wrote the E-Book in   2007 just a couple of years after the 2005 founding. The E-Book is   called “The Power of Done”. The moral of the book is that Mark and Brent   noticed through their own experience, and through different research   studies on work place productivity, that the rise in technology in the   early 21st century was actually making employees less productive. This   is a quote from their E-Book:\n\n“According   to Basex, a research firm focusing on the knowledge economy,   interruptions from email, cell phones, instant messaging, text messaging   and blogs eat up nearly 30 percent of each day; on an annualized  basis,  this represents a loss of 28 billion hours for the entire U.S.   workforce, or a $588 billion cost to the American economy.”\n\nThey   mention in their book that although there has been a lot of advances  in  work technology such as email, word processing, and spreadsheets,  there  hadn’t at that time been any great applications created for  teamwork  collaboration or task management. The fact that technology  advances  helped the world create tools to enhance productivity but also  deterred  productivity at the same time is what Mark and Brent referred  to as the  productivity paradox. They wanted to do something about it  and thus they  founded Smartsheet.\n\n**How Smartsheet makes money**\n\nAt   the very least, before you invest in a company, you better understand   how they make money. In Chris Mayers’ excellent book, 100 Baggers, that  I  mentioned above, he continually references top line revenue growth  as  one of the main common indicators of a possible 100 Bagger. This  isn’t  to tell you that any stock I pick will be a 100 Bagger just  because it  has great top line revenue growth, but if I am looking at a  growth stock  to hold for the long term, revenue growth is one of the  first things I  look at.\n\nBefore I  talk about the  revenue streams of Smartsheet, I want to share a little  bit about the  actual product that they sell to earn this revenue.  Co-Founder/CEO Mark  Mader realized that a lot of work in the corporate  world was being done  on spreadsheets such as Microsoft Excel. However,  he realized that these  spreadsheets were largely static and not  necessarily used to their full  potential. He wanted to help people get  more out of their use of  spreadsheets. As a result, we now have  Smartsheets which is a cloud  based platform that can be accessed by all  employees of the company no  matter where they are with live  information about project statuses,  meeting times and work that is  assigned to each employee just to name a  few uses. Users can choose  their way of viewing this information with  different views such as  calendar view, grid view, card view, and Gantt  view.\n\nThe  idea is that by  enhancing the availability and quality of asynchronous  information  available to all members of a team about the status of a  project, the  tasks assigned, and the timelines, the less synchronous  communication  will be needed which allows employees to spend more time  doing what  they’re hired to do – get work done. Think about how  wasteful it is to  hire a highly talented engineer but then make him  spend half his day  preparing for and doing status update meetings and  hunting people down  to see where they’re at with their assignments.  What if all this  information was available for him, his managers, and  his staff to see  within Smartsheet without having to bother each other  and waste precious  work hours that could be used for coding, designing,  and producing?  That’s what Smartsheet looks to achieve.\n\nFor   Smartsheet, their means of making money is quite simple. As I  mentioned  earlier, they are a Software as a Service (SaaS) company.  Whenever you  see SaaS, that means subscription revenue and in my  opinion that’s a  very good thing. With a subscription business model,  the revenue is  going to be recurring every year and that type of  reliability (combined  with growth of course) is something you want as  an investor.\n\nSmartsheet’s  primary  source of revenue is the sale of subscriptions to their  cloud-based  Collaborative Work Management (CWM) platform. Customers and  potential  customers begin their engagement with the Smartsheet platform  by either  signing up for a free trial, purchasing a subscription on the   Smartsheet website, going through a sales rep, or they are exposed to   Smartsheet by collaborating with a Company/Individual that uses   Smartsheet.  For subscriptions, customers select the plan that meets   their needs and can begin using Smartsheet within minutes.\n\nSmartsheet   offers four subscription levels: Individual, Business, Enterprise, and   Premier, the pricing for which varies by the capabilities provided.   Customers can also purchase connectors, which provide data integration   and automation to third-party applications.\n\nThe   Connectors part of the business is something I find really  interesting.  Basically, Smartsheet has made deals with most of the top  work  productivity and communication software companies in the world to  allow  their customers to use those applications within their Smartsheet  user  interface. This helps position Smartsheet as the true “command  center”  platform while the products of the other companies become  ancillary  pieces. You’ll see this on the link above but some products  that  Smartsheet sells Connectors for include Adobe Creative Cloud,  Microsoft  Dynamics 365, Salesforce, Jira Software, Slack, and Skype  just to name a  few.\n\nI think that  being able to  sell these Connectors as ancillary pieces to the  Smartsheet user  experience is so beneficial to Smartsheet because a lot  of these  companies that people may perceive as “Smartsheet  competitors” actually  become a piece of the Smartsheet platform and can  be sold by Smartsheet  as a supplemental revenue stream. This neutral  angle that Smartsheet is  able to come from by selling Connectors to  their perceived “competitors”  reminds me a little bit of how Roku  (ROKU) is able to earn revenue off  of selling a Netflix subscription on  their platform. I think just the  fact that all these big companies  like Adobe, Jira, Salesforce, etc.  allow their products to be  integrated into Smartsheet shows that there  is a high value proposition  in the Smartsheet platform and that they  would risk alienating their  customers if they didn’t allow for their  products to be integrated with  Smartsheet.\n\nOn  top of the  Connectors to third party vendors that Smartsheet is able to  sell,  Smartsheet is also able to sell upgrades to their own internal   plug-ins. Smartsheet has some impressive proprietary plug-ins they can   sell to their customers. For example, in May 2019, Smartsheet acquired   10,000ft which augmented their product portfolio by providing resource   allocation and planning. The name “10,000ft” is meant to be analogous to   having a high level view of your company and all resources available   within your company and how to deploy them.\n\nAlso,   in September 2020, Smartsheet acquired Brandfolder, Inc. which  provides  a centralized platform to organize, discover, control,  distribute, and  measure all forms of digital content. Combining  Brandfolder capabilities  with Smartsheet allows them to create dynamic  solutions that manage  workflows around content and collaboration. This  goes back to what I  said earlier in the article about how my girlfriend  had mentioned that  her company’s marketing team was “really excited  about Smartsheet  because it makes their job way easier and more  enjoyable.” She told me  that before Smartsheet, her company’s marketing  team had to constantly  hunt down members of the creative team  (photographers, graphic  designers) to receive the latest photos,  videos, and digital designs  they were working on. She said it was a big  pain for them trying to  share this content over email and SharePoint.  Now, all of the content is  inside of Smartsheet and the marketing team  can access it at any time.  They can leave comments on the content,  route to appropriate individuals  for approvals, and have better insight  into the status of all digital  content that is being worked on. The  acquisition of Brandfolder is  really what allows Smartsheet to stand  out in this department.\n\nNobody   really talks about it, but digital content is so important these days   for companies in terms of controlling their brand image, putting out   quality advertisements, and presenting their product in as positive of a   light as possible. The fact that Smartsheet has a strong proprietary   plug-in for this with Brandfolder is very promising. During Smartsheet’s   FY21 Engage Customer Conference, Anna Griffin, Smartsheet Chief   Marketing Officer said that the global annual marketing spend is $500B   for companies around the world. She said the role of the marketing   department is changing from sole content creator to Editor in Chief. All   kinds of teams within companies these days are putting out content  that  effects the company’s brand. Sales is running social media  campaigns,  product marketing is putting out blog posts and podcasts,  and R&amp;D is  teasing new product experiences in app. It can get  really difficult for  the company’s Marketing/Branding team to stay on  top of all this  without a centralized digital content collaboration  platform like  Brandfolder in Smartsheet. This is just one reason why I  think  Smartsheet has a lot of growth opportunities in the future.\n\nAs   you can see, Smartsheet has a lot to offer to companies with their  core  CWM platform, the Connectors they can sell, and the internal  upgrades  available such as 10,000ft and Brandfolder. On top of that,  Smartsheet  also provides WorkApps, a proprietary no-code platform that  empowers  users to build intuitive web and mobile applications that  streamline  business and simplify collaboration. There are so many  instances within  companies where an app needs to be built to streamline  a workflow.  Traditionally, companies need to engage their IT  departments and the  coders that sit within these departments to build  these apps. This  places a lot of strain on IT departments and takes  away time they can be  spending on more complex/mission critical  projects. Mark Mader is aware  of this and thus is heavily pushing  no-code as a solution for companies  now and in the future. He believes  that everyday non-coder employees  know their jobs/workflows best and  thus if you empower them to build  their own apps with a no-code  platform they will produce better and more  relevant apps to help get  work done than an IT department employee who  doesn’t even do the job  that the app is being built for. Also, he  believes this will reduce  strain on IT departments and allow them to  focus on more complex and  mission critical projects.\n\nHere   is a quote from the Director of Sales (Hina Patel) at a Smartsheet   customer, Cisco (NASDAQ: CSCO): “I have been waiting for a solution like   WorkApps that can give us quick and easy access to the content we  need,  when and where we need it,” said Hina Patel, Director of Sales   Operations at Cisco. “The ability to take our Smartsheet assets, along   with other tools we use, and package an entire solution in an intuitive   app will make it even easier to drive active participation from  everyone  involved in the process, no matter their role.” As you can  see, the  value proposition of WorkApps and the Smartsheet platform  appears to be  high.\n\nLastly,  Smartsheet also  generates revenue from Professional Services which is  essentially  providing training and customized consulting to Smartsheet  customers  that want to get more out of the Smartsheet platform. In the  most recent  quarter, Q3 FY21, Professional Services accounted for 8.2%  of revenue.  Here is the breakout from the most recent quarter:\n\nSubscription revenue = $90,890M for 91.8% of total revenue\n\nProfessional services revenue = $8,043M for 8.2% of total revenue\n\nThis   is the end of my first article about Smartsheet. My goal is to drop   Part 2 within the next week. The focus of Part 2 will be an in depth   answer of the question – “Can we 10x from here?”\n\n**TL:DR**\n\n* This is Part 1 of my two part deep dive on Smartsheet (Ticker: SMAR).\n* This first part introduces you to (1) me, (2) the company, (3) my thesis on the company, and (4) digs into how they make money.\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I  am not a financial advisor and this is not investment advice. These  are  just my opinions to help facilitate learning and discussion.\n\n**Disclosure:**   I have no position in Smartsheet. I do plan to initiate a long  position  when the markets open again in 2021.  I wrote this article  myself, and  it expresses my own opinions. I am not receiving  compensation for it. I  have no business relationship with any company  whose stock is mentioned  in this article.",
        "subreddit": "investing",
        "title": "Deep Dive Research About a Collaborative Work Management Company Poised to Benefit off the Remote Work Trend. NYSE Listed.",
        "url": "https://www.reddit.com/r/investing/comments/kqab21/deep_dive_research_about_a_collaborative_work/",
        "created": 1609801134.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1610053358,
        "id": "ksmp94",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "stocks",
        "title": "Adobe (ADBE)",
        "url": "https://www.reddit.com/r/stocks/comments/ksmp94/adobe_adbe/",
        "created": 1610082158.0
    },
    {
        "author": "TheyHaveTheVaccine",
        "created_utc": 1611034818,
        "id": "l0dc0k",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Set for the morning. Once my APPL, DIS, and ADBE sells settle, I'll buy more GME, too. Any other suggestions for what to sell for more GME fuel? (I just started trading in NOV, so I know some of these are dumb with the amount of shares. AHave taken some gains already, though).GME=Get More tEndies🚀",
        "url": "https://www.reddit.com/gallery/l0dc0k",
        "created": 1611063618.0
    },
    {
        "author": "pabloseason",
        "created_utc": 1611619632,
        "id": "l51dmx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello all,\n\nI’ve been doing some research on the below stocks and considering entering some positions in some/all of them. As per, they are high cap leaders in their industry but more risky than your traditional AAPL, MSFT, AMZN etc. \n\nAny input would be appreciated\n\n- ADBE\n- BKNG\n- GM\n- ISRG\n- MA\n- MELI\n- PYPL\n\nWhich would be the ones to allocate a larger % towards, and which to avoid?\n\nMany thanks",
        "subreddit": "ValueInvesting",
        "title": "5-10 Year Investment Horizon",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/l51dmx/510_year_investment_horizon/",
        "created": 1611648432.0
    },
    {
        "author": "monsow",
        "created_utc": 1611664873,
        "id": "l5d7mz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I already have heavy positions in cannabis and top tech (AAPL, AMZN, MSFT, GOOG, NFLX, NVDA, AMD, ADBE, SHOP). \n\nIdeally I'm looking for some medium risk companies in the tech sector. My favourites are currently Fastly &amp; Snowflake. I know some would say they're overpriced, but I think these are the prices one has to pay for growth companies, which I'm fine with.\n\nI wanted to hear if anybody has other recommendations for tickers I should consider?",
        "subreddit": "investing",
        "title": "Recommendations for medium risk long term holds?",
        "url": "https://www.reddit.com/r/investing/comments/l5d7mz/recommendations_for_medium_risk_long_term_holds/",
        "created": 1611693673.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1611493184,
        "id": "l3yzo0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What's up fellas at r/options. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|SPY - S&amp;P 500|341B|$383.90|15%|\n|VZ - Verizon Communi...|238B|$57.66|17%|\n|PG - Procter &amp; Gambl...|320B|$130.38|18%|\n|WM - Waste Managemen...|48.8B|$115.55|20%|\n|YUM - Yum Brands Inc....|32.3B|$107.33|20%|\n|COST - Costco Wholesal...|161B|$362.86|21%|\n|PEP - Pepsico Inc.|192B|$139.06|21%|\n|MCD - McDonald\\`s Corp...|159B|$213.67|22%|\n|WORK - Slack Technolog...|20.9B|$42.76|22%|\n|ORCL - Oracle Corp.|178B|$60.50|23%|\n|TM - Toyota Motor Co...|241B|$148.13|23%|\n|QQQ - Invesco Capital...|154B|$326.37|23%|\n|UNH - Unitedhealth Gr...|330B|$348.33|23%|\n|ABT - Abbott Laborato...|200B|$113.00|23%|\n|KO - Coca-Cola Co|208B|$48.63|24%|\n|HSY - Hershey Company...|30.8B|$148.42|24%|\n|BMY - Bristol-Myers S...|146B|$64.67|24%|\n|HD - Home Depot, Inc...|306B|$284.38|25%|\n|KR - Kroger Co.|25.6B|$33.55|25%|\n|NKE - Nike, Inc. - Cl...|219B|$139.86|25%|\n|WMT - Walmart Inc|414B|$146.52|25%|\n|IBM - International B...|106B|$118.36|25%|\n|PFE - Pfizer Inc.|203B|$36.63|26%|\n|BX - Blackstone Grou...|43.8B|$65.28|26%|\n|T - AT&amp;T, Inc.|206B|$29.04|26%|\n|V - Visa Inc - Clas...|445B|$202.28|26%|\n|DLTR - Dollar Tree Inc...|25.4B|$108.09|26%|\n|JNJ - Johnson &amp; Johns...|431B|$163.97|26%|\n|MMM - 3M Co.|97.5B|$169.72|27%|\n|JPM - JPMorgan Chase ...|408B|$134.16|27%|\n|MO - Altria Group In...|77.7B|$41.92|27%|\n|SBUX - Starbucks Corp....|121B|$104.45|27%|\n|TGT - Target Corp|96.1B|$191.97|27%|\n|CVS - CVS Health Corp...|97B|$74.29|28%|\n|IWM - BlackRock Insti...|65.4B|$214.59|28%|\n|ADBE - Adobe Inc|227B|$473.50|28%|\n|BK - Bank Of New Yor...|37.2B|$42.10|28%|\n|GILD - Gilead Sciences...|84B|$67.11|28%|\n|CSCO - Cisco Systems, ...|189B|$44.77|29%|\n|AZN - Astrazeneca plc...|140B|$53.23|29%|\n|GS - Goldman Sachs G...|99.6B|$290.36|30%|\n|MS - Morgan Stanley|134B|$74.35|30%|\n|MSFT - Microsoft Corpo...|1.71T|$227.04|30%|\n|DE - Deere &amp; Co.|96B|$306.28|30%|\n|BAC - Bank Of America...|273B|$31.66|30%|\n|TXN - Texas Instrumen...|159B|$173.42|30%|\n|MA - Mastercard Inco...|325B|$330.13|31%|\n|CAT - Caterpillar Inc...|104B|$192.22|31%|\n|INTC - Intel Corp.|232B|$56.84|32%|\n|GOOG - Alphabet Inc - ...|1.28T|$1907.03|32%|\n|FDX - Fedex Corp|67.4B|$254.80|32%|\n|SNE - Sony Corporatio...|128B|$101.22|33%|\n|GOOGL - Alphabet Inc - ...|1.28T|$1899.23|33%|\n|C - Citigroup Inc|128B|$61.43|33%|\n|NFLX - NetFlix Inc|250B|$568.11|33%|\n|LOGI - Logitech Intern...|18B|$104.11|34%|\n|WFC - Wells Fargo &amp; C...|132B|$32.01|34%|\n|ATVI - Activision Bliz...|73B|$94.36|34%|\n|EA - Electronic Arts...|42.3B|$146.21|35%|\n|WBA - Walgreens Boots...|41B|$47.35|35%|\n|UPS - United Parcel S...|137B|$159.81|35%|\n|LULU - Lululemon Athle...|43.4B|$346.73|35%|\n|LOW - Lowe\\`s Cos., In...|126B|$172.96|35%|\n|DIS - Walt Disney Co ...|313B|$173.08|35%|\n|WMB - Williams Cos In...|26.2B|$21.61|35%|\n|HPQ - HP Inc|32.6B|$25.33|36%|\n|ULTA - Ulta Beauty Inc...|16.9B|$300.31|36%|\n|BP - BP plc - ADR|80.6B|$23.80|36%|\n|CMG - Chipotle Mexica...|41.8B|$1500.68|36%|\n|AMZN - Amazon.com Inc....|1.65T|$3301.58|37%|\n|XOM - Exxon Mobil Cor...|201B|$47.50|37%|\n|BKNG - Booking Holding...|84.7B|$2074.22|38%|\n|GOLD - Barrick Gold Co...|41.7B|$23.49|38%|\n|ARKF - ARK ETF Trust -...|2.49B|$54.59|38%|\n|EBAY - EBay Inc.|38.9B|$56.35|38%|\n|HSBC - HSBC Holdings p...|113B|$27.86|38%|\n|PCG - PG&amp;E Corp.|23.3B|$11.82|38%|\n|SPLK - Splunk Inc|27.6B|$170.94|38%|\n|DELL - Dell Technologi...|55B|$76.12|38%|\n|DPZ - Dominos Pizza I...|15B|$380.81|39%|\n|TTWO - Take-Two Intera...|23.6B|$204.59|40%|\n|DD - DuPont de Nemou...|59.5B|$81.06|40%|\n|ALLY - Ally Financial ...|15.2B|$40.80|41%|\n|NOW - ServiceNow Inc|106B|$542.60|41%|\n|BABA - Alibaba Group H...|700B|$258.70|41%|\n|CRM - Salesforce.Com ...|207B|$226.31|41%|\n|AAPL - Apple Inc|2.34T|$139.62|41%|\n|AMAT - Applied Materia...|97.3B|$106.56|41%|\n|TSM - Taiwan Semicond...|670B|$129.55|41%|\n|PZZA - Papa John\\`s Int...|3.26B|$98.74|41%|\n|MU - Micron Technolo...|92.2B|$82.42|41%|\n|LUV - Southwest Airli...|28B|$47.45|42%|\n|WDAY - Workday Inc - C...|42.4B|$235.11|43%|\n|DB - Deutsche Bank A...|22.5B|$10.89|43%|\n|OKTA - Okta Inc - Clas...|32B|$263.63|43%|\n|ARKW - ARK Investment ...|6.45B|$164.76|43%|\n|FOXA - Fox Corporation...|17.7B|$30.25|44%|\n|QCOM - Qualcomm, Inc.|184B|$163.07|44%|\n|FB - Facebook Inc - ...|784B|$274.89|44%|\n|PBR - Petroleo Brasil...|21.3B|$10.21|44%|\n|RH - RH - Class A|10.2B|$501.10|45%|\n|PYPL - PayPal Holdings...|295B|$250.33|46%|\n|NVDA - NVIDIA Corp|340B|$549.84|46%|\n|BA - Boeing Co.|116B|$206.30|46%|\n|DAL - Delta Air Lines...|25.5B|$40.06|46%|\n|LVS - Las Vegas Sands...|41.4B|$54.24|46%|\n|JD - JD.com Inc - AD...|148B|$95.14|47%|\n|ARKK - ARK Investment ...|22.9B|$145.96|47%|\n|GE - General Electri...|97.3B|$11.15|48%|\n|CLDR - Cloudera Inc|4.38B|$13.97|49%|\n|DOCU - DocuSign Inc|47.6B|$254.53|49%|",
        "subreddit": "options",
        "title": "Weekend IV Report - Tickers with low IV and cheaper premiums",
        "url": "https://www.reddit.com/r/options/comments/l3yzo0/weekend_iv_report_tickers_with_low_iv_and_cheaper/",
        "created": 1611521984.0
    },
    {
        "author": "hbcondo",
        "created_utc": 1610590473,
        "id": "kwvyto",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SecurityAnalysis",
        "title": "Form 13H Issues Caused by Adobe Flash Player End of Life",
        "url": "https://www.sec.gov/oit/announcement/form-13h-issues",
        "created": 1610619273.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1610762988,
        "id": "ky9mw6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "I paid for adobe to make this",
        "url": "https://v.redd.it/6skn6vglrlb61",
        "created": 1610791788.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1609764824,
        "id": "kq874g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL:DR is at the bottom**\n\nHello, welcome to my second deep dive write up.\n\nMy  name’s Mark and I’m an accountant with a passion for investing. About  two years ago, I used to work as an auditor at a public accounting firm  and have been behind the scenes at many different publicly traded and  privately held companies in the U.S. My goal is to bring my unique  perspective from that past experience, my current experience working in a  new role at a large corporation, and my understanding of accounting to  help break down some of the most exciting growth stocks on the market  today.\n\nI’m a long-term investor. I  am focused on finding great companies and holding them for a long time.  I’m willing to endure volatility, crazy price drops, and everything  that comes with this approach as long as the facts that led me to  originally invest and believe in that company have not changed. If you  want to learn more about this approach. I recommend reading the book  “100 Baggers” by Chris Mayer.\n\n**Introduction**\n\nI’m  excited to share with you all my stock pick for this month, Smartsheet.  I’m always looking for investment ideas. I run stock screeners with  different criteria (mostly focused on revenue growth), scan Twitter,  talk to professionals in different industries, and try to observe what  products or services are getting popular with my friends and family. One  of the best investment decisions I’ve made to date came after I talked  to my friend about a drink he was drinking on the golf course. Shout out  to you Celsius (CELH)! With that being said, you never know where your  next good investment idea is going to come from.\n\nIn  the case of Smartsheet, I became aware of the company through a stock  screener. I was drawn to the relatively small market cap ($8.6B), strong  revenue growth (roughly 35%), and the fact that it’s a subscription  business model (SaaS). Once I became aware of these facts, it cued me to  take a deeper dive. The more I learned about Smartsheet, the more I  liked. Management talks a lot about empowering people and that really  struck a chord with me. In different roles I’ve had as a teacher, tutor,  and supervisor, I’ve always found empowering people to be one of the  most important keys to success. I will touch on this more later in the  write up.\n\nAnother positive signal I  got about Smartsheet came unexpectedly one evening. I was sitting in  the kitchen and my girlfriend was cooking dinner. I was watching an  interview on my phone with Mark Mader, the CEO of Smartsheet. My  girlfriend overheard the word “Smartsheet” mentioned in the video and  said “Are they talking about the Smartsheet with the blue check mark?”. I  had to Google their logo but yes, it turns out we were thinking about  the same Smartsheet. I asked her how she knew about it. She said “My  company just transitioned all of our work onto Smartsheet. I really love  it. Our marketing department is really excited about it because it  makes their job way easier and more enjoyable.” Hearing this just  motivated me to learn more about Smartsheet.\n\n**The Thesis Statement**\n\nFor  every stock pick I make, I want to provide a quick thesis statement  that can serve as a reminder for why I’m buying and holding that stock  for the long term. I’ll always aim to make it just a few sentences long  so it can easily be remembered and internalized. This helps during times  when the price may sporadically drop and you need to remember why  you’re holding this position.\n\nThe thesis statement I have come up with for Smartsheet is as follows:\n\n*“Smartsheet:  A leader in collaborative work management (CWM) software. As the global  workforce becomes more decentralized through remote work, managers and  executives now more than ever need a tool to digitally consolidate their  teams, projects and deadlines. Smartsheet is that tool and is  innovating to offer businesses even more ways to get the most out of  their teams.”*\n\nI think this  thesis statement really captures the essence of what Smartsheet does. If  you go to Smartsheet’s website and look at the “About” page, you will  find their “About” statement which says “Smartsheet is the enterprise  platform for dynamic work that aligns people and technology so your  entire business can move faster, drive innovation, and achieve more.”  Notice how their statement emphasizes helping businesses move faster,  drive innovation, and achieve more.\n\nIn  my thesis statement, I mention that Smartsheet is a leader in the CWM  software space. But how do I know this? Well, a highly reputable  independent research firm named Forrester conducted a study on the CWM  space based off different criteria including collaboration, enterprise  capabilities, UI/user experience, planned enhancements and number of  customers just to name a few of the factors considered. I put the  companies that were identified from the study in the order of their  ranking below. As you can see, Smartsheet is firmly planted as a leader  in the space at 2nd place. Let’s use our common sense for a second. At  the beginning stages of a remote work revolution, do we want to invest  in an up and coming SaaS company that focuses on providing firms with  resources to digitally manage their teams, digitally manage  work/projects, and digitally collaborate to get work done? I think the  answer should be a resounding yes. But what about these other companies  on the list. Let’s break them down 1 by 1:\n\n* Workfront  was recently bought by Adobe. If you want to invest in Workfront, you’d  have to invest in the much larger company of Adobe. It wouldn’t be a  pure play investment into the CWM space.\n* Smartsheet is 2nd and of course, they are public :)\n* Wrike is private\n* ServiceNow  – CWM is just one small piece of their total      offerings. Investing  here would not be a pure play into the CWM space.  Also, the company is  already quite large ($106B market cap)\n* Asana  is public but just IPO’d on 9/30/20 about 3 months ago. We don’t have  much data to track their performance as a      publicly traded company.  Furthermore, although they actually would be a pure play investment into  the CWM space, they’re not a leader and rank behind Smartsheet in  several of Forrester’s categories. Why invest in the 2nd best when you  can invest in the best?\n* Monday.com is private\n* Microsoft – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space.\n* Atlassian  – This company does primarily focus on CWM but I have a couple problems  with them as an investment. 1) They’re ranked way beneath Smartsheet.  2) They’re already too big for me to confidently say they can 10x  (market cap already $58B).\n\nNow  that we’ve established that Smartsheet is a leader in the CWM space and  that they’re arguably the best publicly available pure-play investment  in this space let’s understand why this is important. Other than the  obvious reason that we’re in the beginning stages of a remote work  revolution, why is this important?\n\nWell,  let’s take a look at this quote from Mark Mader, Smartsheet CEO, during  the last earnings call (Q3 FY21) that occurred on December 7th, 2020:\n\n“Leaders  are recognizing they need to shift more workloads to asynchronous work,  work that is documented, automated, tracked with dashboards, and where  priorities are clearly defined. They understand that by empowering their  teams with no-code solutions that facilitate asynchronous work, cycle  times will be improved, a deeper sense of ownership will be created, and  prioritization and accountability will be insured. Smartsheet is  ideally suited to help enterprises work more asynchronously to derive  the benefits from doing so.”\n\nKey word here: Asynchronous. Asynchronous communication is different from Synchronous communication. Here is the difference:\n\nAsynchronous: email, message boards, dashboards, etc.\n\nSynchronous: video conferencing, chat, audio calls, etc.\n\nAny  communication that doesn’t require a real-time response can be  considered asynchronous, like the examples in the picture above.  Synchronous communication is any communication that happens in real  time, thereby allowing for immediate responses, see examples above. As  part of my research on Smartsheet, I read an E-Book that was written by  the original co-founders of Smartsheet, Mark Mader the current CEO and  Brent Frei who is no longer with the company. They wrote the E-Book in  2007 just a couple of years after the 2005 founding. The E-Book is  called “The Power of Done”. The moral of the book is that Mark and Brent  noticed through their own experience, and through different research  studies on work place productivity, that the rise in technology in the  early 21st century was actually making employees less productive. This  is a quote from their E-Book:\n\n“According  to Basex, a research firm focusing on the knowledge economy,  interruptions from email, cell phones, instant messaging, text messaging  and blogs eat up nearly 30 percent of each day; on an annualized basis,  this represents a loss of 28 billion hours for the entire U.S.  workforce, or a $588 billion cost to the American economy.”\n\nThey  mention in their book that although there has been a lot of advances in  work technology such as email, word processing, and spreadsheets, there  hadn’t at that time been any great applications created for teamwork  collaboration or task management. The fact that technology advances  helped the world create tools to enhance productivity but also deterred  productivity at the same time is what Mark and Brent referred to as the  productivity paradox. They wanted to do something about it and thus they  founded Smartsheet.\n\n**How Smartsheet makes money**\n\nAt  the very least, before you invest in a company, you better understand  how they make money. In Chris Mayers’ excellent book, 100 Baggers, that I  mentioned above, he continually references top line revenue growth as  one of the main common indicators of a possible 100 Bagger. This isn’t  to tell you that any stock I pick will be a 100 Bagger just because it  has great top line revenue growth, but if I am looking at a growth stock  to hold for the long term, revenue growth is one of the first things I  look at.\n\nBefore I talk about the  revenue streams of Smartsheet, I want to share a little bit about the  actual product that they sell to earn this revenue. Co-Founder/CEO Mark  Mader realized that a lot of work in the corporate world was being done  on spreadsheets such as Microsoft Excel. However, he realized that these  spreadsheets were largely static and not necessarily used to their full  potential. He wanted to help people get more out of their use of  spreadsheets. As a result, we now have Smartsheets which is a cloud  based platform that can be accessed by all employees of the company no  matter where they are with live information about project statuses,  meeting times and work that is assigned to each employee just to name a  few uses. Users can choose their way of viewing this information with  different views such as calendar view, grid view, card view, and Gantt  view.\n\nThe idea is that by  enhancing the availability and quality of asynchronous information  available to all members of a team about the status of a project, the  tasks assigned, and the timelines, the less synchronous communication  will be needed which allows employees to spend more time doing what  they’re hired to do – get work done. Think about how wasteful it is to  hire a highly talented engineer but then make him spend half his day  preparing for and doing status update meetings and hunting people down  to see where they’re at with their assignments. What if all this  information was available for him, his managers, and his staff to see  within Smartsheet without having to bother each other and waste precious  work hours that could be used for coding, designing, and producing?  That’s what Smartsheet looks to achieve.\n\nFor  Smartsheet, their means of making money is quite simple. As I mentioned  earlier, they are a Software as a Service (SaaS) company. Whenever you  see SaaS, that means subscription revenue and in my opinion that’s a  very good thing. With a subscription business model, the revenue is  going to be recurring every year and that type of reliability (combined  with growth of course) is something you want as an investor.\n\nSmartsheet’s  primary source of revenue is the sale of subscriptions to their  cloud-based Collaborative Work Management (CWM) platform. Customers and  potential customers begin their engagement with the Smartsheet platform  by either signing up for a free trial, purchasing a subscription on the  Smartsheet website, going through a sales rep, or they are exposed to  Smartsheet by collaborating with a Company/Individual that uses  Smartsheet.  For subscriptions, customers select the plan that meets  their needs and can begin using Smartsheet within minutes.\n\nSmartsheet  offers four subscription levels: Individual, Business, Enterprise, and  Premier, the pricing for which varies by the capabilities provided.  Customers can also purchase connectors, which provide data integration  and automation to third-party applications.\n\nThe  Connectors part of the business is something I find really interesting.  Basically, Smartsheet has made deals with most of the top work  productivity and communication software companies in the world to allow  their customers to use those applications within their Smartsheet user  interface. This helps position Smartsheet as the true “command center”  platform while the products of the other companies become ancillary  pieces. You’ll see this on the link above but some products that  Smartsheet sells Connectors for include Adobe Creative Cloud, Microsoft  Dynamics 365, Salesforce, Jira Software, Slack, and Skype just to name a  few.\n\nI think that being able to  sell these Connectors as ancillary pieces to the Smartsheet user  experience is so beneficial to Smartsheet because a lot of these  companies that people may perceive as “Smartsheet competitors” actually  become a piece of the Smartsheet platform and can be sold by Smartsheet  as a supplemental revenue stream. This neutral angle that Smartsheet is  able to come from by selling Connectors to their perceived “competitors”  reminds me a little bit of how Roku (ROKU) is able to earn revenue off  of selling a Netflix subscription on their platform. I think just the  fact that all these big companies like Adobe, Jira, Salesforce, etc.  allow their products to be integrated into Smartsheet shows that there  is a high value proposition in the Smartsheet platform and that they  would risk alienating their customers if they didn’t allow for their  products to be integrated with Smartsheet.\n\nOn  top of the Connectors to third party vendors that Smartsheet is able to  sell, Smartsheet is also able to sell upgrades to their own internal  plug-ins. Smartsheet has some impressive proprietary plug-ins they can  sell to their customers. For example, in May 2019, Smartsheet acquired  10,000ft which augmented their product portfolio by providing resource  allocation and planning. The name “10,000ft” is meant to be analogous to  having a high level view of your company and all resources available  within your company and how to deploy them.\n\nAlso,  in September 2020, Smartsheet acquired Brandfolder, Inc. which provides  a centralized platform to organize, discover, control, distribute, and  measure all forms of digital content. Combining Brandfolder capabilities  with Smartsheet allows them to create dynamic solutions that manage  workflows around content and collaboration. This goes back to what I  said earlier in the article about how my girlfriend had mentioned that  her company’s marketing team was “really excited about Smartsheet  because it makes their job way easier and more enjoyable.” She told me  that before Smartsheet, her company’s marketing team had to constantly  hunt down members of the creative team (photographers, graphic  designers) to receive the latest photos, videos, and digital designs  they were working on. She said it was a big pain for them trying to  share this content over email and SharePoint. Now, all of the content is  inside of Smartsheet and the marketing team can access it at any time.  They can leave comments on the content, route to appropriate individuals  for approvals, and have better insight into the status of all digital  content that is being worked on. The acquisition of Brandfolder is  really what allows Smartsheet to stand out in this department.\n\nNobody  really talks about it, but digital content is so important these days  for companies in terms of controlling their brand image, putting out  quality advertisements, and presenting their product in as positive of a  light as possible. The fact that Smartsheet has a strong proprietary  plug-in for this with Brandfolder is very promising. During Smartsheet’s  FY21 Engage Customer Conference, Anna Griffin, Smartsheet Chief  Marketing Officer said that the global annual marketing spend is $500B  for companies around the world. She said the role of the marketing  department is changing from sole content creator to Editor in Chief. All  kinds of teams within companies these days are putting out content that  effects the company’s brand. Sales is running social media campaigns,  product marketing is putting out blog posts and podcasts, and R&amp;D is  teasing new product experiences in app. It can get really difficult for  the company’s Marketing/Branding team to stay on top of all this  without a centralized digital content collaboration platform like  Brandfolder in Smartsheet. This is just one reason why I think  Smartsheet has a lot of growth opportunities in the future.\n\nAs  you can see, Smartsheet has a lot to offer to companies with their core  CWM platform, the Connectors they can sell, and the internal upgrades  available such as 10,000ft and Brandfolder. On top of that, Smartsheet  also provides WorkApps, a proprietary no-code platform that empowers  users to build intuitive web and mobile applications that streamline  business and simplify collaboration. There are so many instances within  companies where an app needs to be built to streamline a workflow.  Traditionally, companies need to engage their IT departments and the  coders that sit within these departments to build these apps. This  places a lot of strain on IT departments and takes away time they can be  spending on more complex/mission critical projects. Mark Mader is aware  of this and thus is heavily pushing no-code as a solution for companies  now and in the future. He believes that everyday non-coder employees  know their jobs/workflows best and thus if you empower them to build  their own apps with a no-code platform they will produce better and more  relevant apps to help get work done than an IT department employee who  doesn’t even do the job that the app is being built for. Also, he  believes this will reduce strain on IT departments and allow them to  focus on more complex and mission critical projects.\n\nHere  is a quote from the Director of Sales (Hina Patel) at a Smartsheet  customer, Cisco (NASDAQ: CSCO): “I have been waiting for a solution like  WorkApps that can give us quick and easy access to the content we need,  when and where we need it,” said Hina Patel, Director of Sales  Operations at Cisco. “The ability to take our Smartsheet assets, along  with other tools we use, and package an entire solution in an intuitive  app will make it even easier to drive active participation from everyone  involved in the process, no matter their role.” As you can see, the  value proposition of WorkApps and the Smartsheet platform appears to be  high.\n\nLastly, Smartsheet also  generates revenue from Professional Services which is essentially  providing training and customized consulting to Smartsheet customers  that want to get more out of the Smartsheet platform. In the most recent  quarter, Q3 FY21, Professional Services accounted for 8.2% of revenue.  Here is the breakout from the most recent quarter:\n\nSubscription revenue = $90,890M for 91.8% of total revenue\n\nProfessional services revenue = $8,043M for 8.2% of total revenue\n\nThis  is the end of my first article about Smartsheet. My goal is to drop  Part 2 within the next week. The focus of Part 2 will be an in depth  answer of the question – “Can we 10x from here?”\n\n**TL:DR**\n\n* This is Part 1 of my two part deep dive on Smartsheet (Ticker: SMAR).\n* This first part introduces you to (1) me, (2) the company, (3) my thesis on the company, and (4) digs into how they make money.\n* Part  2 (to be released later this week) will go in depth to explore the  question “Can we 10x from here?” If you enjoyed this article and want to  make sure you catch Part 2, [subscribe here.](https://onthemarkpicks.com/subscribe-today/)\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I  am not a financial advisor and this is not investment advice. These are  just my opinions to help facilitate learning and discussion.\n\n**Disclosure:**  I have no position in Smartsheet. I do plan to initiate a long position  when the markets open again in 2021.  I wrote this article myself, and  it expresses my own opinions. I am not receiving compensation for it. I  have no business relationship with any company whose stock is mentioned  in this article.",
        "subreddit": "SecurityAnalysis",
        "title": "Smartsheet (NYSE: SMAR) – Deep Dive Research – Part 1",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kq874g/smartsheet_nyse_smar_deep_dive_research_part_1/",
        "created": 1609793624.0
    },
    {
        "author": "PAPEGACLAP777777777",
        "created_utc": 1611250989,
        "id": "l23fw3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Is adobe worth buying for it's expensive price tag?",
        "url": "https://www.reddit.com/r/stocks/comments/l23fw3/is_adobe_worth_buying_for_its_expensive_price_tag/",
        "created": 1611279789.0
    },
    {
        "author": "Purple-Monk_",
        "created_utc": 1611537181,
        "id": "l4cght",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Why I believe Adobe Inc. is undervalued",
        "url": "https://www.reddit.com/r/StockMarket/comments/l4cght/why_i_believe_adobe_inc_is_undervalued/",
        "created": 1611565981.0
    },
    {
        "author": "cpa_for_the_people_",
        "created_utc": 1609766250,
        "id": "kq8klv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL:DR is at the bottom**\n\nHello, welcome to my second deep dive write up.\n\nMy  name’s Mark and I’m an accountant with a passion for investing. About  two years ago, I used to work as an auditor at a public accounting firm  and have been behind the scenes at many different publicly traded and  privately held companies in the U.S. My goal is to bring my unique  perspective from that past experience, my current experience working in a  new role at a large corporation, and my understanding of accounting to  help break down some of the most exciting growth stocks on the market  today.\n\nI’m a long-term investor. I  am focused on finding great companies and holding them for a long time.  I’m willing to endure volatility, crazy price drops, and everything  that comes with this approach as long as the facts that led me to  originally invest and believe in that company have not changed. If you  want to learn more about this approach. I recommend reading the book  “100 Baggers” by Chris Mayer.\n\n**Introduction**\n\nI’m  excited to share with you all my stock pick for this month, Smartsheet.  I’m always looking for investment ideas. I run stock screeners with  different criteria (mostly focused on revenue growth), scan Twitter,  talk to professionals in different industries, and try to observe what  products or services are getting popular with my friends and family. One  of the best investment decisions I’ve made to date came after I talked  to my friend about a drink he was drinking on the golf course. Shout out  to you Celsius (CELH)! With that being said, you never know where your  next good investment idea is going to come from.\n\nIn  the case of Smartsheet, I became aware of the company through a stock  screener. I was drawn to the relatively small market cap ($8.6B), strong  revenue growth (roughly 35%), and the fact that it’s a subscription  business model (SaaS). Once I became aware of these facts, it cued me to  take a deeper dive. The more I learned about Smartsheet, the more I  liked. Management talks a lot about empowering people and that really  struck a chord with me. In different roles I’ve had as a teacher, tutor,  and supervisor, I’ve always found empowering people to be one of the  most important keys to success. I will touch on this more later in the  write up.\n\nAnother positive signal I  got about Smartsheet came unexpectedly one evening. I was sitting in  the kitchen and my girlfriend was cooking dinner. I was watching an  interview on my phone with Mark Mader, the CEO of Smartsheet. My  girlfriend overheard the word “Smartsheet” mentioned in the video and  said “Are they talking about the Smartsheet with the blue check mark?”. I  had to Google their logo but yes, it turns out we were thinking about  the same Smartsheet. I asked her how she knew about it. She said “My  company just transitioned all of our work onto Smartsheet. I really love  it. Our marketing department is really excited about it because it  makes their job way easier and more enjoyable.” Hearing this just  motivated me to learn more about Smartsheet.\n\n**The Thesis Statement**\n\nFor  every stock pick I make, I want to provide a quick thesis statement  that can serve as a reminder for why I’m buying and holding that stock  for the long term. I’ll always aim to make it just a few sentences long  so it can easily be remembered and internalized. This helps during times  when the price may sporadically drop and you need to remember why  you’re holding this position.\n\nThe thesis statement I have come up with for Smartsheet is as follows:\n\n*“Smartsheet:  A leader in collaborative work management (CWM) software. As the global  workforce becomes more decentralized through remote work, managers and  executives now more than ever need a tool to digitally consolidate their  teams, projects and deadlines. Smartsheet is that tool and is  innovating to offer businesses even more ways to get the most out of  their teams.”*\n\nI think this  thesis statement really captures the essence of what Smartsheet does. If  you go to Smartsheet’s website and look at the “About” page, you will  find their “About” statement which says “Smartsheet is the enterprise  platform for dynamic work that aligns people and technology so your  entire business can move faster, drive innovation, and achieve more.”  Notice how their statement emphasizes helping businesses move faster,  drive innovation, and achieve more.\n\nIn  my thesis statement, I mention that Smartsheet is a leader in the CWM  software space. But how do I know this? Well, a highly reputable  independent research firm named Forrester conducted a study on the CWM  space based off different criteria including collaboration, enterprise  capabilities, UI/user experience, planned enhancements and number of  customers just to name a few of the factors considered. I put the  companies that were identified from the study in the order of their  ranking below. As you can see, Smartsheet is firmly planted as a leader  in the space at 2nd place. Let’s use our common sense for a second. At  the beginning stages of a remote work revolution, do we want to invest  in an up and coming SaaS company that focuses on providing firms with  resources to digitally manage their teams, digitally manage  work/projects, and digitally collaborate to get work done? I think the  answer should be a resounding yes. But what about these other companies  on the list. Let’s break them down 1 by 1:\n\n* Workfront  was recently bought by Adobe. If you want to invest in Workfront, you’d  have to invest in the much larger company of Adobe. It wouldn’t be a  pure play investment into the CWM space.\n* Smartsheet is 2nd and of course, they are public :)\n* Wrike is private\n* ServiceNow  – CWM is just one small piece of their total      offerings. Investing  here would not be a pure play into the CWM space.  Also, the company is  already quite large ($106B market cap)\n* Asana  is public but just IPO’d on 9/30/20 about 3 months ago. We don’t have  much data to track their performance as a      publicly traded company.  Furthermore, although they actually would be a pure play investment into  the CWM space, they’re not a leader and rank behind Smartsheet in  several of Forrester’s categories. Why invest in the 2nd best when you  can invest in the best?\n* Monday.com is private\n* Microsoft – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space.\n* Atlassian  – This company does primarily focus on CWM but I have a couple problems  with them as an investment. 1) They’re ranked way beneath Smartsheet.  2) They’re already too big for me to confidently say they can 10x  (market cap already $58B).\n\nNow  that we’ve established that Smartsheet is a leader in the CWM space and  that they’re arguably the best publicly available pure-play investment  in this space let’s understand why this is important. Other than the  obvious reason that we’re in the beginning stages of a remote work  revolution, why is this important?\n\nWell,  let’s take a look at this quote from Mark Mader, Smartsheet CEO, during  the last earnings call (Q3 FY21) that occurred on December 7th, 2020:\n\n“Leaders  are recognizing they need to shift more workloads to asynchronous work,  work that is documented, automated, tracked with dashboards, and where  priorities are clearly defined. They understand that by empowering their  teams with no-code solutions that facilitate asynchronous work, cycle  times will be improved, a deeper sense of ownership will be created, and  prioritization and accountability will be insured. Smartsheet is  ideally suited to help enterprises work more asynchronously to derive  the benefits from doing so.”\n\nKey word here: Asynchronous. Asynchronous communication is different from Synchronous communication. Here is the difference:\n\nAsynchronous: email, message boards, dashboards, etc.\n\nSynchronous: video conferencing, chat, audio calls, etc.\n\nAny  communication that doesn’t require a real-time response can be  considered asynchronous, like the examples in the picture above.  Synchronous communication is any communication that happens in real  time, thereby allowing for immediate responses, see examples above. As  part of my research on Smartsheet, I read an E-Book that was written by  the original co-founders of Smartsheet, Mark Mader the current CEO and  Brent Frei who is no longer with the company. They wrote the E-Book in  2007 just a couple of years after the 2005 founding. The E-Book is  called “The Power of Done”. The moral of the book is that Mark and Brent  noticed through their own experience, and through different research  studies on work place productivity, that the rise in technology in the  early 21st century was actually making employees less productive. This  is a quote from their E-Book:\n\n“According  to Basex, a research firm focusing on the knowledge economy,  interruptions from email, cell phones, instant messaging, text messaging  and blogs eat up nearly 30 percent of each day; on an annualized basis,  this represents a loss of 28 billion hours for the entire U.S.  workforce, or a $588 billion cost to the American economy.”\n\nThey  mention in their book that although there has been a lot of advances in  work technology such as email, word processing, and spreadsheets, there  hadn’t at that time been any great applications created for teamwork  collaboration or task management. The fact that technology advances  helped the world create tools to enhance productivity but also deterred  productivity at the same time is what Mark and Brent referred to as the  productivity paradox. They wanted to do something about it and thus they  founded Smartsheet.\n\n**How Smartsheet makes money**\n\nAt  the very least, before you invest in a company, you better understand  how they make money. In Chris Mayers’ excellent book, 100 Baggers, that I  mentioned above, he continually references top line revenue growth as  one of the main common indicators of a possible 100 Bagger. This isn’t  to tell you that any stock I pick will be a 100 Bagger just because it  has great top line revenue growth, but if I am looking at a growth stock  to hold for the long term, revenue growth is one of the first things I  look at.\n\nBefore I talk about the  revenue streams of Smartsheet, I want to share a little bit about the  actual product that they sell to earn this revenue. Co-Founder/CEO Mark  Mader realized that a lot of work in the corporate world was being done  on spreadsheets such as Microsoft Excel. However, he realized that these  spreadsheets were largely static and not necessarily used to their full  potential. He wanted to help people get more out of their use of  spreadsheets. As a result, we now have Smartsheets which is a cloud  based platform that can be accessed by all employees of the company no  matter where they are with live information about project statuses,  meeting times and work that is assigned to each employee just to name a  few uses. Users can choose their way of viewing this information with  different views such as calendar view, grid view, card view, and Gantt  view.\n\nThe idea is that by  enhancing the availability and quality of asynchronous information  available to all members of a team about the status of a project, the  tasks assigned, and the timelines, the less synchronous communication  will be needed which allows employees to spend more time doing what  they’re hired to do – get work done. Think about how wasteful it is to  hire a highly talented engineer but then make him spend half his day  preparing for and doing status update meetings and hunting people down  to see where they’re at with their assignments. What if all this  information was available for him, his managers, and his staff to see  within Smartsheet without having to bother each other and waste precious  work hours that could be used for coding, designing, and producing?  That’s what Smartsheet looks to achieve.\n\nFor  Smartsheet, their means of making money is quite simple. As I mentioned  earlier, they are a Software as a Service (SaaS) company. Whenever you  see SaaS, that means subscription revenue and in my opinion that’s a  very good thing. With a subscription business model, the revenue is  going to be recurring every year and that type of reliability (combined  with growth of course) is something you want as an investor.\n\nSmartsheet’s  primary source of revenue is the sale of subscriptions to their  cloud-based Collaborative Work Management (CWM) platform. Customers and  potential customers begin their engagement with the Smartsheet platform  by either signing up for a free trial, purchasing a subscription on the  Smartsheet website, going through a sales rep, or they are exposed to  Smartsheet by collaborating with a Company/Individual that uses  Smartsheet.  For subscriptions, customers select the plan that meets  their needs and can begin using Smartsheet within minutes.\n\nSmartsheet  offers four subscription levels: Individual, Business, Enterprise, and  Premier, the pricing for which varies by the capabilities provided.  Customers can also purchase connectors, which provide data integration  and automation to third-party applications.\n\nThe  Connectors part of the business is something I find really interesting.  Basically, Smartsheet has made deals with most of the top work  productivity and communication software companies in the world to allow  their customers to use those applications within their Smartsheet user  interface. This helps position Smartsheet as the true “command center”  platform while the products of the other companies become ancillary  pieces. You’ll see this on the link above but some products that  Smartsheet sells Connectors for include Adobe Creative Cloud, Microsoft  Dynamics 365, Salesforce, Jira Software, Slack, and Skype just to name a  few.\n\nI think that being able to  sell these Connectors as ancillary pieces to the Smartsheet user  experience is so beneficial to Smartsheet because a lot of these  companies that people may perceive as “Smartsheet competitors” actually  become a piece of the Smartsheet platform and can be sold by Smartsheet  as a supplemental revenue stream. This neutral angle that Smartsheet is  able to come from by selling Connectors to their perceived “competitors”  reminds me a little bit of how Roku (ROKU) is able to earn revenue off  of selling a Netflix subscription on their platform. I think just the  fact that all these big companies like Adobe, Jira, Salesforce, etc.  allow their products to be integrated into Smartsheet shows that there  is a high value proposition in the Smartsheet platform and that they  would risk alienating their customers if they didn’t allow for their  products to be integrated with Smartsheet.\n\nOn  top of the Connectors to third party vendors that Smartsheet is able to  sell, Smartsheet is also able to sell upgrades to their own internal  plug-ins. Smartsheet has some impressive proprietary plug-ins they can  sell to their customers. For example, in May 2019, Smartsheet acquired  10,000ft which augmented their product portfolio by providing resource  allocation and planning. The name “10,000ft” is meant to be analogous to  having a high level view of your company and all resources available  within your company and how to deploy them.\n\nAlso,  in September 2020, Smartsheet acquired Brandfolder, Inc. which provides  a centralized platform to organize, discover, control, distribute, and  measure all forms of digital content. Combining Brandfolder capabilities  with Smartsheet allows them to create dynamic solutions that manage  workflows around content and collaboration. This goes back to what I  said earlier in the article about how my girlfriend had mentioned that  her company’s marketing team was “really excited about Smartsheet  because it makes their job way easier and more enjoyable.” She told me  that before Smartsheet, her company’s marketing team had to constantly  hunt down members of the creative team (photographers, graphic  designers) to receive the latest photos, videos, and digital designs  they were working on. She said it was a big pain for them trying to  share this content over email and SharePoint. Now, all of the content is  inside of Smartsheet and the marketing team can access it at any time.  They can leave comments on the content, route to appropriate individuals  for approvals, and have better insight into the status of all digital  content that is being worked on. The acquisition of Brandfolder is  really what allows Smartsheet to stand out in this department.\n\nNobody  really talks about it, but digital content is so important these days  for companies in terms of controlling their brand image, putting out  quality advertisements, and presenting their product in as positive of a  light as possible. The fact that Smartsheet has a strong proprietary  plug-in for this with Brandfolder is very promising. During Smartsheet’s  FY21 Engage Customer Conference, Anna Griffin, Smartsheet Chief  Marketing Officer said that the global annual marketing spend is $500B  for companies around the world. She said the role of the marketing  department is changing from sole content creator to Editor in Chief. All  kinds of teams within companies these days are putting out content that  effects the company’s brand. Sales is running social media campaigns,  product marketing is putting out blog posts and podcasts, and R&amp;D is  teasing new product experiences in app. It can get really difficult for  the company’s Marketing/Branding team to stay on top of all this  without a centralized digital content collaboration platform like  Brandfolder in Smartsheet. This is just one reason why I think  Smartsheet has a lot of growth opportunities in the future.\n\nAs  you can see, Smartsheet has a lot to offer to companies with their core  CWM platform, the Connectors they can sell, and the internal upgrades  available such as 10,000ft and Brandfolder. On top of that, Smartsheet  also provides WorkApps, a proprietary no-code platform that empowers  users to build intuitive web and mobile applications that streamline  business and simplify collaboration. There are so many instances within  companies where an app needs to be built to streamline a workflow.  Traditionally, companies need to engage their IT departments and the  coders that sit within these departments to build these apps. This  places a lot of strain on IT departments and takes away time they can be  spending on more complex/mission critical projects. Mark Mader is aware  of this and thus is heavily pushing no-code as a solution for companies  now and in the future. He believes that everyday non-coder employees  know their jobs/workflows best and thus if you empower them to build  their own apps with a no-code platform they will produce better and more  relevant apps to help get work done than an IT department employee who  doesn’t even do the job that the app is being built for. Also, he  believes this will reduce strain on IT departments and allow them to  focus on more complex and mission critical projects.\n\nHere  is a quote from the Director of Sales (Hina Patel) at a Smartsheet  customer, Cisco (NASDAQ: CSCO): “I have been waiting for a solution like  WorkApps that can give us quick and easy access to the content we need,  when and where we need it,” said Hina Patel, Director of Sales  Operations at Cisco. “The ability to take our Smartsheet assets, along  with other tools we use, and package an entire solution in an intuitive  app will make it even easier to drive active participation from everyone  involved in the process, no matter their role.” As you can see, the  value proposition of WorkApps and the Smartsheet platform appears to be  high.\n\nLastly, Smartsheet also  generates revenue from Professional Services which is essentially  providing training and customized consulting to Smartsheet customers  that want to get more out of the Smartsheet platform. In the most recent  quarter, Q3 FY21, Professional Services accounted for 8.2% of revenue.  Here is the breakout from the most recent quarter:\n\nSubscription revenue = $90,890M for 91.8% of total revenue\n\nProfessional services revenue = $8,043M for 8.2% of total revenue\n\nThis  is the end of my first article about Smartsheet. My goal is to drop  Part 2 within the next week. The focus of Part 2 will be an in depth  answer of the question – “Can we 10x from here?”\n\n**TL:DR**\n\n* This is Part 1 of my two part deep dive on Smartsheet (Ticker: SMAR).\n* This first part introduces you to (1) me, (2) the company, (3) my thesis on the company, and (4) digs into how they make money.\n* Part  2 (to be released later this week) will go in depth to explore the  question “Can we 10x from here?” \n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I  am not a financial advisor and this is not investment advice. These are  just my opinions to help facilitate learning and discussion.\n\n**Disclosure:**  I have no position in Smartsheet. I do plan to initiate a long position  when the markets open again in 2021.  I wrote this article myself, and  it expresses my own opinions. I am not receiving compensation for it. I  have no business relationship with any company whose stock is mentioned  in this article.",
        "subreddit": "stocks",
        "title": "Deep Dive Research About a Collaborative Work Management Company Poised to Benefit off the Remote Work Trend. NYSE Listed.",
        "url": "https://www.reddit.com/r/stocks/comments/kq8klv/deep_dive_research_about_a_collaborative_work/",
        "created": 1609795050.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1609764909,
        "id": "kq87y7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL:DR is at the bottom**\n\nHello, welcome to my second deep dive write up.\n\nMy  name’s Mark and I’m an accountant with a passion for investing. About  two years ago, I used to work as an auditor at a public accounting firm  and have been behind the scenes at many different publicly traded and  privately held companies in the U.S. My goal is to bring my unique  perspective from that past experience, my current experience working in a  new role at a large corporation, and my understanding of accounting to  help break down some of the most exciting growth stocks on the market  today.\n\nI’m a long-term investor. I  am focused on finding great companies and holding them for a long time.  I’m willing to endure volatility, crazy price drops, and everything  that comes with this approach as long as the facts that led me to  originally invest and believe in that company have not changed. If you  want to learn more about this approach. I recommend reading the book  “100 Baggers” by Chris Mayer.\n\n**Introduction**\n\nI’m  excited to share with you all my stock pick for this month, Smartsheet.  I’m always looking for investment ideas. I run stock screeners with  different criteria (mostly focused on revenue growth), scan Twitter,  talk to professionals in different industries, and try to observe what  products or services are getting popular with my friends and family. One  of the best investment decisions I’ve made to date came after I talked  to my friend about a drink he was drinking on the golf course. Shout out  to you Celsius (CELH)! With that being said, you never know where your  next good investment idea is going to come from.\n\nIn  the case of Smartsheet, I became aware of the company through a stock  screener. I was drawn to the relatively small market cap ($8.6B), strong  revenue growth (roughly 35%), and the fact that it’s a subscription  business model (SaaS). Once I became aware of these facts, it cued me to  take a deeper dive. The more I learned about Smartsheet, the more I  liked. Management talks a lot about empowering people and that really  struck a chord with me. In different roles I’ve had as a teacher, tutor,  and supervisor, I’ve always found empowering people to be one of the  most important keys to success. I will touch on this more later in the  write up.\n\nAnother positive signal I  got about Smartsheet came unexpectedly one evening. I was sitting in  the kitchen and my girlfriend was cooking dinner. I was watching an  interview on my phone with Mark Mader, the CEO of Smartsheet. My  girlfriend overheard the word “Smartsheet” mentioned in the video and  said “Are they talking about the Smartsheet with the blue check mark?”. I  had to Google their logo but yes, it turns out we were thinking about  the same Smartsheet. I asked her how she knew about it. She said “My  company just transitioned all of our work onto Smartsheet. I really love  it. Our marketing department is really excited about it because it  makes their job way easier and more enjoyable.” Hearing this just  motivated me to learn more about Smartsheet.\n\n**The Thesis Statement**\n\nFor  every stock pick I make, I want to provide a quick thesis statement  that can serve as a reminder for why I’m buying and holding that stock  for the long term. I’ll always aim to make it just a few sentences long  so it can easily be remembered and internalized. This helps during times  when the price may sporadically drop and you need to remember why  you’re holding this position.\n\nThe thesis statement I have come up with for Smartsheet is as follows:\n\n*“Smartsheet:  A leader in collaborative work management (CWM) software. As the global  workforce becomes more decentralized through remote work, managers and  executives now more than ever need a tool to digitally consolidate their  teams, projects and deadlines. Smartsheet is that tool and is  innovating to offer businesses even more ways to get the most out of  their teams.”*\n\nI think this  thesis statement really captures the essence of what Smartsheet does. If  you go to Smartsheet’s website and look at the “About” page, you will  find their “About” statement which says “Smartsheet is the enterprise  platform for dynamic work that aligns people and technology so your  entire business can move faster, drive innovation, and achieve more.”  Notice how their statement emphasizes helping businesses move faster,  drive innovation, and achieve more.\n\nIn  my thesis statement, I mention that Smartsheet is a leader in the CWM  software space. But how do I know this? Well, a highly reputable  independent research firm named Forrester conducted a study on the CWM  space based off different criteria including collaboration, enterprise  capabilities, UI/user experience, planned enhancements and number of  customers just to name a few of the factors considered. I put the  companies that were identified from the study in the order of their  ranking below. As you can see, Smartsheet is firmly planted as a leader  in the space at 2nd place. Let’s use our common sense for a second. At  the beginning stages of a remote work revolution, do we want to invest  in an up and coming SaaS company that focuses on providing firms with  resources to digitally manage their teams, digitally manage  work/projects, and digitally collaborate to get work done? I think the  answer should be a resounding yes. But what about these other companies  on the list. Let’s break them down 1 by 1:\n\n* Workfront  was recently bought by Adobe. If you want to invest in Workfront, you’d  have to invest in the much larger company of Adobe. It wouldn’t be a  pure play investment into the CWM space.\n* Smartsheet is 2nd and of course, they are public :)\n* Wrike is private\n* ServiceNow  – CWM is just one small piece of their total      offerings. Investing  here would not be a pure play into the CWM space.  Also, the company is  already quite large ($106B market cap)\n* Asana  is public but just IPO’d on 9/30/20 about 3 months ago. We don’t have  much data to track their performance as a      publicly traded company.  Furthermore, although they actually would be a pure play investment into  the CWM space, they’re not a leader and rank behind Smartsheet in  several of Forrester’s categories. Why invest in the 2nd best when you  can invest in the best?\n* Monday.com is private\n* Microsoft – CWM is just one small piece of their total offerings. Investing here would not be a pure play into the CWM space.\n* Atlassian  – This company does primarily focus on CWM but I have a couple problems  with them as an investment. 1) They’re ranked way beneath Smartsheet.  2) They’re already too big for me to confidently say they can 10x  (market cap already $58B).\n\nNow  that we’ve established that Smartsheet is a leader in the CWM space and  that they’re arguably the best publicly available pure-play investment  in this space let’s understand why this is important. Other than the  obvious reason that we’re in the beginning stages of a remote work  revolution, why is this important?\n\nWell,  let’s take a look at this quote from Mark Mader, Smartsheet CEO, during  the last earnings call (Q3 FY21) that occurred on December 7th, 2020:\n\n“Leaders  are recognizing they need to shift more workloads to asynchronous work,  work that is documented, automated, tracked with dashboards, and where  priorities are clearly defined. They understand that by empowering their  teams with no-code solutions that facilitate asynchronous work, cycle  times will be improved, a deeper sense of ownership will be created, and  prioritization and accountability will be insured. Smartsheet is  ideally suited to help enterprises work more asynchronously to derive  the benefits from doing so.”\n\nKey word here: Asynchronous. Asynchronous communication is different from Synchronous communication. Here is the difference:\n\nAsynchronous: email, message boards, dashboards, etc.\n\nSynchronous: video conferencing, chat, audio calls, etc.\n\nAny  communication that doesn’t require a real-time response can be  considered asynchronous, like the examples in the picture above.  Synchronous communication is any communication that happens in real  time, thereby allowing for immediate responses, see examples above. As  part of my research on Smartsheet, I read an E-Book that was written by  the original co-founders of Smartsheet, Mark Mader the current CEO and  Brent Frei who is no longer with the company. They wrote the E-Book in  2007 just a couple of years after the 2005 founding. The E-Book is  called “The Power of Done”. The moral of the book is that Mark and Brent  noticed through their own experience, and through different research  studies on work place productivity, that the rise in technology in the  early 21st century was actually making employees less productive. This  is a quote from their E-Book:\n\n“According  to Basex, a research firm focusing on the knowledge economy,  interruptions from email, cell phones, instant messaging, text messaging  and blogs eat up nearly 30 percent of each day; on an annualized basis,  this represents a loss of 28 billion hours for the entire U.S.  workforce, or a $588 billion cost to the American economy.”\n\nThey  mention in their book that although there has been a lot of advances in  work technology such as email, word processing, and spreadsheets, there  hadn’t at that time been any great applications created for teamwork  collaboration or task management. The fact that technology advances  helped the world create tools to enhance productivity but also deterred  productivity at the same time is what Mark and Brent referred to as the  productivity paradox. They wanted to do something about it and thus they  founded Smartsheet.\n\n**How Smartsheet makes money**\n\nAt  the very least, before you invest in a company, you better understand  how they make money. In Chris Mayers’ excellent book, 100 Baggers, that I  mentioned above, he continually references top line revenue growth as  one of the main common indicators of a possible 100 Bagger. This isn’t  to tell you that any stock I pick will be a 100 Bagger just because it  has great top line revenue growth, but if I am looking at a growth stock  to hold for the long term, revenue growth is one of the first things I  look at.\n\nBefore I talk about the  revenue streams of Smartsheet, I want to share a little bit about the  actual product that they sell to earn this revenue. Co-Founder/CEO Mark  Mader realized that a lot of work in the corporate world was being done  on spreadsheets such as Microsoft Excel. However, he realized that these  spreadsheets were largely static and not necessarily used to their full  potential. He wanted to help people get more out of their use of  spreadsheets. As a result, we now have Smartsheets which is a cloud  based platform that can be accessed by all employees of the company no  matter where they are with live information about project statuses,  meeting times and work that is assigned to each employee just to name a  few uses. Users can choose their way of viewing this information with  different views such as calendar view, grid view, card view, and Gantt  view.\n\nThe idea is that by  enhancing the availability and quality of asynchronous information  available to all members of a team about the status of a project, the  tasks assigned, and the timelines, the less synchronous communication  will be needed which allows employees to spend more time doing what  they’re hired to do – get work done. Think about how wasteful it is to  hire a highly talented engineer but then make him spend half his day  preparing for and doing status update meetings and hunting people down  to see where they’re at with their assignments. What if all this  information was available for him, his managers, and his staff to see  within Smartsheet without having to bother each other and waste precious  work hours that could be used for coding, designing, and producing?  That’s what Smartsheet looks to achieve.\n\nFor  Smartsheet, their means of making money is quite simple. As I mentioned  earlier, they are a Software as a Service (SaaS) company. Whenever you  see SaaS, that means subscription revenue and in my opinion that’s a  very good thing. With a subscription business model, the revenue is  going to be recurring every year and that type of reliability (combined  with growth of course) is something you want as an investor.\n\nSmartsheet’s  primary source of revenue is the sale of subscriptions to their  cloud-based Collaborative Work Management (CWM) platform. Customers and  potential customers begin their engagement with the Smartsheet platform  by either signing up for a free trial, purchasing a subscription on the  Smartsheet website, going through a sales rep, or they are exposed to  Smartsheet by collaborating with a Company/Individual that uses  Smartsheet.  For subscriptions, customers select the plan that meets  their needs and can begin using Smartsheet within minutes.\n\nSmartsheet  offers four subscription levels: Individual, Business, Enterprise, and  Premier, the pricing for which varies by the capabilities provided.  Customers can also purchase connectors, which provide data integration  and automation to third-party applications.\n\nThe  Connectors part of the business is something I find really interesting.  Basically, Smartsheet has made deals with most of the top work  productivity and communication software companies in the world to allow  their customers to use those applications within their Smartsheet user  interface. This helps position Smartsheet as the true “command center”  platform while the products of the other companies become ancillary  pieces. You’ll see this on the link above but some products that  Smartsheet sells Connectors for include Adobe Creative Cloud, Microsoft  Dynamics 365, Salesforce, Jira Software, Slack, and Skype just to name a  few.\n\nI think that being able to  sell these Connectors as ancillary pieces to the Smartsheet user  experience is so beneficial to Smartsheet because a lot of these  companies that people may perceive as “Smartsheet competitors” actually  become a piece of the Smartsheet platform and can be sold by Smartsheet  as a supplemental revenue stream. This neutral angle that Smartsheet is  able to come from by selling Connectors to their perceived “competitors”  reminds me a little bit of how Roku (ROKU) is able to earn revenue off  of selling a Netflix subscription on their platform. I think just the  fact that all these big companies like Adobe, Jira, Salesforce, etc.  allow their products to be integrated into Smartsheet shows that there  is a high value proposition in the Smartsheet platform and that they  would risk alienating their customers if they didn’t allow for their  products to be integrated with Smartsheet.\n\nOn  top of the Connectors to third party vendors that Smartsheet is able to  sell, Smartsheet is also able to sell upgrades to their own internal  plug-ins. Smartsheet has some impressive proprietary plug-ins they can  sell to their customers. For example, in May 2019, Smartsheet acquired  10,000ft which augmented their product portfolio by providing resource  allocation and planning. The name “10,000ft” is meant to be analogous to  having a high level view of your company and all resources available  within your company and how to deploy them.\n\nAlso,  in September 2020, Smartsheet acquired Brandfolder, Inc. which provides  a centralized platform to organize, discover, control, distribute, and  measure all forms of digital content. Combining Brandfolder capabilities  with Smartsheet allows them to create dynamic solutions that manage  workflows around content and collaboration. This goes back to what I  said earlier in the article about how my girlfriend had mentioned that  her company’s marketing team was “really excited about Smartsheet  because it makes their job way easier and more enjoyable.” She told me  that before Smartsheet, her company’s marketing team had to constantly  hunt down members of the creative team (photographers, graphic  designers) to receive the latest photos, videos, and digital designs  they were working on. She said it was a big pain for them trying to  share this content over email and SharePoint. Now, all of the content is  inside of Smartsheet and the marketing team can access it at any time.  They can leave comments on the content, route to appropriate individuals  for approvals, and have better insight into the status of all digital  content that is being worked on. The acquisition of Brandfolder is  really what allows Smartsheet to stand out in this department.\n\nNobody  really talks about it, but digital content is so important these days  for companies in terms of controlling their brand image, putting out  quality advertisements, and presenting their product in as positive of a  light as possible. The fact that Smartsheet has a strong proprietary  plug-in for this with Brandfolder is very promising. During Smartsheet’s  FY21 Engage Customer Conference, Anna Griffin, Smartsheet Chief  Marketing Officer said that the global annual marketing spend is $500B  for companies around the world. She said the role of the marketing  department is changing from sole content creator to Editor in Chief. All  kinds of teams within companies these days are putting out content that  effects the company’s brand. Sales is running social media campaigns,  product marketing is putting out blog posts and podcasts, and R&amp;D is  teasing new product experiences in app. It can get really difficult for  the company’s Marketing/Branding team to stay on top of all this  without a centralized digital content collaboration platform like  Brandfolder in Smartsheet. This is just one reason why I think  Smartsheet has a lot of growth opportunities in the future.\n\nAs  you can see, Smartsheet has a lot to offer to companies with their core  CWM platform, the Connectors they can sell, and the internal upgrades  available such as 10,000ft and Brandfolder. On top of that, Smartsheet  also provides WorkApps, a proprietary no-code platform that empowers  users to build intuitive web and mobile applications that streamline  business and simplify collaboration. There are so many instances within  companies where an app needs to be built to streamline a workflow.  Traditionally, companies need to engage their IT departments and the  coders that sit within these departments to build these apps. This  places a lot of strain on IT departments and takes away time they can be  spending on more complex/mission critical projects. Mark Mader is aware  of this and thus is heavily pushing no-code as a solution for companies  now and in the future. He believes that everyday non-coder employees  know their jobs/workflows best and thus if you empower them to build  their own apps with a no-code platform they will produce better and more  relevant apps to help get work done than an IT department employee who  doesn’t even do the job that the app is being built for. Also, he  believes this will reduce strain on IT departments and allow them to  focus on more complex and mission critical projects.\n\nHere  is a quote from the Director of Sales (Hina Patel) at a Smartsheet  customer, Cisco (NASDAQ: CSCO): “I have been waiting for a solution like  WorkApps that can give us quick and easy access to the content we need,  when and where we need it,” said Hina Patel, Director of Sales  Operations at Cisco. “The ability to take our Smartsheet assets, along  with other tools we use, and package an entire solution in an intuitive  app will make it even easier to drive active participation from everyone  involved in the process, no matter their role.” As you can see, the  value proposition of WorkApps and the Smartsheet platform appears to be  high.\n\nLastly, Smartsheet also  generates revenue from Professional Services which is essentially  providing training and customized consulting to Smartsheet customers  that want to get more out of the Smartsheet platform. In the most recent  quarter, Q3 FY21, Professional Services accounted for 8.2% of revenue.  Here is the breakout from the most recent quarter:\n\nSubscription revenue = $90,890M for 91.8% of total revenue\n\nProfessional services revenue = $8,043M for 8.2% of total revenue\n\nThis  is the end of my first article about Smartsheet. My goal is to drop  Part 2 within the next week. The focus of Part 2 will be an in depth  answer of the question – “Can we 10x from here?”\n\n**TL:DR**\n\n* This is Part 1 of my two part deep dive on Smartsheet (Ticker: SMAR).\n* This first part introduces you to (1) me, (2) the company, (3) my thesis on the company, and (4) digs into how they make money.\n* Part  2 (to be released later this week) will go in depth to explore the  question “Can we 10x from here?” If you enjoyed this article and want to  make sure you catch Part 2, [subscribe here.](https://onthemarkpicks.com/subscribe-today/)\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I  am not a financial advisor and this is not investment advice. These are  just my opinions to help facilitate learning and discussion.\n\n**Disclosure:**  I have no position in Smartsheet. I do plan to initiate a long position  when the markets open again in 2021.  I wrote this article myself, and  it expresses my own opinions. I am not receiving compensation for it. I  have no business relationship with any company whose stock is mentioned  in this article.",
        "subreddit": "stocks",
        "title": "Smartsheet (NYSE: SMAR) – Deep Dive Research – Part 1",
        "url": "https://www.reddit.com/r/stocks/comments/kq87y7/smartsheet_nyse_smar_deep_dive_research_part_1/",
        "created": 1609793709.0
    },
    {
        "author": "TheyHaveTheVaccine",
        "created_utc": 1611034323,
        "id": "l0d78m",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Set for the morning. Once my APPL, DIS, and ADBE sells settle, I'll buy more GME. Any other suggestions for what I should sell for more GME fuel? (I just started trading in Nov, I know some of these are dumb especially the amount of shares)",
        "url": "https://www.reddit.com/gallery/l0d78m",
        "created": 1611063123.0
    },
    {
        "author": "requantify",
        "created_utc": 1611282952,
        "id": "l2e30r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Created a write-up for Adobe - its definitely not traditional value stock however with prices trading \\~450-460 range I think it is undervalued. I would love to hear the communities thoughts.\n\n[https://docdro.id/9Phbeh3](https://docdro.id/9Phbeh3)\n\n\\- Requantify",
        "subreddit": "ValueInvesting",
        "title": "Adobe Write-Up",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/l2e30r/adobe_writeup/",
        "created": 1611311752.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610471564,
        "id": "kvvuce",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT\n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "StockMarket",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/StockMarket/comments/kvvuce/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610500364.0
    },
    {
        "author": "Sublime_7365",
        "created_utc": 1609652728,
        "id": "kpesxt",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Started investing recently and believe I may be over diversified. Bullish on these tickers but given the number of positions in the portfolio I only have a cursory understanding of those businesses so I'm trying to trim the number of stocks I own - going for quality over quantity. This portfolio beats the SP when I backtested my purchases using SP instead of these tickers but maybe I can do better if I get rid of the gain diluting stocks? Looking for suggestions on what should go and feel free to suggest other positions not on this list that may be better than some of the positions I already have for long term growth. Looking for more genomics exposure as well (maybe ARGK but not a fan of higher expense ratios). Thanks!\n\nPositions:\n\nFB\n\nAMZN\n\nSQ\n\nSE\n\nFVRR\n\nTSLA\n\nSBE\n\nAAPL\n\nSEDG\n\nNET\n\nCRWD\n\nZM\n\nNVDA\n\nU\n\nADSK\t\n\nLMND\n\nCRSP\n\nPINS\n\nNIO\n\nPLTR\n\nSHOP\t\n\nDOCU\t\n\nMSFT\t\n\nDIS\n\nLUV\n\nAMD\n\nBE\n\nCOUP\n\nBA\n\nNEE\n\nFUBO\n\nFSLY\n\nOKTA\n\nPLUG\n\nDDOG\n\nABNB\n\nCRNC\n\nOSS\n\nZBRA\n\nCHGG\n\nAAL\n\nRGEN\n\nGILD",
        "subreddit": "stocks",
        "title": "Trim my portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/kpesxt/trim_my_portfolio/",
        "created": 1609681528.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649285,
        "id": "kpdy03",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://Stamps.com) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "SecurityAnalysis",
        "title": "Looking for Old Investment Letters on Companies (Case Studies)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kpdy03/looking_for_old_investment_letters_on_companies/",
        "created": 1609678085.0
    },
    {
        "author": "SorenLantz",
        "created_utc": 1609528327,
        "id": "kogze1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "# The Metric\n\nI recently had an idea for a metric to be used to find hot stocks. I call the metric \"Price Elasticity\" and it is comprised of two numbers: upturn elasticity and downturn elasticity.\n\n* Upturn elasticity: the average % change in a stock on market up days\n* Downturn elasticity: the average % change in a stock on market down days\n\nUsing these numbers and a few additional basic requirements (like positive EPS and at least 31 days of trading history), my screener found 99 stocks out of about 5700 searched that have good to exceptional price elasticities. (the list of these stocks is linked below and also [here](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing))\n\n# What makes for good price elasticity numbers?\n\nI made two classifications for stocks with good price elasticity data.\n\n1. **Irrational** \\- Upturn elasticity &gt; 1, Downturn elasticity &lt; 0\n2. **Responsible** \\- Upturn elasticity &gt; 1, 0 &lt; Downturn elasticity &lt; 1\n\nWith any stock I want an upturn elasticity &gt; 1, meaning that the stock tends to move higher than the market when the market goes up. The \"Irrational\" classification gets its name because if a stock's downturn elasticity is negative this means the stock, on average, moves up when the market goes down. So a stock that moves higher than the market when the market goes up and also moves up when the market goes down is classified as \"Irrational\". These stocks tend to have less trading history and are very volatile.\n\nThen there are \"Responsible\" stocks which like Irrational stocks move higher than the market when the market goes up. Unlike Irrational stocks though, Responsible stocks move lower when the market moves lower. The reason I still consider them good is because their downturn elasticity is &lt;1 and &gt;0, meaning that, while they do move down with the market, they move down to a lesser degree.\n\nSome popular stocks picked up by the screener include: AMD, ADSK, ETSY, NFLX, NVDA, SHOP and TSLA. Many of the other stocks have lower market caps and could be interesting value / growth plays given they too made the cut.\n\n# Link to the 99 stocks found:\n\n[https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing)\n\n&amp;#x200B;\n\nI have no idea if there is merit to my Price Elasticity metric (or if it has already been \"invented\") but it was a fun project and the screener found some interesting stocks I would have never discovered otherwise. The validity of the metric is entirely based on the assumption that past trends indicate future performance, and for those looking to beat the market the trends of these 99 stocks should be very appealing. I made the screener using Python3 and TD Ameritrade's API. Of the stocks in that list I am currently holding AMD, CAMT, EPAM, and NLOK.",
        "subreddit": "stocks",
        "title": "My Custom Stock Screener Findings",
        "url": "https://www.reddit.com/r/stocks/comments/kogze1/my_custom_stock_screener_findings/",
        "created": 1609557127.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1609889975,
        "id": "kraxx0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, January 5, 2021**\n\nStocks rose Tuesday as market participants await results from Georgia’s runoff election and continue to monitor rising coronavirus cases in the US and abroad. \n\nSince Novemeber, market participants have closely monitored developments around Georgia’s runoff Senate election, which is set to decide the balance of power in the Senate. In other words, whichever party wins the election in Georgia will have the majority position in the Senate. Currently, Republicans maintain a narrow majority in the chamber, with 50 seats to the Democrat’s 48 when excluding Georgia. If the Democrats win both seats in Georgia they will have a majority because, in the case of a tie, the Vice-President is able to cast the deciding vote. \n\nThe market favors a divided government because it ensures the regulatory environment will remain little changed. Under a Republican-controlled Senate, the incoming Biden administration will likely be unable to advance many of its campaign promises, including raising corporate taxes and minimum wages, and unveiling reforms around education, housing, and climate change, which could all impact various pockets of the market. However, under a unified Democratic government, Congress is likely to pass a larger additional stimulus package to further support the economy in the near-term.  \n\nSadly, new coronavirus cases in the US hit a staggering one-day record of nearly 300,000 over the weekend, according to Johns Hopkins University, most likely attributed to the increase in travel during the holiday period. Despite repeated warnings from health officials about the dangers of traveling, in the last two weeks of December, the TSA reported more than 7 million people were screened at airport security checkpoints. There are now nearly 21 million cases, 128,000 hospitalizations, and 352,000 deaths attributed to the virus in the US alone. Hospital systems across the country are quickly becoming overwhelmed. In California, officials say ICU units in at least two regions are filled to practical capacity. And because of resource limitations, Los Angeles County ambulance crews have been instructed not to transport any patient in blunt traumatic or nontraumatic cardiac arrest if they can't first be resuscitated in the field.\n\nAs of Monday morning, the first doses of a COVID-19 vaccine had been given to more than 4.5 million people in the U.S., far below the Trump Administration promise of vaccinating 20 million Americans by years-end. Dr. Anthony Fauci, said President-elect Joe Biden’s goal of ramping up distribution to vaccinate 100 million people in his first 100 days was a “realistic goal,” according to an interview with ABC on Sunday.\n\nIn the United Kingdom, Prime Minister Boris Johnson ordered a national lockdown through at least mid-February in an effort to stop the spread of the new, more-infectious COVID-19 strain detected a few weeks ago. He said: “Our hospitals are under more pressure from COVID than at any time since the start of the pandemic. It’s clear that we need to do more together to bring this new variant under control while our vaccines are rolled out.” Under the lockdown, people will only be allowed to leave their homes for a limited number of reasons, including shopping for essentials, going to work if they cannot work from home, exercising, seeking medical advice and providing care. Schools are also shutting down.\n\n**Highlights**\n\n* There were conflicting reports today, with some outlets saying Jack Ma, founder of Alibaba (BABA) and Ant Group, is missing after criticizing the Chinese government while others say he is fine, just “laying low”.\n* Crude oil prices topped $50 per barrel for the first time since February, a remarkable comeback given at one point oil was worth negative $37.\n* Amazon (AMZN) purchased 11 planes after confirming it has plans to build its own fleet. Previously the company used leased aircrafts.\n* After falling more than 40% yesterday, QuantumScape (QS) stock rose around 20% today. Absolutely crazy price action\n* Electric cars rise to a record 54% market share in Norway. Seems everywhere in the world people are buying more electric vehicles.\n* According to a report by Bloomberg, Apple (AAPL) supplier Foxconn Technology Group signed a strategic cooperation deal with embattled Chinese electric-vehicle startup Byton with aims to produce a car by Q1 of 2022.\n* Autodesk (ADSK) target raised by Keycorp from $310 to $345 at Overweight. Stock currently around $296.\n* Arvinas (ARVN) target raised by Cantor Fitzgerald from $66 to $121 at Overweight. Stock  currently around $83.\n* HCA Healthcare (HCA) target raised by Deutsche Bannk from $150 to $180 at Buy. Stock currently around $163.\n* Micron Technology (MU) with two target raises. Stock currently around $74.\n   * Deutsche Bank from $75 to $85 at Buy\n   * Royal Bank of Canada from $57 to $83  at Outperform\n* Sunnova Energy (NOVA) target raised by Goldman Sachs from $45 to $60 at Buy. Stock currently around $45.\n* Nevro (NVRO) target raised by Robert W. Baird from $180 to $200 at Outperform. Stock currently around $170.\n* SVB Financial Group (SIVB) wtih two, bullish target raises. Stock currently around $387.\n   * Royal Bank of Canada from $320 to $437 Outperform\n   * Raymond James from $225 to $400 Outperform\n* Synopsys (SNPS) target raised by Keycorp from $265 to $290 at Overweight. Stock currently around $254.\n* Welbilt (WBT) target raised by Keycorp from $11 to $18 at Overweight. Stock currently around $12.50.\n\n“You get in life what you have the courage to ask for.” - Oprah Winfrey",
        "subreddit": "StockMarket",
        "title": "Daily Market Recap - Tuesday, January 5, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/kraxx0/daily_market_recap_tuesday_january_5_2020/",
        "created": 1609918775.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610470968,
        "id": "kvvmsc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT \n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "investing",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/investing/comments/kvvmsc/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610499768.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649315,
        "id": "kpdyaa",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://stamps.com/) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "investing",
        "title": "Looking for Old Investment Letters for the Following Companies",
        "url": "https://www.reddit.com/r/investing/comments/kpdyaa/looking_for_old_investment_letters_for_the/",
        "created": 1609678115.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1610913833,
        "id": "kzdrbg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (Powershares Cleantech Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kzdrbg/pzd_powershares_cleantech_portfolio/",
        "created": 1610942633.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1609608437,
        "id": "kp1h8a",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (PowerShare CleanTeach Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kp1h8a/pzd_powershare_cleanteach_portfolio/",
        "created": 1609637237.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610471564,
        "id": "kvvuce",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT\n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "StockMarket",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/StockMarket/comments/kvvuce/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610500364.0
    },
    {
        "author": "Sublime_7365",
        "created_utc": 1609652728,
        "id": "kpesxt",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Started investing recently and believe I may be over diversified. Bullish on these tickers but given the number of positions in the portfolio I only have a cursory understanding of those businesses so I'm trying to trim the number of stocks I own - going for quality over quantity. This portfolio beats the SP when I backtested my purchases using SP instead of these tickers but maybe I can do better if I get rid of the gain diluting stocks? Looking for suggestions on what should go and feel free to suggest other positions not on this list that may be better than some of the positions I already have for long term growth. Looking for more genomics exposure as well (maybe ARGK but not a fan of higher expense ratios). Thanks!\n\nPositions:\n\nFB\n\nAMZN\n\nSQ\n\nSE\n\nFVRR\n\nTSLA\n\nSBE\n\nAAPL\n\nSEDG\n\nNET\n\nCRWD\n\nZM\n\nNVDA\n\nU\n\nADSK\t\n\nLMND\n\nCRSP\n\nPINS\n\nNIO\n\nPLTR\n\nSHOP\t\n\nDOCU\t\n\nMSFT\t\n\nDIS\n\nLUV\n\nAMD\n\nBE\n\nCOUP\n\nBA\n\nNEE\n\nFUBO\n\nFSLY\n\nOKTA\n\nPLUG\n\nDDOG\n\nABNB\n\nCRNC\n\nOSS\n\nZBRA\n\nCHGG\n\nAAL\n\nRGEN\n\nGILD",
        "subreddit": "stocks",
        "title": "Trim my portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/kpesxt/trim_my_portfolio/",
        "created": 1609681528.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649285,
        "id": "kpdy03",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://Stamps.com) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "SecurityAnalysis",
        "title": "Looking for Old Investment Letters on Companies (Case Studies)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kpdy03/looking_for_old_investment_letters_on_companies/",
        "created": 1609678085.0
    },
    {
        "author": "SorenLantz",
        "created_utc": 1609528327,
        "id": "kogze1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "# The Metric\n\nI recently had an idea for a metric to be used to find hot stocks. I call the metric \"Price Elasticity\" and it is comprised of two numbers: upturn elasticity and downturn elasticity.\n\n* Upturn elasticity: the average % change in a stock on market up days\n* Downturn elasticity: the average % change in a stock on market down days\n\nUsing these numbers and a few additional basic requirements (like positive EPS and at least 31 days of trading history), my screener found 99 stocks out of about 5700 searched that have good to exceptional price elasticities. (the list of these stocks is linked below and also [here](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing))\n\n# What makes for good price elasticity numbers?\n\nI made two classifications for stocks with good price elasticity data.\n\n1. **Irrational** \\- Upturn elasticity &gt; 1, Downturn elasticity &lt; 0\n2. **Responsible** \\- Upturn elasticity &gt; 1, 0 &lt; Downturn elasticity &lt; 1\n\nWith any stock I want an upturn elasticity &gt; 1, meaning that the stock tends to move higher than the market when the market goes up. The \"Irrational\" classification gets its name because if a stock's downturn elasticity is negative this means the stock, on average, moves up when the market goes down. So a stock that moves higher than the market when the market goes up and also moves up when the market goes down is classified as \"Irrational\". These stocks tend to have less trading history and are very volatile.\n\nThen there are \"Responsible\" stocks which like Irrational stocks move higher than the market when the market goes up. Unlike Irrational stocks though, Responsible stocks move lower when the market moves lower. The reason I still consider them good is because their downturn elasticity is &lt;1 and &gt;0, meaning that, while they do move down with the market, they move down to a lesser degree.\n\nSome popular stocks picked up by the screener include: AMD, ADSK, ETSY, NFLX, NVDA, SHOP and TSLA. Many of the other stocks have lower market caps and could be interesting value / growth plays given they too made the cut.\n\n# Link to the 99 stocks found:\n\n[https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing)\n\n&amp;#x200B;\n\nI have no idea if there is merit to my Price Elasticity metric (or if it has already been \"invented\") but it was a fun project and the screener found some interesting stocks I would have never discovered otherwise. The validity of the metric is entirely based on the assumption that past trends indicate future performance, and for those looking to beat the market the trends of these 99 stocks should be very appealing. I made the screener using Python3 and TD Ameritrade's API. Of the stocks in that list I am currently holding AMD, CAMT, EPAM, and NLOK.",
        "subreddit": "stocks",
        "title": "My Custom Stock Screener Findings",
        "url": "https://www.reddit.com/r/stocks/comments/kogze1/my_custom_stock_screener_findings/",
        "created": 1609557127.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1609889975,
        "id": "kraxx0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, January 5, 2021**\n\nStocks rose Tuesday as market participants await results from Georgia’s runoff election and continue to monitor rising coronavirus cases in the US and abroad. \n\nSince Novemeber, market participants have closely monitored developments around Georgia’s runoff Senate election, which is set to decide the balance of power in the Senate. In other words, whichever party wins the election in Georgia will have the majority position in the Senate. Currently, Republicans maintain a narrow majority in the chamber, with 50 seats to the Democrat’s 48 when excluding Georgia. If the Democrats win both seats in Georgia they will have a majority because, in the case of a tie, the Vice-President is able to cast the deciding vote. \n\nThe market favors a divided government because it ensures the regulatory environment will remain little changed. Under a Republican-controlled Senate, the incoming Biden administration will likely be unable to advance many of its campaign promises, including raising corporate taxes and minimum wages, and unveiling reforms around education, housing, and climate change, which could all impact various pockets of the market. However, under a unified Democratic government, Congress is likely to pass a larger additional stimulus package to further support the economy in the near-term.  \n\nSadly, new coronavirus cases in the US hit a staggering one-day record of nearly 300,000 over the weekend, according to Johns Hopkins University, most likely attributed to the increase in travel during the holiday period. Despite repeated warnings from health officials about the dangers of traveling, in the last two weeks of December, the TSA reported more than 7 million people were screened at airport security checkpoints. There are now nearly 21 million cases, 128,000 hospitalizations, and 352,000 deaths attributed to the virus in the US alone. Hospital systems across the country are quickly becoming overwhelmed. In California, officials say ICU units in at least two regions are filled to practical capacity. And because of resource limitations, Los Angeles County ambulance crews have been instructed not to transport any patient in blunt traumatic or nontraumatic cardiac arrest if they can't first be resuscitated in the field.\n\nAs of Monday morning, the first doses of a COVID-19 vaccine had been given to more than 4.5 million people in the U.S., far below the Trump Administration promise of vaccinating 20 million Americans by years-end. Dr. Anthony Fauci, said President-elect Joe Biden’s goal of ramping up distribution to vaccinate 100 million people in his first 100 days was a “realistic goal,” according to an interview with ABC on Sunday.\n\nIn the United Kingdom, Prime Minister Boris Johnson ordered a national lockdown through at least mid-February in an effort to stop the spread of the new, more-infectious COVID-19 strain detected a few weeks ago. He said: “Our hospitals are under more pressure from COVID than at any time since the start of the pandemic. It’s clear that we need to do more together to bring this new variant under control while our vaccines are rolled out.” Under the lockdown, people will only be allowed to leave their homes for a limited number of reasons, including shopping for essentials, going to work if they cannot work from home, exercising, seeking medical advice and providing care. Schools are also shutting down.\n\n**Highlights**\n\n* There were conflicting reports today, with some outlets saying Jack Ma, founder of Alibaba (BABA) and Ant Group, is missing after criticizing the Chinese government while others say he is fine, just “laying low”.\n* Crude oil prices topped $50 per barrel for the first time since February, a remarkable comeback given at one point oil was worth negative $37.\n* Amazon (AMZN) purchased 11 planes after confirming it has plans to build its own fleet. Previously the company used leased aircrafts.\n* After falling more than 40% yesterday, QuantumScape (QS) stock rose around 20% today. Absolutely crazy price action\n* Electric cars rise to a record 54% market share in Norway. Seems everywhere in the world people are buying more electric vehicles.\n* According to a report by Bloomberg, Apple (AAPL) supplier Foxconn Technology Group signed a strategic cooperation deal with embattled Chinese electric-vehicle startup Byton with aims to produce a car by Q1 of 2022.\n* Autodesk (ADSK) target raised by Keycorp from $310 to $345 at Overweight. Stock currently around $296.\n* Arvinas (ARVN) target raised by Cantor Fitzgerald from $66 to $121 at Overweight. Stock  currently around $83.\n* HCA Healthcare (HCA) target raised by Deutsche Bannk from $150 to $180 at Buy. Stock currently around $163.\n* Micron Technology (MU) with two target raises. Stock currently around $74.\n   * Deutsche Bank from $75 to $85 at Buy\n   * Royal Bank of Canada from $57 to $83  at Outperform\n* Sunnova Energy (NOVA) target raised by Goldman Sachs from $45 to $60 at Buy. Stock currently around $45.\n* Nevro (NVRO) target raised by Robert W. Baird from $180 to $200 at Outperform. Stock currently around $170.\n* SVB Financial Group (SIVB) wtih two, bullish target raises. Stock currently around $387.\n   * Royal Bank of Canada from $320 to $437 Outperform\n   * Raymond James from $225 to $400 Outperform\n* Synopsys (SNPS) target raised by Keycorp from $265 to $290 at Overweight. Stock currently around $254.\n* Welbilt (WBT) target raised by Keycorp from $11 to $18 at Overweight. Stock currently around $12.50.\n\n“You get in life what you have the courage to ask for.” - Oprah Winfrey",
        "subreddit": "StockMarket",
        "title": "Daily Market Recap - Tuesday, January 5, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/kraxx0/daily_market_recap_tuesday_january_5_2020/",
        "created": 1609918775.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610470968,
        "id": "kvvmsc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT \n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "investing",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/investing/comments/kvvmsc/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610499768.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649315,
        "id": "kpdyaa",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://stamps.com/) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "investing",
        "title": "Looking for Old Investment Letters for the Following Companies",
        "url": "https://www.reddit.com/r/investing/comments/kpdyaa/looking_for_old_investment_letters_for_the/",
        "created": 1609678115.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1610913833,
        "id": "kzdrbg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (Powershares Cleantech Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kzdrbg/pzd_powershares_cleantech_portfolio/",
        "created": 1610942633.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1609608437,
        "id": "kp1h8a",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (PowerShare CleanTeach Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kp1h8a/pzd_powershare_cleanteach_portfolio/",
        "created": 1609637237.0
    }
]