[
    {
        "author": "Lost-Guarantee229",
        "created_utc": 1625150253,
        "id": "obn698",
        "num_comments": 227,
        "num_crossposts": 0,
        "selftext": "**Valuation: Undervalued**\n\n***$PLTR – Palantir Technologies Inc Investment Summary:***\n\n· Recently, there has been a lot of excitement around Palantir, however, very few people actually understand what they do and how they operate. As a result of this I have decided to take on the task of trying explain exactly what Palantir does and why they could be the best undervalued stock to buy now.\n\no I am no data engineer, so this article contains my interpretations of what Palantir does, some of my interpretations may be off, so I would appreciate any helpful comments to clear some things up that I may have got wrong.\n\n· Based on the comparable analyses that I underwent, Palantir is currently an undervalued stock and represents a great opportunity for a long-term hold.\n\no The length of time that I plan on holding is subject to change due to their future financial reports, and any news that may come out.\n\n· It is very hard to say what the upside potential of an investment into Palantir is, which is why my investment plan (found in the “plan” section) is different than usual.\n\no There are various risks to this investment (like there are to every investment), these risks are highlighted near the end of this report under the “risks” section.\n\no Additionally, there are also multiple different catalysts that can help Palantir’s share price, both in the short and long term(s). These catalysts are listed at the end of this report.\n\n***Overview of Palantir as a Company:***\n\n[$PLTR - Palantir Technologies Inc.](https://utradea.com/stocks/PLTR) was founded in 2003 (after their fear/anger after the events observed through 9/11) and started building their software primarily for government institutions and intelligence to assist in counterterrorism by any means possible. At this point in time, Palantir’s only source of revenue was through secretive government contracts.\n\nHowever, since that point in time, Palantir has expanded their operations into commercial enterprises, as they noticed a lot of similarities and overlaps with their applications. Now, Palantir’s revenue comes from both Government Contracts and Commercial Enterprise Contracts.\n\n*Palantir has 2 main software platforms, Palantir “Gotham”, and Palantir “Foundry”.*\n\n[**Palantir Gotham**](https://www.palantir.com/palantir-gotham/) was their first software platform and was designed for defense/intelligence use cases. Palantir has stated that this kind of platform helps agencies find “needles in thousands of haystacks”. They also noted that [Gotham helped soldiers in Iraq and Afghanistan](https://www.palantir.com/wp-assets/wp-content/uploads/2014/03/Impact-Study-Palantir-Defense-During-Drawdown.pdf) to map networks of bomb makers and insurgents through deep/hidden patterns and datasets, helping the army save time and lives. Since this mission, Gotham has expanded into defense operations and mission planning. During this time, Palantir found that Gotham could also be applied in Airbus’ business, as their planes require millions of parts, assembled in multiple factories in different countries. However, Palantir decided to make another software platform that is better tailored to commercial enterprises, this platform was labelled “Palantir Foundry”.\n\n[**Palantir Foundry**](https://www.palantir.com/palantir-foundry/) transforms the way in which organizations interact with their information by creating a central operating system for their data. Palantir enables their customers to construct their own models quickly and easily from countless sets of data points.\n\nPalantir software is used by their 139 Government and Commercial Institutions/enterprises, in over 40 industries, ranging over 150 countries. Palantir works with the US Government and their several allies abroad, as well as the worlds most important/reliable companies.\n\nLastly, Palantir has stated “We are not in the business of collecting, mining, or selling data. We build the software that enable our customers to integrate their own data that they already have.”\n\n***Everything you need to know about Palantir and $PLTR:***\n\n*Palantir Foundry:*\n\nFoundry is essentially a [data warehouse](https://panoply.io/data-warehouse-guide/the-difference-between-a-database-and-a-data-warehouse/) that helps their commercial customers to collect and analyze their data. Foundry’s platform includes a [graphical data interface](https://www.omnisci.com/technical-glossary/graphical-user-interface) that is extremely user friendly allowing their customers to get the most out of their data. Furthermore, Foundry provides statistical analyses through the use of their [AI machine learning](https://www.palantir.com/solutions/ai-ml/) networks that are able to consistently deliver efficient and accurate results.\n\nFoundry helps to enables all of their users, regardless of their technical abilities, to work meaningfully and act with the data that they collect. Foundry provides a suite of applications that help combine data analytics and business logic, helping them to deliver superior data integration.\n\nFoundry’s front-end (what the user sees) enables their users to take advantage of all of the data collected by their organization to make informed decisions. Foundry also has a fantastic application for inter-organizational collaboration, this helps a team to build on each others work.\n\n*Foundry brings all of an enterprises data together onto their platform, however there are access controls in place to define what individuals get control over which dataset(s). From there, Foundry is able to deliver advanced analytics through their machine learning and AI systems to get the most value out of a company’s data, make quality insights, so that their clients can gain a competitive advantage.*\n\n**Foundries potential use cases are almost infinite.**\n\n*Palantir Gotham:*\n\nDubbed “The Operating System for Government Decision Making”, Gotham helps to improve and accelerate decisions across all levels of Government operations.\n\nGotham is primarily used by the defense and intelligence sections of the Government, to help them find what they are looking for. Gotham collects data from millions of different sources and combines it all into one platform to identify hidden patterns and bring all of this data to life. This allows their users to access this data and manage their operations to execute real-world responses to threats that Gotham identifies. Gotham is becoming a main data solution across various different government agencies.\n\nThere is not too much information that is publicly known about the actual uses of Gotham, which makes sense due to the secretive nature of the organizations that they are in business with. However, what we do know is that these organizations have re-signed contracts with Palantir, which helps us to be confident that this platform is truly “the real deal”.\n\nLastly, Gotham is also offered to select commercial customers, primarily the companies that are investigating fraud in financial service industries. Furthermore, [Palantir has been credited](https://www.bizjournals.com/bizjournals/news/2015/01/12/leaked-documents-bernie-madoff-convicted-thanks-to.html) with assisting in finding the largest Ponzi scheme ever (Bernie Madoff’s Ponzi Scheme).\n\n*Gotham helps the Defense and Intelligence sectors of the Government to pool their incomprehensible amounts of data into one place. Palantir uses machine learning to quickly locate hidden pieces of data, and key patterns, so that these institutions can take swift action to the threats/problems they face in real-time.*\n\n*Palantir’s Approach:*\n\nPalantir believes that every large institution in the world has a problem in their approach to mass data analysis, and Palantir believes that their platforms are best suited to help companies address this problem and make the most out of their data.\n\nPalantir recognises that other companies sell features, tools, applications, and/or dashboards, however these products are not built to maintain optimal performance in the long run (if at all). Palantir prides themselves on having the best all around software/platform to have sustainable, reliable, and safe data solutions.\n\nPalantir also groups their Foundry data from all of their companies into one large system of several large “farms” of data provided by each of their client companies. By doing this, Palantir is able to feed more data/information into their machine learning, AI, and algorithms so that they can continue to be more reliable and efficient. This also enables [cross-industry data pools](https://youtu.be/7zqE8J4WKOU), that can be used by their companies when they look to expand or for opportunities in other verticals.\n\n*Palantir Success Stories:*\n\n**BP:**\n\nPerhaps the most notable success story that has come from Palantir is their partnership with [$BP – British Petroleum](https://utradea.com/stocks/BP)\n\nBP and Palantir have been partners since 2014, and recently (February 2021) [BP and Palantir have extended their partnership](https://www.fool.com/investing/2021/02/05/palantir-deepens-ties-with-bp-with-new-5-year-deal/) for 5 more years. Palantir has helped BP to transform their business into a more digital one, and this extension of their partnership will ensure a further acceleration of their strategic digitization of their business.\n\nPalantir’s Foundry has already helped BP by streamlining and enhancing their hydrocarbon-based workflows. Palantir helped BP to analyze their drilling data and has helped them to [increase their oil production in the North Sea by over 10%.](https://www.thetimes.co.uk/article/palantir-the-tech-spooks-who-found-bin-laden-are-helping-bp-find-oil-9qddfpv2r)\n\nThis increase in production helps us to visualize just how useful Palantir’s software can be. This is why their Foundry has been credited as a “competitive advantage”. Other oil producing companies most likely would not have been able to uncover the data, patterns, and relationships that were uncovered by Palantir, thus the companies that are not using Palantir may be losing out.\n\nThis type of publicity is fantastic for Palantir, as companies may see this, and contact Palantir because they too want a competitive advantage. Palantir’s best chance at becoming the next “tech giant” comes through the commercial applications/contracts. This is because there are infinite uses for Palantir, so theoretically, they can get it in the hands of every business (which would help revenues to soar).\n\n**National Institute of Health (NIH) and Britain’s National Health Service (NHS):**\n\nPalantir has historically been a rather controversial company through their help in government agencies like ICE. However, recently Palantir has been getting good press, which has helped their company image. Since the start of the pandemic some institutions like the NIH and NHS have signed contracts with Palantir, for Palantir’s assistance with their fights against COVID-19, and their vaccine distributions. This is good for Palantir as it shows them in a good light and shows that they can help provide the world with help and safety during a crisis like COVID-19.\n\nThe NIH agreed to a [$36M contract](https://www.palantir.com/pt_media/nih-palantir-contract/) to gain a partnership with Palantir. Their (NIH’s), mission is to build the largest centralized COVID-19 patient database in the world, and Palantir has helped them to do this with massive success.\n\nPalantir was able to assist the NIH in building their [N3C data platform](https://covid.cd2h.org/). This platform has come a long way since they teamed up with Palantir, and now has over 7.1B rows of data from 6.5M patients, from 57 different databases. Without the assistance of Palantir, analyzing this amount of data would have been no easy feat, however Palantir has provided the NIH with advanced analytics in the matter of minutes thank to their machine learning capabilities.\n\nAdditionally, in December of 2020, Palantir signed a [2-year $31.5M deal](https://www.businesswire.com/news/home/20201223005018/en/Palantir-Continues-Vital-NHS-Work-With-31.5M-Contract) with the Brittan’s NHS. This partnership requires Foundry to provide a secure, reliable, and timely platform to process data, while protecting patient privacy, to ultimately improve patient care.\n\nBoth of these partnerships highlight the need for Palantir during a crisis and having these large Government Health Institutes choosing Palantir as their first options is a great deal, and shows their confidence in Palantir’s software.\n\n*Sources:*\n\n[The power of data in a pandemic - Technology in the NHS (blog.gov.uk)](https://healthtech.blog.gov.uk/2020/03/28/the-power-of-data-in-a-pandemic/)\n\n*Strengths:*\n\n**Built-in Privacy Controls:**\n\nBy having [privacy controls](https://youtu.be/7zqE8J4WKOU) in place, Palantir is able to operate in places that other data companies cannot go. This is especially true for Foundry, where companies/individuals can request cross-industry data from other Palantir clients to help them in a variety of ways. This request for external data needs to be accepted by a representative of the other company to be allowed. This helps Palantir leverage all of the data that they have on their “Operating System”, which essentially makes their platform a cross-company/cross-country collaborative workspace for all. As Palantir attains more clients, the more attractive/extensive their database is for potential clients. This should help Palantir to expand quickly once they get the ball rolling.\n\nPalantir truly values this privacy and has integrated data legibility, audit logs, access controls, quality checks and requirements to attain external data.\n\n**Government Grade Security:**\n\nAs we know, Palantir started out in just the defense and intelligence spaces. This required Palantir to have elite-level security from the get-go. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This is no easy feat, however Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients, because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has [IL-5 clearance](https://simplemoneylyfe.com/palantir-stock-analysis/) with the Department of Defense (DoD), which makes them 1 of 4 software companies with this level of clearance (alongside Oracle, Salesforce, and SAP). However, it has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of **classified information.**\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology truly is and should provide ease of mind to companies that they are in business with.\n\n**Expansion into the Commercial Sector:**\n\nPalantir currently has a huge opportunity ahead of them as they continue to increase their presence in the commercial sector, partnering with some of the largest enterprises in the world. Palantir plans to provide these businesses with the software that they need to do their jobs as efficient as possible and sees large growth potential in this industry.\n\nPalantir has said that they are focusing on building partnerships with enterprises that are willing to undergo structural changes within the organization/operations. Palantir has a huge market ahead of themselves in the commercial sector, and their stock should do well on the news breaking of new partnerships between Palantir and commercial enterprises.\n\n*Government Contracts:*\n\nDo you remember what I said earlier about what happens once Palantir gets the ball rolling? If so, you will know where I am headed with this section.\n\nBetween 2008-2018 (10 years), Palantir was able to generate $51.9M in revenue from government contracts. However, in the 2 years following this they earned $179.9M in Government contracts (this can be found under the “US Government” section of their [SEC 10-K report](https://sec.report/Document/0001193125-21-060650/#tx65934_1)). Once Palantir was able to get the ball rolling with these agencies, Palantir was able to both expand and renew existing contracts to earn more revenue. I believe that the same thing will happen with Palantir’s commercial operations. Once they start to get a large number of big enterprises renewing their contracts for “bigger bucks”, I believe that Palantir will start to grow their revenues extremely quick and attract new clients “left, right, and center”.\n\nThese contract renewals are so important because essentially, they mean that Palantir met and/or exceeded expectations, and these companies now believe that Palantir is vital to their business/operations, so look out for news around renewals.\n\n*Business Model:*\n\nPalantir has developed a business model that focuses on acquiring contracts and expanding their services and has 3 main phases.\n\n1. **Acquire Customers:** Palantir has expanded their sales force largely over the past couple of years, and actively purse negotiations with companies that they can provide long-term value to. To acquire these companies, Palantir gives them a short demo to see how effective and user friendly their software is, Palantir provides this service for a loss. However, they are willing to incur these (proportionately) small losses to potentially acquire large contracts with these companies. This phase runs at a loss but helps Palantir set up clients for the next phase.\n2. **Expand:** Once Palantir has a potential customer on the hook, they move them along to the expand phase. Palantir installs their software in these enterprises and teaches them the ropes, of course this requires a large investment from Palantir to incorporate it. These customers often sign a short contract with Palantir for a cheap cost (Palantir takes a loss on this phase as well), however clients are able to truly unlock Palantir’s software during this phase and see what it has to offer. If they like their software, they will be moved along to the next phase (scale) which is Palantir’s bread and butter.\n3. **Scale:** These clients tend to sign longer-term deals with Palantir for their software after they have got a “good feel” for their software. The companies in this stage are also generally “hands-off” meaning that they can operate the software without much help. Companies tend to find the most value in this stage, and Palantir makes the best margins on this stage. In 2020, Palantir made $613.4M in this stage with a margin of 70%\n\n*Financial information:*\n\nAll of this information can be found in their [SEC 10-K filing.](https://sec.report/Document/0001193125-21-060650/#tx65934_1)\n\n· **Financial Performance (Good):** In 2020, Palantir increased their gross profit by 47.97% and increased their gross margin to 81% (from 71%), Palantir reported their first net income (excluding stock-based compensation) ever and increase their net revenues by 47.15%.\n\n· **Financial Performance (Bad):** In 2020, Palantir’s loss from operations increased by 103.61%, their stock-based compensation increased by 425.15%, their General and Admin expenses increased by 108.59%, and their net loss increased by 101.22%. Their biggest problem in 2020 was their large stock-based compensation, which will be addressed later.\n\n· **Convertible Preferred Stock:** In 2020, Palantir issued a total of 797,771,675 shares of common stock through conversion of their previous “convertible referred shares”. This one factor of dilution caused an estimated dilutionary effect of Palantir’s stock of 137.19%. This is a huge form of dilution, and I have never seen anything like this before, however I have an explanation for this so stay tuned for that.\n\n· **Repurchase of Common Stock:** In 2020, Palantir repurchased 808,201 shares back. This is a measly amount compared to the amount of dilution from preferred stock, however any buyback is good to see as an investor. This buyback caused an inflationary effect on existing shares of 0.14%, which is not much, but we will still take it.\n\n· **Stock Warrants:** In 2020, Palantir experienced an additional 7,631,329 shares on the market through the exercising of warrants. The exercising of these warrant had a dilutionary effect on Palantir’s stock of 1.31%.\n\n· **Common Stock (Net of Issuance Costs):** In 2020, Palantir unloaded 206,500,523 common shares onto the market from issuance of common stock net of issuance costs. I believe that this means that, Palantir had to fork out additional shares to cover the investment needed to take their shares public. I could very well be wrong on that, and if anyone can pitch in and explain this to me that would be great! Anyways, this caused a dilutionary effect of Palantir’s common stock of roughly 35.51%. This is a large portion of dilution, however it does not even factor in other factors of dilution which is worrying.\n\n· **Stock Options:** In 2020, Palantir added 120,617,527 common shares to their shares outstanding through the exercise of options. These options were exercised and thus converted into these common shares and had a dilutionary effect of 20.72%. Once again, this is a large amount of dilution and should be considered by investors.\n\n· **RSU’s:** In 2020, Palantir issued 82,429,575 shares through their vesting of “Restricted Stock Units” (RSU’s). This had a dilutionary effect on their stock of 14.18% (which is a lot of dilution).\n\n· **Modification to Stock Options:** In 2020, Palantir technically bought back 3,500,0000 shares through modifications to stock options (for the settlement of employee loans accounted for as modifications to stock options). Confusing, right? This technical buyback resulted in a share inflation of 0.6%.\n\n· **Total Share Dilution in 2020:** In 2020, Palantir experience an overall share dilution of 208.19%. This is the most dilution I have ever seen in a stock that I have analyzed, however there are some potential answers as to why there was so much dilution in 2020.\n\n*Explanation of Share Dilution:*\n\nOnce again, all of the below information can be found in Palantir’s [SEC 10-K filing](https://sec.report/Document/0001193125-21-060650/#tx65934_1).\n\nOn September 30th, 2020, Palantir completed their Direct Listing of their Class A common shares on the public markets on the NYSE. Part of this listing involved the redemption of all of Palantir’s convertible share into common shares. This was the largest single source of dilution in Palantir (137%). Additionally, this Direct Listing involved the exercise of al outstanding warrants, which resulted in dilution of 1.31%. Another part of their Direct Listing was the common stocks issued, net of issuance price to complete the direct listing, which had a dilutionary effect of 35.51%. Lastly, Palantir was forced to create new common shares that would hold the place of the unvested RSU’s, which cause a dilutionary effect of 14.18%.\n\nWithout these factors of dilution, Palantir would have only experienced an overall dilution of 20%. This means that due to the Direct listing, Palantir had to increase their shares outstanding by 188.19% to meet the requirements to be eligible for the listing.\n\n*Overall Thoughts on Dilution:*\n\nPalantir is a very weird stock in terms of their dilution, and I have not seen anything quite like this before. Their overall level of dilution is unprecedented and very worrying for investors. However, we know that these levels of dilution were inflated due to the requirements of undergoing a Direct Listing. However, how does Palantir dilution (excluding the effects caused by their Direct Listing compared to their dilution in previous years?\n\nFor starters, Palantir exhibited a 20% share dilution in 2020 when eluding the dilution caused by the Direct Listing. However, historically Palantir has experienced an average share dilution of 5.18% between 2017-2019. So even excluding the effects caused through the Direct Listing, Palantir still experienced a comparably high level of share dilution. However, 20% of dilution is significantly different than the 208.19% of dilution (which would be crazily high). This 20% is relatively normal for an undervalued growth stock, such as Palantir, so currently I would not be too worried. However, investors should keep up with their financial reports and look for their dilution in 2021, because ultimately that will tell us more about Palantir’s dilution after going public, than their past share dilution as a private company.\n\n*Competition:*\n\nIn order to undergo my comparable analyses (which will be discussed later on) I needed to select 4 companies, that I can compare to Palantir.\n\n[**$ZS – Zscaler Inc**](https://utradea.com/stocks/ZS)**:** ZScaler is a security as a service company that helps company adapt to cloud technologies and provides their cybersecurity services through the cloud. ZScaler provides their services to both commercial enterprises and governments, similar to that of Palantir. Furthermore, ZScaler offers their service primarily in the USA, but also has smaller international operations (again like Palantir).\n\n[**$SNOW – Snowflake Inc**](https://utradea.com/stocks/SNOW)**:** Snowflake (like Palantir) is a software and technology company that primarily focuses on data. Snowflake provides data cloud services such as data engineering, data science, data applications, data sharing, and data warehouse. This is very similar to the applications and functions available on Palantir, however Palantir offers other functions that differentiate themselves. Snowflake also provides services for both commercial enterprises and government organizations, similar to that of Palantir.\n\n[**$SPLK – Splunk Inc**](https://utradea.com/stocks/SPLK)**:** Splunk provide software platforms that deliver insights derived from their clients’ data in the USA and internationally. Splunk offers their Ecosystem solutions that consist of data inputs, workflows, reports, dashboards, data visualizations, actions, and methods, and help their clients/customers to make the best out of their data. All of this sounds eerily familiar to the description of Palantir, making it one of the closer competitors. Splunk also offers their services to the public sector as well as the government, making their business model resemble that of Palantir so much more.\n\n[**$TYL – Tyler technologies Inc**](https://utradea.com/stocks/TYL)**:** Tyler technologies is probably the company in this list that least resembles that of Palantir, this is because they provide management solutions, accounting systems, billing systems and other solutions geared toward the public sector. Tyler technologies works primarily with governments of all types (Federal, State, and Municipal), and education institutions. However, the one thing that Tyler has that makes them comparable to Palantir is their data and insight solutions. Their data insights software enables collaboration, displays data visualizations/measurements, and generates insights for their human operators to act on.\n\n*Q1 2021 Updates:*\n\nAll of the below information can be found in [Palantir’s Q1 Investor Presentation](https://investors.palantir.com/files/Palantir%20Q1%202021%20Business%20Update.pdf).\n\nRecently, on May 11th, 2021, Palantir released their Q1 earnings report. When looking at Palantir’s financial performance I did not take this into account, which means that this section will be packed with new information that will help us to understand Palantir’s trajectory even more.\n\nFirst and foremost, this quarter was the first quarter in which Palantir has reported positive earnings. This is a big milestone for Palantir as a public company, and it helps to gets investors excited about the potentially profitable future of Palantir. In Q1, Palantir reported a free cash flow of $151M (was -$290M in Q1 2020) with a 44% adjusted FCF margin, they grew revenues by 49% YoY ($341M), and they grew billings by 248% YoY ($362M) which means that Palantir is acquiring new customers and negotiating higher contracts. These financials are great and show a promising future ahead for Palantir, which should excite their investors.\n\nFurthermore, during this quarter they also disclosed their investment in a SPAC. This SPAC is [$QELL – Qell Acquisition Corp.](https://utradea.com/stocks/QELL) which merging with Lilium. Lilium is an eVTOL transportation company, with this investment they also came to a deal with Lilium to use Foundry for design, engineering, testing, production, quality, logistics, and operations. A while back I looked at another eVTOL SPAC Archer ([$ACIC – Atlas Crest Investment Corp.](https://utradea.com/stocks/ACIC)), which has great upside and has a similar business model to Lilium, so if you want to read that to be more informed about Liliums potential performance, [click here.](https://utradea.com/positions/Take_a_SHOT_at_Archers_SPAC_ACIC)\n\nIn Q1, Palantir was also awarded with a [5-year $90M contract](https://www.businesswire.com/news/home/20210405005238/en/Palantir-Selected-by-the-National-Nuclear-Security-Administration-for-5-year-89.9M-Contract-for-SAFER-Project) from the National Nuclear Security Administration (NNSA), in which Palantir will provide the operational platform for their SAFER (Safety Analytics, Forecasting, and Evaluation Reporting) project. This is big news as this is one of Palantir’s bigger contracts, and it shows the level of confidence of the NNSA in Palantir’s software and their cross-enterprise data integration capabilities. On the topic of Palantir and Government Organizations, the DoD used Palantir’s software in all 11 of their Combatant Commands for globally integrated intelligence. This high level of usage from the DoD definitely means that Palantir is doing something right, and if the DoD likes it so much, then it should be more than enough for commercial enterprises.\n\nLastly, in Q1, Palantir won 15 contracts worth over $5M, and 6 contracts worth over $10M with an average duration of 3.7 years (4.6 for commercial customers). This is fantastic for the company as they gained an additional 11 new commercial customers from this, and I will be keeping up to date with these contracts and others as they come up for renewal/negotiations. Additionally, Palantir was able to grow their gross margin to 83% (from 75% Q1 2020), and their contribution margin to 60% (from 41% in Q1 2020). This shows that Palantir business partners are maturing into their 3rd phase, the scale phase, which enables Palantir to grow their margins.\n\n***$PLTR – Palantir Investment Valuation:***\n\n*Comparable Analyses:*\n\nI decided to undergo 2 different comparable analyses in order to get a variety of valuations (or opinions if you will). Preferably, I would like both of these results to be consistent in terms of their fair value estimate, however, if they are not consistent, I will take the average result. I was only able to find 2 multiples/ratios that I could actually analyze due to the nature of these businesses and their lack of positive financial ratios/multiples.\n\n*EV/Revenue:*\n\nThis is a very common multiple among companies that are not profitable in their operations yet, like Palantir and some of these other comparable companies. By comparing Palantir’s EV/Revenue multiple to that of their competitors (listed above on the “competitors” section of this report), I found that Palantir has a fair value of $32.85/share, which implies an upside to this investment of 23.31%. This implies that given Palantir’s current price, they are undervalued, and the upside is very reasonable, however, I decided to undergo the next comparable to see if this result maintains.\n\n*P/B:*\n\nBy comparing Palantir’s P/B ratio to that of their competitors, I found that Palantir has a fair value of $24.87/share, which implies that there is a downside risk of 6.64% to such an investment. As you have probably noticed, these results are not consistent, therefore I have decided to take the average result to get one, final price target.\n\n*Average Comparable:*\n\nBy taking the average result from the 2 comparable analyses underwent, I found that Palantir has a fair value of $28.86/share, which implies an overall upside of 8.36% to this investment. This also implies that Palantir, is in fact an undervalued growth stock, that has the potential to be one of the best undervalued stocks on the market.\n\n***My Plan for Investing into Palantir:***\n\nMy plan for this investment is a little different from usual.\n\nI see anything between $24.87/share (Fair Value of P/B ratio) and $28.86/share (average comparable) as a good chance to buy Palantir at (or below) its fair value. This helps to limit our downside risk of this investment.\n\nHowever, I think the best way to play an investment in Palantir is over the long-run 3+ years. I would attempt to buy in at the above prices and hold for these 3+ years. During this time, I would re-evaluate my investment with every new financial report and piece of news to decide if it is still worth holding.\n\n***Potential Risks to Palantir’s Stock - $PLTR:***\n\n· **Dilution:** Over the past year Palantir has experienced a lot of dilution, however, we have already attributed a great deal of this dilution to their Direct Listing. However, the 20% of dilution that was not derived from the direct listing is still quite high. As investors, we should keep an eye on their future levels of dilution to recognize any patterns/increases that we should be weary of. If these levels of dilution persist, potential investors may be scares off and current investor might sell their positions, which will hurt the share price.\n\n· **Financial Performance:** This year’s financial performance was not one to be overly happy about. Although they were able to increase some pretty important aspects of their balance sheet, Palantir was still yet to make a profit, and increased their net losses by over 100%. If this poor financial performance continues, and they keep digging themselves into a bigger and bigger hole, investors will run away from this stock and never look back. However, the Q1 financial performance gives investors hope for a more profitable future, which will be discussed later.\n\n· **Bad Press:** Historically, Palantir has not been looked at through a positive lens by many people investors and non-investors alike. Their first public backlash came through their involvement in deporting immigrants through [Palantir’s partnership with ICE](https://www.bbc.com/news/business-54348456). Palantir quicky spoke out against this backlash by saying ICE took advantage of their software without proper oversight, and that they are looking into the issues, furthermore they have since declined some potential partnerships with other border agencies to avoid further backlash. There have also been numerous smaller controversies and protests that have damaged Palantir’s reputation, and if there are more large controversies Palantir’s stock could get hurt as a result of it.\n\n***Potential Catalysts that can Help Palantir’s Stock Price:***\n\n· **Share Buybacks:** Over the past year, Palantir has bought back (both directly and indirectly, in a sense) over 4,300,000 of their common shares. This is good to see as an investor, especially this early in the company (and not too long after their Direct Listing). This gives me hope that Palantir will continue to repurchase more shares in the future. This will be good for the share price as it will increase the value of existing shares, and it will be especially good for the stock price if they continue to buyback more shares each year.\n\n· **Financial Performance:** Palantir’s 2020 financial report was not favourable (as discussed previously), however there were definitely some good to take out of it. Palantir increased their revenue, gross profit, and margins by a hefty amount, which is good to see as an investor, however, there was bad aspects of this report as well that made the report unfavourable. However, their newly released Q1 2021 financial report has so much more to offer in terms of good aspects of a financial report.\n\n· **Positive Press:** As previously mentioned, Palantir has had their fair share of bad press that has had a small effect on their share price. However, recently Palantir has been getting better press through helping organizations like the NIH and NHS in their fight against COVID-19, and their vaccine distribution efforts. Partnerships like this help to display the positive impacts that can be derived from Palantir’s technology. Future events where Palantir can use their software for a good cause can help to combat the negative stigma around Palantir and attract more people to invest in their company. This should help their share price in the short term after these articles are released.\n\n· **Success Stories:** Since Palantir have gone public, they have had a few success stories come out, I mentioned some of these stories throughout the article. These success stories show how impactful Palantir’s software can be and can show companies that they can increase revenues, production etc. just by using Palantir’s software. Any future stories like this that come out, highlighting the benefits of Palantir can help the stock soar, and potential clients to reach out and start business/inquiries with Palantir.\n\n· **Renewing Contracts:** I have mentioned that the renewal of contracts can help Palantir’s share price a couple times throughout this article but why is this the case? This is because these companies that are renewing have already been through Palantir’s 3 stage business model and have experienced their software firsthand for numerous years. After their time with Palantir’s software expires they decide to renew the contract. This is good because it shows that Palantir’s software was effective enough to their business in the time they had it that it is worth these $5-15M+ contract renewals. Furthermore, these companies that are renewing already have underwent Palantir’s installation, and these clients will provide Palantir with the highest margins, which will reflect well on Palantir’s future financial reports.\n\n· **New Partnerships/Contracts (and the expansion of commercial enterprise segment):** Every time that Palantir, or its partners release news that they have entered into a contract/agreement, this will help Palantir’s stock. This is because Palantir needs to keep expanding their software into new companies in order to meet their expected growth projections. Furthermore, as more commercial enterprises try Palantir’s software (and hopefully enjoy it), the more willing other companies might be to give Palantir a shot. I see their biggest potential for growth and to become a large company in their expansion of their commercial enterprise segment through Foundry. Every time Palantir gets more new clients on board it is fantastic and shows the feasibility of this segment, and as more contracts role in, more enterprises will take an interest. Furthermore, when Palantir signs these enterprises to a contract, it will help to increase their revenues, which will show up on their financial reports and hopefully help the, to beat estimates.\n\n*This analysis took a long time, and is one of the most comprehensive that I have seen, so I would greatly appreciate if you followed me* [*here*](https://utradea.com/member-portfolio/BeatingTheVTI?utm_source=R&amp;utm_medium=B&amp;utm_campaign=PLTR)*, and commented on my original post!*",
        "subreddit": "wallstreetbets",
        "title": "The BEST Palantir Analysis Around!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obn698/the_best_palantir_analysis_around/",
        "created": 1625179053.0
    },
    {
        "author": "Lost-Guarantee229",
        "created_utc": 1625149986,
        "id": "obn2z7",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Valuation: Undervalued**\n\n***$PLTR – Palantir Technologies Inc Investment Summary:***\n\n· Recently, there has been a lot of buzz around Palantir, however, very few people actually understand what they do and how they operate. As a result of this I have decided to take on the task of trying explain exactlywhat Palantir does and why they could be the best undervalued stock to buy now.\n\no I am no data engineer, so this article contains my interpretations of what Palantir does, some of my interpretations may be off, so I would appreciate any helpful comments to clear some things up that I may have got wrong.\n\n· Based on the comparable analyses that I underwent, Palantir is currently an undervalued stock and represents a great opportunity for a long-term hold.\n\no The length of time that I plan on holding is subject to change due to their future financial reports, and any news that may come out.\n\n· It is very hard to say what the upside potential of an investment into Palantir is, which is why my investment plan (found in the “plan” section) is different than usual.\n\no There are various risks to this investment (like there are to every investment), these risks are highlighted near the end of this report under the “risks” section.\n\no Additionally, there are also multiple different catalysts that can help Palantir’s share price, both in the short and long term(s). These catalysts are listed at the end of this report.\n\n***Overview of Palantir as a Company:***\n\n[$PLTR - Palantir Technologies Inc.](https://utradea.com/stocks/PLTR) was founded in 2003 (after their fear/anger after the events observed through 9/11) and started building their software primarily for government institutions and intelligence to assist in counterterrorism by any means possible. At this point in time, Palantir’s only source of revenue was through secretive government contracts.\n\nHowever, since that point in time, Palantir has expanded their operations into commercial enterprises, as they noticed a lot of similarities and overlaps with their applications. Now, Palantir’s revenue comes from both Government Contracts and Commercial Enterprise Contracts.\n\n*Palantir has 2 main software platforms, Palantir “Gotham”, and Palantir “Foundry”.*\n\n[**Palantir Gotham**](https://www.palantir.com/palantir-gotham/) was their first software platform and was designed for defense/intelligence use cases. Palantir has stated that this kind of platform helps agencies find “needles in thousands of haystacks”. They also noted that [Gotham helped soldiers in Iraq and Afghanistan](https://www.palantir.com/wp-assets/wp-content/uploads/2014/03/Impact-Study-Palantir-Defense-During-Drawdown.pdf) to map networks of bomb makers and insurgents through deep/hidden patterns and datasets, helping the army save time and lives. Since this mission, Gotham has expanded into defense operations and mission planning. During this time, Palantir found that Gotham could also be applied in Airbus’ business, as their planes require millions of parts, assembled in multiple factories in different countries. However, Palantir decided to make another software platform that is better tailored to commercial enterprises, this platform was labelled “Palantir Foundry”.\n\n[**Palantir Foundry**](https://www.palantir.com/palantir-foundry/) transforms the way in which organizations interact with their information by creating a central operating system for their data. Palantir enables their customers to construct their own models quickly and easily from countless sets of data points.\n\nPalantir software is used by their 139 Government and Commercial Institutions/enterprises, in over 40 industries, ranging over 150 countries. Palantir works with the US Government and their several allies abroad, as well as the worlds most important/reliable companies.\n\nLastly, Palantir has stated “We are not in the business of collecting, mining, or selling data. We build the software that enable our customers to integrate their own data that they already have.”\n\n***Everything you need to know about Palantir and $PLTR:***\n\n*Palantir Foundry:*\n\nFoundry is essentially a [data warehouse](https://panoply.io/data-warehouse-guide/the-difference-between-a-database-and-a-data-warehouse/) that helps their commercial customers to collect and analyze their data. Foundry’s platform includes a [graphical data interface](https://www.omnisci.com/technical-glossary/graphical-user-interface) that is extremely user friendly allowing their customers to get the most out of their data. Furthermore, Foundry provides statistical analyses through the use of their [AI machine learning](https://www.palantir.com/solutions/ai-ml/) networks that are able to consistently deliver efficient and accurate results.\n\nFoundry helps to enables all of their users, regardless of their technical abilities, to work meaningfully and act with the data that they collect. Foundry provides a suite of applications that help combine data analytics and business logic, helping them to deliver superior data integration.\n\nFoundry’s front-end (what the user sees) enables their users to take advantage of all of the data collected by their organization to make informed decisions. Foundry also has a fantastic application for inter-organizational collaboration, this helps a team to build on each others work.\n\n*Foundry brings all of an enterprises data together onto their platform, however there are access controls in place to define what individuals get control over which dataset(s). From there, Foundry is able to deliver advanced analytics through their machine learning and AI systems to get the most value out of a company’s data, make quality insights, so that their clients can gain a competitive advantage.*\n\n**Foundries potential use cases are almost infinite.**\n\n*Palantir Gotham:*\n\nDubbed “The Operating System for Government Decision Making”, Gotham helps to improve and accelerate decisions across all levels of Government operations.\n\nGotham is primarily used by the defense and intelligence sections of the Government, to help them find what they are looking for. Gotham collects data from millions of different sources and combines it all into one platform to identify hidden patterns and bring all of this data to life. This allows their users to access this data and manage their operations to execute real-world responses to threats that Gotham identifies. Gotham is becoming a main data solution across various different government agencies.\n\nThere is not too much information that is publicly known about the actual uses of Gotham, which makes sense due to the secretive nature of the organizations that they are in business with. However, what we do know is that these organizations have re-signed contracts with Palantir, which helps us to be confident that this platform is truly “the real deal”.\n\nLastly, Gotham is also offered to select commercial customers, primarily the companies that are investigating fraud in financial service industries. Furthermore, [Palantir has been credited](https://www.bizjournals.com/bizjournals/news/2015/01/12/leaked-documents-bernie-madoff-convicted-thanks-to.html) with assisting in finding the largest Ponzi scheme ever (Bernie Madoff’s Ponzi Scheme).\n\n*Gotham helps the Defense and Intelligence sectors of the Government to pool their incomprehensible amounts of data into one place. Palantir uses machine learning to quickly locate hidden pieces of data, and key patterns, so that these institutions can take swift action to the threats/problems they face in real-time.*\n\n*Palantir’s Approach:*\n\nPalantir believes that every large institution in the world has a problem in their approach to mass data analysis, and Palantir believes that their platforms are best suited to help companies address this problem and make the most out of their data.\n\nPalantir recognises that other companies sell features, tools, applications, and/or dashboards, however these products are not built to maintain optimal performance in the long run (if at all). Palantir prides themselves on having the best all around software/platform to have sustainable, reliable, and safe data solutions.\n\nPalantir also groups their Foundry data from all of their companies into one large system of several large “farms” of data provided by each of their client companies. By doing this, Palantir is able to feed more data/information into their machine learning, AI, and algorithms so that they can continue to be more reliable and efficient. This also enables [cross-industry data pools](https://youtu.be/7zqE8J4WKOU), that can be used by their companies when they look to expand or for opportunities in other verticals.\n\n*Palantir Success Stories:*\n\n**BP:**\n\nPerhaps the most notable success story that has come from Palantir is their partnership with [$BP – British Petroleum](https://utradea.com/stocks/BP)\n\nBP and Palantir have been partners since 2014, and recently (February 2021) [BP and Palantir have extended their partnership](https://www.fool.com/investing/2021/02/05/palantir-deepens-ties-with-bp-with-new-5-year-deal/) for 5 more years. Palantir has helped BP to transform their business into a more digital one, and this extension of their partnership will ensure a further acceleration of their strategic digitization of their business.\n\nPalantir’s Foundry has already helped BP by streamlining and enhancing their hydrocarbon-based workflows. Palantir helped BP to analyze their drilling data and has helped them to [increase their oil production in the North Sea by over 10%.](https://www.thetimes.co.uk/article/palantir-the-tech-spooks-who-found-bin-laden-are-helping-bp-find-oil-9qddfpv2r)\n\nThis increase in production helps us to visualize just how useful Palantir’s software can be. This is why their Foundry has been credited as a “competitive advantage”. Other oil producing companies most likely would not have been able to uncover the data, patterns, and relationships that were uncovered by Palantir, thus the companies that are not using Palantir may be losing out.\n\nThis type of publicity is fantastic for Palantir, as companies may see this, and contact Palantir because they too want a competitive advantage. Palantir’s best chance at becoming the next “tech giant” comes through the commercial applications/contracts. This is because there are infinite uses for Palantir, so theoretically, they can get it in the hands of every business (which would help revenues to soar).\n\n**National Institute of Health (NIH) and Britain’s National Health Service (NHS):**\n\nPalantir has historically been a rather controversial company through their help in government agencies like ICE. However, recently Palantir has been getting good press, which has helped their company image. Since the start of the pandemic some institutions like the NIH and NHS have signed contracts with Palantir, for Palantir’s assistance with their fights against COVID-19, and their vaccine distributions. This is good for Palantir as it shows them in a good light and shows that they can help provide the world with help and safety during a crisis like COVID-19.\n\nThe NIH agreed to a [$36M contract](https://www.palantir.com/pt_media/nih-palantir-contract/) to gain a partnership with Palantir. Their (NIH’s), mission is to build the largest centralized COVID-19 patient database in the world, and Palantir has helped them to do this with massive success.\n\nPalantir was able to assist the NIH in building their [N3C data platform](https://covid.cd2h.org/). This platform has come a long way since they teamed up with Palantir, and now has over 7.1B rows of data from 6.5M patients, from 57 different databases. Without the assistance of Palantir, analyzing this amount of data would have been no easy feat, however Palantir has provided the NIH with advanced analytics in the matter of minutes thank to their machine learning capabilities.\n\nAdditionally, in December of 2020, Palantir signed a [2-year $31.5M deal](https://www.businesswire.com/news/home/20201223005018/en/Palantir-Continues-Vital-NHS-Work-With-31.5M-Contract) with the Brittan’s NHS. This partnership requires Foundry to provide a secure, reliable, and timely platform to process data, while protecting patient privacy, to ultimately improve patient care.\n\nBoth of these partnerships highlight the need for Palantir during a crisis and having these large Government Health Institutes choosing Palantir as their first options is a great deal, and shows their confidence in Palantir’s software.\n\n*Sources:*\n\n[The power of data in a pandemic - Technology in the NHS (blog.gov.uk)](https://healthtech.blog.gov.uk/2020/03/28/the-power-of-data-in-a-pandemic/)\n\n*Strengths:*\n\n**Built-in Privacy Controls:**\n\nBy having [privacy controls](https://youtu.be/7zqE8J4WKOU) in place, Palantir is able to operate in places that other data companies cannot go. This is especially true for Foundry, where companies/individuals can request cross-industry data from other Palantir clients to help them in a variety of ways. This request for external data needs to be accepted by a representative of the other company to be allowed. This helps Palantir leverage all of the data that they have on their “Operating System”, which essentially makes their platform a cross-company/cross-country collaborative workspace for all. As Palantir attains more clients, the more attractive/extensive their database is for potential clients. This should help Palantir to expand quickly once they get the ball rolling.\n\nPalantir truly values this privacy and has integrated data legibility, audit logs, access controls, quality checks and requirements to attain external data.\n\n**Government Grade Security:**\n\nAs we know, Palantir started out in just the defense and intelligence spaces. This required Palantir to have elite-level security from the get-go. Their software had to be secure enough to handle national secrets and transparent enough to ensure that the data could be monitored and traced. This is no easy feat, however Palantir managed to achieve this, which is why they have been renewing their contracts with several government agencies.\n\nThis is important when trying to sell their products to their commercial clients, because they need something safe and reliable to protect themselves and their data. Furthermore, Palantir currently has [IL-5 clearance](https://simplemoneylyfe.com/palantir-stock-analysis/) with the Department of Defense (DoD), which makes them 1 of 4 software companies with this level of clearance (alongside Oracle, Salesforce, and SAP). However, it has also been rumoured that Palantir may achieve IL-6 clearance, which has never been done before as it is the storage/processing of **classified information.**\n\nThis level of clearance should speak volumes to how safe and secure Palantir’s technology truly is and should provide ease of mind to companies that they are in business with.\n\n**Expansion into the Commercial Sector:**\n\nPalantir currently has a huge opportunity ahead of them as they continue to increase their presence in the commercial sector, partnering with some of the largest enterprises in the world. Palantir plans to provide these businesses with the software that they need to do their jobs as efficient as possible and sees large growth potential in this industry.\n\nPalantir has said that they are focusing on building partnerships with enterprises that are willing to undergo structural changes within the organization/operations. Palantir has a huge market ahead of themselves in the commercial sector, and their stock should do well on the news breaking of new partnerships between Palantir and commercial enterprises.\n\n*Government Contracts:*\n\nDo you remember what I said earlier about what happens once Palantir gets the ball rolling? If so, you will know where I am headed with this section.\n\nBetween 2008-2018 (10 years), Palantir was able to generate $51.9M in revenue from government contracts. However, in the 2 years following this they earned $179.9M in Government contracts (this can be found under the “US Government” section of their [SEC 10-K report](https://sec.report/Document/0001193125-21-060650/#tx65934_1)). Once Palantir was able to get the ball rolling with these agencies, Palantir was able to both expand and renew existing contracts to earn more revenue. I believe that the same thing will happen with Palantir’s commercial operations. Once they start to get a large number of big enterprises renewing their contracts for “bigger bucks”, I believe that Palantir will start to grow their revenues extremely quick and attract new clients “left, right, and center”.\n\nThese contract renewals are so important because essentially, they mean that Palantir met and/or exceeded expectations, and these companies now believe that Palantir is vital to their business/operations, so look out for news around renewals.\n\n*Business Model:*\n\nPalantir has developed a business model that focuses on acquiring contracts and expanding their services and has 3 main phases.\n\n1. **Acquire Customers:** Palantir has expanded their sales force largely over the past couple of years, and actively purse negotiations with companies that they can provide long-term value to. To acquire these companies, Palantir gives them a short demo to see how effective and user friendly their software is, Palantir provides this service for a loss. However, they are willing to incur these (proportionately) small losses to potentially acquire large contracts with these companies. This phase runs at a loss but helps Palantir set up clients for the next phase.\n2. **Expand:** Once Palantir has a potential customer on the hook, they move them along to the expand phase. Palantir installs their software in these enterprises and teaches them the ropes, of course this requires a large investment from Palantir to incorporate it. These customers often sign a short contract with Palantir for a cheap cost (Palantir takes a loss on this phase as well), however clients are able to truly unlock Palantir’s software during this phase and see what it has to offer. If they like their software, they will be moved along to the next phase (scale) which is Palantir’s bread and butter.\n3. **Scale:** These clients tend to sign longer-term deals with Palantir for their software after they have got a “good feel” for their software. The companies in this stage are also generally “hands-off” meaning that they can operate the software without much help. Companies tend to find the most value in this stage, and Palantir makes the best margins on this stage. In 2020, Palantir made $613.4M in this stage with a margin of 70%\n\n*Financial information:*\n\nAll of this information can be found in their [SEC 10-K filing.](https://sec.report/Document/0001193125-21-060650/#tx65934_1)\n\n· **Financial Performance (Good):** In 2020, Palantir increased their gross profit by 47.97% and increased their gross margin to 81% (from 71%), Palantir reported their first net income (excluding stock-based compensation) ever and increase their net revenues by 47.15%.\n\n· **Financial Performance (Bad):** In 2020, Palantir’s loss from operations increased by 103.61%, their stock-based compensation increased by 425.15%, their General and Admin expenses increased by 108.59%, and their net loss increased by 101.22%. Their biggest problem in 2020 was their large stock-based compensation, which will be addressed later.\n\n· **Convertible Preferred Stock:** In 2020, Palantir issued a total of 797,771,675 shares of common stock through conversion of their previous “convertible referred shares”. This one factor of dilution caused an estimated dilutionary effect of Palantir’s stock of 137.19%. This is a huge form of dilution, and I have never seen anything like this before, however I have an explanation for this so stay tuned for that.\n\n· **Repurchase of Common Stock:** In 2020, Palantir repurchased 808,201 shares back. This is a measly amount compared to the amount of dilution from preferred stock, however any buyback is good to see as an investor. This buyback caused an inflationary effect on existing shares of 0.14%, which is not much, but we will still take it.\n\n· **Stock Warrants:** In 2020, Palantir experienced an additional 7,631,329 shares on the market through the exercising of warrants. The exercising of these warrant had a dilutionary effect on Palantir’s stock of 1.31%.\n\n· **Common Stock (Net of Issuance Costs):** In 2020, Palantir unloaded 206,500,523 common shares onto the market from issuance of common stock net of issuance costs. I believe that this means that, Palantir had to fork out additional shares to cover the investment needed to take their shares public. I could very well be wrong on that, and if anyone can pitch in and explain this to me that would be great! Anyways, this caused a dilutionary effect of Palantir’s common stock of roughly 35.51%. This is a large portion of dilution, however it does not even factor in other factors of dilution which is worrying.\n\n· **Stock Options:** In 2020, Palantir added 120,617,527 common shares to their shares outstanding through the exercise of options. These options were exercised and thus converted into these common shares and had a dilutionary effect of 20.72%. Once again, this is a large amount of dilution and should be considered by investors.\n\n· **RSU’s:** In 2020, Palantir issued 82,429,575 shares through their vesting of “Restricted Stock Units” (RSU’s). This had a dilutionary effect on their stock of 14.18% (which is a lot of dilution).\n\n· **Modification to Stock Options:** In 2020, Palantir technically bought back 3,500,0000 shares through modifications to stock options (for the settlement of employee loans accounted for as modifications to stock options). Confusing, right? This technical buyback resulted in a share inflation of 0.6%.\n\n· **Total Share Dilution in 2020:** In 2020, Palantir experience an overall share dilution of 208.19%. This is the most dilution I have ever seen in a stock that I have analyzed, however there are some potential answers as to why there was so much dilution in 2020.\n\n*Explanation of Share Dilution:*\n\nOnce again, all of the below information can be found in Palantir’s [SEC 10-K filing](https://sec.report/Document/0001193125-21-060650/#tx65934_1).\n\nOn September 30th, 2020, Palantir completed their Direct Listing of their Class A common shares on the public markets on the NYSE. Part of this listing involved the redemption of all of Palantir’s convertible share into common shares. This was the largest single source of dilution in Palantir (137%). Additionally, this Direct Listing involved the exercise of al outstanding warrants, which resulted in dilution of 1.31%. Another part of their Direct Listing was the common stocks issued, net of issuance price to complete the direct listing, which had a dilutionary effect of 35.51%. Lastly, Palantir was forced to create new common shares that would hold the place of the unvested RSU’s, which cause a dilutionary effect of 14.18%.\n\nWithout these factors of dilution, Palantir would have only experienced an overall dilution of 20%. This means that due to the Direct listing, Palantir had to increase their shares outstanding by 188.19% to meet the requirements to be eligible for the listing.\n\n*Overall Thoughts on Dilution:*\n\nPalantir is a very weird stock in terms of their dilution, and I have not seen anything quite like this before. Their overall level of dilution is unprecedented and very worrying for investors. However, we know that these levels of dilution were inflated due to the requirements of undergoing a Direct Listing. However, how does Palantir dilution (excluding the effects caused by their Direct Listing compared to their dilution in previous years?\n\nFor starters, Palantir exhibited a 20% share dilution in 2020 when eluding the dilution caused by the Direct Listing. However, historically Palantir has experienced an average share dilution of 5.18% between 2017-2019. So even excluding the effects caused through the Direct Listing, Palantir still experienced a comparably high level of share dilution. However, 20% of dilution is significantly different than the 208.19% of dilution (which would be crazily high). This 20% is relatively normal for an undervalued growth stock, such as Palantir, so currently I would not be too worried. However, investors should keep up with their financial reports and look for their dilution in 2021, because ultimately that will tell us more about Palantir’s dilution after going public, than their past share dilution as a private company.\n\n*Competition:*\n\nIn order to undergo my comparable analyses (which will be discussed later on) I needed to select 4 companies, that I can compare to Palantir.\n\n[**$ZS – Zscaler Inc**](https://utradea.com/stocks/ZS)**:** ZScaler is a security as a service company that helps company adapt to cloud technologies and provides their cybersecurity services through the cloud. ZScaler provides their services to both commercial enterprises and governments, similar to that of Palantir. Furthermore, ZScaler offers their service primarily in the USA, but also has smaller international operations (again like Palantir).\n\n[**$SNOW – Snowflake Inc**](https://utradea.com/stocks/SNOW)**:** Snowflake (like Palantir) is a software and technology company that primarily focuses on data. Snowflake provides data cloud services such as data engineering, data science, data applications, data sharing, and data warehouse. This is very similar to the applications and functions available on Palantir, however Palantir offers other functions that differentiate themselves. Snowflake also provides services for both commercial enterprises and government organizations, similar to that of Palantir.\n\n[**$SPLK – Splunk Inc**](https://utradea.com/stocks/SPLK)**:** Splunk provide software platforms that deliver insights derived from their clients’ data in the USA and internationally. Splunk offers their Ecosystem solutions that consist of data inputs, workflows, reports, dashboards, data visualizations, actions, and methods, and help their clients/customers to make the best out of their data. All of this sounds eerily familiar to the description of Palantir, making it one of the closer competitors. Splunk also offers their services to the public sector as well as the government, making their business model resemble that of Palantir so much more.\n\n[**$TYL – Tyler technologies Inc**](https://utradea.com/stocks/TYL)**:** Tyler technologies is probably the company in this list that least resembles that of Palantir, this is because they provide management solutions, accounting systems, billing systems and other solutions geared toward the public sector. Tyler technologies works primarily with governments of all types (Federal, State, and Municipal), and education institutions. However, the one thing that Tyler has that makes them comparable to Palantir is their data and insight solutions. Their data insights software enables collaboration, displays data visualizations/measurements, and generates insights for their human operators to act on.\n\n*Q1 2021 Updates:*\n\nAll of the below information can be found in [Palantir’s Q1 Investor Presentation](https://investors.palantir.com/files/Palantir%20Q1%202021%20Business%20Update.pdf).\n\nRecently, on May 11th, 2021, Palantir released their Q1 earnings report. When looking at Palantir’s financial performance I did not take this into account, which means that this section will be packed with new information that will help us to understand Palantir’s trajectory even more.\n\nFirst and foremost, this quarter was the first quarter in which Palantir has reported positive earnings. This is a big milestone for Palantir as a public company, and it helps to gets investors excited about the potentially profitable future of Palantir. In Q1, Palantir reported a free cash flow of $151M (was -$290M in Q1 2020) with a 44% adjusted FCF margin, they grew revenues by 49% YoY ($341M), and they grew billings by 248% YoY ($362M) which means that Palantir is acquiring new customers and negotiating higher contracts. These financials are great and show a promising future ahead for Palantir, which should excite their investors.\n\nFurthermore, during this quarter they also disclosed their investment in a SPAC. This SPAC is [$QELL – Qell Acquisition Corp.](https://utradea.com/stocks/QELL) which merging with Lilium. Lilium is an eVTOL transportation company, with this investment they also came to a deal with Lilium to use Foundry for design, engineering, testing, production, quality, logistics, and operations. A while back I looked at another eVTOL SPAC Archer ([$ACIC – Atlas Crest Investment Corp.](https://utradea.com/stocks/ACIC)), which has great upside and has a similar business model to Lilium, so if you want to read that to be more informed about Liliums potential performance, [click here.](https://utradea.com/positions/Take_a_SHOT_at_Archers_SPAC_ACIC)\n\nIn Q1, Palantir was also awarded with a [5-year $90M contract](https://www.businesswire.com/news/home/20210405005238/en/Palantir-Selected-by-the-National-Nuclear-Security-Administration-for-5-year-89.9M-Contract-for-SAFER-Project) from the National Nuclear Security Administration (NNSA), in which Palantir will provide the operational platform for their SAFER (Safety Analytics, Forecasting, and Evaluation Reporting) project. This is big news as this is one of Palantir’s bigger contracts, and it shows the level of confidence of the NNSA in Palantir’s software and their cross-enterprise data integration capabilities. On the topic of Palantir and Government Organizations, the DoD used Palantir’s software in all 11 of their Combatant Commands for globally integrated intelligence. This high level of usage from the DoD definitely means that Palantir is doing something right, and if the DoD likes it so much, then it should be more than enough for commercial enterprises.\n\nLastly, in Q1, Palantir won 15 contracts worth over $5M, and 6 contracts worth over $10M with an average duration of 3.7 years (4.6 for commercial customers). This is fantastic for the company as they gained an additional 11 new commercial customers from this, and I will be keeping up to date with these contracts and others as they come up for renewal/negotiations. Additionally, Palantir was able to grow their gross margin to 83% (from 75% Q1 2020), and their contribution margin to 60% (from 41% in Q1 2020). This shows that Palantir business partners are maturing into their 3rd phase, the scale phase, which enables Palantir to grow their margins.\n\n***$PLTR – Palantir Investment Valuation:***\n\n*Comparable Analyses:*\n\nI decided to undergo 2 different comparable analyses in order to get a variety of valuations (or opinions if you will). Preferably, I would like both of these results to be consistent in terms of their fair value estimate, however, if they are not consistent, I will take the average result. I was only able to find 2 multiples/ratios that I could actually analyze due to the nature of these businesses and their lack of positive financial ratios/multiples.\n\n*EV/Revenue:*\n\nThis is a very common multiple among companies that are not profitable in their operations yet, like Palantir and some of these other comparable companies. By comparing Palantir’s EV/Revenue multiple to that of their competitors (listed above on the “competitors” section of this report), I found that Palantir has a fair value of $32.85/share, which implies an upside to this investment of 23.31%. This implies that given Palantir’s current price, they are undervalued, and the upside is very reasonable, however, I decided to undergo the next comparable to see if this result maintains.\n\n*P/B:*\n\nBy comparing Palantir’s P/B ratio to that of their competitors, I found that Palantir has a fair value of $24.87/share, which implies that there is a downside risk of 6.64% to such an investment. As you have probably noticed, these results are not consistent, therefore I have decided to take the average result to get one, final price target.\n\n*Average Comparable:*\n\nBy taking the average result from the 2 comparable analyses underwent, I found that Palantir has a fair value of $28.86/share, which implies an overall upside of 8.36% to this investment. This also implies that Palantir, is in fact an undervalued growth stock, that has the potential to be one of the best undervalued stocks on the market.\n\n***My Plan for Investing into Palantir:***\n\nMy plan for this investment is a little different from usual.\n\nI see anything between $24.87/share (Fair Value of P/B ratio) and $28.86/share (average comparable) as a good chance to buy Palantir at (or below) its fair value. This helps to limit our downside risk of this investment.\n\nHowever, I think the best way to play an investment in Palantir is over the long-run 3+ years. I would attempt to buy in at the above prices and hold for these 3+ years. During this time, I would re-evaluate my investment with every new financial report and piece of news to decide if it is still worth holding.\n\n***Potential Risks to Palantir’s Stock - $PLTR:***\n\n· **Dilution:** Over the past year Palantir has experienced a lot of dilution, however, we have already attributed a great deal of this dilution to their Direct Listing. However, the 20% of dilution that was not derived from the direct listing is still quite high. As investors, we should keep an eye on their future levels of dilution to recognize any patterns/increases that we should be weary of. If these levels of dilution persist, potential investors may be scares off and current investor might sell their positions, which will hurt the share price.\n\n· **Financial Performance:** This year’s financial performance was not one to be overly happy about. Although they were able to increase some pretty important aspects of their balance sheet, Palantir was still yet to make a profit, and increased their net losses by over 100%. If this poor financial performance continues, and they keep digging themselves into a bigger and bigger hole, investors will run away from this stock and never look back. However, the Q1 financial performance gives investors hope for a more profitable future, which will be discussed later.\n\n· **Bad Press:** Historically, Palantir has not been looked at through a positive lens by many people investors and non-investors alike. Their first public backlash came through their involvement in deporting immigrants through [Palantir’s partnership with ICE](https://www.bbc.com/news/business-54348456). Palantir quicky spoke out against this backlash by saying ICE took advantage of their software without proper oversight, and that they are looking into the issues, furthermore they have since declined some potential partnerships with other border agencies to avoid further backlash. There have also been numerous smaller controversies and protests that have damaged Palantir’s reputation, and if there are more large controversies Palantir’s stock could get hurt as a result of it.\n\n***Potential Catalysts that can Help Palantir’s Stock Price:***\n\n· **Share Buybacks:** Over the past year, Palantir has bought back (both directly and indirectly, in a sense) over 4,300,000 of their common shares. This is good to see as an investor, especially this early in the company (and not too long after their Direct Listing). This gives me hope that Palantir will continue to repurchase more shares in the future. This will be good for the share price as it will increase the value of existing shares, and it will be especially good for the stock price if they continue to buyback more shares each year.\n\n· **Financial Performance:** Palantir’s 2020 financial report was not favourable (as discussed previously), however there were definitely some good to take out of it. Palantir increased their revenue, gross profit, and margins by a hefty amount, which is good to see as an investor, however, there was bad aspects of this report as well that made the report unfavourable. However, their newly released Q1 2021 financial report has so much more to offer in terms of good aspects of a financial report.\n\n· **Positive Press:** As previously mentioned, Palantir has had their fair share of bad press that has had a small effect on their share price. However, recently Palantir has been getting better press through helping organizations like the NIH and NHS in their fight against COVID-19, and their vaccine distribution efforts. Partnerships like this help to display the positive impacts that can be derived from Palantir’s technology. Future events where Palantir can use their software for a good cause can help to combat the negative stigma around Palantir and attract more people to invest in their company. This should help their share price in the short term after these articles are released.\n\n· **Success Stories:** Since Palantir have gone public, they have had a few success stories come out, I mentioned some of these stories throughout the article. These success stories show how impactful Palantir’s software can be and can show companies that they can increase revenues, production etc. just by using Palantir’s software. Any future stories like this that come out, highlighting the benefits of Palantir can help the stock soar, and potential clients to reach out and start business/inquiries with Palantir.\n\n· **Renewing Contracts:** I have mentioned that the renewal of contracts can help Palantir’s share price a couple times throughout this article but why is this the case? This is because these companies that are renewing have already been through Palantir’s 3 stage business model and have experienced their software firsthand for numerous years. After their time with Palantir’s software expires they decide to renew the contract. This is good because it shows that Palantir’s software was effective enough to their business in the time they had it that it is worth these $5-15M+ contract renewals. Furthermore, these companies that are renewing already have underwent Palantir’s installation, and these clients will provide Palantir with the highest margins, which will reflect well on Palantir’s future financial reports.\n\n· **New Partnerships/Contracts (and the expansion of commercial enterprise segment):** Every time that Palantir, or its partners release news that they have entered into a contract/agreement, this will help Palantir’s stock. This is because Palantir needs to keep expanding their software into new companies in order to meet their expected growth projections. Furthermore, as more commercial enterprises try Palantir’s software (and hopefully enjoy it), the more willing other companies might be to give Palantir a shot. I see their biggest potential for growth and to become a large company in their expansion of their commercial enterprise segment through Foundry. Every time Palantir gets more new clients on board it is fantastic and shows the feasibility of this segment, and as more contracts role in, more enterprises will take an interest. Furthermore, when Palantir signs these enterprises to a contract, it will help to increase their revenues, which will show up on their financial reports and hopefully help the, to beat estimates.\n\n*This analysis took a long time, and is one of the most comprehensive that I have seen, so I would greatly appreciate if you followed me* [*here*](https://utradea.com/member-portfolio/BeatingTheVTI?utm_source=R&amp;utm_medium=B&amp;utm_campaign=PLTR)*, and commented on my original post!*",
        "subreddit": "wallstreetbets",
        "title": "The best Palantir analysis available!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obn2z7/the_best_palantir_analysis_available/",
        "created": 1625178786.0
    }
]