[
    {
        "author": "sultanmirza007",
        "created_utc": 1624563142,
        "id": "o786ml",
        "num_comments": 241,
        "num_crossposts": 0,
        "selftext": "# PAYSAFE - PAYMENT SOLUTIONS TO POWER UP YOUR TENDIES\n\n&amp;#x200B;\n\n***What is Paysafe?***\n\n**Paysafe Group** previously known as **Optimal Payments PLC** is a multinational online payments company. The company offers services both under the *Paysafe* brand and subsidiary brands that have become part of the group through several mergers and acquisitions, most notably Neteller, Skrill and paysafecard. **Paysafe** was sold to the Blackstone Group &amp; CVC Partner Capitals making it the **largest private equity** backed takeover of a London listed company since 2007-2008 crisis.\n\nIn December 2020, the company announced that it had entered into a definitive agreement to merge with **SPAC** company known as **Foley Trasimene Acquisition Corp**, in a **US$9 billion transaction.**\n\n&amp;#x200B;\n\n***What products do they offer and what do they sell?***\n\nThe company helps businesses and consumers to connect and transact seamlessly through capabilities in payment processing, digital wallet, and other online money transfer solutions.\n\n* Cash online - Accepts cash payments online\n* Direct Debit - Accepts instant, secured bank payments direct from consumers.\n* Digital Wallets - Accepts payment from digital wallets\n* Integrated Payments - They customise and integrate payments for businesses\n* Online Payments - They provide secure &amp; simplified e-commerce solutions\n\n&amp;#x200B;\n\n**Hedge-funds are extremely bullish on $PSFE**\n\nAs we all know, hedge funds deliver the best returns compared to S&amp;P500. Many hedge fund companies showed tremendous growth and performed excellent even during pandemic and post pandemic.\n\nBased on the insidermonkey article, the number of long hedge fund bets on ***Paysafe*** rose by 41, however, please note that PSFE isn't included in the 30 most popular stocks amongst hedgefunds . The graph below displays the number of hedge funds with bullish position in PSFE over the last 23 quarters.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h9vxh3ydm9771.png?width=1488&amp;format=png&amp;auto=webp&amp;s=a929586f1ae33c1d374f11185f8010296e0551ea\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNow let's have a look at the top institutional owners for ***Paysafe.*** As you can see from the image below, majority of these companies are hedge funds &amp; private equity firms.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1bu07noem9771.png?width=2014&amp;format=png&amp;auto=webp&amp;s=4e940758cc3e33ce9f0cd913aed0f3e1acb38c51\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Price targets as per Wall Street Analysts -**\n\n7 Wall Street analysts have issued ratings and price targets for Paysafe in the last 12 months. Their average **twelve-month price target is $17.29**, predicting that the stock has a possible **upside of 54.75%**. The high price target for **PSFE is $19.00** and the **low price target for PSFE is $15.00**.\n\nEven if the company is able to hit a price target of 15$ in the coming weeks, that's a possible of upside of at least **35.13%** based on the current stock price at the time of this DD **($11.10).**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/i001qrxfm9771.png?width=2618&amp;format=png&amp;auto=webp&amp;s=eebb759ff8a4ef7a5021691f9ccd2170e720aca4\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**If company is so good, why did it fall 23% in the last 6 months?**\n\nAs all of you may know, the SPAC's were hot and trending back in early 2021 and most of the companies were overpriced. If you look at the price history of all the SPAC's post merger, then you'll notice that most of them fell quite significantly. ***Paysafe*** was one of the top companies that went public through SPAC.\n\n&amp;#x200B;\n\n**Why paysafe is a good stock to invests in?**\n\n&amp;#x200B;\n\n* ***Paysafe*** has been delivering what many SPAC's have failed to deliver i.e **Revenues &amp; Profits.** Despite the numbers being good after Q1, the stock still fell by 21%. Paysafe got hit by \"Post merger SPAC effect'.\n* The drop in price due to \"Post Merger SPAC effect\" is a great opportunity for investors to buy the stock and hold it for long term.\n* Paysafe has an amazing opportunity to establish it's monopoly in the iGaming space. Their biggest competitors PayPal &amp; Square are staying out of iGaming space and focusing more on Fintech space. Paysafe currently has agreements with few big companies such as DraftKings, Roblox, Twitch, Caesar's entertainment and many more.\n* When it comes to iGaming space, the risks are relatively small because the disputes are very unlikely. People depositing money into their roblox accounts or draft kings are not entitled to refunds and same applies to twitch donations.\n* As per nasdaq.com, the company is expected to **exceed $103 billion in transactions** this year and the company forecasts that iGaming in the United States will grow at a compound annual growth rate (CAGR) of **52% through 2025.**\n* The company’s products are currently not as widely accepted as PayPal or Square, however, they plan on expanding in the coming years.\n* As per nasdaq.com, The U.S. online gambling industry is expected to grow at a CAGR of 15.4% between last year and fiscal year 2025 and ***Paysafe*** has relationship with almost all top online gambling operators in the U.S.\n* The company has expanded partnership with **Coinbase** and the company’s payment solution is in about 27  sites and exchanges. As investing and trading activity grows in the near future, Paysafe is well positioned to benefit.\n* If you look at the Q1, the fundamentals were quite strong, company reported revenue of $377.4 million, which was higher by 5% on a year-on-year basis. The company's adjusted EBITDA was $113.2 million, which implies an EBITDA margin of 30%.\n* The company absolutely destroyed the expectations when it comes to e-cash solutions segment, adjusted EBITDA for that segment was 110% higher and reported $48.1 million. The company reported revenue growth of 63% \\~ $112.9 million.\n* As per nasdaq.com, the e-cash segment has an EBITDA margin of 42.6% as compared to the company level EBITDA margin of 30%. With strong growth in the e-cash segment, it’s likely that EBITDA margin will expand in the coming quarters. As a matter of fact, Paysafe has guided for an adjusted EBITDA margin of 32% for FY2021\n* Between FY2020 and FY2023, the company is targeting annual growth revenue of about \\~10%. Ecash segment is the margin driver for this company and the guidance seems realistic because of potential growth in the U.S online gambling sector.\n* If there is a synergy, Paysafe could also merge with other online payment companies in order to grow. The company is currently sitting at $274 million in cash and $225 million in un-drawn credit facility.\n* According to nasdaq.com, Paysafe reported operating cash flow of $48.7 million in Q1. This would imply an annualized OCF of $195 million. With likely EBITDA margin expansion in the coming years, the company is positioned for healthy cash flow growth.\n\n&amp;#x200B;\n\n**What is the future of iGaming and online transactions?**\n\nThere is no brainer in this question. The iGaming space and etransactions will keep exceeding in the near future. Many countries currently use cash for transactions, but as technology advances, third world countries are expected to go cashless and follow digital payments. As per the article from Juniper Research Ltd, the digital world is projected to exceed $10 Trillion in 2025. This is an 83% increase from 2020. The research also found that contactless and e-commerce payments will increase to 50% of total wallet spend in 2025 from less than 36% in 2020. More than 34% of mobile handsets are also seen to use contactless payments in 2025, up from 11% in 2020. Even a 2 year old baby would know that Paysafe is expected to benefit from this growth.\n\n&amp;#x200B;\n\nStock price during after the merger,\n\nAs you can see from the graph below, the Paysafe stock rocketed right after the merger announcement and shot up to as high as 20$/piece. What happened next should not shock the world because most of the SPAC's fell off post merger. BUT what makes this SPAC unique is the fact that they've been able to pull off revenues and profits and were able to provide better guidance for the future.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3mhhphihm9771.png?width=1246&amp;format=png&amp;auto=webp&amp;s=4cf8bdfae532f25cde8d25d6d0451e619677c434\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Now, let's talk about Financials of Q1\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jkld8lqhm9771.png?width=2192&amp;format=png&amp;auto=webp&amp;s=d7f2180d3bf36f1910b1c8444c294e0ec7326803\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTotal revenue for the first quarter of 2021 was $377.4 million, an increase of 5%, compared to $359.7 million in the prior year. However, gross profit was a bit low compared to 2020.\n\nNet loss for the first quarter was $49.1 million, compared to $51.1 million, in the prior year. The company mentioned in the presentation that Net loss included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\n\nAdjusted EBITDA for the first quarter was $113.2 million, compared to $112.8 million in the prior year. Adjusted EBITDA margin decreased approximately 140 basis points to 30.0%, but they expect this basis point to go up in the near future.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Now let's have a look at the segment growth\n\nLike I mentioned earlier, the company absolutely destroyed their growth in ecash solutions and reported an increase in revenue by 63%.\n\n***Integrated Processing -*** Revenue for the first quarter was $176.9 million, a decrease of 5%, compared to $186.2 million in the prior year\n\n***Digital Wallet -*** Revenue for the first quarter was $94.9 million, a decrease of 13%, compared to $108.5 million in the prior year.\n\n***eCash Solutions -*** Revenue for the first quarter was $112.9 million, an increase of 63%, compared to $69.1 million in the prior year\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5j0c4tbim9771.png?width=2208&amp;format=png&amp;auto=webp&amp;s=dbd8d6574749f955bc4078467f7c02e4364d92ec\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# HIGHER 2021 guidance\n\nThe company reported higher 2021 guidance and are expected to achieve their goals due to increase number of online transactions and growth in iGaming space.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/t4a1jovim9771.png?width=1890&amp;format=png&amp;auto=webp&amp;s=92278c6b638c9c6db841d7caf993cc4d44cab81a\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**TLDR -**\n\n**The company is expected to achieve their 2021 guidance.**\n\n**No competition for Paysafe in iGaming space.**\n\n**The stock fell down in the past few months due to \"Post Merger SPAC fatigue\"**\n\n**One of the few SPAC's who actually brings in Revenue &amp; Profits**\n\n**Currently close to 52 week low and a nice opportunity to grab at this current price**\n\n&amp;#x200B;\n\n**Positions Screenshot**\n\n**180 share at 11.14$ each**\n\n**45x calls with strike price 12.5$ expiring 7/16.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hbnife8om9771.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=e1a4edf01210e9e443689e10687c2466f8b3fb99",
        "subreddit": "wallstreetbets",
        "title": "$PSFE Power up your wallet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o786ml/psfe_power_up_your_wallet/",
        "created": 1624591942.0
    },
    {
        "author": "GrowStrong1507",
        "created_utc": 1622586806,
        "id": "nq6jwt",
        "num_comments": 174,
        "num_crossposts": 0,
        "selftext": "June's SPAC deal votes:\nJun 02 | $ 14.51 | JWS - Jaws Acquisition Corp --&gt; Cano Health, LLC\n\nJun 03 | $ 10.71 | TSIA - TS Innovation Acquisitions Corp --&gt; Latch, Inc.\n\nJun 03 | $ 13.23 | JIH - Juniper Industrial Holdings, Inc. --&gt; Janus International Group, LLC\n\nJun 04 | $ 10.08 | GIX - GigCapital2, Inc. --&gt; Cloudbreak Health, LLC\n\nJun 04 | $ 12.85 | DFHT - Deerfield Healthcare Technology Acquisitions Corp. --&gt; CareMax Medical Group, LLC\n\nJun 07 | $ 13.13 | FSRV - FinServ Acquisition Corp --&gt; Katapult Inc.\n\nJun 08 | $ 10.36 | ARYA - Arya Sciences Acquisition Corp III --&gt; Nautilus Biotechnology, Inc.\n\nJun 09 | $ 10.26 | CAPA - HighCape Capital Acquisition Corp --&gt; Quantum-Si\n\nJun 09 | $ 10.10 | THBR - Thunder Bridge Acquisition II, Ltd --&gt; Indie Semiconductor\n\nJun 10 | $ 10.08 | CCX - Churchill Capital Corp II --&gt; Software Luxembourg Holding S.A\n\nJun 10 | $ 9.99 | VGAC - VG Acquisition Corp --&gt; 23andMe, Inc.\n\nJun 10 | $ 16.30 | SSPK - Silver Spike Acquisition Corp. --&gt; WM Holding Company, LLC\n\nJun 11 | $ 18.15 | ACTC - ArcLight Clean Transition Corp --&gt; Proterra Inc\n\nJun 15 | $ 9.98 | FAII - Fortress Value Acquisition Corp. II --&gt; ATI Physical Therapy\n\nJun 16 | $ 10.12 | CRSA - Crescent Acquisition Corp --&gt; LiveVox TopCo, LLC\n\nJun 17 | $ 9.99 | ACAC - Acies Acquisition Corp --&gt; PlayStudios, Inc.\n\nJun 22 | $ 12.66 | FTIV - FinTech Acquisition Corp. IV --&gt; Perella Weinberg Partners LLC\n\nJun 22 | $ 10.33 | TBA - Thoma Bravo Advantage --&gt; ironSource\n\nJun 23 | $ 9.96 | AACQ - Artius Acquisition Inc. --&gt; Origin Materials\n\nJun 24 | $ 10.04 | FRX - Forest Road Acquisition Corp --&gt; Beachbody, LLC\n\nJun 29 | $ 11.08 | CLII - Climate Change Crisis Real Impact I Acquisition Corp --&gt; EVgo\n\nIt's all about FRX and ACTC for me!",
        "subreddit": "SPACs",
        "title": "June is a big month for De-SPACs. Which ones will fly and which ones will 💩 the bed",
        "url": "https://www.reddit.com/r/SPACs/comments/nq6jwt/june_is_a_big_month_for_despacs_which_ones_will/",
        "created": 1622615606.0
    },
    {
        "author": "BarmeIo-Xanthony",
        "created_utc": 1623874124,
        "id": "o1e5l1",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "tl;dr: Katapult Holdings (KPLT) is one of the best former SPACs in the market today. It has a dirt cheap valuation vs. its peers, and the growth runway is massive. Long shares.\n\nKatapult Holdings (KPLT) recently went public through a reverse merger with the SPAC Finserv Acquisition (FSRV). Katapult is a leading \"buy now, pay later\" (BNPL) player that provides financing options for non-prime customers. The newly merged company had its first quarterly earnings this week, and execution was solid. Katapult is still caught in a pool of negative SPAC sentiment, but it's no longer a SPAC. KPLT is profitable, growing quickly, and trading at a huge discount to other players in this field. I believe Katapult is a $25 stock trading for $11.30. Keep reading if you want to know why.\n\n## What Is Katapult?\n\nKatapult provides BNPL options for non-prime Ecommerce customers. Katapult is the only pure-play financing platform dedicated to Ecommerce, as shown below:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mgow6tippo571.png?width=640&amp;format=png&amp;auto=webp&amp;s=ec0894080a04d8772cc96f083047c545ca74709f\n\n*Source: Initial Investor Presentation*\n\nAccording to the Federal Reserve Bank of New York, 38% of US consumers are considered nonprime, making it difficult for these consumers to access financing options. Additionally, 67% of consumers with a FICO score below 700 need a BNPL option for large purchases. Katapult provides this solution for online customers. Katapult's platform integrates seamlessly to merchant sites, so customers can choose the financing option as they check out. \n\nConsumers are given three payment options through Katapult:\n\n* **First 90 Days**\n   * Customers only pay the cash price + a 5% fee.\n* **After 90 Days**\n   * Customers can complete the purchase at a significant discount to the full lease-to-own cost.\n* **Full Lease Term**\n   * Payment is \\~2x the lease origination amount over the life of the lease.\n\nKatapult is partnered with merchants such as Wayfair, Lenovo, Purple, and Motorola. The company also has partner integrations with Ecommerce platforms like Shopify, BigCommerce, and OpenCart. Katapult gives online platforms access to larger customer bases and higher repeat purchase rates (45%). \n\nKatapult also uses a \"waterfall\" method to gain customers that failed prime lending applications. When consumers fail to get financing from prime lenders like Affirm, they are passed on to Katapult. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/e1vkntqrpo571.png?width=640&amp;format=png&amp;auto=webp&amp;s=84b10776e62145d0ba7ec86ae1c99ec2e5c83a20\n\n*Source: Investor Presentation*\n\nAs you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications.\n\nKatapult's risk model reviews over 100 attributes, including lease history, prior payment behavior, and behavioral biometrics, to approve or deny applicants in under five seconds. The company has a sub-3% fraud rate across its portfolio, and it recovers 80- 90% of lease costs of charge offs.\n\nKatapult has also gotten more efficient as its platform has grown. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/0zqux65tpo571.png?width=640&amp;format=png&amp;auto=webp&amp;s=2517c17311104765f4f5e6d3e115ccd0b0b23c5f\n\n*Source: Investor Presentation*\n\nIndexed return on leases have increased each year as Katapult's customer base has expanded.\n\n## Q1 Performance\n\nAs mentioned earlier, Katapult went public through a SPAC. SPACs are notorious for providing and falling short of aggressive revenue projections. Here are Katapult's projections from December.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gwicqjfupo571.png?width=640&amp;format=png&amp;auto=webp&amp;s=11af0770fa0cd0c8caca333a9aa775b04a19bea3\n\n*Source: Investor Presentation*\n\nNow let's see how the company performed. Katapult released Q1 earnings yesterday. The company did $82M in revenue, up 88% year over year. Net income was $8.1M, or a 120% increase from Q1 last year. Adjusted EBITDA was $14.7M, good for a 122% increase over last year too.\n\nHow about forward guidance? \n\n* Gross Originations: $375-$425 million\n* Revenue: $425-$475 million\n* Adjusted EBITDA: $50-$60 million\n\nWhile the EBITDA target dropped slightly, revenue and originations are in line with December's projections.\n\n### Relationship with Wayfair\n\nOne metric that stood out to me was the acceleration of originations from non-Wayfair merchants. 58% of Katapult's revenue came from Wayfair in 2020. However, in Q1 2021, Non-Wayfair originations were up 87.4%. This is compared to a 66% increase in Q4 2020 and 46.1% for FY 2020. Meanwhile, Wayfair originations were up 57.7%. Recent execution suggests that Katapult is making great strides to diversify its revenue streams.\n\nWhile Wayfair is still the company's largest source of income, Katapult CEO Orlando Zayas is not concerned. In a recent interview, he said this about their parternship with Wayfair:\n\n\"*I’m not worried about it because if you’re going to have a partner to have high concentration right now, Wayfair is a great partner to have. So we’re really thrilled with their relationship. And the relationship is pretty deep too. We’re actually in the process of doing a direct integration with them so that, you know, the tentacles, if you will, within the company are a lot tighter, and then we have a two year agreement with them. \\[….\\] So, you know, am I worried about it? No, because it’s a great retailer. And I think our relationship is very strong, but, you know, I would like to minimize it and have, you know, five or six Wayfairs and a bunch of other smaller ones.*\"\n\nWith Katapult hinting at a deeper partnership with the furniture retailer, and the company showing accelerated growth in its non-Wayfair base, I am not too concerned with the heavy revenue concentration.\n\n## Valuation Gap\n\nValuation is the driving factor in my Katapult bull thesis. The stock is dirt cheap. While several SPACs have priced deals at sky-high valuations, FSRV took KPLT public at a $1B valuation with $450M in 2021 revenue. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/tdo6f56wpo571.png?width=640&amp;format=png&amp;auto=webp&amp;s=e3caf59027610ec14f7399f15a5c11377dedc2e0\n\n*Source: Investor Presentation*\n\nThe graphic above comes from the December investor presentation. 14x EBITDA for a company growing sales, net income, and EBITDA at \\~100% for the last three years is great value by itself. When you compare this to other companies in the sector, Katapult looks criminally undervalued. \n\nLet's look at the valuation gap now.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rumeltjxpo571.png?width=640&amp;format=png&amp;auto=webp&amp;s=23caf2299e138627232893b5dda1b33d68dc0f62\n\nAt Tuesday's $11.37 price, Katapult was trading at 2.7x sales and 22.3x EBITDA. That's less than 1/3 of PayPal's (PYPL) revenue multiple and 1/2 of Paypal's EBITDA multiple, despite growing revenue 3x faster. When compared to Affirm (AFRM), a more direct competitor, the valuation gap is even larger.\n\n22.4x revenue for an unprofitable company growing at 40%, vs. 2.7x revenue for a profitable company growing at 65%. If Katapult went public through a traditional IPO, it would be worth over $2B right now. Because it used a SPAC, sentiment around the stock has been poor.\n\n## Growth Prospects\n\nA study from Juniper Research suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. 55% of Americans used a BNPL option as of March 2021, vs. just 37% in July 2020. There will be room for a lot of winners in this market, and Katapult will be one of them.\n\nKatapult is forecasting over $1B in revenue by 2023, and the company could beat this number if it keeps aggressively expanding to include new merchants. Katapult added 26 new retail partners in Q1 alone. Additionally, Katapult will benefit from the growth of its current partners like Wayfair.\n\n## Risks\n\nLike any investment, Katapult has its fair share of risks. The primary risk factors are:\n\n* Customer concentration\n* Credit risk from nonprime consumers\n* Competitors entering the nonprime market\n\nWhile Wayfair is still the company's largest customer, Katapult has been growing its non-Wayfair revenue base at an accelerating rate. Management assured investors that Wayfair would be a partner for a long time, so I don't foresee this risk causing any issues with business in the short term. Katapult has also been able to post consistent profits while dealing with nonprime customers, and its risk model has proven to be more accurate as the customer base expands. Finally, I don't see Affirm or another competitor taking market share from Katapult. KPLT has a multi-year head start in this market niche, and it has been able to scale its operations profitably. While other companies could enter this sector in the future, the total addressable market is large enough to accommodate multiple players. \n\n## Conclusion\n\nKatapult is a criminally undervalued stock given its growth rate and competitors' valuations, and I think it should be trading around $25 per share. As we move further away from the SPAC merger, Katapult will trade on its own merit, and I think the stock will appreciate accordingly. Assuming Katapult continues to scale its revenue and expand its customer base, I think the stock has a massive growth runway. I'm long shares, and I plan to hold them for a while.",
        "subreddit": "SPACs",
        "title": "$KPLT Is Dirt Cheap after DeSPAC and Recent Earnings. Read my DD Below",
        "url": "https://www.reddit.com/r/SPACs/comments/o1e5l1/kplt_is_dirt_cheap_after_despac_and_recent/",
        "created": 1623902924.0
    },
    {
        "author": "SelfAware_Chair",
        "created_utc": 1624481838,
        "id": "o6lttg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\n**Why KPLT is undervalued and overlooked?**\n\nKatapult Holdings (KPLT) is a financing platform that focuses on non-prime, online customers. KPLT is the leading “buy now, pay later” service with dirt cheap evaluation and potential to grow. KPLT is very profitable, has quick growth potential, and is trading for much less than its peers.\n\n**Why will KPLT grow?**\n\nThe Federal Reserve Bank of New York states that 38% of US consumers are non-prime. That’s a huge market Katapult to grow off of. With Katapult being partnered with merchants like Wayfair, Motorola, Purple, Nectar, and Lenovo, Katapult already has their foot in the door to sell to non-prime consumers.\n\nWhen a consumer fails a prime lending application from companies like Affirm or PayPal, they are passed on to Katapult. Katapult offers them different kinds of payment options depending on what they can afford.\n\n*Katapult is the only nonprime consumer POS lease financing platform focused on e-commerce.*\n\nCurrently, Katapult is the only major non-prime financing platform that is focused primarily online. With Katapult integrated into merchant sites, having very little competition, and open to a large market, it has lots of growth potential.\n\n**KPLT financials**\n\nKatapult approves around 60% of consumers who failed prime lender applications. There is higher risk when dealing with non-prime customers. Fortunately, the company has less than a 3% fraud rate and recovers around 90% of lease costs and charge-offs.\n\n**Earnings**\n\nIn 2019, KPLT earned $92M in revenue. In 2020 they had $250M in revenue. Analysts project more gains in the upcoming years:\n\n\\-2021: $455M\n\n\\-2022: $799M\n\n\\-2023: $1,133M\n\nKPLT earnings seem underwhelming for 2019, but we see lots of growth in 2020 and good projected growth for the upcoming years.\n\nAnother good factor contributing to KPLT growth is the indexed return on leases. In 2019, Katapult lease return improved from 28% to 35%. In 2020, it rose to 40%. Katapult’s earnings will keep growing due to its increased return on leases. The more they squeeze out of their leases, is the more profits and income they’ll net.\n\n**Growth**\n\n“Buy now, Pay later” transactions are gaining much more popularity. Juniper Research suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. More than 50% of Americans use BNPL transactions as of March 2021. The BNPL market is growing at a rapid rate. With little competition among non-prime financing platforms, Katapult will skyrocket.\n\nKPLT is expecting $1B in revenue by 2023, and is aggressively expanding its retail partners. KPLT added 26 new retail partners in Q1 and will keep growing its market.\n\n**Conclusion**\n\nKPLT is very, very undervalued at a little over $10. Its projected earnings are growing at a rapid rate. With KPLT greatly increasing the amount of retail partners and with the growing BNPL market, Katapult is a great investment that will have lots of return.\n\nI think KPLT should be trading at around $20 or more. Don’t take my word on it, I’m not a financial advisor and you should definitely do some of your own DD. I hope this can bring some awareness to a criminally undervalued stock that hold lots of short and long term profits.",
        "subreddit": "stocks",
        "title": "KPLT Undervalued - Big Potential Growth (DD)",
        "url": "https://www.reddit.com/r/stocks/comments/o6lttg/kplt_undervalued_big_potential_growth_dd/",
        "created": 1624510638.0
    },
    {
        "author": "sultanmirza007",
        "created_utc": 1624561850,
        "id": "o77r2c",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "# PAYSAFE - PAYMENT SOLUTIONS TO POWER UP YOUR WALLET\n\n&amp;#x200B;\n\n***What is Paysafe?***\n\n**Paysafe Group** previously known as **Optimal Payments PLC** is a multinational online payments company. The company offers services both under the *Paysafe* brand and subsidiary brands that have become part of the group through several mergers and acquisitions, most notably Neteller, Skrill and paysafecard. **Paysafe** was sold to the Blackstone Group &amp; CVC Partner Capitals making it the **largest private equity** backed takeover of a London listed company since 2007-2008 crisis.\n\nIn December 2020, the company announced that it had entered into a definitive agreement to merge with **SPAC** company known as **Foley Trasimene Acquisition Corp**, in a **US$9 billion transaction.**\n\n&amp;#x200B;\n\n***What products do they offer and what do they sell?***\n\nThe company helps businesses and consumers to connect and transact seamlessly through capabilities in payment processing, digital wallet, and other online money transfer solutions.\n\n* Cash online - Accepts cash payments online\n* Direct Debit - Accepts instant, secured bank payments direct from consumers.\n* Digital Wallets - Accepts payment from digital wallets\n* Integrated Payments - They customise and integrate payments for businesses\n* Online Payments - They provide secure &amp; simplified e-commerce solutions\n\n&amp;#x200B;\n\n**Hedge-funds are extremely bullish on $PSFE**\n\nAs we all know, hedge funds deliver the best returns compared to S&amp;P500. Many hedge fund companies showed tremendous growth and performed excellent even during pandemic and post pandemic.\n\nBased on the insidermonkey article, the number of long hedge fund bets on ***Paysafe*** rose by 41, however, please note that PSFE isn't included in the 30 most popular stocks amongst hedgefunds . The graph below displays the number of hedge funds with bullish position in PSFE over the last 23 quarters.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/16fgyv0oi9771.png?width=1488&amp;format=png&amp;auto=webp&amp;s=ee1cda1487ea36780e941d2cc38408dd443575fd\n\n&amp;#x200B;\n\nNow let's have a look at the top institutional owners for ***Paysafe.*** As you can see from the image below, majority of these companies are hedge funds &amp; private equity firms.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/oi8vq91pi9771.png?width=2014&amp;format=png&amp;auto=webp&amp;s=abfacb9609f29ed23c504ccf5173e6ea0629f4db\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Price targets as per Wall Street Analysts -**\n\nAs per **Marketbeat.com** \\- 7 Wall Street analysts have issued ratings and price targets for Paysafe in the last 12 months. Their average **twelve-month price target is $17.29**, predicting that the stock has a possible **upside of 54.75%**. The high price target for **PSFE is $19.00** and the **low price target for PSFE is $15.00**.\n\nEven if the company is able to hit a price target of 15$ in the coming weeks, that's a possible of upside of at least **35.13%** based on the current stock price at the time of this DD **($11.10).**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z8fvvsipi9771.png?width=2618&amp;format=png&amp;auto=webp&amp;s=9358502f3c6a6dfa560fc4c9ef58493ef4f2edc0\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**If company is so good, why did it fall 23% in the last 6 months?**\n\nAs all of you may know, the SPAC's were hot and trending back in early 2021 and most of the companies were overpriced. If you look at the price history of all the SPAC's post merger, then you'll notice that most of them fell quite significantly. ***Paysafe*** was one of the top companies that went public through SPAC.\n\n&amp;#x200B;\n\n**Why paysafe is a good stock to invests in?**\n\n&amp;#x200B;\n\n* ***Paysafe*** has been delivering what many SPAC's have failed to deliver i.e **Revenues &amp; Profits.** Despite the numbers being good after Q1, the stock still fell by 21%. Paysafe got hit by \"Post merger SPAC effect'.\n* The drop in price due to \"Post Merger SPAC effect\" is a great opportunity for investors to buy the stock and hold it for long term.\n* Paysafe has an amazing opportunity to establish it's monopoly in the iGaming space. Their biggest competitors PayPal &amp; Square are staying out of iGaming space and focusing more on Fintech space. Paysafe currently has agreements with few big companies such as DraftKings, Roblox, Twitch, Caesar's entertainment and many more.\n* When it comes to iGaming space, the risks are relatively small because the disputes are very unlikely. People depositing money into their roblox accounts or draft kings are not entitled to refunds and same applies to twitch donations.\n* As per nasdaq.com, the company is expected to **exceed $103 billion in transactions** this year and the company forecasts that iGaming in the United States will grow at a compound annual growth rate (CAGR) of **52% through 2025.**\n* The company’s products are currently not as widely accepted as PayPal or Square, however, they plan on expanding in the coming years.\n* As per nasdaq.com, The U.S. online gambling industry is expected to grow at a CAGR of 15.4% between last year and fiscal year 2025 and ***Paysafe*** has relationship with almost all top online gambling operators in the U.S.\n* The company has expanded partnership with **Coinbase** and the company’s payment solution is in about 27  sites and exchanges. As investing and trading activity grows in the near future, Paysafe is well positioned to benefit.\n* If you look at the Q1, the fundamentals were quite strong, company reported revenue of $377.4 million, which was higher by 5% on a year-on-year basis. The company's adjusted EBITDA was $113.2 million, which implies an EBITDA margin of 30%.\n* The company absolutely destroyed the expectations when it comes to e-cash solutions segment, adjusted EBITDA for that segment was 110% higher and reported $48.1 million. The company reported revenue growth of 63% \\~ $112.9 million.\n* As per nasdaq.com, the e-cash segment has an EBITDA margin of 42.6% as compared to the company level EBITDA margin of 30%. With strong growth in the e-cash segment, it’s likely that EBITDA margin will expand in the coming quarters. As a matter of fact, Paysafe has guided for an adjusted EBITDA margin of 32% for FY2021\n* Between FY2020 and FY2023, the company is targeting annual growth revenue of about \\~10%. Ecash segment is the margin driver for this company and the guidance seems realistic because of potential growth in the U.S online gambling sector.\n* If there is a synergy, Paysafe could also merge with other online payment companies in order to grow. The company is currently sitting at $274 million in cash and $225 million in un-drawn credit facility.\n* According to nasdaq.com, Paysafe reported operating cash flow of $48.7 million in Q1. This would imply an annualized OCF of $195 million. With likely EBITDA margin expansion in the coming years, the company is positioned for healthy cash flow growth.\n\n&amp;#x200B;\n\n**What is the future of iGaming and online transactions?**\n\nThere is no brainer in this question. The iGaming space and etransactions will keep exceeding in the near future. Many countries currently use cash for transactions, but as technology advances, third world countries are expected to go cashless and follow digital payments. As per the article from Juniper Research Ltd, the digital world is projected to exceed $10 Trillion in 2025. This is an 83% increase from 2020. The research also found that contactless and e-commerce payments will increase to 50% of total wallet spend in 2025 from less than 36% in 2020. More than 34% of mobile handsets are also seen to use contactless payments in 2025, up from 11% in 2020. Even a 2 year old baby would know that Paysafe is expected to benefit from this growth.\n\n&amp;#x200B;\n\nStock price during after the merger,\n\nAs you can see from the graph below, the Paysafe stock rocketed right after the merger announcement and shot up to as high as 20$/piece. What happened next should not shock the world because most of the SPAC's fell off post merger. BUT what makes this SPAC unique is the fact that they've been able to pull off revenues and profits and were able to provide better guidance for the future.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hyoset7qi9771.png?width=1246&amp;format=png&amp;auto=webp&amp;s=6c4d3c4fb3b6d310cfde9db6e2e3cbeb8da4e2fa\n\n&amp;#x200B;\n\n# Now, let's talk about Financials of Q1\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y45zt6gri9771.png?width=2192&amp;format=png&amp;auto=webp&amp;s=33044dbe4400c4dad97cbc0be8ff19aaf283420a\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTotal revenue for the first quarter of 2021 was $377.4 million, an increase of 5%, compared to $359.7 million in the prior year. However, gross profit was a bit low compared to 2020.\n\nNet loss for the first quarter was $49.1 million, compared to $51.1 million, in the prior year. The company mentioned in the presentation that Net loss included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\n\nAdjusted EBITDA for the first quarter was $113.2 million, compared to $112.8 million in the prior year. Adjusted EBITDA margin decreased approximately 140 basis points to 30.0%, but they expect this basis point to go up in the near future.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Now let's have a look at the segment growth\n\nLike I mentioned earlier, the company absolutely destroyed their growth in ecash solutions and reported an increase in revenue by 63%.\n\n***Integrated Processing -*** Revenue for the first quarter was $176.9 million, a decrease of 5%, compared to $186.2 million in the prior year\n\n***Digital Wallet -*** Revenue for the first quarter was $94.9 million, a decrease of 13%, compared to $108.5 million in the prior year.\n\n***eCash Solutions -*** Revenue for the first quarter was $112.9 million, an increase of 63%, compared to $69.1 million in the prior year\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/x5j1nhyri9771.png?width=2208&amp;format=png&amp;auto=webp&amp;s=d4b14b845cb7ecaf1a00e27b8fe0f6ffc44609be\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# HIGHER 2021 guidance\n\nThe company reported higher 2021 guidance and are expected to achieve their goals due to increase number of online transactions and growth in iGaming space.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gojzvggsi9771.png?width=1890&amp;format=png&amp;auto=webp&amp;s=390185af9bbd93e8b329a32f7bcae6dd2836ce45\n\n&amp;#x200B;\n\n**TLDR -**\n\n**The company is expected to achieve their 2021 guidance.**\n\n**No competition for Paysafe in iGaming space.**\n\n**The stock fell down in the past few months due to \"Post Merger SPAC fatigue\"**\n\n**One of the few SPAC's who actually brings in Revenue &amp; Profits**\n\n**Currently close to 52 week low and a nice opportunity to grab at this current price**\n\n&amp;#x200B;\n\n**Positions Screenshot** \n\n**180 share at 11.14$ each**\n\n**45x calls with strike price 12.5$ expiring 7/16.**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ijv61isui9771.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=33ee01694a8ddfbe3e8ffa5b44c7de47e3c731f4",
        "subreddit": "wallstreetbets",
        "title": "$PSFE Power up your wallet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o77r2c/psfe_power_up_your_wallet/",
        "created": 1624590650.0
    },
    {
        "author": "sultanmirza007",
        "created_utc": 1624561622,
        "id": "o77od9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "# PAYSAFE - PAYMENT SOLUTIONS TO POWER UP YOUR WALLET\n\n&amp;#x200B;\n\n***What is Paysafe?***\n\n**Paysafe Group** previously known as **Optimal Payments PLC** is a multinational online payments company. The company offers services both under the *Paysafe* brand and subsidiary brands that have become part of the group through several mergers and acquisitions, most notably Neteller, Skrill and paysafecard. **Paysafe** was sold to the Blackstone Group &amp; CVC Partner Capitals making it the **largest private equity** backed takeover of a London listed company since 2007-2008 crisis.\n\nIn December 2020, the company announced that it had entered into a definitive agreement to merge with **SPAC** company known as **Foley Trasimene Acquisition Corp**, in a **US$9 billion transaction.**\n\n&amp;#x200B;\n\n***What products do they offer and what do they sell?***\n\nThe company helps businesses and consumers to connect and transact seamlessly through capabilities in payment processing, digital wallet, and other online money transfer solutions.\n\n* Cash online - Accepts cash payments online\n* Direct Debit - Accepts instant, secured bank payments direct from consumers.\n* Digital Wallets - Accepts payment from digital wallets\n* Integrated Payments - They customise and integrate payments for businesses\n* Online Payments - They provide secure &amp; simplified e-commerce solutions\n\n&amp;#x200B;\n\n**Hedge-funds are extremely bullish on $PSFE**\n\nAs we all know, hedge funds deliver the best returns compared to S&amp;P500. Many hedge fund companies showed tremendous growth and performed excellent even during pandemic and post pandemic.\n\nBased on the insidermonkey article, the number of long hedge fund bets on ***Paysafe*** rose by 41, however, please note that PSFE isn't included in the 30 most popular stocks amongst hedgefunds . The graph below displays the number of hedge funds with bullish position in PSFE over the last 23 quarters.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/22ov815fh9771.png?width=1488&amp;format=png&amp;auto=webp&amp;s=5cae605286adee87114da32500a2f2deec2de300\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNow let's have a look at the top institutional owners for ***Paysafe.*** As you can see from the image below, majority of these companies are hedge funds &amp; private equity firms.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ik60qwwfh9771.png?width=2014&amp;format=png&amp;auto=webp&amp;s=2d7e6ef448446d26532c26be3a204ef0cfe1150b\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Price targets as per Wall Street Analysts -**\n\nAs per **Marketbeat.com** \\- 7 Wall Street analysts have issued ratings and price targets for Paysafe in the last 12 months. Their average **twelve-month price target is $17.29**, predicting that the stock has a possible **upside of 54.75%**. The high price target for **PSFE is $19.00** and the **low price target for PSFE is $15.00**.\n\nEven if the company is able to hit a price target of 15$ in the coming weeks, that's a possible of upside of at least **35.13%** based on the current stock price at the time of this DD **($11.10).**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mjt3xiehh9771.png?width=2618&amp;format=png&amp;auto=webp&amp;s=8a9d3157f4885c3081bdb50a5b9e351ae5193f05\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**If company is so good, why did it fall 23% in the last 6 months?**\n\nAs all of you may know, the SPAC's were hot and trending back in early 2021 and most of the companies were overpriced. If you look at the price history of all the SPAC's post merger, then you'll notice that most of them fell quite significantly. ***Paysafe*** was one of the top companies that went public through SPAC.\n\n&amp;#x200B;\n\n**Why paysafe is a good stock to invests in?**\n\n&amp;#x200B;\n\n* ***Paysafe*** has been delivering what many SPAC's have failed to deliver i.e **Revenues &amp; Profits.** Despite the numbers being good after Q1, the stock still fell by 21%. Paysafe got hit by \"Post merger SPAC effect'.\n* The drop in price due to \"Post Merger SPAC effect\" is a great opportunity for investors to buy the stock and hold it for long term.\n* Paysafe has an amazing opportunity to establish it's monopoly in the iGaming space. Their biggest competitors PayPal &amp; Square are staying out of iGaming space and focusing more on Fintech space. Paysafe currently has agreements with few big companies such as DraftKings, Roblox, Twitch, Caesar's entertainment and many more.\n* When it comes to iGaming space, the risks are relatively small because the disputes are very unlikely. People depositing money into their roblox accounts or draft kings are not entitled to refunds and same applies to twitch donations.\n* As per nasdaq.com, the company is expected to **exceed $103 billion in transactions** this year and the company forecasts that iGaming in the United States will grow at a compound annual growth rate (CAGR) of **52% through 2025.**\n* The company’s products are currently not as widely accepted as PayPal or Square, however, they plan on expanding in the coming years.\n* As per nasdaq.com, The U.S. online gambling industry is expected to grow at a CAGR of 15.4% between last year and fiscal year 2025 and ***Paysafe*** has relationship with almost all top online gambling operators in the U.S.\n* The company has expanded partnership with **Coinbase** and the company’s payment solution is in about 27  sites and exchanges. As investing and trading activity grows in the near future, Paysafe is well positioned to benefit.\n* If you look at the Q1, the fundamentals were quite strong, company reported revenue of $377.4 million, which was higher by 5% on a year-on-year basis. The company's adjusted EBITDA was $113.2 million, which implies an EBITDA margin of 30%.\n* The company absolutely destroyed the expectations when it comes to e-cash solutions segment, adjusted EBITDA for that segment was 110% higher and reported $48.1 million. The company reported revenue growth of 63% \\~ $112.9 million.\n* As per nasdaq.com, the e-cash segment has an EBITDA margin of 42.6% as compared to the company level EBITDA margin of 30%. With strong growth in the e-cash segment, it’s likely that EBITDA margin will expand in the coming quarters. As a matter of fact, Paysafe has guided for an adjusted EBITDA margin of 32% for FY2021\n* Between FY2020 and FY2023, the company is targeting annual growth revenue of about \\~10%. Ecash segment is the margin driver for this company and the guidance seems realistic because of potential growth in the U.S online gambling sector.\n* If there is a synergy, Paysafe could also merge with other online payment companies in order to grow. The company is currently sitting at $274 million in cash and $225 million in un-drawn credit facility.\n* According to nasdaq.com, Paysafe reported operating cash flow of $48.7 million in Q1. This would imply an annualized OCF of $195 million. With likely EBITDA margin expansion in the coming years, the company is positioned for healthy cash flow growth.\n\n&amp;#x200B;\n\n**What is the future of iGaming and online transactions?**\n\nThere is no brainer in this question. The iGaming space and etransactions will keep exceeding in the near future. Many countries currently use cash for transactions, but as technology advances, third world countries are expected to go cashless and follow digital payments. As per the article from Juniper Research Ltd, the digital world is projected to exceed $10 Trillion in 2025. This is an 83% increase from 2020. The research also found that contactless and e-commerce payments will increase to 50% of total wallet spend in 2025 from less than 36% in 2020. More than 34% of mobile handsets are also seen to use contactless payments in 2025, up from 11% in 2020. Even a 2 year old baby would know that Paysafe is expected to benefit from this growth.\n\n&amp;#x200B;\n\nStock price during after the merger,\n\nAs you can see from the graph below, the Paysafe stock rocketed right after the merger announcement and shot up to as high as 20$/piece. What happened next should not shock the world because most of the SPAC's fell off post merger. BUT what makes this SPAC unique is the fact that they've been able to pull off revenues and profits and were able to provide better guidance for the future.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gru0oxhnh9771.png?width=1246&amp;format=png&amp;auto=webp&amp;s=c012960381cc3ae1c34962e272a5f6531843dfc9\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Now, let's talk about Financials of Q1\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kh98n2wnh9771.png?width=2192&amp;format=png&amp;auto=webp&amp;s=fa735b3d9cab29b2f0ee6eb5ce76117909858a14\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTotal revenue for the first quarter of 2021 was $377.4 million, an increase of 5%, compared to $359.7 million in the prior year. However, gross profit was a bit low compared to 2020.\n\nNet loss for the first quarter was $49.1 million, compared to $51.1 million, in the prior year. The company mentioned in the presentation that Net loss included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\n\nAdjusted EBITDA for the first quarter was $113.2 million, compared to $112.8 million in the prior year. Adjusted EBITDA margin decreased approximately 140 basis points to 30.0%, but they expect this basis point to go up in the near future.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Now let's have a look at the segment growth\n\nLike I mentioned earlier, the company absolutely destroyed their growth in ecash solutions and reported an increase in revenue by 63%.\n\n***Integrated Processing -*** Revenue for the first quarter was $176.9 million, a decrease of 5%, compared to $186.2 million in the prior year\n\n***Digital Wallet -*** Revenue for the first quarter was $94.9 million, a decrease of 13%, compared to $108.5 million in the prior year.\n\n***eCash Solutions -*** Revenue for the first quarter was $112.9 million, an increase of 63%, compared to $69.1 million in the prior year\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vzjpzgqqh9771.png?width=2208&amp;format=png&amp;auto=webp&amp;s=7523b804be62ce8adf6e771a4b9191deaffaba0a\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# HIGHER 2021 guidance\n\nThe company reported higher 2021 guidance and are expected to achieve their goals due to increase number of online transactions and growth in iGaming space.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/syf32hzoh9771.png?width=1890&amp;format=png&amp;auto=webp&amp;s=0a853402c33dc2810fdaa840d670caf2a416c4e0\n\n&amp;#x200B;\n\n**TLDR -**\n\n**The company is expected to achieve their 2021 guidance.**\n\n**No competition for Paysafe in iGaming space.**\n\n**The stock fell down in the past few months due to \"Post Merger SPAC fatigue\"**\n\n**One of the few SPAC's who actually brings in Revenue &amp; Profits**\n\n**Currently close to 52 week low and a nice opportunity to grab at this current price**\n\n&amp;#x200B;\n\n**Positions Screenshot -** [**https://imgur.com/a/SH4xjBz**](https://imgur.com/a/SH4xjBz)\n\n**180 share at 11.14$ each**\n\n**45x calls with strike price 12.5$ expiring 7/16.**",
        "subreddit": "wallstreetbets",
        "title": "$PSFE Power up your wallet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o77od9/psfe_power_up_your_wallet/",
        "created": 1624590422.0
    },
    {
        "author": "SelfAware_Chair",
        "created_utc": 1624647426,
        "id": "o7u2f3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello fellow apes, the BNPL market is growing at a rapid rate. With KPLT you can spend tomorrows tendies today. Here's my DD:\n\nWhy KPLT is undervalued and overlooked\n\nKatapult Holdings (KPLT) is a financing platform that focuses on non-prime, online customers. KPLT is the leading “buy now, pay later” service with dirt cheap evaluation and potential to grow. KPLT is very profitable, has quick growth potential, and is trading for much less than its peers. \n\nWhy will KPLT grow?\n\nThe Federal Reserve Bank of New York states that 38% of US consumers are non-prime. That’s a huge market Katapult to grow off of. With Katapult being partnered with merchants like Wayfair, Motorola, Purple, Nectar, and Lenovo, Katapult already has their foot in the door to sell to non-prime consumers. \n\nWhen a consumer fails a prime lending application from companies like Affirm or PayPal, they are passed on to Katapult. Katapult offers them different kinds of payment options depending on what they can afford. \n\n[Source: Initial Investor Presentation](https://preview.redd.it/wtdxrxjekg771.png?width=541&amp;format=png&amp;auto=webp&amp;s=0e506e2d0f17aafda14773e3603458bc4fc3b947)\n\nCurrently, Katapult is the only major non-prime financing platform that is focused primarily online. With Katapult integrated into merchant sites, having very little competition, and open to a large market, it has lots of growth potential.\n\nKPLT financials\n\nKatapult approves around 60% of consumers who failed prime lender applications. There is higher risk when dealing with non-prime customers, Fortunately, the company has less than a 3% fraud rate and recovers around 90% of lease costs and charge-offs.\n\nQ1\n\n  \n\n[  Source: Investor Presentation](https://preview.redd.it/icz28kmhkg771.png?width=624&amp;format=png&amp;auto=webp&amp;s=0c20b62acede60f0152e441e07c9e58982f5e956)\n\nQ1 performance seems underwhelming, but the company shows crazy growth. Katapult did $82M in revenue which is up 88. The Net income was $8.1M, and up 120% from last year’s Q1.\n\nForward revenue estimates look very pleasing. In 2021, KPLT is estimated to make $475M with 92% YoY growth. In 2022 they are estimated to make $804M with a 70% YoY growth.\n\n&amp;#x200B;\n\n[Source: Investor Presentation](https://preview.redd.it/5hwpdu0kkg771.png?width=624&amp;format=png&amp;auto=webp&amp;s=a9b9653e0dc9add190d707f34dbf95798609a299)\n\n&amp;#x200B;\n\nKatapult’s earnings will keep growing due to its increased return on leases. The more they squeeze out of their leases, is the more profits and income they’ll net.  \n\nGrowth\n\n“Buy now, Pay later” transactions are gaining much more popularity. Juniper Research says suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. More than 50% of Americans use BNPL transactions as of March 2021. The BNPL market is growing at a rapid rate. With little competition among non-prime financing platforms, Katapult will skyrocket.\n\nKPLT is expecting $1B in revenue by 2023, and is aggressively expanding its retail partners. KPLT added 26 new retail partners in Q1 and will keep growing its market.\n\nConclusion\n\nKPLT is very, very undervalued at a little over $10. Its projected earnings are growing at a rapid rate. With KPLT greatly increasing the amount of retail partners and with the growing BNPL market, Katapult is a great investment that will have lots of return. \n\nI think KPLT should be trading at around $20 or more. Don’t take my word on it, I’m not a financial advisor and you should definitely do some of your own DD. I hope this can bring some awareness to a undervalued stock that hold lots of short and long term profits.",
        "subreddit": "wallstreetbets",
        "title": "SPEND TOMORROWS TENDIES TODAY - KPLT DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o7u2f3/spend_tomorrows_tendies_today_kplt_dd/",
        "created": 1624676226.0
    },
    {
        "author": "SelfAware_Chair",
        "created_utc": 1624731476,
        "id": "o8g2xy",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "BNPL Market is rapidly expanding. KPLT is the leading platform for non-prime, online leasing. Please do some of your own research apes, but I hope this brings some awareness to what I believe is an undervalued stock.\n\n**Why KPLT is undervalued and overlooked**\n\nKatapult Holdings (KPLT) is a financing platform that focuses on non-prime, online customers. KPLT is the leading “buy now, pay later” service with dirt cheap evaluation and potential to grow. KPLT is very profitable, has quick growth potential, and is trading for much less than its peers. \n\n**Why will KPLT grow?**\n\nThe Federal Reserve Bank of New York states that 38% of US consumers are non-prime. That’s a huge market Katapult to grow off of. With Katapult being partnered with merchants like Wayfair, Motorola, Purple, Nectar, and Lenovo, Katapult already has their foot in the door to sell to non-prime consumers. \n\nWhen a consumer fails a prime lending application from companies like Affirm or PayPal, they are passed on to Katapult. Katapult offers them different kinds of payment options depending on what they can afford.\n\n[Source: Initial Investor Presentation](https://preview.redd.it/88cx6i76in771.png?width=541&amp;format=png&amp;auto=webp&amp;s=4909c4c2b19be342ca31bd6cd65eec7784ff10da)\n\nCurrently, Katapult is the only major non-prime financing platform that is focused primarily online. With Katapult integrated into merchant sites, having very little competition, and open to a large market, it has lots of growth potential.\n\n**KPLT financials**\n\nKatapult approves around 60% of consumers who failed prime lender applications. There is higher risk when dealing with non-prime customers, Fortunately, the company has less than a 3% fraud rate and recovers around 90% of lease costs and charge-offs.\n\n**Q1**\n\n \n\n[Source: Investor Presentation](https://preview.redd.it/ccfmoh19in771.png?width=624&amp;format=png&amp;auto=webp&amp;s=f3869115325ecd555cb74190395282e741718451)\n\nQ1 performance seems underwhelming, but the company shows crazy growth. Katapult did $82M in revenue which is up 88. The Net income was $8.1M, and up 120% from last year’s Q1.\n\nForward revenue estimates look very pleasing. In 2021, KPLT is estimated to make $475M with 92% YoY growth. In 2022 they are estimated to make $804M with a 70% YoY growth.\n\n  \n\n[Source: Investor Presentation](https://preview.redd.it/v359kqiain771.png?width=624&amp;format=png&amp;auto=webp&amp;s=4ae8f4dd03f307deba072ac9823bcaceb94e73d2)\n\nKatapult’s earnings will keep growing due to its increased return on leases. The more they squeeze out of their leases, is the more profits and income they’ll net.  \n\n**Growth**\n\n“Buy now, Pay later” transactions are gaining much more popularity. Juniper Research says suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. More than 50% of Americans use BNPL transactions as of March 2021. The BNPL market is growing at a rapid rate. With little competition among non-prime financing platforms, Katapult will skyrocket.\n\nKPLT is expecting $1B in revenue by 2023, and is aggressively expanding its retail partners. KPLT added 26 new retail partners in Q1 and will keep growing its market.\n\n**Conclusion**\n\nKPLT is very, very undervalued at a little over $10. Its projected earnings are growing at a rapid rate. With KPLT greatly increasing the amount of retail partners and with the growing BNPL market, Katapult is a great investment that will have lots of return. \n\nI think KPLT should be trading at around $20 or more. Don’t take my word on it, I’m not a financial advisor and you should definitely do some of your own DD. I hope this can bring some awareness to a undervalued stock that hold lots of short and long term profits.",
        "subreddit": "wallstreetbets",
        "title": "SPEND TOMORROWS TENDIES TODAY - KPLT DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o8g2xy/spend_tomorrows_tendies_today_kplt_dd/",
        "created": 1624760276.0
    },
    {
        "author": "sultanmirza007",
        "created_utc": 1624558693,
        "id": "o76pbc",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "# PAYSAFE - PAYMENT SOLUTIONS TO POWER UP YOUR TENDIES\n\n&amp;#x200B;\n\n***What is Paysafe?***\n\n  \n**Paysafe Group** previously known as **Optimal Payments PLC** is a multinational online payments company. The company offers services both under the *Paysafe* brand and subsidiary brands that have become part of the group through several mergers and acquisitions, most notably Neteller, Skrill and paysafecard.  \n**Paysafe** was sold to the Blackstone Group &amp; CVC Partner Capitals making it the **largest private equity** backed takeover of a London listed company since 2007-2008 crisis.\n\nIn December 2020, the company announced that it had entered into a definitive agreement to merge with **SPAC** company known as **Foley Trasimene Acquisition Corp**, in a **US$9 billion transaction.**\n\n&amp;#x200B;\n\n***What products do they offer and what do they sell?***\n\n  \nThe company helps businesses and consumers to connect and transact seamlessly through capabilities in payment processing, digital wallet, and other online money transfer solutions.\n\n* Cash online - Accepts cash payments online\n* Direct Debit - Accepts instant, secured bank payments direct from consumers.\n* Digital Wallets - Accepts payment from digital wallets\n* Integrated Payments - They customise and integrate payments for businesses\n* Online Payments - They provide secure &amp; simplified e-commerce solutions\n\n&amp;#x200B;\n\n**Hedge-funds are extremely bullish on $PSFE**  \n\n\nAs we all know, hedge funds deliver the best returns compared to S&amp;P500. Many hedge fund companies showed tremendous growth and performed excellent even during pandemic and post pandemic. \n\n  \nBased on the insidermonkey article, the number of long hedge fund bets on ***Paysafe*** rose by 41, however, please note that PSFE isn't included in the 30 most popular stocks amongst hedgefunds . The graph below displays the number of hedge funds with bullish position in PSFE over the last 23 quarters.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Source : Insider Monkey](https://preview.redd.it/5xq73zner8771.png?width=1488&amp;format=png&amp;auto=webp&amp;s=220607841c596c55e08162d97a7a997cdb628831)\n\n&amp;#x200B;\n\nNow let's have a look at the top institutional owners for ***Paysafe.*** As you can see from the image below, majority of these companies are hedge funds &amp; private equity firms.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Source : fintel.io](https://preview.redd.it/r53vds5ms8771.png?width=2014&amp;format=png&amp;auto=webp&amp;s=825ac57b002841a45bcf1a035b572ee42f72d424)\n\n&amp;#x200B;\n\n**Price targets as per Wall Street Analysts -** \n\nAs per **Marketbeat.com** \\- 7 Wall Street analysts have issued ratings and price targets for Paysafe in the last 12 months. Their average **twelve-month price target is $17.29**, predicting that the stock has a possible **upside of 54.75%**. The high price target for **PSFE is $19.00** and the **low price target for PSFE is $15.00**. \n\nEven if the company is able to hit a price target of 15$ in the coming weeks, that's a possible of upside of at least **35.13%** based on the current stock price at the time of this DD **($11.10).**\n\n&amp;#x200B;\n\n[Source : marketbeat.com](https://preview.redd.it/600l84xxt8771.png?width=2618&amp;format=png&amp;auto=webp&amp;s=42e4b7190e016965cc8efccf0ac0099b88c83393)\n\n&amp;#x200B;\n\n**If company is so good, why did it fall 23% in the last 6 months?**\n\nAs all of you may know, the SPAC's were hot and trending back in early 2021 and most of the companies were overpriced. If you look at the price history of all the SPAC's post merger, then you'll notice that most of them fell quite significantly. ***Paysafe*** was one of the top companies that went public through SPAC.\n\n&amp;#x200B;\n\n**Why paysafe is a good stock to invests in?**\n\n&amp;#x200B;\n\n* ***Paysafe*** has been delivering what many SPAC's have failed to deliver i.e **Revenues &amp; Profits.** Despite the numbers being good after Q1, the stock still fell by 21%. Paysafe got hit by \"Post merger SPAC effect'. \n* The drop in price due to \"Post Merger SPAC effect\" is a great opportunity for investors to buy the stock and hold it for long term. \n* Paysafe has an amazing opportunity to establish it's monopoly in the iGaming space. Their biggest competitors PayPal &amp; Square are staying out of iGaming space and focusing more on Fintech space. Paysafe currently has agreements with few big companies such as DraftKings, Roblox, Twitch, Caesar's entertainment and many more. \n* When it comes to iGaming space, the risks are relatively small because the disputes are very unlikely. People depositing money into their roblox accounts or draft kings are not entitled to refunds and same applies to twitch donations. \n* As per nasdaq.com, the company is expected to **exceed $103 billion in transactions** this year and the company forecasts that iGaming in the United States will grow at a compound annual growth rate (CAGR) of **52% through 2025.** \n* The company’s products are currently not as widely accepted as PayPal or Square, however, they plan on expanding in the coming years. \n* As per nasdaq.com, The U.S. online gambling industry is expected to grow at a CAGR of 15.4% between last year and fiscal year 2025 and ***Paysafe*** has relationship with almost all top online gambling operators in the U.S. \n* The company has expanded partnership with **Coinbase** and the company’s payment solution is in about 27  sites and exchanges. As investing and trading activity grows in the near future, Paysafe is well positioned to benefit.\n* If you look at the Q1, the fundamentals were quite strong, company reported revenue of $377.4 million, which was higher by 5% on a year-on-year basis. The company's adjusted EBITDA was $113.2 million, which implies an EBITDA margin of 30%.\n* The company absolutely destroyed the expectations when it comes to e-cash solutions segment, adjusted EBITDA for that segment was 110% higher and reported $48.1 million. The company reported revenue growth of 63% \\~ $112.9 million.\n* As per nasdaq.com, the e-cash segment has an EBITDA margin of 42.6% as compared to the company level EBITDA margin of 30%. With strong growth in the e-cash segment, it’s likely that EBITDA margin will expand in the coming quarters. As a matter of fact, Paysafe has guided for an adjusted EBITDA margin of 32% for FY2021\n* Between FY2020 and FY2023, the company is targeting annual growth revenue of about \\~10%. Ecash segment is the margin driver for this company and the guidance seems realistic because of potential growth in the U.S online gambling sector.\n* If there is a synergy, Paysafe could also merge with other online payment companies in order to grow. The company is currently sitting at $274 million in cash and $225 million in un-drawn credit facility.\n* According to [nasdaq.com](https://www.nasdaq.com/articles/paysafe-stock-has-significant-upside-from-current-levels-2021-05-25), Paysafe reported operating cash flow of $48.7 million in Q1. This would imply an annualized OCF of $195 million. With likely EBITDA margin expansion in the coming years, the company is positioned for healthy cash flow growth.\n\n&amp;#x200B;\n\n**What is the future of iGaming and online transactions?**  \n\n\nThere is no brainer in this question. The iGaming space and etransactions will keep exceeding in the near future. Many countries currently use cash for transactions, but as technology advances, third world countries are expected to go cashless and follow digital payments. As per the article from [Juniper Research Ltd](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/digital-wallet-spend-to-exceed-10-trillion-in-2025-study-says-62265421), the digital world is projected to exceed $10 Trillion in 2025. This is an 83% increase from 2020. The research also found that contactless and e-commerce payments will increase to 50% of total wallet spend in 2025 from less than 36% in 2020. More than 34% of mobile handsets are also seen to use contactless payments in 2025, up from 11% in 2020. Even a 2 year old baby would know that Paysafe is expected to benefit from this growth. \n\n&amp;#x200B;\n\nStock price during after the merger,\n\nAs you can see from the graph below, the Paysafe stock rocketed right after the merger announcement and shot up to as high as 20$/piece. What happened next should not shock the world because most of the SPAC's fell off post merger. BUT what makes this SPAC unique is the fact that they've been able to pull off revenues and profits and were able to provide better guidance for the future.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nwi7nepq39771.png?width=1246&amp;format=png&amp;auto=webp&amp;s=41deb9689d7077674554decfce263ab2458e240d\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Now, let's talk about Financials of Q1\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/j92og0gt69771.png?width=2192&amp;format=png&amp;auto=webp&amp;s=613ffc3323e0b8079dea5fafa4c37b36f44c999b\n\nTotal revenue for the first quarter of 2021 was $377.4 million, an increase of 5%, compared to $359.7 million in the prior year. However, gross profit was a bit low compared to 2020. \n\nNet loss for the first quarter was $49.1 million, compared to $51.1 million, in the prior year. The company mentioned in the presentation that Net loss included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction. \n\nAdjusted EBITDA for the first quarter was $113.2 million, compared to $112.8 million in the prior year. Adjusted EBITDA margin decreased approximately 140 basis points to 30.0%, but they expect this basis point to go up in the near future.\n\n&amp;#x200B;\n\n# Now let's have a look at the segment growth\n\nLike I mentioned earlier, the company absolutely destroyed their growth in ecash solutions and reported an increase in revenue by 63%.\n\n***Integrated Processing -*** Revenue for the first quarter was $176.9 million, a decrease of 5%, compared to $186.2 million in the prior year\n\n***Digital Wallet -*** Revenue for the first quarter was $94.9 million, a decrease of 13%, compared to $108.5 million in the prior year. \n\n***eCash Solutions -*** Revenue for the first quarter was $112.9 million, an increase of 63%, compared to $69.1 million in the prior year\n\n&amp;#x200B;\n\nhttps://preview.redd.it/yd4dvg7l79771.png?width=2208&amp;format=png&amp;auto=webp&amp;s=3ed96de58447903cfefc57b9a933bade2a1cdf18\n\n&amp;#x200B;\n\n# HIGHER 2021 guidance\n\nThe company reported higher 2021 guidance and are expected to achieve their goals due to increase number of online transactions and growth in iGaming space.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/he4dcdqc89771.png?width=1890&amp;format=png&amp;auto=webp&amp;s=21daee2789ba0145f5fc8ae2a5d9d28bfd98d046\n\n&amp;#x200B;\n\n**TLDR -**\n\n* **The company is expected to achieve their 2021 guidance.**\n* **No competition for Paysafe in iGaming space.**\n* **The stock fell down in the past few months due to \"Post Merger SPAC fatigue\"**\n* **One of the few SPAC's who actually brings in Revenue &amp; Profits**\n* **Currently close to 52 week low and a nice opportunity to grab at this current price**\n\n&amp;#x200B;\n\n**Positions -**\n\n**180 share at 11.14$ each**\n\n**45x calls with strike price 12.5$ expiring 7/16.**",
        "subreddit": "wallstreetbets",
        "title": "$PSFE - A solid play that will power up your wallet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o76pbc/psfe_a_solid_play_that_will_power_up_your_wallet/",
        "created": 1624587493.0
    },
    {
        "author": "sultanmirza007",
        "created_utc": 1624559580,
        "id": "o76zts",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "# PAYSAFE - PAYMENT SOLUTIONS TO POWER UP YOUR TENDIES\n\n&amp;#x200B;\n\n***What is Paysafe?***\n\n**Paysafe Group** previously known as **Optimal Payments PLC** is a multinational online payments company. The company offers services both under the *Paysafe* brand and subsidiary brands that have become part of the group through several mergers and acquisitions, most notably Neteller, Skrill and paysafecard.**Paysafe** was sold to the Blackstone Group &amp; CVC Partner Capitals making it the **largest private equity** backed takeover of a London listed company since 2007-2008 crisis.\n\nIn December 2020, the company announced that it had entered into a definitive agreement to merge with company known as **Foley Trasimene Acquisition Corp**, in a **US$9 billion transaction.**\n\n&amp;#x200B;\n\n***What products do they offer and what do they sell?***\n\nThe company helps businesses and consumers to connect and transact seamlessly through capabilities in payment processing, digital wallet, and other online money transfer solutions.\n\n* Cash online - Accepts cash payments online\n* Direct Debit - Accepts instant, secured bank payments direct from consumers.\n* Digital Wallets - Accepts payment from digital wallets\n* Integrated Payments - They customise and integrate payments for businesses\n* Online Payments - They provide secure &amp; simplified e-commerce solutions\n\n&amp;#x200B;\n\n**Hedge-funds are extremely bullish on $PSFE**\n\nAs we all know, hedge funds deliver the best returns compared to S&amp;P500. Many hedge fund companies showed tremendous growth and performed excellent even during pandemic and post pandemic.\n\nBased on the insidermonkey article, the number of long hedge fund bets on ***Paysafe*** rose by 41, however, please note that PSFE isn't included in the 30 most popular stocks amongst hedgefunds . The graph below displays the number of hedge funds with bullish position in PSFE over the last 23 quarters.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3sikxxddb9771.png?width=1488&amp;format=png&amp;auto=webp&amp;s=2d8f31ddc98a3d67c5382a1f1f037721c153ab9c\n\n&amp;#x200B;\n\nNow let's have a look at the top institutional owners for ***Paysafe.*** As you can see from the image below, majority of these companies are hedge funds &amp; private equity firms.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/56tuu33fb9771.png?width=2014&amp;format=png&amp;auto=webp&amp;s=405acc6be38c57c06cd0ead027d9e5b5bbc735fd\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Price targets as per Wall Street Analysts -**\n\nAs per **Marketbeat.com** \\- 7 Wall Street analysts have issued ratings and price targets for Paysafe in the last 12 months. Their average **twelve-month price target is $17.29**, predicting that the stock has a possible **upside of 54.75%**. The high price target for **PSFE is $19.00** and the **low price target for PSFE is $15.00**.\n\nEven if the company is able to hit a price target of 15$ in the coming weeks, that's a possible of upside of at least **35.13%** based on the current stock price at the time of this DD **($11.10).**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h0gvtcagb9771.png?width=2618&amp;format=png&amp;auto=webp&amp;s=8918ba1554d2dd1e911f0b524b062f32f90c577f\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**If company is so good, why did it fall 23% in the last 6 months?**\n\nAs all of you may know, the special purpose companies were hot and trending back in early 2021 and most of the companies were overpriced. If you look at the price history of all the special purpose post merger price, then you'll notice that most of them fell quite significantly. \n\n&amp;#x200B;\n\n**Why paysafe is a good stock to invests in?**\n\n&amp;#x200B;\n\n* ***Paysafe*** has been delivering what other mergers have failed to deliver i.e **Revenues &amp; Profits.** Despite the numbers being good after Q1, the stock still fell by 21%. Paysafe got hit by \"Post merger effect'.\n* The drop in price due to \"Post Merger effect\" is a great opportunity for investors to buy the stock and hold it for long term.\n* Paysafe has an amazing opportunity to establish it's monopoly in the iGaming space. Their biggest competitors PayPal &amp; Square are staying out of iGaming space and focusing more on Fintech space. Paysafe currently has agreements with few big companies such as DraftKings, Roblox, Twitch, Caesar's entertainment and many more.\n* When it comes to iGaming space, the risks are relatively small because the disputes are very unlikely. People depositing money into their roblox accounts or draft kings are not entitled to refunds and same applies to twitch donations.\n* As per nasdaq.com, the company is expected to **exceed $103 billion in transactions** this year and the company forecasts that iGaming in the United States will grow at a compound annual growth rate (CAGR) of **52% through 2025.**\n* The company’s products are currently not as widely accepted as PayPal or Square, however, they plan on expanding in the coming years.\n* As per nasdaq.com, The U.S. online gambling industry is expected to grow at a CAGR of 15.4% between last year and fiscal year 2025 and ***Paysafe*** has relationship with almost all top online gambling operators in the U.S.\n* The company has expanded partnership with **Coinbase** and the company’s payment solution is in about 27  sites and exchanges. As investing and trading activity grows in the near future, Paysafe is well positioned to benefit.\n* If you look at the Q1, the fundamentals were quite strong, company reported revenue of $377.4 million, which was higher by 5% on a year-on-year basis. The company's adjusted EBITDA was $113.2 million, which implies an EBITDA margin of 30%.\n* The company absolutely destroyed the expectations when it comes to e-cash solutions segment, adjusted EBITDA for that segment was 110% higher and reported $48.1 million. The company reported revenue growth of 63% \\~ $112.9 million.\n* As per nasdaq.com, the e-cash segment has an EBITDA margin of 42.6% as compared to the company level EBITDA margin of 30%. With strong growth in the e-cash segment, it’s likely that EBITDA margin will expand in the coming quarters. As a matter of fact, Paysafe has guided for an adjusted EBITDA margin of 32% for FY2021\n* Between FY2020 and FY2023, the company is targeting annual growth revenue of about \\~10%. Ecash segment is the margin driver for this company and the guidance seems realistic because of potential growth in the U.S online gambling sector.\n* If there is a synergy, Paysafe could also merge with other online payment companies in order to grow. The company is currently sitting at $274 million in cash and $225 million in un-drawn credit facility.\n* According to [nasdaq.com](https://www.nasdaq.com/articles/paysafe-stock-has-significant-upside-from-current-levels-2021-05-25), Paysafe reported operating cash flow of $48.7 million in Q1. This would imply an annualized OCF of $195 million. With likely EBITDA margin expansion in the coming years, the company is positioned for healthy cash flow growth.\n\n&amp;#x200B;\n\n**What is the future of iGaming and online transactions?**\n\nThere is no brainer in this question. The iGaming space and etransactions will keep exceeding in the near future. Many countries currently use cash for transactions, but as technology advances, third world countries are expected to go cashless and follow digital payments. As per the article from [Juniper Research Ltd](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/digital-wallet-spend-to-exceed-10-trillion-in-2025-study-says-62265421), the digital world is projected to exceed $10 Trillion in 2025. This is an 83% increase from 2020. The research also found that contactless and e-commerce payments will increase to 50% of total wallet spend in 2025 from less than 36% in 2020. More than 34% of mobile handsets are also seen to use contactless payments in 2025, up from 11% in 2020. Even a 2 year old baby would know that Paysafe is expected to benefit from this growth.\n\n&amp;#x200B;\n\nStock price during after the merger,\n\nAs you can see from the graph below, the Paysafe stock rocketed right after the merger announcement and shot up to as high as 20$/piece. What happened next should not shock the world because most of the stocks fell off post merger. BUT what makes this stock unique is the fact that they've been able to pull off revenues and profits and were able to provide better guidance for the future.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/17gidxphb9771.png?width=1246&amp;format=png&amp;auto=webp&amp;s=3168b735089faa98e3a64f54b285962dc50b4280\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Now, let's talk about Financials of Q1\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bo9915wib9771.png?width=2192&amp;format=png&amp;auto=webp&amp;s=a251bb4bba8c3f70f4a34479af0ef792424a6995\n\n&amp;#x200B;\n\nTotal revenue for the first quarter of 2021 was $377.4 million, an increase of 5%, compared to $359.7 million in the prior year. However, gross profit was a bit low compared to 2020.\n\nNet loss for the first quarter was $49.1 million, compared to $51.1 million, in the prior year. The company mentioned in the presentation that Net loss included interest expense of $58.5 million, an increase of 53% compared to the prior year, reflecting the expense of capitalized debt fees as a result of debt repayment on March 31, 2021. Net loss also included share-based compensation of $72.4 million, compared to none in the prior year due to shares vested on completion of the Transaction.\n\nAdjusted EBITDA for the first quarter was $113.2 million, compared to $112.8 million in the prior year. Adjusted EBITDA margin decreased approximately 140 basis points to 30.0%, but they expect this basis point to go up in the near future.\n\n&amp;#x200B;\n\n# Now let's have a look at the segment growth\n\nLike I mentioned earlier, the company absolutely destroyed their growth in ecash solutions and reported an increase in revenue by 63%.\n\n***Integrated Processing -*** Revenue for the first quarter was $176.9 million, a decrease of 5%, compared to $186.2 million in the prior year\n\n***Digital Wallet -*** Revenue for the first quarter was $94.9 million, a decrease of 13%, compared to $108.5 million in the prior year.\n\n***eCash Solutions -*** Revenue for the first quarter was $112.9 million, an increase of 63%, compared to $69.1 million in the prior year\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/j3h676hkb9771.png?width=2208&amp;format=png&amp;auto=webp&amp;s=ce699a7b0f8a0776412a20844a57c1b1360859f7\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# HIGHER 2021 guidance\n\nThe company reported higher 2021 guidance and are expected to achieve their goals due to increase number of online transactions and growth in iGaming space.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/tnky0thlb9771.png?width=1890&amp;format=png&amp;auto=webp&amp;s=5d300d17905ae23805e5fa2b64bad75105541033\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**TLDR -**\n\n* **The company is expected to achieve their 2021 guidance.**\n* **No competition for Paysafe in iGaming space.**\n* **The stock fell down in the past few months due to \"Post Merger fatigue\"**\n* **One of the few merger companies who actually brings in Revenue &amp; Profits**\n* **Currently close to 52 week low and a nice opportunity to grab at this current price**\n\n&amp;#x200B;\n\n**Positions -**\n\n**180 share at 11.14$ each**\n\n**45x calls with strike price 12.5$ expiring 7/16.**",
        "subreddit": "wallstreetbets",
        "title": "$PSFE - A solid play that will power up your wallet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o76zts/psfe_a_solid_play_that_will_power_up_your_wallet/",
        "created": 1624588380.0
    },
    {
        "author": "Pdiddy143",
        "created_utc": 1623238270,
        "id": "nvtjsy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "HOW TF IS THIS SHIT LEGAL?!? Senate passes a tech manufacturing bill to counter China. Numerous senators/ house members purchased semi-conductor stock BEFOREHAND. For example, Nancy Wyden bought $AAPL, $AMAT, $AVGO, $KLAC &amp; $NVDA BEFORE the legislation. https://unusualwhales.com/i_am_the_senate/semi",
        "url": "https://i.redd.it/5rdr8c9978471.jpg",
        "created": 1623267070.0
    }
]