[
    {
        "author": "theepicone111",
        "created_utc": 1637687403,
        "id": "r0hyto",
        "num_comments": 687,
        "num_crossposts": 0,
        "selftext": "Does anything in particular look like a good deal right now? A lot of red, although from ATH in many cases, but some red is starting to look quite attractive to me. \nPersonally I’m looking at DIS, INTC, PYPL, PLTR, BABA, V\n\nWhat have you been buying/eyeing?",
        "subreddit": "stocks",
        "title": "Anything on a good sale right now?",
        "url": "https://www.reddit.com/r/stocks/comments/r0hyto/anything_on_a_good_sale_right_now/",
        "created": 1637716203.0
    },
    {
        "author": "JohnyGhost",
        "created_utc": 1637254820,
        "id": "qwu6tc",
        "num_comments": 277,
        "num_crossposts": 0,
        "selftext": "They have excellent fundamentals and 21B in revenue, hot sector and with sympathies (NVDA, AMD) at all time highs why is this making new lows every day? One would argue that competitors are doing better but every other chip company is doing better. What is going on?",
        "subreddit": "stocks",
        "title": "Why is Intel INTC getting beat down like this?",
        "url": "https://www.reddit.com/r/stocks/comments/qwu6tc/why_is_intel_intc_getting_beat_down_like_this/",
        "created": 1637283620.0
    },
    {
        "author": "chris_ut",
        "created_utc": 1637005466,
        "id": "quomnw",
        "num_comments": 225,
        "num_crossposts": 0,
        "selftext": " \n\n* $PIPP is a SPAC focused on defense, government services or aerospace\n* The team is a who's who of insiders with ties to the Biden administration\n* Increased volume of warrants and call options implies a merger announcement is imminent\n\n$PIPP is the ticker for Pine Island Acquisition Corp. a Special Purpose Acquisition Company (“SPAC”) that IPO’d back in September of 2020. The focus of $PIPP is to find a merger candidate in defense, government service or aerospace. The initial float was 34.5 million units consisting of 1 common and 1/3 of a warrant. Units split on January 6th, 2020 with commons initially trading at $10.12 and warrants at $2.43. $PIPP garnered a lot of attention because of who is on the team and their connections to the current administration.\n\n$PIPP has been nicknamed \"the Biden SPAC\" for its ties to high level administration officials. When you see the team below you will see why.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dw5qny6sbtz71.png?width=187&amp;format=png&amp;auto=webp&amp;s=1bb963201ee16f4c74f3c1748c9dba06a51513ce\n\nThe Chairman of $PIPP is **John Thain**\n\nJohn Thain has a BS from MIT and an MBA from Harvard. He was formerly the CEO of the New York Stock Exchange, the CEO of investment bank Merrill Lynch and the CEO of CIT Group.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y0vt9ditbtz71.png?width=155&amp;format=png&amp;auto=webp&amp;s=9e56f099eed90e04c35955ffda11f7792fa3951f\n\nThe current and former team members include:\n\n**Tony Blinken**\n\nLong time Democratic official and diplomat. He stepped down from the $PIPP team when Biden nominated him to be the next Secretary of State.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/x7dnackubtz71.png?width=166&amp;format=png&amp;auto=webp&amp;s=6358185945a44268636836dc52d778aaf2a529a4\n\n**General Lloyd J. Austin III, Retired**\n\nRetired four-star Army General and previous CENTCOM commander. He stepped down to become the Secretary of Defense.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/tldafv3wbtz71.png?width=142&amp;format=png&amp;auto=webp&amp;s=b6fbc734731d9c83ec87602f9231275764f81f9c\n\n&amp;#x200B;\n\nhttps://preview.redd.it/d1ral94xbtz71.png?width=420&amp;format=png&amp;auto=webp&amp;s=47bd1126cdad8ed23d0927c5dc0150fc87a6db72\n\n*Blinken and Austin are Biden’s right and left hand man*\n\n**U.S. Senator Saxby Chambliss**\n\nFormer 2 term Republican Senator from Georgia and Representative from Georgia who served on the Senate Armed Services Committee\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fp38potzbtz71.png?width=139&amp;format=png&amp;auto=webp&amp;s=124cce11498dc8076e2c2aa6cb188111918bfa27\n\n**U.S. Senator Tom Daschle**\n\nFormer US Air Force Intel Officer; Representative and Senator from South Dakota and Senate Majority Leader.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zxa3qdr0ctz71.png?width=146&amp;format=png&amp;auto=webp&amp;s=ebbb0977b5011a871347026020fe098b97c96f24\n\n**U.S. Senator Byron L. Dorgan**\n\nFormer Senator from the state of North Dakota and Chairman of the Senate Aviation Panel.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q3ig6rb2ctz71.png?width=174&amp;format=png&amp;auto=webp&amp;s=84493371ed67453766401d3aae2fc8a4c54085c5\n\n**Michéle A. Flournoy**\n\nFormer Under Secretary of Defense for Policy under the Obama administration.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jfb4ip33ctz71.png?width=195&amp;format=png&amp;auto=webp&amp;s=03d9984fd6b3d851ef761603f3a2facc6ff1edac\n\n**Representative Richard Gephardt**\n\nFormer House Majority Leader, now lobbyist/consultant for Boeing and Spirit Aerosystems and other aerospace companies.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3ltq78q3ctz71.png?width=174&amp;format=png&amp;auto=webp&amp;s=9078bb51b357fd152691ed22595fef95290fb99b\n\n**Admiral Michael Mullen, Retired**\n\nFormer Chairman of the Joint Chiefs of Staff and Chief of Naval Operations\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nhb2bwc4ctz71.png?width=180&amp;format=png&amp;auto=webp&amp;s=be4f027d3a123a3b4d97549d26b8359f96042f89\n\nThis is a who's who of insider access.\n\nWith these ties some big firms took large positions right off the bat with Citadel holding 7% of the float and Millennium Management taking 5%.\n\n**Investment Thesis:** Any company in this space considering a SPAC would be foolish to pass up a team with strong ties to The Secretary of State and The Secretary of Defense and including former House and Senate Majority leaders, and former Chairman of the Joint Chiefs, Under Secretary of Defense and Senate Aviation Panel. Potential targets are not going to hardball these guys for an inflated valuation as they need to curry favor with these insiders since most of the income in this space comes via government contracts.\n\n$PIPP drew a lot of interest when it originally IPO’d with commons reaching a high of $14.94 and warrants $4. It took a pummeling like many pre-DA SPACs did during the spring when both institutions and retail got burned out on too many crappy SPAC deals coming down the pipeline. Now we see institutional money flowing back into some of the better SPAC deals and retail has followed, causing the better SPACS to see a big run up, most recently $GGPI/Polestar.\n\nWhy $PIPP now? Well this stock has been dead for months and months then suddenly started to pull volume, it was a top 5 ticker for SPAC volume last week. Warrants are up nearly 50% already with large buys rolling in. There has also been a large buying of calls with almost 5,000 Open Interest on the January 10c with 10% of that opened just on Friday. It is my belief based on this movement that a merger target will be announced by the end of the year and based on the team I am willing to bet it will be a good one. Its been 11 months since $PIPP IPOd and the average time from IPO to merger announcement for SPACs also happens to be 11 months so the timing fits.\n\n**Warrants and Why I Like Them**\n\nFor anyone not familiar with SPACs they IPO originally as a unit which is a common share bundled with a warrant or partial warrant. The typical SPAC warrant allows you to buy a common share for up to 5 years post merger for $11.50. They are a bonus sweetener to the funds who buy the SPAC IPO, those funds typically try to sell the commons for a few cents over what they paid post unit split then keep the warrants as a “freebie” of potential upside if the SPAC does well post merger. Anyone can buy these warrants though (except Robinhood users - sorry) and have access to the benefits of what is essentially a 5 year call option that doesn’t suffer theta decay.\n\nThe other benefit of warrants is leverage. If commons are $10 and warrants are $1 and you have $10,000 to invest you can buy 1,000 commons or 10,000 warrants. If commons go to $11 you make a $1,000 or 10% return. Warrants would go to $2 giving you a $10,000 or 100% return. The downside of this higher reward is as always higher risk. If no merger happens SPAC commons can be redeemed but warrants go to 0. I see a very minimal chance of that happening with this SPAC and this team. As stated above I believe a merger announcement is imminent.\n\nDisclaimer: I hold a position in 10,000 $PIPP warrants opened last week.",
        "subreddit": "SPACs",
        "title": "The “Biden SPAC” $PIPP is back on the radar",
        "url": "https://www.reddit.com/r/SPACs/comments/quomnw/the_biden_spac_pipp_is_back_on_the_radar/",
        "created": 1637034266.0
    },
    {
        "author": "Logn3r",
        "created_utc": 1635786252,
        "id": "qkihov",
        "num_comments": 189,
        "num_crossposts": 0,
        "selftext": "[https://imgur.com/bXLI1uA](https://imgur.com/bXLI1uA) \n\n[http://openinsider.com/INTC](http://openinsider.com/INTC)\n\nSome of the directors increased shares owned by over 70%.\n\nSeems like relevant news. I don't know what's going on with their news, but these trades happened 5 days after the decent earnings and the subsequent drop of 10%. Don't know why the stock dropped, but considering they beat analyst expectations by 60+% it seems like an interesting value proposition.",
        "subreddit": "investing",
        "title": "INTC cluster buy by 5/10 directors and CEO",
        "url": "https://www.reddit.com/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/",
        "created": 1635815052.0
    },
    {
        "author": "ThrowRA775203",
        "created_utc": 1636076921,
        "id": "qn0g8c",
        "num_comments": 174,
        "num_crossposts": 0,
        "selftext": "In spirit, not in numbers. Not saying INTC is going to become a 2.5T megacap company like MSFT, but I'll lay it out.\n\nFor those who don't know MSFT was a stagnant stock for many, many years. If you bought MSFT at the peak in 1999, you would not have broken even until 2016. 17 years. But of course the stock broke through big time and is now the most(?) valuable company in the world.\n\nI see a sort of similar trajectory for Intel. Right now, Intel is the chip dinosaur. They have massive revenues, but limited growth. For context, Intel does $20B in revenue per quarter while Nvidia does $20B per year. Apples to oranges as Intel is stagnant while Nvidia is growing rapidly, but it's something to understand.\n\nIntel rested on their laurels, as they had the semiconductor market pretty locked down for a long time.  AMD was a joke of a company, and Nvidia was emerging as the leader in a technology that didn't exist until the last 20 years (GPUs). Intel could just chill, collect oodles of cash, pay their executives a ridiculous amount, and everyone was fat and happy. Until AMD actually started competing. It caught Intel flat footed, and it can be seen in the quality of Intel's products of late. AMD has actually been better than Intel in CPU, and competing with Nvidia in GPU.\n\nBut now, Intel is doing something about it and they have a unique advantage. Vertical integration. Intel does not only make the end product, they actually fabricate the semiconductors. In a chip shortage world with a big US government willing to doll out crazy sums of money, this is a huge deal. Intel is already investing tens of billions of dollars in new semiconductor fab plants, which will help address the largest supply chain issue in modern history.\n\nBeyond this, Intel has just released their desktop CPU chips which beat AMD across the board in performance. While desktop CPUs are a small portion of Intel's business, this shows progress. This along with their expansion plans in semiconductor fabrication, AND a new CEO that has major growth ambition for the company, I see this as one of the best investment opportunities in the market today.\n\nLast point, Intel is trading at a disgustingly cheap 9.8 P/E ratio. The market has not factored in Intel's impending growth, and this makes them a sleeping giant similar in spirit to Microsoft.",
        "subreddit": "stocks",
        "title": "INTC the next MSFT?",
        "url": "https://www.reddit.com/r/stocks/comments/qn0g8c/intc_the_next_msft/",
        "created": 1636105721.0
    },
    {
        "author": "TachyonArray",
        "created_utc": 1636189816,
        "id": "qnwkfx",
        "num_comments": 168,
        "num_crossposts": 0,
        "selftext": "Hi fellow retards, been a fellow lurker for a few years now but decided to post because I recently shifted my stance on $INTC and figured I should get the full smooth-brain experience by getting roasted by my fellow apes.  \n\nI figured Intel was done for ever since they stopped making significant progress on their chip performance and neglected their foundry, and was on the AMD hype-train ever since Ryzen 2 launched. However, a lot has changed on the global stage and on Intel’s strategy which signals a new outlook for Intel in the next year. \n\nFirst of all, Intel has seen the writing on the wall. They have gotten sloppy and greedy for too long and have seen their bottom line and image hit the shitter. In response, they have started hiring the talent they need to get their foundry and R&amp;D back on track. They recently hired [Vineet Goel](https://www.crn.com/news/components-peripherals/intel-hires-top-amd-gpu-architect-to-lead-xe-ip-roadmap) from AMD to work on GPU architecture, and have hired a slew of [veterans and new talent](https://www.anandtech.com/show/16807/intel-continues-to-rehire-veterans-at-some-point-theyll-run-out) as part of their revamping and have finally started to [move in the right direction](https://www.pcworld.com/article/549611/intel-core-i5-12600k-review.html/amp). Intel definitely sees how they’ve lost their edge to AMD and NVIDIA and are making sure they hire the right talent to turn the tide. They also have deeper pockets than AMD and NVIDIA to make sure this happens (34.6B vs just 3.6B and 7.7B respectively). \n\nOn the other hand, the political stage has completely shifted, and China and the US are more than just on bad footing, as the FBI officially note that . [china is “a threat to our economic security—and by extension, to our national security”](https://www.fbi.gov/news/speeches/the-threat-posed-by-the-chinese-government-and-the-chinese-communist-party-to-the-economic-and-national-security-of-the-united-states). As a result, the US government is currently in a race to decouple as quick as possible from china, and no decoupling is more important than that of the chip-manufacturing industry. \n\nThere is only 1, US-based chip manufacturer, and if you’re also smooth brained, you likely know it’s INTEL. Everyone else just designs in the US and manufactures in Asia, which is an issue because the next big player, TSMC is increadibly close to getting rammed by China because china want’s to [take over Taiwan](https://www.usnews.com/news/national-news/articles/2021-11-03/china-clearly-developing-ability-to-invade-taiwan-top-general-says). This leaves the US government as well as the  entire private industry up in the air if and when China invades Taiwan (or even just makes shipping to/from Taiwan harder). \n\nYou know who has deeper pockets than Intel? The DoD and they’ve basically decided that Intel has to be the leader for the sake of the entire private industry and US national security ([see here](https://www.intel.com/content/www/us/en/newsroom/news/intel-wins-us-project-develop-foundry-ecosystem.html#gs.f1t2zi).\n\nIntel will be a big mover going forward because they want to win, the US government needs them to step up their game, and cash is clearly not and will not be an issue. More importantly, Intel is going to be more than just a cpu vendor, they are likely going to be the main foundry for most american chip designers like AMD, Nvidia, Apple and Qualcomm",
        "subreddit": "wallstreetbets",
        "title": "INTC the sleeping giant",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnwkfx/intc_the_sleeping_giant/",
        "created": 1636218616.0
    },
    {
        "author": "OhioBaseball",
        "created_utc": 1637421933,
        "id": "qy7sk6",
        "num_comments": 161,
        "num_crossposts": 0,
        "selftext": "Moore's Law states the amount of transistors on a chip doubles every two years but the cost of production drops by half. This concept was created by Gordon Moore, the co-founder of Intel and has actually held up for decades.\n\nASML designs and manufactures EUV lithography machines, which are extremely high precision machines that put complex designs on incredibly small chips. ASML is the only EUV lithography design and manufacturer in the world. Look up their stock performance and financials if you question these claims.\n\nIntel used to be a top class chip manufacturer but they've struggled with the 7nm chips and their stock has been punished. The simple reason for Intel's shortcomings is they've not been using EUV lithography machines from ASML.\n\nPlan and simple, without EUV lithography, Intel has been handicapping itself for years now and is a big reason they have fallen behind. The last link below notes how their 7nm chip design is now using EUV lithography at the 2 new fab plants they are building for $20B in Arizona. Intel is going to start to catch up.\n\nTLDR: ASML provides the technology to keep Moore's Law alive and Intel hasn't been using it until now. Their depressed, low P/E stock valuation will begin to correct with outperformance as their technology begins to catch-up after major mistakes not using EUV lithography.\n\n[ASML Keeping Moore's Law Alive](https://www.wired.com/story/asml-extreme-ultraviolet-lithography-chips-moores-law/)\n\n[ASML is the Key to Intel's Resurrection Just like TSMC beat Intel](https://semiwiki.com/semiconductor-services/semiconductor-advisors/302806-asml-is-the-key-to-intels-resurrection-just-like-asml-helped-tsmc-beat-intel/)\n\n[Intel 7nm Chip Design to Now Use EUV Lithography](https://www.intel.com/content/www/us/en/newsroom/news/idm-manufacturing-innovation-product-leadership.html#gs.h19m75)",
        "subreddit": "stocks",
        "title": "Intel as a derivative trade on ASML. Intel is finally catching up with Moore's Law",
        "url": "https://www.reddit.com/r/stocks/comments/qy7sk6/intel_as_a_derivative_trade_on_asml_intel_is/",
        "created": 1637450733.0
    },
    {
        "author": "FinancialWhoas",
        "created_utc": 1637170268,
        "id": "qw4dbk",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "TLDR:  I did a bunch of math based on some reasonably good ideas to determine a  selection of stocks worth investing in. Tables of stocks found below.  My diamond hands are so rough on my fleshy...forearms. I can't type anymore.\n\n# Observations/Assumptions\n\nBefore  you jump down my throat, these are simplified observations/assumptions,  not internationally agreed upon mandates from heaven. Okay, now you can  jump down my throat.\n\n* Companies  with strong financials, a competitive advantage, good management, a  sustainable business model, etc. tend to do better than companies  missing one or more of those attributes.\n* For most people it is impossible to time the market\n* Stock prices have all available information priced into them.\n* The markets are relatively efficient over the long-term.\n* [Index funds have been shown to be the most successful stock investing instrument for most people](https://freakonomics.com/podcast/stupidest-money/)\n* [Index  fund returns, such as the S&amp;P 500, are now predominately determined  by a handful of extremely large, mostly tech stocks.](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111)\n* [Most funds do not beat the index over a long period](https://finance.yahoo.com/news/dont-pay-investment-adviser-beat-144400899.html).\n* The cost of stock trades at most firms is now $0.00 (yes, simplified)\n* During times of volatility, companies that had poor financials will likely find it challenging to survive.\n* [Zombie companies](https://finance.yahoo.com/news/zombie-companies-hiding-uncomfortable-truth-183246812.html) are able to survive for longer periods during times of extremely cheap debt.\n* Index funds have these 3 issues that are hard to get around:\n   * You are unable to effectively [Tax-Loss Harvest](https://www.investopedia.com/articles/taxes/08/tax-loss-harvesting.asp)  even though many of the holdings that make up the index would have had  losses, thereby reducing the return compared to directly investing in  that same set of stocks in the same proportions.\n   * You have no control over the holdings within the fund and may be supporting things you don’t want to support.\n   * Due  to the way the index works, any large stock that becomes part of the  index is potentially a huge drag on the index. This happened when Tesla  was going to be added on 12/21/2020, which was announced on 11/16/2020,  forcing funds to buy the stock at the same time driving up the price,  which had already been driven up by people buying the stock knowing it  was then going to get added to the index forcing more people to buy the  stock. If you think it sounds kind of circular, that’s because it is.\n\n# Hypothesis\n\nUsing  industry benchmarking against the best of the best of the best  companies in each industry in order to purchase only the best companies  in equal measure should provide a well-diversified portfolio that over  the long term should be able to beat the S&amp;P 500.\n\n# Experiment 2020\n\n750  largest US stocks were analyzed against their peers in their industry  (Industry details available further down the post). Stocks were given a  score based on their relative percentage compared to the industry index.  For example, each companies’ average ROE of the last 4 years was  compared to this index value with the following type of breakdown:\n\n* ROE &lt; Index ROE = Poor = 1\n* ROE &gt; Index ROE = Moderate = 2\n* ROE &gt; 150% of Index ROE = Great = 3\n\nFor  example, the ROE communication services industry index value used was  10.10%. If a communication services company had a ROE average of 9%,  they would receive a poor rating. If they had a ROE of 10.5% they would  receive a moderate rating. If they had a ROE of 25% they would receive a  great rating.\n\nThis was done for all of the metrics below:\n\n* ROE\n* Revenue Growth %\n* EBITDA %\n* FCF %\n\nThe  relative scores used for each of the metrics was tweaked until there  was a good distribution of results. e.g., if the 150% revenue growth  only found 5 companies with a Great rating, that may need to be  decreased to 125% for a better distribution.\n\nAny stock that received a poor in any of the 4 metrics was eliminated.\n\n[ROE Example](https://preview.redd.it/t7l27u9tu6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=f904309edb170cc8679189ea62f7bbe057646a3d)\n\nROE Example\n\nThat left 53 stocks. EBITDA was then analyzed to see if it was declining, and if so, it too was eliminated.\n\nThis  left 45 stocks. These 45 were reviewed more thoroughly. What did the  company do? What were their competitive advantages? Are they currently  in any lawsuits? Does their debt look out of control? Do I see them  being a long-term sustainable choice? Is their IP about to expire? Has  WSB said it's a buy? Essentially boiling down to: Is there any reason  that I want to exclude them?\n\nThat left 26 across 7 sectors.\n\n[Industries 2020 Experiment Breakdown](https://preview.redd.it/3gurx91wu6081.png?width=366&amp;format=png&amp;auto=webp&amp;s=0e37aa1afdb655721fc83dff4e75867923e48cc1)\n\n**2020 Industry Breakdown**\n\nThese  26 stocks were bought in equal amounts in July 2020, August 2020, and  September 2020. To easily perform time weighted analysis of these stocks  and determine if there was an opportunity cost, 10% of the total  purchase each period was also allocated to VFIAX.\n\n2020 Experiment Results July, August, and September 2020 purchases to 11/16/2021\n\n* **S&amp;P 500** total return reinvested dividends: **49.09%**\n* **My 26 Stock Index** including reinvested dividends: **61.53%**\n\nCan we do it again this year? Should we go bigger? Yes.\n\n# Experiment 2021\n\n2,850  tickers of the largest US stocks were identified as the initial list.  The stocks had their last 5 years averaged for each of nine metrics:\n\n* Revenue Growth % - shows growth rate of the company\n* Profit Margin – shows how effective the business is at making money\n* Operating Margin – shows how much money the company earns on its revenue\n* FCF Margin – shows how efficient a company is with their cash\n* EBITDA Margin – shows a companies’ operating profitability\n* ROE – shows how well management balances profits, leverage, and assets to make money\n* ROA – shows how effectively a company utilizes its assets to generate profits\n* ROIC – shows how effective the company is at using its money to generate returns\n* Debt/Equity Ratio – shows the financial stability of a company\n\nMore  metrics were used due to the increased data set. These stocks were then  grouped by industry, and the average of the averages is taken to  determine the industry average for the last 5 years; I switched to  median based on a few outliers really throwing the average for some of  the metrics. If that was confusing, here is an example:\n\n·  3 stocks that make up an industry averaged -10%, 15%, and 20% ROE over  the last 5 years. The median over the last 5 years for that industry is  then 15% and all 3 of those stocks will be compared to that benchmark.\n\nEach  stock was compared against its Industry benchmark for each of the  metrics and given a score 1=Poor, 2=Good, 3=Great as well as a composite  score out of 27, from 9 metrics with a max score of 3 in each of the  metrics. The scores are based on how much better they are then the  average. I measured them against the benchmark using the same  methodology as previously performed: Poor &lt; 100%, Good &lt; 150%,  Great &gt; 150%. Again, these may be tweaked slightly depending on the  particular metric to find a useful distribution.\n\nI  also ranked every stock against the entire list for each of the metrics  and overall. For those wondering, the best stock in this ranking was  CORT with a score of 2,097 and the worst TICKER THAT SHALL NOT BE NAMED (evidently a stock that cannot be named because I was banned the first time I posted this) with a score of  23,095. Because the overall rank is a combination of 9 categories with  values ranging from 1-2791, the theoretical best a company could do  would be 9 and the theoretical worst a company could do would be 25,119.  Anyone wondering why the number of stocks doesn’t match the original  input (congratulations on your reading comprehension), this is primarily  due to mergers/acquisitions or the stock being taken private. Another  stock was acquired during the analysis, changing the max number yet  again.\n\nHere is an example showing Aerospace &amp; Defense scoring:\n\n[Aerospace &amp; Defense scoring](https://preview.redd.it/5r8i1qb0v6081.png?width=615&amp;format=png&amp;auto=webp&amp;s=947be14d943204b8211c0933e9c1f1a41d4a1986)\n\nHere is an example showing growth scoring (the Revenue Growth column is the company’s most recent year):\n\n[Growth Scoring](https://preview.redd.it/a2nq8c1av6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=c1f79a62b587bf6f1530f5beefda1b174b5d7d43)\n\nHere is an example of the visualizations for the data:\n\n[Data Visualization Example](https://preview.redd.it/5d41vcvdv6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=26567d730e1d668ccef856a18497fab38345577b)\n\nI  applied a series of filters to eliminated unwanted noise. I looked at  the top 5 stocks per industry (extending out for any ties), any stock  that scored a 25, 26, or 27 on the composite, or any stock that had a  high enough overall rank to justify being reviewed.\n\nNext,  I read the description of \\~300 stocks and looked through their  financials for any inconsistencies, such as one huge year throwing off  their average, profit margins higher than operating margins, highly  leveraged companies with poor growth, etc. My favorite find was that  Chemed Corporation provides hospice/palliative care and owns  Roto-Rooter. Yes, I did end up keeping them (how could you not?), no  there are not great synergies between the sectors of the business, yes,  they are aware of this. I also eliminated industries I wasn’t interested  in reviewing, such as REITS due to the need to look at different  metrics like FFO, Oil and Gas because it’s oil and gas, etc. These  activities eliminated \\~150. I would like to get back to REITs, but I’d  need to build a separate model.\n\nI  then looked at each stock in more detail compared to its peers that made  the cut. Are all the rest of them in the double digits for growth, are  the profit margins substantially less, which one is in a better debt  situation, did WSB say it's a buy, etc. Who deserves to be on this list?  This eliminated \\~75.\n\nWe were down  to 84 stocks at this point. I then looked at each company's investor  presentation, annual report, etc. to better understand what the company  does, their revenue model, risks, etc. I was not nearly as thorough on  this portion this year compared to last year just due to the substantial  increase in companies, 26 vs 84. My hourly wage at McDonald was going  to be better than my returns from the analysis if I took too long. I  only eliminated 1 company which left us at the grand total of 83  companies across 31 industries. Breakdown below:\n\n[Industry Breakdown](https://preview.redd.it/0bmcwyuiv6081.png?width=390&amp;format=png&amp;auto=webp&amp;s=0df395664265ef942ff736c889108711216e76ed)\n\nI then purchased all of these in equal proportion in April, May, and July of 2021.\n\n2021 Experiment Results April, May, and July 2021 purchases to 11/16/2021:\n\n* **S&amp;P 500** total return including reinvested dividends: **11.93%**\n* **My 2021 Stock Index** including reinvested dividends: **14.26%**\n\n# Industry Classification\n\n* For Experiment 2020, the Sector was used to determine how companies should be compared.\n   * This is made up of 11 sectors such as Information Technology, Communication Services, Utilities, etc.\n   * This  seemed to be too restrictive and compared companies against each other  that aren’t really accurate comparisons. See the example on ROE below.\n* For Experiment 2021 I used the Microsoft Excel Stock function to pull industries for all the stocks.\n   * This looks like it pulls data mostly from Industry and Sub-industry.\n   * This was successful on 98% of the stocks and for the final 2% I manually classified based on the taxonomy in the [Global Industry Classification Standard](https://en.wikipedia.org/wiki/Global_Industry_Classification_Standard).\n   * I  ended up needing to collapse the structure a little further. Originally  there were 55 classes with many of the classes having less than 10  stocks. I was able to collapse this to 44 classes. This will likely be  tweaked a little further next year as I had mathematical issues dealing  with averages/medians that were negative. There were also just too many  categories with similar enough results that they could be combined such  as biotech and pharmaceutical.\n\n# 2020 Stocks\n\nABMD\n\nADBE\n\nANET\n\nBWXT\n\nCRL\n\nDG\n\nENR\n\nETSY\n\nEXEL\n\nICLR\n\nISRG\n\nKLAC\n\nLKQ\n\nLRCX\n\nMNST\n\nMPWR\n\nMTCH\n\nOLED\n\nPAYC\n\nPHM\n\nTER\n\nTTD\n\nUI\n\nVEEV\n\nVMW\n\nVRTX\n\n# 2021 Stocks\n\nAAON\n\nAAPL\n\nACN\n\nADBE\n\nAEIS\n\nALGN\n\nAMAT\n\nANET\n\nAPH\n\nATR\n\nATVI\n\nAX\n\nBLD\n\nCDNS\n\nCGNX\n\nCHD\n\nCHE\n\nCORT\n\nCPRT\n\nDLB\n\nDORM\n\nEPAM\n\nESNT\n\nETSY\n\nEW\n\nEXPD\n\nEXPO\n\nFAST\n\nFB\n\nFIX\n\nFOXF\n\nFTNT\n\nGGG\n\nGOOG\n\nGRMN\n\nHEI.A\n\nHELE\n\nIDA\n\nINS\n\nINTC\n\nINTU\n\nIRBT\n\nISRG\n\nCCSI\n\nZD\n\nKLAC\n\nLRCX\n\nLULU\n\nMASI\n\nMED\n\nMKSI\n\nMKTX\n\nMNST\n\nMORN\n\nMPWR\n\nMSFT\n\nNMIH\n\nNRC\n\nNVDA\n\nODFL\n\nOLED\n\nOLLI\n\nPAYC\n\nPAYX\n\nPRLB\n\nQLYS\n\nREGN\n\nRMR\n\nROAD\n\nSCCO\n\nSFBS\n\nSLP\n\nSTMP\n\nTDY\n\nTER\n\nTREX\n\nTROW\n\nTTD\n\nTYL\n\nUI\n\nV\n\nVEEV\n\nVRTX\n\nWAL\n\nYETI\n\n# Notes\n\nI  partnered up for both the 2020 and 2021 experiments. This was critical  for both expanding my initial idea, brainstorming methods to build the  model, and reviewing the work done for errors. This was a team effort,  and I by no means deserve all the credit or hate.\n\nAll returns are showing reinvested dividends in the total return.\n\n\\*I  am not a financial advisor or anything else I should put here to ensure  it is clear that I did this for myself and am sharing my results and am  in no way forcing you to push buttons to buy things you don’t  understand or requiring justification for this run on sentence and  henceforth.\n\n\\*\\*\\*\\*. Past results are no guarantee of future returns.",
        "subreddit": "wallstreetbets",
        "title": "One Word For You: I Bet I Can Beat the S&amp;P 500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qw4dbk/one_word_for_you_i_bet_i_can_beat_the_sp_500/",
        "created": 1637199068.0
    },
    {
        "author": "FoodCooker62",
        "created_utc": 1636036094,
        "id": "qmlsv5",
        "num_comments": 133,
        "num_crossposts": 0,
        "selftext": "This is not some doomer post shitting on your gains. All of you who have been buying these stocks, great job, these have been tremendous gains and I hope you get to keep your winnings. But it's time to be real about these companies and the SPY in general. For Tesla+Nvidia,  their combined quarterly revenue isn't even a third of Google's and their quarterly profit isn't even 25% of Google's. Yet they're at the same valuation. And I'd argue Google is also very, very richly valued. \n\nnVidia's P/E is 100. One day the music will stop. For those wondering, look at what happened to Intel and Cisco in 2000. Twenty years later, their revenues have more than tripled and their profits have increased even more, all while buying back millions of shares. Large institutions won't be the ones holding the bag, please be careful. You may be holding these bags for years to come. \n\nGood luck.",
        "subreddit": "stocks",
        "title": "nVidia and Tesla combined are now worth more than Google",
        "url": "https://www.reddit.com/r/stocks/comments/qmlsv5/nvidia_and_tesla_combined_are_now_worth_more_than/",
        "created": 1636064894.0
    },
    {
        "author": "Grimtongues",
        "created_utc": 1637194974,
        "id": "qwczt5",
        "num_comments": 128,
        "num_crossposts": 0,
        "selftext": "Senate Amendment 4722: five subsidized microchip companies currently receiving $6 billion (deficit spending) can bring 150,000 jobs back to America from overseas for $53 billion to be paid in 2022. In exchange, these companies issue stock warrants worth that amount plus interest.\n\nThe specific companies receiving the $53 billion of taxpayer subsidies are Intel, Texas Instruments, Micron, Analog Devices, and NVIDIA.",
        "subreddit": "stocks",
        "title": "Senate Amendment 4722: five subsidized microchip companies can bring 150,000 jobs back to America from overseas for +$53 billion in 2022",
        "url": "https://www.reddit.com/r/stocks/comments/qwczt5/senate_amendment_4722_five_subsidized_microchip/",
        "created": 1637223774.0
    },
    {
        "author": "sharkasauras",
        "created_utc": 1636040524,
        "id": "qmndx2",
        "num_comments": 126,
        "num_crossposts": 0,
        "selftext": "New article from this morning:\n\n[https://arstechnica.com/gadgets/2021/11/intels-alder-lake-big-little-cpu-design-tested-its-a-barn-burner/](https://arstechnica.com/gadgets/2021/11/intels-alder-lake-big-little-cpu-design-tested-its-a-barn-burner/)\n\nSingle thread:  Intel domination throughout.\n\nMultithread:  Intel small lead for on top tier CPUs and massive lead for mid tier.\n\nBasic DD: INTC has been beat low from being dominated in CPU market by AMD and from competition from Apple.  Finally their newest product takes the lead again (vs AMD) and in a big way.  I can see the stock rebounding back up once wall street figures out what these CPU benchmarks mean.\n\nDisclosure: This is not financial advice.  I bought INTC after reading this article because of the the reasons above.",
        "subreddit": "wallstreetbets",
        "title": "Intel's new 12-gen Big.Little processor kicks AMD's ass. INTC to the moon!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/",
        "created": 1636069324.0
    },
    {
        "author": "RenomanUK",
        "created_utc": 1637591047,
        "id": "qzmj56",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "Lots of posts on here about INTEL, and most are bullish, however it has had a huge fall, and it's really not far off its 52 week low ($45)\n\nApparently they are getting their chips back to being competitive with AMD.\n\nAMD is over 100% up, over it's 52 week low, and touching it's highs...\n\nWHO is expecting INTC to fall through its 52 week low, and where is it's support level, is there one, even yet?\n\nAre their still skeletons in the cupboard to worry about with INTC...?\n\nI am NOT holding any INTC or AMD...yet..\n\nTIA",
        "subreddit": "stocks",
        "title": "INTEL (INTC)",
        "url": "https://www.reddit.com/r/stocks/comments/qzmj56/intel_intc/",
        "created": 1637619847.0
    },
    {
        "author": "AdamovicM",
        "created_utc": 1636363263,
        "id": "qp9yug",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "Samsung  \n\\- planned investments for non memory chips up to $151B throughout 2030  \n\\- factory to be completed in Pyeongtaek, target second half 2022  \n\\- pending this year start of US chip plant\n\n[https://www.reuters.com/technology/samsung-raises-non-memory-chip-investment-target-skorea-announces-bigger-tax-2021-05-13/](https://www.reuters.com/technology/samsung-raises-non-memory-chip-investment-target-skorea-announces-bigger-tax-2021-05-13/)\n\nTSMC   \n\\- building factory in Arizona  \n\\- increasing capacity in Taiwan  \n\\- 100B investment over 3 years  \n[https://www.reuters.com/article/us-tsmc-investment-plan-idUSKBN2BO3ZJ](https://www.reuters.com/article/us-tsmc-investment-plan-idUSKBN2BO3ZJ)\n\n&amp;#x200B;\n\nIntel  \n\\- investing 600M to increase Israel capacity  \n\\- up to 80B in EU  \n\\- 20B investments in Arizona factory\n\n[https://www.reuters.com/business/autos-transportation/intel-says-it-will-reserve-ireland-chip-factory-capacity-automakers-2021-09-07/](https://www.reuters.com/business/autos-transportation/intel-says-it-will-reserve-ireland-chip-factory-capacity-automakers-2021-09-07/)\n\n[https://www.reuters.com/world/asia-pacific/intel-doubles-down-chip-manufacturing-plans-20-billion-new-arizona-sites-2021-03-23/](https://www.reuters.com/world/asia-pacific/intel-doubles-down-chip-manufacturing-plans-20-billion-new-arizona-sites-2021-03-23/)\n\n\\--- \n\nMy opinions: \n\nIt looks like Samsung is moving slowly here, but TSMC and Intel much faster. \n\nActually, no one can make accurate predictions: [https://www.zdnet.com/article/heres-why-the-chip-industry-gets-into-trouble-predicting-the-future/](https://www.zdnet.com/article/heres-why-the-chip-industry-gets-into-trouble-predicting-the-future/)\n\nSimply speaking, cars demand more and more chips, TV sets, cloud datacenters, Playstation 5 and Xbox series X are in high demand.\n\nSmartphone buyers expect more from their phones, therefore, fewer chips per wafer -&gt; more capacity needed.\n\nThe major problem is that in the future, we might see production overcapacity, and then price wars. \n\nSome opinions?",
        "subreddit": "stocks",
        "title": "Chip industry investments: TSMC vs Samsung vs Intel",
        "url": "https://www.reddit.com/r/stocks/comments/qp9yug/chip_industry_investments_tsmc_vs_samsung_vs_intel/",
        "created": 1636392063.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "created_utc": 1637286548,
        "id": "qx59wj",
        "num_comments": 107,
        "num_crossposts": 0,
        "selftext": "https://www.cnet.com/features/intels-chip-recovery-plan-could-restore-us-manufacturing-prowess/\n\n&gt;The chipmaker's come-from-behind strategy is risky and will take years, even with government subsidies.\n\n&gt;First Look at Intel’s Next-Gen Meteor Lake CPUs, Sapphire Rapids Xeons &amp; Ponte Vecchio GPUs Fresh Out of Arizona’s Fab 42\n\nSummary of products and charts: https://wccftech.com/first-look-at-intel-next-gen-meteor-lake-cpus-sapphire-rapids-xeons-ponte-vecchio-gpus-fresh-out-of-arizonas-fab-42/",
        "subreddit": "stocks",
        "title": "Intel's chip recovery plan could restore US manufacturing prowess - Cnet exclusive.",
        "url": "https://www.reddit.com/r/stocks/comments/qx59wj/intels_chip_recovery_plan_could_restore_us/",
        "created": 1637315348.0
    },
    {
        "author": "BuyingFD",
        "created_utc": 1637129437,
        "id": "qvspcz",
        "num_comments": 106,
        "num_crossposts": 0,
        "selftext": "During a chip rush (due to EV, mining, metaverse), what are the relevant chip suppliers companies?\n\nI know TSM is a big one but they are a Taiwan company. I'm looking for a US one. I know Intel and Qorvo have their own in house fab and as an IC designer I had my designs fab at Qorvo and Global Foundries too. But which companies are the main suppliers for this chip rush?",
        "subreddit": "stocks",
        "title": "During a gold rush, sell shovels",
        "url": "https://www.reddit.com/r/stocks/comments/qvspcz/during_a_gold_rush_sell_shovels/",
        "created": 1637158237.0
    },
    {
        "author": "the_TIGEEER",
        "created_utc": 1637026555,
        "id": "quw2ei",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "I am super bullish on intel. I know AMD caught up to them but Still their sales are solid and the new rumored chips should outperform AMD. The new CEO seems like the right man for the job. All other chip makers have blasted off while intel's laging behind. Why so? With the new CEO just getting the hang of things I really am super bullish on Intel. I would love to hear why I might be wrong tho...",
        "subreddit": "stocks",
        "title": "Why is no one talking about intel? Im siper bullish on intel I'm thinking of adding shares to my position.",
        "url": "https://www.reddit.com/r/stocks/comments/quw2ei/why_is_no_one_talking_about_intel_im_siper/",
        "created": 1637055355.0
    },
    {
        "author": "remiskai",
        "created_utc": 1636515089,
        "id": "qql2m0",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "AMD and Nvidia stocks are going to the moon recently and while I am also bullish on AMD (it was the first stock I ever bought, back in 2018 at 12$) I think everyone is overlooking Intel. I know last few years they were struggling and they are still stuck on their 10nm process but the 12th gen CPU's finally started competing with ryzen, and I think they are getting back on track.\n\nAnd their valuation compared to AMD and Nvidia seems like a bargain\n\nhttps://preview.redd.it/bmlr8z3ztoy71.png?width=1148&amp;format=png&amp;auto=webp&amp;s=ef00ed9370d5ac60100d5c0e4321c735256b4d0f\n\nhttps://preview.redd.it/hb8ph64ztoy71.png?width=1138&amp;format=png&amp;auto=webp&amp;s=43d3b83c01b4f656c01967ddb24fa6dcda814293\n\nhttps://preview.redd.it/zalkfn4ztoy71.png?width=1144&amp;format=png&amp;auto=webp&amp;s=20433bbe514471d2a6ac2ed143661acea3f9adcf",
        "subreddit": "wallstreetbets",
        "title": "Bullish on Intel $INTC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qql2m0/bullish_on_intel_intc/",
        "created": 1636543889.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "created_utc": 1636049044,
        "id": "qmqlm5",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Nvidia is up because there will be increased demand for Gpu's and chip companies. INTC is releasing competing GPU's in Q1 2022 and doest have a 110 P/E (only 9.7 P/E). Seems like exposure with less downside risk.",
        "url": "https://www.benzinga.com/news/21/11/23895603/why-nvidia-shares-are-rising",
        "created": 1636077844.0
    },
    {
        "author": "iyioi",
        "created_utc": 1636123535,
        "id": "qncoqj",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "TLDR; \n\nLOOK AT THIS PHOTOGRAPH \n\nhttps://i.imgur.com/sTqv4X0.jpg\n\nhttps://i.imgur.com/fXxk2bZ.jpg\n\nhttps://i.imgur.com/bAnq63s.jpg\n\nThey officially caught up and surpassed AMD. THEY’RE BACK IN THE GAME BOIS. \n\nSource- https://youtu.be/-EogHCFd7w0\n\nIn with 50 shares and 20 $56c 12/3 contracts. \nRight now that contract is $23. Can you believe it?\n\nThat’s all the DD you get you fucks. This shit is on a MAJOR discount right now. Climb aboard.",
        "subreddit": "wallstreetbets",
        "title": "INTC (yes you heard right, INTEL) DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qncoqj/intc_yes_you_heard_right_intel_dd/",
        "created": 1636152335.0
    },
    {
        "author": "mutdan14",
        "created_utc": 1637926678,
        "id": "r2l9n8",
        "num_comments": 85,
        "num_crossposts": 0,
        "selftext": "I have noticed that most people on here are very bullish towards Nvidia even at its current valuation but I haven't seen much talk about how Intel's return to the GPU market will affect Nvidia's valuation and future growth.\n\nIntel has the money and talent especially with Raja Koduri leading the Graphics department to become highly competitive with Nvidia if not a leader in the market. Intel will also have the advantage of using their new fabs in the future to produce their GPU's whereas Nvidia will be reliant on TSMC/Samsung.\n\nWith AMD also becoming more competitive and both Intel and AMD not being as limited to just the GPU market unlike Nvidia, should people be worried that Nvidia may have to lower profit margins and suffer from lower growth that could make their current price look extremely high?\n\nFor disclosure I do own some INTC and would be interested in NVDA if the valuation was more reasonable.",
        "subreddit": "stocks",
        "title": "Is the impact of Intel returning to the GPU market on Nvidia being underestimated?",
        "url": "https://www.reddit.com/r/stocks/comments/r2l9n8/is_the_impact_of_intel_returning_to_the_gpu/",
        "created": 1637955478.0
    },
    {
        "author": "daftstar",
        "created_utc": 1636144177,
        "id": "qnjx4h",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "Hokay friends and ghouls, \n\nI see a lot of you dumping on INTC. It's a value trap, it's garbage, they missed the boat, they're dependent on TSM, they're a bunch of boomers. Fine. All that's true, but when was all that ever NOT true? And despite them missing the boat all over the place, I'd like to show you all something. \n\n**When in doubt zoom out.** \n\nLet's take a trip down crayon avenue.\n\n[Mmm.... that support line. ](https://preview.redd.it/79ityv404ux71.png?width=2900&amp;format=png&amp;auto=webp&amp;s=ffb4644f3f76c4836376878a3c87dcc38d61f0ad)\n\nThe big chart, that's Intel's price history since 2011. \n\nLet's look at the red line that slopes upwards. Beginning November 19th, of 2012 and all the way to October 25th, 2021, INTC's tested its support 11-15 times (depending on what you count as testing and re-testing). Either way, every single time it's tested that support line, it's found its way back to life. EVERY TIME. \n\nMost recently, spring of 2020 when COVID-19 reared its disgusting head. \n\nAfter that, October of 2020 when COVID-19 was making another appearance with Delta. \n\nAnd most recently October of 2021 when INTC had a bit of a negative earnings surprise. \n\nAll the while, $AMD's been making sweet love to the call holders out there. But you know what, AMD can only hang out with you for so long. Money's gotta go somewhere. How about NVDA? Yep, that's was a money maker galore. But it too's gone parabolic. Where else to put those sweet semi tendies? \n\nWell, seems like a lot of the big money is putting that money into INTC. \n\nWhy? Well, take a look at the rebound off the support line. \n\n&amp;#x200B;\n\n[INTC money flow has been trending downwards, except for the past week. Money flow is going back into the stock. Will it get crazy good? I'm not a fortune teller, but these charts are my tarot cards and they're looking pretty good. ](https://preview.redd.it/h70mv75o5ux71.png?width=2860&amp;format=png&amp;auto=webp&amp;s=551642db068ffdcc22d840c1fcefde65120b0ddc)\n\nI'm not going to share any other crayons than this. \n\nYou can draw your own Fib retracements from April 12th @ $68 - Oct 28th @ $47 and you'll see something like this: The levels are pristine. If INTC is truly going to rebound off the support line like its done since 2011...then things are going to look pretty good over the next couple months. \n\n[Dammit... I drew the fib. ](https://preview.redd.it/81db3f696ux71.png?width=2870&amp;format=png&amp;auto=webp&amp;s=37d239e93adcb3aca54f0a7d2fe9918d4a026174)\n\nPositions: Boomer style. \n\n&amp;#x200B;\n\n[It doesn't matter how little I have. One day I'll get this portfolio to Buick bliss. ](https://preview.redd.it/zr7j3ogp6ux71.png?width=970&amp;format=png&amp;auto=webp&amp;s=9d58adb3eea547c604cc299f4b635fee32f2a4f6)\n\n&amp;#x200B;\n\n**TL;DR: INTC long and strong like Donkey Kong.** \n\n&amp;#x200B;\n\nP.S. Yes I get that INTC is ultra reliant on TSM. But guess what...those peeps are just as range bound but without any of the technical crayon momentum.",
        "subreddit": "wallstreetbets",
        "title": "When in doubt, zoom out: INTC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnjx4h/when_in_doubt_zoom_out_intc/",
        "created": 1636172977.0
    },
    {
        "author": "Last_Interview_4332",
        "created_utc": 1636439651,
        "id": "qpxq94",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": "**BULL CASES**\n\n/1. INTC is the only real US chip manufacturer that can reasonably compete with Korean Samsung and Taiwanese TSMC (-100 credit score for acknowledging Taiwan). It is getting lots of literal boat load of cash(probs something like $50B equivalent) from the government that is positive for the shareholders, while maintaining the buybacks and dividends.\nYes, TSMC and others are also hedging and gonna start making some chips in USA but realistically the gubment will give most of the cash to INTC.\n\n/2. US gubment is in a cold war with China, this means it's also a technological warfare. This means supercomputers, missile, Starlink chips(private company) etc and Intel is likely going to be one of the prime suppliers of this boom in tech investment.\n\n/3. TSMC and Samsung are pretty much bottlenecked. Apple, AMD, NVIDIA, Qualcomm, Mediatech, Broadcom, various carmakers, electronics manufacturers etc and not to mention Intel themselves are a big buyer. Specifically, Intel and Apple has bought out all capacity of TSMC 3nm(equivalent to Intel's 5 nm probs, I forgot). This means there is an enormous demand that is not being fulfilled and Intel launching their foundry services and already signing deals with Qualcomm, Amazon is a big deal.\n\nFor reference, TSMC's market cap is bigger than 3 Intel (yes, that's a unit I invented). In 2024-2025, you might even see Apple, NVIDIA and the likes fabricating their chips from Intel just to give a big F U to TSMC (who is currently slightly overcharging if the rumours are to be believed).\n\n/4. Intel is launching a GPU. The GPU market is also in a huge bottleneck due to higher demand from gamers and corn miners. Everyone expects that they are likely to sell their GPUs very easily. Think about this for a sec. Intel is just about to become one of the players in this huge GPU market.\nWhich would also make way for their server GPUs and AIs and the likes.\n\n/5. Think 10-15 years from now. Your fridge, doorbell, light, heating system and every ducking thing will have some chips and Intel is likely to remain a dominant player in this market. I think this will be bigger than the current entire semi market as it is. IOT is just getting started.\n\n/6. Intel is one of the forerunner player in AI techs like autonomous vehicles through their various investments(Mobil eye for one) and will likely remain so. I don't know how big this will be in 10 years, but it's likely that Intel will be one of the bigger players in the market like Google (through Waymo), Tesla and NVIDIA.\n\n/7. Intel also recently launched their big little architecture, where it has already became competitively better than AMD especially in gaming with low power consumption and huge power. Not to mention being very power efficient most of the time for using its efficiency cores most of the time. Not that it matters that much, seeing the gamer Steam reports, very few people actually play on the latest of the latest gen. But, that's also something that's worth noting at least. \n\nHowever, the vast majority of pc sales is in just your average boomer laptops and desktops. And they have a good lead there.\n\n*Tips for those wanting to build a high end new pc. Wait for Intel's lineup to be available broadly, high end pc gamers will dump their last gen AMD chips for the Intel one in the second hand market, causing a flooding of cheap AMD CPUs, buy one of them. Source: Did this once.*\n\n/8. One worrying factor is in the server market. Everyone seems to be launching their own server chips and AMD is very competitive and eating away market share. But Intel's management seems to be guiding us towards the right path. If their predictions prove to be right, they are on the right track.\n\n/9. Intel announced that they will launch Angstrom scale CPUs in the future, that's good I guess. They are also working in RISC-V and other CPU architectures.\n\n/10. Pat has an approval rating of 96% in Glassdoor and the employees would recommend others to work in Intel 89% of the time. This is a huge ass jump for both scores from the Bob Swan era. Go to Wayback Machine, you will see. This means a noticeable change has taken place within this huge organisation in such a short time.\n\n/11. Intel stock always seem to have price support at around $50. And it's near that range right now.\n\n/12. Most analysts are bullish on the stock. Comparatively cheap stock in this clown market. Wanna buy a $5.48B gravity powered truck company anyone?\n\n/13. Intel actually has one of the highest talented employee pull who can be expected to deliver. Contrary to popular belief.\n\n**Bear Cases**\n\n/1. This is a boomer stock according to reddit's circejerk. So, it's difficult to convince people that it is actually expected to grow around 11% CAGR just by the current demand circumstances alone by management's conservative estimates for the next few years. This is mega bearish. If the market doesn't care about a stock, no matter what the management do, the stock will not perform.\n\n/2. Intel has repeatedly failed to prove that their foundry division's predictions are reliable. If they went fabless like AMD, it would have probably rocketed already. But a big part of the cheapness of the stock comes from the unreliability of their foundry division. Yes, the management has finally started getting serious about their foundry, but one cannot ignore their past failures.\n\n/3. Government contracts and the likes are not completely free money like some of you believe, delays in delivery and contract fulfillment could make what is essentially a free money glitch to a costly mistake and a billion dollar loss with a brink of an eye. The terms are generally very strict, so Intel has to deliver.\n\n/4. Investments are going to be a lot and semiconductor industry being cyclical means, if Intel fails to deliver, its market share will be eaten away and lose billions in potential profit.\n\n/5. Stock seems to be largely rangebound like Microsoft was for 15 years.\n\n[positions or ban. bought 100 shares for now. will be selling some puts to enter into more. And then around the next earnings, will buy some calls](https://imgur.com/a/xxYyDIE)",
        "subreddit": "stocks",
        "title": "Intel: The second coming of christ",
        "url": "https://www.reddit.com/r/stocks/comments/qpxq94/intel_the_second_coming_of_christ/",
        "created": 1636468451.0
    },
    {
        "author": "Plane-Meat-6697",
        "created_utc": 1636422038,
        "id": "qpsr3h",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "Everyone’s hating on Intel right now and I can’t seem to stop buying it. Amd just won a huge contract with meta and that’s good for them but this doesn’t really change Intels future. I think the hype around amd and nvda is justified with the current meta. But don’t sleep on Intel for the future. How much more can amd and nvda values go up by? Is there more upside in Intel? I want to know what people are seeing these stocks be at in 2023 ? \n\n\n\nIntel is the only US chip maker and I see the new bills being passed a huge positive for Intels future growth and can see them getting a lot of money to expand by 2024.\n\nDon’t come at me too hard amd and nvda lovers I don’t hate either of them.\n\n\nI’m still long 3000 shares Intel.",
        "subreddit": "wallstreetbets",
        "title": "$INTC vs AMD and NVDA?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qpsr3h/intc_vs_amd_and_nvda/",
        "created": 1636450838.0
    },
    {
        "author": "GazBB",
        "created_utc": 1636433010,
        "id": "qpvzy6",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/11/08/amd-shares-jump-after-company-wins-meta-partnership.html\n\nVirtual reality, augmented reality and metaverse. I daresay these are just the starting points to the entrance to a whole new alternate universe.\n\nAMD has partnerships with Microsoft and Sony for gaming console chips and now has signed up Meta (Facebook) as a new customer. We all know what Facebook was planning when it changed name to Meta and AMD is going to benefit tremendously from this partnership.\n\nIt's gradually taking away market share from Intel and soon we will reach a point where Intel might not even be a competitor to AMD. While the need for CPUs is here to stay, most future tech would be based on GPUs, a sector where AMD has a strong footing.\n\nHave a long position in AMD, bought at 135. Would buy more before it hits 200.",
        "subreddit": "investing",
        "title": "AMD is well poised to take over the alternate universe",
        "url": "https://www.reddit.com/r/investing/comments/qpvzy6/amd_is_well_poised_to_take_over_the_alternate/",
        "created": 1636461810.0
    },
    {
        "author": "moldyjellybean",
        "created_utc": 1635858687,
        "id": "ql3vzm",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "I hold no position of INTC long or short just a person who used to reverse engineer this stuff, and then worked in a datacenter for many years.  \n\nThere has been a noticeable amount of INTC posts but non of these delve into their technical shortfalls compared to their competitors AMD NVDA TSM ARM etc\n\nI wrote this many years ago https://old.reddit.com/r/AMD_Stock/comments/9v1n6f/amazon_web_services_aws_pricing_amd_vs_intel/e994dka/\n\nand the gap in technology is even bigger in AMD's favor.  Since 2016 I've been super bullish on AMD at $1.80, cloud computing stocks MSFT AMZN, energy stocks like TSLA etc. \n\nIf you've ever been in a datacenter it consumes a ton of energy and why I think the future of computing is AMD NVDA TSM ARM MSFT AMZN  and energy efficiency stocks.  \n\nINTC lacks this and is falling way behind in tech and design, still far behind and I literally called it years ago almost on the dot.   \n\nOther users have noticed this too\n\nhttps://old.reddit.com/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiwxuit/\n\nMy post pointing out that since 2016 AMD NVDA TSM have been superior in design efficiency and stock price was promptly deleted on that sub.  I reminded them that since 2016 AMD price has increased close to 6800%, NVDA 3400%, TSM 500%, cloud computing has taken off and MSFT is up 600% AMZN 500%.\n\nIntel is gone up maybe 30% in the biggest stock run and semiconductor/cloud computing run.\n\nSo be weary of INTC suggestions.  Not saying you can't make money it is up 30% in 5-6 years but there are way better investments and the opportunity costs of missing out better tech like AMD NVDA TSM MSFT AMZN etc.",
        "subreddit": "wallstreetbets",
        "title": "Be careful of the all the sudden INTC suggestions on the sub Investing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/",
        "created": 1635887487.0
    },
    {
        "author": "TachyonArray",
        "created_utc": 1636795361,
        "id": "qsxnkj",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "Hello again fuckwads, it’s me, the same idiot that can’t stop thinking about Intel. During [my last post](https://www.reddit.com/r/wallstreetbets/comments/qnwkfx/intc_the_sleeping_giant/) about Intel, some people kept downplaying this play because of a lack attention from, well, anything with a heartbeat. However, shortly after my last post, ShitBC seemed to pity my post and their heart also grew three sizes, as they decided post a [special 20 minute report](https://www.cnbc.com/2021/11/06/how-intel-plans-to-catch-up-to-samsung-and-tsmc-with-44-billion-of-new-global-chip-fabs.html) on Intel, sprinkled with hefty dash of hopium. \n\nMoreover, I’ve started to notice some of the bigger finance’tubers also take notice of Intel recently, throwing some more hopium into the meal. I would post some examples, but this subreddit doesn’t allow youtube links for some reason. \n\nAll in all, this could mean nothing, as I’m just a bit high on hopium. Maybe the masses will notice that Intel need not be abhorred; that maybe they’ll realize that $INTC can grow much more…",
        "subreddit": "wallstreetbets",
        "title": "Notice Me, Senpai… $INTC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qsxnkj/notice_me_senpai_intc/",
        "created": 1636824161.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "created_utc": 1637082097,
        "id": "qvcfi7",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "[INTC] Someone is buying December, 03, 2021, call options, strike price $52.5. Over 44.5K traded today and constantly increasing since market open.\n\nNot even monthly options, this is weeklies. Not anything close to this volume on other strikes/weeks.\n\nIs this a broken bot or something. What is the meaning of this type of activity. Is it bullish since they are buying above the market price for premium.",
        "subreddit": "options",
        "title": "[INTC] Someone is buying December, 03, 2021, call options, strike price $52.5. Over 44.5K traded today and constantly increasing since market open.",
        "url": "https://www.reddit.com/r/options/comments/qvcfi7/intc_someone_is_buying_december_03_2021_call/",
        "created": 1637110897.0
    },
    {
        "author": "yardsale2",
        "created_utc": 1635973088,
        "id": "qm42un",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Intel YOLO update. Still holding the LEAPS.",
        "url": "https://i.redd.it/7h2edz152gx71.png",
        "created": 1636001888.0
    },
    {
        "author": "SavienKennedy",
        "created_utc": 1637443573,
        "id": "qyf7fb",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "Good morning fellow apes; I’m here to tell you about Micron Technology and answer a few questions: what is it, why is it trending, and is there a future for it?\n\n&amp;#x200B;\n\n**WHAT IS MU?**\n\n**Micron Technology, Inc. (NASDAQ: MU)** is an American producer of computer memory and computer data storage. This includes DRAM (dynamic random-access memory), flash memory, and USB flash drives. Its consumer products are marketed under the brands Crucial and Ballistix. Micron and Intel together created IM Flash Technologies, which produces NAND flash memory.\n\n&amp;#x200B;\n\n**WHY IS MU TRENDING ON** r/wallstreetbets**?**\n\nEvercore Fundamental Research Analyst C.J. Muse boosted to his firm’s “Top Picks” list last week. He argues that MU could benefit from the “green shoots” he’s seeing in the memory industry.\n\nEven though MU lost 1.3% since the start of June (and competitor Lam has fallen 0.8%, while the Semiconductor index has increased 22.8% in the same time frame), Muse confidently states that “..it is clear that the tides are shifting, with pricing decline expectations into 1HCY22 becoming ‘less bad,’ estimates likely bottoming in 1H22, and green shoots arising from PC constraints elsewhere easing, and hyperscale capex spend likely improving before year end. Thus, we think it is game on for memory.”\n\n“From an investor positioning perspective, we note investors are generally eager to get back into memory for anticipated outperformance in 2022 but are not there today,” Muse wrote. “So when the turn comes, we think it will be fast and furious.”\n\nApart from EverCore, there are other financial analysts who believe MU is poised to take advantage of the future of memory. Citi analyst Christopher Danely notes that the firm's DRAM analyst Peter Lee recently raised his DRAM pricing expectations for Q4 of 2021 and Q1 of 2022, driven mostly by upside from the PC end market, which led the DRAM correction. Channel checks indicate there has been some upside from the PC market for DRAM and demand from the server end market for Q1 of 2022 appears to be better than expected, Danely tells investors in a research note. As such, the analyst expects \"more positive catalysts\" for DRAM in the coming months and initiated a \"positive catalyst watch\" on Buy-rated Micron. He expects the stock to trade higher as investors gain more confidence the DRAM correction \"is drawing to a close.\" Danely keeps a $120 price target on the stock, currently trading just north of $80 a share.  \n \n\nAfter the two above reports became public, the market started to react. MU recently started trending as one of the top 3 most mentioned tickers on r/wallstreetbets, beating out PayPal, Tilray, Amazon, and Aurora.\n\n&amp;#x200B;\n\n**THE FUTURE OF MEMORY AND MU**\n\nThe memory-chip market hit the skids in the second half of 2018 when sales of smartphones, personal computers, servers and other gear slowed. But memory-chip sales rebounded in late 2020.\n\nBoise, Idaho-based Micron makes two main types of memory chips: DRAM and Nand. Dynamic random-access memory, or DRAM, accounted for 74% of Micron's revenue in its fiscal fourth quarter. Nand flash memory accounted for 24% of its revenue during the period.\n\nDRAM chips act as the main memory in PCs, smartphones and other devices, working closely with central processing units. Nand flash provides longer-term data storage.\n\n&amp;#x200B;\n\n**WHAT IS DRAM?**\n\nNormal RAM is a semiconductor that is placed on a processor that stores variables for calculations. RAM provides memory locations for requested data. The CPU receives a data read instruction with the data’s memory address or location, and then it sends the address to the RAM controller.\n\nThe controller, in turn, sends the address to the proper pathway, opening path transistors and reading each capacitor value. The read data is transmitted back to the CPU’s cache.\n\nThe speed of this read/write operation is important to know about. They are called timings: faster timings with less lag between them result in faster access times. Slower timings result in lower performance. Bandwidth also affect performance: the larger the bandwidth, the more data per second RAM can process and the faster the timings.\n\nBasically, if you want the best SSD for your buck, you want to know if you are getting something with fast timings or slow timings.. namely, SRAM or DRAM.\n\n   \n\n* SRAM has lower access time, and is faster whereas DRAM has a higher access time and is slower compared to SRAM.\n* SRAM users transistors and latches while DRAM uses capacitors and very few transistors.\n* L2 and L3 CPU cache units are some general applications of a SRAM while the DRAM is mostly found as the main memory in computers.\n* SRAM offers low packaging density while DRAM offers a high packaging density.\n* SRAM is in the form of on-chip memory, but DRAM has the characteristics of off-chip memory.\n\nIn short, DRAM uses very few transistors, has the characteristics of off chip memory, and is available in larger storage capacity\n\n&amp;#x200B;\n\n**ADVANTAGES OF DRAM**\n\n* Cheaper compared to SRAM.\n* It has a higher storage capacity. Hence it is used to create a larger RAM space system.\n* Offers simple structure.\n* It doesn’t require to refresh the memory contents.\n* You don’t need to refresh the memory contents and its access time is faster.\n* Logic or circuitry is needed, so the memory module itself is simpler.\n\n&amp;#x200B;\n\n**THE SEMICONDUCTOR INDUSTRY**\n\nWorldwide sales of semiconductors in Q3 2021 were $144.8 billion, an increase of 27.6% over Q3 2020 and 7.4% more than Q2 2021, reported by the Semiconductor Industry Association.\n\nJohn Neuffer, SIA president and CEO says “Semiconductor shipments reached all-time highs in the third quarter of 2021, demonstrating both the ongoing high global demand for chips and the industry’s extraordinary efforts to ramp up production to meet that demand.”\n\nGlobal sales for the month of September 2021 were $48.3 billion, an increase of 27.6% over the total from September 2020 and 2.2% more than sales from August 2021.\n\nRegionally, year-to-year sales increased in the Americas 33.5%, Europe 32.3%, Asia Pacific/All Other 27.2%, Japan 24.5%, and China 24.0%.\n\nMonth-to-month sales increased in the Americas 3.9%, Europe 2.0%, Japan 2.0%, Asia Pacific/All Other 1.9%, and China 1.5%.\n\n&amp;#x200B;\n\n**ANALYSIS OF MU – CUP AND HANDLE**\n\nOn Nov. 6, MU started to break out of a cup-with-handle according to IBD MarketSmith charts. A three-weeks-tight pattern in late December offered an add-on buy point at 74.71.\n\nMicron stock has an **IBD Accumulation/Distribution Rating** of B-, indicating modest institutional buying of MU stock.\n\n&amp;#x200B;\n\n[MU Cup and Handle](https://preview.redd.it/at41phf8ht081.png?width=623&amp;format=png&amp;auto=webp&amp;s=74012005729ab7a8ded8e662cc9ff1ce85970c17)\n\nMicron wasn't directly affected by the chip shortage, since it manufactures its own chips instead of outsourcing them to third-party foundries. However, it expects shortages of other PC components -- including CPUs and GPUs -- to indirectly curb the market's near-term demand for its memory chips. That warning, along with a softer-than-expected forecast for the first quarter, spooked investors last month.\n\nDespite these challenges, analysts still expect Micron's revenue and earnings to rise 15% and 44%, respectively, this year, as it benefits from the secular expansion of the gaming, data center, cloud, 5G, and automotive markets. Those catalysts might also spark a \"super cycle\" in memory chip upgrades, which could last much longer than previous cycles and propel Micron's stock to fresh highs.\n\n&amp;#x200B;\n\n**DISCLAIMER**\n\nThis is not financial advice. Do your own DD before investing. My position is 25 x 115c exp 17 Dec\n\n&amp;#x200B;\n\n[My Position in MU](https://preview.redd.it/j3r8voypht081.png?width=1415&amp;format=png&amp;auto=webp&amp;s=45e46a1d377890cf3b357cddf855a7cea3615167)\n\n**PM ME FOR SOURCES.**\n\nMU to the ~~MUn~~ moon!! 🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "What Is Micron Technology (MU) and Why Is It Trending?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qyf7fb/what_is_micron_technology_mu_and_why_is_it/",
        "created": 1637472373.0
    },
    {
        "author": "MatoWakonda",
        "created_utc": 1636270668,
        "id": "qojpp3",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "How Intel plans to catch Samsung and TSMC and regain its dominance in the chip market",
        "url": "https://www.cnbc.com/amp/2021/11/06/how-intel-plans-to-catch-up-to-samsung-and-tsmc-with-44-billion-of-new-global-chip-fabs.html",
        "created": 1636299468.0
    },
    {
        "author": "CommercialHunt9068",
        "created_utc": 1636977961,
        "id": "queyas",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "I see a lot of new investors looking at FCF intrisnic value, profits or innovation. which is all important but one of the most important factors is mostly overlooked.\n\nstrong management is going to be most of ur returns. If the CEO makes bad decisions u will become a bagholder. especialy in market downturns Reits or commodity's.\n\n&amp;#x200B;\n\nThe best Example is Elon Musk is able to sell almost a million cars withour spending money on ads without Elon Musk tesla would be at 10/20% of their market cap max. If the company didnt go bankrupt. \n\nIvanhoe has a legendairy CEO in mining and the company preforms well and has amazing assets. \n\n&amp;#x200B;\n\nSometimes its better to sit on the sideline even if a stock is dirt cheap.\n\nwereldhave has been cheap for years with an 10% dividend and even 20% for a while with a lot of intrisic value but did cut the dividend time and time again took huge losses and still holds bad assets. -80% of their peak and it use to be a large cap stock on the AEX/\n\nIntel was unable to preform with the rest of the market but when a new ceo comes he invest billions and claims the company holds a lot of tech which shows how weak management was.\n\nIBM used to be a leader but focussed on share buybacks insted of innovating. sold assets and tech cheap and the best parts. use to be one of the biggest tech companys.\n\nThere are countless examples of weak managment destroying share value in a small company 1 or 2 bad decisions can bankrupt the company.\n\nwhen looking at a stock look at management experience look at the board and insider ownership before u even touch the stock",
        "subreddit": "stocks",
        "title": "management is one of the most important parts of a company",
        "url": "https://www.reddit.com/r/stocks/comments/queyas/management_is_one_of_the_most_important_parts_of/",
        "created": 1637006761.0
    },
    {
        "author": "Conscious-Ad-4136",
        "created_utc": 1636661858,
        "id": "qru01i",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "300K YOLO on Intel",
        "url": "https://i.redd.it/6u8vus2hy0z71.jpg",
        "created": 1636690658.0
    },
    {
        "author": "Last_Interview_4332",
        "created_utc": 1636435040,
        "id": "qpwkcu",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "**BULL CASES**\n\n/1. INTC is the only real US chip manufacturer that can reasonably compete with Korean Samsung and Taiwanese TSMC (-100 credit score for acknowledging Taiwan). It is getting lots of literal boat load of cash(probs something like $50B equivalent) from the government that is positive for the shareholders, while maintaining the buybacks and dividends.\nYes, TSMC and others are also hedging and gonna start making some chips in USA but realistically the gubment will give most of the cash to INTC.\n\n/2. US gubment is in a cold war with China, this means it's also a technological warfare. This means supercomputers, missile, Starlink chips(private company) etc and Intel is likely going to be one of the prime suppliers of this boom in tech investment.\n\n/3. TSMC and Samsung are pretty much bottlenecked. Apple, AMD, NVIDIA, Qualcomm, Mediatech, Broadcom, various carmakers, electronics manufacturers etc and not to mention Intel themselves are a big buyer. Specifically, Intel and Apple has bought out all capacity of TSMC 3nm(equivalent to Intel's 5 nm probs, I forgot). This means there is an enormous demand that is not being fulfilled and Intel launching their foundry services and already signing deals with Qualcomm, Amazon is a big deal.\n\nFor reference, TSMC's market cap is bigger than 3 Intel (yes, that's a unit I invented). In 2024-2025, you might even see Apple, NVIDIA and the likes fabricating their chips from Intel just to give a big F U to TSMC (who is currently slightly overcharging if the rumours are to be believed).\n\n/4. Intel is launching a GPU. The GPU market is also in a huge bottleneck due to higher demand from gamers and corn miners. Everyone expects that they are likely to sell their GPUs very easily. Think about this for a sec. Intel is just about to become one of the players in this huge GPU market.\nWhich would also make way for their server GPUs and AIs and the likes.\n\n/5. Think 10-15 years from now. Your fridge, doorbell, light, heating system and every ducking thing will have some chips and Intel is likely to remain a dominant player in this market. I think this will be bigger than the current entire semi market as it is. IOT is just getting started.\n\n/6. Intel is one of the forerunner player in AI techs like autonomous vehicles through their various investments(Mobil eye for one) and will likely remain so. I don't know how big this will be in 10 years, but it's likely that Intel will be one of the bigger players in the market like Google (through Waymo), Tesla and NVIDIA.\n\n/7. Intel also recently launched their big little architecture, where it has already became competitively better than AMD especially in gaming in both power consumption and power. Not that it matters that much, seeing the gamer Steam reports, very few people actually play on the latest of the latest gen. But, that's also something that's worth noting at least. \n\nHowever, the vast majority of pc sales is in just your average boomer laptops and desktops. And they have a good lead there.\n\n*Tips for those wanting to build a high end new pc. Wait for Intel's lineup to be available broadly, high end pc gamers will dump their last gen AMD chips for the Intel one in the second hand market, causing a flooding of cheap AMD CPUs, buy one of them. Source: Did this once.*\n\n/8. One worrying factor is in the server market. Everyone seems to be launching their own server chips and AMD is very competitive and eating away market share. But Intel's management seems to be guiding us towards the right path. If their predictions prove to be right, they are on the right track.\n\n/9. Intel announced that they will launch Angstrom scale CPUs in the future, that's good I guess. They are also working in RISC-V and other CPU architectures.\n\n/10. Pat has an approval rating of 96% in Glassdoor and the employees would recommend others to work in Intel 89% of the time. This is a huge ass jump for both scores from the Bob Swan era. Go to Wayback Machine, you will see. This means a noticeable change has taken place within this huge organisation in such a short time.\n\n/11. Intel stock always seem to have price support at around $50. And it's near that range right now.\n\n/12. Most analysts are bullish on the stock. Comparatively cheap stock in this clown market. Wanna buy a $5.48B gravity powered truck company anyone?\n\n/13. Intel actually has one of the highest talented employee pull who can be expected to deliver. Contrary to popular belief.\n\n**Bear Cases**\n\n/1. This is a boomer stock according to reddit's circejerk. So, it's difficult to convince people that it is actually expected to grow around 11% CAGR by management's conservative estimates.\n\n/2. Intel has repeatedly failed to prove that their foundry division's predictions are unreliable. If they went fabless like AMD, it would have probably rocketed already. But a big part of the cheapness of the stock comes from the unreliability of their foundry division. Yes, the management has finally started getting serious about their foundry, but one cannot ignore their past failures.\n\n/3. Government contracts and the likes are not completely free money like some of you believe, delays in delivery and contract fulfillment could make what is essentially a free money glitch to a costly mistake and a billion dollar loss with a brink of an eye. The terms are generally very strict, so Intel has to deliver.\n\n/4. Investments are going to be a lot and semiconductor industry being cyclical means, if Intel fails to deliver, its market share will be eaten away and lose billions in potential profit.\n\n/5. Stock seems to be largely rangebound like Microsoft was for 15 years.",
        "subreddit": "wallstreetbets",
        "title": "Why Intel Is The Play. To the 🌗 and beyond.🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qpwkcu/why_intel_is_the_play_to_the_and_beyond/",
        "created": 1636463840.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "created_utc": 1636046427,
        "id": "qmpmsh",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "Many traders/funds already went all in AMD on high leverage and some are short intel.\n\nThe current market is priced as INTC having 55% total market share (200b marketcap) and AMD having 45% market share (160B marketcap), but AMD is not even close to that and only gained some marketshare recently since intel tech products underperformed.\n\nBased on Intels new products today, AMD is now the inferior product and they stand to lose marketshare to intel.\n\nRE: recent market movements:\n\nIntel decided to lower dividends and invest more into growth and research, so as expected some dividend funds sold some of their shares and some growth investors purchased those.",
        "subreddit": "stocks",
        "title": "Intel finally beat AMD in the CPU markets and all you hear in this subreddit and some other investing subreddits is complete silence.",
        "url": "https://www.reddit.com/r/stocks/comments/qmpmsh/intel_finally_beat_amd_in_the_cpu_markets_and_all/",
        "created": 1636075227.0
    },
    {
        "author": "skilliard7",
        "created_utc": 1637252851,
        "id": "qwth1y",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "S&amp;P 500 forward price to earnings ratios are at the highest they've been since the tech bubble. This may lead to the question- are we in a bubble?\n\nOne way of valuing the true value of a stock is how much in earnings it will produce in the future. Present earnings are worth more than future earnings. Generally, a discount rate is used, which is based on treasury yields, but at a higher interest rate to compensate for the risk of owning equities.\n\nHistorically, the S&amp;P 500 earnings yield has often closely tracked the 10 year treasury yield, because earnings are expected to grow over time, providing further upside potential, whereas treasuries pay a fixed rate.\n\nhttps://www.yardeni.com/pub/valuationfed.pdf\n\nThis hasn't been the case in current years. Currently, the S&amp;P500's forward earnings yield is 4.68%, vs a 1.53% treasury yield.\n\nContrast this with the '99 tech bubble, where treasury yields were much higher than the S&amp;P500 earnings yield prior to the crash.\n\n\n\nThe other risk is of course rising treasury yields as the fed tapers, and eventually raises benchmark rates. Rising treasury yields make bonds more attractive relative to current equity prices.\n\nFortunately, there is a way you can hedge against this risk. During periods of rising interest rates and inflation, \"Value\" stocks usually outperform \"growth\" stocks. This is because earnings are discounted based on current interest rates. \n\nBecause interest rates are at historical lows, companies like Tesla, Roblox, Rivian, Lucid Motors are valued at extremely high valuations. This is because when you use a discount rate of 1-2%,  future earnings are worth very close to present earnings.\n\nWith a discount rate of 2%, earnings in 30 years are worth 55% of present earnings. However, if you raise that discount rate to 7% due to higher treasury yields, earnings 30 years from now are worth just 11% of present earnings!\n\nOn the contrary, value stocks like Intel are currently very cheap. In this market, no one wants to own \"Dinosaur\" companies that aren't growing. They would rather own the companies they expect to be bigger in 30 years, like AMD, Nvidia, etc. And with a 1-2% discount rate, the math checks out. \n\nWhen interest rates rise substantially, if they do, growth stocks that depend on low rates to justify their valuation will get hit HARD, with as much as 80% downside. Value stocks will be hit as well as their future earnings are discounted further, but not nearly to the same extent that growth stocks do.\n\nOf course, stocks always carry market risk. A recession can drive a crash due to lower earnings, as it did in 2009, and in 2020. If you are investing for the short term, it may be smart to avoid having too much in equities.",
        "subreddit": "investing",
        "title": "Rather than comparing P/E to History, Compare Earnings Yields to Treasury Yields",
        "url": "https://www.reddit.com/r/investing/comments/qwth1y/rather_than_comparing_pe_to_history_compare/",
        "created": 1637281651.0
    },
    {
        "author": "larrytheliquidator",
        "created_utc": 1636663182,
        "id": "qrugxp",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "I took a position in IBM recently on the back of insider buying. I had originally held a position as part of a quant strategy I use. I feel the market is treating Intel like the next IBM but I have reason to believe that's not the case for a number of factors. What are peoples thoughts on $INTC",
        "subreddit": "ValueInvesting",
        "title": "Intel the next IBM?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/qrugxp/intel_the_next_ibm/",
        "created": 1636691982.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "created_utc": 1636050015,
        "id": "qmqyhx",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "\n\n&gt;Nvidia was also trading higher last week, with strength being attributed to news Facebook plans to increase capital spending including data centers, servers and network infrastructure, which could benefit chip companies.\n\n&gt;Nvidia is the leading designer of graphics processing units that enhance the experience on computing platforms. The firm's chips are used in a variety of end markets, including high-end PCs for gaming, data centers and automotive infotainment systems.\n\nThey have a Mkt cap of 761.49B and a P/E ratio of 108.90\n\nWhich is factoring insane growth that might never happen in our lifetimes. So if you want cheaper exposure to the GPU market, Intel might have a better risk/reward with their GPU releases in Q1 2022.",
        "subreddit": "investing",
        "title": "Nvidia is up because there will be increased demand for Gpu's and chip companies. INTC is releasing competing GPU's in Q1 2022 and doest have a 110 P/E (only 9.7 P/E). Seems like exposure with less downside risk.",
        "url": "https://www.reddit.com/r/investing/comments/qmqyhx/nvidia_is_up_because_there_will_be_increased/",
        "created": 1636078815.0
    },
    {
        "author": "No-Significance-4924",
        "created_utc": 1635864188,
        "id": "ql5qmn",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "I have never posted in here, but I wanted to share why I think Array Technologies, Inc. ($ARRY) is positioned to surge in the next few weeks and continue climbing for several years. Quick credentials: I am a Director at a nationwide developer of large-scale, ground-mounted solar projects.\n\nIn simple terms, ARRY makes “single-axis trackers”. Solar panels sit on top of the single-axis trackers, which rotate from east to west as the sun rises and sets, maximizing energy production. This style of racking has become the industry standard in recent years, and ARRY is the best one, in my opinion. With a single motor and a single center driveshaft, their technology can rotate over 3,000 solar panels. They are a market leader, based in the US, and the largest factor in their input cost is steel.\n\nThere are 3 reasons why I’m bullish:\n\n1. The massive reconciliation bill currently in front of congress could pass any day now. It would dramatically increase and **extend the solar investment tax credit and feature a “domestic content requirement”**, which requires a percentage of the capital investment to go toward US made or assembled products. A rising tide lifts all ships, plus ARRY is uniquely positioned to satisfy the domestic content requirement.\n2. ARRY’s Q3 earning’s report is expected on **November 4**. There’s been an unprecedented steel shortage that has wreaked havoc on ARRY and other companies heavily reliant on steel. My guess is the earnings report will be not amazing but decent. And a decent earnings report would indicate light at the end of the tunnel regarding the steel shortage – this is the primary thing holding this stock back over the last 6 months.\n3. As the price of steel comes back down to Earth, ARRY may maintain its current pricing, which means they could have a **significantly higher profit margin than they did pre-steel-shortage**.\n\nDisclaimers: Most of my company’s solar projects use ARRY’s solar racking equipment. I am not a financial advisor, and I personally own some ARRY stock. This opinion is the product of public information and my own professional experience - I don't have access to any confidential intel on ARRY.",
        "subreddit": "stocks",
        "title": "I'm a professional solar developer, and I'm bullish on ARRY",
        "url": "https://www.reddit.com/r/stocks/comments/ql5qmn/im_a_professional_solar_developer_and_im_bullish/",
        "created": 1635892988.0
    },
    {
        "author": "Edgyman520",
        "created_utc": 1637523684,
        "id": "qz2ns2",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Hey guys\n\nSo I have wanted to begin trading stocks for a while now, and I think I'm ready.\n\nMy current plan is to invest the full 2000$ across a semi diverse portfolio of stocks and crypto. I have a few things in mind already, including -\n\nEthereum\nFacebook\nAli Baba\nIntel\nSiga\nAlzinova\nSome sort of steel company undecided\nCannabis (don't know where to invest with this one)\n\nAll these are companies/industries that I have done some research on and would like invest in. \n\nI plan on initially spreading out my 2000$ investment over at least ten companies, and as I earn more throughout the year I intend to invest further\n\nHow is my plan so far? Is my portfolio diverse enough? Any recommendations for other companies? Any advice for a beginner?\n\nThanks everyone",
        "subreddit": "stocks",
        "title": "25M here, new to this. Have 2000$ that I want to invest. How is my plan?",
        "url": "https://www.reddit.com/r/stocks/comments/qz2ns2/25m_here_new_to_this_have_2000_that_i_want_to/",
        "created": 1637552484.0
    },
    {
        "author": "Stocx",
        "created_utc": 1636949024,
        "id": "qu7l9u",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Turned about 2k in Bar Mitzvah money into 5k and then settled around $1.2k after a year. Traded an INTC call last week and brought it to a lovely 500. Thank God I have the ability to lose that much. Also, fuck my life.",
        "url": "https://www.reddit.com/gallery/qu7l9u",
        "created": 1636977824.0
    },
    {
        "author": "OrangePhantom20",
        "created_utc": 1636043149,
        "id": "qmoe30",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "12th gen i9 and i5 performance reviews have dropped and look very promising, especially the i5-12600K giving the 5th Gen Ryzen chips a run for its money at a similar price point.\n\nUnless AMD has another generational performance leap in store, seems like a good Intel buying opportunity?",
        "subreddit": "stocks",
        "title": "Intel - Good buying opportunity following new chips?",
        "url": "https://www.reddit.com/r/stocks/comments/qmoe30/intel_good_buying_opportunity_following_new_chips/",
        "created": 1636071949.0
    },
    {
        "author": "sonofalando",
        "created_utc": 1637267966,
        "id": "qwz19d",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Don’t sleep on INTC on a 5 year time horizon. They have more engineers than AMD has employees. I fully expect a surprise product release that completely destroys AMD architecture in the next 2 years. Then everyone will shift money back over. Same shit happens every decade or so between these two. Everyone is incredibly bearish on INTC despite having boatloads of cash. Not a WSB yolo play, but general suggestion on “getting in early” for a stock that has terrible sentiment. Yes, data center numbers are declining. Hardware ages and has to be replaced as well. They can still win their customers back. They still have a nice dividend as well. \n\nI’m sure SPY, VOO or VTI will probably beat it, but there’s not guarantee it won’t ignite unexpectedly either if there’s a ground breaking product announced.",
        "subreddit": "stocks",
        "title": "Don’t sleep on INTC on a 5 or 10 year time horizon",
        "url": "https://www.reddit.com/r/stocks/comments/qwz19d/dont_sleep_on_intc_on_a_5_or_10_year_time_horizon/",
        "created": 1637296766.0
    },
    {
        "author": "worinimab",
        "created_utc": 1636279895,
        "id": "qolnd5",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "AAPL 4.21%\n\nAMD 12.63%\n\nIBM\t0.44%\n\nINTC 1.29%\n\nMSFT 1.29%\n\nMU 1.56%\n\nNVDA 9.96%\n\nQQQ\t19.77%\n\nVOO\t19.51%\n\nVTI\t29.35%\n\nAm 22 and only recently started investing.  It's very tech focused, and I'm not sure if the ETFs give enough diversification.  As for individual stocks - I want to start adding a bit more into MSFT and MU.  I also want to start putting money over time into ICLN and CIBR and see how they turn out when I get older.  What do you think?",
        "subreddit": "stocks",
        "title": "Roast my portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/qolnd5/roast_my_portfolio/",
        "created": 1636308695.0
    },
    {
        "author": "AbsolutelyN0thing",
        "created_utc": 1636424969,
        "id": "qptniu",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "I'm a senior electrical engineer student who's in the market for a job. I submitted my application to Intel a couple of months ago, and just recently I received an email from a recruiter (timely response, am I right?). \n\nAnyways, we tried to schedule an interview last week, but I didn't get a chance to respond to her until today. She responded today that she received a message from upper management saying that Intel was currently getting a total headcount for 2022 and is currently in a hiring freeze until 11/22. \n\nThis could mean multiple things, but I will say that it is extremely odd to be in a hiring freeze during the fall semester as most the competitive candidates are snatched up by the spring. In addition, the decision to take a head count is also worrying for potential growth of the company as it signals they need to be conservative with their new hires, but it could also mean they are getting their finances in order. Someone smarter than me can figure that out. Figured this would be some interesting information if you were debating picking up the stock.",
        "subreddit": "stocks",
        "title": "Intel is currently on a hiring freeze",
        "url": "https://www.reddit.com/r/stocks/comments/qptniu/intel_is_currently_on_a_hiring_freeze/",
        "created": 1636453769.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "created_utc": 1637088629,
        "id": "qvezye",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "[INTC] Someone is buying December, 03, 2021, call options, strike price $52.5. Over 51.6K traded today and constantly increasing since market open.\n\nNot anything close to this volume on other strikes/weeks (Except for December monthly calls, same strike price of $52.5 and 12.7K volume).\n\nWhat is the meaning of this type of activity. Is it bullish since they are buying above the market price for premium of 4% compared to just buying spot.",
        "subreddit": "stocks",
        "title": "[INTC] Someone is buying December, 03, 2021, call options, strike price $52.5. Over 51.6K traded today and constantly increasing.",
        "url": "https://www.reddit.com/r/stocks/comments/qvezye/intc_someone_is_buying_december_03_2021_call/",
        "created": 1637117429.0
    },
    {
        "author": "trickintown",
        "created_utc": 1636195171,
        "id": "qnxoum",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "SOXX - the semiconductor's ETF holds 16.5% of its assets in 2 non-performing companies - Broadcom and Intel. Something I am missing that fund experts at Blackrock are seeing with these two companies?\n\nThis group has always been bullish on AMD and NVDA, so just wondering why the disconnect between us retail investors and the funds?",
        "subreddit": "stocks",
        "title": "SOXX's 2 Largest Holdings - INTC and AVGO",
        "url": "https://www.reddit.com/r/stocks/comments/qnxoum/soxxs_2_largest_holdings_intc_and_avgo/",
        "created": 1636223971.0
    },
    {
        "author": "VonDerBerg",
        "created_utc": 1636358190,
        "id": "qp8wd5",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Big banks, Intel, PayPal, Oil Co's etc have done it in the past, which has proven to be a poor allocation of capital. It seems like business reinvestment that diversifies the optionality, enhances existing products and penetrates new markets is always a correct way forward for the med/long term.\n\nCan anyone share white papers or studies on the topic?",
        "subreddit": "stocks",
        "title": "Historically: How does taking debt on to buy back stocks pan out for the companies?",
        "url": "https://www.reddit.com/r/stocks/comments/qp8wd5/historically_how_does_taking_debt_on_to_buy_back/",
        "created": 1636386990.0
    },
    {
        "author": "hamyield",
        "created_utc": 1635864742,
        "id": "ql5xlt",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Corsair 9 month results looking good, on target for a $1.8-1.9B revenue at the end of the year. Despite this, their mcap is $2.3B as of writing (so a revenue multiplier of 1.2x). This got me thinking, in a market where NVDA mcap trades at \\~40x revenue, AMD trades at about \\~14x revenue, TSLA trades at about \\~25x revenue, and even INTC (which is widely considered lately to be a bit floppy when compared to their rivals) trades at 3x revenue - then this suggests that a few more good years and the market might be willing to let the price climb to a higher multiplier - all CRSR have to do is keep making money. LOGI who are probably their closest rival in the peripherals space trade at about 3x.\n\nIt's a similar story when you look at P/E ratios. LOGI/CRSR/INTC are sat around the 10-15 mark, but many other tech and PC orientated stocks are trading on ratios *way* higher than this.\n\nNot only this, but this stock is being held about 33% short - which is significant in comparison to the other stocks mentioned above (who are all less than 10%). That's probably because CRSR is a relative newcomer to the market more than anything, but it could also just be because the hedge fund managers don't understand that it's a really well established brand in the markets it plays in.\n\nWith DDR5 on the horizon, sales in components still probably being depressed as the GPU availability and price situation hasn't yet calmed down (so many of their customers are poised to buy a new system, but haven't yet committed to it), and with the ever increasing popularity of gaming and streaming, I can't see that they are going to lose customers/revenue - and if anything as the GPU situation sorts itself out and with DDR5 becoming the latest RAM standard, I can only see sales in m.2 drives and RAM increasing. Further to this they are entering the monitors arena with a strong \"gamer\" brand that can command good prices/margin.\n\nSo immediate short term (heading to FY results) this stock could potentially multi-bag. On revenue multipliers alone, I feel this should be at about the $60 mark. Especially if the GPU situation gets much better towards Christmas.\n\nFull disclosure, I have a small holding. I just really like this stock.",
        "subreddit": "wallstreetbets",
        "title": "Corsair (CRSR) - Good fundamentals, good 9 month results, lots of shorts?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ql5xlt/corsair_crsr_good_fundamentals_good_9_month/",
        "created": 1635893542.0
    },
    {
        "author": "invest-the-rest",
        "created_utc": 1637605950,
        "id": "qzs71h",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "There are a lot of high flying tech companies out there with lofty valuations but Intel has continued to grow both its' revenues and earnings and I believe its fundamentals make it a great buy at current valuations. What does everyone think of Intel?",
        "url": "https://youtu.be/WPY8qqX7MJc",
        "created": 1637634750.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636274101,
        "id": "qokfu7",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n|Ticker|Company|# Mentions (24H)|\n|:-|:-|:-|\n|SPY|SPDR S&amp;P 500 ETF Trust|[46](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=options)\n|OCC|Optical Cable Corporation|[9](https://www.memebergterminal.com/stock/Optical%20Cable%20Corporation/OCC?utm_source=rsmb&amp;utm_medium=options)\n|TSLA|Tesla Inc|[8](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=options)\n|MSFT|Microsoft Corporation|[7](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=options)\n|AMC|AMC Entertainment Holdings Inc|[7](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=options)\n|PLTR|Palantir Technologies Inc|[7](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=options)\n|NVDA|NVIDIA Corporation|[6](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=options)\n|IBKR|Interactive Brokers Group Inc|[5](https://www.memebergterminal.com/stock/Interactive%20Brokers%20Group%20Inc/IBKR?utm_source=rsmb&amp;utm_medium=options)\n|QQQ|Invesco QQQ Trust Series 1|[5](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=options)\n|GME|GameStop Corp|[5](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=options)\n|ES|Eversource Energy|[4](https://www.memebergterminal.com/stock/Eversource%20Energy/ES?utm_source=rsmb&amp;utm_medium=options)\n|PROG|Progenity Inc|[4](https://www.memebergterminal.com/stock/Progenity%20Inc/PROG?utm_source=rsmb&amp;utm_medium=options)\n|VALE|Vale S.A.|[4](https://www.memebergterminal.com/stock/Vale%20S.A./VALE?utm_source=rsmb&amp;utm_medium=options)\n|OI|O-I Glass Inc|[4](https://www.memebergterminal.com/stock/O-I%20Glass%20Inc/OI?utm_source=rsmb&amp;utm_medium=options)\n|SOFI|SoFi Technologies Inc. Common Stock|[4](https://www.memebergterminal.com/stock/SoFi%20Technologies%20Inc.%20Common%20Stock/SOFI?utm_source=rsmb&amp;utm_medium=options)\n|PTON|Peloton Interactive Inc|[3](https://www.memebergterminal.com/stock/Peloton%20Interactive%20Inc/PTON?utm_source=rsmb&amp;utm_medium=options)\n|FB|Facebook Inc|[3](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=options)\n|MRNA|Moderna Inc|[3](https://www.memebergterminal.com/stock/Moderna%20Inc/MRNA?utm_source=rsmb&amp;utm_medium=options)\n|INTC|Intel Corporation|[2](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=options)\n|NIO|NIO Inc|[2](https://www.memebergterminal.com/stock/NIO%20Inc/NIO?utm_source=rsmb&amp;utm_medium=options)\n|WKHS|Workhorse Group Inc|[2](https://www.memebergterminal.com/stock/Workhorse%20Group%20Inc/WKHS?utm_source=rsmb&amp;utm_medium=options)",
        "subreddit": "options",
        "title": "I scraped r/options for the top ticker mentions in the last 24H. Here are the results (Sunday November 07, 2021)",
        "url": "https://www.reddit.com/r/options/comments/qokfu7/i_scraped_roptions_for_the_top_ticker_mentions_in/",
        "created": 1636302901.0
    },
    {
        "author": "Aquaticdigest",
        "created_utc": 1637499667,
        "id": "qyui02",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hello Everyone, I recently bought into individual stocks on 1.10.2021 (around 2 months ago) and my results of the percentage gains and number of holding with priority (higher investments) are as follows:\n\n&amp;#x200B;\n\nAAPL : +15.7%\n\nMSFT : +24%\n\nNVDA : +64%a\n\nTSLA : +52%\n\nAMD : +56%\n\nPYPL : -14.5%\n\nMCD : +6.5%\n\nFSLY : -30%\n\nPLTR : -12%\n\nNET : +90%\n\nV : -6%\n\nCOIN : +50%\n\nINTC : -4%\n\nTWLO : -10.5%\n\nO : +12.5%\n\nSQ : -4.8%\n\n&amp;#x200B;\n\nI am up 20% on my whole portfolio. QQQ at this time rose 12% which is quite insane as well. I usually invest monthly around 1000$ and right now my portfolio is worth around 10k$. I wanted some opinions from the people here. \n\n&amp;#x200B;\n\n1. What would be some readjustments I should make to this portfolio. \n2. As previously I had invested lumpsum 8k into these stocks, how do I continue to invest. Should I pick out new companies or keep piling onto the same positions? Should I keep the same priority by value of investment that I currently have?\n3. Which stocks do you think would not do well in the future. My current bags are (FSLY, PYPL, PLTR)",
        "subreddit": "stocks",
        "title": "How to Refactor A Portfolio when Adding Monthly Investments?",
        "url": "https://www.reddit.com/r/stocks/comments/qyui02/how_to_refactor_a_portfolio_when_adding_monthly/",
        "created": 1637528467.0
    },
    {
        "author": "Krazy__cat",
        "created_utc": 1638006689,
        "id": "r3acq0",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "AMD possibly to $200.\n\nAMD possibly outperform nvidia in sales, cuz AMD covers cpu for retail and business purpose too.\n\nAMD is innovating CPU , once monopoly  intel is now slacking.\n\nZen 4 of AMD is scheduled for release next year . \nBench mark of normal CPU at 64 cores , 128 threads. New Zen 4 has 128 cores , 256 threads.\n\nAmd chips sized at 7 nanometres, and possibly to 5nm in 2 years . Intel sized at 10 nm.\n\nNet profit from sales quite good.\n\nPossible trade opportunity for Long term option",
        "subreddit": "wallstreetbets",
        "title": "AMD to $200? What do you think ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r3acq0/amd_to_200_what_do_you_think/",
        "created": 1638035489.0
    },
    {
        "author": "toolbox_financial",
        "created_utc": 1637732355,
        "id": "r0xnap",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "  \n\nKulicke &amp; Soffa Industries, Inc., (KLIC $57.07) reported September quarter results that were better than initial expectations and guided the December quarter to be above street estimates as the core wire bonder business is performing a bit better than expected given the drop in IC unit volume growth. KLIC is seeing upside to other segments such as high-end LED, advanced packaging tools for thermal compression bonding, and growing opportunities in the automotive segment with power management chips and battery assembly applications.  Over the next couple of years the company's LED pick and place tool could drive revenue in this segment to be over $300 million from around $80 million in FY2021 establishing KLIC with another major growth driver.  The new LED tool addresses more applications besides just final placement including sorting, binning, and adjusting the LEDs on the substrate and is expected to drive much broader customer adoption outside of the initial customer who we believe is Apple. We would be adding to positions of KLIC at current valuations with a move to the $105 range of 15x our FY2022 pro-forma EPS of $6.34 plus the $11.63 in net cash.\n\nThe company reported September (Q4FY2021) revenue of $485.3 million up 14.4% sequentially and up 173% versus last year's September quarter and in-line with the company's pre-release of results on November 1, 2021.  Revenue was better than initial estimates driven by strength in general semiconductor, memory and LED revenue coming in at the high end above $80 million for the year. Gross margin was 47.7% up from the 46.1% reported last quarter driven by volume, mix, cost reductions, and ASP increases. Operating profit was a record 31.9% up from 28.4% reported last quarter and the 13.0% reported in last year's September quarter. Pro-forma EPS was $2.17 up from the $1.87 reported last quarter and the $0.35 reported in last year's September quarter and in-line with the pre-released EPS estimate of $2.15-$2.17.\n\nKLIC generated $123 million in cash flow from operations and total cash increased $105 million sequential to $740 million or $11.63 in net cash per share up from the $10.00 in net cash reported last quarter as KLIC continues to be a cash generating machine.  Increasing cash by $4.15 per share over the last twelve months\n\nKLIC's reported FY2021 revenue of $1.52 billion up 144% in versus FY2020 and better than the company's initial $1.50 billion estimate driven by much higher IC unit volume growth in 2021 driving the company's core wire bonder business significantly higher servicing the 5G, EV's, and increasing content and complexity of each IC.  Strong growth in LED displays, service and the automotive recovery also helped revenue growth for the year. Operating income was $412.4 million or 27.2% of revenue in FY2021 up from the 9.4% reported in FY2020 driving huge EPS growth of 482% to $6.14 propelled by the increase in revenue and tight operating expense control.\n\nThe company guided December quarter (Q1FY2022) revenue to be $460 million down 5.2% sequentially and up 73% versus last year and better than the street's $411.7 million estimate driven by another strong LED display quarter and less of a decline in the core wire bonder business than initially anticipated.  Gross margin should be around 47% down slightly from the 47.7% reported last quarter. Pro-forma EPS should be $1.88 +/- 10% down from the $2.17 just reported and up from the $0.86 reported last year and better than the street's $1.54 estimate driven by the higher revenue and gross margin. \n\nKLIC did not update the $1.5 billion revenue estimate for FY2022 (flat with the $1.52 billion just reported in FY2021) but did suggest we might now have a bit of upside to that number as the core wire bonder business declines a bit in calendar 2022 as overall unit volume growth slows from over 20% in 2021 to around 8-10% in 2022.  This decline of around $150-$200 million in core wire bonding revenue in 2022 will be offset by growth in the company's other segments of high-end LED, advanced packaging focused on thermal compression bonding with a large OEM who we believe is Intel, new opportunities in automotive battery assembly and power management segments with customers such as Tesla and increased service revenue producing flat revenue for the year, or as we are forecasting, moderate growth for FY2022 to near $1.6 billion.  Expanding gross margin and operating leverage should produce higher EPS on flat revenue in FY2022. We are now forecasting pro-forma EPS of $6.34 in FY2022 up from the $6.14 just reported.\n\nWe would be adding to positions of KLIC at current valuations with a move to the $105 range of 15x our FY2022 pro-forma EPS of $6.34 plus the $11.63 in net cash.  In the near term the core wire bonder business will drop a bit in 2022 but then probably start to grow again in 2023 as increased IC unit volume growth drives up the core business again. The ramp of the LED display business from $80 million to over $100 million in 2022 and the ramp up of new advanced packaging products, in the back half of 2022 in the thermal compression bonding segment, which should double from the $20 million range to over $40 million in 2023 and $80 million in 2024, and growing automotive and battery assembly revenue should allow KLIC to show slight revenue growth in 2022 and higher revenue growth above $1.5 billion in 2023 and 2024 pushing the stock to over $100.",
        "subreddit": "wallstreetbets",
        "title": "KLIC September quarter DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r0xnap/klic_september_quarter_dd/",
        "created": 1637761155.0
    },
    {
        "author": "shashwat73",
        "created_utc": 1636914637,
        "id": "qtw2ht",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I see a lot of AMD on this subreddit and not enough Intel. I believe their new CEO is ready to lift the company to new heights.\n\n* Actually create their own chips\n* 9.75 PE, massive earnings, increasing dividend, fair value is at $300B\n* New GPUs (trash compared to Nvidia but something) &lt;- Miners finna gobble those up, increasing revenue\n* Spending a ton for new fabs and to compete with TSMC, Samsung, Micron, and Nvidia and to try and \"solve that chip shortage,\" including spending $95B towards new fabs in Europe. &lt;- if they can somehow pull that off, their revenue and market share will grow as TSMC and others wouldn't be able to compete. Unlikely, but investors will be happy they are \"trying\"\n* Still hold a majority CPU market share, the 12th gen CPUs are speedy af\n* Data centers are growing at a very fast rate and use Intel chips\n* Fell on Q3 earnings, giving it a good price and entry\n\nI also believe the overall chip market is set to grow a ton, as semiconductors will be in everything, from automobiles to a pig's brain. If Intel can't regain market share, they will ride the wave of semiconductors, although it may be slower than other chip stocks and **$SOXL**.\n\nDownside/Risk\n\n* Lisa Su\n\nThoughts?",
        "subreddit": "wallstreetbets",
        "title": "$INTC fundamentals and valuation",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qtw2ht/intc_fundamentals_and_valuation/",
        "created": 1636943437.0
    },
    {
        "author": "moldyjellybean",
        "created_utc": 1636143237,
        "id": "qnjlmt",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I got into an discussion \n\nhttps://old.reddit.com/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/\n\nInside that post I specifically detailed exactly how AMD would eventually dominate the CPU race in energy efficiency, processing power, space, security etc.  \n\nI know INTC is out, AMD is gaining a lot of ground, but I'm huge on energy efficiency and why want to get a head start as I think Arm with it's speed and energy efficiency is something we should investigate.  \n\nUnlike my AMD stock post years ago I have no knowledge of Arm or M1 except using it in a macbook but it's performance blows me away while energy consumption is so low is quite the milestone.  \n\nhttps://www.datacenterknowledge.com/arm/its-happening-arm-server-cpus-are-coming-data-center\n\nhttps://www.sdxcentral.com/articles/opinion-editorial/apples-m1-macs-offer-hints-of-arms-data-center-future/2021/01/\n\nhttps://mayankkapoor.medium.com/the-arm-ification-of-the-datacenter-has-begun-kick-started-by-the-apple-m1-166387f77c95\n\nThanks to buying AMD under $2 and alternative currencies I no longer work so I'm looking for informed opinions for those that work in that space.\n\nBesides owning NVDA I haven't kept up with the merger, are there national security concerns, monopoly concerns that might hold up the NVDA Arm deal?",
        "subreddit": "wallstreetbets",
        "title": "Does anyone here work closely with a data center, cloud computing, is anyone preparing to use Arm, M1 in the datacenter",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnjlmt/does_anyone_here_work_closely_with_a_data_center/",
        "created": 1636172037.0
    },
    {
        "author": "FishyPower",
        "created_utc": 1637410711,
        "id": "qy4gpl",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Man's back at it again with some uranium DD.\n\nPrevious DD: [1](https://www.reddit.com/r/wallstreetbets/comments/qo3g44/how_uranium_will_give_you_a_permahard_erection/)\n\nI'm gonna be the uranium version of The Intel ~~Bag Holder~~ DD man.\n\n&amp;#x200B;\n\nAssuming you're familiar with the overarching uranium bull thesis (if no, check out [DD 1](https://www.reddit.com/r/wallstreetbets/comments/qo3g44/how_uranium_will_give_you_a_permahard_erection/)), here I dive into the concept of using the Sprott Physical Uranium Trust (SPUT) as a financial nuke.\n\nThe [concept](https://www.reddit.com/r/wallstreetbets/comments/pnyso1/the_sprott_uranium_fund_is_a_self_reinforcing/) isn't new, it was already around when I first got into uranium back in September, but recently, it took a fall out of the limelight due to the supposedly thin spot market being thicker than expected.\n\nFresh [DD](https://www.segracapital.com/commentary/you-say-you-want-a-revolution) from  u/JekyllCapital of UTwitter had me thinking again.\n\nThe DD basically expose a few more sources of uranium on the spot market.\n\nFirst, being pseudo-options fuckery using terms from old contracts\n\nSecond, existing holders of physical uranium converting their holdings into SPUT units.\n\nThird, time fuckery with carry traders.\n\nThe impact is basically shifting around the supply from the past and the future into the present. Key takeaway is that these \"new\" sources are one-offs and we will eventually get through them with time and money.\n\n&amp;#x200B;\n\nYeah, we're basically guaranteed to go up from current prices to prices where smaller miners can also profit enough to justify starting up their mines.\n\nHowever, the optimal time for a \"squeeze\" is the timeframe before the mines open back up. It's during this time that the utilities really have to fight over every last pound. Whatever you and I bid, they have the bid higher or face revenue loss from their reactors shutting down. Once the mines are up and running, it's easier to ramp up production, resulting in lesser pressure on the utilities.\n\n&amp;#x200B;\n\nFor positions, I think U.UN is the safest. Apart from a sudden crisis that fucks nuclear energy over again politically, uranium prices will definitely go higher than the current levels. Uranium ETFs are like spice for the retards, don't know enough to evaluate individual companies so why not buy them all? Me? URA 45C Jan 2023. We're bound to reach the moon, I just hope it's before my calls expire.",
        "subreddit": "wallstreetbets",
        "title": "426 DTE and weaponizing uranium.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qy4gpl/426_dte_and_weaponizing_uranium/",
        "created": 1637439511.0
    },
    {
        "author": "Resident-Honeydew462",
        "created_utc": 1635988779,
        "id": "qm9f2f",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Intel is going to moon soon!!!",
        "url": "https://i.redd.it/4jboei82dhx71.jpg",
        "created": 1636017579.0
    },
    {
        "author": "corporalcorporal",
        "created_utc": 1636081004,
        "id": "qn1pad",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I think Intel INTC will hit $60+ a share in early/mid December I want to \"gamble\" 2000$, what's a good strategy? What can I lose if it all goes wrong?\n\nAlderlake appears to compete with AMD in the consumer space. Their flagship CPU just released is competing or beating AMD's top consumer chip. https://www.youtube.com/watch?v=fhI9tLOg-6I\n\nThey also seem to be somewhat less affected by the shortages than AMD and AMD stock is rising. (By less effected meaning less dependent on China and Taiwan)",
        "subreddit": "CanadianInvestor",
        "title": "How do I do a \"call option\"? Alderlake appears to compete with AMD in the consumer space. Their flagship CPU just released is beating all of AMD's consumer chips. https://www.youtube.com/watch?v=fhI9tLOg-6I",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qn1pad/how_do_i_do_a_call_option_alderlake_appears_to/",
        "created": 1636109804.0
    },
    {
        "author": "Tradingjoe10",
        "created_utc": 1637502106,
        "id": "qyv7wb",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " \n\n**Partnering Companies**\n\n**About Hero MotoCorp Ltd. -** The New Delhi (India) headquartered Hero MotoCorp Ltd. is the world's largest manufacturer of motorcycles and scooters, in terms of unit volumes sold by a single company in a year — the coveted position it has held for the past 20 consecutive years. The Company has sold over 100 million motorcycles and scooters in cumulative sales since inception. Hero MotoCorp currently sells its products in more than 40 countries across Asia, Africa, Middle East, and South and Central America. Hero MotoCorp has eight state-of-the-art manufacturing facilities, including six in India, and one each in Colombia and Bangladesh. Hero MotoCorp has two world-class, state-of-the-art R&amp;D facilities — the Centre of Innovation and Technology (CIT) in the northern Indian state of Rajasthan, and Hero Tech Centre Germany GmBH. Hero MotoCorp is one of the largest corporate promoters of multiple disciplines of sports, including, Golf, Football, Field Hockey, Cricket and Motorsports. Fifteen-time major winner Tiger Woods is Hero's Global Corporate Partner.\n\n**ABOUT JIANGMEN DACHANGJIANG GROUP CO., LTD. (DCJ) -** Dachangjiang Group (DCJ) is the largest motorcycle manufacturer in China and has been ranked first in China's motorcycle industry for 18 consecutive years. Its products cover various types of motorcycles from small and medium to the large-displacement. The annual production is more than 2 million units, and the cumulative production exceeds 42 million units. There are more than 15,000 retail stores nationwide. In order to achieve zero emissions and carbon neutrality, DCJ has been furthering its commitment to accelerate the development and production of electric motorcycles in recent years.\n\n**ABOUT YADEA GROUP -** Yadea Technology Group Co., Ltd. was founded in 2001. After 20 years of rapid development, it has become a premium electric two-wheeled vehicle manufacturer integrating the development, production and sales of electric mopeds, electric motorcycles, electric bicycles, electric kick scooters and their accessories. In May 2016, Yadea successfully listed on the Hong Kong Stock Exchange and became the first listed company in China's electric two-wheeled vehicle industry (01585.HK). Yadea's mission is to use its market leadership to inspire a movement towards greener travel solutions and its vision is to create world-leading electric vehicle solutions by building innovative technologies that meet and exceed international standards for safety and quality. Cumulative sales of more than 50 million electric two-wheelers in the last 20 years, Yadea helps to reduce 8.52 million tons of oil consumption, 2.84 million tons of CO2 emissions which is the equivalent of planting 28.4 billion trees. In 2020, Yadea global sales are the first to exceed 10 million units in global electric two-wheeler sales. There are 35,000+ stores worldwide with more than 50 million users and a market share of nearly 22%.\n\n**About Foxconn Group -** Established in Taiwan in 1974, Hon Hai Technology Group (\"Foxconn\") (2317: Taiwan) is the world's largest electronics manufacturer. Foxconn is also the leading technological solution provider and it continuously leverages its expertise in software and hardware to integrate its unique manufacturing systems with emerging technologies.\n\nKey to Foxconn's vision for the future, is its 3+3 strategic initiative that focuses on three emerging industries and three major core technologies that include investments in electric vehicles, digital health, and robotics industries as well artificial intelligence, semiconductors and next-generation communication technologies, forming its key \"3+3\" (industry and technology) strategy. With this announcement, Foxconn is expanding beyond four wheels to include Gogoro's two-wheel Smart Scooter vehicles as well as its battery swapping technologies. In the electric cars industry, Foxconn is assertively promoting the MIH Alliance by teaming up over 1,600 software and hardware partners. Foxconn also uses the global layout in ICT (Information and Communication Technology) to integrate the advantage of manufacturing ability and quickness to become the major partner for international automobile brands.\n\nFoxconn has a formidable global supply chain, and possesses key component manufacturing capabilities, structural R&amp;D capabilities and system integration services. This unique set of proficiencies allow Foxconn to vertically consolidate services, and also provide services on smart platforms. Foxconn will maintain its core ethos of sharing, and continue its dedication to innovative technologies to propel the sustainable development of our automotive ecosystem.\n\n**About CHINA MOTOR CORPORATION(CMC)** \\- Brief Introduction\n\nDate of Incorporation：June 13th, 1969  \nStart of Production：Dec 12th, 1973  \nNumber of Employees ：About 2,200Capacity：120,000 units/two shifts for automobiles/ 30,000 units/two shifts for electric scooters  \nProducts：Sedan, RV, LCV, Truck, EV, Electric scooter.\n\nCMC is not only known for Mitsubishi Japan's sole distributor and exclusive business partner in Taiwan but also Taiwan's 2nd largest vehicle manufacturer. We are proud of our prominent production and marketing capabilities based on the abundant experience in the automobile industry for 50 years since 1969.\n\nChina Motor Corporation started out as a commercial vehicle manufacturer in 1969, dominating Taiwan commercial vehicle market and cooperating with Mitsubishi Motors to produce and distribute a variety of best-selling models. We put our business philosophy: harmony, innovation, top, sustainability into practice for comprehensive reformation. In order to improve production efficiency and quality, we promoted the SET PARTS SUPPLY in 2003 and UNMANNED MATERIAL SUPPLY system by AGV in 2010, to realize smart manufacturing. With years of experience in digital factory, production line planning and automation, we started to develop our AGV business in 2011. In the future, CMC will continue to develop our core business including passenger, commercial and new energy vehicles, and to support new energy and innovation business as our all-round strategy for a brighter future.  \n\n\n**About Enel X -** Enel X is Enel Group's global business line offering services that accelerate innovation and drive the energy transition. A global leader in the advanced energy solution sector, Enel X manages services such as demand response for around 7.4 GW of total capacity at global level and 137 MW of storage capacity installed worldwide, as well as 232,000 electric vehicle charging points made available around the globe11. Through its advanced solutions, including energy management, financial services and electric mobility, Enel X provides each customer with an intuitive, personalized ecosystem of tech platforms and consulting services, focusing on sustainability and circular economy principles in order to provide people, communities, institutions and companies with an alternative model that respects the environment and integrates technological innovation into daily life. Each solution has the power to turn decarbonization, electrification and digitalization goals into sustainable actions for everyone, in order to build a more sustainable and efficient world together.\n\n**About GoTo Group -** GoTo Group is the largest technology group in Indonesia and the \"go to\" ecosystem for daily life, capturing a majority of Indonesian consumer household expenditure. GoTo combines e-commerce, on-demand and financial services through the Gojek, Tokopedia and GoTo Financial brands, creating the first platform in Southeast Asia to host these three essential use cases in one ecosystem. GoTo's mission is to \"Empower Progress\" by offering an unparalleled selection of goods and services through a comprehensive merchant and partner network and promoting financial inclusion through its leading payments and financial services business.  \n**About Gojek -** Gojek is Southeast Asia's leading on-demand platform and a pioneer of the multi-service ecosystem model, providing access to a wide range of services including transportation, food delivery, logistics and more. Gojek is founded on the principle of leveraging technology to remove life's daily frictions by connecting consumers to the best providers of goods and services in the market.  \nThe company was first established in 2010 focusing on courier and motorcycle ride-hailing services, before launching the app in January 2015 in Indonesia. Since then, Gojek has grown to become the leading on-demand platform in Southeast Asia, providing access to a wide range of services from transportation, to food delivery, logistics and many others.  \nAs of March 2021, Gojek's application has been downloaded more than 190 million times by users across Southeast Asia. Gojek is dedicated to solving the daily challenges faced by consumers, while improving the quality of life for millions of people across Southeast Asia, especially those in the informal sector and micro, small and medium enterprises (MSMEs). The Gojek application is available for download via iOS and Android.\n\n**About Gates Industrial Corporation plc -** Gates is a global manufacturer of innovative, highly engineered power transmission and fluid power solutions. Gates offers a broad portfolio of products to diverse replacement channel customers, and to original equipment manufacturers as specified components. For more than a century, Gates has pushed the boundaries of materials science to engineer products that exceed expectations in many sectors of the industrial and consumer markets. Our products play essential roles in a diverse range of applications across a wide variety of end markets including industrial on-highway, industrial off-highway, mobility, and recreation, automotive, energy and resources as well as diversified industrial. Our products are sold in more than 30 countries across our four commercial regions: the Americas; Europe, Middle East &amp; Africa; Greater China; and East Asia &amp; India. More about Gates can be found at [https://www.gates.com/us/en.html](https://www.gates.com/us/en.html).  \n\n\n**Financials**\n\nhttps://preview.redd.it/49bg89ezby081.png?width=1164&amp;format=png&amp;auto=webp&amp;s=ff09ca59eb801e3c7367dd11567f48eef69bb8a3\n\nhttps://preview.redd.it/7rm96cy0cy081.png?width=2000&amp;format=png&amp;auto=webp&amp;s=f1ff797379820e29a45331345e6be6f322aa5055\n\nhttps://preview.redd.it/5gc7cix1cy081.png?width=1187&amp;format=png&amp;auto=webp&amp;s=6fff34b47d85cb8c0455a8ee19b2c0215395eaf0\n\n[Credit to @spacanpanman](https://preview.redd.it/r5dibdj8cy081.png?width=1259&amp;format=png&amp;auto=webp&amp;s=ef30620c77ac6a38e735d449dbf3a6a1d147b6b0)\n\n**Leadership**  \n**Gogoro**  \n\n\n**Horace Luke**  \n**Founder and CEO**\n\nHorace Luke is a co-founder and chief executive officer at Gogoro where he is responsible for the company’s corporate strategy, product development and the go-to-market and commercialization of its products and services. Previously, Horace served as chief innovation officer at HTC, where he played an instrumental role in leading the company's transformation from a white label hardware manufacturer to one of the most desirable and innovative mobile phone brands in the world. Prior to HTC, Horace spent ten years at Microsoft, where he led product ideation and brand development for a variety of Microsoft's most important franchises including the first generation Xbox, Windows XP and Windows Mobile. Horace also served at Nike where he played a key role in the brand development across a number of progressive brands.  \n\n\n**Bruce Aitken**  \n**Chief Financial Officer**\n\nAs CFO, Bruce is responsible for Gogoro’s accounting, financial planning and analysis, investment strategy and fundraising. He joined Gogoro from Amazon, where he was the general manager of Amazon’s device business in China. Prior to that, he spent more than twenty years at Intel in various executive leadership roles across Asia.\n\nGM, Kindle/Devices and Amazon Reading, China Amazon 2016-2018\n\nIntel Corporation Director of China Finance, Director of China Strategy  \n**Board of Directors**  \n**Michael Splinter**\n\nChairman, Nasdaq  \nIndependent Board Member, TSMC  \nFormer CEO, Applied Materials  \n**Yoshi Yamada**  \nFormer Head of Giga Factory, Tesla  \nFormer EVP, Panasonic\n\n**Hui-Ming Cheng**  \nFormer CFO, HTC  \nFormer CFO, Taiwan Mobile\n\n**Poema Global Holdings Corp (PPGH)**  \n\n\n**Homer Sun**  \n**Chief Executive Officer at Poema Global**  \nHomer Sun is the Chief Executive Officer of Poema Global. Mr. Sun is a seasoned private equity investor and M&amp;A practitioner with over 25 years of experience. Mr. Sun was formerly the Chief Investment Officer of Morgan Stanley Private Equity (‘‘MSPE’’) Asia, a Managing Director at Morgan Stanley and a member of the Firm’s Global Private Credit &amp; Equity Executive Committee. While leading MSPE Asia over 14 years, Mr. Sun managed and fully invested three Pan-Asian funds totaling $3.7 billion of capital deployed across approximately 60 buyout and growth investments. Mr. Sun’s private equity investing led to Asian Venture Capital Journal naming him ‘‘China Private Equity Professional of the Year’’.\n\nPrior to MSPE Asia, Mr. Sun spent 10 years as an M&amp;A banker at Morgan Stanley Investment Banking Division and as an M&amp;A lawyer at Simpson Thacher &amp; Bartlett. During the course of his career, Mr. Sun has negotiated, structured and led dozens of merger, acquisition and divestiture transactions around the world. These M&amp;A transactions have involved both public and private company deal processes and have primarily been cross-border in nature.\n\n&amp;#x200B;\n\n**MARC CHAN**  \n**President**\n\nMarc Chan is the President of Poema Global. Mr. Chan is a serial entrepreneur, manager and investor with over 35 years of experience. Currently, he serves as the Executive Director of Amprion Inc., where he is actively involved in technology and product roadmaps, services positioning, market strategies and key management hiring. In 2000, he co-founded the networking equipment provider Harbor Networks, which was acquired by a large strategic investor. Prior to Harbor Networks, he founded Huacomm, a telecom and networks system integration firm in 1997 and continues to serve as an Executive Director where he is involved with business operations as well as marketing and distribution channel strategies. In addition, Mr. Chan serves as an advisor to several global private equity funds, including the Limited Partner Advisory Committee of Princeville Capital. He has 20 years of investment experience across numerous firms as a lead and core strategic advisor, including ArcSoft Inc. (SHA: 688088, Internet &amp; Software) and OM Holdings Ltd. (ASX: OMH, Advanced Materials).  \n\n\n**Joaquin Rodriguez Torres**  \n**Co-Chairman**\n\nJoaquin Rodriguez Torres is the Co-Chairman of Poema Global and the Co-Founder of Princeville Capital. An experienced corporate finance advisor and investor with over 20 years of experience in the technology sectors across Asia, U.S. and Europe. Mr. Rodriguez Torres’ advisory clients include leading technology companies, such as Alibaba, Cisco Systems, MercadoLibre, NXP Semiconductors, TAL Education, Tencent and Xiaomi, among others. He has advised in many award-winning transactions throughout his career, as well as on SPAC IPOs and successful subsequent mergers. Currently, he is a member of the board of directors in a voting or an observer or advisory capacity at several technology companies, including Cue &amp; Co., Doctor on Demand, Hipac, Remitly and Versa Networks.\n\nMr. Rodriguez Torres was formerly a managing director at Deutsche Bank in Silicon Valley and Asia for 11 years, holding various leadership roles, including the Head of Technology, Media and Telecom in Asia and a member of the Corporate Finance Advisory Board. Prior to moving to Asia in 2008, he spent eight years in Silicon Valley at Deutsche Bank and Lehman Brothers, advising leading technology companies. Throughout his career, Mr. Rodriguez Torres has executed over 120 corporate finance transactions globally with an aggregate value of more than $125 billion, including raising more than $30 billion in 25 global IPOs. Prior to moving to the U.S. in 1998, Mr. Rodriguez Torres founded and led multiple tech start-ups in Latin America. He holds a B.S. with honors from Universidad Catolica Argentina and an M.B.A. with honors from the University of Virginia Darden School of Business. He is also currently the vice-chairman of the Global Advisory Council at the University of Virginia Darden School of Business. Mr. Rodriguez Torres is fluent in English, Spanish and Portuguese.  \n\n\n**Investors**\n\n**Samuel Yin** \\- Dr. Samuel Yin is an investor in Gogoro. As one of Asia's most successful entrepreneurs, Dr. Yin’s diverse business ventures include retail, sustainable technology, healthcare, financial services, property development and textiles. Dr. Yin’s recent achievements include the successful expansion of his hypermarket chain RT-Mart into China and the successful acquisition and growth of Nan Shan Life Insurance (AIG) in Taiwan.\n\n**Panasonic** \\- Panasonic is a strategic partner and investor in Gogoro. Panasonic is a worldwide leader in the development and engineering of electronic technologies and solutions for customers in residential, non-residential, mobility and personal applications. Since it's founding in 1918, the company has expanded globally and now operates 468 subsidiaries and 94 associated companies worldwide.  \n\n\n**Generation Investment Management LLP** \\- Generation Investment Management LLP is dedicated to long-term investing, integrated sustainability research, and client alignment. It was founded with strong conviction for how sustainability risks and opportunities directly affect long-term business profitability. It is an independent, private, owner-managed partnership established in 2004 and headquartered in London, with approximately $17 billion in assets under management. Its chairman is former Vice President of the United States Al Gore and its senior partner is David Blood. The Growth Equity strategy invests in businesses that will help accelerate the transition to a sustainable, low carbon economy.  \n\n\n**Temasek (Singapore sovereign wealth fund)** \\- Incorporated in 1974, Temasek is an investment company headquartered in Singapore. Supported by 10 offices internationally, Temasek owns a S$275 billion (US$196b, €184b) portfolio as at 31 March 2017, mainly in Singapore and Asia. Its portfolio covers a broad spectrum of industries: financial services; telecommunications, media &amp; technology; transportation &amp; industrials; consumer &amp; real estate; life sciences &amp; agriculture; as well as energy &amp; resources.  \n\n\n**ENGIE** \\-ENGIE is committed to taking on the major challenges of the energy revolution, towards a world more decarbonized, decentralized and digitalized. The Group aims to become the leader of this new energy world by focusing on three key activities for the future: low carbon generation in particular from natural gas and renewable energy, energy infrastructure and efficient solutions adapted to all its customers (individuals, businesses, territories, etc.). Innovation, digital solutions and customer satisfaction are the guiding principles of ENGIE’s development. ENGIE is active in around 70 countries, employs 150,000 people worldwide and achieved revenues of €66.6 billion in 2016. The Group is listed on the Paris and Brussels stock exchanges (ENGI) and is represented in the main financial indices.  \n\n\n**Sumitomo Corporation** \\- Sumitomo Corporation (“SC”) is a leading Fortune 500 global trading and business investment company with 107 locations in 65 countries and 22 locations in Japan. The entire SC Group consists of more than 800 companies and nearly 70,000 personnel. SC conducts commodity transactions in all industries utilizing worldwide networks, provides related customers with various financing, serves as an organizer and a coordinator for various projects, and invests in companies to promote greater growth potential. SC’s core business areas include Metal Products, Transportation and Construction Systems, Environment and Infrastructure, Media, Network, Lifestyle Related Goods and Services, Mineral Resources, Energy, and Chemical and Electronics.\n\nEarlier investors include the Taiwan government’s National Development Fund.\n\n**Sources**  \n[https://www.gogoro.com/news/powered-by-gogoro-network/](https://www.gogoro.com/news/powered-by-gogoro-network/) Aug 6 2019 [https://www.gogoro.com/news/expansion-to-south-korea/](https://www.gogoro.com/news/expansion-to-south-korea/) Aug 27 2020 [https://www.gogoro.com/news/tai-ling-industry-partners-with-gogoro/](https://www.gogoro.com/news/tai-ling-industry-partners-with-gogoro/) Oct 31 2020 [https://www.gogoro.com/news/gogoro-x-michelin/](https://www.gogoro.com/news/gogoro-x-michelin/) Nov 25 2020 [https://www.gogoro.com/news/emoving-pbgn/](https://www.gogoro.com/news/emoving-pbgn/) Nov 26 2020  \n[https://www.prnewswire.com/news-releases/hero-motocorp-and-gogoro-announce-strategic-partnership-to-accelerate-the-shift-to-electric-transportation-in-india-301273429.html](https://www.prnewswire.com/news-releases/hero-motocorp-and-gogoro-announce-strategic-partnership-to-accelerate-the-shift-to-electric-transportation-in-india-301273429.html) Apr 21 2021  \n[https://www.prnewswire.com/news-releases/gogoro-announces-partnership-with-dcj-and-yadea-to-build-battery-swapping-network-in-china-301293205.html](https://www.prnewswire.com/news-releases/gogoro-announces-partnership-with-dcj-and-yadea-to-build-battery-swapping-network-in-china-301293205.html) May 18 2021  \n[https://www.prnewswire.com/news-releases/foxconn-and-gogoro-announce-strategic-partnership-to-accelerate-the-expansion-of-gogoros-battery-swapping-system-and-smartscooters-301318016.html](https://www.prnewswire.com/news-releases/foxconn-and-gogoro-announce-strategic-partnership-to-accelerate-the-expansion-of-gogoros-battery-swapping-system-and-smartscooters-301318016.html) June 23 2021  \n[https://www.gogoro.com/news/gogoro-partners-with-new-coup-scooter-sharing-service-lanunching-in-berlin-today/](https://www.gogoro.com/news/gogoro-partners-with-new-coup-scooter-sharing-service-lanunching-in-berlin-today/) Aug 03 2016  \n[https://www.gogoro.com/news/gogoro-coup-paris-expansion-summer-2017/](https://www.gogoro.com/news/gogoro-coup-paris-expansion-summer-2017/) May 18 2017  \n[https://www.gogoro.com/news/coup-smartscooter-sharing-expands-to-spain/](https://www.gogoro.com/news/coup-smartscooter-sharing-expands-to-spain/) Jan 29 2018  \n[https://www.gogoro.com/news/expansion-to-south-korea/](https://www.gogoro.com/news/expansion-to-south-korea/) Aug 27 2019[https://www.prnewswire.com/news-releases/guidehouse-insights-ranks-gogoro-as-the-global-leader-in-light-electric-vehicle-battery-swapping-301364689.html](https://www.prnewswire.com/news-releases/guidehouse-insights-ranks-gogoro-as-the-global-leader-in-light-electric-vehicle-battery-swapping-301364689.html) Aug 30 2021  \n[https://www.forbes.com/sites/ralphjennings/2021/09/16/taiwanese-electric-scooter-maker-gogoro-to-go-public-in-spac-merger-plans-regional-expansion/?sh=7b221f864fda](https://www.forbes.com/sites/ralphjennings/2021/09/16/taiwanese-electric-scooter-maker-gogoro-to-go-public-in-spac-merger-plans-regional-expansion/?sh=7b221f864fda) Sep 16 2021  \n[https://www.prnewswire.com/news-releases/gogoro-reaches-400-000-monthly-battery-swapping-subscribers-surpasses-200-million-battery-swaps-301346664.html](https://www.prnewswire.com/news-releases/gogoro-reaches-400-000-monthly-battery-swapping-subscribers-surpasses-200-million-battery-swaps-301346664.html) Aug 3 2021  \n[https://www.prnewswire.com/news-releases/gogoro-a-technology-leader-in-urban-electric-mobility-and-battery-swapping-to-list-on-nasdaq-through-a-merger-with-poema-global-holdings-corp-301378323.html](https://www.prnewswire.com/news-releases/gogoro-a-technology-leader-in-urban-electric-mobility-and-battery-swapping-to-list-on-nasdaq-through-a-merger-with-poema-global-holdings-corp-301378323.html) Sep 16 2021  \n[https://www.prnewswire.com/news-releases/gogoro-launches-battery-swapping-in-china-301396659.html](https://www.prnewswire.com/news-releases/gogoro-launches-battery-swapping-in-china-301396659.html) Oct 10 2021  \n[https://www.prnewswire.com/news-releases/yadea-reveals-new-huan-huan-vehicle-series-301396875.html](https://www.prnewswire.com/news-releases/yadea-reveals-new-huan-huan-vehicle-series-301396875.html) Oct 11 2021  \n[https://www.prnewswire.com/news-releases/enel-x-and-gogoro-partner-to-make-the-power-grid-in-taiwan-smarter-301408260.html](https://www.prnewswire.com/news-releases/enel-x-and-gogoro-partner-to-make-the-power-grid-in-taiwan-smarter-301408260.html) Oct 26 2021  \n[https://www.prnewswire.com/news-releases/gojek-and-gogoro-announce-strategic-partnership-to-electrify-two-wheel-transportation-in-indonesia-301413659.html](https://www.prnewswire.com/news-releases/gojek-and-gogoro-announce-strategic-partnership-to-electrify-two-wheel-transportation-in-indonesia-301413659.html) Nov 2 2021  \n[https://www.prnewswire.com/news-releases/gogoro-recognized-by-frost--sullivan-for-revolutionizing-the-electric-two-wheeler-market-with-its-swappable-battery-approach-301421991.html](https://www.prnewswire.com/news-releases/gogoro-recognized-by-frost--sullivan-for-revolutionizing-the-electric-two-wheeler-market-with-its-swappable-battery-approach-301421991.html) Nov 11 2021  \n[https://www.prnewswire.com/news-releases/gates-and-gogoro-announce-exclusive-strategic-partnership-to-accelerate-sustainable-urban-transportation-301424849.html](https://www.prnewswire.com/news-releases/gates-and-gogoro-announce-exclusive-strategic-partnership-to-accelerate-sustainable-urban-transportation-301424849.html) Nov 16 2021  \n[https://www.taiwannews.com.tw/en/news/3554446](https://www.taiwannews.com.tw/en/news/3554446) Sep 17 2018 [https://www.taiwannews.com.tw/en/news/4270103](https://www.taiwannews.com.tw/en/news/4270103) Aug 14 2021 [https://www.taiwannews.com.tw/en/news/3734131](https://www.taiwannews.com.tw/en/news/3734131) June 27 2019\n\n[https://www.gogoro.com/about/investors/](https://www.gogoro.com/about/investors/)\n\n[https://www.poema-global.com/](https://www.poema-global.com/)\n\nInvestor Presentation [https://cdn.gogoro.com/resources/pages/about/investors/attachments/Gogoro\\_Poema\\_Presentation\\_210916\\_DELIVER\\_S.pdf](https://cdn.gogoro.com/resources/pages/about/investors/attachments/Gogoro_Poema_Presentation_210916_DELIVER_S.pdf)\n\nDisclosure: Holding 68,000 Warrants - 11/21/2021  \nDisclaimer: Not financial advice",
        "subreddit": "SPACs",
        "title": "PPGH - Gogoro DD Part 2",
        "url": "https://www.reddit.com/r/SPACs/comments/qyv7wb/ppgh_gogoro_dd_part_2/",
        "created": 1637530906.0
    },
    {
        "author": "FinancialWhoas",
        "created_utc": 1637167647,
        "id": "qw3f2w",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "TLDR: I did a bunch of math based on some reasonably good ideas to determine a selection of stocks worth investing in. Tables of stocks found below. My diamond hands are so rough on my fleshy...forearms. I can't type anymore.\n\n# Observations/Assumptions\n\nBefore you jump down my throat, these are simplified observations/assumptions, not internationally agreed upon mandates from heaven. Okay, now you can jump down my throat.\n\n* Companies with strong financials, a competitive advantage, good management, a sustainable business model, etc. tend to do better than companies missing one or more of those attributes.\n* For most people it is impossible to time the market\n* Stock prices have all available information priced into them.\n* The markets are relatively efficient over the long-term.\n* [Index funds have been shown to be the most successful stock investing instrument for most people](https://freakonomics.com/podcast/stupidest-money/)\n* [Index fund returns, such as the S&amp;P 500, are now predominately determined by a handful of extremely large, mostly tech stocks.](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111)\n* [Most funds do not beat the index over a long period](https://finance.yahoo.com/news/dont-pay-investment-adviser-beat-144400899.html).\n* The cost of stock trades at most firms is now $0.00 (yes, simplified)\n* During times of volatility, companies that had poor financials will likely find it challenging to survive.\n* [Zombie companies](https://finance.yahoo.com/news/zombie-companies-hiding-uncomfortable-truth-183246812.html) are able to survive for longer periods during times of extremely cheap debt.\n* Index funds have these 3 issues that are hard to get around:\n   * You are unable to effectively [Tax-Loss Harvest](https://www.investopedia.com/articles/taxes/08/tax-loss-harvesting.asp) even though many of the holdings that make up the index would have had losses, thereby reducing the return compared to directly investing in that same set of stocks in the same proportions.\n   * You have no control over the holdings within the fund and may be supporting things you don’t want to support.\n   * Due to the way the index works, any large stock that becomes part of the index is potentially a huge drag on the index. This happened when Tesla was going to be added on 12/21/2020, which was announced on 11/16/2020, forcing funds to buy the stock at the same time driving up the price, which had already been driven up by people buying the stock knowing it was then going to get added to the index forcing more people to buy the stock. If you think it sounds kind of circular, that’s because it is.\n\n# Hypothesis\n\nUsing industry benchmarking against the best of the best of the best companies in each industry in order to purchase only the best companies in equal measure should provide a well-diversified portfolio that over the long term should be able to beat the S&amp;P 500.\n\n# Experiment 2020\n\n750 largest US stocks were analyzed against their peers in their industry (Industry details available further down the post). Stocks were given a score based on their relative percentage compared to the industry index. For example, each companies’ average ROE of the last 4 years was compared to this index value with the following type of breakdown:\n\n* ROE &lt; Index ROE = Poor = 1\n* ROE &gt; Index ROE = Moderate = 2\n* ROE &gt; 150% of Index ROE = Great = 3\n\nFor example, the ROE communication services industry index value used was 10.10%. If a communication services company had a ROE average of 9%, they would receive a poor rating. If they had a ROE of 10.5% they would receive a moderate rating. If they had a ROE of 25% they would receive a great rating.\n\nThis was done for all of the metrics below:\n\n* ROE\n* Revenue Growth %\n* EBITDA %\n* FCF %\n\nThe relative scores used for each of the metrics was tweaked until there was a good distribution of results. e.g., if the 150% revenue growth only found 5 companies with a Great rating, that may need to be decreased to 125% for a better distribution.\n\nAny stock that received a poor in any of the 4 metrics was eliminated.\n\nExample below on ROE:\n\n[ROE Example](https://preview.redd.it/unapdml3m6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=76d615130616fb32c179674306cb461d3c0dcb2d)\n\nThat left 53 stocks. EBITDA was then analyzed to see if it was declining, and if so, it too was eliminated.\n\nThis left 45 stocks. These 45 were reviewed more thoroughly. What did the company do? What were their competitive advantages? Are they currently in any lawsuits? Does their debt look out of control? Do I see them being a long-term sustainable choice? Is their IP about to expire? Has WSB said it's a buy? Essentially boiling down to: Is there any reason that I want to exclude them?\n\nThat left 26 across 7 sectors. \n\n**2020 Industries**\n\n[2020 Industry Breakdown](https://preview.redd.it/o9llcazgm6081.png?width=386&amp;format=png&amp;auto=webp&amp;s=64e5c541e836a173e373113b5d13cc5b7648f57a)\n\nThese 26 stocks were bought in equal amounts in July 2020, August 2020, and September 2020. To easily perform time weighted analysis of these stocks and determine if there was an opportunity cost, 10% of the total purchase each period was also allocated to VFIAX.\n\n2020 Experiment Results July, August, and September 2020 purchases to 11/16/2021\n\n* **S&amp;P 500** total return reinvested dividends: **49.09%**\n* **My 26 Stock Index** including reinvested dividends: **61.53%**\n\nCan we do it again this year? Should we go bigger? Yes.\n\n# Experiment 2021\n\n2,850 tickers of the largest US stocks were identified as the initial list. The stocks had their last 5 years averaged for each of nine metrics:\n\n* Revenue Growth % - shows growth rate of the company\n* Profit Margin – shows how effective the business is at making money\n* Operating Margin – shows how much money the company earns on its revenue\n* FCF Margin – shows how efficient a company is with their cash\n* EBITDA Margin – shows a companies’ operating profitability\n* ROE – shows how well management balances profits, leverage, and assets to make money\n* ROA – shows how effectively a company utilizes its assets to generate profits\n* ROIC – shows how effective the company is at using its money to generate returns\n* Debt/Equity Ratio – shows the financial stability of a company\n\nMore metrics were used due to the increased data set. These stocks were then grouped by industry, and the average of the averages is taken to determine the industry average for the last 5 years; I switched to median based on a few outliers really throwing the average for some of the metrics. If that was confusing, here is an example:\n\n· 3 stocks that make up an industry averaged -10%, 15%, and 20% ROE over the last 5 years. The median over the last 5 years for that industry is then 15% and all 3 of those stocks will be compared to that benchmark.\n\nEach stock was compared against its Industry benchmark for each of the metrics and given a score 1=Poor, 2=Good, 3=Great as well as a composite score out of 27, from 9 metrics with a max score of 3 in each of the metrics. The scores are based on how much better they are then the average. I measured them against the benchmark using the same methodology as previously performed: Poor &lt; 100%, Good &lt; 150%, Great &gt; 150%. Again, these may be tweaked slightly depending on the particular metric to find a useful distribution.\n\nI also ranked every stock against the entire list for each of the metrics and overall. For those wondering, the best stock in this ranking was CORT with a score of 2,097 and the worst was CYCN with a score of 23,095. Because the overall rank is a combination of 9 categories with values ranging from 1-2791, the theoretical best a company could do would be 9 and the theoretical worst a company could do would be 25,119. Anyone wondering why the number of stocks doesn’t match the original input (congratulations on your reading comprehension), this is primarily due to mergers/acquisitions or the stock being taken private. Another stock was acquired during the analysis, changing the max number yet again.\n\nHere is an example showing Aerospace &amp; Defense scoring:\n\n[Aerospace and Defense Example Scoring](https://preview.redd.it/s80995tpo6081.png?width=615&amp;format=png&amp;auto=webp&amp;s=58fbc4aa6a06985cbedd1d4bf26d678b94bcc977)\n\nHere is an example showing growth scoring (the Revenue Growth column is the company’s most recent year):\n\n[Growth Scoring](https://preview.redd.it/12pnpz90p6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=e4d32a3469e261be37cba38f28c9ca39ef0552e0)\n\nHere is an example of the visualizations for the data:\n\n[Data Visualizations](https://preview.redd.it/112baw12p6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=1c55275971eba7f3f0d316f84a275da53572fcf8)\n\nI applied a series of filters to eliminated unwanted noise. I looked at the top 5 stocks per industry (extending out for any ties), any stock that scored a 25, 26, or 27 on the composite, or any stock that had a high enough overall rank to justify being reviewed.\n\nNext, I read the description of \\~300 stocks and looked through their financials for any inconsistencies, such as one huge year throwing off their average, profit margins higher than operating margins, highly leveraged companies with poor growth, etc. My favorite find was that Chemed Corporation provides hospice/palliative care and owns Roto-Rooter. Yes, I did end up keeping them (how could you not?), no there are not great synergies between the sectors of the business, yes, they are aware of this. I also eliminated industries I wasn’t interested in reviewing, such as REITS due to the need to look at different metrics like FFO, Oil and Gas because it’s oil and gas, etc. These activities eliminated \\~150. I would like to get back to REITs, but I’d need to build a separate model.\n\nI then looked at each stock in more detail compared to its peers that made the cut. Are all the rest of them in the double digits for growth, are the profit margins substantially less, which one is in a better debt situation, did WSB say it's a buy, etc. Who deserves to be on this list? This eliminated \\~75.\n\nWe were down to 84 stocks at this point. I then looked at each company's investor presentation, annual report, etc. to better understand what the company does, their revenue model, risks, etc. I was not nearly as thorough on this portion this year compared to last year just due to the substantial increase in companies, 26 vs 84. My hourly wage at McDonald was going to be better than my returns from the analysis if I took too long. I only eliminated 1 company which left us at the grand total of 83 companies across 31 industries. Breakdown below:\n\n**Industry**\n\n[Industry Breakdown](https://preview.redd.it/r9rt903pp6081.png?width=388&amp;format=png&amp;auto=webp&amp;s=95168c9e7c65cf548f4bd7c4be45ffaf9b1ac46b)\n\nI then purchased all of these in equal proportion in April, May, and July of 2021.\n\n2021 Experiment Results April, May, and July 2021 purchases to 11/16/2021:\n\n* **S&amp;P 500** total return including reinvested dividends: **11.93%**\n* **My 2021 Stock Index** including reinvested dividends: **14.26%**\n\n# Industry Classification\n\n* For Experiment 2020, the Sector was used to determine how companies should be compared.\n   * This is made up of 11 sectors such as Information Technology, Communication Services, Utilities, etc.\n   * This seemed to be too restrictive and compared companies against each other that aren’t really accurate comparisons. See the example on ROE below.\n* For Experiment 2021 I used the Microsoft Excel Stock function to pull industries for all the stocks.\n   * This looks like it pulls data mostly from Industry and Sub-industry.\n   * This was successful on 98% of the stocks and for the final 2% I manually classified based on the taxonomy in the [Global Industry Classification Standard](https://en.wikipedia.org/wiki/Global_Industry_Classification_Standard).\n   * I ended up needing to collapse the structure a little further. Originally there were 55 classes with many of the classes having less than 10 stocks. I was able to collapse this to 44 classes. This will likely be tweaked a little further next year as I had mathematical issues dealing with averages/medians that were negative. There were also just too many categories with similar enough results that they could be combined such as biotech and pharmaceutical.\n\n# 2020 Stocks\n\nABMD\n\nADBE\n\nANET\n\nBWXT\n\nCRL\n\nDG\n\nENR\n\nETSY\n\nEXEL\n\nICLR\n\nISRG\n\nKLAC\n\nLKQ\n\nLRCX\n\nMNST\n\nMPWR\n\nMTCH\n\nOLED\n\nPAYC\n\nPHM\n\nTER\n\nTTD\n\nUI\n\nVEEV\n\nVMW\n\nVRTX\n\n# 2021 Stocks\n\nAAON\n\nAAPL\n\nACN\n\nADBE\n\nAEIS\n\nALGN\n\nAMAT\n\nANET\n\nAPH\n\nATR\n\nATVI\n\nAX\n\nBLD\n\nCDNS\n\nCGNX\n\nCHD\n\nCHE\n\nCORT\n\nCPRT\n\nDLB\n\nDORM\n\nEPAM\n\nESNT\n\nETSY\n\nEW\n\nEXPD\n\nEXPO\n\nFAST\n\nFB\n\nFIX\n\nFOXF\n\nFTNT\n\nGGG\n\nGOOG\n\nGRMN\n\nHEI.A\n\nHELE\n\nIDA\n\nINS\n\nINTC\n\nINTU\n\nIRBT\n\nISRG\n\nCCSI\n\nZD\n\nKLAC\n\nLRCX\n\nLULU\n\nMASI\n\nMED\n\nMKSI\n\nMKTX\n\nMNST\n\nMORN\n\nMPWR\n\nMSFT\n\nNMIH\n\nNRC\n\nNVDA\n\nODFL\n\nOLED\n\nOLLI\n\nPAYC\n\nPAYX\n\nPRLB\n\nQLYS\n\nREGN\n\nRMR\n\nROAD\n\nSCCO\n\nSFBS\n\nSLP\n\nSTMP\n\nTDY\n\nTER\n\nTREX\n\nTROW\n\nTTD\n\nTYL\n\nUI\n\nV\n\nVEEV\n\nVRTX\n\nWAL\n\nYETI\n\n# Notes\n\nI partnered up for both the 2020 and 2021 experiments. This was critical for both expanding my initial idea, brainstorming methods to build the model, and reviewing the work done for errors. This was a team effort, and I by no means deserve all the credit or hate.\n\nAll returns are showing reinvested dividends in the total return.\n\n\\*I am not a financial advisor or anything else I should put here to ensure it is clear that I did this for myself and am sharing my results and am in no way forcing you to push buttons to buy things you don’t understand or requiring justification for this run on sentence and henceforth.\n\n\\*\\*\\*\\*. Past results are no guarantee of future returns.",
        "subreddit": "wallstreetbets",
        "title": "One Word For You: I Bet I Can Beat the S&amp;P 500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qw3f2w/one_word_for_you_i_bet_i_can_beat_the_sp_500/",
        "created": 1637196447.0
    },
    {
        "author": "jack_hof",
        "created_utc": 1637448999,
        "id": "qyh0ch",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Under their new CEO they seem to be back on track in their roadmap after falling behind the competition. With the processor shortage they appear to be one of the only fabricators with enough capacity to help ease the supply issue, and they are investing heavily in new fabrication factories to produce not only for themselves but for other customers in the future.",
        "subreddit": "CanadianInvestor",
        "title": "Do you guys think Intel is a good investment?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qyh0ch/do_you_guys_think_intel_is_a_good_investment/",
        "created": 1637477799.0
    },
    {
        "author": "r2002",
        "created_utc": 1637297299,
        "id": "qx8j2l",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Citing the need to strengthen the semiconductor supply chain, [Ford and GFS announced](https://www.theverge.com/2021/11/18/22789413/ford-gm-chip-shortage-globalfoundries-qualcomm-tsmc) a partnership\n\n&gt; “to advance semiconductor manufacturing and technology development within the United States.”\n\nNot to be outdone, [GM announced](https://archive.fo/WlCtt) same day that it will be co-developing chips:\n\n&gt;GM will be working to develop the chips with Qualcomm Inc., STMicroelectronics NV, Taiwan Semiconductor Manufacturing Co., Renasas Electronics Corp., ON Semiconductor Corp., NXP Semiconductors NV and Infineon Technologies AG, Reuss said.\n\nI'm curious why these articles made no mention of Intel. If the goal is to strengthen American supply chain, wouldn't Intel be a key part of the plan? Or are these lower technology chips that's not part of Intel's key roadmap?\n\nAlso, what do you guys think of these other companies that's not often mentioned here like STMSTMicroelectronics, Renasas, On Semi, NXP, and Infineon? Are they good investments? Is GFS now a buy?",
        "subreddit": "stocks",
        "title": "Ford &amp; GM announce new partnership with GlobalFoundries &amp; Qualcomm (but what about Intel?)",
        "url": "https://www.reddit.com/r/stocks/comments/qx8j2l/ford_gm_announce_new_partnership_with/",
        "created": 1637326099.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1635799452,
        "id": "qkncaw",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "stocks",
        "title": "How does Xerox have a higher P/E than Intel?",
        "url": "https://www.reddit.com/r/stocks/comments/qkncaw/how_does_xerox_have_a_higher_pe_than_intel/",
        "created": 1635828252.0
    },
    {
        "author": "Inner_Perspective320",
        "created_utc": 1636229051,
        "id": "qo82z0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Started investigating INTC and some competitors to form a strategy and in doing so found some conflicting info. \n\nLooked at some long term stock forecasts for both companies here: \n\n[INTC Forecast](https://money.cnn.com/quote/forecast/forecast.html?symb=intc)\n\n[NVDA Forecast](https://money.cnn.com/quote/forecast/forecast.html?symb=NVDA)\n\nGiven the current climate surrounding semiconductors I figured NVDA would be a good play mid to long term; however, it seems that analysts expect the stock price to reduce to roughly 235.0 over the next 12 months. \n\nOn the other hand, the opposite is expected for INTC with the price hitting somewhere in the range of 55.0 to 80.0. \n\nI fully expected NVDA to rise in value and same with INTC for that matter. Is INTC undervalued and NVDA overvalued? Also, is any of CNN Money’s analysis valuable?",
        "subreddit": "StockMarket",
        "title": "INTC v NVDA",
        "url": "https://www.reddit.com/r/StockMarket/comments/qo82z0/intc_v_nvda/",
        "created": 1636257851.0
    },
    {
        "author": "Elleucas",
        "created_utc": 1637377531,
        "id": "qxwbj0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Hey folks. I wanted to make a brief analysis of NVDA stock and its numbers. Market cap peaked around 820B yesterday, with a P/E around 100 and revenues 24B.\nAm I the only one thinking here things are going a little bit too far??\nThere is nothing to justify such a massive market cap. Not even this new thing of metaverse, that indeed is not a trademark and most of big players out there are going to pursue (Facebook in primis; but I suppose google and Amazon will not stay behind).\nBut let’s make some comparison among other big players; intel, market cap 201B, P/E 9,6 (yes 9,6 not 96) and revenue 78B. AMD, market cap 187, P\\E 48 and revenue 14,8 B.\nnvidia Numbers cannot be even compared with competitors, are far out of any logic. Nasdaq is going to the moon only by a few companies (fanng) while all others are left behind… growth stocks heavily hammered and these beasts brought to unreasonable heights.\nAnd between fanng nvdia remain the worst one; looking numbers.\nI may sound stupid but here i see a massive bubble that will have to burst. I made a kamikaze move but I decided to short nvdia. \n\nAny thoughts guys?",
        "subreddit": "wallstreetbets",
        "title": "NVIDIA. Massive bubble or solid investment?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qxwbj0/nvidia_massive_bubble_or_solid_investment/",
        "created": 1637406331.0
    },
    {
        "author": "Mental_Director8295",
        "created_utc": 1636148606,
        "id": "qnletp",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I have been reading a lot about this company, a bunch of ex space X engineers are rolling out compact nuke reactors. Any chance this goes SPAC? Is there any intel anyone might have on this? If you read this week there were a bunch of articles published about them. [radiant nuclear](https://www.radiantnuclear.com)",
        "subreddit": "SPACs",
        "title": "Radiant Nuclear (investment opportunity?)",
        "url": "https://www.reddit.com/r/SPACs/comments/qnletp/radiant_nuclear_investment_opportunity/",
        "created": 1636177406.0
    },
    {
        "author": "Madridi77",
        "created_utc": 1637546735,
        "id": "qzadjg",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I am trying to find an ETF thats sold in CAD and has both AMD and NVIDIA! I know of a few but I am not too liking of the % of INTEL or other stocks so is there a way or a website to look at ALL the ETFs that hold both of these stocks and I can go through their holdings to pick one that I like?\n\n\nThanks!",
        "subreddit": "CanadianInvestor",
        "title": "Canadian ETF multiple stock screener?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qzadjg/canadian_etf_multiple_stock_screener/",
        "created": 1637575535.0
    },
    {
        "author": "corporalcorporal",
        "created_utc": 1636080509,
        "id": "qn1jxm",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "I think Intel will hit $60+ a share in early December I want to gamble 2000$, what's a good strategy? What can I lose if it all goes wrong?",
        "subreddit": "wallstreetbets",
        "title": "How do I do a \"call option\"?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qn1jxm/how_do_i_do_a_call_option/",
        "created": 1636109309.0
    },
    {
        "author": "x4tun8x",
        "created_utc": 1637775524,
        "id": "r1amiw",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "If a company does not issue out a dividend.  But they plan to.  How long does it take .... to it to be implemented and issued out?   Is there 1st an announcement. And usually takes like 3 months?\n\nWhen a company is on the verge to issue out dividends. Does that mean stock prices are dropping or will drop/flatten?  \n\nWhy does for example Intel issue dividends but not AMD?  Or Walmart does but not Amazon?",
        "subreddit": "CanadianInvestor",
        "title": "Question about Dividends",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/r1amiw/question_about_dividends/",
        "created": 1637804324.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636360501,
        "id": "qp9ea2",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|TSLA|Tesla Inc|[30](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GME|GameStop Corp|[4](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)\n|QQQ|Invesco QQQ Trust Series 1|[3](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=stockmarket)\n|FB|Facebook Inc|[3](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SPY|SPDR S&amp;P 500 ETF Trust|[3](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)\n|FSD|First Trust High Income Long/Short Fund|[2](https://www.memebergterminal.com/stock/First%20Trust%20High%20Income%20Long%2FShort%20Fund/FSD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/First%20Trust%20High%20Income%20Long%2FShort%20Fund/FSD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TERM|EquityCompass Tactical Risk Manager ETF|[2](https://www.memebergterminal.com/stock/EquityCompass%20Tactical%20Risk%20Manager%20ETF/TERM?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/EquityCompass%20Tactical%20Risk%20Manager%20ETF/TERM?utm_source=rsmb&amp;utm_medium=stockmarket)\n|AMZN|Amazon.com Inc|[2](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb&amp;utm_medium=stockmarket)\n|VOO|Vanguard S&amp;P 500 ETF|[2](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GM|General Motors Company|[2](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb&amp;utm_medium=stockmarket)\n|INTC|Intel Corporation|[2](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|HIMX|Himax Technologies Inc|[2](https://www.memebergterminal.com/stock/Himax%20Technologies%20Inc/HIMX?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Himax%20Technologies%20Inc/HIMX?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MSFT|Microsoft Corporation|[2](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SATS|EchoStar Corporation|[2](https://www.memebergterminal.com/stock/EchoStar%20Corporation/SATS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/EchoStar%20Corporation/SATS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|APR|Apria Inc|[2](https://www.memebergterminal.com/stock/Apria%20Inc/APR?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Apria%20Inc/APR?utm_source=rsmb&amp;utm_medium=stockmarket)\n|LCID|Lucid Group Inc. Common Stock|[2](https://www.memebergterminal.com/stock/Lucid%20Group%20Inc.%20Common%20Stock/LCID?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Lucid%20Group%20Inc.%20Common%20Stock/LCID?utm_source=rsmb&amp;utm_medium=stockmarket)\n|AMC|AMC Entertainment Holdings Inc|[2](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SPXU|ProShares UltraPro Short S&amp;P500|[1](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20Short%20S%26P500/SPXU?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20Short%20S%26P500/SPXU?utm_source=rsmb&amp;utm_medium=stockmarket)\n|NHS|Neuberger Berman High Yield Strategies Fund Inc|[1](https://www.memebergterminal.com/stock/Neuberger%20Berman%20High%20Yield%20Strategies%20Fund%20Inc/NHS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Neuberger%20Berman%20High%20Yield%20Strategies%20Fund%20Inc/NHS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|JD|JD.com Inc|[1](https://www.memebergterminal.com/stock/JD.com%20Inc/JD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/JD.com%20Inc/JD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|FRDPX|FRANKLIN RISING DIVIDENDS FUND CLASS A|[1](https://www.memebergterminal.com/stock/FRANKLIN%20RISING%20DIVIDENDS%20FUND%20CLASS%20A/FRDPX?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/FRANKLIN%20RISING%20DIVIDENDS%20FUND%20CLASS%20A/FRDPX?utm_source=rsmb&amp;utm_medium=stockmarket)",
        "subreddit": "StockMarket",
        "title": "I scraped r/stockmarket for the top ticker mentions in the last 24H. Here are the results (Monday November 08, 2021)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qp9ea2/i_scraped_rstockmarket_for_the_top_ticker/",
        "created": 1636389301.0
    },
    {
        "author": "seigy",
        "created_utc": 1636239707,
        "id": "qobi7c",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Over the past several weeks there has been a lot of commitments to spend money from both the public and private sectors. I have attempted to capture the biggest spending plans to follow the money for my investments. Even with reading and watching market news as much as I can, I cannot catch it all so please help me to add any big spending plans I missed or call me out if you think I am drifting off a money flow assessment.\n\nI have lumped these into groups based on core businesses.  Many of the stocks could be substituted for like companies (I selected ones that come up on some of my different stock screeners or are trending). To reiterate, I am going with themes here not always these specific stocks. For transparency, I do own maybe 25% of the different companies listed below and will buy some of the others on Monday.\n\nSemiconductor fabs and foundries: Samsung $205B/3yrs, Micron $150B/10yrs, Intel $115B/3yrs, Taiwan Semi $100B/3yrs, United Micro $2B in 2022, SK Hynix $235B/10yrs. *Major plays* $LRCX, $ASML, $AMAT, $TER. *Minor plays* $NUE, $X, $CLF, $VMC, $FCX, $URI, $CAT.\n\nGovernment infrastructure bill: $550B/5yrs. *Major plays* $URI, $CAT, $VMC, $NUE, $X, $CLF, $FCX, $VMC.\n\nBig Tech: Apple $450B/5yrs, FB $10B/yr. *Major plays* $NVDA, $AMD, $INTC, $MU, $WDC, $STM, $ADI, $ON, $TXN.  *Minor plays* $LRCX, $ASML, $AMAT, $TER, $TSM, $GFS, $UMC, $NUE, $X, $CLF, $VMC, $FCX, $URI, $CAT.\n\nEVs: GM $35B/4yrs, Ford $30B/4yrs, Toyota $14B/10yrs. *Major plays* $NUE, $X, $CLF, $WOR, $AA, $ALB, $LAC, $ABML, $FCX, $SCCO, $MP, $LYC, $NXPI, $TXN, $NVDA, $ON. *Minor plays* $URI, $CAT, $VMC, $FCX, $HON, $EMR, $PH, $ETN, $TSM, $GFS, $UMC.",
        "subreddit": "stocks",
        "title": "Following the money flows from Oct/Nov announcements",
        "url": "https://www.reddit.com/r/stocks/comments/qobi7c/following_the_money_flows_from_octnov/",
        "created": 1636268507.0
    },
    {
        "author": "UrMomsFriend1",
        "created_utc": 1636477292,
        "id": "qq83dz",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I'm also very open to any criticism of my choices and advice for possible new additions to this portfolio. What I'm truly wondering is, in your opinion (and I understand it's a very opinionated question) will I beat the SPY index with this portfolio? Will it holdup over time while I slowly add to it. I'm only 21 so my investment knowledge is by no means vast. Thank you very much. \n\nAmd - intel - Jepi(6%yield) - AAPL - FB - Home depot - FCEL - Nio - tsla - SPY - BAC - SCHS - BRK.B",
        "subreddit": "investing",
        "title": "In your opinion, what's the percent gain ID have for a portfolio with equal parts these tickers. Any any advice?",
        "url": "https://www.reddit.com/r/investing/comments/qq83dz/in_your_opinion_whats_the_percent_gain_id_have/",
        "created": 1636506092.0
    },
    {
        "author": "Tomkila",
        "created_utc": 1636382434,
        "id": "qpf0qg",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hello everyone, I am an independent investor, I am a financial technical analyst and I am looking for young companies that can become huge in 5/10 years.\nI have a lot of patience, experience has helped me to understand that time can be a faithful friend if you know how to accept it as part of you.\n\nI currently have a very large market share of a Californian company that has gone from being a company with just 40 million market caps to a maximum of $ 2 billion.\n\nBefore talking about my company, I want to bring a couple of facts that everyone should read\n\n“Small-cap performance was outstanding from Sept. 24, 2020 to March 15, 2021 as the S&amp;P 600 – another small-cap index – gained 69%, or more than three times the return of large caps. Since March, small-cap stocks have leveled off, and future returns appear less promising.\n\n\"While 2020 was a banner year for small caps, this segment of the market has traded generally sideways for the better half of 2021,\" says Mike Loewengart, managing director of investment strategy at E-Trade Financial, an Arlington, Virginia-based brokerage company.”\n\nThe pros of these companies are:\n- Greater yield\n- A winning product or service is enough to become great and steal strong market share\n- Data confirms that small caps outperform the market\n\nThe cons of these companies are:\n- little information available\n- A lot of risk to take\n- It is not said that your best product can make the fortune of your company because the big names steal your patents and exploit the judicial system to their advantage.\n- Growth can take many years and patience is a key factor.\n\nNow, however, let's talk about the company that is doing me as a crypto and major companies: Netlist inc; ticker NLST \n\nCOMPANY\nABOUT NETLIST\nFounded in 2000 and headquartered in Irvine, California, Netlist is a leading provider of high-performance modular memory subsystems to the world’s premier OEMs. Netlist specializes in hybrid memory – the merging of DRAM and NAND flash raw materials to create memory solutions. The Company’s patented memory technologies provide superior performance, and high density in a cost efficient solution. From database to enterprise applications, Netlist serves diverse industries that require superior memory performance to empower critical business decisions in today’s data-driven environment.\nNetlist has a long history of being the first to market with disruptive new products such as the first load-reduced DIMM, HyperCloud®, based on Netlist’s distributed buffer architecture later adopted by the industry for DDR4 LRDIMM. Netlist was also the first to bring NAND flash to the memory channel with its NVvault® NVDIMM. These innovative products built on Netlist’s early pioneering work in areas such as embedding passives into printed circuit boards to free up board real estate, doubling densities via quad-rank double data rate (DDR) technology, and other off-chip technology advances that result in improved performance and lower costs compared to conventional memory.\nNetlist continues this tradition with the introduction of HybriDIMM, the industry’s first Storage Class Memory product built on commodity DRAM and flash. HybriDIMM is the first SCM product to operate in current Intel® x86 servers without BIOS and hardware changes, and the first unified DRAM-NAND solution that scales memory to terabyte storage capacities and accelerates storage to nanosecond memory speeds.\n\nThis company is winning 3 legal battles against 3 famous companies like samsung, micron and google for netlist patent infringement.\n\nThis year it closed a top deal with $ 640 million sk hynix, this is the main reason why a small Californian company went from having a tiny capitalization to being a multi-billion dollar OTC.\n\nThe key to the success of this company will depend on the judgments in the next few days against these companies because netlist holds seminal patents that have revolutionized the semiconductor market and beyond.\n\nDo you know why google is the number one search engine in the world?\nBecause there is the technology of the 912 patent that has allowed to increase the performance and number of data and this technology has led Google to wipe out the competition from Microsoft and duckduckgo.\nIt is no coincidence that for years google pretended that this legal battle for patent infringement did not win.\n\nFor those who want more information there is my subreddit Netlist_ (with the underscore!)\n\nWhy then if netlist has the certainty of the validity of its patent in hand and has evidence in hand as well as testimonials etc. it fails to close this legal battle?\n\nThe answer is that Google has more than 300 experienced lawyers in hand and justice is slow and harmful.\n\nThis thing is a shame for everyone because all the big companies steal the patents of small companies on a daily basis and make a fortune without ever paying a penny of damage.\nFor the few companies that can prove they are right they have to wait a long time, they have to spend tens of millions on trials and lawyers.\n\nNow read these estimates and tell me if this is normal\n\n“95% to 97% of patent infringement lawsuits are settled out of court. Data shows that the overwhelming majority of intellectual property legal cases aren't settled by the courts. In fact, up to 97% of patent infringement lawsuits never make it to trial.6 ago 2021\nhttps://legaljobs.io › blog › patent-lit...\nPatent Litigation Statistics - Feuds about Intellectual Property “\n\nThis is unbelievable!",
        "subreddit": "StockMarket",
        "title": "Can a small company become a major player in less than 5 years?",
        "url": "https://www.reddit.com/r/StockMarket/comments/qpf0qg/can_a_small_company_become_a_major_player_in_less/",
        "created": 1636411234.0
    },
    {
        "author": "jack_hof",
        "created_utc": 1637449075,
        "id": "qyh17g",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Under their new CEO they seem to be back on track in their roadmap after falling behind the competition. With the processor shortage they appear to be one of the only fabricators with enough capacity to help ease the supply issue, and they are investing heavily in new fabrication factories to produce not only for themselves but for other customers in the future.",
        "subreddit": "stocks",
        "title": "Do you guys think Intel is a good investment?",
        "url": "https://www.reddit.com/r/stocks/comments/qyh17g/do_you_guys_think_intel_is_a_good_investment/",
        "created": 1637477875.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636187702,
        "id": "qnw4a4",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|GME|GameStop Corp|[6](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PTON|Peloton Interactive Inc|[6](https://www.memebergterminal.com/stock/Peloton%20Interactive%20Inc/PTON?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Peloton%20Interactive%20Inc/PTON?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TQQQ|ProShares UltraPro QQQ|[6](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20QQQ/TQQQ?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20QQQ/TQQQ?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MRK|Merck &amp; Co. Inc|[5](https://www.memebergterminal.com/stock/Merck%20%26%20Co.%20Inc/MRK?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Merck%20%26%20Co.%20Inc/MRK?utm_source=rsmb&amp;utm_medium=stockmarket)\n|AMD|Advanced Micro Devices Inc|[5](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|QQQ|Invesco QQQ Trust Series 1|[4](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=stockmarket)\n|FB|Facebook Inc|[3](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SPY|SPDR S&amp;P 500 ETF Trust|[3](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)\n|AMC|AMC Entertainment Holdings Inc|[3](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|CMC|Commercial Metals Company|[3](https://www.memebergterminal.com/stock/Commercial%20Metals%20Company/CMC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Commercial%20Metals%20Company/CMC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|COO|The Cooper Companies Inc|[2](https://www.memebergterminal.com/stock/The%20Cooper%20Companies%20Inc/COO?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/The%20Cooper%20Companies%20Inc/COO?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TSLA|Tesla Inc|[2](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)\n|HOOD|Robinhood Markets Inc. Class A Common Stock|[2](https://www.memebergterminal.com/stock/Robinhood%20Markets%20Inc.%20Class%20A%20Common%20Stock/HOOD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Robinhood%20Markets%20Inc.%20Class%20A%20Common%20Stock/HOOD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TSM|Taiwan Semiconductor Manufacturing Company Limited|[2](https://www.memebergterminal.com/stock/Taiwan%20Semiconductor%20Manufacturing%20Company%20Limited/TSM?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Taiwan%20Semiconductor%20Manufacturing%20Company%20Limited/TSM?utm_source=rsmb&amp;utm_medium=stockmarket)\n|RMD|ResMed Inc|[2](https://www.memebergterminal.com/stock/ResMed%20Inc/RMD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ResMed%20Inc/RMD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GFS|GlobalFoundries Inc. Ordinary Shares|[2](https://www.memebergterminal.com/stock/GlobalFoundries%20Inc.%20Ordinary%20Shares/GFS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/GlobalFoundries%20Inc.%20Ordinary%20Shares/GFS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|ICLN|iShares Global Clean Energy ETF|[2](https://www.memebergterminal.com/stock/iShares%20Global%20Clean%20Energy%20ETF/ICLN?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/iShares%20Global%20Clean%20Energy%20ETF/ICLN?utm_source=rsmb&amp;utm_medium=stockmarket)\n|INTC|Intel Corporation|[2](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|UPRO|ProShares UltraPro S&amp;P500|[2](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20S%26P500/UPRO?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20S%26P500/UPRO?utm_source=rsmb&amp;utm_medium=stockmarket)\n|DKNG|DraftKings Inc|[1](https://www.memebergterminal.com/stock/DraftKings%20Inc/DKNG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/DraftKings%20Inc/DKNG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MRNA|Moderna Inc|[1](https://www.memebergterminal.com/stock/Moderna%20Inc/MRNA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Moderna%20Inc/MRNA?utm_source=rsmb&amp;utm_medium=stockmarket)",
        "subreddit": "StockMarket",
        "title": "I scraped r/stockmarket for the top ticker mentions in the last 24H. Here are the results (Saturday November 06, 2021)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qnw4a4/i_scraped_rstockmarket_for_the_top_ticker/",
        "created": 1636216502.0
    },
    {
        "author": "MarxKnewBest",
        "created_utc": 1637189570,
        "id": "qwb64e",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Used to spend a lot of time here in 2018-19. Back then MSFT was still around 100 and TSLA seemed like it wouldn't go much higher. AMD was considered a sort of clow stock and Intel still had some respect. LCID wasn't even a thing. People did talk about PLTR though, even though it was miles from IPO. DonnyJPump was of course the star of the show, making and breaking fortunes with his pearls of wisdom which he tweeted from his morning poop sesh. c\\*\\*\\*\\*o wankers of course were still trying to make themselves heard with their dark magic BS.\n\nWhat I miss most are the retards who ruled this sub. Especially these two old legends, do they post here or are they in Valhalla?",
        "subreddit": "wallstreetbets",
        "title": "Where are luv2fukmarriedwoman and MidgetFarm? Am I too old for this sub?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qwb64e/where_are_luv2fukmarriedwoman_and_midgetfarm_am_i/",
        "created": 1637218370.0
    },
    {
        "author": "Frankelstner",
        "created_utc": 1636413801,
        "id": "qpq3zo",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Himax is a fabless semi based in Taiwan. Yes, Taiwan, very sorry, but hear me out. Let's check some financials.\n\n- Lowest PE in the semi sector: https://finviz.com/screener.ashx?v=121&amp;f=ind_semiconductors&amp;o=pe In case you are anxious because it's barely cheaper than Intel, no worries. The latest earnings are not included yet. The actual PE is 5.8.\n- Lowest forward PE: https://finviz.com/screener.ashx?v=121&amp;f=ind_semiconductors&amp;o=forwardpe\n- Third lowest price per free cash flow: https://finviz.com/screener.ashx?v=121&amp;f=ind_semiconductors&amp;o=pfcf Once again, the latest earnings are not included yet. HIMX is actually at 4.7 here.\n\nSo we can see a reasonable gap to other semis, with about 150% upside to be as unprofitable as plays like MU.\n\nA decent amount of share price depression is expected due to the Taiwan situation, so let's check some Taiwanese chip plays (traded only in Taiwan, hence not tracked by finviz):\n\n- Mediatek: PE of 16.\n- Realtek: PE of 21.\n- Novatek: PE of 8.81. In terms of business, Novatek is fairly close to Himax. Both produce display drivers (the chip that controls a display).\n- HIMX (2 quarters ago): PE of 21.\n\nWhile Taiwanese PEs are not exactly comparable to AMD or NVDA, Himax (right now) is just on a whole other level. Even Novatek shows over 50% upside for HIMX. Novatek also guided down their earnings for next quarter, whereas HIMX expects earnings to increase.\n\nThe main difference between HIMX and Novatek is that HIMX managed to secure some fairly lucrative automotive deals. HIMX commands 33% of the global market for automotive displays, which makes it the largest player. The most important piece of technology here is called TDDI (Touch and Display Driver Integration) which is a single chip that both draws images on the display but also accepts touch input.\n\nTDDIs are a hot topic because they improve/simplify the electronics quite a bit. Anyway, Novatek and some other big players lost the TDDI race pretty hard. HIMX was the first and followed by Synaptics (SYNA) shortly after. Both companies see lots of growth due to being firstcomers.\n\nIn particular, the automotive market will ensure long-term revenue. From a previous SYNA earnings call:\n\n- \"Given the rapid increase in automotive revenue, could you discuss whether those design wins are locked in for the duration of the vehicle platforms?\"\n\n- \"Yes. Let me start with automotive. I mean I think just like any provider in automotive, once you get in, you're pretty much locked in for the duration of the design. So certainly, our visibility is a longer visibility in that business than in any other businesses that we participate.\"\n\nLatecomers like Novatek will have a hard time getting a foothold. Both SYNA and HIMX expect automotive displays to be their largest revenue driver in 2022. The main reason that SYNA is not quite as good an opportunity is that it has fewer employees, less revenue and 30% of the earnings of HIMX. And five times the market cap. \n\nWhile the chip shortage will be over at some point, these locked-in automotive deals ensure excellent earnings for years to come. As an aside, there is almost no capacity going online in 2022, so the shortage cannot be resolved before 2023. The capacity upgrades in early 2023 might be sufficient to resolve it, though it's too early to tell.\n\nSo fundamentals are rock solid. What's not so great is the price action. Ever since the Q2 earnings, HIMX has been on a down trend. The past 3 weeks might be an upward channel, but it's hard to tell. I believe the largest driver of the recent price action is due to increasing short interest. Let's take a look at short interest history:\n\n- April 15: Q1 earnings were pre-announced. The quarter was as profitable as the most profitable year in the past. Short interest went up.\n- May 14 / May 28: Short interest went up fourfold in the past 4 weeks because Covid happened in Taiwan.\n- June 15: Covid in Taiwan is under control. Short interest remains almost the same. Wait what?\n- August 13: Q2 earnings happened. The quarter was 65% more profitable than Q1. Short interest went up.\n- October 15: Latest short interest report. About 23% of float is shorted. 11 days to cover.\n\nCombine this price pressure with a high amount of retail ownership (about 50%) and you get lots of paperhands. Anyway, the short interest ensures that shares are really cheap right now. It's a solid stock with a dividend of 15%-20% of the current share price (most likely in June 2022), and a strong floor of $10 (share price is currently $10.95).\n\nPosition: 28751 shares",
        "subreddit": "wallstreetbets",
        "title": "HIMX is a bargain",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qpq3zo/himx_is_a_bargain/",
        "created": 1636442601.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636706102,
        "id": "qs6xba",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|TSLA|Tesla Inc|[4](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)\n|IP|International Paper Company|[3](https://www.memebergterminal.com/stock/International%20Paper%20Company/IP?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/International%20Paper%20Company/IP?utm_source=rsmb&amp;utm_medium=stockmarket)\n|DIS|The Walt Disney Company|[3](https://www.memebergterminal.com/stock/The%20Walt%20Disney%20Company/DIS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/The%20Walt%20Disney%20Company/DIS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TSM|Taiwan Semiconductor Manufacturing Company Limited|[2](https://www.memebergterminal.com/stock/Taiwan%20Semiconductor%20Manufacturing%20Company%20Limited/TSM?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Taiwan%20Semiconductor%20Manufacturing%20Company%20Limited/TSM?utm_source=rsmb&amp;utm_medium=stockmarket)\n|FB|Facebook Inc|[2](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GM|General Motors Company|[2](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb&amp;utm_medium=stockmarket)\n|EGLX|Enthusiast Gaming Holdings Inc|[1](https://www.memebergterminal.com/stock/Enthusiast%20Gaming%20Holdings%20Inc/EGLX?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Enthusiast%20Gaming%20Holdings%20Inc/EGLX?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PHUN|Phunware Inc|[1](https://www.memebergterminal.com/stock/Phunware%20Inc/PHUN?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Phunware%20Inc/PHUN?utm_source=rsmb&amp;utm_medium=stockmarket)\n|ALB|Albemarle Corporation|[1](https://www.memebergterminal.com/stock/Albemarle%20Corporation/ALB?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Albemarle%20Corporation/ALB?utm_source=rsmb&amp;utm_medium=stockmarket)\n|ING|ING Groep N.V|[1](https://www.memebergterminal.com/stock/ING%20Groep%20N.V/ING?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ING%20Groep%20N.V/ING?utm_source=rsmb&amp;utm_medium=stockmarket)\n|INND|InnerScope Hearing Technologies Inc|[1](https://www.memebergterminal.com/stock/InnerScope%20Hearing%20Technologies%20Inc/INND?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/InnerScope%20Hearing%20Technologies%20Inc/INND?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PDD|Pinduoduo Inc|[1](https://www.memebergterminal.com/stock/Pinduoduo%20Inc/PDD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Pinduoduo%20Inc/PDD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|RSF|RiverNorth Specialty Finance Corp|[1](https://www.memebergterminal.com/stock/RiverNorth%20Specialty%20Finance%20Corp/RSF?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/RiverNorth%20Specialty%20Finance%20Corp/RSF?utm_source=rsmb&amp;utm_medium=stockmarket)\n|ESG|FlexShares STOXX US ESG Select Index Fund|[1](https://www.memebergterminal.com/stock/FlexShares%20STOXX%20US%20ESG%20Select%20Index%20Fund/ESG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/FlexShares%20STOXX%20US%20ESG%20Select%20Index%20Fund/ESG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|INTC|Intel Corporation|[1](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PSI|Invesco Dynamic Semiconductors ETF|[1](https://www.memebergterminal.com/stock/Invesco%20Dynamic%20Semiconductors%20ETF/PSI?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20Dynamic%20Semiconductors%20ETF/PSI?utm_source=rsmb&amp;utm_medium=stockmarket)\n|CVS|CVS Health Corporation|[1](https://www.memebergterminal.com/stock/CVS%20Health%20Corporation/CVS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/CVS%20Health%20Corporation/CVS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|KLXE|KLX Energy Services Holdings Inc|[1](https://www.memebergterminal.com/stock/KLX%20Energy%20Services%20Holdings%20Inc/KLXE?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/KLX%20Energy%20Services%20Holdings%20Inc/KLXE?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MD|MEDNAX Inc|[1](https://www.memebergterminal.com/stock/MEDNAX%20Inc/MD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/MEDNAX%20Inc/MD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|HY|Hyster-Yale Materials Handling Inc|[1](https://www.memebergterminal.com/stock/Hyster-Yale%20Materials%20Handling%20Inc/HY?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Hyster-Yale%20Materials%20Handling%20Inc/HY?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PROG|Progenity Inc|[1](https://www.memebergterminal.com/stock/Progenity%20Inc/PROG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Progenity%20Inc/PROG?utm_source=rsmb&amp;utm_medium=stockmarket)",
        "subreddit": "StockMarket",
        "title": "I scraped r/stockmarket for the top ticker mentions in the last 24H. Here are the results (Friday November 12, 2021)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qs6xba/i_scraped_rstockmarket_for_the_top_ticker/",
        "created": 1636734902.0
    },
    {
        "author": "BDRBDRBDR",
        "created_utc": 1636418113,
        "id": "qpri9s",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "One of the things I love watching for is trades within sectors that I know somewhat, where one or two businesses report earnings, followed (over a period of one or more trading days) by other businesses in the same sector. On earnings, stocks in the same sector tend to all fall or rise together (e.g., UBER, LYFT) absent some sort of significant differentiating factor that comes in during the earnings report or in the guidance, unless there are clear signs that market share is definitely being taken away from one player to the benefit of another (e.g., AMD, INTC). \n\nTake Lyft and Uber. Lyft reports before Uber, generally, so a positive report and guidance for Lyft (which is much smaller, lacking a global footprint and certain businesses Uber has) generally results in Uber shares rising the day after Lyft reports (assuming, of course, that Lyft rises as a result of the positive report and guidance). The same generally occurs when Lyft stock drops on account of a negative report and/or guidance- Uber drops, unless people are counting heavily on different business lines shoring up Uber's balance sheet and earnings for some reason. Occasionally you might get some decoupling because, for example, a pandemic forces large international markets into lockdown while the U.S. remains open, but, for the most part, the pattern holds. (Just don't expect to hold Uber up to and past its earnings date based solely on how LYFT did!)  \n\n\nBy contrast, an earnings report and guidance that lifts AMD does not always lift Intel. AMD and Intel's offerings come about as close to direct substitutes as one can get; in the PC and server markets, we basically have a duopoly.\n\nSo let's take those out of the picture, shall we?\n\nApplied Materials reports next week. I am long AMAT (LEAPS long) because I believe there's a secular trend of increasing CapEx for semiconductor manufacturing equipment (built by the likes of AMAT) that is supported by the massive supply chain shortage plus the movement of manufacturing facilities out of countries like China, plus the metaverse, obviously. (The last factor is more psychological than anything at the moment, but it's clearly material to investors who pumped up every semiconductor manufacturer in the universe last week.) What I am not inclined to do is to gamble on AMAT earnings at this point, as the date is too close, and 90 percent of the run-up has already occurred, which leaves me to (more likely than not) be IV crushed. Plus, there are some significant negative catalysts standing between today and the earnings date. But there is a higher margin business in the same sector as AMAT that reports much later.\n\nSynopsys owns a lot of IP in the semiconductor space, and does silicon design and verification work, silicon manufacturing design, and software security assessment/validation work. In short, SNPS does all the things one would need in an environment where AMAT and all of the other semiconductor manufacturers prosper. Good guidance and earnings reports in the coming days from the likes of AMAT and NVDA should prove a boost to SNPS stock in the days following earnings reports for AMAT and NVDA; bad news should have the opposite effect. For the reasons I state above, once I complete my own DD I am likely to run with SNPS longs that I hold through earnings (SNPS reports in December). \n\n&amp;#x200B;\n\nThe same goes for the cybersecurity space, where Palo Alto Networks reports the week of 11/18, followed in a couple of weeks' time by Crowdstrike and ZScaler, which are all pure-play cybersecurity stocks. \n\nThe point is to own/short the later-reporting stock (or options in the underlying) next week so that you benefit from the sympathetic rise/fall that occurs when the earlier-reporting company reports its earnings and guidance next week. Don't bother acquiring them this week because retail starts reporting next week and that's liable to tank everything as the numbers and guidance will be depressing from all but the most well-prepared retailers. \n\nAdditionally, you probably don't want to own a whole lot of anything (longs) past November 9, either. Why? Inflation numbers for October get reported on 11/10 before open, and if they are anything but low AF, stocks likely will see a shock as a result. At a minimum, give it a few days before jumping back in.\n\nP.S. If the AMAT/SNPS interplay appeals to you, NVDA's earnings report and guidance are worth watching for a similar sympathetic change. NVDA reports 11/17, the day before AMAT on 11/18. Any indication that NVDA is ramping up production, getting additional contracts for metashit, or is less dependent on cryptominers than it is on gamers will all benefit NVDA and (to a lesser extent) will pump up AMAT. But again, I think the odds of the market tanking (not a correction, but enough to cost you serious money if you are highly leveraged) after the 11/10/2021 October inflation report and/or depressing reports/guidance from retail are high enough that you should wait until closer to NVDA's earnings date to try this out.",
        "subreddit": "wallstreetbets",
        "title": "A couple of pairs worth watching [AMAT/SNPS; PANW/CRWD/ZS]",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qpri9s/a_couple_of_pairs_worth_watching_amatsnps/",
        "created": 1636446913.0
    },
    {
        "author": "ProperMammoth2",
        "created_utc": 1637256290,
        "id": "qwur1m",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "We are addressing you today regarding the ongoing takeover offer from TUTANOTA LLC.\nThe US-based company had informed shareholders that it was ready to acquire these shares. \n\nAny idea what this is about?",
        "subreddit": "stocks",
        "title": "Got a letter from my broker about takeover Intel",
        "url": "https://www.reddit.com/r/stocks/comments/qwur1m/got_a_letter_from_my_broker_about_takeover_intel/",
        "created": 1637285090.0
    },
    {
        "author": "SnooBananas1429",
        "created_utc": 1636011634,
        "id": "qmfh8b",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "intel",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmfh8b/intel/",
        "created": 1636040434.0
    },
    {
        "author": "TachyonArray",
        "created_utc": 1636794438,
        "id": "qsxfyo",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello again fuckwads, it’s me, the same idiot that can’t stop thinking about Intel. During [my last post](https://www.reddit.com/r/wallstreetbets/comments/qnwkfx/intc_the_sleeping_giant/) about Intel, some people kept downplaying this play because of a lack attention from, well, anything with a heartbeat. However, shortly after my last post, ShitBC seemed to pity my post and their heart also grew three sizes, as they decided post a [special 20 minute report](https://www.cnbc.com/2021/11/06/how-intel-plans-to-catch-up-to-samsung-and-tsmc-with-44-billion-of-new-global-chip-fabs.html) on Intel, sprinkled with hefty dash of hopium. \n\nMoreover, I’ve started to notice some of the bigger finance’tubers also take notice of Intel recently, throwing some more hopium into the meal. I would post some examples, but this subreddit doesn’t allow youtube links for some reason. \n\nAll in all, this could mean nothing, I’m just a bit high on the hopium",
        "subreddit": "wallstreetbets",
        "title": "Notice Me, Senpai… $INTC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qsxfyo/notice_me_senpai_intc/",
        "created": 1636823238.0
    },
    {
        "author": "Arogyth",
        "created_utc": 1637080897,
        "id": "qvby9w",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi.\n\nI just made my first options trade.  Here's my position, tell me how dumb I am.  All positions are on INTC\n\n4 contracts at 52.50 in 30 days\n\n6 contracts at 55.00 in 30 days\n\n5 contracts at 55.00 in 60 days\n\n8 contracts at 57.50 in 60 days\n\nTotal cost: 1079",
        "subreddit": "wallstreetbets",
        "title": "My First Option Trade -- INTC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qvby9w/my_first_option_trade_intc/",
        "created": 1637109697.0
    },
    {
        "author": "SirDuke407",
        "created_utc": 1636078945,
        "id": "qn12ge",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Intel",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qn12ge/intel/",
        "created": 1636107745.0
    },
    {
        "author": "NoSun6429",
        "created_utc": 1636034896,
        "id": "qmle9p",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "just a heads up just search gamer nexus rewiew or somthibg good product usually means stonks up i think?",
        "subreddit": "wallstreetbets",
        "title": "intel 12900k seems is actually decent",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmle9p/intel_12900k_seems_is_actually_decent/",
        "created": 1636063696.0
    },
    {
        "author": "2WorksForYou",
        "created_utc": 1637101726,
        "id": "qvjyiu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\n*here is a detailed breakdown of the most notable position changes among marquee hedge funds:*\n\nAPPALOOSA\n\n* Top new buys: ALIT, WMT, OVV\n* Top exits: EMR, NFLX, BP, RDS/A, RDS/B\n* Boosted stakes in: M, GT, EQT, AR, GOOG, XOP, OXY, KSS, DHI, PHM\n* Cut stakes in: MU, AMZN, BABA, PCG, FB, ET, TWTR, UBER, FCX, XLE\n\nBAUPOST GROUP\n\n* Top new buys: DBX, JOBY, LFG, OB\n* Top exits: AUR, CZOO\n* Boosted stakes in: SSNC, VRNT, TBPH\n* Cut stakes in: EBAY, PCG, WLTW, QRVO, INTC, IFF, PSTH\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: RPRX, FND\n* Top exits: MRK, LBTYK, OGN\n* Boosted stakes in: CVX\n* Cut stakes in: ABBV, CHTR, BMY, V, MA, MMC, USB\n\nCOATUE MANAGEMENT\n\n* Top new buys: MSFT, BLND, AFRM, BEKE, NTLA, ABSI, HOOD, TOST, CRBU, SUNL\n* Top exits: DDOG, CHPT, ROOT, AI, LMND, SKLZ, LAZR, COIN, MVIS, SOFI\n* Boosted stakes in: BZ, MQ, JD, CFLT, DDL, SNAP, GH, CVAC, LI, RBLX\n* Cut stakes in: AMZN, NUAN, RUN, SQ, PYPL, TSLA, SHOP, PTON, Z, FB\n\nCORVEX MANAGEMENT\n\n* Top new buys: FIVN, UBER, USFD, SMFR, SLGC, SKYA, SRAD, APO\n* Top exits: DOMA, TWND, HZON, ROVR, CZOO, LIDR, XME, LGV\n* Boosted stakes in: ZNGA, CRM, MSFT, JPM, FB, DIS, CCEP\n* Cut stakes in: ATUS, EXC, TMUS, BLMN, AMZN, GOOGL\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: HOOD, WRBY, TXRH, NFLX, OPEN, PH, TPX, MASI, NTES, SGHT\n* Top exits: BKNG, U, CMG, DECK, TUYA, BHG, LTCH, BZ, FUTU, WDH\n* Boosted stakes in: EXPE, STNE, TMUS, DIS, BBWI, BLL, FTV, PTON, PODD, PINS\n* Cut stakes in: AMZN, FB, SNOW, EW, MSFT, CVNA, PCOR, DHR, CRWD, SQSP\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: CPNG, LYV, ZM, PRCT, OSCR, STNE, ABCL, FSLY, LAD, CFLT\n* Top exits: NFLX, CMI, GE, MA, V, USFD, CAT, GM, ON, BLDR\n* Boosted stakes in: GOOGL, EXPE, BKNG, DISH, OPCH, FTCH, COUP, AMZN, RETA\n* Cut stakes in: MSFT, TMUS, CVNA, PLTR, TECK, FB, FCX, INTU, PENN, SMAR\n\nELLIOTT INVESTMENT MANAGEMENT\n\n* Top new buys: SC, CTXS, HTA, VAL, APA, 1865300D\n* Top exits: EDR, SNAP, DBX, PINS, TTD, HRB\n* Cut stakes in: ARNC, FYBR, ETWO, BTU\n\nGREENLIGHT CAPITAL\n\n* Top new buys: SLV, FREY, SNAX\n* Top exits: SPY, JOBY, SNX, OPAD, DNA, CCCS, APG, IONQ, XOS, UWMC\n* Boosted stakes in: TECK, ODP, BHF, LIVN, MYPS, SONO, GLD, CPRI, JACK, CHNG\n* Cut stakes in: CNXC, CC, REZI, FUBO, SATS, AER, EXPE, ADMP, AGCB, GPOR\n\nICAHN\n\n* Top new buys: SWX\n* Boosted stakes in: DAN, IEP\n* Cut stakes in: OXY\n\nJANA PARTNERS\n\n* Top new buys: M, VVV, BKSY\n* Boosted stakes in: THS, VG, CONE\n* Cut stakes in: SPY, LH, EHC\n\nLANSDOWNE\n\n* Top new buys: WRK, FSLR, CTRA, CF, AGI, CCJ\n* Top exits: LRCX, MU, AER, UAL, LUV, ENIA, TMUS, RBLX, SSO, UVXY\n* Boosted stakes in: NVT, ILMN, GE, TSM, ADI, BKNG, IEUR\n* Cut stakes in: FCX, CARR, ETN, VMC, AMAT, DAL, RYAAY, EGO, OTIS, WMG\n\nMAVERICK CAPITAL\n\n* Top new buys: INST, CRBU, EHTH, SPIR, STZ, CCL, AAP, SHW, OLPX, PZZA\n* Top exits: BABA, AON, BECN, CZOO, TSM, HIMS, DGNS, SBUX, XMTR, KVSA\n* Boosted stakes in: V, WDAY, SE, ATVI, CRIS, LRCX, RCKT, NFLX, TWLO, DECK\n* Cut stakes in: CPNG, FB, LIVN, ALNY, ADSK, FLT, IFF, GOOG, CCK, MELI\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: AFRM, MAR, SQ, MCD, ASML, VSCO, WMG, CRL, BURL, OLPX\n* Top exits: V, JD, PYPL, LVS, ADSK, CRWD, NTES, TGT, UBER, SHOP\n* Boosted stakes in: SNAP, BILL, MA, BBWI, LYV, HLT, FB, DT, EFX, DDOG\n* Cut stakes in: AMZN, EXPE, FICO, GOOGL, ALGN, ATVI, USFD, VMEO, VAC, IAA\n\nOMEGA ADVISORS\n\n* Top new buys: LVS\n* Top exits: FOE, CS, PNTM, CRBN, JWSM, ANAC, APSG\n* Boosted stakes in: CTRA, BHC, PFSI, WSC, GM, DMAC, VRT, SRGA, FLMN, ASPU\n* Cut stakes in: NAVI, MP, OCN, BBDC, TRN, FCRD, ABR\n\nSOROBAN CAPITAL\n\n* Top new buys: RKLB, ALCC, LICY, CPAR, POND\n* Top exits: ATUS, DOMA, SPIR, ATIP, VYGG, ME, PAYO, SUNL, BGRY, TALK\n* Boosted stakes in: UNP, PLNT, WAB, MA, CSX, LOW, FB, V, KIND, ML\n* Cut stakes in: ADI, AMZN, MSFT, NFLX\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: HRC, JPM, UNH, CPNG, EQT, XLE, GS, HYZN, MTB, INTU\n* Top exits: OTIS, QS, CLVT, IFF, W, UPST, AXTA, TXN, S, NXPI\n* Boosted stakes in: INFO, NUAN, PPD, ARMK, CRM, ACN, GM, SYF, BKNG, VICI\n* Cut stakes in: FIGS, QQQ, ATVI, MGLN, ELAN, AMZN, DIS, LBRDK, GOOGL, XLU\n\nSTARBOARD VALUE \n\n* Top new buys: HUN, CYXT, BRDS, ENFA, VPCC, TREB, DKDCA, BTTX, HCIC, CPAR\n* Top exits: IWN, KVSC, ROIV, STRC, OPAD, LILM, RBOT, SPIR, ROVR, GDEV\n* Boosted stakes in: IWM, AUS, MTAC, KVSB, LNFA, FVT, TWND, PLMI, PRPB, ACAH\n* Cut stakes in: MD, BOX, CTVA, IWR, ELAN, PZZA, ACM, MMSI, ON\n\nTEMASEK HOLDINGS\n\n* Top new buys: ETWO, USIG, ONEM, BLND, POSH, DUOL, IRNT, HLTH, PATH, MNDY\n* Top exits: CTVA, SOFI, COPX, PICK, KREF, BIDU, TAL, BZ, EDU, MSFT\n* Boosted stakes in: GOVT, SCHP, GRCL, BGNE, SNOW, IAU, XME, FIXX, EWY, AFRM\n* Cut stakes in: BABA, INFO, RBLX, DIDI, ABNB, MA, DCT, NTLA, LCTU, CRM\n\nTIGER GLOBAL\n\n* Top new buys: WRBY, HOOD, BLND, VTEX, MTTR, SPIR, TOST, BKSY, AVPT, ALCC\n* Top exits: TAL\n* Boosted stakes in: SNOW, SE, DASH, DDOG, OZON, WDAY, XM, SQ, OSCR, ONTF\n* Cut stakes in: RBLX, APO, PTON, JD, SPOT, YSG, UBER, CVNA, INTU, DESP",
        "subreddit": "wallstreetbets",
        "title": "new meta",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qvjyiu/new_meta/",
        "created": 1637130526.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1637138102,
        "id": "qvut24",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n|Ticker|Company|# Mentions (24H)|\n|:-|:-|:-|\n|SPY|SPDR S&amp;P 500 ETF Trust|[22](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=options)\n|TSLA|Tesla Inc|[14](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=options)\n|LCID|Lucid Group Inc. Common Stock|[11](https://www.memebergterminal.com/stock/Lucid%20Group%20Inc.%20Common%20Stock/LCID?utm_source=rsmb&amp;utm_medium=options)\n|RIVN|Rivian Automotive, Inc. Class A Common Stock|[10](https://www.memebergterminal.com/stock/Rivian%20Automotive%2C%20Inc.%20Class%20A%20Common%20Stock/RIVN?utm_source=rsmb&amp;utm_medium=options)\n|INTC|Intel Corporation|[10](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=options)\n|AMD|Advanced Micro Devices Inc|[9](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=options)\n|GME|GameStop Corp|[6](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=options)\n|GM|General Motors Company|[6](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb&amp;utm_medium=options)\n|QYLD|Global X NASDAQ 100 Covered Call ETF|[6](https://www.memebergterminal.com/stock/Global%20X%20NASDAQ%20100%20Covered%20Call%20ETF/QYLD?utm_source=rsmb&amp;utm_medium=options)\n|RIOT|Riot Blockchain Inc|[6](https://www.memebergterminal.com/stock/Riot%20Blockchain%20Inc/RIOT?utm_source=rsmb&amp;utm_medium=options)\n|AAPL|Apple Inc|[4](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb&amp;utm_medium=options)\n|DWAC|Digital World Acquisition Corp. Class A Common Stock|[4](https://www.memebergterminal.com/stock/Digital%20World%20Acquisition%20Corp.%20Class%20A%20Common%20Stock/DWAC?utm_source=rsmb&amp;utm_medium=options)\n|ABC|AmerisourceBergen Corporation|[3](https://www.memebergterminal.com/stock/AmerisourceBergen%20Corporation/ABC?utm_source=rsmb&amp;utm_medium=options)\n|MARA|Marathon Digital Holdings Inc|[3](https://www.memebergterminal.com/stock/Marathon%20Digital%20Holdings%20Inc/MARA?utm_source=rsmb&amp;utm_medium=options)\n|AAL|American Airlines Group Inc|[3](https://www.memebergterminal.com/stock/American%20Airlines%20Group%20Inc/AAL?utm_source=rsmb&amp;utm_medium=options)\n|PROG|Progenity Inc|[3](https://www.memebergterminal.com/stock/Progenity%20Inc/PROG?utm_source=rsmb&amp;utm_medium=options)\n|BP|BP p.l.c|[2](https://www.memebergterminal.com/stock/BP%20p.l.c/BP?utm_source=rsmb&amp;utm_medium=options)\n|QCOM|QUALCOMM Incorporated|[2](https://www.memebergterminal.com/stock/QUALCOMM%20Incorporated/QCOM?utm_source=rsmb&amp;utm_medium=options)\n|QQQ|Invesco QQQ Trust Series 1|[2](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=options)\n|OI|O-I Glass Inc|[2](https://www.memebergterminal.com/stock/O-I%20Glass%20Inc/OI?utm_source=rsmb&amp;utm_medium=options)\n|SOFI|SoFi Technologies Inc. Common Stock|[2](https://www.memebergterminal.com/stock/SoFi%20Technologies%20Inc.%20Common%20Stock/SOFI?utm_source=rsmb&amp;utm_medium=options)",
        "subreddit": "options",
        "title": "I scraped r/options for the top ticker mentions in the last 24H. Here are the results (Wednesday November 17, 2021)",
        "url": "https://www.reddit.com/r/options/comments/qvut24/i_scraped_roptions_for_the_top_ticker_mentions_in/",
        "created": 1637166902.0
    },
    {
        "author": "Appropriate_Mouse436",
        "created_utc": 1636119221,
        "id": "qnb8r4",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I got the feel intel stock bouta go up",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnb8r4/i_got_the_feel_intel_stock_bouta_go_up/",
        "created": 1636148021.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "created_utc": 1636668001,
        "id": "qrw5r4",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&gt;https://www.governor.pa.gov/newsroom/governor-wolf-bipartisan-governors-urge-congress-to-pass-chips-act-to-create-american-jobs-boost-semiconductor-production/\n\nSo far the shortage has cost 2.2 Million vehicles. That could just be a tiny fraction if Taiwan has more serious future issues such as natural disasters or a China invasion, which could cost businesses TRILLIONS in damages to companies such as:  Ford (F) , General Motors (GM) , and Toyota (TM), Dell Technologies (DELL),  Apples (AAPL), Google (GOOGL), AMD, NVDA, and many more.\n\n\n&gt;The group, which also includes the governors of auto-producing states like Alabama, said the shortage had cost automakers 2.2 million vehicles and affected 575,000 jobs in the industry.\n\n&gt;The semiconductor funding passed the U.S. Senate earlier this year by 68-32 as part of the broader U.S. Innovation and Competition Act, or USICA. But it has not passed the House of Representatives.\n\n\n\nhttps://www.reuters.com/world/us/nine-governors-press-us-lawmakers-pass-semiconductor-funding-bill-2021-11-10/\n\nMuch of this funding plus possibly more in the future, seems likely to go to Intel (INTC).\n\nI dont think the US gov is interested in paying foreign companies to build in the US since it wont really help the US to be independent. eg. TSMC only builds factories for their inferior products outside of Taiwan since they are worried about their tech getting stolen in other locations.",
        "subreddit": "wallstreetbets",
        "title": "AMD &amp; Nvidia chip production at risk. Nine US governors press U.S. lawmakers to pass 52 Billion semiconductor funding bill. Taiwan unreliable potentially trillions at risk.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qrw5r4/amd_nvidia_chip_production_at_risk_nine_us/",
        "created": 1636696801.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636101302,
        "id": "qn6m4z",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|AMD|Advanced Micro Devices Inc|[13](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GME|GameStop Corp|[9](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)\n|NVDA|NVIDIA Corporation|[9](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=stockmarket)\n|ARKK|ARK ETF Trust - ARK Innovation ETF|[7](https://www.memebergterminal.com/stock/ARK%20ETF%20Trust%20-%20ARK%20Innovation%20ETF/ARKK?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ARK%20ETF%20Trust%20-%20ARK%20Innovation%20ETF/ARKK?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TSM|Taiwan Semiconductor Manufacturing Company Limited|[5](https://www.memebergterminal.com/stock/Taiwan%20Semiconductor%20Manufacturing%20Company%20Limited/TSM?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Taiwan%20Semiconductor%20Manufacturing%20Company%20Limited/TSM?utm_source=rsmb&amp;utm_medium=stockmarket)\n|INTC|Intel Corporation|[5](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SPY|SPDR S&amp;P 500 ETF Trust|[5](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)\n|AMC|AMC Entertainment Holdings Inc|[5](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|VTI|Vanguard Index Funds - Vanguard Total Stock Market ETF|[4](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PLUG|Plug Power Inc|[4](https://www.memebergterminal.com/stock/Plug%20Power%20Inc/PLUG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Plug%20Power%20Inc/PLUG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|BLDP|Ballard Power Systems Inc|[4](https://www.memebergterminal.com/stock/Ballard%20Power%20Systems%20Inc/BLDP?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Ballard%20Power%20Systems%20Inc/BLDP?utm_source=rsmb&amp;utm_medium=stockmarket)\n|QQQ|Invesco QQQ Trust Series 1|[3](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=stockmarket)\n|VOO|Vanguard S&amp;P 500 ETF|[3](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb&amp;utm_medium=stockmarket)\n|NIO|NIO Inc|[3](https://www.memebergterminal.com/stock/NIO%20Inc/NIO?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/NIO%20Inc/NIO?utm_source=rsmb&amp;utm_medium=stockmarket)\n|DWAC|Digital World Acquisition Corp.|[3](https://www.memebergterminal.com/stock/Digital%20World%20Acquisition%20Corp./DWAC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Digital%20World%20Acquisition%20Corp./DWAC?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PG|The Procter &amp; Gamble Company|[2](https://www.memebergterminal.com/stock/The%20Procter%20%26%20Gamble%20Company/PG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/The%20Procter%20%26%20Gamble%20Company/PG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|JNJ|Johnson &amp; Johnson|[2](https://www.memebergterminal.com/stock/Johnson%20%26%20Johnson/JNJ?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Johnson%20%26%20Johnson/JNJ?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SPCE|Virgin Galactic Holdings Inc|[2](https://www.memebergterminal.com/stock/Virgin%20Galactic%20Holdings%20Inc/SPCE?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Virgin%20Galactic%20Holdings%20Inc/SPCE?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PENN|Penn National Gaming Inc|[2](https://www.memebergterminal.com/stock/Penn%20National%20Gaming%20Inc/PENN?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Penn%20National%20Gaming%20Inc/PENN?utm_source=rsmb&amp;utm_medium=stockmarket)\n|DM|Desktop Metal Inc|[2](https://www.memebergterminal.com/stock/Desktop%20Metal%20Inc/DM?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Desktop%20Metal%20Inc/DM?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TSLA|Tesla Inc|[2](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)",
        "subreddit": "StockMarket",
        "title": "I scraped r/stockmarket for the top ticker mentions in the last 24H. Here are the results (Friday November 05, 2021)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qn6m4z/i_scraped_rstockmarket_for_the_top_ticker/",
        "created": 1636130102.0
    },
    {
        "author": "daemonblitz",
        "created_utc": 1636402120,
        "id": "qplz4t",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hello everyone, I started my portfolio as of Nov 1st. I really wish I started sooner, but I'm happy to get into it and learn along the way. I am so far behind the curve on learning all the terminology.\n\nI had some savings sitting in my account that I haven't touched in some years so I decided to take a portion of it (about 20%) and use it to invest.\n\nI don't follow world news or world events very closely, so I decided to base my portfolio around things I am familiar with, where I know opportunities may lie, or where I saw recent dips.\n\nI am curious to hear opinions from those with much more experience. Currently I have stocks with:\n\n$AAPL (felt this was a safe long-term bet but currently down slightly)\n\n$INTC (recent launch of 12th gen processors after significant dip)\n\n$ATVI (ongoing decrease in product quality, recent controversy with upper management and very heavy dip)\n\n$CGX (Canadian company, recent dip but I am hoping for a rise in stock price as pandemic restrictions are becoming more relaxed and people are starting to go to the movies again, hoping it goes in the same direction as $AMC and didn't want to miss this train as well)\n\n$GME (getting on the \"biggest squeeze of all time\" train, so far this is my biggest return)\n\nHappy to hear opinions/suggestions, treating everything as a learning opportunity at the moment.",
        "subreddit": "stocks",
        "title": "Looking for advice/critiquing",
        "url": "https://www.reddit.com/r/stocks/comments/qplz4t/looking_for_advicecritiquing/",
        "created": 1636430920.0
    },
    {
        "author": "diggy_doc",
        "created_utc": 1636675681,
        "id": "qryp1f",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Intel vs tsmc",
        "url": "https://www.reddit.com/r/stocks/comments/qryp1f/intel_vs_tsmc/",
        "created": 1636704481.0
    },
    {
        "author": "NNIICCEEE",
        "created_utc": 1637792875,
        "id": "r1gym1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$INTC 😳",
        "url": "https://i.redd.it/nl1h5rakdm181.jpg",
        "created": 1637821675.0
    },
    {
        "author": "Fatherthinger",
        "created_utc": 1638025551,
        "id": "r3fcwf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Inside Intel: Wall St bets on the decline of one-time chip champion",
        "url": "https://www.reddit.com/user/Fatherthinger/comments/r3fb7a/inside_intel_wall_st_bets_on_the_decline_of/",
        "created": 1638054351.0
    },
    {
        "author": "blacklambo16",
        "created_utc": 1635884914,
        "id": "qldef5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Hello, my first options contract. Very happy. I’m still trying to learn.$INTC closed $49.86 today. Is my breakeven $51.68? How long should I wait to close this contract to avoid assignment. Thanks",
        "url": "https://i.redd.it/m5xv8dy7s8x71.jpg",
        "created": 1635913714.0
    },
    {
        "author": "blacklambo16",
        "created_utc": 1636124281,
        "id": "qncxvp",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Hello, 77 days to expiration. INTC is close to my break even if 51.68. I do NOT want to be exercised. What would you do?",
        "url": "https://i.redd.it/i573unazjsx71.jpg",
        "created": 1636153081.0
    },
    {
        "author": "SnooBananas1429",
        "created_utc": 1636012258,
        "id": "qmflxw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "intel stock, just found out every time apple has a mac event they gonna dip. just a summary apple as intel was initially one of the biggest customers (Lenovo no.1 dell no.2 apple no.3). new to stock trading if anything is wrong pls point it out.  \n\n\nfrom supply chain information apple will most likely announce a new product launch event like this year spring-loaded with the lower end M1 iMac. the potential event in march 2022(speculating) will announce the higher-end iMac/Mac mini fully replaced by apple silicon and wwdc2022 end apple silicon on MacPro. with this information I am predicting intel won't dip as much as last year m1 due to the customer base for macpro+imac high end+ mac mini is less than 15% of their customer base.  \n\n\nhttps://preview.redd.it/8qa0jmw99jx71.jpg?width=1284&amp;format=pjpg&amp;auto=webp&amp;s=c47e6856b6f71d08482efac9ebeddd4bea769726",
        "subreddit": "wallstreetbets",
        "title": "intel stock",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmflxw/intel_stock/",
        "created": 1636041058.0
    },
    {
        "author": "NNIICCEEE",
        "created_utc": 1636144543,
        "id": "qnk1pv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$INTC hope that will be a big yolo next month 💰",
        "url": "https://i.redd.it/7xytf5d88ux71.jpg",
        "created": 1636173343.0
    },
    {
        "author": "Hot_Significance_483",
        "created_utc": 1636994549,
        "id": "qukklp",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "$AMD just brought as a new amazing buy point, new contracts with:  $MSFT, $IBM, $GOOGL, $AMZN, $FB could improve next earning by a lot.\n\nIt's new GPU could take over a lot of $NVDA market share, just like it did to $INTC.\n\nBe careful not to miss it's next spike,\n\nYOU SHOULD BUY IT BEFORE IT EXPLODES AGAIN!",
        "subreddit": "wallstreetbets",
        "title": "BUY $AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qukklp/buy_amd/",
        "created": 1637023349.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1636124188,
        "id": "qncwrq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "options",
        "title": "Hello, 77 days to expiration. INTC is close to my break even if 51.68. I do NOT want to be exercised. Should I sell? Thanks! 1st options contract ever",
        "url": "https://i.redd.it/60zeh8fpjsx71.jpg",
        "created": 1636152988.0
    },
    {
        "author": "vm5662",
        "created_utc": 1635802181,
        "id": "qkobmu",
        "num_comments": 118,
        "num_crossposts": 6,
        "selftext": "**Be Fearful When Others Are Greedy and Greedy When Others Are Fearful” - Warren Buffet**\n\n**Why people are Fearful:**\n\n* One of the main concerns people worry about this stock in their last Q2 earnings is that their LTO origination was down 17% YOY. But I think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is a one time surge only and made their LTO origination in Q2 2021 looks really bad. but when compared to Q1 2021, it is still up 1%. so it is actually not that bad.\n* Because of the Q2 earnings and guidance removal the stock tanked hard and is now trading at $4-5, creating an opportunity for us to make some tendies.\n* Because the stock tanked hard there were several lawsuits against the management for this behaviour but from the legal perspective they are in their legal boundaries (personally I feel the management should have been more careful).\n* Katapult’s focus on the nonprime consumer niche seems risky at first. Afterall, you would think that customers with worse credit scores would yield higher default risks. However, Katapult’s bad debt expense, or expense for uncollectable accounts receivable, is down from 7.9% last year to 6.1% this year. That is in line with Affirm’s bad debt expense, and Affirm handles prime customers. Katapult’s bad debt expense is growing at less than half the rate of its revenue, showing investors that risks pertaining to bad debt actually minimize as the company grows.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6fzkxpkox1x71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=a61e9a7f5a6c4b907cf80eb103a30d5559c43608\n\n**Why you should be greedy:**\n\n* A study from Juniper Research suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. 55% of Americans used a BNPL option as of March 2021 vs. just 37% in July 2020. The Federal Reserve Bank of New York also reports that **38% of US consumers are considered nonprime,** making it difficult for these consumers to access financing options. **Additionally, 67% of consumers with a FICO score below 700 need a BNPL option for large purchases**. Katapult provides this solution for online customers. Katapult's platform integrates seamlessly to merchant sites, so customers can choose the financing option as they check out. As the sole provider of BNPL financing for nonprime customers, Katapult has a massive untapped market.\n* Katapult is forecasting over $1B in revenue by 2023, and the company could beat this number if it keeps aggressively expanding to include new merchants.\n* Recent great direct partnership with Salesforce and Adobe and indirect waterfall partnership from Affirm with (Amazon, Target, Walmart). The amazon - affirm deal actually sent $KPLT all the way up to $7\\~$8 in September.\n* When u look at the number of buys from insider and institutional holders when this one crash in august due to removal of their guidance, this shows smart money actually think the stock price around $3\\~5 is a steal. (The highest buy from insider is $4.42, which means CEO actually didnt expect market can be way overreacting that the price can drop to \\~$3)\n* Katapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n&amp;#x200B;\n\n[Insider purchase](https://preview.redd.it/mbfmqwlpx1x71.png?width=2359&amp;format=png&amp;auto=webp&amp;s=d9651b69dd723605151440e9821aca97f60e3b44)\n\n**Investment Thesis**\n\nKatapult Holdings is a leading buy now, pay later (\"BNPL\") company that provides Ecommerce financing solutions for nonprime consumers. KPLT has generated explosive revenue growth while remaining profitable, a rare feat for a young growth stock. While its financial performance has been fantastic, KPLT’s valuation is the key to this investment. Katapult has higher sales growth and stronger profit margins than its peers. Meanwhile, its stock is trading at \\~1/40th the multiples of these competitors (discount varies based on sales, gross profit, or EBITDA multiples). You will not find another company executing at this caliber priced this cheap. Value stocks can perform well. Growth stocks can perform well. When an impressive growth stock is trading like an undervalued stock, you have the opportunity to generate incredible returns. Katapult is a $30 stock, you don’t want to miss this one.\n\n**What Is Katapult?**\n\nKatapult provides BNPL solutions for nonprime Ecommerce customers. Katapult is the only nonprime financing platform dedicated to Ecommerce, as shown below:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n3uufepqx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=d1e60005054acf799b53aee674e6e7f148943baf\n\nInvestor Presentation\n\nKatapult offers three payment options for consumers:\n\n* Full Term: A $45 origination fee followed by either 12-24 months of lease payments, at the end of which the consumer owns the good.\n* 90 Day Discount: An early purchase option at 90 days, which enables the consumer to buy the good at a discount to the original price.\n* Extended Discount: A discounted purchase option after 90 days, but before the end of the lease period.\n\nThe average order value for goods leased through Katapult is \\~$600 with an average lease multiple of \\~2.0x cash price. The company’s solution is well-liked by consumers. Its Net Promoter Score of 58 is strong for a financial service, and Katapult has a 4.4 rating on Trust Pilot.\n\n**Business Model**\n\nKatapult partners with Ecommerce merchants like Shopify, Wayfair, Lenovo, and Purple who then integrate Katapult into their websites as a purchase option. Consumers provide their information to Katapult, who in turn makes an immediate credit approval decision. Katapult's risk model reviews over 100 attributes, including lease history and prior payment behavior, to approve or deny applicants in under five seconds. The company has a sub-3% fraud rate across its portfolio, and it recovers 80-90% of lease costs of charge-offs. The financer’s platform is sticky, as 48% of purchases have been done by repeat customers. Katapult also generates revenue through a \"waterfall\" program with Affirm.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gzebfgyrx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=5e7bbd61edc80e801e4ef6261124432914c7d641\n\nKatapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n**Solution Offered**\n\nNonprime consumers without credit scores currently struggle to get affordable financing options. Payday loans and credit cards offer predatory rates, but many of these consumers can’t afford to pay cash for furniture and other expensive items. Katapult gives these customers access to high-quality Ecommerce merchants with affordable payment structures. By integrating its platform to these Ecommerce sites, Katapult has built both a cheap and efficient solution for nonprime shoppers.\n\nOn the flipside, Ecommerce companies gain access to consumers they otherwise would not be able to sell to without bearing any credit risk. Katapult is fast, and that increases conversion rates. Merchants that integrate Katapult as a payment option also see higher repeat rates. Customers get access to new merchants and affordable financing; merchants gain millions of potential new customers with no added risk. A win-win scenario.\n\n**Valuation**\n\nKPLT is at a conservative $1B valuation with $450M in 2021 revenue. Check out the slide below from Katapult’s initial investor deck.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/evq0ng1tx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=c8e39ab5dce8ca2e895469936b5a001175cae7bd\n\n*Source: Investor Presentation*\n\nThe above slide compares different players in the BNPL sector. In a vacuum, 14x EBITDA for a company growing sales, net income, and EBITDA at 100%+ for the last three years is great value. When you compare this to other companies in the sector, Katapult looks criminally undervalued. But what if this entire sector is expensive, and KPLT’s price is reasonable in the broader FinTech market? I compiled the below data set to see Katapult against 15 other FinTech companies. The results are interesting:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cfkjo8wtx1x71.png?width=1386&amp;format=png&amp;auto=webp&amp;s=279e067ab736ae4185905d749375d1249f08d135\n\nNote that I highlighted other recent DeSPACs (PSFE, SOFI) and IPOs (AFRM, UPST, GLBE) to point out how they are priced vs. KPLT. Katapult is not just cheap for a BNPL financer. The stock is heavily discounted in the larger FinTech market as well. I built a scatterplot to illustrate these companies' \"expected\" EV/2022e Gross Profit.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h4n8zvrux1x71.png?width=1376&amp;format=png&amp;auto=webp&amp;s=7f492e668f24237ea951fb35099a7b7ea2b443e5\n\nKPLT is already profitable, expanding its margins, and growing revenue at a blistering 84% over the next two years. How does the market value it? 3.83x 2022e gross profits. Meanwhile, a regression line of the FinTech market suggests that KPLT *should* trade at 48.4x 2022e gross profits.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4b667psvx1x71.png?width=472&amp;format=png&amp;auto=webp&amp;s=359fd931a68e5598031a4547a93d24a0a11b3fbc\n\nWhile the above scatterplot shows a \"fair value\" 48.4 EV/2022e GP for Katapult, I’m not implying a guaranteed 1000% jump. You could argue that this entire sector is overvalued, and prices need to come down. However, when valuations are high, execution has to be flawless for you to turn a profit. When valuations are low, execution has to be catastrophic for you to turn a loss. KPLT is growing revenue at more than twice the pace of several peers, while trading at 1/5th their valuations. Good execution? Stock goes up. Rerating? Stock goes up. Increased coverage? Stock goes up. Company underperforms? Stock might stay flat. KPLT’s valuation gives us a \"heads I win, tails you lose\" scenario.\n\n**Short Squeeze Potential**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lwkcvkqwx1x71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=5bfe6c5e79c3c8b283c9df1231367234891a3f22\n\n**Fintel short squeeze list has $KPLT at the fourth position. The company has 15.7% of its float short and a borrow fee of 36.7%.**\n\n**Catalysts and Time Frame**\n\nKPLT is having earnings on 11/9 pre-market and can easily beat the estimates because of several partnerships with major players and the Q3 2020 is not abnormal like Q2 2020.\n\n**New Competition**\n\nI don't see Affirm or another competitor taking market share from Katapult(there’s a high chance that this could be acquired by Affirm itself). KPLT has a multi-year head start in this market niche, and it has been able to scale its operations profitably. Affirm set a new precedent through its waterfall partnership with Katapult, and I expect other BNPL companies to take similar steps if they want to enter the nonprime market.\n\n**The Trade**\n\nWe are rarely given the opportunity to buy hyper-growth at low valuations. When Mr. Market offers a gift, be greedy. Katapult's stock price declined quickly after the Q2 earnings, but it appears to have bottomed.\n\nI’m currently holding 75 $5C and $7.5C Dec’17 and Jan’21\n\n**Conclusion**\n\nKatapult is the best risk/return in the market right now. The company has managed to grow its revenue, EBITDA, and net income by \\~100% over the last three years, expects 84% revenue CAGR over the next two years, and it’s trading at 1.3x next year’s sales and 3.8x next year’s gross profit. Concentration, customer, and competition risks are minimal, and Katapult has a massive growth runway as the BNPL market grows. I imagine you will read several pitches for other FinTech companies such as Upstart, SoFi, and Square. Are these great companies? Absolutely. But ask yourself, “What has to happen for these stocks to increase 5x? 10x? What could make them decline 20%? 50%?”\n\nKatapult’s current performance relative to its peers easily justifies a $30 stock price. Now assume Katapult hits its revenue projections. Signs new partnerships with other merchants. Expands agreements with other BNPL players like Affirm. Katapult is a $1B company that could realistically grow to $10B in two years. If it outperforms, $10B might be a conservative valuation. I am incredibly bullish on Katapult, I encourage you to consider this intriguing opportunity.\n\nRelated links:\n\n* [https://ir.katapultholdings.com/news-events/news-releases](https://ir.katapultholdings.com/news-events/news-releases)\n* [https://katapult.com/partnerships/](https://katapult.com/partnerships/)",
        "subreddit": "SPACs",
        "title": "My thoughts on $KPLT and why it can be good opportunity for huge returns with low risk(already at the bottom). Earnings on 11/9 pre-market",
        "url": "https://www.reddit.com/r/SPACs/comments/qkobmu/my_thoughts_on_kplt_and_why_it_can_be_good/",
        "created": 1635830981.0
    }
]