[
    {
        "author": "BoomShakaLaka9",
        "created_utc": 1633362049,
        "id": "q17xof",
        "num_comments": 135,
        "num_crossposts": 0,
        "selftext": " The **Semiconductor Sector** has generated more than just solid gains so far this year, chip shortage has helped accelerate sales of semiconductors, sending the stock prices of companies that design and sell chips skyrocketing.  \nIn the last couple of weeks, I thought about adding a Semiconductor company to my portfolio, I decided to focus on AMD, NVIDIA, and INTEL, but because it might be a long post I decided to post in parts, the next post will be bot AMD so stay tuned.\n\n**If you think there is a company in this sector more worthwhile looking into, I'd be happy to hear some suggestions.**\n\n[ IMAGE SOURCE: youtube - cha cha video](https://preview.redd.it/avit8vg2dgr71.png?width=1280&amp;format=png&amp;auto=webp&amp;s=8a7f6bd2f815eaffa877381a845b1f0061e66ccb)\n\n#  Nvidia ~ $NVDA\n\n&gt;\"Nvidia is a platform story. We think there are many tentacles of future growth opportunity for Nvidia inclusive of the data center momentum that they are seeing today\" - Wells Fargo analyst\n\nNvidia is a big winner of many of the big tech events of the past year, including the global chip shortage, cryptocurrency volatility, and mining, the relentless fight by PC gamers to find RTX 30 series graphics cards in stock, and rising demand across segments-from work-from-home laptops to data centers. During it all, NVDA stock has continued its relentless climb, adding over 60% to its value so far in 2021.\n\n# Q2 Earnings\n\nAlmost all the company's business segments registered eye-popping growth in the 2nd quarter of fiscal 2022. The company reported a record Q2 revenue of $6.51 billion. This was up 68% year-over-year, which handily beat forecasts. Gaming revenue — all those RTX 30 series graphics cards — hit $3.06 billion, up 85% YoY. Datacenter revenue also set a record at $2.37 billion. Adjusted earnings of $1.04 per share (compared to 55 cents a year ago) also beat estimates.\n\n# Crypto Market dependence\n\nWhen of the negative points in NVDA Q2 earnings is that CMP sales came in well under the company’s estimates. CMP is a graphics card that was designed specifically for the cryptocurrency market. When the price of cryptocurrencies like Bitcoin fall, crypto mining rigs power down. Miners stop buying GPUs.\n\nFor Nvidia, this was felt in Q2. The company had projected it would sell **$400 million** worth of CMPs in the quarter. Instead, it sold just **$266 million.**\n\n# Future Growth In the Gaming Segment\n\nNVIDIA's 80%-plus market share of gaming graphics cards will be a big tailwind for the company. Its video gaming revenue more than doubled last quarter to $2.76 billion. Jon Peddie Research estimates that the market for discrete gaming GPUs could jump from $23.6 billion last year to more than $54 billion by 2025. NVIDIA's dominant market share means that it could win big from the additional revenue opportunity. \n\n# Arm Deal\n\nNvidia is in the process of acquiring ARM Holdings from SoftBank for approximately $40 billion, which would be a game-changer in its data center segment. The acquisition is currently held up in the approval process, but Nvidia told investors on their recent earnings call that the deal should get done. Denial is certainly a risk for Nvidia's stock price, so it's something to be aware of. recently Chinese and British regulators have had serious concerns about the acquisition and could block it.\n\n# Advanced Micro Devices ~ $AMD\n\nAMD has been making a comeback for years with a fast-improving lineup of chips addressing the laptop and PC markets, as well as hardware for data centers and the cloud computing services built on them. AMD is on track to record 50% revenue growth in 2021. The company's market share gains in the client and server CPU (central processing unit) markets, as well as the growing demand for graphics cards, have helped it to raise the guidance.\n\n[ IMAGE SOURCE: wccftech](https://preview.redd.it/faswa7u5dgr71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=99fdf6382da174aa1c34fff4ffb72dab7abaa7f2)\n\n#  Q2 Earnings And Growth\n\nOn July 27, AMD recorded 99% YOY revenue growth, to $3.85 billion, operating income of $831m (380% change YOY), and Net income of $710m - 352% YOY growth. The company consistently winning market share from Intel. Video game platform \"Steam\" reports that AMD's share of the client CPU market has now exceeded 30%, a massive improvement from three years ago when it held just over 16% of the market.\n\n[ AMD website - q2 Financial results](https://preview.redd.it/jjeh28b8dgr71.png?width=1041&amp;format=png&amp;auto=webp&amp;s=1194ec52ebd44ff97c9ae9686ff69f63d4787d4b)\n\n#  Video Games Potential Growth\n\nVideo game consoles have been in hot demand since last year, Sony could end 2021 with sales of 17.9 million PS5 consoles, up from last year's 4.5 million units. The PS5's sales momentum could remain strong with Sony expected to ship over 33 million units in 2022, 50 million units in 2023, and 67 million units in 2024. Meanwhile, sales of Microsoft's Xbox Series X are expected to jump from an estimated 3.3 million units in 2020 to 12 million units in 2021, and 37 million units in 2024.\n\n**AMD** supplies semi-custom chips to both Sony and Microsoft for their latest consoles. Nvidia, on the other hand, supplies chips for **Nintendo**'s Switch consoles. The Japanese video gaming company estimates that it could sell 25.5 million units of the Switch in the current fiscal year that ends in March 2022.\n\n# Xilinx Acquisition\n\nAMD's $35 billion merger with Xilinx is expected to be completed by the end of this year.the merger will allow AMD to expand the chips it offers the customers and it will take on Intel. The merger could make AMD one of the biggest tech companies and could expand its market share significantly.\n\n# Intel ~ $INTC\n\nIntel’s stock has underperformed the market in recent years, It’s struggled with R&amp;D, manufacturing, and management issues. the stock gained 15% in the past 3 years while the PHLX Semiconductor Index's gain of approximately 130%.\n\nIntel fell behind **TSMC** in the race to create smaller and more advanced chips. and lost market share to **AMD** in PC and data center CPU markets.\n\n[ IMAGE SOURCE: INTEL](https://preview.redd.it/sxqjttladgr71.png?width=1000&amp;format=png&amp;auto=webp&amp;s=b541cb7bc838e7c7ddb580196ebc1e085bedce22)\n\n#  New CEO = New Future?\n\nIntel’s new CEO, Pat Gelsinger, set his eyes on reclaiming the process lead by 2025. Gelsinger plans to achieve that goal by spending tens of billions of dollars on new foundries, upgrading the company's plants, expanding its third-party foundry services to pull orders away from TSMC, and attracting government subsidies in the U.S. and Europe to resolve the ongoing chip shortage and eliminate the industry's production bottlenecks in Asia.\n\nIf Intel achieves all those goals, its growth could accelerate over the next few years and make it a compelling long-term investment again.\n\n# GPUs War\n\nIntel generates most of its revenue from PC and data center CPUs and abandoned the high-end GPU market amid fierce competition from **Nvidia** and **AMD**, but it's now trying to bundle its new GPUs with its CPUs. Intel could challenge Nvidia and AMD in the laptop market with its DG1 mobile GPUs, pursue the desktop market with its DG2 GPUs, and enter the data center GPU market with its top-tier Ponte Vecchio GPUs.\n\n# Financial Comparisons\n\n[Market Size](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Market%20Cap?ref=nvdastonkssubreddit)\n\n1. INTC: $217.009B\n2. NVDA : $511.284B\n3. AMD : $121.722B\n\n[ when NVDA surpassed Intel's size this year - jika.io](https://preview.redd.it/9eho4lgddgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=edf57bcdd0bb2180a81cf108ed7e915083c40e14)\n\n [Gross Profit](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Gross%20Profit?ref=nvdastonkssubreddit) \\- After Q2\n\n1. INTC: $11.21B\n2. NVDA : $4.21B\n3. AMD : $1.83B\n\n[ Intel is still the most profit from the 3 - jika.io](https://preview.redd.it/o22mslredgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=1af2393607bca2cf54c50dec08a431b9a1072917)\n\n  [Return On Equity](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Return%20On%20Equity?ref=nvdastonkssubreddit) \\- After Q2\n\n1. NVDA : 11.23%\n2. AMD : 10.05%\n3. INTC : 5.94%\n\n[ ROE Comparison - jika.io](https://preview.redd.it/rke5xokgdgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=731149f0f5ffd48f43fd507caef9ceb7f3d2b710)\n\n  [Gross Profit Margin](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Gross%20Profit%20Margin?ref=nvdastonkssubreddit)\n\n1. NVDA: 64.78%\n2. INTC : 57.07%\n3. AMD : 47.53%\n\n[ Gross Profit Margin - JIKA.IO](https://preview.redd.it/pvsephuidgr71.png?width=1640&amp;format=png&amp;auto=webp&amp;s=5a3338bce9df16268b6d4d0daa7664bca647c6c6)\n\n [Net Profit Margin](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Net%20Profit%20Margin?ref=nvdastonkssubreddit)\n\n1. NVDA : 36.48%\n2. INTC : 25.78%\n3. AMD : 18.44%\n\n[ Net Profit Margin - JIKA.IO](https://preview.redd.it/s7kcpl7ldgr71.png?width=1638&amp;format=png&amp;auto=webp&amp;s=83614a344ab55c1d8686da128e837c21c3dd1e3c)\n\n#  My Conclusion\n\nIn my opinion, Intel is pretty much out of the race, even if the new CEO will shake things up, Intel will take a long time until climbing back up.\n\nI think that the better choice is between the fast-growing semiconductor stocks, **NVIDIA** or **AMD**. Given that AMD's growth pace was better than NVIDIA's in Q1 and Q2 and is likely to keep up that momentum for the remainder of the year, it looks like the better option right now. AMD also looks like a better buy for those looking for a growth stock at a reasonable valuation.\n\n&amp;#x200B;\n\n&gt;***Personal note:*** *Feel free to diagree and express your opinion about the post.*\n\n**Sources:**  \n[Jika.io](https://www.jika.io/dashboard/tools/multiples/AMD:NVDA:INTC/advanced%20micro%20devices:intel:nvidia/Revenue?ref=nvdastonkssubreddit) \\- Companies comparisons  \n[Motleyfool.com](https://motleyfool.com/) \\- stocks news  \n[nasdaq.com](https://nasdaq.com/) \\- news and information  \n[amd.com](https://amd.com/) \\- investor relations  \n[investor.nvidia.com](https://investor.nvidia.com/) \\- investor relations",
        "subreddit": "StockMarket",
        "title": "INTEL vs AMD vs NVIDIA - Looking for a Chip Stock.. which one should I buy?",
        "url": "https://www.reddit.com/r/StockMarket/comments/q17xof/intel_vs_amd_vs_nvidia_looking_for_a_chip_stock/",
        "created": 1633390849.0
    },
    {
        "author": "yardsale2",
        "created_utc": 1633206260,
        "id": "q02p4v",
        "num_comments": 111,
        "num_crossposts": 0,
        "selftext": "Hi, I have a few thoughts on intel and would like some discussion around it. I think it's a great long term value investment right now and would input. \n\n&amp;nbsp;\n\n**Finances**\n\n- Market Cap: ~220b\n\n- P/E: ~12\n\n- 80b revenue\n\n- 2.58% dividend\n\n- P/E much lower than industry average, and much better than competitors (Intel @12, AMD @36)\n\n\n&amp;nbsp;\n\n**Bear case arguments:**\n\n**Failure to deliver**\n\nThe biggest argument I hear against Intel, is that they have failed to deliver, again and again. That it's a value trap and is a slowly sinking ship. AMD is rapidly stealing market share. I will address these with bull points under growth &amp; management below.\n\n&amp;nbsp;\n\n**Shrinking market share**\n\nTheir % market share has barely declined, yet the market is pricing them as if they had been decimated.\n\n&amp;nbsp;\n\n**Using TSMC is giving up on its own fabs**\n\nI will address this below, it's actually super bullish for Intel long term and is great for transitioning to their new fabs (under construction).\n\nhttps://www.techradar.com/news/intel-locks-down-all-remaining-tsmc-3nm-production-capacity-boxing-out-amd-and-apple\n\n&amp;nbsp;\n\n**Please let me know others, which I will investigate.**\n\n&amp;nbsp;\n\n&amp;nbsp;\n\n**Bull case arguments:**\n\n**Good products, high demand, too big to fail**\n\n- There is a global shortage for semiconductors at the moment. Demand is constantly increasing as basically all new devices utilize semiconductors in one way or another. As long as intel can keep building chips, there will be buyers.\n\n- Intel is 'too big to fail' in the USA. The US military and government rely on their chips. They need US factories and companies to build these chips. They are not going to design their military chips in Taiwan, especially with the increased global tensions. The US military alone will continue to prop up intel if things go south.\n\n- Intel still controls ~77.5% of the x86 market share.  ​https://www.extremetech.com/computing/325848-amd-x86-cpu-market-share-soars-hits-14-year-high\n\n&amp;nbsp;\n\n**Growth &amp; management**\n\nThe biggest argument I hear against intel, is that they have been unable to deliver, again and again. That it's a value trap. I argue that it was mainly an issue with management, of which they have a completely changed. It will be a non-issue moving forward.\n\n- Their next gen cpu's (alder lake) leaks suggest that they outperform amd 5950x in both single &amp; multithreaded benchmarks. We will know for sure in early nov (nov 4th, rumoured release date). If true, this hints towards a turnaround already starting and that they are resolving their issues. https://www.forbes.com/sites/antonyleather/2021/09/27/new-benchmark-leak-reveals-impressive-performance-of-intels-12900k-12700k-and-12600k-alder-lake-processors/ \n\n\n- Intel has basically bought out all of TSMC's 3nm nodes (https://www.techspot.com/news/90780-intel-has-reportedly-secured-majority-tsmc-3nm-production.html). This is insanely good news for the long term outlook of Intel. At a high level, it appears that Intel is giving up on their own fabs and are on the decline. Looking deeper, I strongly disagree. Intel's previous CEO refused to use TSMC or anything beyond their own FABS to save face. They kept digging a deeper and deeper hole and falling further and further behind. Gelsinger (new CEO) acknowledges these issues, and is heavily investing (&gt;$120b) into new FABS, and using TSMC in the meantime to stay relevant, while transitioning to their new fabs.\n\n- Their new fabs are using ASML's next gen tech (ie: ASML's EUV chip-printing machines). Intel will get them before TSMC &amp; Samsung. There have been many closed door meeting between Gelsinger (intels new CEO) and ASML. https://fortune.com/2021/09/10/intel-ceo-big-honking-fab-planned-eu-europe-most-advanced/\n\n&gt; Thanks to an agreement the Intel CEO struck with his immediate counterpart at ASML, whom Gelsinger has already met three times face-to-face in the six months since taking the helm, the Intel facility should be the first to employ the Dutch company’s upcoming “high numerical aperture” EUV chip-printing machines. (ASML customers Taiwan Semiconductor Manufacturing Co., known as TSMC, and Samsung are on a waiting list, however.)\n\n&gt; This second generation evolution of ASML’s extreme ultraviolet photolithography can reduce the size of transistors—the building blocks of integrated semiconducting circuits—to just 20 angstroms (Å). That would make them less than a third in length of the current seven-nanometer nodes found in many of today’s smartphones. \n\n&amp;nbsp;\n\n- Management changed. This is the biggest point for me. They booted out the bean counters, and replaced them with engineers. Gelsinger (new CEO) was the CTO of intel during their glory years and is known as being a super strong / smart engineer. In my opinion, an engineer leading intel is more likely to make the company succeed vs a finance guy trying to cut corners. He is credited with designing some of their flagship cpu's / architectures that made Intel relevant in the first place. He knows what has to be done.\nhttps://en.wikipedia.org/wiki/Pat_Gelsinger\n\n- Hopping into the GPU game. Intel is known for having a good integrated graphics team. I would think that they have enough experience to pull off the dedicated gpu. Time will tell. https://www.pcgamer.com/intel-claimed-to-be-officially-targeting-rtx-3070-performance-with-first-alchemist-gpu/\n\n&amp;nbsp;\n\nWhat are your thoughts? \n\n*Yardsale2*",
        "subreddit": "ValueInvesting",
        "title": "Intel",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/q02p4v/intel/",
        "created": 1633235060.0
    },
    {
        "author": "yardsale2",
        "created_utc": 1633555963,
        "id": "q2u1ku",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Intel Leaps YOLO update, Oct 6, 2021",
        "url": "https://i.redd.it/2quqzkawewr71.png",
        "created": 1633584763.0
    },
    {
        "author": "ThorDansLaCroix",
        "created_utc": 1633556277,
        "id": "q2u5ck",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Would Emerging Markets have more potencial for Value return than in Developed Markets?\n\nI am asking not only for individual company investment but especially for ETFs.\n\nI was comparing the to holding of Emerging Markets Value ETFs and the composition are companies like TWN Semicont, Vale, Alibaba, Tencent, Kia Motors, and many banks and their markets seem to have more potencial for growth than developed markets.\n\nDeveloped markets Value ETFs have among their top holding companies like Intel, AT&amp;T, Toyota, Cisco, Pfzer and Britsh American Tabaco. I know they are great Value companies but I feel companies in emerging Markets have much more potencial for growth.\n\nBut I know next to nothing about investment and markets or these companies. So I am looking for more opinions to help making my mind on where to focus.",
        "subreddit": "ValueInvesting",
        "title": "Developed Markets VS Emerging Markets",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/q2u5ck/developed_markets_vs_emerging_markets/",
        "created": 1633585077.0
    },
    {
        "author": "hotdoggyguy",
        "created_utc": 1633199871,
        "id": "q00rwd",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Intel",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q00rwd/intel/",
        "created": 1633228671.0
    },
    {
        "author": "Bigbandjazzdrummer",
        "created_utc": 1633312803,
        "id": "q0vybi",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Chgcy, anyone have any “good”Intel? I can’t find any real info.",
        "url": "https://www.reddit.com/r/StockMarket/comments/q0vybi/chgcy_anyone_have_any_goodintel_i_cant_find_any/",
        "created": 1633341603.0
    },
    {
        "author": "TheIQgod",
        "created_utc": 1633113007,
        "id": "pze2yk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Intel, Tesla just just to name a few clients 📈📈",
        "url": "https://i.redd.it/qkvtnc3xtvq71.jpg",
        "created": 1633141807.0
    },
    {
        "author": "buffetty555",
        "created_utc": 1633271120,
        "id": "q0irpt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "INTEL vs AMD vs NVIDIA - Which Chip Stock Should I Buy?",
        "url": "https://www.reddit.com/r/StockMarket/comments/q0irpt/intel_vs_amd_vs_nvidia_which_chip_stock_should_i/",
        "created": 1633299920.0
    }
]