[
    {
        "author": "notbrokemexican",
        "created_utc": 1619894006,
        "id": "n2obgn",
        "num_comments": 139,
        "num_crossposts": 0,
        "selftext": "# Table of Contents\n\n1.  TL;DR\n2. Purpose\n3. Cloudflare vs. Fastly Overview\n4. Content Delivery &amp; Network\n5. Serverless Computing - The Event Driven Network\n6. Conclusion\n\n&amp;#x200B;\n\nCover Photo: [https://res.cloudinary.com/eduprojectsil/image/upload/v1619245057/y\\_wzy5y6.png](https://res.cloudinary.com/eduprojectsil/image/upload/v1619245057/y_wzy5y6.png)\n\n# TL;DR\n\n**$130 calls on September 17 🚀 🚀 🚀** \n\n**Expectation: Acquisition by Google.**\n\nI discuss how to think about Fastly as an investment to folks who have reasoned that investing in cloud compute and networking is a good idea but may not necessarily understand how or why it’s a good idea. We focus on basic networking and the consequences of “serverless” computing; an architecture that has gained popularity in recent years. \n\nI’ve written about Cloudflare before in May 2020, on an account called u/codingprofessor, before taking DD writing more seriously. I claimed that Cloudflare would blow past $60 dollars and was critically undervalued due to COVID economics, their current position in web security, and serverless computing. I still view that Cloudflare and Fastly can both reach 40B+ marketcaps by 2023.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bgr8i8qmmjw61.png?width=1148&amp;format=png&amp;auto=webp&amp;s=2bf7e7d98c3282535be6240c354322969fdd4bb1\n\n# Purpose\n\nTo be frank, I was surprised by the hunger for knowledge and I really enjoyed debating some of the rather brazen people here. WSB has grown and in my view, our committed analysts can outpace Wall Street analysts at places like Morningstar or The Motley Fool. We have on-the-ground experience as laborers, customers, and digital-natives that often gets filtered out.\n\nPart of this is also due to the fact that I believe that investing in securities will become increasingly complex yet accessible for a typical retail investor which will either result in isolation or cooperation. Here are some recent DDs:\n\n* [Understanding Fintech: Square, Jay-Z, and the Future of Neobanks From an Industry Engineer.](https://www.reddit.com/r/wallstreetbets/comments/m50k8j/understanding_fintech_square_jayz_and_the_future/)\n\n&amp;#x200B;\n\n* [Understanding Social Networks: Pinterest’s Idea Search Engine, Women’s Influence, and What Google+ Got Wrong. $PINS DD](https://www.reddit.com/r/wallstreetbets/comments/m8jd87/understanding_social_networks_pinterests_idea/)\n\n&amp;#x200B;\n\n* [\\*SIGH\\* Understanding GameStop: Ryan Cohen, Customer Service, and The Great Long. How to Fight Scale With Precision and GameStop’s 30B+ marketcap.](https://www.reddit.com/r/wallstreetbets/comments/mb585a/sigh_understanding_gamestop_ryan_cohen_customer/)\n\n&amp;#x200B;\n\n* [Understanding Mexican-American Trade: The USMCA and North America’s First Intercontinental Railroad. Kansas City Southern ($KSU) and Canadian Pacific ($CP) Merger DD.](https://www.reddit.com/r/wallstreetbets/comments/mejezz/understanding_mexicanamerican_trade_the_usmca_and/)\n\n&amp;#x200B;\n\n* [Understanding The Infrastructure Bill: The Federal Goals, Employment Solutions, and AutoDesk's Role in the Post-COVID Economy.](https://www.reddit.com/r/wallstreetbets/comments/mjcpfw/understanding_the_infrastructure_bill_the_federal/)\n\n&amp;#x200B;\n\n* [Understanding ROBLOX - Gaming's Role in Education Markets, Mass Media, and Financial Technology](https://www.reddit.com/r/wallstreetbets/comments/msq9jg/understanding_roblox_gamings_role_in_education/)\n\n&amp;#x200B;\n\n* Is the average retail investor familiar with the network models that govern software like Fastly and Twilio? **(YOU ARE HERE)**\n\nAt the end of the day, I am an educator and I believe that the goal of education is to engage a reader into a deeper curiosity or discussion, so that’s why I’m sharing my writing. I’m not here to convince you that this stock is even a good choice - but to explore the economics behind it.\n\n&amp;#x200B;\n\n# Cloudflare vs. Fastly\n\n**- TL;DR Fastly makes stuff faster, Cloudflare is more general purpose. They can be used together.**\n\nhttps://preview.redd.it/8nw4s6mlojw61.png?width=1220&amp;format=png&amp;auto=webp&amp;s=0060e02dd4363ce7e7cc4cf3b59b3438603b9bc7\n\nThis is a common question that is asked by investors interested in the cloud computing space from both novices and experts alike. In my view, the comparison isn’t very useful and usually illustrates some misunderstanding between the two product spaces. Fastly is focused on real-time services and acts as an optimizing layer for existing network providers. Cloudflare is a general network competitor. You can use both, and most do.\n\n&amp;#x200B;\n\n[General purpose needs](https://preview.redd.it/8g9lk7uhwjw61.png?width=2314&amp;format=png&amp;auto=webp&amp;s=bdaadd144aa9a0b64a37a3c05a6f236c965fefb6)\n\nIn a crude sense, Fastly focuses on convenience akin to the services provided by Costco, while players like Akamai or Cloudflare focus on the convenience brought to you by gas stations or companies like Walmart. It’s not to say that one is better than the other, because it's not. They just solve different problems with completely different approaches. You may not go to Costco as often as you do Walmart, but when you go to Costco, you're picking up and utilizing a lot more.   \n\n\nThis explains why Fastly takes the approach to generally co-operate with other service providers and is able to provide a range of services for things like Snapchat storage, Spotify network meshes, Google Cloud services, and other real-time demands from the tech industry.\n\n&amp;#x200B;\n\n&gt;\"While a convenience store is generally closer to a person's home, it has a limited set of items for sale. If the person drives a few more miles to the supermarket, they could get all of their groceries in one trip. In this case, convenience stores represent the approach taken by the legacy CDN's with many local POPs and the supermarkets represent Fastly's approach with fewer, larger ones.\"\n\n&amp;#x200B;\n\nCloudflare has ambitions to compete with the likes of companies like Amazon and attempts to be a general purpose solution for networking on the internet - it wants to make the internet more accessible, safer, and fair. Fastly seeks to solve specific problems on the internet. So in a nutshell, one is a general solution and the other is a specialized solution.\n\nAn example of specialized needs provided by Fastly is like Reddit’s execution of the r/place experiment in 2017 - which allowed millions of users to collaborate and draw an image together pixel by pixel with rules and regulations in real-time.\n\nhttps://i.redd.it/2kf4qnoorjw61.gif\n\nThis is only one example of many. The way I like to frame it is by viewing real-time and collaborative services as a relatively new economic need, and thus a product like Fastly has a high demand from organizations that excel with these kinds of services. You may see associations with Fastly from places like Spotify, Ticketmaster, or The New York Times - all of which have specific needs or demands when it comes to content delivery and network management.\n\nhttps://preview.redd.it/m9muspwsrjw61.png?width=1594&amp;format=png&amp;auto=webp&amp;s=72b18b1b49ed8aed906a2b9936beb1e29a5479a1\n\nA big advantage that Fastly has in this regard is the fact that they often build their network with the intention of being world-class from top to bottom, from the code they write to the metals that build their points of presence. They are effectively able to choose their destiny as a product versus having to race the horses in competition. They research, experiment, and execute on the boundary of networking, making it a superb way to play the serverless and networking industry from a long point of view.\n\nThe result of this approach means higher quality servers and less need to rely on the number of PoPs used.  This ultimately means that Fastly spends less on building and maintaining servers while being an order of magnitude faster at the same time. They are efficient and provide value per the dollar spent on their network from customers and internal alike.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/s9n1xm5zrjw61.png?width=640&amp;format=png&amp;auto=webp&amp;s=65e97432b694a884e1445db1793377e0f3eefa8c\n\nCloudflare's team of course counters this by saying that speed is not nearly as important as Cloudflare's ability to be compliant to global requirements. This is completely nonsense if you consider that in the long-term, Fastly's general approach is to solve specific problems rather than to function as a general purpose network. \n\nThe compliance debate is a bogus marketing attempt when Fastly's speeds, in the microseconds, is exponentially faster than Cloudflare's serverless implementation that sits in the milliseconds range. This is frankly an example of how Matt Prince is warmer to investors and plays a stronger marketing game than Artur Bergman, who seemingly could not care to impress Wall Street funds and plays for the long-term. \n\nhttps://preview.redd.it/9afefjyasjw61.png?width=1600&amp;format=png&amp;auto=webp&amp;s=af129b27bf734c74c0d8a039341ff03b126af5c1\n\nWhy does this distinction matter? Well what of the requirements where networking speed and response times are critical, like hospital communications, stock market crashes, wildfires, or other problems unique to the challenges of running a network?\n\n&amp;#x200B;\n\n&gt;The way to think about this is, what do you pay for, right? I mean if you -- and where are these moments that are valuable. When Tiger Wood walks down with the 18th green the Masters and God willing he is able to do that again, that matters, that moment matters. Everyone is going to tweet about it, and everyone wants to see it, the company that is in charge of that cares desperately about that content. When you send a gift across the Internet, like it's not monetized in the same way, it's not as valued.. So where we have seen the value is in content that is highly valuable to customers and their end consumer, where they're willing to pay for it and the quality, and the security and the scale of that deeply matters. And we have always focused our work on that type of content. There's plenty of content that just scrapes by and is low commodity. Every month, they want a lower price. That's a different market from our perspective, and we're not in it.\" - Fastly CEO\n\n# Understanding Content Delivery\n\n**- TL;DR You have data, you cut the data into smaller pieces, send it across a network, and rebuild those pieces somewhere else.**\n\nhttps://preview.redd.it/a92mp9wesjw61.png?width=951&amp;format=png&amp;auto=webp&amp;s=c98e66b61a7b13f89a4556399c8264a038bb16ac\n\nIt’s helpful to understand the 7  steps that protocols take as they travel across and through a network around the world. This model is known as the OSI model and it’s not necessarily the end-all-be-all model that governs the internet; but it is a useful framework to understand at a glance.\n\nThere are many complexities that go behind these protocols and they are the subject of intense debate or research. At the same time, many of these steps follow a similar process - translate or transform the data that’s received and sent. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/r5k1yknbyjw61.png?width=472&amp;format=png&amp;auto=webp&amp;s=60bbe4420f4025c8c791d62c569453ce82a8a8b0\n\nFor example, the web browser translates the data into machine bytecode in a similar way that a networking router will need to translate information into a stream of 0 and 1 signals. This may not make too much sense yet, but just remember that it’s just a series of translations and preparations of data into different segments so that it could be read and understood by other pieces of hardware.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kvhajfjtujw61.png?width=1762&amp;format=png&amp;auto=webp&amp;s=2570ebd03b9fd5c08989b0b5551d9eea2c5c3c44\n\n&amp;#x200B;\n\n1. **Application Layer:** You initiate a Zoom call. It has passed through the application layer using an real-time messaging protocol. It sends the video to the presentation layer.\n2. **Presentation Layer:** The video data is received and compressed. It gets sent to the session layer.\n3. **Session Layer:** A communication session is initiated. A network communication is initiated, with various receivers at some set of defined internet address routes.\n4. **Transportation Layer:** The data is further segmented and prepared for transportation.\n5. **Network Layer:** Once the data has reached this stage, the segments are converted to packets.\n6. **Data Link Layer:** The data is sliced into frames and delivered to the physical layer.\n7. **Physical Layer:** The frames are converted into a bitstream of 0s and 1s as a way to represent that final stage of data representation, which are signals that along a physical medium like a cable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/68fe020vsjw61.png?width=640&amp;format=png&amp;auto=webp&amp;s=6f4ae86782c3c87978af6e4a9bf46d1b0f695347\n\nAs the data reaches its destination, it goes through the 7 layer process again in the opposite direction, where the data is received at the physical layer and concludes at the application layer (the person who you sent an Zoom call to). There’s a reason that the network use trucks or mail deliveries as ways to compare the process as it can be strikingly similar at times. \n\nWhat are the complexities related to delivering a letter, a box of clothes, or a Home Depot truck full of metals and wood? So that’s the essence behind content-delivery networks - preparing information and delivering it with optimal paths.\n\nIt’s worth taking some time to ponder and think about this. They may be words or ideas that you’ve heard - routers, bitstreams, addresses, and so on. What is the difference between collecting a Pinterest pin, playing a Spotify stream, or setting up a Zoom call without a video? How do we utilize location data when it comes to COVID containment efforts? What are the consequences of correcting a news article, fact checking a social media post, or reconciling the differences in video game connections in a game like Call of Duty?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/d5nbigz1tjw61.png?width=690&amp;format=png&amp;auto=webp&amp;s=d39cdad6269f4b7d224fff12e6c39adc60584d60\n\nWith this developing model in mind, consider again how Cloudflare is particularly invested in the overall health of a network, while Fastly is primarily concerned with pushing the network further. They seek to solve different platforms, while having obvious overlaps at the same time.\n\n# Serverless Compute - The Event Driven Network\n\n**TL;DR Serverless allows software engineers to spend more time building products.**\n\nhttps://preview.redd.it/lhez9rq6tjw61.png?width=1260&amp;format=png&amp;auto=webp&amp;s=fb377d7a5f2c3d3995c4c56ec0a5b925a860e0f7\n\nWhat serverless architecture accomplishes is that it adds programmability and portability to the cloud clusters and the network. There are two major benefits to serverless computing:\n\n1. It grants developers access to complex functions out of the box.\n\nFor example, if a developer wants to create a lightning fast application where taking an image of a crop plant returns some analysis about the health of the crop or warning signs that the crop image is showing, a serverless \"function-as-a-service\" can provide that capacity for a developer. \n\nhttps://preview.redd.it/bm6jwodptjw61.png?width=1360&amp;format=png&amp;auto=webp&amp;s=29a9e9552a1f3874b8932e5baaabe5bf91c8fccd\n\nThat image is stored with the provider to improve the quality of future recommendations and output as well. Given that the image taker is likely situated in a rural area, edge computing like this allows the application to complete this process much faster than communicating to a central server that is in a much farther location.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1trzui6ctjw61.png?width=670&amp;format=png&amp;auto=webp&amp;s=5501fee8d2a9a8e2e5bce681a6b86d6f48e69da3\n\n2. It allows developers to spend more time working on application code rather than infrastructure to   \nsupport it.\n\nImagine that a product that benefits off real-time services and events has particular problems handling the amount of traffic that reaches their servers. A perfect example of this are the server failures of Rob-in-the-hood during spikes of activity or Reddit's own ability to handle surges of logins, registrations, and activity after events like GME's stock market explosion. Other historical problems were things like World of Warcraft's expansion releases, where servers were effectively \"on fire\" and required round-the-clock support.\n\nEdge computing effectively offloads some of these problems from central servers by making the network more programmable and effective. If an application I wrote suddenly has to manage 1,000,000 users, a serverless architecture allows for intelligent \"autoscaling\" - which means that services like Fastly will handle those problems for me. This ultimately results in a metered pay-as-you-go system.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hq7l51wwtjw61.png?width=1000&amp;format=png&amp;auto=webp&amp;s=c1f88e8d28b452a5bf0a7d0c560e22e8b2ba0f7a\n\nThe combination of these two benefits is pretty powerful, allowing a developer to essentially start up an idea from application to deployment at a much faster pace. I believe this should equip a reader with the ability to imagine the opportunity behind edge and serverless computing. Here are some simple questions I like to think about:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ydk0hfx7ujw61.png?width=800&amp;format=png&amp;auto=webp&amp;s=3c506b4d99dfd7e7f512f9d304f5c1e8f53e52e9\n\n\\- Can we improve the customer experience of swiping a card in a store or other network based currencies?\n\n\\- How do we improve the security of individual network-connected devices?\n\n\\- Are we able to improve the response times of emergency technologies like hospital or firefight dispatching?\n\n\\- Are we able to better measure online engagement and create new interactive experiences?\n\n\\- Will online video games require servers bounded by location?\n\n\\- Would we be able to change camera angles when watching a sports stream?\n\n\\- Can we improve the quality of industrial automation or logistics?\n\n\\- Are we able to extend programmability to \"node\" based products like windmill farms or electric vehicle charging stations?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5otn5vekvjw61.png?width=2230&amp;format=png&amp;auto=webp&amp;s=14201da0292e3f895dc829239999889d0af43add\n\nSome of these questions are asked by Fastly themselves, as they list the following subjects of interest in their S-1:\n\n1. **API acceleration**. Accelerate and secure critical API responses at the edge for delightful application experiences, such as instant hotel lookup based on location and real-time inventory updates between retail stores and their online storefronts;\n2.  **IoT**. Process and secure data from connected devices at the edge for instant results for time-sensitive applications;\n3. **Cloud migration**. Seamlessly migrate from data center to cloud, hybrid or multi-cloud environments, enabling the customer to take advantage of the functionality and cost savings of one or more cloud providers\n4. **Enabling redactedchain (block)**. Cache and accelerate individual transactions on the redactedchain (block) in real time.\n\n# Conclusion\n\nTL;DR Investing in some form of serverless computing is a good idea.\n\nYou may have noticed that I did not discuss financials. This is mostly because these details do not nearly weigh as much as the general understanding of the product, which is content-delivery and serverless computing. In my view, the economic consequence of these architectures far outweighs any other metric that could measure the future value of a company like Fastly. Most of my DD writing follows this principal; I'm far more focused on economic consequences and incentives of an industry player rather than data-points that can be fixed in time like a recent earnings or financial report. Those things need to just check out.",
        "subreddit": "wallstreetbets",
        "title": "Understanding Serverless: Fastly, Software-Defined Networks, and the Cloudflare vs. Fastly Debate",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2obgn/understanding_serverless_fastly_softwaredefined/",
        "created": 1619922806.0
    },
    {
        "author": "utradea",
        "created_utc": 1620735636,
        "id": "n9vqk2",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n**Introduction**\n\nOf the many forces of society, the advancement of technology is one that is truly unstoppable. From how we obtain information to how people communicate from a distance, technology has changed the way people live their lives. The service providers of our everyday lives are consistently looking for ways to automate &amp; improve their offerings/operations. This created a market and demand for Amdocs Limited (Nasdaq: DOX), a technology and software product/service (such as consulting) provider that serves companies in communications, media, finance, entertainment, digital, etc.\n\n**Company Overview**\n\nEstablished in 1982 In Israel, Amdocs Limited is a multinational software company headquartered in Missouri, US. For 40 years, Amdocs has been offering advanced software products and related technology services to optimize their clients’ operations. With 26,000 employees, Amdocs is currently in business with 350 service providers in more than 80 countries. Their clientele comprised of leaders in a wide range of industries: telecom giants AT&amp;T &amp; Bell, financial institutions like HSBC, and general crowd favorites such as Amazon, 7Eleven, and Microsoft.\n\nMost of Amdocs’ offerings are provided within “amdocsONE”, a comprehensive collection of products/services consisting of: Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation. With its “cloud-native, modular and open offerings”, Amdocs helps clients smoothly and fully transition into tech-automated, digital operations.\n\nIn such a demanded market with high-ticket clients, Amdocs recorded $4.16B in revenue during FY2020 (ended September 30th, 2020), at a 33.9% Gross Margin, 19% EBITDA Margin, and 11.9% Net Profit Margin. DOX also has consistently growing Operating Cash Flow, recording $910.7M in the Last-Twelve-Months ending in December of 2020.\n\nYes, everything seems to be working out well for DOX, but that brings up the question: is there still room to grow, or has DOX plateaued, making it a safe bet, but not a high-return investment?\n\n**Capital Structure &amp; Shareholders Breakdown**\n\nA quick look at Amdocs’ capital structure: **22% Debt, 77.1% Common Equity, 0.9% Minority Interest.** What is important to point out here is that DOX has **recorded $0 in debt** for 3 straight years from FY2017-19. This is a very uncommon occurrence for a company to be 0% leveraged. In contrast, most of its competitors are operating around the 15%-25% debt/total capital ratio, comparable companies like Akamai Technologies recording \\~40% leverage in its capital structure. \n\nWhen it comes the shareholders of DOX, most of its outstanding shares are owned by institutional holders. Traditional portfolio managers such as asset manager firms are the biggest investors, with FMR LLC. as the largest holder. The large scale and consistent (holds &amp; buys) asset management investment shows street professionals see DOX as a profitable, stable investment.\n\n**Looking Long**\n\nOverall, I believe DOX shows potential at a hold/buy for long positions if you are looking to invest in an undervalued, but experienced &amp; matured company.  The following are three main theses behind a long investment in DOX:\n\n* **Strong &amp; Consistent Financial Performance:**\n\nAs an established company, we are seeing highly predictable topline growth rate with consistent profit margins. Although these no longer large-scale increases we would see on a growing tech company, DOX’s consistency and strong performance is definitely a supporting factor when it comes to investment. In more detail, DOX has a 2.9% top-line 5-year CAGR as of December 31st, 2020, with corresponding 3%, 3.6%, and 10.4% 5-year CAGR with EBITDA, EBIT, and Net Income, respectively. Although top-line growth was contracting a few years prior, it has rebounded between 2015-20, which could be contributed to the increasing number of companies transitioning into digital operations/cloud systems. Nevertheless, the higher (and increasing) bottom-line CAGRs means the company is still consistently increasing its profit margins (it is important to point out in that 5Y Net Income CAGR as of Dec.31st 2020 is significantly higher than previous years, which were around 2.2%-5.3%). DOX also has a strong cash flow, largely due to steady increases in operating cash flow. The OP cash flow is the best indicator here as unlevered free cash flow has seen some small-scale turbulence in recent years due to M&amp;As such as the acquisition of Openet Telecom, Juganu Ltd., and Veego during CY2020. Overall, DOX is a strong investment from the financial perspective due to its margin growth and consistency.\n\n* **Deep Product Portfolio with Wide Coverage**\n\nThrough “amdocsONE”, Amdocs is able to provide a full-suite of comprehensive products/services that covers every stage of digital transformation. From cutting 80% of time-to-market when utilizing Amdocs bundle offers, to continuous operational support and open tools/cloud platforms, clients receive a thorough service when working with Amdocs. Within the six main categories of offerings mention above (Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation), there are numerous individual products that allows users to customize their usage of the Amdocs’ platform and offerings. For example, CES20 is Amdocs’ cloud-based customer experience suite. Within CES20, there are 4 products that helps automate and digitize the users’ operations: DigitalONE, CatalogONE, RevenueONE, and Service &amp; Network Automation. DigitalONE is a cloud-based system that allows users to work on their branding and customer experience. CatalogONE is an open-cloud platform catalog solution that allows users to launch new products easily with a detailed user interface. RevenueONE is a platform that allows users to scale or acquire new revenue stream while limiting the cost of acquisition. Last, Service &amp; network Automation is a branch covered by amdocsNEO. AmdocsNEO is a service &amp; network automation platform that offers a wide range of tracking and management capabilities. It is used to drive and control the fast automation process of the company. The CES20 is just an example of how Amdocs products are often interconnected and deeply comprehensive. They also offer certain platforms or products/services that are industry specific.\n\nThe wide coverage of the Amdocs offerings means they can gain market penetration across numerous industries. At the same time, the stage-specific offerings allow Amdocs to stay in demand and relevant as clients transition and grow. This plays a huge part into client retainment.\n\nLast, the continuous innovation initiatives at Amdocs supports an investment as it shows the company is consistently trying to grow and improve itself. As a tech company, it is extremely dangerous to slack-off on innovation, which is often seen with tech firms that reaches a consistent profit margin. Being in the tech industry means you live and die by the creativity and uniqueness of the offerings. Amdocs is consistently investing \\~20% of their gross profit into R&amp;D. This shows the company’s dedication to innovation, which ensures that it will remain in demand in the future.\n\n* **Extremely Low Leverage**\n\nThe last thesis is quite a short and simple one: the low leverage of the company means reduced risks and limits debt-related expenses such as interest/principal payments, which in turn increases their profitability. As mentioned above, there has be several years where the company literally at $0 in debt. During FY2020, the company took on \\~$1B worth of debt, which could mean they are preparing for large scale development as from a financial standpoint, they are not in a situation where taking the extra cash is worth the liability. With that being said, the new debt is only 22% of the company’s overall capital structure, and they will have no problem paying off the related fees as they have a strong track-record of positive cash flow.\n\n**Macro Market Trends**\n\nThe overall demand for digital/automation transformation/operations creates numerous trends that can positively impact the future of DOX. With the COVID-19 pandemic, company were pushed by the circumstances to digitize their operations, which will expand the market as well as create higher demand for the future. Here are some top trends that will impact DOX’s performance:\n\n* **Overall Growth of the SaaS Market:**  \n\n   * has been consistent growth in the past decade in the SaaS market. This is driven by multiple factors including the automation of internal control, enterprise centre processing system, as well as the boom of 5G and cloud-based services. Looking into the future, for the period of 2019-23, the worldwide SaaS market is expected to reach a $60.36B valuation, recording a 9% CAGR over that period.\n\nhttps://preview.redd.it/re0rwefjhhy61.png?width=581&amp;format=png&amp;auto=webp&amp;s=3e03058110bfbf707b168afd09bdda586914a7db\n\n* **Lasting Impacts of COVID-19:**  \n\n   * The pandemic has already significantly accelerated the digitization rate due to the lockdowns and remote working environments. This is not a one-time catalyst, but rather a preview of what was going to happen in the future regardless; the pandemic situation has simply brought the future quicker. Going cloud or digitizing is not a temporary decision, this means the market has permanently expanded, and will continue to grow as demand increases.\n\nhttps://preview.redd.it/78jymbukhhy61.png?width=601&amp;format=png&amp;auto=webp&amp;s=d0362d3fb6c918222d0ffb49fff1132dadea2686\n\n* **5G Penetration &amp; Advancements**  \n\n   * Continuous developments in 5G technology will impact the SaaS industry in two ways:\n\n1. It will increase the accessibility of cloud-platforms and related services, thus increasing demand.\n2. It will improve the quality and range of capabilities for the products/services of software companies.\n\nhttps://preview.redd.it/zcswsxwlhhy61.png?width=580&amp;format=png&amp;auto=webp&amp;s=f3c6560ebdcf519a5bbed1bdc42acc3c298571bc\n\nIn the modern society, it seems like life is limited if you have bad Wi-Fi connection. That is emphasized in the world of SaaS. Broader bandwidth and connection qualities will incentivize potential customers to digitalise and help service providers create higher quality products.\n\n**Financials and Valuations**\n\nWhen it comes to the fair valuation of Amdocs Limited (DOX), I used both comparable companies and intrinsic valuations, then weighted the price outcomes for the final target price. Instead, I evaluated the company using a basic comparable analysis. The companies included in the comparable universe are Akamai Technologies Inc. (AKAM), Ciena Corporation (CIEN), Citrix Systems (CTXS), Cognizant Technology Solutions Corp. (CTSH), and Perspecta Inc. (PRSP). The DCF valuation is relative crude with simple margin and top-line forecasts, but the results seem very reasonable and in-line with street estimates.\n\n**Risks**\n\nTo finish off this analysis on DOX, there are a few key risks to keep in mind:\n\n* **Cyber Security**\n\nAlthough moving operations towards cloud or digital platforms will increase efficiency and limit costs, it does come with security risks. By nature of public, integrated, and/or connected cloud platforms or enterprise central systems, a large quantity of information can be easily accessed in one spot. Although that makes operations easier, it also increases the impact of hacks or other cyber security concerns. In these interconnected platforms, large amounts of information are at risks once the “first door” is opened. Hackers no longer need to crack multiple systems to acquire different information such as customer information and financials. If Amdocs gets hacked, it will likely be very detrimental to the company as large quantity of information will be exposed.\n\n* **Limited Innovation or Growth due to Lack of 5G or Internet Penetration**\n\nFor Amdocs and the entire SaaS industry, poor internet infrastructure will limit growth potential and market penetration. If 5G usage and general internet coverage does not match the rate of innovation of Amdocs, revenue growth will stall, which might impact the pricing of the stock. It will also limit the room for innovation and enhancement, which allows more time for competitors to grow within the current infrastructure and increase the competition.\n\n**In the End: Buy, Hold, or Sell?**\n\nOverall, I think Amdocs Limited (DOX) is currently undervalued. In general, the street has a buy or hold/buy valuation on the current price, which I do agree with. Therefore, my final thoughts on DOX are:\n\n* **Buy** for long-term value investment. The stock might be somewhat volatile in the short-term, but its long-term value will be consistent.\n* **Hold/Sell** if an investment return is already realized. The economy and overall market is kind of inflated as we recover from the pandemic, therefore a potential cash-out is definitely tangible as rumours of stock market crash spreads.\n\n**TLDR**\n\nAn undervalued technology solution and service provider in a growing market with $0 debt and an upside of at least 25%\n\nOriginal analysis can be found [here](https://info.utradea.com/idea/60997b509f45b0081495db90)",
        "subreddit": "wallstreetbets",
        "title": "$DOX - A Leader in Media &amp; Communication Digitization (Long DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9vqk2/dox_a_leader_in_media_communication_digitization/",
        "created": 1620764436.0
    },
    {
        "author": "utradea",
        "created_utc": 1620735704,
        "id": "n9vrc2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nOf the many forces of society, the advancement of technology is one that is truly unstoppable. From how we obtain information to how people communicate from a distance, technology has changed the way people live their lives. The service providers of our everyday lives are consistently looking for ways to automate &amp; improve their offerings/operations. This created a market and demand for Amdocs Limited (Nasdaq: DOX), a technology and software product/service (such as consulting) provider that serves companies in communications, media, finance, entertainment, digital, etc.\n\n**Company Overview**\n\nEstablished in 1982 In Israel, Amdocs Limited is a multinational software company headquartered in Missouri, US. For 40 years, Amdocs has been offering advanced software products and related technology services to optimize their clients’ operations. With 26,000 employees, Amdocs is currently in business with 350 service providers in more than 80 countries. Their clientele comprised of leaders in a wide range of industries: telecom giants AT&amp;T &amp; Bell, financial institutions like HSBC, and general crowd favorites such as Amazon, 7Eleven, and Microsoft.\n\nMost of Amdocs’ offerings are provided within “amdocsONE”, a comprehensive collection of products/services consisting of: Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation. With its “cloud-native, modular and open offerings”, Amdocs helps clients smoothly and fully transition into tech-automated, digital operations.\n\nIn such a demanded market with high-ticket clients, Amdocs recorded $4.16B in revenue during FY2020 (ended September 30th, 2020), at a 33.9% Gross Margin, 19% EBITDA Margin, and 11.9% Net Profit Margin. DOX also has consistently growing Operating Cash Flow, recording $910.7M in the Last-Twelve-Months ending in December of 2020.\n\nYes, everything seems to be working out well for DOX, but that brings up the question: is there still room to grow, or has DOX plateaued, making it a safe bet, but not a high-return investment?\n\n**Capital Structure &amp; Shareholders Breakdown**\n\nA quick look at Amdocs’ capital structure: **22% Debt, 77.1% Common Equity, 0.9% Minority Interest.** What is important to point out here is that DOX has **recorded $0 in debt** for 3 straight years from FY2017-19. This is a very uncommon occurrence for a company to be 0% leveraged. In contrast, most of its competitors are operating around the 15%-25% debt/total capital ratio, comparable companies like Akamai Technologies recording \\~40% leverage in its capital structure. \n\nWhen it comes the shareholders of DOX, most of its outstanding shares are owned by institutional holders. Traditional portfolio managers such as asset manager firms are the biggest investors, with FMR LLC. as the largest holder. The large scale and consistent (holds &amp; buys) asset management investment shows street professionals see DOX as a profitable, stable investment.\n\n**Looking Long**\n\nOverall, I believe DOX shows potential at a hold/buy for long positions if you are looking to invest in an undervalued, but experienced &amp; matured company.  The following are three main theses behind a long investment in DOX:\n\n* **Strong &amp; Consistent Financial Performance:**\n\nAs an established company, we are seeing highly predictable topline growth rate with consistent profit margins. Although these no longer large-scale increases we would see on a growing tech company, DOX’s consistency and strong performance is definitely a supporting factor when it comes to investment. In more detail, DOX has a 2.9% top-line 5-year CAGR as of December 31st, 2020, with corresponding 3%, 3.6%, and 10.4% 5-year CAGR with EBITDA, EBIT, and Net Income, respectively. Although top-line growth was contracting a few years prior, it has rebounded between 2015-20, which could be contributed to the increasing number of companies transitioning into digital operations/cloud systems. Nevertheless, the higher (and increasing) bottom-line CAGRs means the company is still consistently increasing its profit margins (it is important to point out in that 5Y Net Income CAGR as of Dec.31st 2020 is significantly higher than previous years, which were around 2.2%-5.3%). DOX also has a strong cash flow, largely due to steady increases in operating cash flow. The OP cash flow is the best indicator here as unlevered free cash flow has seen some small-scale turbulence in recent years due to M&amp;As such as the acquisition of Openet Telecom, Juganu Ltd., and Veego during CY2020. Overall, DOX is a strong investment from the financial perspective due to its margin growth and consistency.\n\n* **Deep Product Portfolio with Wide Coverage**\n\nThrough “amdocsONE”, Amdocs is able to provide a full-suite of comprehensive products/services that covers every stage of digital transformation. From cutting 80% of time-to-market when utilizing Amdocs bundle offers, to continuous operational support and open tools/cloud platforms, clients receive a thorough service when working with Amdocs. Within the six main categories of offerings mention above (Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation), there are numerous individual products that allows users to customize their usage of the Amdocs’ platform and offerings. For example, CES20 is Amdocs’ cloud-based customer experience suite. Within CES20, there are 4 products that helps automate and digitize the users’ operations: DigitalONE, CatalogONE, RevenueONE, and Service &amp; Network Automation. DigitalONE is a cloud-based system that allows users to work on their branding and customer experience. CatalogONE is an open-cloud platform catalog solution that allows users to launch new products easily with a detailed user interface. RevenueONE is a platform that allows users to scale or acquire new revenue stream while limiting the cost of acquisition. Last, Service &amp; network Automation is a branch covered by amdocsNEO. AmdocsNEO is a service &amp; network automation platform that offers a wide range of tracking and management capabilities. It is used to drive and control the fast automation process of the company. The CES20 is just an example of how Amdocs products are often interconnected and deeply comprehensive. They also offer certain platforms or products/services that are industry specific.\n\nThe wide coverage of the Amdocs offerings means they can gain market penetration across numerous industries. At the same time, the stage-specific offerings allow Amdocs to stay in demand and relevant as clients transition and grow. This plays a huge part into client retainment.\n\nLast, the continuous innovation initiatives at Amdocs supports an investment as it shows the company is consistently trying to grow and improve itself. As a tech company, it is extremely dangerous to slack-off on innovation, which is often seen with tech firms that reaches a consistent profit margin. Being in the tech industry means you live and die by the creativity and uniqueness of the offerings. Amdocs is consistently investing \\~20% of their gross profit into R&amp;D. This shows the company’s dedication to innovation, which ensures that it will remain in demand in the future.\n\n* **Extremely Low Leverage**\n\nThe last thesis is quite a short and simple one: the low leverage of the company means reduced risks and limits debt-related expenses such as interest/principal payments, which in turn increases their profitability. As mentioned above, there has be several years where the company literally at $0 in debt. During FY2020, the company took on \\~$1B worth of debt, which could mean they are preparing for large scale development as from a financial standpoint, they are not in a situation where taking the extra cash is worth the liability. With that being said, the new debt is only 22% of the company’s overall capital structure, and they will have no problem paying off the related fees as they have a strong track-record of positive cash flow.\n\n**Macro Market Trends**\n\nThe overall demand for digital/automation transformation/operations creates numerous trends that can positively impact the future of DOX. With the COVID-19 pandemic, company were pushed by the circumstances to digitize their operations, which will expand the market as well as create higher demand for the future. Here are some top trends that will impact DOX’s performance:\n\n* **Overall Growth of the SaaS Market:**  \n\n   * has been consistent growth in the past decade in the SaaS market. This is driven by multiple factors including the automation of internal control, enterprise centre processing system, as well as the boom of 5G and cloud-based services. Looking into the future, for the period of 2019-23, the worldwide SaaS market is expected to reach a $60.36B valuation, recording a 9% CAGR over that period.\n* **Lasting Impacts of COVID-19:**\n   * The pandemic has already significantly accelerated the digitization rate due to the lockdowns and remote working environments. This is not a one-time catalyst, but rather a preview of what was going to happen in the future regardless; the pandemic situation has simply brought the future quicker. Going cloud or digitizing is not a temporary decision, this means the market has permanently expanded, and will continue to grow as demand increases.\n* **5G Penetration &amp; Advancements**\n   * Continuous developments in 5G technology will impact the SaaS industry in two ways:\n\n1. It will increase the accessibility of cloud-platforms and related services, thus increasing demand.\n2. It will improve the quality and range of capabilities for the products/services of software companies.\n\nIn the modern society, it seems like life is limited if you have bad Wi-Fi connection. That is emphasized in the world of SaaS. Broader bandwidth and connection qualities will incentivize potential customers to digitalise and help service providers create higher quality products.\n\n**Financials and Valuations**\n\nWhen it comes to the fair valuation of Amdocs Limited (DOX), I used both comparable companies and intrinsic valuations, then weighted the price outcomes for the final target price. Instead, I evaluated the company using a basic comparable analysis. The companies included in the comparable universe are Akamai Technologies Inc. (AKAM), Ciena Corporation (CIEN), Citrix Systems (CTXS), Cognizant Technology Solutions Corp. (CTSH), and Perspecta Inc. (PRSP). The DCF valuation is relative crude with simple margin and top-line forecasts, but the results seem very reasonable and in-line with street estimates.\n\n**Risks**\n\nTo finish off this analysis on DOX, there are a few key risks to keep in mind:\n\n* **Cyber Security**\n\nAlthough moving operations towards cloud or digital platforms will increase efficiency and limit costs, it does come with security risks. By nature of public, integrated, and/or connected cloud platforms or enterprise central systems, a large quantity of information can be easily accessed in one spot. Although that makes operations easier, it also increases the impact of hacks or other cyber security concerns. In these interconnected platforms, large amounts of information are at risks once the “first door” is opened. Hackers no longer need to crack multiple systems to acquire different information such as customer information and financials. If Amdocs gets hacked, it will likely be very detrimental to the company as large quantity of information will be exposed.\n\n* **Limited Innovation or Growth due to Lack of 5G or Internet Penetration**\n\nFor Amdocs and the entire SaaS industry, poor internet infrastructure will limit growth potential and market penetration. If 5G usage and general internet coverage does not match the rate of innovation of Amdocs, revenue growth will stall, which might impact the pricing of the stock. It will also limit the room for innovation and enhancement, which allows more time for competitors to grow within the current infrastructure and increase the competition.\n\n**In the End: Buy, Hold, or Sell?**\n\nOverall, I think Amdocs Limited (DOX) is currently undervalued. In general, the street has a buy or hold/buy valuation on the current price, which I do agree with. Therefore, my final thoughts on DOX are:\n\n* **Buy** for long-term value investment. The stock might be somewhat volatile in the short-term, but its long-term value will be consistent.\n* **Hold/Sell** if an investment return is already realized. The economy and overall market is kind of inflated as we recover from the pandemic, therefore a potential cash-out is definitely tangible as rumours of stock market crash spreads.\n\n**TLDR**\n\nAn undervalued technology solution and service provider in a growing market with $0 debt and an upside of at least 25%\n\nOriginal analysis can be found [here](https://info.utradea.com/idea/60997b509f45b0081495db90)",
        "subreddit": "StockMarket",
        "title": "$DOX - A Leader in Media &amp; Communication Digitization (Long DD)",
        "url": "https://www.reddit.com/r/StockMarket/comments/n9vrc2/dox_a_leader_in_media_communication_digitization/",
        "created": 1620764504.0
    },
    {
        "author": "utradea",
        "created_utc": 1620735565,
        "id": "n9vprl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nOf the many forces of society, the advancement of technology is one that is truly unstoppable. From how we obtain information to how people communicate from a distance, technology has changed the way people live their lives. The service providers of our everyday lives are consistently looking for ways to automate &amp; improve their offerings/operations. This created a market and demand for Amdocs Limited (Nasdaq: DOX), a technology and software product/service (such as consulting) provider that serves companies in communications, media, finance, entertainment, digital, etc.\n\n**Company Overview**\n\nEstablished in 1982 In Israel, Amdocs Limited is a multinational software company headquartered in Missouri, US. For 40 years, Amdocs has been offering advanced software products and related technology services to optimize their clients’ operations. With 26,000 employees, Amdocs is currently in business with 350 service providers in more than 80 countries. Their clientele comprised of leaders in a wide range of industries: telecom giants AT&amp;T &amp; Bell, financial institutions like HSBC, and general crowd favorites such as Amazon, 7Eleven, and Microsoft.\n\nMost of Amdocs’ offerings are provided within “amdocsONE”, a comprehensive collection of products/services consisting of: Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation. With its “cloud-native, modular and open offerings”, Amdocs helps clients smoothly and fully transition into tech-automated, digital operations.\n\nIn such a demanded market with high-ticket clients, Amdocs recorded $4.16B in revenue during FY2020 (ended September 30th, 2020), at a 33.9% Gross Margin, 19% EBITDA Margin, and 11.9% Net Profit Margin. DOX also has consistently growing Operating Cash Flow, recording $910.7M in the Last-Twelve-Months ending in December of 2020.\n\nYes, everything seems to be working out well for DOX, but that brings up the question: is there still room to grow, or has DOX plateaued, making it a safe bet, but not a high-return investment?\n\n**Capital Structure &amp; Shareholders Breakdown**\n\nA quick look at Amdocs’ capital structure: **22% Debt, 77.1% Common Equity, 0.9% Minority Interest.** What is important to point out here is that DOX has **recorded $0 in debt** for 3 straight years from FY2017-19. This is a very uncommon occurrence for a company to be 0% leveraged. In contrast, most of its competitors are operating around the 15%-25% debt/total capital ratio, comparable companies like Akamai Technologies recording \\~40% leverage in its capital structure. \n\nWhen it comes the shareholders of DOX, most of its outstanding shares are owned by institutional holders. Traditional portfolio managers such as asset manager firms are the biggest investors, with FMR LLC. as the largest holder. The large scale and consistent (holds &amp; buys) asset management investment shows street professionals see DOX as a profitable, stable investment.\n\n**Looking Long**\n\nOverall, I believe DOX shows potential at a hold/buy for long positions if you are looking to invest in an undervalued, but experienced &amp; matured company.  The following are three main theses behind a long investment in DOX:\n\n* **Strong &amp; Consistent Financial Performance:**\n\nAs an established company, we are seeing highly predictable topline growth rate with consistent profit margins. Although these no longer large-scale increases we would see on a growing tech company, DOX’s consistency and strong performance is definitely a supporting factor when it comes to investment. In more detail, DOX has a 2.9% top-line 5-year CAGR as of December 31st, 2020, with corresponding 3%, 3.6%, and 10.4% 5-year CAGR with EBITDA, EBIT, and Net Income, respectively. Although top-line growth was contracting a few years prior, it has rebounded between 2015-20, which could be contributed to the increasing number of companies transitioning into digital operations/cloud systems. Nevertheless, the higher (and increasing) bottom-line CAGRs means the company is still consistently increasing its profit margins (it is important to point out in that 5Y Net Income CAGR as of Dec.31st 2020 is significantly higher than previous years, which were around 2.2%-5.3%). DOX also has a strong cash flow, largely due to steady increases in operating cash flow. The OP cash flow is the best indicator here as unlevered free cash flow has seen some small-scale turbulence in recent years due to M&amp;As such as the acquisition of Openet Telecom, Juganu Ltd., and Veego during CY2020. Overall, DOX is a strong investment from the financial perspective due to its margin growth and consistency.\n\n* **Deep Product Portfolio with Wide Coverage**\n\nThrough “amdocsONE”, Amdocs is able to provide a full-suite of comprehensive products/services that covers every stage of digital transformation. From cutting 80% of time-to-market when utilizing Amdocs bundle offers, to continuous operational support and open tools/cloud platforms, clients receive a thorough service when working with Amdocs. Within the six main categories of offerings mention above (Digital Experience &amp; Monetization; Media &amp; Digital Services; Enterprise &amp; Connected Society; Open Cloud Networks &amp; NGOSS; Services &amp; Hybrid Operations; Technology &amp; Practices-Driven Innovation), there are numerous individual products that allows users to customize their usage of the Amdocs’ platform and offerings. For example, CES20 is Amdocs’ cloud-based customer experience suite. Within CES20, there are 4 products that helps automate and digitize the users’ operations: DigitalONE, CatalogONE, RevenueONE, and Service &amp; Network Automation. DigitalONE is a cloud-based system that allows users to work on their branding and customer experience. CatalogONE is an open-cloud platform catalog solution that allows users to launch new products easily with a detailed user interface. RevenueONE is a platform that allows users to scale or acquire new revenue stream while limiting the cost of acquisition. Last, Service &amp; network Automation is a branch covered by amdocsNEO. AmdocsNEO is a service &amp; network automation platform that offers a wide range of tracking and management capabilities. It is used to drive and control the fast automation process of the company. The CES20 is just an example of how Amdocs products are often interconnected and deeply comprehensive. They also offer certain platforms or products/services that are industry specific.\n\nThe wide coverage of the Amdocs offerings means they can gain market penetration across numerous industries. At the same time, the stage-specific offerings allow Amdocs to stay in demand and relevant as clients transition and grow. This plays a huge part into client retainment.\n\nLast, the continuous innovation initiatives at Amdocs supports an investment as it shows the company is consistently trying to grow and improve itself. As a tech company, it is extremely dangerous to slack-off on innovation, which is often seen with tech firms that reaches a consistent profit margin. Being in the tech industry means you live and die by the creativity and uniqueness of the offerings. Amdocs is consistently investing \\~20% of their gross profit into R&amp;D. This shows the company’s dedication to innovation, which ensures that it will remain in demand in the future.\n\n* **Extremely Low Leverage**\n\nThe last thesis is quite a short and simple one: the low leverage of the company means reduced risks and limits debt-related expenses such as interest/principal payments, which in turn increases their profitability. As mentioned above, there has be several years where the company literally at $0 in debt. During FY2020, the company took on \\~$1B worth of debt, which could mean they are preparing for large scale development as from a financial standpoint, they are not in a situation where taking the extra cash is worth the liability. With that being said, the new debt is only 22% of the company’s overall capital structure, and they will have no problem paying off the related fees as they have a strong track-record of positive cash flow.\n\n**Macro Market Trends**\n\nThe overall demand for digital/automation transformation/operations creates numerous trends that can positively impact the future of DOX. With the COVID-19 pandemic, company were pushed by the circumstances to digitize their operations, which will expand the market as well as create higher demand for the future. Here are some top trends that will impact DOX’s performance:\n\n* **Overall Growth of the SaaS Market:**  \n\n   * has been consistent growth in the past decade in the SaaS market. This is driven by multiple factors including the automation of internal control, enterprise centre processing system, as well as the boom of 5G and cloud-based services. Looking into the future, for the period of 2019-23, the worldwide SaaS market is expected to reach a $60.36B valuation, recording a 9% CAGR over that period.\n\n📷\n\n* **Lasting Impacts of COVID-19:**  \n\n   * The pandemic has already significantly accelerated the digitization rate due to the lockdowns and remote working environments. This is not a one-time catalyst, but rather a preview of what was going to happen in the future regardless; the pandemic situation has simply brought the future quicker. Going cloud or digitizing is not a temporary decision, this means the market has permanently expanded, and will continue to grow as demand increases.\n\n📷\n\n* **5G Penetration &amp; Advancements**  \n\n   * Continuous developments in 5G technology will impact the SaaS industry in two ways:\n\n1. It will increase the accessibility of cloud-platforms and related services, thus increasing demand.\n2. It will improve the quality and range of capabilities for the products/services of software companies.\n\n📷\n\nIn the modern society, it seems like life is limited if you have bad Wi-Fi connection. That is emphasized in the world of SaaS. Broader bandwidth and connection qualities will incentivize potential customers to digitalise and help service providers create higher quality products.\n\n**Financials and Valuations**\n\nWhen it comes to the fair valuation of Amdocs Limited (DOX), I used both comparable companies and intrinsic valuations, then weighted the price outcomes for the final target price. Instead, I evaluated the company using a basic comparable analysis. The companies included in the comparable universe are Akamai Technologies Inc. (AKAM), Ciena Corporation (CIEN), Citrix Systems (CTXS), Cognizant Technology Solutions Corp. (CTSH), and Perspecta Inc. (PRSP). The DCF valuation is relative crude with simple margin and top-line forecasts, but the results seem very reasonable and in-line with street estimates.\n\n**Risks**\n\nTo finish off this analysis on DOX, there are a few key risks to keep in mind:\n\n* **Cyber Security**\n\nAlthough moving operations towards cloud or digital platforms will increase efficiency and limit costs, it does come with security risks. By nature of public, integrated, and/or connected cloud platforms or enterprise central systems, a large quantity of information can be easily accessed in one spot. Although that makes operations easier, it also increases the impact of hacks or other cyber security concerns. In these interconnected platforms, large amounts of information are at risks once the “first door” is opened. Hackers no longer need to crack multiple systems to acquire different information such as customer information and financials. If Amdocs gets hacked, it will likely be very detrimental to the company as large quantity of information will be exposed.\n\n* **Limited Innovation or Growth due to Lack of 5G or Internet Penetration**\n\nFor Amdocs and the entire SaaS industry, poor internet infrastructure will limit growth potential and market penetration. If 5G usage and general internet coverage does not match the rate of innovation of Amdocs, revenue growth will stall, which might impact the pricing of the stock. It will also limit the room for innovation and enhancement, which allows more time for competitors to grow within the current infrastructure and increase the competition.\n\n**In the End: Buy, Hold, or Sell?**\n\nOverall, I think Amdocs Limited (DOX) is currently undervalued. In general, the street has a buy or hold/buy valuation on the current price, which I do agree with. Therefore, my final thoughts on DOX are:\n\n* **Buy** for long-term value investment. The stock might be somewhat volatile in the short-term, but its long-term value will be consistent.\n* **Hold/Sell** if an investment return is already realized. The economy and overall market is kind of inflated as we recover from the pandemic, therefore a potential cash-out is definitely tangible as rumours of stock market crash spreads.\n\n**TLDR**\n\nAn undervalued technology solution and service provider in a growing market with $0 debt and an upside of at least 25%\n\nOriginal analysis can be found [here](https://info.utradea.com/idea/60997b509f45b0081495db90)",
        "subreddit": "wallstreetbets",
        "title": "$DOX - A Leader in Media &amp; Communication Digitization (Long DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9vprl/dox_a_leader_in_media_communication_digitization/",
        "created": 1620764365.0
    }
]