[
    {
        "author": "SubjectDiscipline",
        "created_utc": 1616972468,
        "id": "mfc86c",
        "num_comments": 651,
        "num_crossposts": 0,
        "selftext": "*NOTE: NOTHING IN THIS POST IS FINANCIAL ADVICE*\n\n**TLDR:**\n\nAmyris ($AMRS) is a synthetic biotechnology company that engineers, manufactures, and sells sustainably created ingredients and products. $AMRS’s proprietary technology has a near-endless number of applications and a staggering total addressable market potentially in the trillions of dollars. After a decade of heavily investing in R&amp;D to advance their platform, both the company’s technology and business model recently turned the corner, laying the foundation for incredible value creation over near and long-term horizons. ***Within the next three trading days,*** ***$AMRS will announce the completion of two strategic transactions worth more than $500 million, sending the stock to the fucking moon.*** This is a deep value play, but for all you short squeeze junkies, $AMRS does happen to have relatively significant short interest at 16% of the float. I expect that the jump in price from $AMRS’s upcoming transaction announcements to dump gasoline onto a raging fire, sending the shorts to an early grave while raining tendies from the sky for the longs\n\n***The play – buying shares of the $AMRS stock or April 16 calls with strikes above $20*** \n\n**MY POSITIONS:**\n\nI believe in this company over both long and short time horizons. See below for current positions. \n\n[Positions](https://preview.redd.it/b7u4okrgfup61.png?width=859&amp;format=png&amp;auto=webp&amp;s=7d13644c0e3bae68378c1e440dc6fdcaaf5f412e)\n\n**BACKGROUND:**\n\nI was a relatively early investor in $ENPH, and after the success of that investment (sub $2 share price in 2018, now trading above $150 a share), I was looking to invest in a company with a similarly checkered past with a catalyst to turn the corner quickly. As with $ENPH, the company needed to have invaluable technology with the potential for huge near-term gains to compensate for the risk. I couldn’t have been more elated discovering $AMRS, which checked all the boxes. $AMRS has performed well this year so far, but we are light-years away from the company’s potential both over the short and long term\n\n**$AMRS BUSINESS:**\n\nThis business is complicated, but I’ll do my best to summarize some key points. Founded by a group of Berkley scientists, $AMRS is a synthetic biotechnology company that engineers, manufactures, and sells sustainably created ingredients and products into several markets, including Health &amp; Wellness, Clean Beauty, and Flavor &amp; Fragrance. Within Health &amp; Wellness, $AMRS focuses on alternative sweeteners, vitamins, and food ingredients. In Flavor &amp; Fragrance, $AMRS produces natural oils and aroma chemicals for a range of applications. In Clean Beauty, $AMRS focuses on clean skincare and cosmetic ingredients. For all you tree huggers, their production and products are totally sustainable, and by creating otherwise naturally occurring molecules in the lab, $AMRS saves the destruction of animals and other natural resources (as an example, they produce a skin-care molecule called squalene that otherwise requires killing sharks to get it)\n\n$AMRS generates revenue from a combination of a partnership model and a wholly-owned direct model\n\nIn the partnership model, $AMRS creates a molecule/ingredient in the lab and scales it on a commercial level on behalf of a partner, who then uses the molecule/ingredient in one of its products, which the partner markets and sells to its own customers. $AMRS captures revenues from producing and selling the molecule/ingredient to the partner + $AMRS receives royalties from the partner’s product sales that contain the ingredient created by $AMRS. $AMRS has many commercial, industrial level partners including Firmenich, Givaudan, DSM, Yifan, the US Department of Energy, and DARPA. On the retail side, $AMRS has recently announced partnerships to create new brands such as [JVN](https://investors.amyris.com/2021-01-11-Amyris-Creates-Partnership-With-Jonathan-Van-Ness-To-Launch-Leading-Clean-Haircare-Brand) (Johnathan Van Ness clean haircare brand launching Summer 2021), [Rose Inc](https://investors.amyris.com/2020-10-30-Amyris-And-Rosie-Huntington-Whiteley-Announce-Creation-Of-New-Clean-Beauty-Brand-And-Business-Partnership) (Rosie Huntington-Whiteley high-end cosmetics brand launching 3Q 2021), and most recently, they announced a partnership with [Minerva](https://investors.amyris.com/2021-03-16-Amyris-Enters-Partnership-With-Minerva-Foods-For-Zero-Carbon-Protein-Production) (focusing on zero carbon protein production)\n\nIn the wholly-owned direct model, $AMRS sells its developed ingredients through brands that $AMRS currently owns, including [Biossance](https://biossance.com/) (high-end skincare), [Pipette](https://pipettebaby.com/) (skincare for babies), [Purecane](https://purecane.com/) (synthetic sugar similar to Splenda) as well as brands it has recently acquired, such as [Teresana](https://investors.amyris.com/2021-01-22-Amyris-Acquiring-Terasana-Brand-To-Offer-Clean-Cannabinoid-Consumer-Products) (sustainably sourced cannabinoids launching Q2 2021), and [Costa Brazil](https://investors.amyris.com/2021-03-01-Amyris-Acquiring-Costa-Brazil-Clean-Beauty-Brand-Francisco-Costa-To-Join-Amyris-As-Chief-Creative-Officer) (clean luxury skincare acquired in Q1 2021). Separately, the company has also recently [made headway using its technology in the production of RNA for use in MRNA vaccines](https://investors.amyris.com/2021-02-22-Amyris-Announces-Positive-Pre-Clinical-Results-For-COVID-19-RNA-Vaccine-Platform-With-Advantaged-Manufacturing-Storage-And-Distribution-Characteristics), though this is in its early stages\n\n$AMRS’s consumer brands are distributed through many high-profile channels, including Amazon, Target, Walmart, and Sephora in addition to their own direct-to-consumer websites. **It is no surprise that they have demonstrated ridiculous revenue growth of 197% in 2020 alone**\n\n[4Q 2020 Earnings Investor Presentation](https://preview.redd.it/0i2sigct5up61.png?width=1693&amp;format=png&amp;auto=webp&amp;s=f5adddb33f2fba374819bb1a7978567d539de69d)\n\n[4Q 2020 Earnings Investor Presentation](https://preview.redd.it/elg9yw6i7up61.png?width=1723&amp;format=png&amp;auto=webp&amp;s=c6aa48fdd57967c48d2474a2db7975fde4f63e98)\n\n**NOTABLE RECENT INVESTORS:**\n\nNo doubt, $AMRS’s progress has captured the attention of some incredibly famous investors, the most notable being the billionaire venture capitalist John Doerr, whose current portfolio of investments includes Alphabet/Google (where his investment is worth over $2.2 billion alone), DoorDash, Bloom Energy, Quantamscape, and of course, Amyris ($AMRS), where his investment is worth about $70,000,000. Doerr currently serves on the Board of Directors at Google and $AMRS and previously served on the board of Amazon\n\n[John Doerr Ownership \\/ Other Investments](https://preview.redd.it/zq3bts856up61.png?width=527&amp;format=png&amp;auto=webp&amp;s=21ac19937f3e728e1761e8b26a513ce6b35f0138)\n\n**SHORT INTEREST:**\n\nAs shown in the below ownership statistics, over 16% of $AMRS’s tradable float is sold short, which amounts to approximately 21.7 million shares as of 3/26/2021. With a 90-day average daily trading volume of just 4.9 million shares and just 2.3 million shares traded last Friday (3/26), I suspect that when the company delivers on its upcoming transactions this week, trading volumes will increase from intense buying. A rising share price will put tremendous pressure on short sellers to cover their positions, leading to a classic short squeeze and an increased pop in the stock\n\n[Source: FactSet](https://preview.redd.it/zaj7ak6l6up61.png?width=341&amp;format=png&amp;auto=webp&amp;s=ee15407674b13c2d45207fde230d9654f18f54ff)\n\n**UPCOMING TRANSACTION ANNOUNCEMENTS / NEAR-TERM CATALYSTS:**\n\nBeginning last November, $AMRS began discussing a series of three upcoming strategic transactions that have truly changed the game for the company. Each transaction is different, but effectively involve the monetization of a molecule/ingredient whereby a partner pays $AMRS a significant upfront cash payment as well as licensing fees / royalties over a multi-year period. **The significance of these transactions cannot be understated as they provide cash to the business while creating recurring revenue streams. In effect, these deals allow $AMRS to self-fund its business without diluting existing investors from new equity offerings or extremely expensive debt. This is what the market has been craving**\n\nThe first of the three closed last December with a transaction value of just [$50 million](https://investors.amyris.com/2020-12-21-Amyris-Closes-50-Million-Strategic-Transaction) and the stock has flying ever since, gaining over 200% so far this year. **The remaining two transactions are set to close within the next three days with an expected total value of over $500 million for JUST ONE OF THE TWO TRANSACTIONS**\n\nHere is the CEO on the 4Q 2020 earnings call dated March 3, 2021:\n\n[4Q 2020 Earnings Transcript, dated March 2, 2021](https://preview.redd.it/w4mhtjjv6up61.png?width=1259&amp;format=png&amp;auto=webp&amp;s=0be49c2e03f7fb240f5b05c77cdc79574078d6ba)\n\nThe CEO re-affirmed that the transactions will close prior to the end of the first quarter several times thereafter, including an industry conferences on 3/4 (Cowen) and 3/15 (Roth) [as well as quietly in the last sentence of an unrelated press release on 3/25](https://investors.amyris.com/2021-03-25-Amyris-Delivers-Record-Production-Of-CBG-For-Consumer-Skincare-Formulations)\n\nTo those that would argue it is already priced in - you are wrong for several reasons. First, this company has almost no intuitional coverage and is paid very little attention relative to more established biotechnology companies. Said differently, the institutions that really set valuation and move the stock don't care enough yet to pay attention. But they will. $AMRS's investor base only continues to expand as more people wake up to it's incredible potential. Second, prior to the recent turnaround, the company overpromised a few times, just as companies that later mooned like $ENPH did. It happens, particularly with early stage companies. So even in the \"efficient market\" fantasy world, the company's public disclosures would have a credibility discount, leaving substantial upside for investors today when the company inevitably delivers\n\n**CONCLUSION:**\n\nThese strategic transactions will announce by no later than Thursday morning (4/1), and $AMRS will be off to the fucking races. For some context, the suits at HC Wainwright and Roth Capital Partners currently have price targets of $33 and $35. I like the stock, and I think it is worth even more\n\n***The play: $AMRS shares + April 16 calls with strikes $20 and above***\n\nGood luck and godspeed",
        "subreddit": "wallstreetbets",
        "title": "[$AMRS] 🚀 🌕 THE ULTIMATE DD 🚀 🌕 DEEP LONG-TERM VALUE WITH MASSIVE NEAR-TERM CATALYSTS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mfc86c/amrs_the_ultimate_dd_deep_longterm_value_with/",
        "created": 1617001268.0
    },
    {
        "author": "reggieoninvesting",
        "created_utc": 1617224710,
        "id": "mhfqc0",
        "num_comments": 220,
        "num_crossposts": 0,
        "selftext": "Long post but easily readable. TLDR at the bottom. \n\nAs of right now, Biden is speaking about the huge infrastructure plan. This plan is spread out over 8 years and will be paid for in new tax hikes. The tax plan is expected to raise the corporate tax rate from 21 percent to 28 percent, end federal subsidies for fossil fuel companies and increase the global minimum tax paid from about 13 percent to 21 percent, as well as other measures aimed at taxing corporations that shelter profits offshore to avoid taxes. \n\nMore details about this plan are here: [https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/)\n\n&amp;#x200B;\n\n* $650B to rebuild the country’s infrastructure, such as its roads, bridges, highways and ports\n   * U.S. Stocks:  \n      * ROAD (Construction partners) - engineering and construction industry - engages in the construction and maintenance of highways, roads, bridges, airports, and commercial and residential developments. across Alabama, Florida, Georgia, North Carolina, and South Carolina.\n      * VMC (Vulcan materials),\n      * NUE (Nucor) - sells steel and steel products\n      * CLF (Cleveland cliffs) - steel industry - Iron ore mining company based in the US - three ore mines - one in Michigan, and two in Minnesota,\n      * CMCO - (Columbus Mckinnon corp) - trucks/construction/farm machinery industry -\n   * ETFs:  \n      * PAVE - US Infrastructure ETF - no utility companies\n      * IFRA - US Infrastructure ETF with 20 electric utility companies and four water companies.\n\n&amp;#x200B;\n\n* $400B toward home care for the elderly and the disabled - A few senior living facilities were hit with COVID and unfortunately took the lives of many of these elderly. I'm not too sure on the outlook of senior living in the short term due to COVID. I'm sure families are hesitant about putting their elderly ones in assisted living facilities in the short term.\n   * Stocks:  \n      * CSU (Capital senior living)\n      * WELL (Welltower inc)\n      * VTR (Ventas inc)\n      * BKD (Brookdale senior living)\n      * FVE (Five star senior living)\n      * CTRE (CareTrust REIT) - 72% skill nursing facilities, 18% assisted and independent living facilities, 9% campuses (SNF + ALF)\n\n&amp;#x200B;\n\n* $300B for housing infrastructure\n   * Stocks:  \n      * DHI (D.R. Horton) - largest US homebuilder (58,434 closings in 2019)\n      * LEN (Lennar corp) - 2nd largest homebuilder (51,491 closing in 2019)\n      * PHM (Pulte group) - 3rd largest homebuilder (23,232 closings in 2019)\n      * NVR (NVR inc) - 4th (19,668 closings in 2019)\n      * KBH (KB home) - 5th (11,871 closings in 2019)\n\n&amp;#x200B;\n\n* $300B to revive U.S. manufacturing\n   * ETFS: XLI, BOTZ\n   * CPSH (CPS technologies) - provide materials for transportation, automotive, energy, computing/internet, telecommunication, aerospace, defense, and oil and gas markets\n   * ABB - (ABB) - Swedish company that provides robotics and automation technologies in manufacturing industry\n   * ROK (Rockwell automation) - provider of industrial automation\n   * FANUY (Fanuc) - Japanese automation company\n\n&amp;#x200B;\n\n* $180B to research and development\n* $100s of billions of dollars to bolster the\n   * Nation’s electric grid (stocks listed under clean energy),\n   * High-speed broadband, and  \n      * ARKX\n      * T, CMCSA, VZ, TMUS\n      * IRDM (Iridium communications) - 66 active satellites used for worldwide voice and data communication from hand-held satellite phones and other transceiver units.\n      * VSAT (ViaSat) - 4 satellites providing of high-speed satellite broadband services and secure networking systems covering military and commercial markets\n   * Water systems to ensure clean drinking water  \n      * ETFS: FIW, PHO\n      * AWT (American water works) - public utility company\n      * PNR (Pentair) - water treatment company based in UK, main office in US in Minnesota\n      * WMS (Advanced drainage systems) - provider of draining products\n\n&amp;#x200B;\n\n* $100B towards workforce development and job retraining\n* $400B in clean-energy credits\n   * Electric Vehicles: TSLA, NIO, XPEV, LI, Luc1d, GM, F, all other legacy autos EVs\n   * Chargers: BEEM, PLUG, CHPT, BLNK\n   * Solar: SEDG, ENPH, FSLR, SPWR, NEE\n   * Cell producers: PLUG and more stocks I can't list, check the spreadsheet below\n   * Energy storage: stocks I can't list here sorry check the spreadsheet below\n   * Natural resources:  MP, UUUU\n\nIMO, the rare earth elements (REE) space is going to grow at a fast past over the next few years and decades. If you don't know what REE is, it's a group of 17 metals (lanthanum, cerium, praseodymium, neodymium, promethium, samarium, europium, gadolinium, terbium, dysprosium, holmium, erbium, thulium, ytterbium, lutetium, scandium, yttrium) that appear in low concentrations in the ground. The popular ones used in mainstream commodities (such as electric vehicles, batteries, and energy storage) are lithium, graphite, cobalt, nickel, and copper.\n\nThere was a Global Metals &amp; Mining Live Virtual Investor Conference yesterday and today that saw several companies pitch their companies and talked about what they do and the how the mining business will see a lot of growth for the next several years.\n\nThere's two US based companies that I would recommend and that's MP Materials, ticker symbol, MP and Energy fuels, UUUU. The reason mining rare earth metals is so important for the US is because we have to become independent from other countries to mine, specifically China. China supplied 80% of the rare earth metals to the US from 2014 to 2017 and they supply 75% of the rare earth materials to manufacturers. There is only one US based rare earth mine and that's California's mountain pass mine. Guess who owns it? MP Materials. \n\nI made a spreadsheet list of stocks and ETFs that may see some benefit from this plan. Tabs on the bottom so its divided by each category.\n\n[https://docs.google.com/spreadsheets/d/1AmtSD9Bcg\\_BwcdOxSwR\\_li5uL3Omfa1SAFlcAMa7KJQ/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1AmtSD9Bcg_BwcdOxSwR_li5uL3Omfa1SAFlcAMa7KJQ/edit?usp=sharing)\n\nIf you're still reading here, thanks for taking the time to read this. If you have any suggestions for stocks that will benefit, discuss here!\n\n&amp;#x200B;\n\nTLDR: Long TSLA, MP, LIT, ARKX, clean energy stocks. Do your own research.",
        "subreddit": "stocks",
        "title": "Biden's Infrastructure plan and who benefits?",
        "url": "https://www.reddit.com/r/stocks/comments/mhfqc0/bidens_infrastructure_plan_and_who_benefits/",
        "created": 1617253510.0
    },
    {
        "author": "reggieoninvesting",
        "created_utc": 1617226269,
        "id": "mhg9pi",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "Long post but easily readable. TLDR at the bottom.\n\nBiden just spoke about the huge infrastructure plan. This plan is spread out over 8 years and will be paid for in new tax hikes. The tax plan is expected to raise the corporate tax rate from 21 percent to 28 percent, end federal subsidies for fossil fuel companies and increase the global minimum tax paid from about 13 percent to 21 percent, as well as other measures aimed at taxing corporations that shelter profits offshore to avoid taxes. This infrastructure plan is just a proposal! I think they will vote on it sometime in August/September AFAIK. \n\nMore details about this plan are here: [https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/)\n\n&amp;#x200B;\n\n* $650B to rebuild the country’s infrastructure, such as its roads, bridges, highways and ports\n   * U.S. Stocks:\n      * ROAD (Construction partners) - engineering and construction industry - engages in the construction and maintenance of highways, roads, bridges, airports, and commercial and residential developments. across Alabama, Florida, Georgia, North Carolina, and South Carolina.\n      * VMC (Vulcan materials),\n      * NUE (Nucor) - sells steel and steel products\n      * CLF (Cleveland cliffs) - steel industry - Iron ore mining company based in the US - three ore mines - one in Michigan, and two in Minnesota,\n      * CMCO - (Columbus Mckinnon corp) - trucks/construction/farm machinery industry -\n   * ETFs:\n      * PAVE - US Infrastructure ETF - no utility companies\n      * IFRA - US Infrastructure ETF with 20 electric utility companies and four water companies.\n\n&amp;#x200B;\n\n* $400B toward home care for the elderly and the disabled - A few senior living facilities were hit with COVID and unfortunately took the lives of many of these elderly. I'm not too sure on the outlook of senior living in the short term due to COVID. I'm sure families are hesitant about putting their elderly ones in assisted living facilities in the short term.\n   * Stocks:\n      * CSU (Capital senior living)\n      * WELL (Welltower inc)\n      * VTR (Ventas inc)\n      * BKD (Brookdale senior living)\n      * FVE (Five star senior living)\n      * CTRE (CareTrust REIT) - 72% skill nursing facilities, 18% assisted and independent living facilities, 9% campuses (SNF + ALF)\n\n&amp;#x200B;\n\n* $300B for housing infrastructure\n   * Stocks:\n      * DHI (D.R. Horton) - largest US homebuilder (58,434 closings in 2019)\n      * LEN (Lennar corp) - 2nd largest homebuilder (51,491 closing in 2019)\n      * PHM (Pulte group) - 3rd largest homebuilder (23,232 closings in 2019)\n      * NVR (NVR inc) - 4th (19,668 closings in 2019)\n      * KBH (KB home) - 5th (11,871 closings in 2019)\n\n&amp;#x200B;\n\n* $300B to revive U.S. manufacturing\n   * ETFS: XLI, BOTZ\n   * CPSH (CPS technologies) - provide materials for transportation, automotive, energy, computing/internet, telecommunication, aerospace, defense, and oil and gas markets\n   * ABB - (ABB) - Swedish company that provides robotics and automation technologies in manufacturing industry\n   * ROK (Rockwell automation) - provider of industrial automation\n   * FANUY (Fanuc) - Japanese automation company\n\n&amp;#x200B;\n\n* $180B to research and development\n* $100s of billions of dollars to bolster the\n   * Nation’s electric grid (stocks listed under clean energy),\n   * High-speed broadband, and\n      * ARKX\n      * T, CMCSA, VZ, TMUS\n      * IRDM (Iridium communications) - 66 active satellites used for worldwide voice and data communication from hand-held satellite phones and other transceiver units.\n      * VSAT (ViaSat) - 4 satellites providing of high-speed satellite broadband services and secure networking systems covering military and commercial markets\n   * Water systems to ensure clean drinking water\n      * ETFS: FIW, PHO\n      * AWT (American water works) - public utility company\n      * PNR (Pentair) - water treatment company based in UK, main office in US in Minnesota\n      * WMS (Advanced drainage systems) - provider of draining products\n\n&amp;#x200B;\n\n* $100B towards workforce development and job retraining\n* $400B in clean-energy credits\n   * Electric Vehicles: TSLA, NIO, XPEV, LI, Luc1d, GM, F, all other legacy autos EVs\n   * Chargers: BEEM, PLUG, CHPT, BLNK\n   * Solar: SEDG, ENPH, FSLR, SPWR, NEE\n   * Cell producers: PLUG and more stocks I can't list, check the spreadsheet below\n   * Energy storage: stocks I can't list here sorry check the spreadsheet below\n   * Natural resources:  MP, UUUU\n\nIMO, the rare earth elements (REE) space is going to grow at a fast past over the next few years and decades. If you don't know what REE is, it's a group of 17 metals (lanthanum, cerium, praseodymium, neodymium, promethium, samarium, europium, gadolinium, terbium, dysprosium, holmium, erbium, thulium, ytterbium, lutetium, scandium, yttrium) that appear in low concentrations in the ground. The popular ones used in mainstream commodities (such as electric vehicles, batteries, and energy storage) are lithium, graphite, cobalt, nickel, and copper.\n\nThere was a Global Metals &amp; Mining Live Virtual Investor Conference yesterday and today that saw several companies pitch their companies and talked about what they do and the how the mining business will see a lot of growth for the next several years.\n\nThere's two US based companies that I would recommend and that's MP Materials, ticker symbol, MP and Energy fuels, UUUU. The reason mining rare earth metals is so important for the US is because we have to become independent from other countries to mine, specifically China. China supplied 80% of the rare earth metals to the US from 2014 to 2017 and they supply 75% of the rare earth materials to manufacturers. There is only one US based rare earth mine and that's California's mountain pass mine. Guess who owns it? MP Materials.\n\nI made a spreadsheet list of stocks and ETFs that may see some benefit from this plan. Tabs on the bottom so its divided by each category.\n\n[https://docs.google.com/spreadsheets/d/1AmtSD9Bcg\\_BwcdOxSwR\\_li5uL3Omfa1SAFlcAMa7KJQ/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1AmtSD9Bcg_BwcdOxSwR_li5uL3Omfa1SAFlcAMa7KJQ/edit?usp=sharing)\n\nIf you're still reading here, thanks for taking the time to read this. If you have any suggestions for stocks that will benefit, discuss here!\n\nTLDR: Long TSLA, MP, LIT, ARKX (&lt;1% for now, I'm not that crazy lol), clean energy stocks. Do your own research :)",
        "subreddit": "investing",
        "title": "The Biden Infrastructure Plan and Stocks That Will Benefit",
        "url": "https://www.reddit.com/r/investing/comments/mhg9pi/the_biden_infrastructure_plan_and_stocks_that/",
        "created": 1617255069.0
    },
    {
        "author": "radarbot",
        "created_utc": 1614776397,
        "id": "lwtaxn",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "I like ENPH and NIO, but I think I made the more cardinal mistake in stock trading by FOMO-ing into a stock without considering good valuation. I bought ENPH and NIO near their ATH's in January. Both are down significantly since then, and I'm bagholding about 20-30% losses on both.\n\nI'm looking for some advice on what are some good ways to proceed.\n\nOne strategy I have is just to not look at my portfolio and hold for a year and see where it goes. Parts of me thinks that may be the best strategy, but its also incredible passive and if I wanted to do that I should have just bought QCLN and ICLN instead of NIO and ENPH respectively.\n\nAnother strategy is to sell covered calls (i have at least 100 shares in each) to recoup my costs in both. Since they're down about 25% on average, it feels like \"picking up pennies in front of a steam roller\", but a part of me feels like this is good penance for my recklessness. It'll teach me better for my next move.\n\nThe last strategy is just to cut my losses and move the money over to something that can recover that 25% faster than NIO and ENPH.\n\nThere is a fourth strategy, which is to free up cash and average down so my cost average isn't so high. I'm not a fan of this strategy as it'll make my portfolio overweight in two stocks that already are emotional plays.\n\nJust looking for some \"community wisdom\" on strategies here to mitigate my risk and leverage assets that I currently have.\n\nPositions:\n\n**ENPH:**\n\n* Purchase price: 214\n\n* Current price: 175\n\n* Shares: 46\n\n**NIO:**\n\n* Purchase price: 64\n\n* Current price: 44\n\n* Shares: 200",
        "subreddit": "stocks",
        "title": "Looking for advice on ENPH and NIO \"bag holding\"",
        "url": "https://www.reddit.com/r/stocks/comments/lwtaxn/looking_for_advice_on_enph_and_nio_bag_holding/",
        "created": 1614805197.0
    },
    {
        "author": "allthespreadsheets",
        "created_utc": 1615793452,
        "id": "m5fbn1",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I was inspired by u/pmalhotra96's [post last week](https://www.reddit.com/r/ValueInvesting/comments/m20li6/python_script_for_a_quick_dcf_analysis/) with his script to automatically calculate a DCF valuation and spent the majority of my weekend making a more juiced up version of it. \n\nBasic notes:\n\n* Pulls recent financial metrics from [Financial Modeling Prep](https://financialmodelingprep.com/developer/docs/)\n* Calculate future growth rates, operating margins given the earnings estimates data from FMP (you'll probably need a paid plan to run the script - this data is for Premium subscribers only)\n* Calculate DCFs, using the exact same formula from [Prof. Damodaran's valuation spreadsheets](http://www.stern.nyu.edu/~adamodar/pc/fcffsimpleginzu.xlsx) \\- the output is actually formatted exactly in the same way so you can see the inputs that went into the DCF value.\n   * It calculates the cost / capital, given the company's debt ratios\n      * Note: I use the country of incorporation method to calculate the ERP, given there's no easy way to get revenue breakdowns by region programmatically\n   * It projects the growth rates, operating margins for the next n years, taking into account the earnings estimates data and industry margins \n   * It then calculates out all the future revenues, operating incomes, after-tax operating income, reinvestment, FCF, etc for the next n years\n   * And of course, discounts those FCFs back to the present value for those FCFs \n   * Possible customizations are slim right now - you can customize the number of years you want to run the DCF for, but am planning on adding more (details below)\n\n[Here's the script](https://github.com/stephszeto/stocks/blob/main/valuation.py) if you'd like to take a look / tinker with it yourself. \n\n* Additional note #1: you'll also need [the corresponding erp.csv file](https://github.com/stephszeto/stocks/blob/main/erp.csv) to run this successfully, which is where I pull my ERP data from \n* Additional note #2: I assume the API key is stored in [a separate file called configs.py](https://github.com/stephszeto/stocks/blob/main/configs.py) that would look like this, but you can also update it to paste your API key in directly\n\nThings you can do with it:\n\n* Calculate DCF for a specific company \n\n&amp;#8203;\n\n    &gt; python3 valuation.py -t NFLX\n\n[Sample output here.](https://gist.github.com/stephszeto/f3ec4f61bbaf91ca65596121dc2b162a) \n\n* Calculate DCF for a list of companies \n\n&amp;#8203;\n\n    python3 valuation.py -l AMZN GOOG MSFT\n\n[Sample output here.](https://gist.github.com/stephszeto/003e492b5cf1a6bb928fbea5abcc2072) \n\n* Calculate DCF for a company and all the companies in its industry \n\n&amp;#8203;\n\n    python3 valuation.py -t ENPH -i\n\n[Sample output here.](https://gist.github.com/stephszeto/2edd4f85e4326014aebb11e9d0f35fc2) \n\nPotential future roadmap:\n\n* Making it possible to customize DCF inputs (custom growth rates, operating margins, using high / low estimates instead of just average, years to convergence, dynamic cost / capital or sales / capital)\n* Scenario / sensitivity analysis to get a range of DCF values given multiple possible parameters",
        "subreddit": "ValueInvesting",
        "title": "In-Depth DCF Valuation Python Script",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/m5fbn1/indepth_dcf_valuation_python_script/",
        "created": 1615822252.0
    },
    {
        "author": "Traditional_Fee_8828",
        "created_utc": 1617139684,
        "id": "mgqhac",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "ICLN recently published their holdings as of March 29th, and I haven't seen any posts addressing it, nor have I seen a post give the details of what's changed. Below is a table of the holdings before vs now. I've sorted it by their weight before, so you can see how the heavier stocks have shifted. There were cases where they gave 2 seperate columns for the same symbol, but I decided to keep them seperate for simplicity. Some notable changes:\n\n\\- iShares bought 200k more shares of PLUG \n\n\\- 65 million shares of ELP were bought\n\n\\- ICLN now holds €17 million in cash\n\n\\- 1.7 billion KRW was sold(Worth approx €12k)\n\n\\- The only position which was reduced was $NEOEN\n\n&amp;#x200B;\n\n|Ticker|Name|Shares Before|Shares|Market Value Before:|Market Value Now:|Weight Before(%):|Weight Now(%):|\n\n:--|:--|--:|--:|--:|--:|--:|--:|\n\n|PLUG|PLUG POWER INC|11,315,434.00|11,540,253.00|547,440,696.92|355,208,987.34|9.44|6.92|\n\n|ENPH|ENPHASE ENERGY INC|1,912,663.00|1,953,196.00|336,743,447.78|277,627,279.44|5.81|5.41|\n\n|DQ|DAQO NEW ENERGY ADR REPRESENTING|3,020,171.00|3,084,361.00|314,852,826.75|191,723,879.76|5.43|3.73|\n\n|VER|VERBUND AG|3,662,522.00|3,734,300.00|280,959,973.67|268,842,040.87|4.84|5.24|\n\n|SGRE|SIEMENS GAMESA RENEWABLE ENERGY SA|7,030,394.00|7,180,751.00|262,831,560.91|249,780,050.30|4.53|4.87|\n\n|968|XINYI SOLAR HOLDINGS LTD|120,710,000.00|123,306,000.00|253,639,838.35|200,840,640.20|4.37|3.91|\n\n|MEL|MERIDIAN ENERGY LTD|59,511,450.00|60,133,448.00|246,643,419.18|219,395,699.40|4.25|4.27|\n\n|ORSTED|ORSTED|1,413,608.00|1,439,919.00|230,284,559.72|230,731,428.87|3.97|4.49|\n\n|ORA|ORMAT TECH INC|2,612,813.00|2,690,071.00|223,839,689.71|202,078,133.52|3.86|3.94|\n\n|VWS|VESTAS WIND SYSTEMS|1,188,876.00|1,214,384.00|224,045,271.09|233,779,197.06|3.86|4.55|\n\n|EDPR|EDP RENOVAVEIS SA|9,802,487.00|10,062,920.00|215,358,482.84|205,972,777.39|3.71|4.01|\n\n|CEN|CONTACT ENERGY LTD|43,073,956.00|43,524,122.00|214,222,462.11|208,913,261.20|3.69|4.07|\n\n|FSLR|FIRST SOLAR INC|2,620,041.00|2,676,220.00|212,275,721.82|218,406,314.20|3.66|4.25|\n\n|SEDG|SOLAREDGE TECHNOLOGIES INC|675,810.00|690,300.00|201,600,881.10|179,505,612.00|3.48|3.5|\n\n|BLX|BORALEX INC CLASS A|5,535,299.00|5,649,178.00|193,604,296.78|177,372,233.03|3.34|3.46|\n\n|SCATC|SCATEC SOLAR|6,530,433.00|6,638,798.00|190,331,941.83|189,703,209.81|3.28|3.7|\n\n|RUN|SUNRUN INC|2,642,204.00|2,695,103.00|165,349,126.32|139,902,796.73|2.85|2.73|\n\n|INE|INNERGEX RENEWABLE ENERGY INC|8,052,675.00|8,282,461.00|153,166,203.79|143,517,575.57|2.64|2.8|\n\n|NOVA|SUNNOVA ENERGY INTERNATIONAL INC|3,187,950.00|3,267,752.00|142,947,678.00|106,169,262.48|2.46|2.07|\n\n|AY|ATLANTICA SUSTAINABLE INFRASTRUCTU|3,894,440.00|3,984,873.00|140,784,006.00|133,971,430.26|2.43|2.61|\n\n|NEOEN|NEOEN SA|2,349,028.00|1,984,296.00|138,000,509.02|88,817,322.11|2.38|1.73|\n\n|ECV|ENCAVIS AG|6,278,696.00|6,424,816.00|133,673,764.33|117,902,183.90|2.3|2.3|\n\n|CSIQ|CANADIAN SOLAR INC|2,801,810.00|2,857,905.00|131,488,943.30|128,834,357.40|2.27|2.51|\n\n|CIG|COMPANHIA ENERGETICA MINAS GERAIS|58,833,125.00|58,833,125.00|124,137,893.75|128,844,543.75|2.14|2.51|\n\n|336260|DOOSAN FUEL CELL LTD|2,466,669.00|2,516,342.00|109,776,101.47|114,970,510.72|1.89|2.24|\n\n|SLR|SOLARIA ENERGIA Y MEDIO AMBIENTE S|4,853,236.00|4,986,597.00|109,569,956.14|101,598,832.16|1.89|1.98|\n\n|REGI|RENEWABLE ENERGY INC|1,272,181.00|1,272,181.00|98,937,516.37|76,737,957.92|1.71|1.49|\n\n|PCELL|POWERCELL SWEDEN|2,608,765.00|2,660,593.00|91,057,237.18|71,506,530.91|1.57|1.39|\n\n|ELP|COMPANHIA PARANAENSE DE ENERGIA AD|7,412,724.00|72,595,298.00|78,723,128.88|89,292,216.54|1.36|1.74|\n\n|ENLT|ENLIGHT RENEWABLE ENERGY LTD|12,088,527.00|15,959,621.00|21,066,521.68|30,676,369.71|0.36|0.6|\n\n|USD|USD CASH|4,013,409.00|3,731,217.00|4,013,409.14|3,731,216.40|0.07|0.07|\n\n|XTSLA|BLK CSH FND TREASURY SL AGENCY|2,990,000.00|5,860,000.00|2,990,000.00|5,860,000.00|0.05|0.11|\n\n|KRW|KRW CASH|2,460,919,689.00|760,390,455.00|2,190,404.71|671,990.15|0.04|0.01|\n\n|CAD|CAD CASH|962,200.00|1,199,953.00|760,031.68|951,173.91|0.01|0.02|\n\n|HBCFT|CASH COLLATERAL USD HBCFT|689,000.00|1,078,000.00|689,000.00|1,078,000.00|0.01|0.02|\n\n|HKD|HKD CASH|3,158,887.00|5,610,248.00|407,212.11|721,798.05|0.01|0.01|\n\n|CAD|CAD CASH(Corp Act)|0.00|1,267,217.00|0.00|1,004,491.72|0.00|0.02|\n\n|DKK|DKK CASH|1,629,859.00|5,125,528.00|266,045.08|810,770.31|0|0.02|\n\n|ENLT|ENLIGHT RENEWABLE ENERGY LTD|0.00|300|0.00|576.63|0|0|\n\n|ESM1|S\\&amp;amp;P500 EMINI JUN 21|62|97|0|0|0|0|\n\n|EUR|EUR CASH|192,524.00|17,793,500.00|233,685.93|20,931,383.82|0|0.41|\n\n|ILS|ILS CASH|802,624.00|431,769.00|242,286.99|129,673.89|0|0|\n\n|NEODS|NEOEN RIGHTS SA|0.00|2,420,368.00|0.00|8,009,173.31|0|0.16|\n\n|NOK|NOK CASH|1,247,306.00|3,199,563.00|144,833.50|373,782.88|0|0.01|\n\n|NZD|NZD CASH|240,371.00|5,901,599.00|174,774.04|4,129,348.99|0|0.08|\n\n|NZD|NZD CASH(Corp Act)|0.00|3,355,627.00|0.00|2,347,932.07|0|0.05|\n\n|REGI|RENEWABLE ENERGY INC|0.00|300|0.00|18,096.00|0|0|\n\n|SEK|SEK CASH|1,219,310.00|1,120,148.00|145,154.24|128,655.01|0|0|",
        "subreddit": "stocks",
        "title": "Whats changed with ICLN Holdings",
        "url": "https://www.reddit.com/r/stocks/comments/mgqhac/whats_changed_with_icln_holdings/",
        "created": 1617168484.0
    },
    {
        "author": "Harambe_Like_Baby",
        "created_utc": 1616948827,
        "id": "mf46ao",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Ok smoothbrains, listen up. Bo Jiden will unveil an infrastructure plan on Wednesday which is generally expected to have bipartisan support. This administration has already signaled commitment to green energy initiatives, so I expect that to be a BIG part of his speech Wednesday. \n\nClean tech has been walloped as part of the growth selloff with ETFs like ICLN and CTEC ~50% off highs and established players like PLUG and ENPH down even more. They are just primed for a positive catalyst which will send them to the moon 🚀🚀🚀\n\nTLDR: calls on any clean tech is free money. Yes or yes?",
        "subreddit": "wallstreetbets",
        "title": "Literally free money $ICLN",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mf46ao/literally_free_money_icln/",
        "created": 1616977627.0
    },
    {
        "author": "stupefyme32",
        "created_utc": 1614884530,
        "id": "lxsce6",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Hey guys, ENPH has been consistently dropping for over a month now. I haven't read any bad news about it which is why I've been holding but now that's it dropped a total of 25% in the past month I'm wondering if I need to re-evaluate whether I should keep it in my portfolio.\n\nI'd appreciate if you guys left your opinions!",
        "subreddit": "stocks",
        "title": "Should I continue to hold ENPH?",
        "url": "https://www.reddit.com/r/stocks/comments/lxsce6/should_i_continue_to_hold_enph/",
        "created": 1614913330.0
    },
    {
        "author": "donluc007",
        "created_utc": 1615222276,
        "id": "m0jzs4",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Hi traders and investors,\n\n&amp;#x200B;\n\nI guess I'm gone start with disclosure, I hold NIO, TSLA, sold CRSR, AAPL, API, MSFT; majority in NIO and TSLA, holding &gt;12400 stocks of NIO, having majority bought in the range of 10-20$/share.\n\nI got here since I was super close to monitoring what people say on social media about stocks, next to adding my own DD on it.\n\nMyself and u/Superman701 have build this app which allows us all to spot hype in discussed stocks. Here you go. These are top 15 stocks being discussed on r/stocks in last 24 hours. \n\nI am now even more encouraged to see NIO rising back to 66.99! Haha\n\n    Rank\tMarket\tTicker\tChange  Total   Posts   Upvotes Comments\n                            Hype\tHype\t\t\t\t\n    1\tNASDAQ\tTSLA \t38%\t1018\t2\t450\t110\n    2\tNYSE\tNIO\t66%\t915\t4\t209\t481\n    3\tNASDAQ\tCRSR\t65%\t850\t2\t196\t450\n    4\tNASDAQ\tCRWD\t64%\t819\t1\t188\t439\n    4\tNYSE\tPINS\t64%\t819\t1\t188\t439\n    4\tNYSE\tLMND\t64%\t819\t1\t188\t439\n    7\tNYSE\tGME\t87%\t497\t8\t138\t189\n    8\tNASDAQ\tAAPL\t69%\t200\t3\t32\t124\n    9\tNASDAQ\tAPI\t90%\t178\t2\t74\t22\n    10\tNYSE\tFICO\t100%\t161\t1\t72\t13\n    11\tNASDAQ\tMSFT\t69%\t158\t2\t27\t96\n    12\tNASDAQ\tTTD\t100%\t155\t1\t61\t29\n    13\tNYSE\tAMC\t51%\t124\t2\t32\t52\n    14\tNASDAQ\tENPH\t54%\t118\t1\t43\t28\n    15\tNYSE\tHOME\t100%\t109\t1\t14\t77",
        "subreddit": "stocks",
        "title": "Top stocks in discussion in r/stocks subreddit in last 24 hrs.",
        "url": "https://www.reddit.com/r/stocks/comments/m0jzs4/top_stocks_in_discussion_in_rstocks_subreddit_in/",
        "created": 1615251076.0
    },
    {
        "author": "radarbot",
        "created_utc": 1616981858,
        "id": "mfexin",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "When the stock market has such an aggressive pull back on the hot 2020 stocks (ie. green energy, cloud/SaaS, high tech growth, etc), it made me revisit my conviction with all the stocks I own.\n\nThis had me re-reading the ENPH Q4 annual report. In 2020, ENPH didn't sell any energy storage solutions. In their Q4, the 10K states that ENPH will introduce a new energy storage product called Ensemble.\n\nhttps://investor.enphase.com/node/18836/html#ib51ac078944f40aabcb529ec51955ccf_409\n\n&gt; We expect further revisions of our storage products with Ensemble technology to be released in 2021, with a focus on the grid-agnostic IQ 8 PV microinverter for residential installations.\n\nThis is reinforced on their website:\n\nhttps://enphase.com/en-us/ensemble-technology-enphase-installers\n\n\nLooking at their 10K, its not very clear whether their storage solution is included in their revenue. Their supplemental data only covers microinverter system shipments:\n\n&gt; https://investor.enphase.com/static-files/5e9174b7-a787-4e4d-8d7b-307ce2813b77\n\nBut their annual report press release states that their Ensemble storage solution increased by 35%\n\nDoes anyone know how their storage solution is incorporated into their aggregate revenue? Also, does anyone have a feeling if the growth projections of their storage solution is priced into the stock price?\n\nThe PE ratio is currently at a monstrous ~150 with PS ratio of 25. With their market cap currently at $20B with annual revenue of $774M and net income of $133M.\n\nENPH has to see revenues increase by 20x to get to a reasonable PE ratio. Its not TSLA levels ridiculous, but its up there.",
        "subreddit": "stocks",
        "title": "ENPH Ensemble storage revenues priced in?",
        "url": "https://www.reddit.com/r/stocks/comments/mfexin/enph_ensemble_storage_revenues_priced_in/",
        "created": 1617010658.0
    },
    {
        "author": "Dowdell2008",
        "created_utc": 1614876291,
        "id": "lxp0eh",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I know the entire market is red right now including solar market. I have been long on CSIQ for a while now and this article pretty much spells out my reasons. Definitely buying more on this dip. \n\n“Canadian Solar Inc (NASDAQ:CSIQ) is one of the world’s largest solar technology and renewable energy companies. It is a leading manufacturer of solar photovoltaic modules, provider of solar energy and battery storage solutions, and developer of utility-scale solar power and battery storage projects with a geographically diversified pipeline in various stages of development.\n\nOver the past 19 years, Canadian Solar has successfully delivered over 49 GW of premium-quality, solar photovoltaic modules to customers in over 150 countries. Likewise, since entering the project development business in 2010, Canadian Solar has developed, built and connected over 5.6 GWp in over 20 countries across the world.”\n\nhttps://www.journaltranscript.com/2021/03/why-solar-is-still-the-big-bet-enph-gsfi-csiq/",
        "subreddit": "stocks",
        "title": "Excellent write up about Solar sector (CSIQ specifically)",
        "url": "https://www.reddit.com/r/stocks/comments/lxp0eh/excellent_write_up_about_solar_sector_csiq/",
        "created": 1614905091.0
    },
    {
        "author": "Traditional_Fee_8828",
        "created_utc": 1617137486,
        "id": "mgppfh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "ICLN recently balanced their holdings a bit, but their website makes it difficult to see just how much has changed, so I took their excel, and put the shares side by side. You can scroll through to find the holdings change of companies you like. It may not be perfect, but I think the majority are fine.\n\n|Ticker|Name|Shares Before|Shares|Market Value Before:|Market Value Now:|Weight Before(%):|Weight Now(%):|\n:--|:--|--:|--:|--:|--:|--:|--:|\n|968|XINYI SOLAR HOLDINGS LTD|120,710,000.00|123,306,000.00|253,639,838.35|200,840,640.20|4.37|3.91|\n|336260|DOOSAN FUEL CELL LTD|2,466,669.00|2,516,342.00|109,776,101.47|114,970,510.72|1.89|2.24|\n|AY|ATLANTICA SUSTAINABLE INFRASTRUCTU|3,894,440.00|3,984,873.00|140,784,006.00|133,971,430.26|2.43|2.61|\n|BLX|BORALEX INC CLASS A|5,535,299.00|5,649,178.00|193,604,296.78|177,372,233.03|3.34|3.46|\n|CAD|CAD CASH(Corp Act)|962,200.00|1,267,217.00|760,031.68|1,004,491.72|0.01|0.02|\n|CAD|CAD CASH|43,073,956.00|1,199,953.00|214,222,462.11|951,173.91|3.69|0.02|\n|CEN|CONTACT ENERGY LTD|58,833,125.00|43,524,122.00|124,137,893.75|208,913,261.20|2.14|4.07|\n|CIG|COMPANHIA ENERGETICA MINAS GERAIS|2,801,810.00|58,833,125.00|131,488,943.30|128,844,543.75|2.27|2.51|\n|CSIQ|CANADIAN SOLAR INC|1,629,859.00|2,857,905.00|266,045.08|128,834,357.40|0|2.51|\n|DKK|DKK CASH|3,020,171.00|5,125,528.00|314,852,826.75|810,770.31|5.43|0.02|\n|DQ|DAQO NEW ENERGY ADR REPRESENTING|6,278,696.00|3,084,361.00|133,673,764.33|191,723,879.76|2.3|3.73|\n|ECV|ENCAVIS AG|9,802,487.00|6,424,816.00|215,358,482.84|117,902,183.90|3.71|2.3|\n|EDPR|EDP RENOVAVEIS SA|7,412,724.00|10,062,920.00|78,723,128.88|205,972,777.39|1.36|4.01|\n|ELP|COMPANHIA PARANAENSE DE ENERGIA AD|12,088,527.00|72,595,298.00|21,066,521.68|89,292,216.54|0.36|1.74|\n|ENLT|ENLIGHT RENEWABLE ENERGY LTD|1,912,663.00|15,959,621.00|336,743,447.78|30,676,369.71|5.81|0.6|\n|ENLT|ENLIGHT RENEWABLE ENERGY LTD|62|300|0|576.63|0|0|\n|ENPH|ENPHASE ENERGY INC|192,524.00|1,953,196.00|233,685.93|277,627,279.44|0|5.41|\n|ESM1|S&amp;amp;P500 EMINI JUN 21|2,620,041.00|97|212,275,721.82|0|3.66|0|\n|EUR|EUR CASH|689,000.00|17,793,500.00|689,000.00|20,931,383.82|0.01|0.41|\n|FSLR|FIRST SOLAR INC|3,158,887.00|2,676,220.00|407,212.11|218,406,314.20|0.01|4.25|\n|HBCFT|CASH COLLATERAL USD HBCFT|802,624.00|1,078,000.00|242,286.99|1,078,000.00|0|0.02|\n|HKD|HKD CASH|8,052,675.00|5,610,248.00|153,166,203.79|721,798.05|2.64|0.01|\n|ILS|ILS CASH|2,460,919,689.00|431,769.00|2,190,404.71|129,673.89|0.04|0|\n|INE|INNERGEX RENEWABLE ENERGY INC|59,511,450.00|8,282,461.00|246,643,419.18|143,517,575.57|4.25|2.8|\n|KRW|KRW CASH|2,349,028.00|760,390,455.00|138,000,509.02|671,990.15|2.38|0.01|\n|MEL|MERIDIAN ENERGY LTD|1,247,306.00|60,133,448.00|144,833.50|219,395,699.40|0|4.27|\n|NEODS|NEOEN RIGHTS SA|3,187,950.00|2,420,368.00|142,947,678.00|8,009,173.31|2.46|0.16|\n|NEOEN|NEOEN SA|240,371.00|1,984,296.00|174,774.04|88,817,322.11|0|1.73|\n|NOK|NOK CASH|2,612,813.00|3,199,563.00|223,839,689.71|373,782.88|3.86|0.01|\n|NOVA|SUNNOVA ENERGY INTERNATIONAL INC|1,413,608.00|3,267,752.00|230,284,559.72|106,169,262.48|3.97|2.07|\n|NZD|NZD CASH|2,608,765.00|5,901,599.00|91,057,237.18|4,129,348.99|1.57|0.08|\n|NZD|NZD CASH(Corp Act)|11,315,434.00|3,355,627.00|547,440,696.92|2,347,932.07|9.44|0.05|\n|ORA|ORMAT TECH INC|1,272,181.00|2,690,071.00|98,937,516.37|202,078,133.52|1.71|3.94|\n|ORSTED|ORSTED|2,642,204.00|1,439,919.00|165,349,126.32|230,731,428.87|2.85|4.49|\n|PCELL|POWERCELL SWEDEN|6,530,433.00|2,660,593.00|190,331,941.83|71,506,530.91|3.28|1.39|\n|PLUG|PLUG POWER INC|675,810.00|11,540,253.00|201,600,881.10|355,208,987.34|3.48|6.92|\n|REGI|RENEWABLE ENERGY INC|1,219,310.00|1,272,181.00|145,154.24|76,737,957.92|0|1.49|\n|REGI|RENEWABLE ENERGY INC|7,030,394.00|300|262,831,560.91|18,096.00|4.53|0|\n|RUN|SUNRUN INC|4,853,236.00|2,695,103.00|109,569,956.14|139,902,796.73|1.89|2.73|\n|SCATC|SCATEC SOLAR|4,013,409.00|6,638,798.00|4,013,409.14|189,703,209.81|0.07|3.7|\n|SEDG|SOLAREDGE TECHNOLOGIES INC|3,662,522.00|690,300.00|280,959,973.67|179,505,612.00|4.84|3.5|\n|SEK|SEK CASH|1,188,876.00|1,120,148.00|224,045,271.09|128,655.01|3.86|0|\n|SGRE|SIEMENS GAMESA RENEWABLE ENERGY SA|2,990,000.00|7,180,751.00|2,990,000.00|249,780,050.30|0.05|4.87|\n|SLR|SOLARIA ENERGIA Y MEDIO AMBIENTE S|4,853,236.00|4,986,597.00|109,569,956.14|101,598,832.16|1.89|1.98|\n|USD|USD CASH|4,013,409.00|3,731,217.00|4,013,409.14|3,731,216.40|0.07|0.07|\n|VER|VERBUND AG|3,662,522.00|3,734,300.00|280,959,973.67|268,842,040.87|4.84|5.24|\n|VWS|VESTAS WIND SYSTEMS|1,188,876.00|1,214,384.00|224,045,271.09|233,779,197.06|3.86|4.55|\n|XTSLA|BLK CSH FND TREASURY SL AGENCY|2,990,000.00|5,860,000.00|2,990,000.00|5,860,000.00|0.05|0.11|",
        "subreddit": "stocks",
        "title": "Here's whats changed with ICLN Holdings",
        "url": "https://www.reddit.com/r/stocks/comments/mgppfh/heres_whats_changed_with_icln_holdings/",
        "created": 1617166286.0
    },
    {
        "author": "hist1788",
        "created_utc": 1615259748,
        "id": "m0xgaf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "First time poster, sorry if this doesn't belong here. Is this because of Texas catastrophe last month?",
        "subreddit": "wallstreetbets",
        "title": "Any thoughts on why ENPH is going down? How can we bring it back up?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m0xgaf/any_thoughts_on_why_enph_is_going_down_how_can_we/",
        "created": 1615288548.0
    },
    {
        "author": "NemoSolum",
        "created_utc": 1614784457,
        "id": "lww6ar",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Any Apes in ENPH?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lww6ar/any_apes_in_enph/",
        "created": 1614813257.0
    },
    {
        "author": "zulubus",
        "created_utc": 1615977307,
        "id": "m6xht0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "SPACs",
        "title": "STPK / Stem, Inc valuation based on price to sale ratio compared to ENPH Enphase Energy",
        "url": "https://www.reddit.com/r/SPACs/comments/m6xht0/stpk_stem_inc_valuation_based_on_price_to_sale/",
        "created": 1616006107.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778597,
        "id": "lwu16p",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "stocks",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/stocks/comments/lwu16p/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807397.0
    },
    {
        "author": "Puzzleheaded_Web_551",
        "created_utc": 1614806345,
        "id": "lx4mu4",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": " \n\nI imported SIMM (Single Inline Memory Modules), between 1994 and 2006, for my branded computers.\n\nIn that time period, I watched the \"chip\" market more than I did the precious metals market - they moved daily and prices for each type of module was set by noon, each day.\n\nMy companies imported tens of thousands of SIMMs from Singapore, Taiwan, China, Spain, and a few other countries. The paperwork required at customs, in Anchorage, was due to an \"Anti Dumping Tax\". This was to prevent North Korean manufactured chips to be imported (as it should be). At the time, Goldstar became a producer of IC (Integrated Circuitry), chips as it could not keep up with the television innovations. BUT... Goldstar was a SOUTH Korean company, with no embargo, yet monitored closely. Thy produced a great product, however, they were also counterfeited easier and therefore, \"a radioactive\" product.\n\n&gt;***Side Note:***\n\nLG Semicon LLC, was a producer, specializing in IC chips. One company bought the other and both Goldstar and LG Semicon became what we now know as LG.\n\nBack in those days tracking the manufacturing of chips was crucial (no pun intended), because of the daily swing of the prices. The determining factors (which I looked at), were :\n\n* Production capacity of each factory.\n* Daily production numbers of computers.\n* Intel ($INTC), AMD, ($AMD), Microsoft ($MSFT), Compaq, HP ($HP - Hewlett Packard, at one time, \"absorbed\" Packard Bell Computers), and other mass consumers/assemblers of IC chips for PCBs (Printed Circuit Board), including details of motherboard designs and IC requirements.\n* Mother Nature and her wrath \"overseas\".\n\nThe computer makers, DELL ($DELL), Gateway, and Compaq always had first choice of available chips, due to their deep pockets and demand.\n\nA few companies in Asian countries figured out that by closing a factory, for a day or a week, they could, effectively, increase their profits quickly. This effected the entire \"Technology Sector\", although it did not exist yet.\n\n&gt;**Points:**\n\n* Always ask \"Why\".\n* \"Due Diligence\" is not just 2 levels deep. Sometimes you have to find out who is selling the sand/silica, first.\n* In this market, \"What goes down, usually comes up\". Write that down.\n* VIVA LA #REDDIT AND FREE TRADE !!",
        "subreddit": "wallstreetbets",
        "title": "CHIP SHORTTAGE - REAL OR MEMOREX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx4mu4/chip_shorttage_real_or_memorex/",
        "created": 1614835145.0
    },
    {
        "author": "whereismynut",
        "created_utc": 1614715571,
        "id": "lwb7id",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " You may be seeing that this company is down today but I believe that because the hype from the recent boom is blowing over. I have some updated comments from users below so give them credit.  \n\n**PLEASE BE AWARE OF FEES FROM FIDELITY AND OTHER BROKERAGES.** ETrade currently has a 5 dollar fee. (fair imo) (just trying to be transparent from what I read up on recently.)\n\n&amp;#x200B;\n\nbasically, copy and paste of  recently published end of Quarter Highlights and my previous post from last week.\n\n&gt;• \t $1.6m Mooring Tensioner project led by Carnegie awarded funding by  Blue  Economy Cooperative Research Centre and formally commences with  project  partner  \n•\tHewlett Packard  Enterprise Company  (HPE) and Carnegie sign Collaboration Agreement to  develop reinforcement  learning-based controller for CETO and commence  work  \n•\tMicrosoft awards Carnegie  with an AI for Earth grant providing  computational resources and  support for a project to enhance Carnegie’s  Wave Predictor   \n• \tOceantera, a southeast Asian  project developer, and Carnegie sign  Collaboration Agreement to explore  potential projects in SE Asia and  share knowledge and expertise  \n•\t Hydrogen opportunities explored and further knowledge developed  through  ongoing internal investigations and via industry relationships  \n• \tGarden Island Microgrid resumes operation following temporary   disconnection required for Department of Defence’s own electrical   upgrades  \n•\tEuropean Commission  releases new EU  Strategy on Offshore Renewable Energy supporting a  vision of at least  1000 MW of ocean energy by 2030 and 60 GW by 2050\n\nI encourage you guys to read their quarterly report.\n\n[https://www.carnegiece.com/portfolio/quarterly-activities-report-4/](https://www.carnegiece.com/portfolio/quarterly-activities-report-4/)\n\nthey're  investing to integrate their technology, reduce costs on their own  tech, and on creating energy. (that's my own understanding.) for  example,\n\n&gt;Hydrogen  opportunities were investigated during the quarter and continue with a  growing interest in the space from industry and government. The  synergies between wave energy and hydrogen production strengthen  productionstrengthen the case and Carnegie has been particularly focused  on opportunities that encompass existing target markets such as  islands,  remote areas, and marine energy consumers including fish  farming. In parallel, enabling technologies are being developed by a  variety of companies that are complementary to Carnegie’s activities.   For example, electrolyzers,  the  devices  that  produce  hydrogen  from   water and  electricity,  are being developed can now use seawater as  their hydrogen source rather than freshwater  \nHydrogen   is most likely to play a  role as long/medium-term storage or as a   fuel source for vessels and generators. Carnegie’s role in the Blue  Economy CRCis providing good insight into the topic of hydrogen in the  marine space and opportunities will continue to be identified.\n\nthis  is basically a long-term play and they will specify it in there as  well. Imo I see the demand for renewable energy. I feel like there will  be heavy reform on how Companies and consumers use energy in the  following 50 years. they specify that in the report.\n\n&gt;Carnegie  continues to seegrowing vision and support for offshore renewables  around the world as demonstrated by actions such as the European  Commission publishing a dedicated EU strategy on offshore renewable  energyin November 2020(An EU Strategy to harness thepotential  of   offshore  renewable  energy  for  a  climate  neutral  future). The EU’s  strategysupports an objective of achievingat least1 GW of ocean energy  by 2030 and 60 GW of oceanenergy  by  2050.  It  alsoproposes  a   strategyto  make  offshore  renewable  energy  a  corecomponent of  Europe’s energy system by 2050.In  the  US,the  new  President  has   significantly  elevated  the  issue  of  climate  change  withrenewed   commitment  to  the  Paris  Agreement.  Carnegie  sees  this  as  highly   positive  andexpects support measures for marine renewables to  increaseas a result\n\nThey  basically go on about all the collab theyre making with the companies  listed above and the fundings they're getting and how the tech works.  Check it out. This isn't financial advice.\n\ntdlr long play at a good price. long term potential.\n\nEdits: add info and fix errors. Price updates\n\n2/26/21-  0.0069+0.0023 (+50.00%)\n\n3/1/21- 0.0072 0.0002 (+2.86%)\n\nuser feed back.\n\n u/[Art-of-Intuition](https://www.reddit.com/user/Art-of-Intuition/) \\-   \n\nFocusing on the technical resource  within the U.S. exclusive economic zone that can be harnessed for  large-scale (megawatt- to gigawatt-scale) energy generation, the report  found that the total marine energy resource in the 50 states amounts to  2,300 TWh/yr – equivalent to approximately 57% of U.S. generation in  2019.\n\n[https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/](https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/)\n\nWave  energy potential is massive! With all the millions of EVs coming online  in the next several years the world will need to quickly generate more  energy and marine energy will have to be a big part of that plan.\n\nCarnegie  has hundreds of patents the reason HPE, Microsoft, and Enel Energy are  partnering with them is for the intellectual property. Carnegie’s long  term plan is to license their wave technology to a larger company ( i.e.  Siemens, GE etc.) this is a long play 2-3 years from now. Buy and hold!\n\n u/[GoingRamboMCAT](https://www.reddit.com/user/GoingRamboMCAT/) \\-  In 100k shares here, incredible partnerships w/ Hewlett-Packard and  Microsoft. Defense contracts, government support, and licensure deals in  play. Ton of potential here! In for the long-haul. \n\n u/[leavemealone559](https://www.reddit.com/user/leavemealone559/) \\-  Bought 3k shares for 10 dollars yesterday thru Fidelity and after I  bought I check my positions and I’m like wtf how am I negative $50  already !? Foreign stock transfer fees :( now It has to hit .02 before I  can break even lmao \n\n u/[Fourfourfourfour44](https://www.reddit.com/user/Fourfourfourfour44/) \\-  12 billion shares outstanding :(",
        "subreddit": "pennystocks",
        "title": "CARNEGIE CLEAN ENERGY LTD SHS 0.0055 -0.0006 (-10.06%) - Why now you should buy and hold for a long-term investment.",
        "url": "https://www.reddit.com/r/pennystocks/comments/lwb7id/carnegie_clean_energy_ltd_shs_00055_00006_1006/",
        "created": 1614744371.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614893130,
        "id": "lxvuo4",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, March 4, 2021**\n\nStocks slumped Thursday once again, continuing the recent sellof. The tech-heavy Nasdaq (QQQ) led the selloff, falling 1.64%. The S&amp;P 500 (SPY) fell 1.24% and the Dow Jones (DIA) fell 1.07%. At session lows, both the Nasdaq and S&amp;P 500 erased 2021’s gains. \n\nThe moves lower came even after a new report on weekly unemployment claims came in better than expected, pointing to improving employment trends. \n\n* **Initial jobless claims:** 745,000 vs. 750,000 expected and a revised 736,000 during the prior week. \n* **Continuing claims:** 4.295 million vs. 4.300 million expected and 4.419 million during the prior week\n\nDuring a public appearance Thursday afternoon, Federal Reserve Chairman Jerome Powell said Thursday that the central bank will be “patient” in keeping interest rates near zero, even if inflationary pressures start to rise. Powell cautioned that as the COVID-19 vaccine rollout continues, the Fed could see signs of rising prices amid surging consumer spending. But the Fed chairman noted that he does not expect higher inflation to turn into anything resembling the double-digit inflation of the 1970s. He said, “If we do see what we believe is likely a transitory increase in inflation, where longer-term inflation expectations are broadly stable at levels consistent with our framework and goals, I expect that we will be patient.”\n\nAs Treasury yields continue to rise, market participants are increasingly rotating out of high-growth names that led the markets in 2020. Technology stocks came under exceptional selling pressure as traders turned their focus to stocks poised to benefit more directly from an impending economic reopening. At the same time, the recent, rapid rise in Treasury yields has also deterred investors from growth stocks, with interest rates closely tied to borrowing costs for companies and consumers. The 10-year Treasury yield climbed to around 1.544% at the time of writing. \n\nIn other news, lawmakers in the Senate are set to begin debating President Biden’s $1.9 trillion stimulus, which was passed by the House of Representatives recently. Democrats are racing to push the legislation forward before the mid-March expiry of augmented Federal unemployment benefits. Republicans do not support the bill because of its size, but through a process called reconciliation, Democrats will be able to pass the bill without support from the other side of the aisle.\n\n**Highlights**\n\n* The decisions by Britain and the United States to suspend retaliatory tariffs will create space for negotiations on an ongoing dispute between Boeing (BA) and Airbus, White House Press Secretary Jen Psaki said on Thursday. \n* President Biden said his administration expects to have enough COVID-19 vaccines for any adult that wants it by the end of May, pulling the targets two months closer than the previous government estimate.\n* U.S. mortgage rates extended their recent leg higher to break above 3% for the first time since July 2020, raising concerns that the housing market's breakneck growth last year may sharply lose momentum.\n* Square (SQ) announced it took a majority stake in music platform Tidal that is owned by rapper Jay-Z. Jay-Z will be added to the board of directors at Square. \n* **Please note that the stock price was written in the morning and does not account for intraday changes.**\n* Airbnb (ABNB) with a host of target raises just over the $200 mark. Stock around $175. Including by Credit Suisse, Piper Sandler, Canaccord Genuity, &amp; Needham\n* Adaptive Biotechnologies (ADPT) had a price target raise by Morgan Stanley from $46 to $60\n* Big target raise for Alarm.com (ALRM) by Raymond James from $75 to $115 at STRONG-BUY\n* American Eagle Outfitters (AEO) target raise\n   * Citigroup from $29 to $32\n   * UBS Group from $31 to $37\n   * Jeffries Financial $30 to $32\n* Broadcom (AVGO) had a price target raise by Oppenheimer from $500 to $575 at OUTPERFORM\n* Carvana (CVNA) received a price target raise by JMP Securities from $250 to $290 at MARKET OUTPERFORM\n* Etsy (ETSY) with host of target raises\n   * Goldman Sachs $178 to $286 BUY\n   * Canaccord Genuity $215 to $270 BUY\n   * Morgan Stanley $93 to $123 UNDERWEIGHT\n   * Roth Capital $235 to $245 BUY\n   * Needham $155 to $235 BUY\n* Fisker (FSR) with a Target raise by Morgan Stanley from $27 to $40 at OVERWEIGHT\n* Futu Holdings (FUTU) Citigroup raise target from $120 to $245 at BUY. This is a big one!\n* Guardant Health (GH) had a price target raise by Morgfan Stanley $MS from $130 to $175\n* HP (HPQ) with a price target raise by Morgan Stanley from $30 to $38 at OVERWEIGHT\n* Liveperson (LPSN)  with a host of target raises. We like it at current elvels with this week’s selloff.\n   * Mizuho $75 to $90 BUY\n   * Needham $65 to $71\n   * Rosenblatt $73 to $75 BUY\n* PetIQ (PETQ) price target raised by Raymond James $35 to $45 OUTPERFORM\n* Renewables Energy Group (REGI) target raised by H.C. Wainwright from $70 to $115 at BUY. This is timely, especially with the selloff. We like it.\n* Twitter (TWTR) with a host of target raises by Goldman Sachs, Pivotal Research, Canaccord Genuity, KeyCorp, Rosenblatt. Most at BUY or OVERWEIGHT with end price target between $90 and $100\n* Shake Shack (SHAK) with host of target raises\n   * Deutsche Bank $70 to $107 HOLD\n   * Piper Sandler $122 to $135 OVERWEIGHT\n   * Morgan Stnaley $87 to $95 EQUAL WEIGHT\n\n“The first rule of investment is ‘buy low and sell high’, but many people fear to buy low because of the fear of the stock dropping even lower. Then you may ask: ‘When is the time to buy low?’ The answer is: When there is maximum pessimism.” - Sir John Templeton",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, March 4, 2021.",
        "url": "https://www.reddit.com/r/stocks/comments/lxvuo4/here_is_a_market_recap_for_today_thursday_march_4/",
        "created": 1614921930.0
    },
    {
        "author": "Blueeyessmokeydog",
        "created_utc": 1614866091,
        "id": "lxl0l6",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "https://www.reddit.com/r/CanadianInvestor/comments/kj2uu8/some_noob_dd_for_some_interesting_canadian/\n\n(Link is deleted now, but I posted this when PyroGenisis was around $3/share and HPQ was around 85c.)\n**Here's the deleted post**\n&gt;Some noob DD from me. I think these stocks are a great long term hold. Don't use this as advice, do your own DD. Informative purposes only\n\n&gt;I've been looking at PyroGenesis (PYR.TO) ever since they announced they were looking to uplist on NASDAQ. PyroGenesis Canada Inc. designs, develops, manufactures, and commercializes advanced plasma processes and systems in Canada and internationally. They are involved in Metals, Waste management, Innovation &amp; Custom Process development (HPQ-Silicon), Plasma Torches (see previous DD by /u/Greasyfork\n\n&gt;Two of their main products piqued my interest- \n\n&gt;1)- Plasma torches\n\n&gt;These plasma torches are an environmentally friendly alternative to using fossil fuels in the Iron Pelletization industry. Currently PyroGenesis is the only company that has a patent for such a process in the industry. \n\n&gt;Just recently, they announced they had a contract with a major iron ore supplier equaling $3.6M\n\n&gt;https://finance.yahoo.com/news/pyrogenesis-signs-initial-plasma-torch-213000493.html &gt;https://finance.yahoo.com/news/pyrogenesis-signs-additional-1-1mm-133500724.html\n\n&gt;It also mentions there that \"The Client, which has committed to reduce its greenhouse gas (“GHG”) emissions, has over ten (10) plants, each possibly requiring up to 50 plasma torches.\" - That's approx $500-600M future revenue that the client has committed to purchase exclusively from PyroGenesis. PyroGenesis will also be providing after sale services to this client for additional revenue\n\n&gt;That is just ONE contract with one company. Expect many more contracts over the years as more companies decide to ditch fossil fuels and go with a more green solution\n\n&gt;2- Innovation &amp; Custom Process development (HPQ-Silicon)\n\n&gt;That brings to the second company on my radar, HPQ Silicon Resources (HPQ.V, OTC:URAGF) They are involved in the exploration, mining, and production of silicon metals, solar grade silicon metals, and porous silicon wafers.\n\n&gt;A few months ago, PyroGenesis &amp; HPQ Silicon signed an agreement to develop The PUREVAPTM NSiR process. Once up and runing, HPQ NANO can deliver to advanced materials companies and battery manufacturers a cost competitive, tailor-made product, that can replace graphite in batteries and thereby allow the deployment of truly powerful next generation Li-ion batteries\n\n&gt;https://finance.yahoo.com/news/hpq-silicon-pyrogenesis-sign-nano-170500452.html\n\n&gt;PyroGenesis then sold the IP rights of the PUREVAP™ NSiR process which included a 10% royalty for any sales which PyroGenesis can convert into a 50% ownership of HPQ\n\n&gt;https://finance.yahoo.com/news/pyrogenesis-signs-3m-contract-hpq-174600535.html\n\n&gt;Before they even started any production, they already have an order for the material from a major Car manufacturer \n\n&gt;https://finance.yahoo.com/news/hpq-nano-receives-first-order-190300952.html\n\n&gt;And earlier today, they announced that their first reactor has been commissioned and is ready to start production. \n\n&gt;https://finance.yahoo.com/news/hpq-nano-reaches-major-milestones-141000141.html\n\nSince that post- there have been a number of developments- PyroGenesis stock price is now at $7.7ish (peak of $12) (which IMO is a great buy-in point) &amp; HPQ price is around $1.1 (peak of ~$1.6)\n\nJanuary 12- they announced implementation of a NCIB- When the company thinks their share price is undervalued, they can opt to buy back some shares thus reducing supply &amp; increasing value for shareholders\nhttps://finance.yahoo.com/news/pyrogenesis-announces-implementation-ncib-133500312.html\n\nJan 21- HPQ announced that their Gen1 Nano Silicon Reactor Exceeds Expectations\nhttps://finance.yahoo.com/news/pyrogenesis-announces-implementation-ncib-133500312.html\n\nFeb 02- PyroGenesis filed form 40-f with the SEC\nhttps://finance.yahoo.com/news/pyrogenesis-files-form-40-f-204300768.html\n\nFeb 18- Nasdaq application all but approved\nhttps://finance.yahoo.com/news/pyrogenesis-provides-listing-application-nasdaq-192500547.html\n\nLast time the market had a bit of a correction (Feb 23) and the stock price went from around $11 to $7ish, the company put put a press release specifically stating that everything was on track, no financing planned, company has cash, etc\n\nYesterday, they announced a new appointment to the board of directors-Mr. Ben Naccarato who has over 30 years of experience in the sector. BUT what I found interesting was tucked away at the end of the press release- \n\n\"Separately, the Company is pleased to announce today that it has entered into a lease agreement for an additional 31, 632 sq. ft. which will almost double its existing manufacturing footprint in Montreal, QC, Canada.\"\n\nSo they are planning on doubling their manufacturing capability\nhttps://finance.yahoo.com/news/pyrogenesis-pleased-announce-appointment-mr-212000379.html\n\nAll in all, I think this is a very good long term investment- they are the only leaders in the Plasma industry and they have 2 (other) products that I havent mentioned, they are the only non-US based company to have their equipment on US navy aircraft carriers and have a lot of other things going for them\n\nAs always, I am not a financial advisor, I just like the stock. do you own DD",
        "subreddit": "CanadianInvestor",
        "title": "A follow up to a previous DD post I did- PyroGenesis &amp; HPQ Silicon",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/lxl0l6/a_follow_up_to_a_previous_dd_post_i_did/",
        "created": 1614894891.0
    },
    {
        "author": "tim202012",
        "created_utc": 1614794300,
        "id": "lx02lm",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Besides a simple Buy or Sell can an experienced person explain whether HPQ would be good to keep or sell as I have been talked into purchasing a lot of shares. they are down and I want to know if I should cut my losses or keep waiting as he promises it will go up. claims it will be revolutionary for the battery market with electric vehicles.",
        "subreddit": "CanadianInvestor",
        "title": "calling all you pros need advice HPQ",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/lx02lm/calling_all_you_pros_need_advice_hpq/",
        "created": 1614823100.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614893205,
        "id": "lxvvo1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, March 4, 2021**\n\nStocks slumped Thursday once again, continuing the recent selloff. The tech-heavy Nasdaq (QQQ) led the selloff, falling 1.64%. The S&amp;P 500 (SPY) fell 1.24% and the Dow Jones (DIA) fell 1.07%. At session lows, both the Nasdaq and S&amp;P 500 erased 2021’s gains. \n\nThe moves lower came even after a new report on weekly unemployment claims came in better than expected, pointing to improving employment trends. \n\n* **Initial jobless claims:** 745,000 vs. 750,000 expected and a revised 736,000 during the prior week. \n* **Continuing claims:** 4.295 million vs. 4.300 million expected and 4.419 million during the prior week\n\nDuring a public appearance Thursday afternoon, Federal Reserve Chairman Jerome Powell said Thursday that the central bank will be “patient” in keeping interest rates near zero, even if inflationary pressures start to rise. Powell cautioned that as the COVID-19 vaccine rollout continues, the Fed could see signs of rising prices amid surging consumer spending. But the Fed chairman noted that he does not expect higher inflation to turn into anything resembling the double-digit inflation of the 1970s. He said, “If we do see what we believe is likely a transitory increase in inflation, where longer-term inflation expectations are broadly stable at levels consistent with our framework and goals, I expect that we will be patient.”\n\nAs Treasury yields continue to rise, market participants are increasingly rotating out of high-growth names that led the markets in 2020. Technology stocks came under exceptional selling pressure as traders turned their focus to stocks poised to benefit more directly from an impending economic reopening. At the same time, the recent, rapid rise in Treasury yields has also deterred investors from growth stocks, with interest rates closely tied to borrowing costs for companies and consumers. The 10-year Treasury yield climbed to around 1.544% at the time of writing. \n\nIn other news, lawmakers in the Senate are set to begin debating President Biden’s $1.9 trillion stimulus, which was passed by the House of Representatives recently. Democrats are racing to push the legislation forward before the mid-March expiry of augmented Federal unemployment benefits. Republicans do not support the bill because of its size, but through a process called reconciliation, Democrats will be able to pass the bill without support from the other side of the aisle.\n\n**Highlights**\n\n* The decisions by Britain and the United States to suspend retaliatory tariffs will create space for negotiations on an ongoing dispute between Boeing (BA) and Airbus, White House Press Secretary Jen Psaki said on Thursday. \n* President Biden said his administration expects to have enough COVID-19 vaccines for any adult that wants it by the end of May, pulling the targets two months closer than the previous government estimate.\n* U.S. mortgage rates extended their recent leg higher to break above 3% for the first time since July 2020, raising concerns that the housing market's breakneck growth last year may sharply lose momentum.\n* Square (SQ) announced it took a majority stake in music platform Tidal that is owned by rapper Jay-Z. Jay-Z will be added to the board of directors at Square. \n* **Please note that the stock price was written in the morning and does not account for intraday changes.**\n* Airbnb (ABNB) with a host of target raises just over the $200 mark. Stock around $175. Including by Credit Suisse, Piper Sandler, Canaccord Genuity, &amp; Needham\n* Adaptive Biotechnologies (ADPT) had a price target raise by Morgan Stanley from $46 to $60\n* Big target raise for Alarm.com (ALRM) by Raymond James from $75 to $115 at STRONG-BUY\n* American Eagle Outfitters (AEO) target raise\n   * Citigroup from $29 to $32\n   * UBS Group from $31 to $37\n   * Jeffries Financial $30 to $32\n* Broadcom (AVGO) had a price target raise by Oppenheimer from $500 to $575 at OUTPERFORM\n* Carvana (CVNA) received a price target raise by JMP Securities from $250 to $290 at MARKET OUTPERFORM\n* Etsy (ETSY) with host of target raises\n   * Goldman Sachs $178 to $286 BUY\n   * Canaccord Genuity $215 to $270 BUY\n   * Morgan Stanley $93 to $123 UNDERWEIGHT\n   * Roth Capital $235 to $245 BUY\n   * Needham $155 to $235 BUY\n* Fisker (FSR) with a Target raise by Morgan Stanley from $27 to $40 at OVERWEIGHT\n* Futu Holdings (FUTU) Citigroup raise target from $120 to $245 at BUY. This is a big one!\n* Guardant Health (GH) had a price target raise by Morgfan Stanley $MS from $130 to $175\n* HP (HPQ) with a price target raise by Morgan Stanley from $30 to $38 at OVERWEIGHT\n* Liveperson (LPSN)  with a host of target raises. We like it at current elvels with this week’s selloff.\n   * Mizuho $75 to $90 BUY\n   * Needham $65 to $71\n   * Rosenblatt $73 to $75 BUY\n* PetIQ (PETQ) price target raised by Raymond James $35 to $45 OUTPERFORM\n* Renewables Energy Group (REGI) target raised by H.C. Wainwright from $70 to $115 at BUY. This is timely, especially with the selloff. We like it.\n* Twitter (TWTR) with a host of target raises by Goldman Sachs, Pivotal Research, Canaccord Genuity, KeyCorp, Rosenblatt. Most at BUY or OVERWEIGHT with end price target between $90 and $100\n* Shake Shack (SHAK) with host of target raises\n   * Deutsche Bank $70 to $107 HOLD\n   * Piper Sandler $122 to $135 OVERWEIGHT\n   * Morgan Stnaley $87 to $95 EQUAL WEIGHT\n\n“The first rule of investment is ‘buy low and sell high’, but many people fear to buy low because of the fear of the stock dropping even lower. Then you may ask: ‘When is the time to buy low?’ The answer is: When there is maximum pessimism.” - Sir John Templeton",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, March 4, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/lxvvo1/here_is_a_market_recap_for_today_thursday_march_4/",
        "created": 1614922005.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778742,
        "id": "lwu2vs",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* OCGN\n* KMPH\n* RKT\n* TRXC\n* UWMC\n* OVID\n* FUBO\n* DIA\n* HZON\n* GENE\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lwu2vs/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807542.0
    },
    {
        "author": "tim202012",
        "created_utc": 1614794251,
        "id": "lx01xy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "calling all the pros Need Help HPQ",
        "url": "https://www.reddit.com/r/investing/comments/lx01xy/calling_all_the_pros_need_help_hpq/",
        "created": 1614823051.0
    },
    {
        "author": "Revolutionary-Owl315",
        "created_utc": 1614815457,
        "id": "lx7q0f",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The new way to build a house.... Print it!! HPQ🚀🚀🚀🚀🐸🐸🐸🐸",
        "url": "https://youtu.be/XHSYEH133HA",
        "created": 1614844257.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778539,
        "id": "lwu0fq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* OCGN\n* KMPH\n* RKT\n* TRXC\n* UWMC\n* OVID\n* FUBO\n* DIA\n* HZON\n* GENE\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/lwu0fq/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807339.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1615177256,
        "id": "m07myi",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Watchlist 3-8-21 👀\n\nKEEP EYES ON CRUDE OIL – CRUDE is UP = MARKET DOWN\n\nDow futures rose on Sunday evening as a new stimulus package from Washington headed toward final passage this week . President Joe Biden is expected to sign it into law before unemployment aid programs expire on March 14.\n\n“10-year yields finally caught up to other asset markets. This is putting pressure on valuations, especially for the most expensive stocks that had reached nosebleed valuations,” Mike Wilson, the chief U.S. equity strategist at Morgan Stanley, said in a note.\n\nOn the economic front, investors will get a look at wholesale inventory data from January on Monday. Several economic measures in recent weeks have shown a recovery that is picking up steam, including a better-than-expected February jobs report released on Friday.\n\nHOT SECTORS:\n\n1. House Goods \\^PRPL \\^LCUT \\^LUG \\^SNBR\n2. Financial Technology \\^FUTU \\^MFH\n3. Homebuilding/ Households Goods \\^GMS \\^KNH \\^JELD \\^CNR\n4. Computers, Phones &amp; Household Electronics \\^WDC \\^DBD \\^HPQ \\^SCSC\n5. Oil &amp; Gas \\^HPR \\^WTI \\^CPE \\^PVAC\n6. Natural Gas Utilities \\^OGS \\^NWN \\^SWX \\^SJI\n\nAH RUNNERS TURN POTENTIAL PM GAPPERS: $ANCN $TKAT $ADPT $LOGC $SGBX $CAPR $GBS $OCGN\n\nOil &amp; Gas Drilling\n\nCrude oil is up 2.83% at $67\n\nWatching $RIG $ENSV $BORR $BTU $CDEV $MRO $OXY $APA $HAL $USEG $ICD $CEI $HUSA\n\nCRYPTO/BLOCKCHAIN PLAYS:\n\nBITCOIN OVER 50K\n\n$WKEY with BTC weekend run and news on Friday the market has not reacted to, WISeKey's WISeToken Utility Token, a Blockchain-Based Asset for Machine-to-Machine Interactions is Now Integrated into the Oracle Blockchain.\n\nSympathy/Related: #MOGO #NXTD #MGI #EQOS #BRQS #AIKI4 #IZEA #AEHL #DPW #PBTS #MARA #PHUN #RIOT #EBON #HIVE #BRQS #IPDN #SOS\n\nRENEWABLE ENERGY:\n\n$OEG has earnings coming up\n\n$TRCH has pending merger news\n\nSympathy/Related: #WWR #PECK #PLUG #CLSK #FCEL #SUNW #AMTX #PEIX #ENG #SPI #WATT #ALAC #OPTT #SYPR #CBAT #WWR\n\nTECHNICALS:\n\n$RKT - potential short squeeze. Ex Dividend date is 3/9.\n\n$LOTZ - trending on Stocktwits, potential WSB squeeze\n\nRumor\n\n$CLBS upgraded by Zacks to 10$. just changed trend and is climbing...\n\n$LMPX - LMP Announces Closings on its Stage 1 Acquisitions and Expects its Highest Revenue and Gross Profit this Month in the History of the Company.\n\n$AUVI – NEWS - SteriLumen tweeted that the LEDs in their devices have been proven to kill Coronavirus in seconds. Unusual volume on Friday and it seems to be on a uptrend. With the news it could see a jump to test resistance at the $9.64 and it breaks, the next line of resistance is $10.16.\n\n$SRNE Lee’s Pharmaceutical Announces its Anti-PD-L1 Antibody Socazolimab, Licensed From Sorrento Therapeutics, Receives Clearance to Start Phase 3 Trial as a First-line Treatment of Extensive-stage Small-Cell Lung Cancer\n\nALL look ready for a bounce solely based on oversold chart and stimulus plays\n\n&amp;#x200B;\n\n*Processing img kqf0s1podql61...*\n\nBack Burners: \\^BNGO \\^EYES \\^EARS \\^GHSI",
        "subreddit": "smallstreetbets",
        "title": "Watchlist 3-8-21 👀",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/m07myi/watchlist_3821/",
        "created": 1615206056.0
    },
    {
        "author": "pythonmine",
        "created_utc": 1614717027,
        "id": "lwbqt9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "YOLOed on $HPQ - 10% growth in a week ain't bad",
        "url": "https://i.redd.it/e0yn4nu6dok61.jpg",
        "created": 1614745827.0
    },
    {
        "author": "tim202012",
        "created_utc": 1614794185,
        "id": "lx010u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "need advice HPQ",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx010u/need_advice_hpq/",
        "created": 1614822985.0
    }
]