[
    {
        "author": "AutoModerator",
        "created_utc": 1612166413,
        "id": "l9y3e7",
        "num_comments": 7565,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n  * StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Feb 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/l9y3e7/rstocks_daily_discussion_monday_feb_01_2021/",
        "created": 1612195213.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1612339214,
        "id": "lbiqol",
        "num_comments": 4795,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n  * StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Feb 03, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/lbiqol/rstocks_daily_discussion_wednesday_feb_03_2021/",
        "created": 1612368014.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1612252817,
        "id": "laqopg",
        "num_comments": 3193,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme and/or [post your arguments against TA here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help measure the trajectory of a security.  TA can also be used to interpret the actions of other market participants and predict their actions.\n        \nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Technicals Tuesday - Feb 02, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/laqopg/rstocks_daily_discussion_technicals_tuesday_feb/",
        "created": 1612281617.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612269629,
        "id": "laulsh",
        "num_comments": 550,
        "num_crossposts": 0,
        "selftext": "In this post we are going to go through an in-depth analysis of AMD, we are going to take a look at their fundamental value, their DCF, do a little technical analysis and set some price targets for the near future and for the long term\n\n\\~Very Long Post\\~ \\[Do NOT Read if you don't like comprehensive analysis\\]\n\nHello everyone! Let’s start by talking a little about [AMD](https://ibb.co/d0cPRrj), they are one of the biggest semiconductor companies in the world, and they operate in multiple segments like Computing, Gaming, Enterprise, Semi-Custom and many more with some of the most important products for the company being microprocessors and GPUs both for personal use like (gaming consoles &amp; PCs) while also offering products for professional use like data centers.\n\nThe company was founded more than 50 years ago and have more than 11K employees, with the company overperforming recently as they have seen a more than 80% rise in the last year.\n\nSo, guys, let’s go a little through the 4th quarter &amp; yearly [results](https://ibb.co/f0CLSF7) for AMD. The company reported a revenue of $3.24B in the 4th quarter, with a 53% growth since last year, while for the full year they earned almost $10B as they more than doubled they quarterly and full year net income, which resulted in a $1.29 earnings/share for the year.\n\nThe [company](https://ibb.co/TY6trfs) has 2 major income segments in Computing &amp; Graphics which brought in sales of over $6.4B for the year and an operating income of $1.26B and the Enterprise, Embedded and Semi-Custom segment which brought in $3.3B in revenues and almost $400M in operating income. They also provide an additional segment that doesn’t bring in any revenues but which represents costs that can’t be associated with any of the other 2 segments, but also includes stock-based compensations and acquisitions related costs.\n\nBoth of these 2 [segments](https://ibb.co/qdfVyrK) have seen huge increases in the past year with operating income doubling for the computing &amp; graphics segment and increasing by almost 50% for the EEC segment.\n\n[AMD](https://ibb.co/tYmkPwg) didn’t have such a big capital expenditure in 2020, with only $294M but this can increase depending on the demand of their products while they also [adjusted](https://ibb.co/hCtfk2k) their income with $312M in depreciation &amp; amortizations. Both of these numbers have increased by 40 to 50% in the past years and will be important in the DCF valuation.\n\nThey have also managed to increase the gross profit margin to 45%, up 2% from 2019 as their earnings before interest &amp; tax or [EBIT](https://ibb.co/xDptyzW) stood at $1.37B.\n\nThe company has seen a continued earnings per share [growth](https://ibb.co/FhLj0Y7) overall, despite the first 2 quarters of 2020 coming in lower than previous, but that was to be expected as this was impacted by the reduced [revenues](https://ibb.co/QdjCvnx) in Q1 &amp; Q2 before things started to pick up back again, as they finished with a huge increase overall in the 4th quarter.\n\nTheir product [portfolio](https://ibb.co/YkjNDbY) has become a great challenge to Intel’s market share and is continuing to evolve, as Intel is still struggling to regain momentum with their products.\n\n[AMD](https://ibb.co/XX3h4CD) announced the world’s best processors for laptop and an enterprise variant that is expected to be available in the first half of 2021.\n\nThey have also launched the fastest [AMD](https://ibb.co/fQQnFj4) gaming graphics card ever while also working with big companies like Amazon on their AWS cloud offerings &amp; Microsoft Azure which are planning to use their upcoming 3rd generation EPYC processors.\n\nAMD is also involved in supercomputers which indicates that they are continuing to innovate and develop products that will be in high demand for the foreseeable future\n\nThe one big thing that can propel AMD even more in the future is the proposed acquisition or more rather merger with Xilinx , which also beat earnings expectations the other day, with revenues of over $800M for the quarter and a Free Cash Flow of 44% of their revenues. Xilinx has a market cap of over $32B, and the combination of the 2 companies would create synergies. They are targeting an all-stock transaction which will have implications on my projections, but as time has gone, the $35B price tag is only a 10% premium for Xilinx. The one hurdle the companies have to pass is the regulatory procedures. We will have to wait and see if the deal goes through or not, as it’s expected the deal should be finished by the end of the year, with AMD shareholders retaining 74% of the new group shares and Xilinx holding the remaining 26%.\n\nAMD also offered great [guidance](https://ibb.co/n649gFm) for 2021 as they expect the strength of their product [portfolio](https://ibb.co/Xbx5TV4) to push AMD revenues up 37% over 2020 and also expect their gross margin to increase to 47%, while they expect an effective tax rate for next year of 15%, well belove the 21% US corporate tax rate.\n\nI have made some predictions based on the growth rate of the company, the latest plans announced by them and used some estimates and expectations. So, keep in mind this are only projections and are calculated by myself, this is not an investment advice and you should do your own research and so on…\n\nSo, let’s start with the Unleveraged discounted free cash flow [projections](https://ibb.co/hKFMswn) to see what the current valuation of the company is.\n\nI used their total revenues projections that we will discuss later on in the long-term projection and the net income for 2020 to which I added back the Depreciation &amp; Amortization costs they had in 2020 and got to a $1.68B EBITDA.\n\nFor the next years I used 1% increase in EBIT margin which I think they can achieve pretty easy and an increase in capex of 10%/year in order to maintain an increased production capacity while also applying a 15% decrease in their net working capital.\n\nSo, for an 8% discount rate, which is pretty much the Average SP500 return, we get a $9.7B Discounted Free Cash Flow by 2025.\n\nNow there are 2 methods of doing the valuation, either the perpetuity method or the EBITDA multiple method, but for both of them we do have to subtract or add the net assets or debt, which in this case stands $5.75B in assets. I personally think a use of the average is better suited for most companies, though some of the companies trade largely on the EBITDA approach and other on the growth approach.\n\nIf we use the growth approach, we can see that AMD is pretty fairly valued right now, as this implies a loss of 2%, while on the other hand the EBITDA multiple approach gives us a valuation of over $112, meaning an almost 30% undervaluation of the company. But as I said, I think a use of the average is best, so, my current price target for AMD in 2021 is $98.82, implying a 13.5% return from the last price.\n\nAnd now let’s move on to a longer-term valuation of the company based on the growth projections I have for AMD.\n\nFor my [projections](https://ibb.co/cx8pfhr) I actually just used their full year results and implied different growth rates for each revenue stream. I think we can continue to see 50% growth rate in the EEC segment for 2021 and then implying a gradual slowing of their growth, while for the Computing &amp; Graphics segment I implied a 35% growth, way lower than the over 100% they saw in 2020, also implying a gradual slowdown of the trend by 2025.\n\nI think these growth implications are pretty reasonable giving the high demand the company has seen for their entire product line, especially as gaming revenues have continued to increase, and also taking into account the need for their products in data centers, cloud usage &amp; digital currency mining.\n\nFor their cost of [sales](https://ibb.co/cx8pfhr), I started from the current ones which stand at 80% for the Computing &amp; Graphics segment and implied a 1% improvement each year, while for the EEC segment I started from the 88% expense margin right now and implied a gradual 2% improvement. I also maintained their other expense regarding to the cost of sales to 3% of their total revenues, in-line with the previous years.\n\nThis means for [2025](https://ibb.co/swQfJgf) we would get just over $33B in revenues and $26B in expenses, resulting in a gross profit of almost $7B. I also maintained the same capex as in the DCF and also [substracted](https://ibb.co/SshLk4K) the interest &amp; other expenses for which I implied a 5% annual growth, thus leading us to a $6.28B in earnings before tax.\n\nI [maintained](https://ibb.co/SshLk4K) their 15% effective tax rate projections and also diluted their shares by 1% each year accounting for some dilution in the stock.\n\nSo, for the $5.3B in 2025 revenues after tax and accounting for 1.27B shares, that would mean a $4.21 earnings/share, meaning the [stock](https://ibb.co/HYzfCkz) is trading at 20 times forward price to earnings for 2025.\n\nI like to base my future projections on Forward/PE valuations so, with the current projected PE and depending on what PE you assume for the stock between 25 and 40, the stock can trade between $105 and almost $168.\n\nSo, after all these estimates what are my price targets? [HERE](https://ibb.co/SyN8bn9) are my actual price targets\n\nI think the 2025 bear case price we can see AMD trade at is $115 which would imply a return of almost 33% , while my base case and my pretty safe assumption is that AMD will trade at 137$/share by the end of 2025, implying a 57% return on the current price. But my most bullish case would see the company trading at $158, which would imply a return of over 81%. So yeah guys, these are my Overall price targets for 2025, my bear case is an average of the 25 &amp; 30 PE ratio, while the normal case is the average between the 30 and 35 PE’s with the most bullish case valuing the company between a PE of 35-40.\n\nSo [HERE](https://docs.google.com/spreadsheets/d/1rkJLAXxwqbo6WEfR9NfPEKZagiW4EVbRsz58ejqTVEI) is the full spreadsheet that I have projected for AMD by 2025, if you do have another opinion or a suggestion please leave a comment down below, I think I have been conservative in most of my projections, but feel free to give your opinion.\n\nI think these are pretty reasonable [targets](https://ibb.co/9NTJYmP), as the semiconductors industry will keep on booming in the next decade, as the world will need more &amp; more chips that also keep advancing in technology.\n\nThe company also has very good financials, with almost $9B in assets vs just $3.1B in total liabilities, which can be easily paid by just the current assets.\n\nAnd let’s also take a look at what the estimates are from the [analysts](https://ibb.co/G0QpnrW). We can only see EPS estimates until 2023 of $3.22, which I think is safe to say can grow an additional dollar by 2025, so my projections are pretty in-line with what other experts anticipate.\n\nSo, what do I expect in the next couple of days, weeks and months for AMD?\n\nLet’s look at this [CHART](https://ibb.co/wQw6CQP), the stock just broke below the long-term uptrend but has seen good support at the $86-87 levels, which is where the next support should stand. We saw AMD pushing towards $100 in the beginning of the year, but it hit major resistance once Intel also announced a change in their leadership, as they brought in the WMWare CEO Gelsinger, but it’s very hard to see him turn around Intel in a very short time. Intel will need some years &amp; a lot of capital expenditure to turn things around, if they do manage to do it at all.\n\nAMD hasn’t been overbought since August, and currently has an RSI near 41, which is pretty oversold for a good company, so I expect to see them regaining some momentum in the near-term, but I guess the market is very busy with the current short-squeezes. AMD will se a lot of resistance breaking through the $100 level, not because of something fundamental with the company, but I guess it’s a psychological resistance rather.\n\nAnd let’s take a quick look at what 24 [analysts](https://ibb.co/bKRQwXP) on Wall Street are saying. They mostly have a buy call on the company with an average price target of $100 and a high price target of $135. So, I think the analyst are pretty spot on with AMD, but my PT are slightly lower as it’s always better to undershoot and overperform rather than the other way around.\n\nSo, what would I do? Well, I own AMD stock and I believe it still has plenty of room to grow, so I would start building a position right now and add on any weakness, and I would especially buy more if the stock drops even lower than 80$.\n\nOne last thing to mention about AMD is that they also have a very big % of their shares held by institutions, with over 74% of the float being held by big funds like Vanguard &amp; Blackrock which does significantly reduce the sell-off possibilities.\n\nSo, this are my projections and my expectations for the company, I think Lisa SU has done a terrific job since becoming the CEO, and has driven AMD to a renewed approach to their business, as the company has been booming in the past 5 years, growing more than twice as much as Nvidia and crushing the SP500 and Intel’s performance.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time!",
        "subreddit": "stocks",
        "title": "AMD Complete Stock Analysis &amp; Price Target Prediction",
        "url": "https://www.reddit.com/r/stocks/comments/laulsh/amd_complete_stock_analysis_price_target/",
        "created": 1612298429.0
    },
    {
        "author": "ABonafidePotato",
        "created_utc": 1612192565,
        "id": "la5ci3",
        "num_comments": 480,
        "num_crossposts": 1,
        "selftext": "I missed last year's incredible bull run in a lot of tech. I played the options market more and held cash. Now I'm looking for decent value holds. AMD's most recent earnings blowout has me pretty exciting that they're living up to the hype. As far as I can see their P/E was basically cut in half after their report last week. That, plus the fact that their stock has been dropping ever since makes me think this is an excellent dip to buy. \n\nAny thoughts or comments are appreciated. Just wanna discuss what everyone else thinks.",
        "subreddit": "investing",
        "title": "Time to go long on AMD?",
        "url": "https://www.reddit.com/r/investing/comments/la5ci3/time_to_go_long_on_amd/",
        "created": 1612221365.0
    },
    {
        "author": "PeanutInvestor",
        "created_utc": 1612295482,
        "id": "lb4nrp",
        "num_comments": 311,
        "num_crossposts": 0,
        "selftext": "AMD was another stock targeted in Robinhood's restricted stock list late last week. This is absurd as AMD is a major player amongst the chip-makers recently seeming to have surpassed Intel in marketshare. It's chips are used in both the PS5 and Xbox Series S/X, showing that it is a major player on both sides of the gaming community.\n\nRobinhood has created artificial selling pressure on AMD, while AMD's short interest has increased to 5.9% Not a ton of short interest, but this number has only recently grown in correlation with the limitations put into place by Robinhood. Coincidence? I think not! Corruption? Maybe a little bit.\n\nThere are also clear indicators that AMD will continue to gain market share in the GPU/Chip industry. As recently they had to diverge some production to Samsung as Taiwan Semiconductors could not produce enough fast enough. (Source:  [https://www.techradar.com/news/amd-might-solve-gpu-stock-woes-by-outsourcing-some-production-to-samsung](https://www.techradar.com/news/amd-might-solve-gpu-stock-woes-by-outsourcing-some-production-to-samsung))\n\nAlong with these basic facts reflecting on AMD's product portfolio, something essential to do; one can see they are boasting their strongest product portfolio line in years including their new 7 Ryzen 5000 chip that is for both mobile processors and desktops. Sales of the Ryzen chip grew 18% YoY, this had assisted in amazing earnings growth.\n\nAMD's Earnings Summary 2019 vs. 2020 showed Record revenue of 9.76 Billion up 45% from 2019. Their gross margin of 45% increased for the 5th straight year. Along with this Net Income and EPS doubled from the prior year. Finally operating cash flow was up to 1.07 billion a 117% increase YoY, and they had record free cash flow of $777 Million a 182% increase YoY. All together this makes for an extremely strong balance sheet with 2.29 Billion in cash, cash equivilants and short term investments.\n\nThe one major risk I see in AMD is that Microsoft, Amazon, and Apple all want to begin to create their own in-house chips. Along with this while AMD has surpassed Intel and is competing with Nividia, it could lose market share and fall behind. This company faced bankruptcy twice once in 2000 when the tech bubble popped, and again in 2012. However, I believe that this company will continue there exponential growth and have major gains in it's stock over the course of 2021 and see $100 by the end of February.\n\nHope this is all helpful!  \n\nDisclosure: I own 30 shares of AMD and will continue to hold for the years to come.",
        "subreddit": "investing",
        "title": "Why I believe AMD sees an All Time High in the coming months",
        "url": "https://www.reddit.com/r/investing/comments/lb4nrp/why_i_believe_amd_sees_an_all_time_high_in_the/",
        "created": 1612324282.0
    },
    {
        "author": "marakeshmode",
        "created_utc": 1612299992,
        "id": "lb6fnu",
        "num_comments": 248,
        "num_crossposts": 0,
        "selftext": "Hey guys,\n\nA lot of you don't know me, as I don't usually post here. I'm usually over at /r/AMD_stock posting DD there. But I'm posting here because the recent activity in the stock led me to realize a huge, glaring problem with the stock's performance and it's latest earnings.\n\nLet me step back a bit first.\n\nLast Friday the stock plummeted 12% after posting the best earnings it possibly could have posted. At AMD_Stock, we usually brush off the post-earnings crush and continue our bull plays (or the smarter ones wait until after earnings to get back in). But this post-earnings crush was different. For this earnings, there was zero fundamental reason why the stock should go down. The earnings were excellent, the margins were excellent, the guidance for 1Q21 was incredible, and the guidance for FY21 was almost double what the street was expecting. Yet the stock still went down. It went down from $94 pre-earnings to almost $84....*on the best possible news*. \n\nWhat more could the street have wanted? Did shareholders want a +60% revenue increase YoY, instead of just +40%? Did they want 3x year-over-year revenue in 1Q20, instead of just 2x? Did the street expect us to beat our FY20 targets by more than they anticipated? Did investors want the fab capacity issues to be completely resolved earlier than 2Q21? Did they want Milan to be released earlier than March '21? Was there any reason to sell off after an earnings as incredible as that? You could even see the [bewilderment](https://www.cnbc.com/video/2021/01/27/full-interview-with-amd-ceo-lisa-su-on-q4-results-product-pipeline-demand-and-more.html) on Lisa Su's face as she started an interview with CNBC the morning after.\n\nWhy? [No financial news](https://www.investors.com/news/technology/amd-stock-q4-2020-advanced-micro-devices-earnings/), not even [CNBC](https://www.cnbc.com/2021/01/26/amd-amd-earnings-q4-2020.html), could pin a 'reason' on the drop.\n\nAnd then I realized the problem. It's you.\n\nYou buy the cheapest AMD weeklies you can and hold them through earnings like it can't go tits up. You hope that AMD beats all expectations, and that the stock price skyrockets on your tendie-train choo-choo-ing to the moon. Post-earnings you sell your OTM calls just as they go ITM to some suck-ass broker-dealer, and go do some hookers and blow and make a golden shrine to Mama Su and thank her for your amazing luck. Good thing those stupid broker-dealers were so desperate to buy your calls just before expiry.. you would have bankrupted them if you held on to them any longer!\n\nThe day after earnings comes and you wake up and the price is down 5% and dropping. You sell immediately, because you can't see it recovering by Friday, when your calls expire. This causes MMs to sell the shares they bought as a hedge against selling you your calls. Stock goes down further. Other people sell their calls, and MMs sell more shares to reduce the hedge even more, on and on until Friday expiration rolls around and bag-holders let their calls expire worthless, along with their hopes and dreams.\n\nStop losing at AMD! How? *INVEST PROPERLY*\n\nHow? Buy and hold shares or LEAPS. Stop chasing the mythical overnight gains. AMD is a *long-term success* and it has [room to double](https://old.reddit.com/r/AMD_Stock/comments/l6jijo/rosenblatt_securities_says_amd_could_double_in/). DO IT NOW - Price is recovering from the crush, but are still trading at a [20% discount to analyst consensus](https://www.tipranks.com/stocks/amd/forecast), and at a 10% discount from it's recent highs.\n\nConclusion: This is a better buy-and-hold than GME, BB, or anything. AMD has grown continuously in the past 5 years and, if you read the DD on /r/AMD_stock, you'll discover that it also has an incredible growth roadmap the next 5 years.\n\nStop losing. Buy shares and double your money.\n\nPositions: 4800 AMD shares @ $27.96",
        "subreddit": "wallstreetbets",
        "title": "Stop buying AMD Calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lb6fnu/stop_buying_amd_calls/",
        "created": 1612328792.0
    },
    {
        "author": "JuniorConsultant",
        "created_utc": 1612313232,
        "id": "lbbcmv",
        "num_comments": 245,
        "num_crossposts": 0,
        "selftext": "Autist incoming. A lot of retards made their first trade with GME. Awesome and welcome!\n\nWith inexperience come a lot of psychological phallacies that Funds are exploiting:\n\n# BUY LOW SELL HIGH.\n\n*The. Core. Principal. Of. Trading.*\n\nYou never, ever sell when down. You don't. If you sell at loss you're literally **BUYING HIGH AND SELLING LOW!!!** If you don't 100% NEED this money RIGHT FUCKING NOW. Do. Not. Sell. It would be more entertaining literally burning money then selling at artificially low prices. NO ONE IS FORCING YOU TO SELL. If you're getting nervous about LOSSES ----&gt; DONT LOOK AT THE STOCK. DELETE YOUR APP. DO NOT GET STRESSED AND EMOTIONAL. You are not acting rationally when emotions get involved in trading. NEVER SELL EMOTIONALLY. Emotions are your enemy in trading and you WILL LOSE MONEY. If you're emotionally attached to your invested money, try avoiding any further trades until you're set up where you can (emergency fund, tax advantaged accounts etc. can help you feeling more secure).\n\nIt's negative today, it may be negative tomorrow. The DD still stands. GME as a company is in the spotlight of the world. It has a future.\n\nEven if there will be no short squeeze. DO NOT SELL AT LOSS. WAIT. 1 year, 3 years, 10 years. WHATEVER. It can get green again. IT CAN AND IT MAY. If you sell at loss, it wont.\n\nI KNOW THIS IS NO TYPICAL WSB (NON) ADVICE, BUT WITH SO MANY FUCKING RETARDS JUMPING IN WITH NO FUCKING CLUE WHAT THEIR DOING IT NEEDS TO BE SAID.\n\nSome more autistic shit\n\n# Percieved Value:\n\nRemember when you bought your shares. Let's say you bought at $300. You made the decision that this stock, its potential and emotional value, is worth $300 to you and you bought.\n\nNow the Price is artificially driven down. The beginning value hasn't changed. No one says that stock is worth less, unless you do. Unless you yourself decide that you're willing to sell at a lower price.\n\nWhen selling at $100 -&gt; YOU ARE SAYING IT'S WORTH THIS LITTLE. YOU DECIDE AT WHAT PRICE YOU'RE WILLING TO SELL. If you don't WANT to sell at $100 WAIT TILL YOU CAN SELL IT TO FUCKING MELVIN AT $6000.\n\nPlus: Loss Aversion\n\nA loss of 10% is emotionally more powerfull than a gain of 10%. They are preying on this effect to bring you to make an emotional decision to PANIC and sell at loss. WHICH ONLY MAKES SENSE IF YOUR GOAL IS TO LOSE MONEY.\n\n&amp;#x200B;\n\nHOLD TODAY\n\nHOLD TOMORROW\n\nHOLD FOREVER\n\nIF YOU NEED THE MONEY, WAIT FOR IT TO FUCKING TURN GREEN YOU IMBECILE.\n\n&amp;#x200B;\n\nTHIS IS JUST A DELUSIONAL AUTISTIC FUCK SPEAKING AND NO FINANCIAL ADVICE.\n\n&amp;#x200B;\n\nEDIT:\n\nSince WSB became a fucked up game of finding an imposter -&gt; I was active on WSB a while ago on a different account (MICRON, early AMD) and since moved to subs like /r/financialindependence /r/FIRE etc. and switched to low-cost index funds and mainly stick to this kind of investments and kept an eye on WSB for enterntainment. This account has since been deleted by me because friends of mine (and coworkers) got ahold of that accounts username. I had some history that was too personal for them to know about.\n\nI only moved onto the GME bandwagon out of spite, the moment BUY's got blocked on RH. This is the only and last \"WSB\" move I'm gonna do. \n\nIt doesn't have any meaning as I could write whatever, but my username is my job in the banking sector. I know people that work in HF's, used to work decades in HF's. I didn't quite believe what they told me about the possibilities they have. But now I do.\n\nBuy low, sell high is the foundation of any trade you do. Even GME. \n\nIf you thought this move would be a quick buck over a few days, no. If you bought after the surge, it just doesn't make ANY sense selling. NONE. You cut your potential of any breakeven, ever.\n\nEven if the short squeeze wouldn't happen due to highly illegal tactics by HF, GameStop has way more potential now than before. The company is in international spotlight, has an easy way to raise capital after the trade still, has global logistics... It still has potential as a company, if you sell now, you lose out on any chance of ever covering that loss.",
        "subreddit": "wallstreetbets",
        "title": "If you sell now, you don't understand the core principal of trading.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lbbcmv/if_you_sell_now_you_dont_understand_the_core/",
        "created": 1612342032.0
    },
    {
        "author": "sillyhands1",
        "created_utc": 1612190993,
        "id": "la4pt3",
        "num_comments": 232,
        "num_crossposts": 0,
        "selftext": "Haven't seen a post about something other than GME since this sub was flooded by millions of people, so I figured I would mention something new. AMD, yeah remember the company everyone seemingly forgot about despite posting huge growth consistently in 2020? Well they recently had earnings and suffered bigly along with most tech. Some highlights from their earnings:\n\n* Record revenue for the year with $9.76 billion in revenue\n* Q4 Revenue up 53% to $3.244 billion (also record quaterly revenue)\n* Gross profit up 53% to $1.451 billion\n* Net income up to $1.78 billion compared to $170 million a year ago\n* EPS up 867% (yes that is right) to $1.45 per share\n* Cash flow up to $554 million YoY\n* Q1 2021 guidance: 3.2B in revenue (79% YoY) and 46% gross margin\n* FY'2021 guidance: 37% increase in revenue YoY\n* Lets not forget their recent acquisition of Xilinx that will put them in a great position for the future\n\nSu bae has been delivering hard on her promises, and I see no reason for this momentum to not carry forward into 2021. They have gone on sale after earnings, and I can't wait to see what AMD has in store for 2021.",
        "subreddit": "wallstreetbets",
        "title": "Incredible AMD financial report that seemingly flew under the radar during all these GME posts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la4pt3/incredible_amd_financial_report_that_seemingly/",
        "created": 1612219793.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612184950,
        "id": "la2oov",
        "num_comments": 147,
        "num_crossposts": 0,
        "selftext": "**Stocks end their worst week since October at their lowest point on Friday. Is the Short-Squeeze Over? Over 100 companies report earnings this week. Let’s talk about this &amp; other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of Friday as we saw the stock market finish with another sell-off, as the big 3 indices finished with the worst week since late October with the [SP500](https://ibb.co/Vpq92y3) losing almost 2%, the [Nasdaq Composite](https://ibb.co/yN3b3RQ) losing exactly 2% and the [Dow Jones](https://ibb.co/D7Cy2YQ) shedding 620 points and dropping below 30k. All 3 of them finished the week down more than 3% as the [VIX](https://ibb.co/cgz4N3r) spiked yet again on Friday, rising by almost 10% and finishing the week up more than 40%.\n\nWe saw over 70% of the companies declining [Friday](https://ibb.co/G3rX22D), as the number of companies trading above the 50-day moving average dropped under 50%, with all 11 [sectors](https://ibb.co/HKhY6hC) finishing in the red again, as Energy &amp; Tech were the biggest losers. \n\nSo, let’s take a look at the HEAT MAP from [Friday](https://ibb.co/jVFqVbH). It’s really hard to find any gaining companies, with big tech companies selling off yet again, as most of the small gainers were found in the Health Care sector. For the [WEEK](https://ibb.co/5Y5HR4q)  though, Microsoft was the only big tech name that managed to gain ground after smashing the earnings report, while most of the stock market faced sell-off pressures as the short squeeze mania might have pushed investors into a risk-off approach.\n\nWe also got some economic data on Friday as the December personal disposable [INCOME](https://ibb.co/Khyh7mP) increase by 0.6%, more than expected as this mostly reflected an increase in social benefits &amp; compensations, with the Q4 employment cost [INDEX](https://ibb.co/QcqbM5y) also rising by 0.7% to close out the year.\n\nMeanwhile we saw the Consumer Sentiment [INDEX](https://ibb.co/pX3mFgt) coming in at 79, slightly lower than expected, as this was also seen in the December pending home sales [NUMBER](https://ibb.co/m4tbnWN), which also came in with a 0.3% decrease month/month.\n\nThis week we have somewhat of a quiet economic [CALENDAR](https://ibb.co/LvYY84v), with a couple of interesting numbers through the week, while [EARNINGS](https://ibb.co/rxmpwVK) take center stage yet again, with interesting reports coming from companies like Amazon, Google &amp; Alibaba on Tuesday, while Wednesday we hear from PayPal, Qualcomm &amp; Spotify. We also get earnings reports from some recent favorites like Pinterest, Snap, Ford, Peloton and Penn on Thursday as the earnings season with over 100 companies from the SP500 reporting, might help push the stock market higher after the sell-off last week.\n\nIn some other stock market news, we saw [NIO](https://ibb.co/C0CSdJJ) reporting a new monthly record with 7225 vehicles delivered in the first month of 2021🚀🚀🚀, an increase of more than 350% Y/Y as the company is still ramping up production in an attempt to challenge Tesla’s EV dominance. Nio has had a huge run in the past months but has a long way to go to grow into the big valuation, though the trajectory of the company looks very promising.\n\nMeanwhile the biggest development in the markets was the trading platforms [imposing](https://ibb.co/y5sPVJv) restrictions on the squeezed stocks and even many other stocks that didn’t have such a big short % of the float with big names like AMD, Starbucks &amp; Moderna being affected. These restrictions were reduced back to only 8 companies [Sunday](https://ibb.co/GV5TKxf), but are still limited to whole share aggregate buy limits on the crowd favorites🚀🚀🚀.\n\nThe recent moves in the stock market have made some big changes in the social world as Steve Cohen deactivate his [Twitter](https://ibb.co/0KK2P59) 🚀🚀🚀, while a recent [survey](https://ibb.co/Mf6V8tz) showed that more than ¾ of respondents are planning on leaving RBNHD while 13% already did it, with the limiting tactics being probably the biggest reason for retail investors to make this change.\n\nInteractive [Brokers](https://ibb.co/JzR5qCC) also re-opened trading on these names on Sunday, which brings to question if these platforms have insider knowledge of the future of the stocks, or did they just increased their liquidity just like [RBNHD](https://ibb.co/P6WXwDj) after they raised more than $1B earlier in the week.\n\nSo… I think the stock market is still very volatile and the short squeezes can keep on going for an unknown period of time as markets can act in an unusual pattern for longer than anyone can anticipate, or the short squeeze can vanish in a second… this one is very hard to predict… Yes, keep the pedal to the medal in the hot stocks🚀🚀🚀🚀🚀 but also stay invested in great companies as good earnings reports haven’t helped most stocks again this quarter, but may provide good buying opportunities for the long-term.🚀🚀\n\nAnd finally, let’s hope for a good day in the markets as the US [FUTURES](https://ibb.co/wc2P16r) are pointing to a good open with the Nasdaq leading the way as we await to see the Manufacturing Indexes numbers in the early [morning](https://ibb.co/LvYY84v).\n\n**Thank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗**",
        "subreddit": "wallstreetbets",
        "title": "Stock Market News for Today | Is the Short Squeeze Over? NIO &amp; other Stock Market News [02-01]🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la2oov/stock_market_news_for_today_is_the_short_squeeze/",
        "created": 1612213750.0
    },
    {
        "author": "shortymcsteve",
        "created_utc": 1612199987,
        "id": "la8gys",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "On Friday Robinhood went after WSB’s first love Suebae. \nUsers were limited to buy only ONE share of AMD after they announced a record quarter. Why??? \n\n&amp;nbsp;\n\nLet’s see - AMD is heavily invested in by big funds. AMD announces a record quarter, the stock begins to sell off!? Many people on r/amd_stock theorise this is institutional money trying to liquidate cash and take profits after getting hit by GME. \n\nBut wait, AMD short interest just rose from [52m to 107m.](http://www.reddit.com/r/AMD_Stock/comments/l7uw06/short_interest_on_amd_has_doubled_from_52_million/ ) Up over 50% in 2 and a half weeks after the company grows 50% and produces record results..\n\n\n\nThen Robinhood adds AMD to the list of stocks you can only buy a limited amount of and limit it to ONE share. Wtf? \n\n\nAMD isn’t part of any of the massive shorting going on in the market and is a pretty stable company. So why would they do this? Oh right, because AMD is one of the most held stocks on RH and many young investors like the company on a consumer level. So while it’s at a discount they want to stop you buying in so their buddies with the short positions can load up and get their money back after getting wrecked by GME, AMC and other heavily shorted stocks. \n\n&amp;nbsp;\n\n**Here’s what’s happening:**\n\nFunds with large positions in AMD are shorting the stock before selling off stock they previously held. This drops the price and they collect a nice bonus on the way out. \nThe short interest in the stock has increase drastically by over 50%, and of course between earnings and RH limiting trading we saw a number of hit piece articles with false information about AMD. But weirdly enough no one report on the leaks that [AMD are now powering Tesla’s in car game console/entertainment system.](http://www.reddit.com/r/AMD_Stock/comments/l749ia/patrick_schur_picture_confirms_tesla_uses_navi_23/) Last time there was even a rumour of AMD supplying Tesla the stock went vertical. \n \n\nI’m sure the OGs here remember the blatant manipulation that happened with this stock back in the days when it was $2-$20. People like Goldman would downgrade the stock, load up on stock and wait for it to rally, sell, and then downgrade again.\nThese guys are back using AMD as their personal money printer because they just got wrecked.\n\n&amp;nbsp;\n\n**Oh, and you know who happens to own 2.1m shares in AMD? That’s right, [MELVIN CAPITAL.](https://fintel.io/so/us/amd)**\n\n&amp;nbsp;\n\nBut here’s one thing RH didn’t think about. \nXilinx is about to be acquired by AMD in an all stock deal, this means both stocks move in unison with each other. And more importantly, the daily average trade volume of Xilinx is only 3m compared to AMDs 45.15m\n\nThis means if a number of people decide they like Xilinx stock, AMD will follow far faster than if they decided to simply like AMD stock. And since there’s no limits on Xilinx people can currently like the stock as much as they want.\n\nSide note - If you *really* like Xilinx and hold until the deal is complete, you will be given 1.734 shares in AMD for every Xilinx share you own. If this deal happened right now at current prices, this means you would make around 10% on your investment compared to just holding the same amount in AMD.\n\n&amp;nbsp;\n\n**Please note:** I am not a financial advisor, just some long term WSB member here to explain that if everyone jumped into Xilinx instead of AMD the shorts would get pretty screwed. They think they found a way to make their money back, it would be pretty nice if they didn’t. \n\n&amp;nbsp;\n\n**HOLD GME**\n\n**LIKE XILINX (if you want I’m not a financial advisor)**\n\n**DESTROY THE SHORTS**\n\n**FUCK ROBINHOOD**\n\n&amp;nbsp;\n\nAlso, shoutout to [Hothardware for being the only news website talking about this](https://hothardware.com/news/amd-robinhood-gamestop-gme-shorts-wallstreetbets\n). \nSomething is very wrong here and we need everyone to know it.\n\n&amp;nbsp;\n\nTL;DR; - GO READ IT, STOP BEING LAZY. THIS IS IMPORTANT AND EVERYONE NEEDS TO KNOW. *YOU HAVE TO UNDERSTAND.*\n\n🖐💎🖐 🚀🚀🚀🚀🚀🚀🚀🚀🚀🖐💎🖐",
        "subreddit": "smallstreetbets",
        "title": "😡THE SHORTS ARE HIDING IN AMD😡",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/la8gys/the_shorts_are_hiding_in_amd/",
        "created": 1612228787.0
    },
    {
        "author": "PkPkKbKb",
        "created_utc": 1612238818,
        "id": "lan0id",
        "num_comments": 125,
        "num_crossposts": 0,
        "selftext": "So I saw headlines about semiconductor demand far outpacing supply. There’s also news of Intel finally giving up and no longer taking losses trying to make chips. \nCars have created an especially huge demand for semis and virtually every car now needs one. \n\nhttps://www.extremetech.com/extreme/319627-semiconductor-shortage-could-cost-automakers-61b-in-lost-sales\n\nhttps://www.google.ca/amp/s/mobile.reuters.com/article/amp/idUSKBN29T04V\n\nI came across TSM Taiwanese Semiconductor Manufacturers which had just over 50% market share. Their biggest customer is Apple. \n\nhttps://csimarket.com/stocks/competitionSEG2.php?code=TSM\n\nNow, I couldn’t believe the numbers I saw for TSM. I figured every site was wrong because the following cannot possibly be true: \nMarket Cap- 571 billion\n2020 revenue - 1.4 Trillion (yes trillion). the revenue is up 30% from 2019 (yes during a pandemic). \nEarnings- 530billion.  \n\nThis means that they are trading at 1:1 P/E ratio. \n\nCompare that to AMD (106bil market cap - 2.5billion earnings - 38 P/E and NVDA 321marketcap - 2.8bil earnings - 140 P/E.\nIntel has market cap of $230bil - $20bil earnings - 11 p/E\n\nSo shouldn’t TSM have a market cap of at least 5 trillion?? How is no one talking about the fact that their revenue during a pandemic is 1.4 trillion with profit margin of 40%??? \n\nI think there are some seriously sweet tendies to be made. The IV is pretty low and you can get 2022 calls with a 200 strike for $5. Or a 2023 call with 200strike for $12. \n\nSomeone please explain how this is possible and what I am missing. This is a no brainer. \n\nAlso, for the first time ever, TSM will be building a plant in the USA \n\nhttps://www.google.ca/amp/s/www.fool.com/amp/investing/2020/11/25/intels-ceo-just-asked-joe-biden-to-do-this/\n\nLastly, Biden has a phone call with TSM this Friday.\n\n\nEDIT: thank you for pointing out that my numbers were in TWN not USD.  I effed up.  Still a great company.",
        "subreddit": "wallstreetbets",
        "title": "Semiconductors very undervalued. Here’s my DD.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lan0id/semiconductors_very_undervalued_heres_my_dd/",
        "created": 1612267618.0
    },
    {
        "author": "watchmaking",
        "created_utc": 1612257662,
        "id": "lars2w",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "I know the squeeze is historic and important, but I'm legitimately tired of seeing nothing else but GME on this subreddit. I know some of you are new and excited for this \"once in a lifetime opportunity\" and I respect that, but there are still many other great companies to invest in and we have some very autistic people ready to provide some delicious DD for us to YOLO with. I'm not talking about meme stock DD but legitimate, quality DD on real companies with real value like for example AMD, NVIDIA, AMZN etc. Please stop using this sub as your personal GME echo chamber!",
        "subreddit": "wallstreetbets",
        "title": "Can we please stop downvoting everything that isn't GME?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lars2w/can_we_please_stop_downvoting_everything_that/",
        "created": 1612286462.0
    },
    {
        "author": "Flashy421",
        "created_utc": 1612296856,
        "id": "lb57jp",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "So my last post simply talked about my play on Corsair and there seemed to be a lot of disagreement so here's my actual DD behind it. Also before we get into this, for all the Logitech nerds on my last post, nobody cares that your mom bought you a $10 Logitech keyboard and you like the noises it makes, it doesn't change the fact that Corsair have better quality products for pretty much everything besides mice(my opinion).\n\n&amp;#x200B;\n\nOk so first things first, we all know that the gaming industry as a whole had boomed due to COVID and has had an increasing TAM for quite some time now and is projected to continue its growth. For that reason alone I'm bullish on a lot of gaming companies other than a few that I believe have way too high of a valuation.\n\n&amp;#x200B;\n\nLets start with marketing. If any of you have as poor of a social life as I since COVID started then you'd know that Corsair has been very active in social media marketing/sponsorships on Twitch. It feels like I keep seeing more and more streamers show sponsor slides of Corsair gear. This is amazing because in my personal opinion, I believe Twitch and YouTube sponsorships is easily one of the best ways to promote your products(referring to gaming products only). Just look at recent games that have all blown up, Fortnite, Apex Legends, Warzone, and Rust have all blown up due to their large presence on Twitch. Apex Legends and Rust quite literally paid streamers to play the game and look at how well that worked out for them.\n\n&amp;#x200B;\n\nNext up we'll take a look at financials, don't worry I'm not going to sit here and tell you to do your full in depth fundamental analysis reasoning report but I do think we should at least pay attention to it. Even before COVID and still during COVID Corsair has increased revenues, net income, and cash flow. This just adds extra proof that its not like Corsair was a failing company before they got the boost from COVID. Another major positive would be that Corsair has increased focus around R&amp;D which has only proven to significantly help tech companies move ahead of their competitors and acquire more market share. Just a couple companies that also focused R&amp;D would be Tesla(all praise father Elon) and AMD. There's obviously more to the financial aspect however I'd rather not sit here and type out their entire 10-K in a reddit post.\n\n&amp;#x200B;\n\nLastly, I think with all DD you must point out the negatives as you go along. As I stated before, Logitech definitely beats Corsair when it comes to mice. However, I typed this entire post without using a mouse so who really cares about mice. Secondly, Corsair's CEO is Andy Paul. How can you put a billion dollar company in the hands of a man with two first names and to be honest, I don't know how they do it. Although that is definitely a big negative, their logo is extremely cool which I think makes up for it.\n\n&amp;#x200B;\n\nThank you for your time, now lets preheat this oven and start baking some tendies!\n\n&amp;#x200B;\n\nNote: Logitech fanboys please don't attack me in the comments, I don't care about your mice, just leave me alone and go play pong or something with your amazing mouse.",
        "subreddit": "wallstreetbets",
        "title": "CORSAIR TO THE MOON?!🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lb57jp/corsair_to_the_moon/",
        "created": 1612325656.0
    },
    {
        "author": "SirWhorshoeMcGee",
        "created_utc": 1612266425,
        "id": "latshl",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "I bought some measly amount of AMC and GME and didn't get out in time. I'll see how will today go, and if it's bad I'll just cut my losses, because I'm not a fool. (not saying that people who are holding are, I'm just in this for the money, not to fight a battle we can't possibly win, because the economy is rigged)\n\nI'm thinking about investing in other companies, most likely nVidia and AMD, since it's likely we'll see mid range models of their new GPU and CPU series soon. Any advice on the stock you guys think might be good to invest in?\n\nEdit: lots of comments seem to be shadowbanned (?), so if I didn't reply, send me a DM.",
        "subreddit": "stocks",
        "title": "What to invest in once the dust settles?",
        "url": "https://www.reddit.com/r/stocks/comments/latshl/what_to_invest_in_once_the_dust_settles/",
        "created": 1612295225.0
    },
    {
        "author": "Tomtanks88",
        "created_utc": 1612282331,
        "id": "laz9rr",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "So what is happening with BB amd AMC exactly? Sorry am a noob",
        "url": "https://i.redd.it/nqaszy8m93f61.jpg",
        "created": 1612311131.0
    },
    {
        "author": "Arch-",
        "created_utc": 1612283016,
        "id": "lazkjm",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "after the earning report, AMD showed higher than predicted earnings, however right after the market opened price dropped like crazy, any ideas on why this happened? I see no articles or anything discussing this",
        "subreddit": "stocks",
        "title": "why is AMD not doing so well after the earnings report?",
        "url": "https://www.reddit.com/r/stocks/comments/lazkjm/why_is_amd_not_doing_so_well_after_the_earnings/",
        "created": 1612311816.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612244405,
        "id": "laomif",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Shorting AMD. DD inside.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laomif/shorting_amd_dd_inside/",
        "created": 1612273205.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612183681,
        "id": "la2awb",
        "num_comments": 45,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "AMD DD / Stock Analysis 🚀🚀🚀 [Technical, Fundamental &amp; DCF] &amp; $AMD Stock Forecast [Short &amp; Long Term]🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la2awb/amd_dd_stock_analysis_technical_fundamental_dcf/",
        "created": 1612212481.0
    },
    {
        "author": "SpinningGecko",
        "created_utc": 1612225885,
        "id": "laiuge",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "So like the title, I'm thinking about whether AMD will be a good investment. Reading up on AMD and what they're doing they seem pretty strong on the incline, however I'm still on the fence with it. I'm wondering what othee people think of AMD? 👍",
        "subreddit": "stocks",
        "title": "$AMD good for a long term investment?",
        "url": "https://www.reddit.com/r/stocks/comments/laiuge/amd_good_for_a_long_term_investment/",
        "created": 1612254685.0
    },
    {
        "author": "Barmin93",
        "created_utc": 1612266157,
        "id": "latq8p",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "I'm not very experienced trader, but... Here are my thoughts long-term investments:\n\n1. NOKIA  (I think in \\~5 years 5G tech can help them pivot a little bit,  besides... 20B cap market and \\~5$ shares seems extremely undervalued) .\n2. AMD  - I think it will go up and their tech is solid, although... Apple and  new M1 chips (Apple Silicon) makes me doubt, about if Apple will use AMD  in the future and if not - that might be a nice dip possibility to buy  in.\n3. Rolls-Royce,  which is like 0.9$ a share now. It's really low and I figured... They  are making Jet Engines right? Wouldn't they prosper a little better in  next 3-5 years? But more research is needed in this one for me. I'm  Software Engineer so... Nokia and AMD is something, that I understand  and see potential. As for this - I'm not really sure. More of a guess.\n\nOverall,  I still don't know what is my view point on stock market in 2021.  After crazy 2020, I thought that some slight correction of 10-15% on the  whole market is possible, so... I try to be very cautious with  investments now.  If it will happen... Then I'm all  in :P But will it? I don't know.",
        "subreddit": "stocks",
        "title": "What are your thoughts on the best investments now?",
        "url": "https://www.reddit.com/r/stocks/comments/latq8p/what_are_your_thoughts_on_the_best_investments_now/",
        "created": 1612294957.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612173271,
        "id": "l9zpga",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "AMD is getting bullied, can WSB help? Make AMD Green Again!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l9zpga/amd_is_getting_bullied_can_wsb_help_make_amd/",
        "created": 1612202071.0
    },
    {
        "author": "PolymorphicCode",
        "created_utc": 1612251410,
        "id": "laqdbz",
        "num_comments": 40,
        "num_crossposts": 1,
        "selftext": "Hello everyone\n\nI started trading back in september and I put more or less blindly some money in stocks of companies I know of. AMD, Microsoft, Apple, for example.\n\nMy reasoning with Microsoft for example was this:\n\nThey are one of the largest companies in the world and the have contracts with many governments. There was a new Xbox coming up, they bought Bethesda and they are doing great things with their dotnet framework.\n\nWhen I looked at a few DDs here and there I saw so much more information and numbers. So many numbers. What are the numbers I should be looking for? What are the good and the bad numbers?\n\nHow do you find companies to do your DD for? I'm a nerd, I only know about tech companies, should I look into other fields as well?",
        "subreddit": "stocks",
        "title": "How do you do your DD? And how do you find stocks to invest in?",
        "url": "https://www.reddit.com/r/stocks/comments/laqdbz/how_do_you_do_your_dd_and_how_do_you_find_stocks/",
        "created": 1612280210.0
    },
    {
        "author": "Ant_Party",
        "created_utc": 1612205074,
        "id": "laam5u",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Melvin thinks we don’t see what he’s doing. We will not let the tower fall 🚀 AMD, GME 🚀 Promise land here come 🚀",
        "url": "https://v.redd.it/fj74htbcvwe61",
        "created": 1612233874.0
    },
    {
        "author": "Ant_Party",
        "created_utc": 1612284108,
        "id": "lb01ao",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME 🚀 AMD 🚀 Melvin and his boyfriend Robinthehood can’t stop us!",
        "url": "https://v.redd.it/5vfg68kne3f61",
        "created": 1612312908.0
    },
    {
        "author": "Joe_Biggles",
        "created_utc": 1612234189,
        "id": "lallkn",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Get your AMD calls before it's too late. Probably already is too late. That insane selloff of AMD was just that - insane. Looks like we've got new support at \\~$87 and I expect it to climb away. \n\n&amp;#x200B;\n\nI like the stock.",
        "subreddit": "stocks",
        "title": "Get on your AMD Calls",
        "url": "https://www.reddit.com/r/stocks/comments/lallkn/get_on_your_amd_calls/",
        "created": 1612262989.0
    },
    {
        "author": "galacticPerson",
        "created_utc": 1612334706,
        "id": "lbhpbo",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "I've been eyeballing AMD for a while but have only recently really gotten enough cash to do anything about it. I'm gonna be shipping to basic for the USAF in \\~4 months so I was just wondering if it's safe to drop \\~500-1k in AMD as a long-ish term investment.\n\nThey've been trending up consistently and their new products are selling really well so far but was wondering if anyone had some insight onto whether or not this is a good idea?\n\nAlso, if there's any other stocks I should be aware of for long-ish term investment I'd love some recommendations.",
        "subreddit": "smallstreetbets",
        "title": "Smart to do a little long term investing in AMD or no?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lbhpbo/smart_to_do_a_little_long_term_investing_in_amd/",
        "created": 1612363506.0
    },
    {
        "author": "Whiskerfield",
        "created_utc": 1612263521,
        "id": "lat35z",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "I have been a long-term investor of AMD over the past few years and I have been rewarded immensely for it. But a trend I have been noticing for the past half-year is that despite meeting and beating expectations and guidance, high-growth stocks in the semiconductor sector seems to have hit a wall in SP. In particular, I am not just referring to AMD but NVDA as well. On the contrary, stocks with higher earnings but lower growth seem to be regaining momentum, most notably Intel, MU, TSM and others.\n\nThis has led me to exit my AMD position and take a serious look at the stock market as a whole. Over the past half-year, there has been an unjustified exuberance in EV stocks. I don't think it takes much convincing to see that the SP of multiple EV stocks (most notoriously TSLA) seem to be out-of-whack with reality and future expectations.\n\nThis has led me to think that more rational investors are either exiting the market or moving into stocks with lower growth/risk. If the EV bubble is being propped up by inexperienced investors that are not trading in-line with fundamentals, then a market correction could easily accelerate into a crash for these stocks. And investors moving into low-risk stocks prior to a crash has precedence as well (dot-com bubble). \n\nOne more bit that has me thinking: The GME and related meme stocks seem to be crashing and the shorts and more rational investors seem to be regaining the upper hand. This could serve as a momentum for others to re-look their investments in very risky and overvalued assets. Could this be the trigger for the EV bubble popping?",
        "subreddit": "stocks",
        "title": "Is the EV bubble popping and a market correction/crash coming soon?",
        "url": "https://www.reddit.com/r/stocks/comments/lat35z/is_the_ev_bubble_popping_and_a_market/",
        "created": 1612292321.0
    },
    {
        "author": "ifoundyourtoad",
        "created_utc": 1612309924,
        "id": "lba94y",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Hello there,\n\nBeen lurking a while and I guess with all this GME craziness I have more confidence. Anyways, I'm finally in a comfortable position where I feel comfortable investing into the stock market. I do have my 401k, but my wife and I have some extra income that I have convinced her to put towards investing. \n\nI'm still learning more on stocks, but I don't want to just go diving into it yet, but I also don't want to just lose out on money. \n\nMy idea was I would put in probably $2k right now and then attempt to put in $300-500 a month towards the VGT ETF (Information Technology), it has seen great returns and they are invested in some great stocks (AMD/Apple). Is this a normal practice or should I try and put that 300-500 a month towards other ETFs or smaller stocks? I just feel the most comfortable with this ETF the others have me a little more worried. \n\nIs this tactic a good tactic or am I totally off base? \n\nI'm also doing paper trading while I research and hypothetically investing here and there to see if my researching is going well and GSM is looking good on paper at least! lol.\n\nEdit: no idea why but it will not let me see comments on my post.",
        "subreddit": "stocks",
        "title": "Diversification with ETFs? Not sure if I should spread out more within ETF's or focus more on one I really really trust which is VGT.",
        "url": "https://www.reddit.com/r/stocks/comments/lba94y/diversification_with_etfs_not_sure_if_i_should/",
        "created": 1612338724.0
    },
    {
        "author": "austinstain",
        "created_utc": 1612188394,
        "id": "la3smm",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD: Time to Buy This Hot Growth Stock | The Motley Fool",
        "url": "https://www.fool.com/investing/2021/01/31/amd-time-to-buy-this-hot-growth-stock/?source=eptyholnk0000202&amp;utm_source=yahoo-host&amp;utm_medium=feed&amp;utm_campaign=article&amp;yptr=yahoo",
        "created": 1612217194.0
    },
    {
        "author": "DogeWeTrust",
        "created_utc": 1612321857,
        "id": "lbe3wo",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I want to buy a stock which is currently at $X price which i think is undervalued.\n\nI checked the option strikes and see their highest put is marked at $Y. However the breakeven price is a tad smaller than the current price right now.\n\nWhats the benefit of this play. Im bullish about the stock but im holding mid term so I won't hold too long. Other than the fact this stock could even drop further, what is wrong with the play where you set a huge put sell which will be guaranteed to be exercised amd the breakeven is within the price range you're looking at?",
        "subreddit": "options",
        "title": "Bullish on a stock. Buy it by selling Put?",
        "url": "https://www.reddit.com/r/options/comments/lbe3wo/bullish_on_a_stock_buy_it_by_selling_put/",
        "created": 1612350657.0
    },
    {
        "author": "shortymcsteve",
        "created_utc": 1612268259,
        "id": "lau942",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "😡THE SHORTS ARE HIDING IN AMD😡",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/la8gys/the_shorts_are_hiding_in_amd/",
        "created": 1612297059.0
    },
    {
        "author": "afrikanmarc",
        "created_utc": 1612207354,
        "id": "labknb",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hey everyone I have been searching the internet for help but can't seem to find anything. \n\nAround 2001/2002 I purchased shares of AMD . I don't remember what online broker I used and the email associated with that (Yahoo Mail) had all the emails deleted due to inactivity. I have been searching for a list of online firms from that time but can't seem to find what I am looking for. \n\nWhatever broker I used would have had either free or very low trades and no minimum deposit. I was real broke back then and there is no way I would have been able to do $500+ Minimum deposits. \n\nAny suggestions or help is much appreciated.",
        "subreddit": "stocks",
        "title": "HELP - Early 2000s trading platform.",
        "url": "https://www.reddit.com/r/stocks/comments/labknb/help_early_2000s_trading_platform/",
        "created": 1612236154.0
    },
    {
        "author": "moduhlize",
        "created_utc": 1612267693,
        "id": "lau40m",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Intel has been losing some ground to AMD over time. A big reason is that their current CEO is a guy who has a finance background (was CFO in the past for different companies), their incoming CEO has a more technical background (he was even CFO of Intel at one point, but left to be CEO of VMWare but is coming back to be CEO of Intel). \n\nI don't really plan on buying Intel until I look at their financials and stuff (haven't done that yet), but I wanted to see people's thoughts on the future of Intel - positive and negative. Thanks!",
        "subreddit": "stocks",
        "title": "What are your thoughts on Intel?",
        "url": "https://www.reddit.com/r/stocks/comments/lau40m/what_are_your_thoughts_on_intel/",
        "created": 1612296493.0
    },
    {
        "author": "mt4h",
        "created_utc": 1612337975,
        "id": "lbigt3",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "DFV has said all along that he just likes the stock. He has only accrued more amd more as the stock shot up. It wasn't until it peaked last week that he unloaded anything. He's in it for the long haul and sees value in the company. He's cashed out what, 23 million? He's not selling any more on the way down. If he really believes in GME, he's waiting for the new bottom to get more shares. With all the hype dying down, when will he buy? 50? 40? At 40, he could reinvest 8 million and double his position (assuming he eventually exercises his options). 💎👐",
        "subreddit": "Wallstreetbetsnew",
        "title": "When do you think deepfuckingvalue will re-enter GME?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lbigt3/when_do_you_think_deepfuckingvalue_will_reenter/",
        "created": 1612366775.0
    },
    {
        "author": "maxfort86",
        "created_utc": 1612363772,
        "id": "lbp4ds",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Mandatory pledge of allegiance to GME: I was in GME before it was cool. Did both [DD](https://www.reddit.com/r/wallstreetbets/comments/k4cpbf/calculating_what_the_gme_price_should_be_for/) and [memes](https://www.reddit.com/r/wallstreetbets/comments/ktb2ms/gme_ryan_cohen_short_squeeze/).\n\nNow back to the issue at hand:\n\nA while back while reading the comments on an $NNDM DD in here, I came across a guy who said $NVMI is even better than NNDM but he's not going to write a DD on it or promote it any other way on WSB. Since I like forbidden fruits, I went ahead and did my own research on the company. I'm sharing the results with you:\n\nNova Measuring Instruments is an Israel-based company (with 18 offices worldwide) that provides metrology solutions (devices and software) for advanced process control used in semiconductor manufacturing.\n\nMetrology means measuring, and in this context, super precise measuring (nanometer or smaller) required for semiconductor manufacturing. The company's metrology solutions use technologies including Optical Scatterometry, x-ray photoelectron spectroscopy (XPS), x-ray fluorescence (XRF), scatterometry modeling software, and high-performance computing. The company holds 30 patents in this field.\n\nMarket cap: \\~2.2 Billion\n\nP/E ratio: \\~42\n\nHas beaten earning expectations in the past 4 quarters (didn't check further back)\n\nThe stock price has grown almost 100% in the last year, which is good but nothing compared to NNDM, for instance, which has grown 540%.\n\nDaily volume is low (about 150,000)\n\nIn a recent (Jan 28, 2021) [press release](https://www.novami.com/investors/press-releases/nova-receives-multiple-materials-metrology-orders-from-leading-logic-and-foundry-customers/), the company announced that it \"received multiple orders from multiple leading Logic and Foundry customers for its most advanced materials metrology solutions.\"  They don't name the new clients, but could one of them be $TSM?\n\nAnyway, we know that all sorts of trendy technologies such as EVs, AI, Cloud, etc. need processors and memory devices, which brings our attention to companies such as $AMD, $INTC, $ON, and $TSM. But these companies in turn need precise measuring devices for their process control, and NVMI is the leader in that area.\n\nThe company's technology/patents can also be useful in 3D printers that print precise things (again, such as NNDM).\n\nI did a quick search and it seems no one has done a DD on this in WSB. I think it has great growth potential both short term and long term. Once WB is over the BANG stocks, this is something worth a look at. IMO, it will be similar to stocks like MGNI and SE that consistently move up without much buzz around them on WSB.\n\n&amp;#x200B;\n\nTechnicals:\n\nI don't know much about technicals but according to tradingview, it's neutral based on oscillators, and strong buy based on moving averages.\n\n&amp;#x200B;\n\nMy positions:Stocks80C 5/21/2021\n\nThe options market for this stock is low volume and there are large gaps between bid/ask prices, so I suggest going with the stocks.",
        "subreddit": "wallstreetbets",
        "title": "NVMI: a hidden gem with great upside potential",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lbp4ds/nvmi_a_hidden_gem_with_great_upside_potential/",
        "created": 1612392572.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1612238399,
        "id": "lamvn9",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "“Watchlist 2-2-21\n\nAsian stock markets extended gains on Tuesday on increased optimism about stimulus packages and global economic recovery, while retail investors retreated from GameStop and their new-found interest in gold and silver. Markets were buoyant ahead of negotiations Tuesday between U.S. President Joe Biden and Republican senators on a new COVID support bill. The GOP's $618bn stimulus plan released early Monday was about a third the size of the President's proposal. Top Democrats later on Monday filed a joint $1.9 trillion budget measure in a step toward bypassing Republicans.\n\nCONTINUATION REVOLUTION PLAYS/Backburners (DIAMOND HANDS!!!): \\^NAKD \\^NOK\n\n\\^CTRM \\^AMC \\^GTE \\^AAL \\^BB \\^GNUS \\^AAPL \\^ZOM \\^NAK \\^CEI \\^GBR \\^GE \\^GHSI \\^PLTR\n\n\\^EXPR \\^XSPA \\^M \\^CCL \\^BBBY \\^GME \\^PED \\^RCON\n\nPrecious Metals (SILVER AND GOLD):\n\nSILVER: #ASM #SVM #AG #EXK #FSM #MAG #PAAS\n\nGOLD: $TRX - On last night’s watchlist ran about 20% today! Watch for more as the gold and silver rush continues!\n\nSympathy: #HL #AAU #CDE #THM #GAU\n\nChina Stocks:\n\n$TANH – A clean energy China company announced yesterday the creation of an international standard for bamboo charcoal, used for generalities and fuel applications. Bamboo charcoal is being used across countless green sectors, health and beauty, and household goods, to name a few. The stock is only at $1.90 and looks like it can hit $3.40 very soon. The chart shows a cross over on the ultimate moving average and golden cross moving average. A “buy” has printed along with a “long” which usually signifies it as a winning swing for the next week.\n\n$METX – Volume increasing here, online education company primed and looking to make a bullish uptrend for the next 4 weeks. Price target $3.30\n\nSympathy/Related: #API #EH #BRQS #BQ #TIGR #DQ #RENN #EZGO #FINV #ITP #UXIN #CCNC #QD #CANG #QK #LIZI #AIHS #WBAI #QH #YI\n\nSPACS:\n\n$LACQ - Leisure Acquisition Corp. Enters Into Merger Agreement For Business Combination WithEnsysce Biosciences, Inc. Ensysce Biosciences, a clinical-stage biopharmaceutical company with a mission to solve prescription drug abuse, is focused on launching a new class of opioid pain therapeutics. Looking for continuation tomorrow, stock was up big today.\n\n$TCHB - Soared more than 45% today after the company announced it plans to merge with electric vehicle (EV) battery maker Microvast. Watch for more!!! Will easily go over $30. Sympathy/Related: #STPK #AMCI #INAQ #FSRV #FSDC #CCIV #ACTC #TDAC #ACTCU #TSIAU\n\n\\#FTOCU #NBAC #FTOC #TSIA #CIIC\n\nMarijuana Stocks:\n\n$SNDL – Another big mover today! Huge volume and stock is finally looking like it can stay above $1 and head to $2. Keeping this one in our portfolio for the long run!\n\n$HUGE – A low key marijuana play that hasn’t been found yet by the masses. Popping up on scanners daily. Chart looks good here! Stock has bottomed and now reversing to the bullish side.\n\nPrice Target $4\n\nSympathy/Related: #ACB #TLRY #OGI #CGC #HEXO #CRON #APHA $ICG #USWS #KERN\n\nTechnicals:\n\n$TRVN - bullish engulfing on daily/weekly charts. Great start to the week. May see heavy resistance at 2.65.\n\n$IDEX - been on a run. Could be a very crucial break out above 4.75 resistance or a shorters dream with pull back. To gear up for another run to try amd break above that key level. On the next run up. top 100 buy candidates on [stockinvest.us](https://stockinvest.us/)\n\n$SAVA - nice big green candle after a bullish harami. Confirmation of bullish uptrend continuing. Look for break out into new 52WHs. Gap fill to $29\n\n$ITRM - fish hook pattern. Oversold on the stochrsi on daily. Macd curling up. May see continuation tmrw. Open above 1.60 could see another 10-20% move\n\n$JAN - Today's Form SC 13G: Ionic Ventures, LLC 7.93% stake MACD looks a little overextended, but the news tells us a different story; keep an eye on this one; two days ago, it top $31.83. Waiting to bottom out and start a bullish trend. Resistance and PT $10.43\n\n$XL - Volume Volume Volume after-hours. Has support at the $18.18 (50 M 50) Since SQUEEZE the SHORTS is a theme on stocks, then this is one you should be at the top of your watchlist. Primed for a run to PT $25.41 base on my daily fibo chart\n\nBackburners \\^PRTA \\^GSM \\^CRBP \\^ACAC \\^SVBI \\^SSNT \\^EDAP \\^OPY \\^GPRO",
        "subreddit": "smallstreetbets",
        "title": "“Watchlist 2-2-21",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lamvn9/watchlist_2221/",
        "created": 1612267199.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612230603,
        "id": "lakgkp",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "Wallstreetbetsnew",
        "title": "Im 17 amd want to start investing/ become autistic",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lakgkp/im_17_amd_want_to_start_investing_become_autistic/",
        "created": 1612259403.0
    },
    {
        "author": "j1mmyn3utr0n",
        "created_utc": 1612276781,
        "id": "lawxw7",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Revolut is now blocking payments for AMD/GME, alternative for the retards in EU?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lawxw7/revolut_is_now_blocking_payments_for_amdgme/",
        "created": 1612305581.0
    },
    {
        "author": "diddycorp",
        "created_utc": 1612281473,
        "id": "layw9m",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "This is not a post about whether GME is going to 0 or Pluto. This post is strictly about what one should or shouldn’t do if one wants to buy/sell GME. \n\n&amp;#x200B;\n\n1. Figure out how much you are willing to trade. Treat the money you are willing to trade as lost money. This way you know your max loss and if you are willing to accept that loss, then you can diamond hand any red day.\n\n&amp;#x200B;\n\n2. Don’t trade on margin. One of my best friends bought AMD at $2 and still lost it all because he went on margin and was forced to liquidate. Brokerages can and will manually liquidate your positions to cover their asses. Bottom line, don’t do it. \n\n&amp;#x200B;\n\n3. Have an exit strategy. Let’s be honest here, the distance to the moon, Pluto, and Andromeda are finite, same goes for GME. You don’t have to admit it to anyone on WSB, but you should always have a number that when reached, you are willing to exit.\n\n&amp;#x200B;\n\n4. Don’t get greedy. The saying that pigs get fat hogs get slaughtered is very true. Ask any 🐻 who held on past 4/1/2020 to show you their account and you will see. Again, you don’t have to admit it here, but know it in your heart.\n\n&amp;#x200B;\n\n5. Be fluid. Market condition changes, that goes both ways. Assuming you are following the above rules, there may be days where you will buy the dip. To the contrary, there may be days when you profit take. \n\n&amp;#x200B;\n\n6. Don’t be a sheep. Let’s be honest with ourselves for a moment. Not all hedge funds are betting against GME. There are hedge funds betting on GME. Moreover, there are people who are trying to profit from directional movement in either direction and are spreading lies on WSB to enrich themselves. Don’t be a sheep and blindly follow others.\n\n&amp;#x200B;\n\n7. Be on the look out for the next 10 bagger. I assume that almost no one here wants GME to be their last trade. I’m not saying you should sell your positions, what I’m saying is always be on the lookout for the next big thing while you hold on to your position. It would be the same thing as you getting into GME when it was $5.\n\n&amp;#x200B;\n\n8. Don’t let GME break you. Trading takes a toll no matter if you are up or down. Don’t let one trade crush you. Remember, you are trading to get rich so you can better yourself, not trading to become a slave.\n\n&amp;#x200B;\n\n\\*I have never purchased or sold short,  nor do I intend to purchase or sell short any GME equities or derivatives. Having said that, I wish my WSB brothers best of luck.",
        "subreddit": "wallstreetbets",
        "title": "What to do and not do if you want to partake in GME mania",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/layw9m/what_to_do_and_not_do_if_you_want_to_partake_in/",
        "created": 1612310273.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1612238289,
        "id": "lamue6",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "“Watchlist 2-2-21\n\nAsian stock markets extended gains on Tuesday on increased optimism about stimulus packages and global economic recovery, while retail investors retreated from GameStop and their new-found interest in gold and silver. Markets were buoyant ahead of negotiations Tuesday between U.S. President Joe Biden and Republican senators on a new COVID support bill. The GOP's $618bn stimulus plan released early Monday was about a third the size of the President's proposal. Top Democrats later on Monday filed a joint $1.9 trillion budget measure in a step toward bypassing Republicans.\n\nCONTINUATION REVOLUTION PLAYS/Backburners (DIAMOND HANDS!!!): \\^NAKD \\^NOK\n\n\\^CTRM \\^AMC \\^GTE \\^AAL \\^BB \\^GNUS \\^AAPL \\^ZOM \\^NAK \\^CEI \\^GBR \\^GE \\^GHSI \\^PLTR\n\n\\^EXPR \\^XSPA \\^M \\^CCL \\^BBBY \\^GME \\^PED \\^RCON\n\nPrecious Metals (SILVER AND GOLD):\n\nSILVER: #ASM #SVM #AG #EXK #FSM #MAG #PAAS\n\nGOLD: $TRX - On last night’s watchlist ran about 20% today! Watch for more as the gold and silver rush continues!\n\nSympathy: #HL #AAU #CDE #THM #GAU\n\nChina Stocks:\n\n$TANH – A clean energy China company announced yesterday the creation of an international standard for bamboo charcoal, used for generalities and fuel applications. Bamboo charcoal is being used across countless green sectors, health and beauty, and household goods, to name a few. The stock is only at $1.90 and looks like it can hit $3.40 very soon. The chart shows a cross over on the ultimate moving average and golden cross moving average. A “buy” has printed along with a “long” which usually signifies it as a winning swing for the next week.\n\n$METX – Volume increasing here, online education company primed and looking to make a bullish uptrend for the next 4 weeks. Price target $3.30\n\nSympathy/Related: #API #EH #BRQS #BQ #TIGR #DQ #RENN #EZGO #FINV #ITP #UXIN #CCNC #QD #CANG #QK #LIZI #AIHS #WBAI #QH #YI\n\nSPACS:\n\n$LACQ - Leisure Acquisition Corp. Enters Into Merger Agreement For Business Combination WithEnsysce Biosciences, Inc. Ensysce Biosciences, a clinical-stage biopharmaceutical company with a mission to solve prescription drug abuse, is focused on launching a new class of opioid pain therapeutics. Looking for continuation tomorrow, stock was up big today.\n\n$TCHB - Soared more than 45% today after the company announced it plans to merge with electric vehicle (EV) battery maker Microvast. Watch for more!!! Will easily go over $30. Sympathy/Related: #STPK #AMCI #INAQ #FSRV #FSDC #CCIV #ACTC #TDAC #ACTCU #TSIAU\n\n\\#FTOCU #NBAC #FTOC #TSIA #CIIC\n\nMarijuana Stocks:\n\n$SNDL – Another big mover today! Huge volume and stock is finally looking like it can stay above $1 and head to $2. Keeping this one in our portfolio for the long run!\n\n$HUGE – A low key marijuana play that hasn’t been found yet by the masses. Popping up on scanners daily. Chart looks good here! Stock has bottomed and now reversing to the bullish side.\n\nPrice Target $4\n\nSympathy/Related: #ACB #TLRY #OGI #CGC #HEXO #CRON #APHA $ICG #USWS #KERN\n\nTechnicals:\n\n$TRVN - bullish engulfing on daily/weekly charts. Great start to the week. May see heavy resistance at 2.65.\n\n$IDEX - been on a run. Could be a very crucial break out above 4.75 resistance or a shorters dream with pull back. To gear up for another run to try amd break above that key level. On the next run up. top 100 buy candidates on [stockinvest.us](https://stockinvest.us/)\n\n$SAVA - nice big green candle after a bullish harami. Confirmation of bullish uptrend continuing. Look for break out into new 52WHs. Gap fill to $29\n\n$ITRM - fish hook pattern. Oversold on the stochrsi on daily. Macd curling up. May see continuation tmrw. Open above 1.60 could see another 10-20% move\n\n$JAN - Today's Form SC 13G: Ionic Ventures, LLC 7.93% stake MACD looks a little overextended, but the news tells us a different story; keep an eye on this one; two days ago, it top $31.83. Waiting to bottom out and start a bullish trend. Resistance and PT $10.43\n\n$XL - Volume Volume Volume after-hours. Has support at the $18.18 (50 M 50) Since SQUEEZE the SHORTS is a theme on stocks, then this is one you should be at the top of your watchlist. Primed for a run to PT $25.41 base on my daily fibo chart\n\nBackburners \\^PRTA \\^GSM \\^CRBP \\^ACAC \\^SVBI \\^SSNT \\^EDAP\\^ \\^OPY \\^GPRO",
        "subreddit": "RobinHoodPennyStocks",
        "title": "“Watchlist 2-2-21",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/lamue6/watchlist_2221/",
        "created": 1612267089.0
    },
    {
        "author": "mateyman",
        "created_utc": 1612302307,
        "id": "lb7frp",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Talking about the big ones, Google, Apple, Tesla, Microsoft, Amazon etc...\n\nOr if I were just to focus on companies that I like and feel like they can go up like AMD, CRSR even BB (excluding memes its a good long term) \n\nIs it bad to not have the big stable companies in your portfolio? \n\nI also want to focus on green stocks as well for the next few years",
        "subreddit": "stocks",
        "title": "Does my portfolio needs to include stable companies?",
        "url": "https://www.reddit.com/r/stocks/comments/lb7frp/does_my_portfolio_needs_to_include_stable/",
        "created": 1612331107.0
    },
    {
        "author": "FunctionAlpha",
        "created_utc": 1612203685,
        "id": "laa0x7",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hoping to share something refreshing that's not BANG stocks related with everyone. If you're here for BB, AMC, NOK, or GME, sorry, it's getting tiring and surely WSB has plenty of that for you if you're still chasing highs and memes. \n\nSo here are the most recent options spreads traded in a number of stocks and a single index in January. Definitely planning on tracking this actively and continuing throughout 2021, especially with low days to expiration (DTE) options. \n\n&amp;#x200B;\n\n|Strategy|Symbol|Expiration|Strike|% Allocation|Avg at Open|Avg at Close|% Return|Notes|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|Call Credit Spread|SPX|29-Jan-21|3800 / 3805|10.00%|$0.55  |$0.00  |12.36%|Expired for profit.|\n|Put Credit Spread|SPX|29-Jan-21|3660 / 3665|20.00%|$0.40  |$0.00  |8.70%|Expired for profit.|\n|Put Credit Spread|SPX|27-Jan-21|3745 / 3750|7.50%|$0.60  |$0.00  |13.64%|Expired for profit.|\n|Put Credit Spread|AMD|29-Jan-21|83 / 85|5.00%|$0.19  |$0.00 |10.50%|Expired for profit.|\n|Put Credit Spread|SPX|27-Jan-21|3755 / 3760|7.75%|$0.50  |$5.00  |\\-100.00%|Position assigned for cash settlement.|\n|Put Credit Spread|SPX|27-Jan-21|3735 / 3740|7.75%|$0.55  |$0.00 |12.36%|Expired for profit.|\n|Put Credit Spread|PTON|29-Jan-21|135 / 140|7.50%|$0.45  |$0.00 |9.89%|Expired for profit.|\n|Put Credit Spread|PINS|29-Jan-21|60 / 65|8.00%|$0.30  |$0.00 |6.38%|Expired for profit.|\n|Call Credit Spread|PLUG|29-Jan-21|85 / 90|7.25%|$0.26  |$0.00 |5.49%|Expired for profit.|\n|Call Credit Spread|SPCE|29-Jan-21|50 / 55|7.25%|$0.23  |$0.00 |4.82%|Expired for profit.|\n|Put Credit Spread|BYND|29-Jan-21|160 / 165|7.25%|$0.27  |$0.00 |5.71%|Expired for profit.|\n|Put Credit Spread|INTC|29-Jan-21|51 / 53|5.00%|$0.21  |$0.00 |11.73%|Expired for profit.|\n|Call Credit Spread|SPX|25-Jan-21|3870 / 3875|10.00%|$0.70  |$0.05  |15.12%|Closed out short leg early to lock in profit.|\n|Call Credit Spread|SPX|22-Jan-21|3860 / 3865|10.00%|$0.40  |$0.00 |8.70%|Expired for profit.|\n|Call Credit Spread|SPX|22-Jan-21|3850 / 3855|10.00%|$0.70  |$0.00 |16.28%|Expired for profit.|\n\n^(Table) ^(Formatting by) [^(ExcelToReddit)](https://xl2reddit.github.io/)\n\nAllocation % means the capital as a percentage of the portfolio allocated to the trade, where it is dictated by the maximum risk amount on the spread. This amount is the maximum loss amount if the underlying stock or index moves the entire spread in the money (ITM) and also the collateral that would be required by the brokerage. While % Return is the total premium collected as a percentage of the max risk amount. \n\nAll trades listed were opened anywhere between 0 and 7 DTE, with deltas in the short leg ranging between 10 and 20. The game plan is to collect premiums on spreads, with the best outcome having the short leg expire out of the money (OTM). \n\nIn the month of January alone, the portfolio experienced a maximum drawdown of 8.4% from its peak. The number would have definitely been much higher if it wasn't for these key factors:\n\n* Position sizing / trade allocation, where trades were sized properly to contain risk.\n* Trade timing / entry, where trades are entered at specific times of day for best premiums and chance of getting filled. \n* Trade diversification, where not all trades are in the same basket of stocks and carry different direction or +/- deltas.  \n\nYes, there's something about pennies and steamrollers to be said about these trades, where the % return is consistent for a few trades and suddenly a -100% return shows up to take all of the hard earned premium back. \n\nIn fact, that's exactly what happened on one of the 0 DTE SPX trades. That's where allocation, timing, and diversification helps, where we can fully expect to experience a complete loss on a small number of trades, but still come out ahead profitable overall.  \n\nFor those interested, feel free to reach out for more information or to see the full list of trades we executed in January 2021. \n\nWe’re also keen on getting this community’s feedback and thoughts on our trades executed; happy to share our reasoning on executing them. Let us know!\n\nOtherwise, stay safe and vigilant out there! We’ll be back with another post to share our progress and findings next month!",
        "subreddit": "options",
        "title": "0-7 DTE Options - Fool's Game?",
        "url": "https://www.reddit.com/r/options/comments/laa0x7/07_dte_options_fools_game/",
        "created": 1612232485.0
    },
    {
        "author": "mpls_lurker",
        "created_utc": 1612200551,
        "id": "la8phb",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I have been watching AMD closely after it fell on earnings and have been slowly purchasing on the way down, I am hopeful that the short term downward pressure is letting up, but am not sure if that hope is what I want to believe or if others share the same sentiment.  Either way, I doubled my position at open and am wondering what the group consensus is.\n\nPosition: 1,000 shares at $86.86 average cost.",
        "subreddit": "stocks",
        "title": "Sentiment on whether sell pressure is easing on AMD?",
        "url": "https://www.reddit.com/r/stocks/comments/la8phb/sentiment_on_whether_sell_pressure_is_easing_on/",
        "created": 1612229351.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612184952,
        "id": "la2opd",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**Stocks end their worst week since October at their lowest point on Friday. Is the Short-Squeeze Over? Over 100 companies report earnings this week. Let’s talk about this &amp; other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of Friday as we saw the stock market finish with another sell-off, as the big 3 indices finished with the worst week since late October with the [SP500](https://ibb.co/Vpq92y3) losing almost 2%, the [Nasdaq Composite](https://ibb.co/yN3b3RQ) losing exactly 2% and the [Dow Jones](https://ibb.co/D7Cy2YQ) shedding 620 points and dropping below 30k. All 3 of them finished the week down more than 3% as the [VIX](https://ibb.co/cgz4N3r) spiked yet again on Friday, rising by almost 10% and finishing the week up more than 40%.\n\nWe saw over 70% of the companies declining [Friday](https://ibb.co/G3rX22D), as the number of companies trading above the 50-day moving average dropped under 50%, with all 11 [sectors](https://ibb.co/HKhY6hC) finishing in the red again, as Energy &amp; Tech were the biggest losers. \n\nSo, let’s take a look at the HEAT MAP from [Friday](https://ibb.co/jVFqVbH). It’s really hard to find any gaining companies, with big tech companies selling off yet again, as most of the small gainers were found in the Health Care sector. For the [WEEK](https://ibb.co/5Y5HR4q)  though, Microsoft was the only big tech name that managed to gain ground after smashing the earnings report, while most of the stock market faced sell-off pressures as the short squeeze mania might have pushed investors into a risk-off approach.\n\nWe also got some economic data on Friday as the December personal disposable [INCOME](https://ibb.co/Khyh7mP) increase by 0.6%, more than expected as this mostly reflected an increase in social benefits &amp; compensations, with the Q4 employment cost [INDEX](https://ibb.co/QcqbM5y) also rising by 0.7% to close out the year.\n\nMeanwhile we saw the Consumer Sentiment [INDEX](https://ibb.co/pX3mFgt) coming in at 79, slightly lower than expected, as this was also seen in the December pending home sales [NUMBER](https://ibb.co/m4tbnWN), which also came in with a 0.3% decrease month/month.\n\nThis week we have somewhat of a quiet economic [CALENDAR](https://ibb.co/LvYY84v), with a couple of interesting numbers through the week, while [EARNINGS](https://ibb.co/rxmpwVK) take center stage yet again, with interesting reports coming from companies like Amazon, Google &amp; Alibaba on Tuesday, while Wednesday we hear from PayPal, Qualcomm &amp; Spotify. We also get earnings reports from some recent favorites like Pinterest, Snap, Ford, Peloton and Penn on Thursday as the earnings season with over 100 companies from the SP500 reporting, might help push the stock market higher after the sell-off last week.\n\nIn some other stock market news, we saw [NIO](https://ibb.co/C0CSdJJ) reporting a new monthly record with 7225 vehicles delivered in the first month of 2021, an increase of more than 350% Y/Y as the company is still ramping up production in an attempt to challenge Tesla’s EV dominance. Nio has had a huge run in the past months but has a long way to go to grow into the big valuation, though the trajectory of the company looks very promising.\n\nMeanwhile the biggest development in the markets was the trading platforms [imposing](https://ibb.co/y5sPVJv) restrictions on the squeezed stocks and even many other stocks that didn’t have such a big short % of the float with big names like AMD, Starbucks &amp; Moderna being affected. These restrictions were reduced back to only 8 companies [Sunday](https://ibb.co/GV5TKxf), but are still limited to whole share aggregate buy limits on the crowd favorites.\n\nThe recent moves in the stock market have made some big changes in the social world as Steve Cohen deactivate his [Twitter](https://ibb.co/0KK2P59), while a recent [survey](https://ibb.co/Mf6V8tz) showed that more than ¾ of respondents are planning on leaving RBNHD while 13% already did it, with the limiting tactics being probably the biggest reason for retail investors to make this change.\n\nInteractive [Brokers](https://ibb.co/JzR5qCC) also re-opened trading on these names on Sunday, which brings to question if these platforms have insider knowledge of the future of the stocks, or did they just increased their liquidity just like [RBNHD](https://ibb.co/P6WXwDj) after they raised more than $1B earlier in the week.\n\nSo… I think the stock market is still very volatile and the short squeezes can keep on going for an unknown period of time as markets can act in an unusual pattern for longer than anyone can anticipate, or the short squeeze can vanish in a second… this one is very hard to predict… Yes, keep the pedal to the medal in the hot stocks but also stay invested in great companies as good earnings reports haven’t helped most stocks again this quarter, but may provide good buying opportunities for the long-term.\n\nAnd finally, let’s hope for a good day in the markets as the US [FUTURES](https://ibb.co/wc2P16r) are pointing to a good open with the Nasdaq leading the way as we await to see the Manufacturing Indexes numbers in the early [morning](https://ibb.co/LvYY84v).\n\n**Thank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗**",
        "subreddit": "StockMarket",
        "title": "Stock Market News for Today | Is the Short Squeeze Over? NIO &amp; other Stock Market News [02-01]",
        "url": "https://www.reddit.com/r/StockMarket/comments/la2opd/stock_market_news_for_today_is_the_short_squeeze/",
        "created": 1612213752.0
    },
    {
        "author": "georgewatso",
        "created_utc": 1612281085,
        "id": "layqli",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Position: &gt;100,000 shares @\\~CAD$1\n\nCurrent SP: CAD$1.41\n\nTheir vision (from website):\n\nOur vision for the company is to become the global leader in chip-scale photonic solutions by deploying our Optical Interposer technology to enable the seamless integration of electronics and photonics for a broad range of vertical market applications.\n\nBasically, they are developing the successor to silicon semiconductors. The details of this is kept very secret, but they have a patented platform which they believe can change the future of electronics.\n\nWhy buy?\n\nOver the past few years POET have put together a really strong base to the company:\n\n* New CEO with a really strong technical background at GlobalFoundries who manufacture chips for AMD, Qualcomm, and many others\n* Some potentially really good joint ventures such as with Sanan\n* A really strong Board of Directors with a good mix of technical expertise and financing experience\n\nWhy now?\n\nLast month the company announced that they would have a special meeting with their shareholders about the potential listing of the company on the NASDAQ. Ever since, the SP has inflated and inflated, to the point that it is now up 90% in three weeks. It is likely that this will continue to inflate as excitement grows.\n\nThe suggestion that the company is to list on NASDAQ is an indication that they are more confident in their technology and it is getting closer to commercialisation, they just need a bit more capital to make it happen.\n\nEnd game?\n\nIf, and its a big if, this company is to have the platform which goes someway to replacing silicon in the future then we all know the value.\n\nPotential risks?\n\nRealistically, there is a chance another company is one step ahead of the curve and their technology will never make it in the future.\n\nSome close links to Chinese companies - future restrictions could hamper some of their JVs.",
        "subreddit": "pennystocks",
        "title": "PTK.V/POETF - DD - Blowing up ahead of potential listing on NASDAQ",
        "url": "https://www.reddit.com/r/pennystocks/comments/layqli/ptkvpoetf_dd_blowing_up_ahead_of_potential/",
        "created": 1612309885.0
    },
    {
        "author": "sourcranberry",
        "created_utc": 1612248264,
        "id": "lapmfn",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I've been at it for two years now and have made handsome gains. But I feel like I'm carrying a lot of redundant dead weight. \n\nWhat would you cut here and why? Almost nothing is at a loss, and if it is only a couple thousand at most. Most of my money is in VFIAX and the big ones (AMZN, APPL, TSLA, WMT, MSFT, VZ, and lately ICLN). \n\n\n\nYes, the BB/GME/AMC thing was a bit of fun this week. I'm cutting those loose. \n\n\n\n\n\n\n**Mutual funds**\n\nVFIAX\tVanguard 500 Index Fund Admiral Shares  \n\nVBTLX\tVanguard Total Bond Market Index Fund Admiral Shares  \n\n**ETFs**\t\n\nYOLO\tADVISORSHARES PURE CANNABIS ETF  \n\nARKG\tARK GENOMIC REVOLUTION ETF  \n\nTAN\t INVESCO SOLAR ETF  \n\nPBW\tINVESCO WILDERHILL CLEAN ENERGY ETF  \n\nICLN\tISHARES GLOBAL CLEAN ENERGY ETF  \n\n\n**Stocks**\t\n\nAMD\tADVANCED MICRO DEVICES INC  \n\nBABA\tALIBABA GROUP HOLDING LTD SPONS ADS REPSTG 8 \nORD SHS  \n\nGOOG\tALPHABET INC CL C  \n\nAMZN\tAMAZON.COM INC  \n\nAMC\tAMC ENTERTAINMENT HLDGS INC CL A  \n\nAMPE\tAMPIO PHARMACEUTICALS INC  \n\nAAPL\tAPPLE INC  \n\nBB\tBLACKBERRY LTD  \n\nBA\tBOEING COMPANY  \n\nNET\tCLOUDFLARE INC CL A  \n\nCOST\tCOSTCO WHOLESALE CORP  \n\nCRSP\tCRISPR THERAPEUTICS AG  \n\nCRWD\tCROWDSTRIKE HOLDINGS INC CL A  \n\n\nAPPS\tDIGITAL TURBINE INC NEW  \n\nENPH\tENPHASE ENERGY INC  \n\nFDX\tFEDEX CORP  \n\nGME\tGAMESTOP CORP CL A NEW  \n\nGILD\tGILEAD SCIENCES INC  \n\nINSG\tINSEEGO CORP  \n\nJNJ\tJOHNSON &amp; JOHNSON  \n\nMGNI\tMAGNITE INC  \n\nMSFT\tMICROSOFT CORP  \n\nMIND      MEDICINE  \n\nMRNA\tMODERNA INC  \n\nNFLX\tNETFLIX INC  \n\n\nNEE\tNEXTERA ENERGY INC  \n\nNIO\tNIO INC ADS REPSTG CL A ORD SHS  \n\nNUMINUS WELLNESS INC  \n\nNVDA\tNVIDIA CORP  \n\nOCU \n\nPLTR\tPALANTIR TECHNOLOGIES INC CL A  \n\nPFE\tPFIZER INC  \n\nPLUG\tPLUG POWER INC NEW  \n\nPG\tPROCTER &amp; GAMBLE CO  \n\nQCOM\tQUALCOMM INC  \n\nQS\tQUANTUMSCAPE CORP CL A  \n\nREGN\tREGENERON PHARMACEUTICALS INC  \n\nSEDG\tSOLAREDGE TECHNOLOGIES INC  \n\nSRNE\tSORRENTO THERAPEUTICS INC NEW  \n\nSQ\tSQUARE INC CL A  \n\nTSLA\tTESLA INC  \n\nU\tUNITY SOFTWARE INC  \n\nVZ\tVERIZON COMMUNICATIONS INC  \n\nVTRS\tVIATRIS INC  \n\nSPCE\tVIRGIN GALACTIC HOLDINGS INC  \n\nWMT\tWALMART INC  \n\nDIS\tWALT DISNEY CO ",
        "subreddit": "stocks",
        "title": "Is it time to trim my portfolio? Any advice would be greatly appreciated.",
        "url": "https://www.reddit.com/r/stocks/comments/lapmfn/is_it_time_to_trim_my_portfolio_any_advice_would/",
        "created": 1612277064.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612223525,
        "id": "lai0iw",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "smallstreetbets",
        "title": "AMD/Xilinx Merger...",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lai0iw/amdxilinx_merger/",
        "created": 1612252325.0
    },
    {
        "author": "shortymcsteve",
        "created_utc": 1612200072,
        "id": "la8i9v",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "On Friday Robinhood went after WSB’s first love Suebae. \nUsers were limited to buy only ONE share of AMD after they announced a record quarter. Why??? \n\n&amp;nbsp;\n\nLet’s see - AMD is heavily invested in by big funds. AMD announces a record quarter, the stock begins to sell off!? Many people on r/amd_stock theorise this is institutional money trying to liquidate cash and take profits after getting hit by GME. \n\nBut wait, AMD short interest just rose from [52m to 107m.](http://www.reddit.com/r/AMD_Stock/comments/l7uw06/short_interest_on_amd_has_doubled_from_52_million/ ) Up over 50% in 2 and a half weeks after the company grows 50% and produces record results..\n\n\n\nThen Robinhood adds AMD to the list of stocks you can only buy a limited amount of and limit it to ONE share. Wtf? \n\n\nAMD isn’t part of any of the massive shorting going on in the market and is a pretty stable company. So why would they do this? Oh right, because AMD is one of the most held stocks on RH and many young investors like the company on a consumer level. So while it’s at a discount they want to stop you buying in so their buddies with the short positions can load up and get their money back after getting wrecked by GME, AMC and other heavily shorted stocks. \n\n&amp;nbsp;\n\n**Here’s what’s happening:**\n\nFunds with large positions in AMD are shorting the stock before selling off stock they previously held. This drops the price and they collect a nice bonus on the way out. \nThe short interest in the stock has increase drastically by over 50%, and of course between earnings and RH limiting trading we saw a number of hit piece articles with false information about AMD. But weirdly enough no one report on the leaks that [AMD are now powering Tesla’s in car game console/entertainment system.](http://www.reddit.com/r/AMD_Stock/comments/l749ia/patrick_schur_picture_confirms_tesla_uses_navi_23/) Last time there was even a rumour of AMD supplying Tesla the stock went vertical. \n \n\nI’m sure the OGs here remember the blatant manipulation that happened with this stock back in the days when it was $2-$20. People like Goldman would downgrade the stock, load up on stock and wait for it to rally, sell, and then downgrade again.\nThese guys are back using AMD as their personal money printer because they just got wrecked.\n\n&amp;nbsp;\n\n**Oh, and you know who happens to own 2.1m shares in AMD? That’s right, [MELVIN CAPITAL.](https://fintel.io/so/us/amd)**\n\n&amp;nbsp;\n\nBut here’s one thing RH didn’t think about. \nXilinx is about to be acquired by AMD in an all stock deal, this means both stocks move in unison with each other. And more importantly, the daily average trade volume of Xilinx is only 3m compared to AMDs 45.15m\n\nThis means if a number of people decide they like Xilinx stock, AMD will follow far faster than if they decided to simply like AMD stock. And since there’s no limits on Xilinx people can currently like the stock as much as they want.\n\nSide note - If you *really* like Xilinx and hold until the deal is complete, you will be given 1.734 shares in AMD for every Xilinx share you own. If this deal happened right now at current prices, this means you would make around 10% on your investment compared to just holding the same amount in AMD.\n\n&amp;nbsp;\n\n**Please note:** I am not a financial advisor, just some long term WSB member here to explain that if everyone jumped into Xilinx instead of AMD the shorts would get pretty screwed. They think they found a way to make their money back, it would be pretty nice if they didn’t. \n\n&amp;nbsp;\n\n**HOLD GME**\n\n**LIKE XILINX (if you want I’m not a financial advisor)**\n\n**DESTROY THE SHORTS**\n\n**FUCK ROBINHOOD**\n\n&amp;nbsp;\n\nAlso, shoutout to [Hothardware for being the only news website talking about this](https://hothardware.com/news/amd-robinhood-gamestop-gme-shorts-wallstreetbets\n). \nSomething is very wrong here and we need everyone to know it.\n\n&amp;nbsp;\n\nTL;DR; - GO READ IT, STOP BEING LAZY. THIS IS IMPORTANT AND EVERYONE NEEDS TO KNOW. *YOU HAVE TO UNDERSTAND.*\n\n🖐💎🖐 🚀🚀🚀🚀🚀🚀🚀🚀🚀🖐💎🖐",
        "subreddit": "Wallstreetbetsnew",
        "title": "😡THE SHORTS ARE HIDING IN AMD😡",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/la8i9v/the_shorts_are_hiding_in_amd/",
        "created": 1612228872.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612193790,
        "id": "la5unv",
        "num_comments": 4,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "THE SHORTS ARE HIDING IN AMD 😡",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la5unv/the_shorts_are_hiding_in_amd/",
        "created": 1612222590.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612283155,
        "id": "lazmry",
        "num_comments": 4,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "$AMD - Another victim of the suits",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lazmry/amd_another_victim_of_the_suits/",
        "created": 1612311955.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612288672,
        "id": "lb1xb7",
        "num_comments": 4,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "I'm a new acquisition on r/wallstreetbets But one thing I could've told you was to Hold to those GME/AMC/AMD stocks and ignore the bot chatter.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lb1xb7/im_a_new_acquisition_on_rwallstreetbets_but_one/",
        "created": 1612317472.0
    },
    {
        "author": "0toHeroInvesting",
        "created_utc": 1612184951,
        "id": "la2op6",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Stocks end their worst week since October at their lowest point on Friday. Is the Short-Squeeze Over? Over 100 companies report earnings this week. Let’s talk about this &amp; other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of Friday as we saw the stock market finish with another sell-off, as the big 3 indices finished with the worst week since late October with the [SP500](https://ibb.co/Vpq92y3) losing almost 2%, the [Nasdaq Composite](https://ibb.co/yN3b3RQ) losing exactly 2% and the [Dow Jones](https://ibb.co/D7Cy2YQ) shedding 620 points and dropping below 30k. All 3 of them finished the week down more than 3% as the [VIX](https://ibb.co/cgz4N3r) spiked yet again on Friday, rising by almost 10% and finishing the week up more than 40%.\n\nWe saw over 70% of the companies declining [Friday](https://ibb.co/G3rX22D), as the number of companies trading above the 50-day moving average dropped under 50%, with all 11 [sectors](https://ibb.co/HKhY6hC) finishing in the red again, as Energy &amp; Tech were the biggest losers. \n\nSo, let’s take a look at the HEAT MAP from [Friday](https://ibb.co/jVFqVbH). It’s really hard to find any gaining companies, with big tech companies selling off yet again, as most of the small gainers were found in the Health Care sector. For the [WEEK](https://ibb.co/5Y5HR4q)  though, Microsoft was the only big tech name that managed to gain ground after smashing the earnings report, while most of the stock market faced sell-off pressures as the short squeeze mania might have pushed investors into a risk-off approach.\n\nWe also got some economic data on Friday as the December personal disposable [INCOME](https://ibb.co/Khyh7mP) increase by 0.6%, more than expected as this mostly reflected an increase in social benefits &amp; compensations, with the Q4 employment cost [INDEX](https://ibb.co/QcqbM5y) also rising by 0.7% to close out the year.\n\nMeanwhile we saw the Consumer Sentiment [INDEX](https://ibb.co/pX3mFgt) coming in at 79, slightly lower than expected, as this was also seen in the December pending home sales [NUMBER](https://ibb.co/m4tbnWN), which also came in with a 0.3% decrease month/month.\n\nThis week we have somewhat of a quiet economic [CALENDAR](https://ibb.co/LvYY84v), with a couple of interesting numbers through the week, while [EARNINGS](https://ibb.co/rxmpwVK) take center stage yet again, with interesting reports coming from companies like Amazon, Google &amp; Alibaba on Tuesday, while Wednesday we hear from PayPal, Qualcomm &amp; Spotify. We also get earnings reports from some recent favorites like Pinterest, Snap, Ford, Peloton and Penn on Thursday as the earnings season with over 100 companies from the SP500 reporting, might help push the stock market higher after the sell-off last week.\n\nIn some other stock market news, we saw [NIO](https://ibb.co/C0CSdJJ) reporting a new monthly record with 7225 vehicles delivered in the first month of 2021, an increase of more than 350% Y/Y as the company is still ramping up production in an attempt to challenge Tesla’s EV dominance. Nio has had a huge run in the past months but has a long way to go to grow into the big valuation, though the trajectory of the company looks very promising.\n\nMeanwhile the biggest development in the markets was the trading platforms [imposing](https://ibb.co/y5sPVJv) restrictions on the squeezed stocks and even many other stocks that didn’t have such a big short % of the float with big names like AMD, Starbucks &amp; Moderna being affected. These restrictions were reduced back to only 8 companies [Sunday](https://ibb.co/GV5TKxf), but are still limited to whole share aggregate buy limits on the crowd favorites.\n\nThe recent moves in the stock market have made some big changes in the social world as Steve Cohen deactivate his [Twitter](https://ibb.co/0KK2P59), while a recent [survey](https://ibb.co/Mf6V8tz) showed that more than ¾ of respondents are planning on leaving RBNHD while 13% already did it, with the limiting tactics being probably the biggest reason for retail investors to make this change.\n\nInteractive [Brokers](https://ibb.co/JzR5qCC) also re-opened trading on these names on Sunday, which brings to question if these platforms have insider knowledge of the future of the stocks, or did they just increased their liquidity just like [RBNHD](https://ibb.co/P6WXwDj) after they raised more than $1B earlier in the week.\n\nSo… I think the stock market is still very volatile and the short squeezes can keep on going for an unknown period of time as markets can act in an unusual pattern for longer than anyone can anticipate, or the short squeeze can vanish in a second… this one is very hard to predict… Yes, keep the pedal to the medal in the hot stocks but also stay invested in great companies as good earnings reports haven’t helped most stocks again this quarter, but may provide good buying opportunities for the long-term.\n\nAnd finally, let’s hope for a good day in the markets as the US [FUTURES](https://ibb.co/wc2P16r) are pointing to a good open with the Nasdaq leading the way as we await to see the Manufacturing Indexes numbers in the early [morning](https://ibb.co/LvYY84v).\n\n**Thank you everyone for reading🙏 Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market! Have a great day and see you next time❗**",
        "subreddit": "stocks",
        "title": "Stock Market News for Today | Is the Short Squeeze Over? NIO &amp; other Stock Market News [02-01]",
        "url": "https://www.reddit.com/r/stocks/comments/la2op6/stock_market_news_for_today_is_the_short_squeeze/",
        "created": 1612213751.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612203173,
        "id": "la9tea",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "options",
        "title": "AMD options - Jan 15 strike - Help with interpretation!",
        "url": "https://www.reddit.com/r/options/comments/la9tea/amd_options_jan_15_strike_help_with_interpretation/",
        "created": 1612231973.0
    },
    {
        "author": "InCareBoot",
        "created_utc": 1612283072,
        "id": "lazlfs",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Just got this email from Revolut saying that buying amc amd gme stock is no longer going to be available, only selling, I only had 70$ in can't afford more so hope something goes from that. Share the word so people see what they are doing.",
        "url": "https://i.redd.it/4uj90hstb3f61.png",
        "created": 1612311872.0
    },
    {
        "author": "Illustrious_Mine1622",
        "created_utc": 1612183371,
        "id": "la27r6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Why is AMD so heavily shorted? Who wants to squeeze it?? 💫",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la27r6/why_is_amd_so_heavily_shorted_who_wants_to/",
        "created": 1612212171.0
    },
    {
        "author": "touchinmuhjunks",
        "created_utc": 1612192143,
        "id": "la56f9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "fuck silver AMD is ripe for the bear fucking",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la56f9/fuck_silver_amd_is_ripe_for_the_bear_fucking/",
        "created": 1612220943.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612308134,
        "id": "lb9n7z",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "stocks",
        "title": "What do yall think about AMD",
        "url": "https://www.reddit.com/r/stocks/comments/lb9n7z/what_do_yall_think_about_amd/",
        "created": 1612336934.0
    },
    {
        "author": "zuke76",
        "created_utc": 1612199592,
        "id": "la8b37",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "THE SHORTS ARE HIDING IN AMD 😡😡IMPORTANT PLEASE READ",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la8b37/the_shorts_are_hiding_in_amd_important_please_read/",
        "created": 1612228392.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612202099,
        "id": "la9d7r",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "investing",
        "title": "AMD",
        "url": "https://www.reddit.com/r/investing/comments/la9d7r/amd/",
        "created": 1612230899.0
    },
    {
        "author": "Revolutionary-Wave53",
        "created_utc": 1612282253,
        "id": "laz8jy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD - Another Short Sell Victim",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laz8jy/amd_another_short_sell_victim/",
        "created": 1612311053.0
    },
    {
        "author": "athleech",
        "created_utc": 1612261861,
        "id": "laspz7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hello (I am fairly new to investing btw),\nI want to ask what the Xilinx takeover by AMD will look like for me as a Xilinx shareholder. \nAs most people probably know AMD and Xilinx have an all stock transaction deal where current Xilinx shareholders will receive 1.7** shares of AMD in return for their Xilinx shares. \nNow I can’t seem to find any news on this except for the fact that the deal is supposed to be closed in 2021. I am just wondering what it will look like for me; will my Xilinx shares automatically be switched by AMD shares or do I have to do something for it? And when do you expect it to be finalized?\nThanks in advance for the answers",
        "subreddit": "stocks",
        "title": "What will the AMD / Xilinx takeover look like?",
        "url": "https://www.reddit.com/r/stocks/comments/laspz7/what_will_the_amd_xilinx_takeover_look_like/",
        "created": 1612290661.0
    },
    {
        "author": "NaruCarb",
        "created_utc": 1612220172,
        "id": "lagrr4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD next (GME shit post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lagrr4/amd_next_gme_shit_post/",
        "created": 1612248972.0
    },
    {
        "author": "rollTide199",
        "created_utc": 1612192348,
        "id": "la59h1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "LIQUIDATED MY ENTIRE PORTFOLIO AMD PUT IT IN GME IN THE DIP 🚀🚀🚀🚀 Let’s fucking ride",
        "url": "https://i.redd.it/jfi5s872uve61.jpg",
        "created": 1612221148.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612197100,
        "id": "la78x6",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "stocks",
        "title": "AMD Complete Stock Analysis &amp; Price Target Prediction",
        "url": "https://www.reddit.com/r/stocks/comments/la78x6/amd_complete_stock_analysis_price_target/",
        "created": 1612225900.0
    },
    {
        "author": "SnooKiwis6601",
        "created_utc": 1612209927,
        "id": "lacmj7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "We as gamers need to raise stocks that power our gaming. We need Intel, Amd, and nvidia. Maybe even yum! Which owns KFC. We need that KFConsole",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lacmj7/we_as_gamers_need_to_raise_stocks_that_power_our/",
        "created": 1612238727.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612189280,
        "id": "la43hb",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "IF $AMD reaches 100$",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la43hb/if_amd_reaches_100/",
        "created": 1612218080.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612183875,
        "id": "la2ctv",
        "num_comments": 2,
        "num_crossposts": 0,
        "subreddit": "stocks",
        "title": "AMD Stock Price Target Prediction &amp; Analysis [Technical, Fundamental &amp; DCF]",
        "url": "https://www.reddit.com/r/stocks/comments/la2ctv/amd_stock_price_target_prediction_analysis/",
        "created": 1612212675.0
    },
    {
        "author": "zuke76",
        "created_utc": 1612199241,
        "id": "la85md",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "THE SHORTS ARE HIDING IN AMD 😡😡",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la85md/the_shorts_are_hiding_in_amd/",
        "created": 1612228041.0
    },
    {
        "author": "Alone_Literature_800",
        "created_utc": 1612291646,
        "id": "lb34n1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "AMD Spread help",
        "url": "https://www.reddit.com/r/options/comments/lb34n1/amd_spread_help/",
        "created": 1612320446.0
    },
    {
        "author": "freshwes",
        "created_utc": 1612308557,
        "id": "lb9slv",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "On Friday, Robinhood wouldn't let me buy 1 share of AMD... wtf",
        "url": "https://imgur.com/ET04cb9",
        "created": 1612337357.0
    },
    {
        "author": "liquidlava1990",
        "created_utc": 1612223721,
        "id": "lai2xm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD!! 🚀🚀They will not take them down!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lai2xm/amd_they_will_not_take_them_down/",
        "created": 1612252521.0
    },
    {
        "author": "jchandler1990",
        "created_utc": 1612215684,
        "id": "laf0bm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "What's your guess-timate on how 100$ AMD calls for April will work out here? I was originally short AMD and flipped EOD.",
        "url": "https://i.redd.it/ch5o1gwfrxe61.jpg",
        "created": 1612244484.0
    },
    {
        "author": "SpinningGecko",
        "created_utc": 1612225723,
        "id": "lais2c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "$AMD a good long term?",
        "url": "https://www.reddit.com/r/stocks/comments/lais2c/amd_a_good_long_term/",
        "created": 1612254523.0
    },
    {
        "author": "Nucklehead2",
        "created_utc": 1612226623,
        "id": "laj3nv",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Wtf hold the line check the AMD chart so fucked up they are starting to feel some tension but are trying to put he price down so sneaky look out for the big bang,to the moon allya tards and strong ass monkey fucks let's put them#s up hold I want to take my grand kids one day to a movie remember .",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laj3nv/wtf_hold_the_line_check_the_amd_chart_so_fucked/",
        "created": 1612255423.0
    },
    {
        "author": "Inefficient-Market",
        "created_utc": 1612211107,
        "id": "lad3vk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Next target... Invest in AMD!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lad3vk/next_target_invest_in_amd/",
        "created": 1612239907.0
    },
    {
        "author": "The_Veluth",
        "created_utc": 1612191946,
        "id": "la53ip",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Let's get AMD to $100",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la53ip/lets_get_amd_to_100/",
        "created": 1612220746.0
    },
    {
        "author": "Longjumping-Web-9983",
        "created_utc": 1612193105,
        "id": "la5ke7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "yo,buy the dip on AMD while you still can,in 2 months it will skyrocket",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la5ke7/yobuy_the_dip_on_amd_while_you_still_canin_2/",
        "created": 1612221905.0
    },
    {
        "author": "Ultramen",
        "created_utc": 1612184740,
        "id": "la2mft",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Bought GME at the top to support you guys, now what? AMC, AMD NOK?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la2mft/bought_gme_at_the_top_to_support_you_guys_now/",
        "created": 1612213540.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612179316,
        "id": "la15rq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "Wallstreetbetsnew",
        "title": "Thoughts on AMD",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/la15rq/thoughts_on_amd/",
        "created": 1612208116.0
    },
    {
        "author": "Necessary_Ad5463",
        "created_utc": 1612175120,
        "id": "la05fv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Bought 500 AMC AMD 100 MAC my first trades pre market",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la05fv/bought_500_amc_amd_100_mac_my_first_trades_pre/",
        "created": 1612203920.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612196304,
        "id": "la6x39",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "😡THE SHORTS ARE HIDING IN AMD😡",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la6x39/the_shorts_are_hiding_in_amd/",
        "created": 1612225104.0
    },
    {
        "author": "Romanov199",
        "created_utc": 1612201013,
        "id": "la8wm9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$AMD BROOOOUUUU",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la8wm9/amd_broooouuuu/",
        "created": 1612229813.0
    },
    {
        "author": "CRE-Invest",
        "created_utc": 1612183097,
        "id": "la24wl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD Squeeze",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la24wl/amd_squeeze/",
        "created": 1612211897.0
    },
    {
        "author": "shortymcsteve",
        "created_utc": 1612195219,
        "id": "la6g8i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "😡THE SHORTS ARE HIDING IN AMD😡",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la6g8i/the_shorts_are_hiding_in_amd/",
        "created": 1612224019.0
    },
    {
        "author": "JoshuaOtt",
        "created_utc": 1612237639,
        "id": "lamnee",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD Caught In WallStreetBets Drama As Shady Robinhood Dares To Limit Trading",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lamnee/amd_caught_in_wallstreetbets_drama_as_shady/",
        "created": 1612266439.0
    },
    {
        "author": "Shadowedsphynx",
        "created_utc": 1612244203,
        "id": "laoklj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Stake, one of the few options for US Stock Exchange Trading in Australia, will block buying on GME and AMD from Tuesday.",
        "url": "https://i.redd.it/nzp0b30940f61.png",
        "created": 1612273003.0
    },
    {
        "author": "HungLowBro",
        "created_utc": 1612292113,
        "id": "lb3b8d",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "We HOLD boys We HOLD -AMC / DIS /ACB / INO / GE / CCCC / ACB / WMT / NAKD / CRBP / AMD",
        "url": "https://i.redd.it/oh8n73op24f61.jpg",
        "created": 1612320913.0
    },
    {
        "author": "jayones6",
        "created_utc": 1612285271,
        "id": "lb0j0o",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Save AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lb0j0o/save_amd/",
        "created": 1612314071.0
    },
    {
        "author": "Famous_Hawk1230",
        "created_utc": 1612270969,
        "id": "lauzf7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD and doge !!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lauzf7/amd_and_doge/",
        "created": 1612299769.0
    },
    {
        "author": "Visible_Cantaloupe39",
        "created_utc": 1612297765,
        "id": "lb5khp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lb5khp/amd/",
        "created": 1612326565.0
    },
    {
        "author": "Chrisdrau",
        "created_utc": 1612327201,
        "id": "lbfq4y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I just invested in AMD, was this a good idea?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lbfq4y/i_just_invested_in_amd_was_this_a_good_idea/",
        "created": 1612356001.0
    },
    {
        "author": "apetrader50",
        "created_utc": 1612204825,
        "id": "laaido",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Apes like AMD, looking for sweet, juicy tendies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laaido/apes_like_amd_looking_for_sweet_juicy_tendies/",
        "created": 1612233625.0
    },
    {
        "author": "buskapelino",
        "created_utc": 1612224536,
        "id": "laidpm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I'm out of $GME from \"to the moon\" to \"back to the roots\" = 100% AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laidpm/im_out_of_gme_from_to_the_moon_to_back_to_the/",
        "created": 1612253336.0
    },
    {
        "author": "foreveralive0125",
        "created_utc": 1612232351,
        "id": "lal1cx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD YES",
        "url": "https://i.redd.it/9sp4vsyz4ze61.jpg",
        "created": 1612261151.0
    },
    {
        "author": "oaptci",
        "created_utc": 1612286872,
        "id": "lb16wf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Revolut restricts buying GME/AMD - is DTC the master manipulator?",
        "url": "https://www.reddit.com/gallery/lb16wf",
        "created": 1612315672.0
    },
    {
        "author": "lord_lordy_lord",
        "created_utc": 1612365498,
        "id": "lbps16",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AMD play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lbps16/amd_play/",
        "created": 1612394298.0
    },
    {
        "author": "YoungBullxQ",
        "created_utc": 1612199259,
        "id": "la85vp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "What’s the plan for AMD?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la85vp/whats_the_plan_for_amd/",
        "created": 1612228059.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612183365,
        "id": "la27oz",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "The hedge funds have doubled down on AMD and pressured down value by several billion USD last week, now Robin Hood disabled purchase of AMD shares.🌰🌰🌰🌰",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la27oz/the_hedge_funds_have_doubled_down_on_amd_and/",
        "created": 1612212165.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612192736,
        "id": "la5evy",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "AMD is at a discount right now but still a great long term bet.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la5evy/amd_is_at_a_discount_right_now_but_still_a_great/",
        "created": 1612221536.0
    },
    {
        "author": "ASoftEngStudent",
        "created_utc": 1612256395,
        "id": "larhlw",
        "num_comments": 129,
        "num_crossposts": 0,
        "selftext": "This will be a quick DDDD (Data-Driven DD) because it's late and pretty much every WSB post today has been about it. To catch up, [read this post that inspired by investigation](https://www.reddit.com/r/wallstreetbets/comments/lak773/why_were_still_winning_and_why_were_still_going/) and this post that I this does a very good job explaining [the theory](https://www.reddit.com/user/bcRIPster/comments/labq6u/follow_the_crumbs_gme_exposed_the_meta/). Basically, a lot of people here believe that institutions have been naked short selling GME, effectively creating fake or \"counterfeit\" GME stock, and it's there's some systematic fraud going on.\n\nMuch of the discussion has been centered around the [Failure to Deliver data released](https://www.sec.gov/data/foiadocsfailsdatahtm) by the SEC for the first half of Jan. A Failure to Deliver is reported when a broker is unable to deliver a share that they have sold to the clearing house by the settlement date (2 days after the transaction); [see my DDDD discussing what how this all works if you're curious](https://www.reddit.com/r/wallstreetbets/comments/l9sh9e/dddd_why_gme_might_next_week_and_how_it_could/). This can happen for many reason, and in the [examples given by the SEC](https://www.sec.gov/investor/pubs/regsho.htm) includes delays if people are physically delivering share certificates for some reason, and market makers (eg. Citadel) legally selling shares to a buyer without an actual seller (i.e. naked short sale) to provide liquidity; they just need to make sure they're able to later source that share quickly after it. Looks like the theory floating around r/wallstreetbets today is that non-market makers are illegally naked short selling GME, which is the topic of investigation for today.\n\nOne thing I've noticed that's been missing from many of these discussions is a proper analysis of the SEC-provided data on the Failure to Deliver numbers, so I decided to add this to help y'all make some informed decisions.\n\n*Disclaimer - This is not financial advice, and a lot of the content below is my personal opinion and for ENTERTAINMENT PURPOSES ONLY. In fact, the numbers, facts, or explanations presented below could be wrong and be made up and with some satire thrown in. Don't buy random options because some person on the internet says so. Do your own research and come to your own conclusions on what you should do with your own money, and how levered you want to be based on your personal risk tolerance.*\n\n**Methodology**\n\nI'm going to analyze this data using a script to look at a rough transactional value and approximate percentage of volume that the failure-to-deliver shares represent. Now, **these are all rough and kind of inaccurate especially for low-volume tickers** because the SEC data is based on the total number of outstanding failure-to-deliver shares for a particular settlement date. This means that\n\n1. Since you can have the same share being failed to deliver multiple days in a row, shares in these situations will be counted multiple times in all the data shown below.\n2. The earliest possible date shares in a trade can be counted as failed to be delivered is 3 trading days after the transaction occurred, so **literally none of the failure-to-deliver shares represents that day's volume**. However, I'm going to make an assumption that a day's volume will be in the same ball park as the volume from 3 days ago, so it should give a rough estimate. There are quite a few cases, especially with small-caps, where this is clearly not the case, and you will see many cases with a 100+% failure to deliver / volume results for this reason.\n3. The dollar value itself is wrong because it's using the price at settlement date, not the transaction date\n\nHowever, with these caveats, the purpose is to compare GME with other stocks to see if anything stands out using these metrics, using things like dollar value and volume rather than the raw number of shares to normalize the data.\n\n**The Code**\n\n    from collections import defaultdict\n    import time\n    import requests\n    POLYGON_API_KEY = '&lt;ADD YOUR API KEY HERE&gt;'\n    VOLUME_DATA_API_URL = 'https://api.polygon.io/v1/open-close/{}/2021-01-{}?unadjusted=true&amp;apiKey=' + POLYGON_API_KEY\n    \n    data\n    dates_to_stocks = defaultdict(lambda: defaultdict(float))\n    f = open('fail_to_delivers.txt', 'r') # https://www.sec.gov/data/foiadocsfailsdatahtm\n    for line in f:\n        parts = line.split('|');\n        date = parts[0]\n        ticker = parts[2]\n        try:\n            fails = int(parts[3])\n            price = float(parts[5])\n            value_of_fails = price * fails\n            dates_to_stocks[date][ticker] = (value_of_fails, fails)\n        except ValueError:\n            # fails or price was not a number; probably not traded (eg.'.')\n            pass\n    \n    for date, stocks in dates_to_stocks.items():\n        day = int(date[-2:])\n        print('Data for Jan {}'.format(day))\n        sorted_stocks = sorted(stocks.items(), key = lambda stock: stock[1][0])\n        sorted_stocks = filter(lambda stock: stock[1][0] &gt; 10000000, sorted_stocks)\n        for ticker, data in sorted_stocks:\n            val_of_fails = data[0]\n            num_fails = data[1]\n            req = requests.get(url=VOLUME_DATA_API_URL.format(ticker, str(day).zfill(2)))\n            res = req.json()\n            if res['status'] == 'NOT_FOUND':\n                print('No volume data for {}'.format(ticker))\n                continue\n            else:\n                try:\n                    volume = res['volume']\n                except KeyError:\n                    print(res)\n            val_of_fails_in_mill = int(val_of_fails / 1000000)\n            pct_vol = num_fails / volume * 100\n            print('{: &lt;6} ${: &lt;5} {: &lt;9} / {: &lt; 12} {:.2f}% of vol'.format(ticker, str(val_of_fails_in_mill) + 'M', num_fails, volume, pct_vol))\n\nHere's some code I hacked together myself. If anyone sees a bug please let me know and I'll re-calculate all this data, but otherwise you can try this yourself at home to crunch the data yourself after getting a Polygon API key, although you might need additional code to slow down the API requests since the free plan has a rate limit.\n\nIf everything above sounded gibberish to you, this code basically does all the calculations I mentioned above by reading the SEC data where the dollar value &gt; 10M and pulling volume for the day from a third party source.\n\n**The Results**\n\n    Data for Jan 4\n    RMO    $10M   455173    /  10652863    4.27% of vol\n    MP     $10M   338162    /  6012707     5.62% of vol\n    FTSL   $10M   229967    /  466929      49.25% of vol\n    TLT    $11M   73387     /  13491163    0.54% of vol\n    IFF    $11M   106670    /  5109099     2.09% of vol\n    WISH   $11M   651998    /  5947771     10.96% of vol\n    FXH    $12M   115701    /  145029      79.78% of vol\n    BIL    $13M   143387    /  1622120     8.84% of vol\n    BAR    $13M   704752    /  781989      90.12% of vol\n    SCHV   $17M   289146    /  569321      50.79% of vol\n    SFIX   $17M   301939    /  3246553     9.30% of vol\n    HEI    $18M   136300    /  431605      31.58% of vol\n    GP     $18M   632561    /  1922269     32.91% of vol\n    No volume data for IDEXY\n    SPY    $34M   92018     /  110471187   0.08% of vol\n    BABA   $34M   149800    /  25442439    0.59% of vol\n    BLNK   $54M   1271703   /  12417199    10.24% of vol\n    ZM     $55M   164629    /  8708714     1.89% of vol\n    LMND   $79M   650602    /  3774902     17.23% of vol\n    QS     $88M   1043660   /  85437068    1.22% of vol\n    FUBO   $179M  6405264   /  62558258    10.24% of vol\n    Data for Jan 5\n    SFIX   $10M   179535    /  3944760     4.55% of vol\n    ICLN   $10M   373174    /  10835646    3.44% of vol\n    SDC    $10M   934087    /  3951354     23.64% of vol\n    EEM    $10M   210387    /  53418852    0.39% of vol\n    BTAQ   $11M   1109124   /  859406      129.06% of vol\n    AAPL   $12M   95768     /  99232528    0.10% of vol\n    VV     $12M   73006     /  235701      30.97% of vol\n    IGV    $13M   40170     /  760975      5.28% of vol\n    XOP    $14M   240140    /  16129522    1.49% of vol\n    SMH    $14M   64946     /  2349313     2.76% of vol\n    PLTR   $15M   673714    /  29467572    2.29% of vol\n    FUBO   $15M   655567    /  76536531    0.86% of vol\n    IFF    $16M   160881    /  5671482     2.84% of vol\n    BAR    $17M   899469    /  715769      125.66% of vol\n    SNAP   $17M   352312    /  8937007     3.94% of vol\n    LAZR   $18M   575224    /  6835344     8.42% of vol\n    VXF    $18M   112351    /  441366      25.46% of vol\n    HYG    $18M   212911    /  33750660    0.63% of vol\n    SPY    $19M   52889     /  66529182    0.08% of vol\n    BYND   $22M   180249    /  2403615     7.50% of vol\n    ARKK   $22M   181939    /  5517279     3.30% of vol\n    BLNK   $22M   606253    /  8782149     6.90% of vol\n    No volume data for IDEXY\n    Z      $30M   235000    /  2779229     8.46% of vol\n    BILI   $31M   336874    /  9865956     3.41% of vol\n    BBIN   $42M   773948    /  35024       2209.76% of vol\n    SCHZ   $52M   934935    /  862549      108.39% of vol\n    TSLA   $56M   77616     /  32777673    0.24% of vol\n    QS     $140M  2805374   /  56417324    4.97% of vol\n    Data for Jan 6\n    GP     $10M   338197    /  1378176     24.54% of vol\n    Z      $10M   76860     /  2922684     2.63% of vol\n    JDST   $10M   1268335   /  6758651     18.77% of vol\n    SPIB   $10M   291358    /  2240443     13.00% of vol\n    ARKQ   $10M   138595    /  1477357     9.38% of vol\n    TFJL   $10M   448635    /  5522        8124.50% of vol\n    BNGO   $11M   2278342   /  172777252   1.32% of vol\n    QQQM   $11M   88033     /  471996      18.65% of vol\n    ESGV   $11M   166952    /  624422      26.74% of vol\n    GOLD   $12M   505715    /  30821265    1.64% of vol\n    SUSA   $12M   156306    /  132390      118.06% of vol\n    TAN    $13M   123734    /  7412302     1.67% of vol\n    SCZ    $13M   190487    /  2809791     6.78% of vol\n    GME    $13M   772112    /  6112481     12.63% of vol\n    MSTB   $13M   505730    /  36969       1367.98% of vol\n    TAL    $13M   197705    /  3872569     5.11% of vol\n    DFAE   $13M   495805    /  61403       807.46% of vol\n    PHYS   $14M   922154    /  3068779     30.05% of vol\n    IWB    $15M   71351     /  1149399     6.21% of vol\n    KRE    $15M   303042    /  17777218    1.70% of vol\n    IFF    $15M   147942    /  5645878     2.62% of vol\n    SIL    $17M   349238    /  960831      36.35% of vol\n    PFF    $17M   461767    /  10192667    4.53% of vol\n    UNH    $20M   58203     /  6637558     0.88% of vol\n    LMND   $20M   167974    /  2289234     7.34% of vol\n    XSD    $21M   125829    /  236857      53.12% of vol\n    LIT    $23M   324752    /  4054249     8.01% of vol\n    SHOP   $25M   22567     /  1292830     1.75% of vol\n    VXF    $26M   158266    /  1016028     15.58% of vol\n    No volume data for IDEXY\n    QQQ    $30M   97537     /  54595372    0.18% of vol\n    ANET   $31M   110454    /  745824      14.81% of vol\n    TWLO   $32M   96364     /  1878942     5.13% of vol\n    IWO    $35M   124303    /  758017      16.40% of vol\n    ARKG   $38M   411583    /  6510878     6.32% of vol\n    DIS    $39M   222604    /  7660902     2.91% of vol\n    FUBO   $45M   1655636   /  37542985    4.41% of vol\n    JPM    $54M   435864    /  25246578    1.73% of vol\n    AAL    $57M   3738894   /  65261546    5.73% of vol\n    MDY    $61M   146659    /  2313346     6.34% of vol\n    VOO    $69M   204517    /  4875363     4.19% of vol\n    CZA    $71M   949307    /  10055       9441.14% of vol\n    IGV    $87M   250001    /  1560021     16.03% of vol\n    XBI    $120M  860356    /  6578153     13.08% of vol\n    QS     $139M  2336878   /  69830456    3.35% of vol\n    IVV    $160M  431722    /  4380359     9.86% of vol\n    Data for Jan 7\n    FPXI   $10M   144300    /  277414      52.02% of vol\n    ABCL   $10M   257989    /  998242      25.84% of vol\n    Z      $10M   76860     /  3208891     2.40% of vol\n    TWLO   $10M   32612     /  2080639     1.57% of vol\n    ZNGA   $10M   1134696   /  12840024    8.84% of vol\n    CHEK   $11M   7154179   /  23512387    30.43% of vol\n    CEO    $11M   124581    /  544921      22.86% of vol\n    ARKG   $11M   122197    /  6784236     1.80% of vol\n    SFIX   $11M   199138    /  2078188     9.58% of vol\n    MOO    $13M   161780    /  438052      36.93% of vol\n    JPM    $14M   109199    /  22360722    0.49% of vol\n    GME    $14M   799328    /  6195565     12.90% of vol\n    ESGV   $15M   214750    /  323435      66.40% of vol\n    SUSA   $16M   194155    /  547800      35.44% of vol\n    WMT    $16M   111153    /  6984597     1.59% of vol\n    PFF    $16M   443734    /  8849961     5.01% of vol\n    FEM    $18M   687869    /  145383      473.14% of vol\n    VTV    $18M   153510    /  3890983     3.95% of vol\n    EMQQ   $18M   294485    /  351449      83.79% of vol\n    VIG    $18M   133579    /  1444204     9.25% of vol\n    UNH    $19M   54570     /  3413867     1.60% of vol\n    ABEV   $19M   6460712   /  29035247    22.25% of vol\n    JNK    $21M   200732    /  7589803     2.64% of vol\n    ZM     $22M   65852     /  5702045     1.15% of vol\n    No volume data for IDEXY\n    IWM    $25M   125200    /  24438036    0.51% of vol\n    TDOC   $27M   132485    /  5957242     2.22% of vol\n    XLV    $31M   273094    /  12449811    2.19% of vol\n    AMAT   $31M   347709    /  8900351     3.91% of vol\n    ANET   $32M   113141    /  897675      12.60% of vol\n    AAPL   $34M   272530    /  111251301   0.24% of vol\n    IBB    $35M   232435    /  2757909     8.43% of vol\n    SCZ    $35M   506453    /  2423106     20.90% of vol\n    TAL    $39M   588989    /  4953466     11.89% of vol\n    LIT    $39M   568200    /  2699742     21.05% of vol\n    SLYV   $42M   600000    /  784366      76.49% of vol\n    MDYG   $43M   600000    /  361719      165.87% of vol\n    MSFT   $44M   208844    /  27957876    0.75% of vol\n    XBI    $49M   341925    /  4368284     7.83% of vol\n    QS     $53M   855908    /  39043118    2.19% of vol\n    IGV    $65M   192848    /  1111927     17.34% of vol\n    IWO    $75M   256293    /  542558      47.24% of vol\n    SPY    $82M   221390    /  69043996    0.32% of vol\n    FUBO   $85M   3144764   /  26265288    11.97% of vol\n    MDY    $92M   210989    /  1059600     19.91% of vol\n    LMND   $131M  1100360   /  6843096     16.08% of vol\n    No volume data for CRUU\n    QQQ    $262M  853202    /  30946247    2.76% of vol\n    Data for Jan 8\n    GME    $10M   555658    /  6529206     8.51% of vol\n    SAM    $10M   10122     /  64727       15.64% of vol\n    HSBC   $10M   362391    /  2122407     17.07% of vol\n    TWLO   $10M   28519     /  2165649     1.32% of vol\n    ZNGA   $10M   1058523   /  18612307    5.69% of vol\n    XSOE   $10M   257305    /  1284354     20.03% of vol\n    Z      $10M   76094     /  2436382     3.12% of vol\n    FNF    $11M   284083    /  1685307     16.86% of vol\n    FXI    $11M   246994    /  25366481    0.97% of vol\n    DXCM   $11M   30698     /  1290952     2.38% of vol\n    IWO    $12M   40025     /  379305      10.55% of vol\n    BILL   $12M   90614     /  1670688     5.42% of vol\n    BNGO   $12M   2489241   /  140354760   1.77% of vol\n    IAI    $12M   148122    /  28095       527.22% of vol\n    MEDP   $12M   91875     /  189656      48.44% of vol\n    EDOC   $12M   642212    /  257984      248.93% of vol\n    DRIV   $13M   517797    /  2177619     23.78% of vol\n    MXIM   $14M   152763    /  3687022     4.14% of vol\n    ANGL   $14M   449592    /  1178388     38.15% of vol\n    FEMB   $14M   398368    /  177232      224.77% of vol\n    AAP    $15M   90683     /  867553      10.45% of vol\n    ORA    $17M   153279    /  1270618     12.06% of vol\n    SFIX   $17M   303687    /  3136663     9.68% of vol\n    ABEV   $17M   5994417   /  27822035    21.55% of vol\n    MJ     $18M   1079848   /  3922150     27.53% of vol\n    TBT    $19M   1082527   /  3509092     30.85% of vol\n    AKICU  $19M   1869585   /  159822      1169.79% of vol\n    BYND   $21M   181587    /  4508501     4.03% of vol\n    SUB    $21M   203087    /  221214      91.81% of vol\n    LQD    $22M   166506    /  13375076    1.24% of vol\n    No volume data for IDEXY\n    AMC    $23M   11547981  /  39954025    28.90% of vol\n    SNOW   $27M   90756     /  9197063     0.99% of vol\n    ANET   $29M   98754     /  1112848     8.87% of vol\n    XLB    $30M   395911    /  8495838     4.66% of vol\n    TAL    $30M   475832    /  4625189     10.29% of vol\n    VPL    $31M   383850    /  769567      49.88% of vol\n    CLOV   $33M   2063128   /  15605154    13.22% of vol\n    SCHE   $34M   1094305   /  6271011     17.45% of vol\n    IBB    $36M   233035    /  4464357     5.22% of vol\n    BHP    $38M   527450    /  2798855     18.85% of vol\n    QQQ    $42M   133818    /  34700266    0.39% of vol\n    HHC    $43M   541031    /  501246      107.94% of vol\n    AZN    $44M   881208    /  11243137    7.84% of vol\n    VTI    $45M   229492    /  7663316     2.99% of vol\n    QS     $51M   835859    /  26235605    3.19% of vol\n    FUBO   $52M   1852827   /  20886121    8.87% of vol\n    AMAT   $53M   560863    /  9177334     6.11% of vol\n    VXF    $66M   388894    /  363270      107.05% of vol\n    JNK    $126M  1164476   /  7798093     14.93% of vol\n    IGV    $126M  363012    /  590515      61.47% of vol\n    ACWI   $129M  1398754   /  3736768     37.43% of vol\n    GNR    $167M  3432554   /  191541      1792.07% of vol\n    TAN    $177M  1458720   /  3981915     36.63% of vol\n    LMND   $181M  1192325   /  7598825     15.69% of vol\n    MDY    $260M  592088    /  992982      59.63% of vol\n    DVN    $342M  18426493  /  14024601    131.39% of vol\n    Data for Jan 11\n    VXX    $10M   615868    /  41311500    1.49% of vol\n    LIT    $10M   146194    /  1960712     7.46% of vol\n    BNGO   $10M   2223632   /  145967474   1.52% of vol\n    ZNGA   $10M   1056500   /  27875624    3.79% of vol\n    VSS    $10M   84361     /  235578      35.81% of vol\n    Z      $11M   76527     /  1669983     4.58% of vol\n    CRSP   $11M   58363     /  2742944     2.13% of vol\n    SOXX   $11M   28921     /  546088      5.30% of vol\n    TM     $11M   75693     /  341885      22.14% of vol\n    EDIT   $11M   129779    /  5099744     2.54% of vol\n    XBI    $11M   79255     /  3296760     2.40% of vol\n    EDOC   $12M   597446    /  1407725     42.44% of vol\n    SCHP   $12M   200279    /  1427144     14.03% of vol\n    GME    $12M   703110    /  15188257    4.63% of vol\n    EZU    $13M   283987    /  7103235     4.00% of vol\n    TLT    $13M   87524     /  8517178     1.03% of vol\n    AZN    $13M   260777    /  11826267    2.21% of vol\n    XSOE   $13M   319355    /  1291316     24.73% of vol\n    MSTR   $13M   25707     /  1496929     1.72% of vol\n    IAI    $13M   159892    /  59452       268.94% of vol\n    BHP    $14M   193457    /  2427915     7.97% of vol\n    NVDA   $14M   26951     /  13129807    0.21% of vol\n    IGV    $14M   41420     /  575795      7.19% of vol\n    ABB    $14M   489684    /  2267141     21.60% of vol\n    VV     $15M   86043     /  239841      35.88% of vol\n    HYS    $15M   157848    /  218379      72.28% of vol\n    SJNK   $15M   575836    /  2432751     23.67% of vol\n    RPRX   $16M   312400    /  3483830     8.97% of vol\n    SPIP   $16M   519650    /  840202      61.85% of vol\n    MARA   $16M   611878    /  94267180    0.65% of vol\n    FTFT   $16M   2137024   /  28583008    7.48% of vol\n    PLUG   $16M   305936    /  46587009    0.66% of vol\n    PLTR   $17M   684687    /  33011079    2.07% of vol\n    TAN    $18M   152211    /  3487804     4.36% of vol\n    No volume data for SPXSZZZZ\n    FNX    $19M   225556    /  25522       883.77% of vol\n    SLAB   $19M   146585    /  453094      32.35% of vol\n    ARKG   $20M   195329    /  5248643     3.72% of vol\n    ICLN   $21M   657002    /  13666311    4.81% of vol\n    MJ     $22M   1333420   /  3852411     34.61% of vol\n    No volume data for IDEXY\n    FUBO   $24M   906355    /  13276816    6.83% of vol\n    ROKU   $25M   62953     /  5887016     1.07% of vol\n    DNL    $25M   324139    /  24767       1308.75% of vol\n    TAL    $25M   380482    /  1975338     19.26% of vol\n    VXUS   $27M   443558    /  3730976     11.89% of vol\n    SUB    $28M   265462    /  188896      140.53% of vol\n    ABEV   $29M   9769323   /  18941617    51.58% of vol\n    ANET   $30M   100395    /  529749      18.95% of vol\n    TMO    $31M   60583     /  1694125     3.58% of vol\n    DD     $31M   380089    /  15582944    2.44% of vol\n    XLK    $40M   307169    /  8969809     3.42% of vol\n    JNK    $43M   401204    /  9011848     4.45% of vol\n    SPIB   $44M   1199313   /  1777332     67.48% of vol\n    QS     $47M   836176    /  19469271    4.29% of vol\n    M      $55M   4505779   /  14361407    31.37% of vol\n    EEM    $56M   1035795   /  40965351    2.53% of vol\n    TSLA   $89M   102030    /  60262217    0.17% of vol\n    SPY    $99M   260673    /  51385646    0.51% of vol\n    DVN    $115M  6396708   /  11074952    57.76% of vol\n    TME    $159M  7597588   /  23335979    32.56% of vol\n    QQQ    $195M  611648    /  33526327    1.82% of vol\n    SNOW   $451M  1503729   /  4580562     32.83% of vol\n    Data for Jan 12\n    JHMM   $10M   216426    /  238965      90.57% of vol\n    SIVB   $10M   24577     /  546261      4.50% of vol\n    EEMA   $10M   118409    /  113040      104.75% of vol\n    TIP    $10M   86938     /  3522835     2.47% of vol\n    BYND   $11M   94389     /  3294350     2.87% of vol\n    ACIA   $11M   135144    /  4810813     2.81% of vol\n    CDC    $11M   203290    /  60438       336.36% of vol\n    RGNX   $11M   234259    /  442580      52.93% of vol\n    QS     $11M   213000    /  51908268    0.41% of vol\n    XLU    $11M   192507    /  12329318    1.56% of vol\n    ENB    $12M   368137    /  6759556     5.45% of vol\n    FTFT   $12M   2311209   /  15419147    14.99% of vol\n    GOVT   $12M   470217    /  9110172     5.16% of vol\n    SOCL   $13M   207702    /  39866       521.00% of vol\n    XSOE   $13M   321206    /  774516      41.47% of vol\n    No volume data for KBCSY\n    SFIX   $13M   239777    /  5489995     4.37% of vol\n    PXD    $13M   103193    /  27013469    0.38% of vol\n    DRIV   $13M   529616    /  1199349     44.16% of vol\n    PLUG   $14M   260722    /  110733629   0.24% of vol\n    No volume data for CHL\n    No volume data for AMADY\n    SWKS   $14M   89872     /  1821632     4.93% of vol\n    JNK    $14M   134848    /  8531417     1.58% of vol\n    FUBO   $14M   539301    /  157218493   0.34% of vol\n    HYG    $14M   170507    /  41774036    0.41% of vol\n    USMV   $14M   218346    /  4136809     5.28% of vol\n    DIA    $15M   49808     /  2300371     2.17% of vol\n    SUB    $15M   146245    /  293345      49.85% of vol\n    SJNK   $15M   588370    /  4179598     14.08% of vol\n    PLTR   $17M   659322    /  54968620    1.20% of vol\n    NFRA   $17M   317321    /  123815      256.29% of vol\n    TSLA   $18M   22211     /  46768359    0.05% of vol\n    VTEB   $18M   328242    /  1326346     24.75% of vol\n    EZU    $18M   409157    /  9724870     4.21% of vol\n    LSI    $19M   163476    /  942907      17.34% of vol\n    AJAX   $19M   1647672   /  2626688     62.73% of vol\n    EDC    $20M   193869    /  163829      118.34% of vol\n    BLI    $20M   232710    /  519080      44.83% of vol\n    DASH   $21M   129338    /  14198812    0.91% of vol\n    IEF    $22M   187689    /  6569902     2.86% of vol\n    ASHR   $22M   536685    /  3394356     15.81% of vol\n    SMH    $24M   103959    /  3226970     3.22% of vol\n    TAL    $24M   367792    /  5291590     6.95% of vol\n    DNL    $25M   325232    /  25152       1293.07% of vol\n    ACCD   $26M   569052    /  668698      85.10% of vol\n    MXIM   $26M   280268    /  1990545     14.08% of vol\n    CRM    $26M   122621    /  21713794    0.56% of vol\n    KRE    $27M   478683    /  9601888     4.99% of vol\n    ANET   $28M   92939     /  1870397     4.97% of vol\n    VNQ    $33M   405838    /  7925021     5.12% of vol\n    MRVL   $35M   711824    /  6457737     11.02% of vol\n    MBB    $36M   333534    /  10549726    3.16% of vol\n    XLP    $39M   591884    /  11062255    5.35% of vol\n    SPMB   $42M   1607008   /  541977      296.51% of vol\n    IPOE   $50M   2656436   /  14469222    18.36% of vol\n    TMKRU  $87M   8457409   /  770303      1097.93% of vol\n    TWLO   $103M  287038    /  2545738     11.28% of vol\n    VEA    $289M  5978670   /  8073208     74.06% of vol\n    SNOW   $357M  1220616   /  6575982     18.56% of vol\n    Data for Jan 13\n    JHMM   $10M   212907    /  102491      207.73% of vol\n    ALNY   $10M   61864     /  2453711     2.52% of vol\n    SCHE   $10M   319745    /  1476711     21.65% of vol\n    LSI    $10M   92053     /  2524023     3.65% of vol\n    ACTC   $10M   426995    /  10590305    4.03% of vol\n    PFF    $10M   287062    /  7555964     3.80% of vol\n    GOOGL  $10M   6275      /  1182889     0.53% of vol\n    PXD    $11M   85102     /  6736818     1.26% of vol\n    No volume data for AMADY\n    LYV    $11M   158908    /  4368171     3.64% of vol\n    QS     $11M   206723    /  24774402    0.83% of vol\n    XLU    $11M   192500    /  13354398    1.44% of vol\n    VSGX   $12M   201319    /  226385      88.93% of vol\n    CDC    $12M   222430    /  40763       545.67% of vol\n    HYG    $12M   148273    /  47749801    0.31% of vol\n    GME    $13M   662524    /  288667273   0.23% of vol\n    AAXJ   $13M   143098    /  645277      22.18% of vol\n    MIC    $13M   465475    /  3217373     14.47% of vol\n    AI     $13M   103081    /  6413417     1.61% of vol\n    EEMA   $14M   157698    /  124024      127.15% of vol\n    VCR    $14M   51164     /  123801      41.33% of vol\n    FNGU   $14M   53279     /  292296      18.23% of vol\n    VPL    $14M   181814    /  387790      46.88% of vol\n    CREE   $15M   124749    /  1224481     10.19% of vol\n    ICLN   $15M   463906    /  9817667     4.73% of vol\n    BPY    $16M   960472    /  3544070     27.10% of vol\n    EWH    $16M   634086    /  4209409     15.06% of vol\n    No volume data for HOKCY\n    Z      $16M   115078    /  1848380     6.23% of vol\n    GS     $16M   56023     /  4904304     1.14% of vol\n    VXF    $17M   99541     /  952044      10.46% of vol\n    EWU    $17M   579075    /  2283375     25.36% of vol\n    BBBY   $19M   899486    /  19195438    4.69% of vol\n    CNQ    $20M   758170    /  6620696     11.45% of vol\n    TSLA   $21M   25242     /  33637855    0.08% of vol\n    RETL   $22M   178031    /  54044       329.42% of vol\n    PLTR   $22M   852932    /  103565952   0.82% of vol\n    BNTX   $24M   229376    /  1823779     12.58% of vol\n    FMS    $25M   594469    /  996987      59.63% of vol\n    SPG    $25M   293022    /  8669323     3.38% of vol\n    DNL    $25M   329444    /  17950       1835.34% of vol\n    TER    $27M   197090    /  1461976     13.48% of vol\n    MDY    $27M   62265     /  885141      7.03% of vol\n    SPY    $29M   78981     /  45604510    0.17% of vol\n    TMKRU  $29M   2895006   /  602858      480.21% of vol\n    LMND   $44M   257874    /  9253096     2.79% of vol\n    NIO    $46M   751947    /  233834179   0.32% of vol\n    ASHR   $58M   1345934   /  1977253     68.07% of vol\n    CCIV   $72M   5142902   /  185613695   2.77% of vol\n    SCHF   $84M   2261962   /  2374397     95.26% of vol\n    QQQ    $100M  319499    /  23459898    1.36% of vol\n    IEMG   $106M  1636832   /  24605232    6.65% of vol\n    TWLO   $155M  414331    /  2983315     13.89% of vol\n    SNOW   $292M  997932    /  5770968     17.29% of vol\n    Data for Jan 14\n    FUTU   $10M   147467    /  8267876     1.78% of vol\n    GLD    $10M   58911     /  13580504    0.43% of vol\n    RKT    $10M   529482    /  6065737     8.73% of vol\n    GOOG   $10M   6178      /  1190697     0.52% of vol\n    JKS    $11M   174686    /  3299317     5.29% of vol\n    NIO    $11M   179015    /  100212842   0.18% of vol\n    BBY    $11M   98786     /  2010214     4.91% of vol\n    ACWI   $11M   123023    /  4486363     2.74% of vol\n    IWM    $11M   54832     /  34126749    0.16% of vol\n    NARI   $11M   120313    /  727912      16.53% of vol\n    VIS    $11M   66167     /  156674      42.23% of vol\n    No volume data for CCIVU\n    BNDX   $12M   207005    /  2944006     7.03% of vol\n    ACTCW  $12M   1746528   /  1251451     139.56% of vol\n    ESGU   $12M   138711    /  18958336    0.73% of vol\n    TFI    $12M   234004    /  281979      82.99% of vol\n    ACI    $12M   718057    /  2853713     25.16% of vol\n    ESGV   $12M   178184    /  305336      58.36% of vol\n    VONV   $12M   104521    /  210425      49.67% of vol\n    QS     $13M   230667    /  13774941    1.67% of vol\n    BUG    $13M   477973    /  443386      107.80% of vol\n    TSJA   $13M   529310    /  10438       5070.99% of vol\n    EWU    $13M   446834    /  3298766     13.55% of vol\n    AAXJ   $13M   146519    /  1052459     13.92% of vol\n    ALLK   $14M   114451    /  239036      47.88% of vol\n    PLTR   $14M   549219    /  33345821    1.65% of vol\n    XBI    $14M   96793     /  6175075     1.57% of vol\n    IBM    $14M   118000    /  7620404     1.55% of vol\n    SPCE   $15M   566065    /  58849108    0.96% of vol\n    BNTX   $15M   152319    /  1928180     7.90% of vol\n    EWQ    $15M   460861    /  930296      49.54% of vol\n    INTC   $15M   275319    /  76137919    0.36% of vol\n    MUB    $15M   136460    /  1872076     7.29% of vol\n    IDYA   $16M   1070477   /  192964      554.75% of vol\n    SPDW   $17M   492928    /  1052552     46.83% of vol\n    MCK    $18M   98869     /  699468      14.13% of vol\n    BIL    $18M   202092    /  2021703     10.00% of vol\n    NOC    $18M   63242     /  1396814     4.53% of vol\n    GME    $19M   621483    /  94480858    0.66% of vol\n    FMS    $19M   469951    /  543332      86.49% of vol\n    AI     $20M   145990    /  3673395     3.97% of vol\n    TSLA   $22M   25886     /  31591648    0.08% of vol\n    RETL   $22M   179448    /  100796      178.03% of vol\n    ZM     $22M   62445     /  9410703     0.66% of vol\n    VGT    $23M   65705     /  443651      14.81% of vol\n    LMND   $24M   135997    /  15428353    0.88% of vol\n    LQD    $25M   185355    /  22077842    0.84% of vol\n    XLC    $25M   388611    /  2548053     15.25% of vol\n    SPY    $26M   68916     /  50152199    0.14% of vol\n    AZN    $28M   552409    /  11706274    4.72% of vol\n    FUBO   $28M   792423    /  33088152    2.39% of vol\n    TMKRU  $29M   2884289   /  64652       4461.25% of vol\n    JWN    $31M   851212    /  12049764    7.06% of vol\n    NCNO   $36M   532284    /  1354842     39.29% of vol\n    TTD    $38M   48618     /  644636      7.54% of vol\n    VIPS   $39M   1386042   /  6556018     21.14% of vol\n    MSOS   $43M   967278    /  1317363     73.43% of vol\n    AZRE   $49M   998097    /  220310      453.04% of vol\n    SMH    $55M   237195    /  3371846     7.03% of vol\n    RLAY   $64M   1535964   /  2605340     58.95% of vol\n    ASHR   $67M   1557492   /  2570496     60.59% of vol\n    ACTC   $80M   3508271   /  8994587     39.00% of vol\n    CCIV   $141M  8464902   /  142448106   5.94% of vol\n    IEMG   $515M  7881052   /  12504033    63.03% of vol\n\nI'll let y'all discuss what this means in the comments. Have Fun.\n\nEDIT - Someone pointed out a mistake in my script. Fixed, and added a bit more data\n\nEDIT 2 - For those without enough brain wrinkles / attention span to interpret this - There may have been shady shit in the first few days of Jan, but doesn't look like anything went on in the second week. Will need to wait till Feb 15 to see data in the last few weeks of Jan. I'll probably do some more analysis when that time comes",
        "subreddit": "wallstreetbets",
        "title": "DDDD - Is GME being Illegally Naked Short Sold?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/larhlw/dddd_is_gme_being_illegally_naked_short_sold/",
        "created": 1612285195.0
    },
    {
        "author": "Decarz",
        "created_utc": 1612188999,
        "id": "la402y",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Keep your eye on these to undervalued stocks,,, ( BLXX ) Bloxx Inc Gold ; low O/S Shares &amp; has a Low Float.. ( ARST ) Arista Financial Corp ,,High Volume accumulation over the past 2weeks.. Both stocks has Tremendous Potential To Surge Over 1000% from here.....",
        "url": "https://www.reddit.com/r/pennystocks/comments/la402y/keep_your_eye_on_these_to_undervalued_stocks_blxx/",
        "created": 1612217799.0
    },
    {
        "author": "Ruski-Medved",
        "created_utc": 1612198595,
        "id": "la7v85",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Arista Networks ANET",
        "url": "https://www.reddit.com/r/stocks/comments/la7v85/arista_networks_anet/",
        "created": 1612227395.0
    },
    {
        "author": "Decarz",
        "created_utc": 1612188999,
        "id": "la402y",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Keep your eye on these to undervalued stocks,,, ( BLXX ) Bloxx Inc Gold ; low O/S Shares &amp; has a Low Float.. ( ARST ) Arista Financial Corp ,,High Volume accumulation over the past 2weeks.. Both stocks has Tremendous Potential To Surge Over 1000% from here.....",
        "url": "https://www.reddit.com/r/pennystocks/comments/la402y/keep_your_eye_on_these_to_undervalued_stocks_blxx/",
        "created": 1612217799.0
    }
]