[
    {
        "author": "FilmLifeVlog",
        "created_utc": 1631045846,
        "id": "pjv190",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Investing in analog devices. Is it a crazy idea???",
        "url": "https://youtube.com/watch?v=QEEJuYHUFm0&amp;feature=share",
        "created": 1631074646.0
    },
    {
        "author": "investing-scientist2",
        "created_utc": 1630599692,
        "id": "pgl6ia",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Here is a couple of stocks that might be worth your attention this week. They were selected using a couple of criteria - most of them heavily rely an the company's fundamentals; the analysts recommendations are only provided as a kind of support for the hand-picked names. This is why I’m calling the approach a **consensus strategy.** \n\nThe stocks I’m going to present you below are generally believed to outperform the stock market in the coming months, they have a consensus recommendation of Buy, their fundamentals are scored considerably better than most stocks and their average target price by stock analysts is above current market valuation.\n\nIn order to consider buying the stock’s shares, the following criteria need to be satisfied:\n\n* **TheStreet score**: A+, A or A-\n* **Zacks Rank**: 1 (Strong Buy), 2 (Buy) or 3 (Hold)\n* **Weiss Ratings recommendation**: A or B\n* **Yahoo Finance recommendation**: at least mixed Buy/Hold\n* **Yahoo Finance target price**: min. 5% higher than current price\n* **Piotroski F-Score**: min. 4\n* **InvestorsObserver Overall Score**: min. 50  \n\n**Note**: Descriptions of those criteria are provided at the end of this post as well as [HERE](https://www.investing-scientist.com/research/top-stocks-to-buy-a-consensus-strategy/). If you decide to buy any of the below stocks, you might want to consider the following selling conditions (at least one of them should be satisfied):\n\n* price is higher or close to target\n* profit is in range 20% – 30%\n* loss is higher than 50%\n* TheStreet recommendation is changed to Sell\n* Weiss Ratings recommendation is changed to Sell\n* Yahoo Finance recommendation is changed to Sell\n\n###### Let’s now take a look at the stocks I’ve identified with this strategy today.\n\n&amp;#x200B;\n\n### APPLE INC (AAPL)\n\n**Sector**: Electronic Technology  \n**Industry**: Telecommunications Equipment  \n**Description**: Apple, Inc engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other variety of related services. Its products and services include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, Apple Care, iCloud, digital content stores, streaming, and licensing services. The company was founded by Steven Paul Jobs, Ronald Gerald Wayne, and Stephen G. Wozniak in 1977 and is headquartered in Cupertino, CA.  \n**Dividend**: Apple pays an annual dividend of $0.88 per share, with a dividend yield of 0.57%. AAPL's most recent quarterly dividend payment was made to shareholders of record on Thursday, August 12. The company has grown its dividend for the last 8 consecutive years and is increasing its dividend by an average of 9.50% each year. Apple pays out 26.83% of its earnings out as a dividend.  \n**Current valuation**: $153.72\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$166.23**  \nYahoo Finance 1 year change: **8.14%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **58**\n\n&amp;#x200B;\n\n### BROADCOM INC (AVGO)\n\n**Sector**: Electronic Technology  \n**Industry**: Semiconductors  \n**Description**: Broadcom, Inc. is a global technology company, which designs, develops and supplies semiconductor and infrastructure software solutions. It operates through the following segments: Semiconductor Solutions and Infrastructure Software. The Semiconductor Solutions segment manages movement of data in data center, telecom, enterprise and embedded networking applications. The Infrastructure Software segment provides a portfolio of mainframe, enterprise and storage area networking solutions.  \n**Dividend**: Broadcom pays an annual dividend of $14.40 per share, with a dividend yield of 2.93%. AVGO's most recent quarterly dividend payment was made to shareholders of record on Wednesday, June 30. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 40.53% each year. Broadcom pays out 78.05% of its earnings out as a dividend.  \n**Current valuation**: $491.48\n\n##### Valuation of entry parameters:\n\nTheStreet score: A  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$530.62**  \nYahoo Finance 1 year change: **7.96%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **76**\n\n&amp;#x200B;\n\n### COMCAST CORP (CMCSA)\n\n**Sector**: Consumer Services  \n**Industry**: Cable/Satellite TV  \n**Description**: Comcast Corporation is a media and technology company. The Company has two primary businesses: Comcast Cable and NBCUniversal. Its Comcast Cable business operates in the Cable Communications segment. Its NBCUniversal business operates in four business segments: Cable Networks, Broadcast Television, Filmed Entertainment and Theme Parks.  \n**Dividend**: Comcast pays an annual dividend of $1.00 per share, with a dividend yield of 1.62%. CMCSA's next quarterly dividend payment will be made to shareholders of record on Wednesday, October 27. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 23.96% each year. Comcast pays out 38.31% of its earnings out as a dividend.  \n**Current valuation**: $61.64\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$66.74**  \nYahoo Finance 1 year change: **8.27%**  \nPiotroski F-Score: **5**  \nInvestorsObserver Overall Score: **70**\n\n&amp;#x200B;\n\n### CRA INTERNATIONAL INC (CRAI)\n\n**Sector**: Commercial Services  \n**Industry**: Miscellaneous Commercial Services  \n**Description**: CRA International, Inc. is a consulting firm, which engages in provision of economic, financial and management consulting services. It offers consulting services through the litigation, regulatory, financial, and management consulting areas. The company was founded in 1965 and is headquartered in Boston, MA.  \n**Dividend**: CRA International pays an annual dividend of $1.04 per share, with a dividend yield of 1.06%. CRAI's next quarterly dividend payment will be made to shareholders of record on Friday, September 10. The company has grown its dividend for the last 4 consecutive years and is increasing its dividend by an average of 17.21% each year. CRA International pays out 31.04% of its earnings out as a dividend.  \n**Current valuation**: $95.0\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Strong Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$110.0**  \nYahoo Finance 1 year change: **15.79%**  \nPiotroski F-Score: **8**  \nInvestorsObserver Overall Score: **85**\n\n&amp;#x200B;\n\n### CVS HEALTH CORP (CVS)\n\n**Sector**: Retail Trade  \n**Industry**: Drugstore Chains  \n**Description**: CVS Health Corp. engages in the provision of health care services. It operates through the following segments: Pharmacy Services, Retail or Long Term Care, Health Care Benefits, and Corporate/Other. The company was founded by Stanley P. Goldstein and Ralph Hoagland in 1963 and is headquartered in Woonsocket, RI.  \n**Dividend**: CVS Health pays an annual dividend of $2.00 per share, with a dividend yield of 2.29%. CVS's most recent quarterly dividend payment was made to shareholders of record on Monday, August 2. CVS Health pays out 26.67% of its earnings out as a dividend.  \n**Current valuation**: $86.89\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$96.32**  \nYahoo Finance 1 year change: **10.85%**  \nPiotroski F-Score: **4**  \nInvestorsObserver Overall Score: **74**\n\n&amp;#x200B;\n\n### JOHNSON &amp; JOHNSON (JNJ)\n\n**Sector**: Health Technology  \n**Industry**: Pharmaceuticals: Major  \n**Description**: Johnson \\&amp;amp; Johnson is a holding company, which is engaged in the research and development, manufacture and sale of a range of products in the healthcare field. It operates through three segments: Consumer, Pharmaceutical and Medical Devices. Its primary focus is products related to human health and well-being. Its research facilities are located in the United States, Belgium, Brazil, Canada, China, France, Germany, India, Israel, Japan, the Netherlands, Singapore, Switzerland and the United Kingdom.  \n**Dividend**: Johnson &amp; Johnson pays an annual dividend of $4.24 per share, with a dividend yield of 2.43%. JNJ's next quarterly dividend payment will be made to shareholders of record on Tuesday, September 7. The company has grown its dividend for the last 59 consecutive years and is increasing its dividend by an average of 6.23% each year. Johnson &amp; Johnson pays out 52.80% of its earnings out as a dividend.  \n**Current valuation**: $174.93\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$189.61**  \nYahoo Finance 1 year change: **8.39%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **64**  \n\n\n \n\n#### Now, a few words on the criteria I’m using and sources of data.\n\n**1. TheStreet score**\n\nThe first filtering step is to get stocks with Buy recommendation at TheStreet stock screener. I’m only keeping stocks with A+, A or A- rating (top ones), although A-, B+, B and B- are Buys as well.\n\nFrom thestreet.com:\n\n***A (Excellent)*** *– The stock has an excellent track record for maximizing performance while minimizing risk, thus delivering the best possible combination of total return on investment and reduced volatility. It has made the most of the recent economic environment to maximize risk-adjusted returns compared to other stocks. While past performance is just an indication — not a guarantee — we believe this fund is among the most likely to deliver superior performance relative to risk in the future as well.*\n\nAnd about the methodology (source: https://www.thestreet.com/r/ratings/reports/detail/T.html):\n\n*TheStreet Ratings’ stock model projects a stock’s total return potential over a 12-month period including both price appreciation and* ***dividends****. Our Buy, Hold or Sell ratings designate how we expect these stocks to perform against a general benchmark of the equities market and interest rates. While our model is quantitative, it utilizes both* ***subjective*** *and* ***objective*** *elements. For instance, subjective elements include expected equities market returns, future interest rates, implied industry outlook and forecasted company earnings. Objective elements include volatility of past operating revenues, financial strength, and company cash flows.*\n\n**2. Zacks Rank**\n\nIt is required that the Zacks Rank is Hold, Buy or Strong Buy (so we’re avoiding stocks with Sell and Strong Sell recommendations). The Zacks Rating utilizes a completely different system, based on company earnings-related data, in particular earnings estimate revisions and earnings surprises, to predict profitability of holding the company’s shares. More from https://www.zacks.com/education/stock-education/zacks-rank-guide-6:\n\n*A portfolio of Zacks Rank #1 (Strong Buy) stocks has beaten the market in 26 of the last 31 years with an average annual return of* ***+24.3%*** *a year; more than double that of the S&amp;P 500’s +10.6% .*\n\n**3. Weiss Ratings recommendation**\n\nWe’re only keeping stocks with Buy (B) or Strong Buy (A) recommendation.\n\nWjat are these scores? This is what I found at their website:\n\n*“A” Rating:* ***Excellent.*** *The company’s stock has an excellent track record for providing strong performance with lower-than-average risk, and it is trading at a price that represents good value relative to the company’s earnings prospects. While past performance is no guarantee of future results, our opinion is that this stock is among the most likely to deliver superior performance relative to risk in the future. Of course, even the best stocks can decline in a down market. But our “A” rating can generally be considered the equivalent of a “****Strong Buy****“.*\n\n*“B” rating:* ***Good.*** *The company’s stock has a good track record for delivering a balance of performance and risk. While the risk-adjusted performance of any stock is subject to change, our opinion is that this stock is a good value, with good prospects for outperforming the market. Although even good investments can decline in a down market, our “B” rating is considered the equivalent of a “****Buy****“.*\n\n**4.  Yahoo Finance  recommendation and target price**\n\nIt is required that the Yahoo Finance stock recommendation is at least mixed Buy/Hold from experts. Additionally, the predicted target price (average, from experts) should be at least 5% higher than the current one.\n\n**5. Piotroski F-Score**\n\nThe Piotroski score is a number between 0-9 that reflects nine criteria used to determine the strength of a company’s financial situation, including profitability, leverage or operating efficiency. Zero is the worst value and nine is the best. As we can read in[ Piotroski’s paper](https://pdfs.semanticscholar.org/9dc9/b030da18ab28d1e1a1bbf7e33fb5911f189e.pdf) from 2000:\n\n*In addition, an investment strategy that buys expected winners and shorts expected losers generates a* ***23% annual return*** *between 1976 and 1996, and the strategy appears to be robust across time and to controls for alternative investment strategies.*\n\nIt is required that the score is 4 or higher. The values were retrieved from https://www.gurufocus.com.\n\n**6. InvestorsObserver Overall Score**\n\nThe rank has a value in between 0 and 100. It takes into account both **technical** analysis and **fundamental** stock data. An Overall Rank of N means that a given company is rated above N% of stocks, therefore the higher the number, the better. My requirement is that the company has InvestorsObserver Overall score of at least 50.\n\n*The Overall Score combines our two technical scores (Short Term and Long Term) with our Fundamental Score into one metric. This makes our overall score a great place to start when evaluating stocks, regardless of your investing style.*\n\n*A low score doesn’t necessarily mean a stock is likely to go down, just that our system doesn’t think there’s much of a bullish case for it.*\n\nPlease note that the company profile data (short description) was taken from  tradingview (sometimes I shortened it) and dividend data was retrieved from MarketBeat.\n\nI hope you enjoyed the reading. What do you think about this stock selection and the strategy? Feel free to leave a comment below.\n\n*Michael*\n\n&amp;#x200B;\n\nDisclosures:\n\n* What you see here is my personal opinion, my own investments and should not be treated as investing advice\n* I’m an amateur investor",
        "subreddit": "investing",
        "title": "Six attractive stocks IMHO (AAPL AVGO CMCSA CRAI CVS JNJ). What do you think?",
        "url": "https://www.reddit.com/r/investing/comments/pgl6ia/six_attractive_stocks_imho_aapl_avgo_cmcsa_crai/",
        "created": 1630628492.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608199,
        "id": "pgnzpg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO EARNINGS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnzpg/avgo_earnings/",
        "created": 1630636999.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608116,
        "id": "pgnypx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnypx/avgo/",
        "created": 1630636916.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494145,
        "id": "pfrkoo",
        "num_comments": 506,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "stocks",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/stocks/comments/pfrkoo/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630522945.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500205,
        "id": "pft42l",
        "num_comments": 167,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "investing",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/investing/comments/pft42l/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630529005.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494457,
        "id": "pfrncw",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of Environmental, Social and Governance  investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Another One! Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrncw/another_one_cathie_woods_ark_files_for_new/",
        "created": 1630523257.0
    },
    {
        "author": "MVST_100_OR_BUST6",
        "created_utc": 1630500749,
        "id": "pft9ja",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "This makes zero sense to me. I was expecting red but a 20% dump is insane given its $70 ATH. The confusion is that for the past several days/weeks people have been warning about this date for a long time. So effectively it should have been priced in with all the weak hands leaving, and for at least the option IV should have increased yet it wasnt, and now puts more than doubled. Also at times when the market is overly sure of event X going in Y direction, the absolute opposite happens. Its pretty fucking wild that we pretty much all called it. Usually that never happens. Anyone who bought puts was granted the easiest play ever. \n\nYou can claim its the PIPE dumping but I dont think the Saudis are stupid enough to dump all their shares in pre-market. There are no short shares available. It seems like retail is all selling NOW despite being warned extensively.",
        "subreddit": "SPACs",
        "title": "Why is LCID Tanking?",
        "url": "https://www.reddit.com/r/SPACs/comments/pft9ja/why_is_lcid_tanking/",
        "created": 1630529549.0
    },
    {
        "author": "WhatsFoodG",
        "created_utc": 1630498326,
        "id": "pfslld",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Listen up you autistic retards this shit is serious. Coinbase has basically been hoeing hardcore since its direct listing in April. This bitch has been getting reamed for 4 months BUT \\*cue picture\\* let's take a look at the chart and see what's up\n\n&amp;#x200B;\n\n[COIN Daily Chart](https://preview.redd.it/x6qvq5tiuvk71.png?width=2358&amp;format=png&amp;auto=webp&amp;s=e3eec4721d35b1315ec0be5e51129e93926fc00f)\n\nNow i ain't no fucking artist and i may have a learning disability but I know a cup when i see one and if you look at this chart, even in ur peripheries you'll notice a small cup and handle that's formed in between the support lines, you'll also notice the middle support line recently did an r/S flip i.e. went from being a resistance line to support line.\n\n&amp;#x200B;\n\nNow with the small cup in place it may be high time for Coinbase to continue this trend up and fill up the bigger cup by flying back to the 420-450 range. Also the velocity at which alt currencies move if there is a decent rally in the next few weeks, there's potential this sees an even bigger push to go back up where it came from. The MACD looks bullish with potentially indicating this reversal will become a rally. \n\n&amp;#x200B;\n\n However, the fundamentals are also insanely undervalued right now. I'm talking this thing has a mufuckin current PE ratio of 28 only considering the first 2 quarters this year i.e. NOT COUNTING any estimates from q3 and q4 this year. I'm talking they made rev of about a billion dollars in FY2020 with about 350 mill in net income, Q1 2021 they made over 1.6 billion in revenue and more than doubled net income relative to the ENTIRE PREVIOUS YEAR.  Q2 2021 they made revenue of 2.23 billion netting 1.6 fucking billion in a damn quarter. They're literally reaching exponential growth as we speak and lets be honest the industry they're in is primed to grow substantially in the foreseeable future. Now if you look at their guidance for q3 and q4 they are not expecting to beat the net income of q2 but they also expect continued profitability and could potentially beat forecasts IF certain coins that are traded on their platform rally hard. For comparison, Square is trading at a FORWARD PE (2024) of 73, PayPal FORWARD PE 2024 of 32, I could go on and on. So really their current annual PE is considerably less than 28 once earnings come in for q3 and q4.\n\n&amp;#x200B;\n\nThis is a cash cow of a company fundamentals and technicals seem to be aligning nicely. I think you can't go wrong with far out leaps however you must know that I am retarded and you would be an even bigger retard if you listened to me, jk you prolly can't even read so I'm not worried.\n\n&amp;#x200B;\n\nTL:DR COIN to the moon fam!!!\n\nEdit: I’m not currently in a position but considering loading the $300 calls exp dec 21",
        "subreddit": "wallstreetbets",
        "title": "Code Green: COIN Breakout Imminent!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfslld/code_green_coin_breakout_imminent/",
        "created": 1630527126.0
    },
    {
        "author": "OnlyOneBetter",
        "created_utc": 1630498039,
        "id": "pfsiyq",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": " Dear \\*\\*\\*\\*,\n\nIn response to new Financial Industry Regulatory Authority (FINRA) rules related to pattern day trading, we are updating our policy (which will go into effect on or about September 14, 2021). Because your account was noted for pattern day trading in the past year, we wanted to make sure you're aware of the change and how it could impact your account.\n\n**Understanding the new policy.** In line with the new FINRA rules, our new policy allows for only one flag removal within the life of an account. This means that if your account is flagged again in the future, the flag cannot be removed. Previously, our policy allowed the flag to be removed from an account up to three times within a rolling year before the account was flagged permanently.\n\n**What if your account is flagged?** If your account is flagged for pattern day trading, you'll have to maintain a minimum equity balance of $25,000 at the start of each trading day to continue day trading. If you place a day trade in a flagged account with a balance under $25,000 in equity, you'll be restricted to closing transactions until you bring your equity above $25,000.\n\nTo learn more about the pattern day trading rule and how to avoid breaking it, please view our [FAQ](https://www.tdameritrade.com/why-td-ameritrade/contact-us/top-faqs.html) or [*The Ticker Tape*](https://tickertape.tdameritrade.com/trading/avoid-violating-pattern-day-trader-rule-18005).\n\n**Questions? We're here for you.** If you have questions or if we can help you with this process in any way, please don't hesitate to let us know. Just reply to this message.\n\nSincerely,\n\nTD Ameritrade Client Services",
        "subreddit": "wallstreetbets",
        "title": "Our new pattern day trading policy* may affect how you trade. - Just got this yesterday from TD Ameritrade - Thankfully I am now over the PDT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsiyq/our_new_pattern_day_trading_policy_may_affect_how/",
        "created": 1630526839.0
    },
    {
        "author": "saunders1987",
        "created_utc": 1630491227,
        "id": "pfqwfg",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hi all.\n\nIf I close a position in say GME at 100k and that will now be sitting in my broker account. And I decide to withdraw that to my bank account, then the next day I close another position at say 200k, then withdraw that, and so on and so on. \nDo I pay capital gains on every transaction I take out, or is it the total amount I gain in the year? Like if I close all positions for 100m and take it all out in separate amounts, do I pay in 1 big lump, or I  individual withdrawals? \n\nHope this makes sense!",
        "subreddit": "investing",
        "title": "Capital gains tax question form UK",
        "url": "https://www.reddit.com/r/investing/comments/pfqwfg/capital_gains_tax_question_form_uk/",
        "created": 1630520027.0
    },
    {
        "author": "Dwarfy_8395",
        "created_utc": 1630496425,
        "id": "pfs41c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I've been checking the 212 Trading application ever since they introduced their new T&amp;C and all of my shares are being lent out 100% every time I check.\n\nhttps://ibb.co/5xK7yV1\n\nThis month I receive their statement and it shows that 0% of my shares are being lent out.\n\nhttps://ibb.co/bmKWKg8\n\nI feel this behavior is suspicious and I've contacted their customer care, they've escalated the issue with one of their team and I should receive and email in the coming days.\n\nIs there anything I can do about this? Is this legal? Appreciate anyone that understands more about this stuff. Hopefully this is a correct sub since I fail the requirements for anywhere else",
        "subreddit": "investing",
        "title": "212 Trading lending shares but now showing on statements.",
        "url": "https://www.reddit.com/r/investing/comments/pfs41c/212_trading_lending_shares_but_now_showing_on/",
        "created": 1630525225.0
    },
    {
        "author": "exploding-implosion",
        "created_utc": 1630495769,
        "id": "pfrygj",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I’ve been here browsing you guys’ posts for some months now. This has led to me becoming very interested in this field. How would you guys recommend getting started for a typical noob with minimal Robinhood experience? Any recommended trading platforms or individuals who make informative blogs?\n\nI realize nobody is immune to taking an L in this line of business, but I’d just like to get aimed in the right direction and hopefully gain some off my investments to put away for the future. Let me know what you guys think, if I’m asking in the wrong place just let me know!",
        "subreddit": "wallstreetbets",
        "title": "Getting started",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrygj/getting_started/",
        "created": 1630524569.0
    },
    {
        "author": "WallPuzzleheaded8134",
        "created_utc": 1630497474,
        "id": "pfsdee",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Citadel trying to slip away quietly.  Silly rabbit,  trix are for kids\n\nhttps://fxnewsgroup.com/forex-news/retail-forex/citadel-securities-seeks-to-nix-short-squeeze-conspiracy-allegations/\n\nApes need to stand watch and cover the gaps in a really long defense wall.  Part of this long unnecessary post is me filling in because of the mods.  When reading this article this morning, noticing it has not been shared on any threads yet, I realized these slimmy players are in the business of letting little guys like us win battles but lose the war.  Can we make a few bucks sure, do they really care, no,  what they really want to make sure of, is that we do not disrupt the money printing machine scheme, sadly on the backs of unsuspecting victims,  that like before,  and now again,  will ultimately carry the bag. Let's make sure to stand the line and hold these bad actors accountable. \n\nKeep digging,  keep studying,  keep turning those shiny smooth 🧠 surfaces into wrinkles that look like g m e chart. Keep sniffing green crayons",
        "subreddit": "wallstreetbets",
        "title": "Citadel Securities seeks to nix “short squeeze” conspiracy allegations",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsdee/citadel_securities_seeks_to_nix_short_squeeze/",
        "created": 1630526274.0
    },
    {
        "author": "phoenixODST",
        "created_utc": 1630479907,
        "id": "pfolow",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Came into some hardship about a month ago and was forced to sell some shares of a company I didn’t wanna sell. Being that I’m down in said company I sold some at a loss. I still have a large position but being that I did sell some and got through my life dip and I bought into myself and made a large profit, I wanna put it back into my stock. It’s been almost 2 months now I know it’s either 30-60 days but It always seems that TD Ameritrade shoves it right up into my little hole and tickles my guts with this. It seems no matter how many YouTube videos I watch I’m still left confused. Can some explain to me like I’m 5 years old and can’t color within the lines how and when I can buy back into this company without my buyin price hitting the atmosphere. plz and spank you.",
        "subreddit": "StockMarket",
        "title": "Wash sale",
        "url": "https://www.reddit.com/r/StockMarket/comments/pfolow/wash_sale/",
        "created": 1630508707.0
    },
    {
        "author": "MrStonks33",
        "created_utc": 1630491018,
        "id": "pfquol",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "The case for a horse... that works.\n\nWKHS may be the best kept non-secret stock on the market right now.\n\nLong story short. EV is big, EV is growing. Why not electric deliver vehicles? A company who ALREADY has EV delivery trucks IN HAND is slowly growing. Their stock however, is falling. Buy Low Sell High. \n\nThe stock is heavily shorted, and the shorts have come very close to burying this old horse into the ground. Not looking good. The shorts gained even more ground when WKHS lost the USPS truck contract. We'll get to that in a minute.\n\nHere's the good news. The stock is 100% utilized. It has a low float, it has a low market cap, and THEY ALREADY HAVE A PRODUCT IN HAND WAITING TO BE PURCHASED. Here's the best part. They made claims of corruption against the U.S. Government, USPS, and Oskosh when they lost the USPS contract. USPS and Oshkosh tried to get the case thrown out, but the judge denied that motion and is now allowing arguments in mid-Sept.\n\nWith shorts out the ass, and the stock 100% utilized. This is the equivilent of a home filling up with natural gas. \n\nAll you need is a spark, aka a judge siding with WKHS in arguments.\n\nThis is not a pump and dump, this stock was trading between 15 and 40 until the USPS contract fiasco.\n\n52 week LOW HIGH 7.07-42.96 (Price as of post stands at 9.90)\n1.19 B market cap\n123.95m shares\n36% shares held by institution.\n38% short interest\n\nYou do you.\nI am just a retard.\nNot financial advice.\n\nCredit Goes To Nick Quattrini for the DD. I’m just sharing.",
        "subreddit": "wallstreetbets",
        "title": "WKHS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfquol/wkhs/",
        "created": 1630519818.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500331,
        "id": "pft5c8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of sustainable investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pft5c8/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630529131.0
    },
    {
        "author": "opticalpuss",
        "created_utc": 1630493767,
        "id": "pfrh5k",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I'm a highly paid salary executive who loves nothing more than chicken sandwiches and large soft drinks. I have noticed more and more frequently that when I pull into my favourite drive through in my Tesla to first complain about mask mandates then order a bourbon bacon cheeseburger with no bourbon because I'm a recovering addict that some locations have closed or have limited staff.\n\nThese staffing shortages came on recently due to so many free handouts that the lazy employees don't feel like working. When real Americans were true and proud, work was good and I got to yell at the workers and they couldn't do shit about it. And now free money has them lazy.\n\nGo ahead and remove my post but I say short these companies now because when I finally did get my sandwich I'm pretty sure it did have bourbon in it so now I went to the liquor store and bought a handle of Jack Daniels and am so enraged I might call corporate on my land line to complain. I might even sue them.\n\nBefore I call I'm going to get good and gacked out so they can feel my rage through the phone. These fucking lazy FUCKS!\n\nMASK MANDATE CAN KISS MY ASS IM NOT GETTING THE VACCINE YOU FUCKING SANDWICH SLINGING BITCH MAKE MY SANDWICH WHAT THE FUCK! MANDATES ARE FOR GAY MEN! MANDATE IS WHAT YOURE GONNA HAVE IN PRISON WHEN MY LAWYER PUTS YOUR ASS IN PRISON FOR FUCKING UP MY ORDER YOU FUCKING SANDWICH FUCK! MAKE MY SANDWICH!  \n\nTake a downer.\n\nAll time highs for Yum brands yet everyone is quitting after being underpaid and over-stressed. Wave 5 or whatever this is has the stressors going back up. People feel the need to express their political frustrations to the counter sandwich maker. GrubHub adds more stress on the counter sandwich maker gang. We've all worked at Wendy's and we feel for them.\n\nEarnings are expected to go up. Everyone on the street has them being successful as far as I can tell from my five minutes of googling and review of yahoo finance.\n\nMy positions: I'm not trading I can't trade I'm not approved for options and I don't have Robinhood. I can't believe you've read this far, honestly. I clicked on DD because I like big titties.\n\nKeywords: Yolo, GME, Tenders, Moon, 🚀🚀🚀\n\nFurther: all the hedge funds are expecting big things from Yum. Let's get those hedgies!",
        "subreddit": "wallstreetbets",
        "title": "The Wendy's Counter Sandwich Guy Keeps Fucking Up My Order",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrh5k/the_wendys_counter_sandwich_guy_keeps_fucking_up/",
        "created": 1630522567.0
    },
    {
        "author": "bigheb13",
        "created_utc": 1630501305,
        "id": "pftfm8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "EEMD NOW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pftfm8/eemd_now/",
        "created": 1630530105.0
    },
    {
        "author": "trevortins",
        "created_utc": 1630484987,
        "id": "pfpmlj",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I currently use wealthsimple trade and have a Canadian dividend portfolio. I’ve wanted to invest in U.S stocks for a while but have stayed away from them due to fees. Now that national bank offers commission free trading and doesn’t charge you to convert to US dollars is it worth it to switch? I currently have a tsfa and would just need to transfer over the account.",
        "subreddit": "CanadianInvestor",
        "title": "Should I switch to National Bank for my broker and leave wealth simple trade?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/pfpmlj/should_i_switch_to_national_bank_for_my_broker/",
        "created": 1630513787.0
    },
    {
        "author": "OnlyOneBetter",
        "created_utc": 1630497921,
        "id": "pfshuc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Our new pattern day trading policy* may affect how you trade. - Just got this yesterday from TD Ameritrade - Thankfully I am now over the PDT",
        "url": "https://www.reddit.com/r/options/comments/pfshuc/our_new_pattern_day_trading_policy_may_affect_how/",
        "created": 1630526721.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500094,
        "id": "pft30p",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pft30p/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630528894.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494189,
        "id": "pfrl31",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Another One! Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrl31/another_one_cathie_woods_ark_files_for_new/",
        "created": 1630522989.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1630494015,
        "id": "pfrjcz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "The meme stock scheduled posts will run Mon to Fri and won't be a sticky; you're probably seeing this because automod sent you here or you woke up early Wall St time; good morning!\n\n------\n\nWelcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a day.  I get it, you want to talk about what's popular, what's hot, and that 1.. single.. stock you like.. well here you go!  Some helpful links just for you:\n\n* [Previous meme stock threads](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%28common+OR+meme%29&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [Previous discussions on overlooked (and possibly undervalued) stocks](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoverlooked&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [General discussions](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Adiscussion&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [The **original GME megathread**](https://www.reddit.com/r/stocks/comments/layb68/rstocks_gme_megathread/) with a ton of useful information\n* [Use Finviz for aggregated news on your favorite stock](https://finviz.com/quote.ashx?t=gme)\n\nAn important message from our mod u/TCGYT [regarding meme stocks.](https://www.reddit.com/r/stocks/wiki/meme-stocks-warning)\n\nLastly if you need professional help:\n\n* Problem Gambling:  Call/Text: 1-800-522-4700 or [chat online now.](https://WWW.NCPGAMBLING.ORG/CHAT)\n* Crisis Hotline (24/7): 1-800-273-TALK (8255) (Veterans, press 1) or Text “HOME” to 741-741",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Thread on Meme Stocks Wednesday - Sep 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pfrjcz/rstocks_daily_thread_on_meme_stocks_wednesday_sep/",
        "created": 1630522815.0
    },
    {
        "author": "WhatsFoodG",
        "created_utc": 1630497540,
        "id": "pfsdzj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Listen up you autistic retards this shit is serious. Coinbase has basically been hoeing hardcore since its direct listing in April. This bitch has been getting reamed 4 and a half months and counting but \\*cue picture\\* let's take a look at the chart and see what's up\n\n&amp;#x200B;\n\n[CB Daily Chart](https://preview.redd.it/aqjaxo37nvk71.png?width=2358&amp;format=png&amp;auto=webp&amp;s=478a56b2d64a8f5278121224d85d13646b93ade2)\n\nNow i ain't no fucking artist and i may have a learning disability but I know a cup when i see one and if you look at this chart, even in ur peripheries you'll notice a small cup and handle that's formed in between the support lines, you'll also notice the middle support line recently did an r/S flip i.e. went from being a resistance line to support line.\n\nNow with the small cup in place it may be high time for Coinbase to continue this trend up and fill up the bigger cup by flying back to the 420-450 range. Also the velocity at which alt currencies move if there is a decent rally in the next few weeks, there's potential this sees an even bigger push to go back up where it came from. The MACD looks bullish with potentially indicating this reversal will become a rally. \n\n However, the fundamentals are also insanely undervalued right now. I'm talking this thing has a mufuckin current PE ratio of 28 only considering the first 2 quarters this year i.e. NOT COUNTING any estimates from q3 and q4 this year. I'm talking they made rev of about a billion dollars in FY2020 with about 350 mill in net income, Q1 2021 they made over 1.6 billion in revenue and more than doubled net income relative to the ENTIRE PREVIOUS YEAR.  Q2 2021 they made revenue of 2.23 billion netting 1.6 fucking billion in a damn quarter. They're literally reaching exponential growth as we speak and lets be honest the industry they're in is primed to grow substantially in the foreseeable future. Now if you look at their guidance for q3 and q4 they are not expecting to beat the net income of q2 but they also expect continued profitability and could potentially beat forecasts IF certain coins that are traded on their platform rally hard. For comparison, Square is trading at a FORWARD PE (2024) of 73, PayPal FORWARD PE 2024 of 32, I could go on and on. So really their current annual PE is considerably less than 28 once earnings come in for q3 and q4.\n\nThis is a cash cow of a company fundamentals and technicals seem to be aligning nicely. I think you can't go wrong with far out leaps however you must know that I am retarded and you would be an even bigger retard if you listened to me, jk you prolly can't even read so I'm not worried.\n\nTL:DR COIN to the moon fam!!!",
        "subreddit": "wallstreetbets",
        "title": "Code Green: Coinbase breakout is imminent!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsdzj/code_green_coinbase_breakout_is_imminent/",
        "created": 1630526340.0
    },
    {
        "author": "valeriedulaxo",
        "created_utc": 1630480578,
        "id": "pfoqsz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "literally hornyyyy as helll , my pussy is throbbing for some dick lol . I don’t want to be alone right now but if i could have it my way i would be getting dick as of now . i  swear i day dream daily about a big cock being rammed in my ass , but i have never tried anal before 🤔 wouldn’t mind giving it a shot though lol . but yeah , if any of you guys see this right now i need some sexual assistance because my pussy is aching for some dick , the second best thing would be to atleast speak with someone who can get me off as i help them get theirself off as well 🤷🏽‍♀️😍💦",
        "subreddit": "wallstreetbets",
        "title": "21 f . Sextttt meeeee 😩",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfoqsz/21_f_sextttt_meeeee/",
        "created": 1630509378.0
    },
    {
        "author": "PodejrzaneAmogus",
        "created_utc": 1630485232,
        "id": "pfpo91",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "u/PodejrzaneAmogus is hot, buy now !",
        "url": "https://i.redd.it/1g3l9p83suk71.png",
        "created": 1630514032.0
    },
    {
        "author": "SituationLive4406",
        "created_utc": 1630501223,
        "id": "pftejg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n22nd Century (XXII) Announces the Completion of Its Trifecta of Market Sectors with Tobacco, Cannabis, and Now Hops\n\nMassive IP portfolio on the Tobacco and Cannabis Plants. **Now hops also?** I would say they have all major areas covered. (I will dive more into that later) no pun intended.\n\nGood day everyone,\n\nWe are updating coverage on **22nd Century Group, Inc. (NASDAQ: XXII),** a leading plant-based, biotechnology company that is focused on tobacco harm reduction, very-low nicotine content tobacco, and hemp/cannabis research.\n\nCurrent price $3.57/share (at market close Aug. 31, 2021)\n\nOn August 16, 2021, XXII moved to the NASDAQ Exchange from the NYSE-American. The company participated in the closing bell ceremony on the same day. The company believes the move will increase their visibility and exposure to investors.\n\nWhen I look at [the company stock chart](https://stockcharts.com/h-sc/ui?s=XXII), I see how XXII has come off recent dips this year. On April 26th, the shares peaked at $6.07, then dipped to $3.56 on May 13th. On July 1st the shares had climbed back to $4.63 before consolidating to today’s level. XXII shares have now crossed their 200 DMA of $3.34 and are **approaching their 50 DMA of $3.67/share in a bullish manner**.\n\nI often note insider holdings as a value metric because the insiders have a vested interest in the company’s success. Insider ownership isn’t very high (under 3%) at XXII, but the institutional ownership (all data per YF) is at 36.4% of the outstanding shares. **Some of the big guns are holding XXII shares like Blackrock (5.99%) and Vanguard (4.68%). ETF Managers Group is holding 7.38% of the company’s shares.** Hedge funds prefer the companies they invest in to perform sooner rather than later.\n\nWhen we last covered XXII in July, we talked about the company’s trifecta of core products, tobacco, cannabis, and an unknown third leg. I spent some time trying to figure out what that third product was going to be. Since XXII was already in the tobacco and cannabis sectors I thought the new market would be psilocybin. Boy was I wrong. While psilocybin is an exciting and developing market, it is still relatively small and in it’s infancy. XXII doesn’t chase small markets.\n\nIn a [letter to shareholders](https://finance.yahoo.com/news/22nd-century-group-enters-global-132000137.html) published Monday, August 30th, CEO James Mish said “I am proud to announce our third plant-based franchise – the global **specialty hops market**. Like our existing franchises, the hop plant market is ripe for disruption and offers opportunities for 22nd Century to provide unique and significant competitive advantages to commercial partners. The addition of hops, a critical input for the $500 billion global brewing industry as well as a growing source of medically-important molecules, expands our total addressable markets to an estimated $1.3 trillion.”\n\n95% of all hops are used to make beer. The rising demand for microbrew and craft beers is driving the specialty hops market where distinctive flavors, aromas and nutritional uses are important in creating unique and differentiated products. The XXII R&amp;D program objectives include creating new proprietary hop plants and valuable IP using their know-how and technologies, utilizing double haploids, gene-editing, molecular breeding, and other non-GMO technology.\n\nXXII is establishing a new subsidiary in the Netherlands, 22nd Century Group Europe B.V., to open new revenue opportunities in hops, as well as serve their tobacco and hemp/cannabis plant franchises through an expanded global footprint.\n\nXXII is on the move now with a move toward globalization and a new product pipeline that may generate revenues quickly. The demand for proprietary, specialized, non-GMO hops is high and XXII has the tools to provide them.\n\n7/23/2021 Cowen Initiated Coverage Outperform $5.00\n\n**On the tobacco front**, earlier in August, the company announced that they were highly confident their MRTP (modified risk tobacco products) application has completed the FDA’s scientific review process and is now in the documentation process, the final stage before the FDA announces its decision. While the company’s VLN cigarettes were approved for sale in 2019, this important designation will allow 22nd Century to communicate key features of VLN® King and VLN® Menthol King, including the headline claim of “95% less nicotine.” VLN® tastes, smells, and smokes like a conventional cigarette. Both the FDA and the Biden administration have been looking for ways to curb illness, and consequently healthcare expenses, associated with cigarette smoking.\n\n**On the cannabis front**, XXII has been building its network of partnerships to maximize the upstream segment of the cannabinoid value chain since 2019. Components of 22nd Century’s proprietary value chain include: plant profiling tailored to the needs of customers (CannaMetrix), genetics to deliver differentiated traits to maximize yield of a specific cannabinoid or deliver a certain taste or fragrance profile (KeyGene), and commercial-scale plant breeding and cultivation of disruptive plant lines as well as year-round ingredient extraction/purification (Extractas Bioscience, Sawatch Agriculture, Folium Botanical, Aurora Cannabis, Needle Rock Farms, and Panacea).\n\nThe XXII “trifecta” of market sectors it participates in is now complete with tobacco, cannabis, and hops. As CEO Mish pointed out above, these three sectors address an **estimated market of $1.3T**. Sometimes we get lost with those numbers but each **1% of a $1.3T market potential is $13B**.\n\nStay tuned for more coverage on 22nd Century Group coming very soon.\n\n&amp;#x200B;\n\nAbout 22nd Century Group, Inc.  \n22nd Century Group, Inc. (Nasdaq: XXII) is a leading plant biotechnology and intellectual property company focused on improving health and wellness through plant science. 22nd Century uses modern plant breeding technologies, gene-editing, and molecular breeding to deliver value to its customers in the life science and consumer products industries by creating new, proprietary tobacco, hemp/cannabis and hop plants with optimized alkaloid and flavonoid profiles as well as improved yields and valuable agronomic traits. 22nd Century was founded to build intellectual property related to nicotine biosynthesis in the tobacco plant and to commercialize its proprietary reduced nicotine content (RNC) tobacco plants, which have become the cornerstone of FDA’s comprehensive plan to address the enormous amount of death and disease caused by addiction to smoking. **The Company has also begun to leverage its plant science expertise and existing partnerships to create and commercialize new, proprietary hemp/cannabis and hop plants to optimize their genetics and create valuable new intellectual property.**\n\n[Privacy policy and disclaimer](https://mailchi.mp/tradersnewssource/exciting-report-in-a-hot-sector-coming-tomorrow-649728?e=[UNIQID])",
        "subreddit": "weedstocks",
        "title": "Hundreds of patents for gene-editing on the Cannabis Plant (XXII)",
        "url": "https://www.reddit.com/r/weedstocks/comments/pftejg/hundreds_of_patents_for_geneediting_on_the/",
        "created": 1630530023.0
    }
]