[
    {
        "author": "psychotrader00",
        "created_utc": 1631308754,
        "id": "pltxcf",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, September 10, 2021**\n\nStocks extended their streak of underperformance, with the three major indexes falling once again for the fifth consecutive day of losses, one of the worst weeks for equities all year. The S&amp;P 500 (SPY) closed the day 0.78% down, closing out the week 1.57% down. The tech-heavy Nasdaq (QQQ) also closed the day 0.78% down, closing the week out 1.3%. The Dow Jones (DIA), which primarily weights financial, industrial, and energy stocks, closed the day 0.75%, closing the week 1.91% lower. The Russell 2000 (IWM), which tracks the performance of small-caps, continued its roughly year-long streak of underperformance, falling 0.97% and closing the week 2.53% lower. All year, IWM has been trading between a range of $210 and $235, unable to break out, compared to the more than 15% year-to-date gain by the SPY. Market participants remain concerned with the surge in the coronavirus Delta variant and the potential negative impact it could cause the economy.\n\nFirst off, in geopolitical news, President Biden spoke with Chinese President Xi Jinping for the first time in months. Afterward, Bloomberg reported that the Biden administration was considering investigating Chinese subsidies and their effect on the US economy. Marc Chandler, Chief Market Strategist at Bannockburn Global Forex, said “The Sino-America relationship is in disrepair and today’s call does not seem to change this. The US appears to list actions it wants China to take, while China’s demands seem minimalist, quit demonizing it and respect its red lines. Yet its red lines strike at the very heart of international order, such as its claims on most of the South China Sea and its aggressive provocative actions in the region.” This also comes amid extremely intense regulatory pressures by the CCP on Chinese tech stocks, many of which have an American listing.\n\nIn other news, new economic data showed that prices paid by producers for materials once again rose last month, once again highlighting the strain that stills exists as supply-side pressures and labor market shortages once again push inflationary readings higher. This report shows that, despite the pandemic surging once again, demand by consumers remains red-hot and continues to outstrip manufacturing capacity, causing shortages, which, as basic economics shows, pushes prices higher. The producer price index for final demand rose 0.7% last month after two straight monthly increases of 1.0%, the Labor Department said. The gain was led by a 0.7% advance in services following a 1.1% jump in July. A 1.5% increase in trade services, which measure changes in margins received by wholesalers and retailers, accounted for two-thirds of the broad rise in services. Goods prices jumped 1.0% after climbing 0.6% in July, with food rebounding 2.9%. In the 12 months through August, the PPI accelerated 8.3%, the biggest year-on-year advance since November 2010, though one has to take into account this number is inflated due to easy comparisons to last year, given the absolute collapse of prices during the height of the pandemic before the vaccine existed. Economists had forecast a rise of 0.6% on a monthly basis and 8.2% on a yearly basis, basically in line with reality. \n\nMike Loewengart, Managing Director at E-Trade Financial, said of the PPI, “Anyone who has bought pretty much everything recently knows that supply chain issues are widespread and inflation is real, so this won’t be too much of a surprise for the market. Keep in mind we’re still in the transitory period where the Fed is not inclined to budge of easy money policies.”\n\nNow, this is absolutely massive news and will have huge consequences in the market moving forward, especially for companies who derive a large percentage of their revenue through the Apple Store. Today,  a judge in California sided with Epic Games and issued Apple a permanent injunction against their App Store policies. This move opens the door for developers to offer customers third-party payment options that do not force developers to pay Apple’s 15-30% commission. Stocks like Roblox (RBLX), Bumble (BMBL), Zynga (ZNGA), and Spotify (SPOT) sharply gapped up after the announcement. I cannot stress how big this is, in 2020 Apple made $73 billion in revenue from the commission on App purchases.\n\nUnfortunately, a summer that began with plunging coronavirus cases nationwide and real hope that the worst of the pandemic was behind us as the effective vaccination drive began is instead drawing to a close with the US firmly in throes of the pandemic once again, due to the highly contagious Delta variant. \n\nThis weekend, hospitalizations were roughly 300% higher than Labor Day weekend in 2020, according to data from Johns Hopkins University. The surge in patients comes as the highly contagious Delta variant continues to spread across the US, and coincided with a weekend that saw a spike in travel. According to the Transportation Security Administration, more than 3.5 million people traveled across the country on Friday and Saturday for the Labor Day holiday, despite the Centers for Disease Control and Prevention’s recommendation for unvaccinated people to refrain from traveling.\n\n**Highlights**\n\n* Peloton (PTON) shares gapped up after the company announced it was launching an apparel brand. It’s probably gonna be the same sort of clothes that are sold in Lululemon (LULU).\n* The crackdown in China continues… This time, regulators of video game companies execs to focus less on profits and implement controls to prevent video game addiction. Companies were “urged to break from the solitary focus of pursuing profit or attracting players and fans.\n* Russian Cybersecurity firm Yandex (YNDX) said it successfully repelled the biggest distributed denial-of-service (DDoS) attack in history. This comes just after American company Cloudflare (NET) repelled the previously largest DDoS attack on Aug 19. The Yandex attack was 22 million requests per second, while Cloudflare’s was 17.2 million requests per second. Cybersecurity is becoming ever more important as attacks become more complex and powerful.\n* The Italian Data Authority asks Facebook (FB) to provide clarifications on the use and function of the smart glasses to gauge whether the product is compliant with privacy laws. Like I said yesterday, I think the glasses are a bad product, don’t see any use for them apart from very niche uses, like live-streaming. Not even to mention FB’s absolutely appalling record when it comes to data privacy (remember Cambridge Analytica?)\n* Sales of cars in China fell for the fourth straight month amid the global shortage in semiconductors that have forced automakers across the globe to slash production.\n* Elon Musk sent an email to Tesla employees asking them to “go super hardcore” to make up for production challenges to “ensure a decent Q3 delivery number.” The CEO also said, “This is the biggest wave in Tesla history, but we got to get it done.” I hope they get it done, still waiting on my Model 3 :(\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Accenture (ACN) with two target raises. Stock currently around $341\n   * Morgan Stanley from $330 to $380 at Overweight\n   * Bank of America from $324 to $379 at Buy\n* Shares of Affirm (AFRM) gapped up 34% after the company absolutely demolished earnings and raises guidance. Also received a host of target upgrades, with average price target being $140 at Buy.\n* Caesars Entertainment (CZR) target raised by Cowen from $120 to $125 at Outperform. Stock currently around $104\n* Danaher (DHR) target raised by Bank of America from $340 to $360 at Buy. Stock currently around $330\n* Lululemon (LULU) target raised by Argus from $416 to $500 at Buy. Stock currently around $425\n* Palo Alto Networks (PANW) with two target raises. Stock currently around $470\n   * Royal Bank of Canada from $475 to $525 at Outperform\n   * BMO Capital Markets from $480 to $525 at Outperform\n* QuantaServices (PWR) target raised by Cowen from $110 to $130 at Outperform. Stock currently around $115\n* Zscaler (ZS) with a host of target raises after beating earnings. Average price target $320 at Buy. Stock currently around $270. \n\n“To Bear Trials with a Calm Mind Robs Misfortune of its Strength &amp; Burden” - Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, Sept 10, 2021. Have a great weekend everyone!!",
        "url": "https://www.reddit.com/r/stocks/comments/pltxcf/here_is_a_market_recap_for_today_friday_sept_10/",
        "created": 1631337554.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1631825770,
        "id": "pplxhb",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Thursday, September 16, 2021**\n\nStocks finished mixed in a volatile session after getting a boost following the release of new economic data that showed retail sales for the month of August coming in stronger-than-expected, suggesting that consumer spending, which accounts for roughly 70% of US GDP, held up despite rising coronavirus Delta variant concerns. The tech-heavy Nasdaq (QQQ) and Russell 2000 (IWM), which tracks the performance of small-caps, closed the day with a gain of 0.07% and 0.08% respectively. The S&amp;P 500 (SPY) fell 0.17% and the Dow Jones (DIA) fell 0.17% and 0.19% down respectively. Jobless claims also came in near a pandemic-era low. \n\nWith the coronavirus Delta variant fanning fears of a slowdown in growth in the US and China, market participants have been carefully weighing incoming economic data. In the US, August retail sales showed an unexpected rise despite the latest surge of coronavirus Delta variant cases. The Commerce Department's August retail sales report showed overall sales rose by 0.7% on the month after a downwardly revised 1.8% drop in July. Consensus economists were looking for a 0.7% drop. \n\nA few days ago, China’s retail sales report showed a dramatic slowdown in growth as the country battles rising coronavirus cases and seasonal floodings, with output and sales reaching a one-year low. Consumer spending grew 2.5% in the month of August, a sharp deceleration from the 8.5% growth in July and missing estimates of 7% growth. Industrial production rose 5.3% in August from a year earlier, narrowing from an increase of 6.4% in July and marking the weakest pace since July 2020, data from the National Bureau of Statistics showed on Wednesday. Output growth missed the 5.8% increase tipped by analysts.\n\nIn a new weekly report by Factset, consensus analysts are still looking for S&amp;P 500 earnings growth of nearly 28% for the third quarter. While a deceleration from the more than 80% growth rate posted in the second quarter of this year, that would still mark the third-highest year-over-year increase in earnings for the index since 2010. Third-quarter earnings reporting season is set to pick up next month. \n\n**Highlights**\n\n* A host of news coming out of Facebook (FB) after journalists reviewed internal documents from the company. Not going to get into it here, but I recommend you check out was is going on surrounding Facebook.\n* Ford Motors (F) said it plans to boost capacity from the F-150 Lightning pickup truck to 80,000 per year thanks to strong demand, adding that the vehicle would be for sale next spring.\n* Nvidia’s (NVDA) co-founder and CEO Jensen Huang, who has built the company into the US’ most valuable chip maker, was named as one of Time Magazine’s 100 Most Influential People. I have said this publicly multiple times, but NVDA is my single favorite stock in the entire market.\n* Lucid’s (LCID) luxury sedan has received a government certification for a range of 520 miles. The Environmental Protection Agency (EPA) said it’s the longest range EV rated so far. For comparisons, Tesla’s Model S was rated for a range of 405 miles, though it is a lot cheaper. \n* Match Group (MTCH), which operates popular dating app Tinder, said it was working on its own payment system to circumvent Apple and Google following the recent decision by US authorities to allow companies to offer third-party payment solutions within the Google and Apple app stores. \n* Taiwan Semiconductors (TSM) said it aims for net-zero emissions within the next 30 years. \n* Popular chatting platform Discord raised $500 million in a new founding round, bringing the value of the company to an estimated $15 billion. Microsoft (MSFT) originally tried to buy Discord many months ago, but it seems like the company is aiming to go public at some point. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices.\\*\\***\n* Accenture (ACN) target raised by Deutsche Bank from $310 to $395 at Buy. Stock currently around $342\n* Adobe (ADBE) with two target raises. Stock currently around $665\n   * Barclays from $660 to $740 at Overweight\n   * BMO Capital Markets from $630 to $730 at Outperform\n* Biogen (BIIB) target raised by UBS Group from $442 to $475 at Buy. Stock currently around $300\n* Discover Financial Services (DFS) target raised by Morgan Stanley from $137 to $139 at Equal Weight\n* Fortinet (FTNT) target raised by BMO Capital Markets from $300 to $335 at Overweight. Stock currently around $305\n* Teck Resources (TECK) target raised by Deutshce Bank from $30 to $32 at Buy. Stock currently around $26\n\n“A gem cannot be polished without friction, nor a person perfected without trials.” - Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, September 16, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pplxhb/here_is_a_market_recap_for_today_thursday/",
        "created": 1631854570.0
    },
    {
        "author": "ProfessionalSignaler",
        "created_utc": 1632260922,
        "id": "pst088",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": " If you’re looking for a deSpac, gamma squeeze, short squeeze, ketchup squeeze, or memelord stock, this isn’t it. So we will see if the mods even allow this.   \nI thought to myself the other day about “apex” companies. These are the companies that are far and away the leading companies in their space. For example:  \nSocial Media: Facebook  \nOnline Shopping (and cloud..): Amazon  \nSearch: Google  \nSmartphones: Apple  \nEV cars: Tesla  \n\n\nYou get the idea. But what I was moderately surprised at was the **lack of social media** **marketing** company. When a company is scheduling things to advertise on Instagram, responding to your whining on Twitter, or answering customer queries via Whatsapp, what are they using? **If you’re a top company, they’re using Sprinklr.** \n\nGo look for yourself. What’s Amazon’s Twitter using? What’s Google’s Twitter using? What’s ESPN (Disney) using?  \nOther examples of companies that use Sprinklr (as of Q2):  \nNetflix  \nMicrosoft  \nTwitter  \nAmazon\n\nGoogle  \nThe Marines (yep, it’s been government-certified)  \nTSA  \nAccenture\n\nDeloitte  \nMcDonalds (tendies)  \nIf you work at a big company, you’ll recognize there are a lot of disparate tools being used in a similar function. Social Media management is no different. At its simplest, Sprinklr allows companies to organize content across platforms, easily respond to customers through different channels, and analyze the outcomes. This is exceedingly valuable to companies in order to manage their social media (helping with marketing efficiency, customer service outcomes, social listening, etc.) There are also much deeper integrations here as well, but we will start with that.  \nNow, how much do you think a company would be worth, given that the majority of the Fortune 100 uses their services? What if I told you they had 74+ customers generating over $1M each on a yearly basis? What if I said they had about 1000 other customers, with average subscription revenue (yearly) of $350K each?  \nWell, whatever you had in your head - the current market cap of Sprinklr is roughly $4.3BN. By EoY, they’re expecting (their prediction from Q2 earnings) to generate \\~$415M in revenue (22% growth YoY).   \nHowever, I believe it’s generally undervalued for a variety of reasons.  \n1) They are recognizing revenue from subscriptions (90% of their revenue) as it happens, not when the deals are signed. I believe their estimates to be really low. Consider that there are 74 customers with at least $1M in yearly subscription revenue, and they themselves have stated they have 1000 customers with an average yearly value of $350K (as of June 23). Well, if you just took the average value X 1000 customers, + $74M, you’re already at $424M revenue. And no doubt, there are more customers signed since June, and no doubt some of the 74 “big” customers are spending much more than $1M annually. They also have the opportunity to upsell their current customers. **TL;DR** they’re clearly going to be way ahead of their projected earnings and will continually revise earnings skyward.  \n2) This is a really sticky industry. The companies that put the amount of work to migrate to use Sprinklr aren’t going to change to a different provider easily (and frankly, a single competitor doesn’t really exist). Retention is likely to be extremely high.  \n3) Sprinklr is **really early**. The fact that they have the majority of the biggest companies on the planet signed bodes well for their future. They have now stated they’re targeting the next biggest 30000 companies, and their sales pipeline/staff has started to ramp up (paused all of last year). I would expect many more companies to be signed here; additionally, I expect additional products to be released that can be upsold to existing customers (live chat analysis, liter-research platforms - they just announced something like this called Modern Research Lite - etc.)\n\nAnyway, I could say a lot more, but by this point I either have your interest or not. A few things to conclude with - \n\n1. Look at companies in an adjacent space to them. Qualtrics (survey + experience management company) - $23BN. Zendesk (mainly customer support/comms) - $14.5BN. Liveperson (a stock that literally just does chat on a website) - $4.7BN. Take any comp you want - probably undervalued.\n2. Sprinklr does have a competitor called **Sprout Social**. Sprout is awesome too, and much more targeted at small companies. I’m invested in Sprout as well; they’ve been on a rocketship recently ($7.3BN cap with $132M in yearly rev). However, I like Sprinklr over Sprout for a variety of reasons.. But the main one? **Trust what the top companies on Earth are using**. And I will take their judgment on this one. There’s probably room for both to succeed, but Sprout is much more narrow in my mind.\n3. All wall street analyst PTs are above current price, with the lowest at $21 and the highest at $29.\n4. There is basically **zero** ETF ownership of this, which is absurd as Sprout has **60** ETFS that contain it. I would be shocked if ETFs didn’t start picking this up, which will likely lead to a quick upswing in price because the amount of outstanding shares is quite low (high amount of institutional shares held, but can’t be sold).\n   1. This has led to volatility recently (5-7% up and down days), but it doesn’t seem to be reflected in options pricing as IV is \\~60-70%. Options not a bad idea.  \n\n\nTL;DR Sprinklr is undervalued. Massive opportunity. I think it could be the “Salesforce of Social Media Management”. Position = 2600 shares and 38 Feb 20 calls.   \n\n\nFortune 100 stat: [https://www.businesswire.com/news/home/20210907005026/en/Sprinklr-to-Present-at-Upcoming-Investor-Conference](https://www.businesswire.com/news/home/20210907005026/en/Sprinklr-to-Present-at-Upcoming-Investor-Conference)   \nCompanies used (1): [https://www.fool.com/earnings/call-transcripts/2021/09/17/sprinklr-inc-cxm-q2-2022-earnings-call-transcript/](https://www.fool.com/earnings/call-transcripts/2021/09/17/sprinklr-inc-cxm-q2-2022-earnings-call-transcript/)   \nCompanies used (2):  \n[https://www.sprinklr.com/stories/](https://www.sprinklr.com/stories/) \n\nMarket cap: [https://finance.yahoo.com/quote/CXM?p=CXM](https://finance.yahoo.com/quote/CXM?p=CXM)  \nInvestor deck: [https://investors.sprinklr.com/](https://investors.sprinklr.com/)",
        "subreddit": "wallstreetbets",
        "title": "DD: Invest in what the top companies in the world (50%+ of Fortune 100) use for Social Media - Sprinklr (CXM)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pst088/dd_invest_in_what_the_top_companies_in_the_world/",
        "created": 1632289722.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1631825794,
        "id": "pplxr7",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Thursday, September 16, 2021**\n\nStocks finished mixed in a volatile session after getting a boost following the release of new economic data that showed retail sales for the month of August coming in stronger-than-expected, suggesting that consumer spending, which accounts for roughly 70% of US GDP, held up despite rising coronavirus Delta variant concerns. The tech-heavy Nasdaq (QQQ) and Russell 2000 (IWM), which tracks the performance of small-caps, closed the day with a gain of 0.07% and 0.08% respectively. The S&amp;P 500 (SPY) fell 0.17% and the Dow Jones (DIA) fell 0.17% and 0.19% down respectively. Jobless claims also came in near a pandemic-era low. \n\nWith the coronavirus Delta variant fanning fears of a slowdown in growth in the US and China, market participants have been carefully weighing incoming economic data. In the US, August retail sales showed an unexpected rise despite the latest surge of coronavirus Delta variant cases. The Commerce Department's August retail sales report showed overall sales rose by 0.7% on the month after a downwardly revised 1.8% drop in July. Consensus economists were looking for a 0.7% drop. \n\nA few days ago, China’s retail sales report showed a dramatic slowdown in growth as the country battles rising coronavirus cases and seasonal floodings, with output and sales reaching a one-year low. Consumer spending grew 2.5% in the month of August, a sharp deceleration from the 8.5% growth in July and missing estimates of 7% growth. Industrial production rose 5.3% in August from a year earlier, narrowing from an increase of 6.4% in July and marking the weakest pace since July 2020, data from the National Bureau of Statistics showed on Wednesday. Output growth missed the 5.8% increase tipped by analysts.\n\nIn a new weekly report by Factset, consensus analysts are still looking for S&amp;P 500 earnings growth of nearly 28% for the third quarter. While a deceleration from the more than 80% growth rate posted in the second quarter of this year, that would still mark the third-highest year-over-year increase in earnings for the index since 2010. Third-quarter earnings reporting season is set to pick up next month. \n\n**Highlights**\n\n* A host of news coming out of Facebook (FB) after journalists reviewed internal documents from the company. Not going to get into it here, but I recommend you check out was is going on surrounding Facebook.\n* Ford Motors (F) said it plans to boost capacity from the F-150 Lightning pickup truck to 80,000 per year thanks to strong demand, adding that the vehicle would be for sale next spring.\n* Nvidia’s (NVDA) co-founder and CEO Jensen Huang, who has built the company into the US’ most valuable chip maker, was named as one of Time Magazine’s 100 Most Influential People. I have said this publicly multiple times, but NVDA is my single favorite stock in the entire market.\n* Lucid’s (LCID) luxury sedan has received a government certification for a range of 520 miles. The Environmental Protection Agency (EPA) said it’s the longest range EV rated so far. For comparisons, Tesla’s Model S was rated for a range of 405 miles, though it is a lot cheaper. \n* Match Group (MTCH), which operates popular dating app Tinder, said it was working on its own payment system to circumvent Apple and Google following the recent decision by US authorities to allow companies to offer third-party payment solutions within the Google and Apple app stores. \n* Taiwan Semiconductors (TSM) said it aims for net-zero emissions within the next 30 years. \n* Popular chatting platform Discord raised $500 million in a new founding round, bringing the value of the company to an estimated $15 billion. Microsoft (MSFT) originally tried to buy Discord many months ago, but it seems like the company is aiming to go public at some point. \n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices.\\*\\***\n* Accenture (ACN) target raised by Deutsche Bank from $310 to $395 at Buy. Stock currently around $342\n* Adobe (ADBE) with two target raises. Stock currently around $665\n   * Barclays from $660 to $740 at Overweight\n   * BMO Capital Markets from $630 to $730 at Outperform\n* Biogen (BIIB) target raised by UBS Group from $442 to $475 at Buy. Stock currently around $300\n* Discover Financial Services (DFS) target raised by Morgan Stanley from $137 to $139 at Equal Weight\n* Fortinet (FTNT) target raised by BMO Capital Markets from $300 to $335 at Overweight. Stock currently around $305\n* Teck Resources (TECK) target raised by Deutshce Bank from $30 to $32 at Buy. Stock currently around $26\n\n“A gem cannot be polished without friction, nor a person perfected without trials.” - Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, September 16, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pplxr7/here_is_a_market_recap_for_today_thursday/",
        "created": 1631854594.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1632775383,
        "id": "pwq49n",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Monday, September 27, 2021**\n\nStocks finished mixed, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) falling as technology stocks came under pressure by the rising treasury yield while the Dow Jones (DIA) rose, driven higher by strength in financials and energy stocks. The Russell 2000 (IWM), which tracks the performance of small caps outperformed, closing the day 1.48% higher. Market participants continue to digest the evolving situations in China and a bevy of news coming out of Congress. \n\nThe Evergrande situation has been covered in detail in previous recaps, but there are a few updates. The company announced it was canceling plans to issue shares of its electric vehicle unit on the Shanghai stock exchange and its wealth management arm is facing an inquiry by the local government. \n\nIn other news, a series of power cuts and even blackouts across eastern China, where most of the population lives as demand threatens to outstrip the country’s electrical supply, adding a new threat to the already slowing economy and likely further snarling already disrupted global supply chains ahead of the busy Christmas season. This can already be seen in the sky-high charter rates for container ships, which have risen 10 out of the last 13 days and have more than quadrupled since the beginning of the pandemic.\n\nhttps://www.tradewindsnews.com/bulkers/capesize-bulker-rates-remain-tight-amid-supply-demand-tension/2-1-1073904\n\nThere are several reasons why electricity is in short supply. As more regions in the world reopen from pandemic-induced lockdowns, demand has skyrocketed, forcing already electricity-hungry companies to use more power. Export demand for aluminum, steel, and concrete, three of the most energy-intensive products, has been very strong domestically and abroad. Moreover, as electricity demand rises, it has pushed the price of coal, which is the main way China generates electricity, higher. \n\nPublicly traded companies, including suppliers for Apple (AAPL) and one to Tesla (TSLA), and Taiwan Semiconductors (TSM) issued statements on Sunday night warning that their factories were among those affected. Apple had no immediate comment, while Tesla did not respond to a request for comment.\n\nhttps://www.wsj.com/articles/china-power-outages-pose-new-threat-to-supplies-of-chips-and-other-goods-11632769617\n\nIn the US, Congress members continue to race in order to pass legislation to fund the government until next year and prevent the government from defaulting and shutting down. This comes amid a backdrop of ongoing debates surrounding the bipartisan $1 trillion infrastructure deal. \n\nCongress is set to vote tonight on a bill that would extend government funding through December while also raising or suspending the debt limit until the end of next year to prevent the government from defaulting on its debt, which would be disastrous. Unfortunately, something that is fairly routine (the debt ceiling has been raised 80 times since 1960 and three times under President Trump, with the latest suspension in 2019) has become a headline with Senate Minority Leader Mitch McConnell stating that he would oppose raising the debt ceiling. \n\nMcConnell said he would support a clean stop-gap bill in order to avoid a government shutdown said he “will not provide Republican votes for raising the debt limit.” Wednesday of last week, however, McConnell said, “America must never default -- we never have and we never will”, as he then voiced his opposition to a bipartisan increase. \n\nDavid Kostin, US Equity Strategist at Goldman Sachs wrote in a note this morning, “Speaker Pelosi and Senate Schumer announced that they will move forward with legislation that ties an extension of government spending authority to a suspension of the debt limit. Our political economist believes that the likelihood of a government shutdown increases the longer Democrats pursue this course. However, we find no major consistent reaction of the S&amp;P 500 to government shutdowns since 1980.”\n\nHere is a very informative article by the Associated Press: [https://apnews.com/article/debt-limit-explained-8c9cbcd3d0c4a8fe989a0110f5159f7c](https://apnews.com/article/debt-limit-explained-8c9cbcd3d0c4a8fe989a0110f5159f7c)\n\nHouse Speaker Nancy Pelosi said yesterday the chamber would vote Thursday on the bipartisan infrastructure deal, which the Senate passed last month. This would be the same day that lawmakers need to come to an agreement to fund the government to avoid a partial shutdown, which would take place Friday at 12:01 a.m. ET if nothing is done. \n\n**Highlights**\n\n* Along with the news of power constraints in China, analysts at JP Morgan raised estimates for how long it will take customers to get the new iPhone 13, saying it will likely take more than four weeks for the pro models and 2 weeks for the base model.\n* XLF, an ETF that tracks the performance of banks in the SPY, vastly outperformed the market today, closing 1.39% higher amid continued strength by financial stocks.  \nFacebook (FB) pauses the “Instagram for kids” project after lawmakers and the public voiced valid concerns. \n* Facebook (FB) also said it will invest $50 million to partner with organizations/companies to build the “metaverse”, which is the name for a 3D, interactive, collaborative virtual space. In the latest earnings call Zuckerberg said “It is going to require very significant investment over many years”. I’m sure we will see many more headlines about this in year to come.\n* Order of durable goods, which are goods meant to last at least three years, in the US far exceeded estimates in August, suggesting that demand remains very strong despite supply-chain disruptions. Orders rose 1.8% in August, much higher than estimates of a gain of 0.7% and the 0.5% gain recorded in July.\n* Google criticized EU anti-trust regulators for ignoring Apple as it launches an attempt to get the second-higher cort to annul a record $5.1 billion fine related to its Android operating system. Regulators allege that in 2011, Google used Android to cement its dominance in internet search.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Accenture (ACN) target raised by Barclays from $335 to $384 at Overweight. Stock currently around $335\n* AstraZeneca (AZN) target raised by SVB Leerink from $71 to $73 at Outperform. Stock currently around $59\n* Best Buy (BBY) target raised by Piper Sandler from form $146 to $150 at Overweight. Stock currently around $110\n* Costco (COST) target raised by Credit Suisse from $400 to $490 at Neutral. Stock currently around $460\n* Repligen (RGEN) target raised by Craig Hallum from $258 to $368 at Buy. Stock currently around $305\n* InMode (INMD) target raised by Needham &amp; Co from $129 to $206 at Buy. Stock currently around $170\n\n“A wise person will make more opportunities than they find” - Francis Bacon",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, Sept 27, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pwq49n/here_is_a_market_recap_for_today_monday_sept_27/",
        "created": 1632804183.0
    },
    {
        "author": "usuarioDF",
        "created_utc": 1630665960,
        "id": "ph2ptf",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Accenture - Q3 FY21 Performance and YTD Performance",
        "url": "https://www.reddit.com/gallery/ph2ptf",
        "created": 1630694760.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1631308776,
        "id": "pltxl5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Friday, September 10, 2021**\n\nStocks extended their streak of underperformance, with the three major indexes falling once again for the fifth consecutive day of losses, one of the worst weeks for equities all year. The S&amp;P 500 (SPY) closed the day 0.78% down, closing out the week 1.57% down. The tech-heavy Nasdaq (QQQ) also closed the day 0.78% down, closing the week out 1.3%. The Dow Jones (DIA), which primarily weights financial, industrial, and energy stocks, closed the day 0.75%, closing the week 1.91% lower. The Russell 2000 (IWM), which tracks the performance of small-caps, continued its roughly year-long streak of underperformance, falling 0.97% and closing the week 2.53% lower. All year, IWM has been trading between a range of $210 and $235, unable to break out, compared to the more than 15% year-to-date gain by the SPY. Market participants remain concerned with the surge in the coronavirus Delta variant and the potential negative impact it could cause the economy.\n\nFirst off, in geopolitical news, President Biden spoke with Chinese President Xi Jinping for the first time in months. Afterward, Bloomberg reported that the Biden administration was considering investigating Chinese subsidies and their effect on the US economy. Marc Chandler, Chief Market Strategist at Bannockburn Global Forex, said “The Sino-America relationship is in disrepair and today’s call does not seem to change this. The US appears to list actions it wants China to take, while China’s demands seem minimalist, quit demonizing it and respect its red lines. Yet its red lines strike at the very heart of international order, such as its claims on most of the South China Sea and its aggressive provocative actions in the region.” This also comes amid extremely intense regulatory pressures by the CCP on Chinese tech stocks, many of which have an American listing.\n\nIn other news, new economic data showed that prices paid by producers for materials once again rose last month, once again highlighting the strain that stills exists as supply-side pressures and labor market shortages once again push inflationary readings higher. This report shows that, despite the pandemic surging once again, demand by consumers remains red-hot and continues to outstrip manufacturing capacity, causing shortages, which, as basic economics shows, pushes prices higher. The producer price index for final demand rose 0.7% last month after two straight monthly increases of 1.0%, the Labor Department said. The gain was led by a 0.7% advance in services following a 1.1% jump in July. A 1.5% increase in trade services, which measure changes in margins received by wholesalers and retailers, accounted for two-thirds of the broad rise in services. Goods prices jumped 1.0% after climbing 0.6% in July, with food rebounding 2.9%. In the 12 months through August, the PPI accelerated 8.3%, the biggest year-on-year advance since November 2010, though one has to take into account this number is inflated due to easy comparisons to last year, given the absolute collapse of prices during the height of the pandemic before the vaccine existed. Economists had forecast a rise of 0.6% on a monthly basis and 8.2% on a yearly basis, basically in line with reality. \n\nMike Loewengart, Managing Director at E-Trade Financial, said of the PPI, “Anyone who has bought pretty much everything recently knows that supply chain issues are widespread and inflation is real, so this won’t be too much of a surprise for the market. Keep in mind we’re still in the transitory period where the Fed is not inclined to budge of easy money policies.”\n\nNow, this is absolutely massive news and will have huge consequences in the market moving forward, especially for companies who derive a large percentage of their revenue through the Apple Store. Today,  a judge in California sided with Epic Games and issued Apple a permanent injunction against their App Store policies. This move opens the door for developers to offer customers third-party payment options that do not force developers to pay Apple’s 15-30% commission. Stocks like Roblox (RBLX), Bumble (BMBL), Zynga (ZNGA), and Spotify (SPOT) sharply gapped up after the announcement. I cannot stress how big this is, in 2020 Apple made $73 billion in revenue from the commission on App purchases.\n\nUnfortunately, a summer that began with plunging coronavirus cases nationwide and real hope that the worst of the pandemic was behind us as the effective vaccination drive began is instead drawing to a close with the US firmly in throes of the pandemic once again, due to the highly contagious Delta variant. \n\nThis weekend, hospitalizations were roughly 300% higher than Labor Day weekend in 2020, according to data from Johns Hopkins University. The surge in patients comes as the highly contagious Delta variant continues to spread across the US, and coincided with a weekend that saw a spike in travel. According to the Transportation Security Administration, more than 3.5 million people traveled across the country on Friday and Saturday for the Labor Day holiday, despite the Centers for Disease Control and Prevention’s recommendation for unvaccinated people to refrain from traveling.\n\n**Highlights**\n\n* Peloton (PTON) shares gapped up after the company announced it was launching an apparel brand. It’s probably gonna be the same sort of clothes that are sold in Lululemon (LULU).\n* The crackdown in China continues… This time, regulators of video game companies execs to focus less on profits and implement controls to prevent video game addiction. Companies were “urged to break from the solitary focus of pursuing profit or attracting players and fans.\n* Russian Cybersecurity firm Yandex (YNDX) said it successfully repelled the biggest distributed denial-of-service (DDoS) attack in history. This comes just after American company Cloudflare (NET) repelled the previously largest DDoS attack on Aug 19. The Yandex attack was 22 million requests per second, while Cloudflare’s was 17.2 million requests per second. Cybersecurity is becoming ever more important as attacks become more complex and powerful.\n* The Italian Data Authority asks Facebook (FB) to provide clarifications on the use and function of the smart glasses to gauge whether the product is compliant with privacy laws. Like I said yesterday, I think the glasses are a bad product, don’t see any use for them apart from very niche uses, like live-streaming. Not even to mention FB’s absolutely appalling record when it comes to data privacy (remember Cambridge Analytica?)\n* Sales of cars in China fell for the fourth straight month amid the global shortage in semiconductors that have forced automakers across the globe to slash production.\n* Elon Musk sent an email to Tesla employees asking them to “go super hardcore” to make up for production challenges to “ensure a decent Q3 delivery number.” The CEO also said, “This is the biggest wave in Tesla history, but we got to get it done.” I hope they get it done, still waiting on my Model 3 :(\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Accenture (ACN) with two target raises. Stock currently around $341\n   * Morgan Stanley from $330 to $380 at Overweight\n   * Bank of America from $324 to $379 at Buy\n* Shares of Affirm (AFRM) gapped up 34% after the company absolutely demolished earnings and raises guidance. Also received a host of target upgrades, with average price target being $140 at Buy.\n* Caesars Entertainment (CZR) target raised by Cowen from $120 to $125 at Outperform. Stock currently around $104\n* Danaher (DHR) target raised by Bank of America from $340 to $360 at Buy. Stock currently around $330\n* Lululemon (LULU) target raised by Argus from $416 to $500 at Buy. Stock currently around $425\n* Palo Alto Networks (PANW) with two target raises. Stock currently around $470\n   * Royal Bank of Canada from $475 to $525 at Outperform\n   * BMO Capital Markets from $480 to $525 at Outperform\n* QuantaServices (PWR) target raised by Cowen from $110 to $130 at Outperform. Stock currently around $115\n* Zscaler (ZS) with a host of target raises after beating earnings. Average price target $320 at Buy. Stock currently around $270. \n\n“To Bear Trials with a Calm Mind Robs Misfortune of its Strength &amp; Burden” - Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, Sept 10, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pltxl5/here_is_a_market_recap_for_today_friday_sept_10/",
        "created": 1631337576.0
    },
    {
        "author": "kribz666",
        "created_utc": 1632065751,
        "id": "pra6v6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "# Healthcare\n\n[$AGTC release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=AGTC) \\- Market cap: 188M$ - historic mvts around earnings: average 16.0% - std dev. 10.1% - last 11.3%\n\n[$NEOG release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=NEOG)\\- Market cap: 2.44B$ - historic mvts around earnings: average 8.6% - std dev. 3.7% - last 2.7%\n\n[$ADMP release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=ADMP)\\- Market cap: 144M$ - historic mvts around earnings: average 13.3% - std dev. 7.3% - last 6.4%\n\n[$ACB release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=ACB) \\- Market cap: 1.86B$ - historic mvts around earnings: average 18.8% - std dev. 23.8% - last 8.0%\n\n[$DYNT release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=DYNT) \\- Market cap: 21.5M$ - historic mvts around earnings: average 11.9% - std dev. 6.7% - last 10.9%\n\n[$RAD release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=RAD) \\- Market cap: 1.23B$ - historic mvts around earnings: average 18.0% - std dev. 14.8% - last 11.7%\n\nFinancial Services\n\n[$GROW release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=GROW) \\- Market cap: 93.9M$ - historic mvts around earnings: average 13.5% - std dev. 7.7% - last 12.2%\n\n# Industrials\n\n[$EBF release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=EBF) \\- Market cap: 560M$ - historic mvts around earnings: average 6.8% - std dev. 3.3% - last 3.4%\n\n[$FDX release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=FDX) \\- Market cap: 78.9B$ - historic mvts around earnings: average 7.1% - std dev. 4.6% - last 5.9%\n\n[$APOG release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=APOG) \\- Market cap: 1.01B$ - historic mvts around earnings: average 11.8% - std dev. 5.3% - last 12.5%\n\n[$SCS release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=SCS)\\- Market cap: 1.68B$ - historic mvts around earnings: average 11.1% - std dev. 4.8% - last 9.2%\n\n[$AIR release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=AIR)\\- Market cap: 1.45B$ - historic mvts around earnings: average 11.0% - std dev. 6.3% - last 7.3%\n\n[$GLBS release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=GLBS) \\- Market cap: 51.3M$ - historic mvts around earnings: average 33.3% - std dev. 38.3% - last 9.3% Consumer Cyclical\n\n[$LEN release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=LEN) \\- Market cap: 28.3B$ - historic mvts around earnings: average 8.3% - std dev. 8.1% - last 6.0%\n\n[$CBRL release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=CBRL) \\- Market cap: 3.57B$ - historic mvts around earnings: average 5.8% - std dev. 2.3% - last 6.8%\n\n[$AZO release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=AZO) \\- Market cap: 30.7B$ - historic mvts around earnings: average 5.6% - std dev. 2.7% - last 2.1%\n\n[$SFIX release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=SFIX) \\- Market cap: 6.49B$ - historic mvts around earnings: average 21.5% - std dev. 13.8% - last 9.4%\n\n[$KBH release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=KBH) \\- Market cap: 4.25B$ - historic mvts around earnings: average 7.8% - std dev. 4.9% - last 5.2%\n\n[$NKE release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=NKE) \\- Market cap: 206B$ - historic mvts around earnings: average 6.7% - std dev. 4.9% - last 16.3%\n\n[$MTN release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=MTN)\\- Market cap: 13B$ - historic mvts around earnings: average 7.7% - std dev. 4.6% - last 4.1%\n\n[$DRI release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=DRI)\\- Market cap: 18B$ - historic mvts around earnings: average 9.8% - std dev. 15.6% - last 4.7%\n\n# Technology\n\n[$ADBE release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=ADPE)\\- Market cap: 263B$ - historic mvts around earnings: average 5.2% - std dev. 1.6% - last 3.2%\n\n[$BB release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=BB) \\- Market cap: 7.91B$ - historic mvts around earnings: average 11.8% - std dev. 5.3% - last 9.3%\n\n[$AEHR release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=AEHR) \\- Market cap: 62.2M$ - historic mvts around earnings: average 21.5% - std dev. 16.8% - last 77.6%\n\n[$RSSS release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=RSSS) \\- Market cap: 63M$ - historic mvts around earnings: average 12.6% - std dev. 9.9% - last 5.0%\n\n[$CAMP release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=CAMP)\\- Market cap: 497M$ - historic mvts around earnings: average 11.4% - std dev. 4.7% - last 12.8%\n\n[$PRGS release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=PGRS)\\- Market cap: 2.07B$ - historic mvts around earnings: average 8.3% - std dev. 5.2% - last 2.9%\n\n[$ACN release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=ACN)\\- Market cap: 182B$ - historic mvts around earnings: average 6.0% - std dev. 5.1% - last 2.0%\n\n[$DAVA release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=DAVA) \\- Market cap: 6.69B$ - historic mvts around earnings: average 10.3% - std dev. 4.7% - last 7.0% Consumer Defensive\n\n[$SANW release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=SANW) \\- Market cap: 125M$ - historic mvts around earnings: average 9.7% - std dev. 5.7% - last 8.7%\n\n[$GIS release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=GIS)\\- Market cap: 38B$ - historic mvts around earnings: average 4.6% - std dev. 2.9% - last 3.2%\n\n[$COST release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=COST) \\- Market cap: 170B$ - historic mvts around earnings: average 4.3% - std dev. 1.8% - last 2.8% Basic Materials\n\n[$FUL release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=FUL)\\- Market cap: 3.55B$ - historic mvts around earnings: average 6.1% - std dev. 3.5% - last 3.0%\n\n# Communication Services\n\n[$SCHL release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=SCHL) \\- Market cap: 1.32B$ - historic mvts around earnings: average 8.2% - std dev. 5.5% - last 4.9%",
        "subreddit": "smallstreetbets",
        "title": "All Stocks Reporting Earnings This Week (by Sector and Market Cap)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/pra6v6/all_stocks_reporting_earnings_this_week_by_sector/",
        "created": 1632094551.0
    },
    {
        "author": "kribz666",
        "created_utc": 1632037476,
        "id": "pr3mnz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "# Healthcare \n\n[$AGTC release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=AGTC) \\- Market cap: 188M$ - historic mvts around earnings: average 16.0% - std dev. 10.1% - last 11.3% \n\n[$NEOG release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=NEOG)\\- Market cap: 2.44B$ - historic mvts around earnings: average 8.6% - std dev. 3.7% - last 2.7% \n\n[$ADMP release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=ADMP)\\- Market cap: 144M$ - historic mvts around earnings: average 13.3% - std dev. 7.3% - last 6.4% \n\n[$ACB release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=ACB) \\- Market cap: 1.86B$ - historic mvts around earnings: average 18.8% - std dev. 23.8% - last 8.0% \n\n[$DYNT release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=DYNT) \\- Market cap: 21.5M$ - historic mvts around earnings: average 11.9% - std dev. 6.7% - last 10.9% \n\n[$RAD release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=RAD) \\- Market cap: 1.23B$ - historic mvts around earnings: average 18.0% - std dev. 14.8% - last 11.7% \n\n# Financial Services \n\n[$GROW release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=GROW) \\- Market cap: 93.9M$ - historic mvts around earnings: average 13.5% - std dev. 7.7% - last 12.2% \n\n# Industrials \n\n[$EBF release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=EBF) \\- Market cap: 560M$ - historic mvts around earnings: average 6.8% - std dev. 3.3% - last 3.4% \n\n[$FDX release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=FDX) \\- Market cap: 78.9B$ - historic mvts around earnings: average 7.1% - std dev. 4.6% - last 5.9% \n\n[$APOG release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=APOG) \\- Market cap: 1.01B$ - historic mvts around earnings: average 11.8% - std dev. 5.3% - last 12.5% \n\n[$SCS release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=SCS)\\- Market cap: 1.68B$ - historic mvts around earnings: average 11.1% - std dev. 4.8% - last 9.2% \n\n[$AIR release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=AIR)\\- Market cap: 1.45B$ - historic mvts around earnings: average 11.0% - std dev. 6.3% - last 7.3% \n\n[$GLBS release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=GLBS) \\- Market cap: 51.3M$ - historic mvts around earnings: average 33.3% - std dev. 38.3% - last 9.3% Consumer Cyclical \n\n[$LEN release on 2021-09-20](https://earnings-watcher.tech/#/company?symbol=LEN) \\- Market cap: 28.3B$ - historic mvts around earnings: average 8.3% - std dev. 8.1% - last 6.0% \n\n[$CBRL release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=CBRL) \\- Market cap: 3.57B$ - historic mvts around earnings: average 5.8% - std dev. 2.3% - last 6.8% \n\n[$AZO release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=AZO) \\- Market cap: 30.7B$ - historic mvts around earnings: average 5.6% - std dev. 2.7% - last 2.1% \n\n[$SFIX release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=SFIX) \\- Market cap: 6.49B$ - historic mvts around earnings: average 21.5% - std dev. 13.8% - last 9.4% \n\n[$KBH release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=KBH) \\- Market cap: 4.25B$ - historic mvts around earnings: average 7.8% - std dev. 4.9% - last 5.2% \n\n[$NKE release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=NKE) \\- Market cap: 206B$ - historic mvts around earnings: average 6.7% - std dev. 4.9% - last 16.3% \n\n[$MTN release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=MTN)\\- Market cap: 13B$ - historic mvts around earnings: average 7.7% - std dev. 4.6% - last 4.1% \n\n[$DRI release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=DRI)\\- Market cap: 18B$ - historic mvts around earnings: average 9.8% - std dev. 15.6% - last 4.7% \n\n# Technology \n\n[$ADBE release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=ADPE)\\- Market cap: 263B$ - historic mvts around earnings: average 5.2% - std dev. 1.6% - last 3.2%\n\n[$BB release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=BB) \\- Market cap: 7.91B$ - historic mvts around earnings: average 11.8% - std dev. 5.3% - last 9.3% \n\n[$AEHR release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=AEHR) \\- Market cap: 62.2M$ - historic mvts around earnings: average 21.5% - std dev. 16.8% - last 77.6% \n\n[$RSSS release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=RSSS) \\- Market cap: 63M$ - historic mvts around earnings: average 12.6% - std dev. 9.9% - last 5.0% \n\n[$CAMP release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=CAMP)\\- Market cap: 497M$ - historic mvts around earnings: average 11.4% - std dev. 4.7% - last 12.8% \n\n[$PRGS release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=PGRS)\\- Market cap: 2.07B$ - historic mvts around earnings: average 8.3% - std dev. 5.2% - last 2.9% \n\n[$ACN release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=ACN)\\- Market cap: 182B$ - historic mvts around earnings: average 6.0% - std dev. 5.1% - last 2.0% \n\n[$DAVA release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=DAVA) \\- Market cap: 6.69B$ - historic mvts around earnings: average 10.3% - std dev. 4.7% - last 7.0% Consumer Defensive \n\n[$SANW release on 2021-09-21](https://earnings-watcher.tech/#/company?symbol=SANW) \\- Market cap: 125M$ - historic mvts around earnings: average 9.7% - std dev. 5.7% - last 8.7% \n\n[$GIS release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=GIS)\\- Market cap: 38B$ - historic mvts around earnings: average 4.6% - std dev. 2.9% - last 3.2% \n\n[$COST release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=COST) \\- Market cap: 170B$ - historic mvts around earnings: average 4.3% - std dev. 1.8% - last 2.8% Basic Materials \n\n[$FUL release on 2021-09-22](https://earnings-watcher.tech/#/company?symbol=FUL)\\- Market cap: 3.55B$ - historic mvts around earnings: average 6.1% - std dev. 3.5% - last 3.0% \n\n# Communication Services \n\n[$SCHL release on 2021-09-23](https://earnings-watcher.tech/#/company?symbol=SCHL) \\- Market cap: 1.32B$ - historic mvts around earnings: average 8.2% - std dev. 5.5% - last 4.9%",
        "subreddit": "smallstreetbets",
        "title": "All Stocks Reporting Earnings This Week (by Sector and Market Cap)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/pr3mnz/all_stocks_reporting_earnings_this_week_by_sector/",
        "created": 1632066276.0
    },
    {
        "author": "LisaMck041",
        "created_utc": 1630851191,
        "id": "pidtal",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "CanadianInvestor",
        "title": "Infiltrating A Pyramid Scheme: ACN (2020) This excellent video is back up (was put down from Youtube due to a complaint that failed) Marco goes undercover to the meetings of a Pyramid Scheme in Edmonton to expose their inner workings. This is ACN. He exposes Nathan Goldberg from Montreal. [0:27:41]",
        "url": "https://www.youtube.com/watch?v=BJTIDLR2SwI",
        "created": 1630879991.0
    },
    {
        "author": "hivincentc",
        "created_utc": 1632487227,
        "id": "puiw9a",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**📰 Top News**\n\n* S&amp;P 500 Futures are -.55%; Dow Futures are -.46%; NASDAQ Futures are -.72%\n* **US stock futures move lower as bond yields increase in the biggest one-day gain since March.** *Note: Bond yields dropped earlier in the week when investors were worried about the Evergrande situation and decided to scoop up bonds, a safer asset; however, as concerns faded, bond prices dropped and yields started to rise again. Reminder: The yield moves in the opposite direction to price*\n* **Evergrande continues to be in the back of investors' minds. Data shows that bondholders still haven't received any of the $83.5M interest payment that was due Thursday** (although there is a 30 day grace period). In addition, Evergrande's EV unit hasn't paid suppliers in months and hasn't paid employees for September\n* **The White House will meet with leaders from Australia, Japan, and India today to strengthen defense cooperation against China.** *Note: This is the biggest step India has taken to transform its military since independence in 1947*\n* **Bitcoin dropped to 41K after China's central bank posted an announcement on its website declaring all crypto-related transactions illegal.** *Note: China believes that it's urgent to get rid of crypto mining to meet the country's climate goals*\n\n**🎯 Price Target Updates**\n\n* Telsey Advisory Group reduced the price target for NIKE, Inc. NKE from $180 to $176\n* Piper Sandler lifted Accenture plc ACN price target from $302 to $354\n* Keybanc lowered Micron Technology, Inc. MU price target from $120 to $110\n* Piper Sandler raised the price target on [salesforce.com](http://salesforce.com/?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=is_the_evergrande_scare_really_over&amp;utm_term=2021-09-24), inc. CRM from $280 to $365\n* Telsey Advisory Group boosted Costco Wholesale Corporation COST price target from $470 to $480\n\n**📻 In Other News**\n\n* **The head of the CDC approved Pfizer's COVID boosters to a wider range of workers across the US.** This move overruled the original recommendation from the CDC's advisory panel that limited the range of booster distribution\n* **Costco will restart purchasing limitations on key items such as toilet paper, bottled water, cleaning products, etc due to shipping challenges**",
        "subreddit": "StockMarket",
        "title": "Here's Your Daily Market Brief For September 24th",
        "url": "https://www.reddit.com/r/StockMarket/comments/puiw9a/heres_your_daily_market_brief_for_september_24th/",
        "created": 1632516027.0
    },
    {
        "author": "FilmLifeVlog",
        "created_utc": 1631045846,
        "id": "pjv190",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Investing in analog devices. Is it a crazy idea???",
        "url": "https://youtube.com/watch?v=QEEJuYHUFm0&amp;feature=share",
        "created": 1631074646.0
    }
]