[
    {
        "author": "AristotleKarataev",
        "created_utc": 1632019506,
        "id": "pqztun",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "^Reposting ^an ^updated ^version ^of ^this ^thread.\n\nWe see a lot of hype around popular industries like genomics, semiconductors, or cars, and often these hyped-up stocks end up becoming scarily overvalued. \n\nAnother way to invest in growing and hyped-up industries is to invest into companies that produce the supplies for these industries, rather than the big-names at the face of it. Not to mention, you're more likely to win if you invest in a supplier versus one of the many small cap companies looking to get in on the next big thing. In some industries, like electric cars or semiconductors, the hype has already consumed supply stocks such as lithium battery stocks.\n\nThis discussion is primarily inspired by /u/Thereian's [comment](https://www.reddit.com/r/investing/comments/om9772/what_are_your_underappreciated_offtheradar_picks/h5kxnlz/) describing these kind of stock picks:\n\n&gt;ENTG - Semiconduct manufacturing supplier. They supply all major players. Lots of battles going on in this industry but no matter who wins (Taiwan Semi, Intel, etc) they get paid. And all of the investment that Intel and Taiwan Semi are making to build billions of dollars worth of FABs? Yeah, Entegris will get their chunk of that money. They sell the equipment upfront and the consumables going forward. Truly a fantastic company, I've owned since 2009 and am still completely bullish.\n\n&gt;TMO - Similar to the above philosophy. Lots of expensive cell and gene therapy companies out there, those are high risk. But there's a low-risk high-reward play: Thermo Fisher. Just like ENTG in the example above, Thermo is a supplier to the whole industry. While those biotechs remain unprofitable, the suppliers are getting paid and Thermo is making absolute bank in a rapid growth industry and yet it trades at a PE of 20...absurd. It'll double or triple in a couple years.\n\n&gt;I'm an engineer focused on raw materials, so I'm a bit biased but I have seen suppliers make money hand over fist while the companies buying these things are burning cash or barely scraping by. Thats what drove me to look in to high-moat suppliers in the first place and I will continue to.\n\nOther tickers mentioned in the [previous thread](https://www.reddit.com/r/investing/comments/pp6gfl/lesserknown_stocks_that_supply_popular_industries/) for this topic include:\n\n**$ILMN:** Provides tools for genomics work. Seems to have a high P/E and is a bit of a popular genomic play, though.\n\n**$LEA and $ADNT:** Auto parts suppliers. Pretty cyclical industry and unstable charts, however.\n\n**URI**: United Rentals, construction equipment rentals. Might benefit from infrastructure spending. Not exactly what we think of as supply but I'll leave it here.\n\n**$SWKS:** Semiconductor supply picks are popular but this one was mentioned the most as people believe it to be undervalued.\n\n**$MTRN:** Metals company involved in parts for \"EV, space, and renewables.\"\n\n**CDW:** Provider of IT programs for business, government, and education. Again, not exactly supply but it was mentioned and piqued my interest.\n\nWhat do you all think of this investment strategy? Are any of these stocks on your radar? What else would you add?",
        "subreddit": "stocks",
        "title": "Overlooked stocks that supply growing industries",
        "url": "https://www.reddit.com/r/stocks/comments/pqztun/overlooked_stocks_that_supply_growing_industries/",
        "created": 1632048306.0
    }
]