[
    {
        "author": "kawake",
        "created_utc": 1637722522,
        "id": "r0ujxu",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "tl;dr -- Palantir has a one of a kind product but it doesn't solve my small pp issue. If you want a video that does a bad job of me describing this, here you go [https://www.youtube.com/watch?v=l2k4ZBHydz4](https://www.youtube.com/watch?v=l2k4ZBHydz4)\n\nBackground on myself, currently I work as a backend engineer, doing data intensive projects. I exclusively work in AWS and use redshift, snowflake, AWS Glue, lambdas, etc. I'm also retarded, have no clue what I'm doing 100% of the time at work (bless the worker shortage) and have shit myself twice this year (not joking sadly). You have been warned.\n\nSo often, I see people saying \"I have no clue what Palantir does, the company is too much of black box, pp poopie.\" And I get it, the company sucks at explaining what foundry and gotham do, so despite me being too dumb to work there (applied and got rejected instantly), I'll try and explain it.\n\nLet's say we have a big industrial dairy company called \"Double D Milkshakes\". Double D Milkshakes has lots of large scale industrial farms. In addition, they have facilities that pasteurize the milk. After pasteurizing the milk and bottling it, they then have to transport it to various distributors across the country. \n\nThis means, that Double D Milkshakes, is sitting on a fucking trove of data. They have data on each individual cow (what feed the cow is being given, how much milk it is producing, the breed, who its mommy and sperm donor daddy is). They also have an immense amount of data on the living conditions the cows are in (such as what temperature the pastures are kept in). Double D Milkshakes also has data on the facilities that pasteurize the milk (lot of sensor data that goes into this). They also  have all kinds of supply chain information and customer information trapped away in horrific ERM and salesforce systems (kill me please).\n\nNow, every once in a while, some happy, unscarred monkey in management, goes \"Hey, if we can tap into all this data, we could make all kinds of optimizations, increase milk production, reduce cost and oo ee ee\".\n\nSo this monkey is granted funding, hires idiots like me who can't get jobs at real tech companies and tasks us with centralizing all this data into a data warehouse where the data scientist who are also lower tier can analyze the data and unlock all this value hidden in the data. Here is where it all falls apart. Moving all this data from the corporate farms into a data warehouse proves to be a difficult task. Setting up integration with sales force and all this other siloed data throughout the enterprise also proves to be a rather slow and difficult task. Not to mention, we don't really understand what any of the data means. Two years of your life go by and that gun under the bed starts talking to me every night, saying \"HEY duuddddeeee, don't you think I'd feel good against your template.\" At the same time, half the team has left, the data scientists claim the data is unclean and \"does not make sense\". Worse, that happy, innocent, monkey of a manager that got funding for the project left to go work for Kum &amp; Go.\n\nHere is where Palantir's Foundry comes in. They recognized this problem way back in the early 2000s and thought, \"geez, let's build an entire data platform so people don't have to do that.\" So, low and behold, they built the operating system for data. \n\nHere is what Foundry does:\n\n1. Foundry can be deployed at the \"edge\". This means at each individual farm and facility that Double D Milkshakes owns, they can deploy foundry to aggregate and collect the data at that location. In addition, workers at these locations can use Foundry to analyze the localized data themselves and make optimizations at the \"edge\". \"But how can these, hard working, illegal immigrants that don't know english do that? Don't you need to be a data scientist?\" Foundry does an excellent job visualizing data. Anyone with actual ambition (illegal immigrants and first gen americans) could figure it out.\n2. With Foundry deployed at the edge, we can also deploy it at corporate and use all these out of the box integrations to integrate with the various databases, scattered throughout the company. They make it super, duper easy. In addition, all the foundry instances deployed at the edge will send the data they are collecting and analyzing to the main foundry instance\n3. We can import business ontology to organize the data and actually make sense of it. All this really means, is data often sucks and makes no sense. Foundry allows us to describe what the data means in English and remembers for us. In addition, we can organize the data and foundry makes it easy to clean datasets and do a bunch of other data sciencey crap. The hard part is still figuring out what the data means at first but at least when half the development team leaves for better jobs, the data at that point has already been described and the knowledge will not be lost.\n4. AI and Machine Learning made simple. Go out and try running machine learning algorithms on large datasets. Takes fucking effort. Foundry makes it so fucking simple that HR can do it.\n5. Simulations. Probably the biggest fucking win in my book. Building a system to run simulations takes an immense amount of work. Foundry, makes it dead simple. So the workflow becomes this: We import all this data into foundry, describe and organize it. Foundry runs its big brain AI on the datasets and gives us insights, like \"hey dumbo, maybe if we change the feed from feed x to feed y we can increase milk production. I noticed this because one of the farms uses feed y and gets more milk out of those cow tittes.\" We can then simulate what would happen if we changed all of our feed from grain x to y AND see if the cost benefit (because y is more expensive) is worth it.\n6. A bunch of other shit like alerts, metrics, dashboards, applications can all be created in foundry. \n\nI've gone on to long. I do own Palantir at an average cost of $13.06/share. Bought some at IPO and more shortly after. Can't talk to why number goes down. That's for other monkeys to figure out but hopefully this sheeds light on what Palantir does.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/41kpok5wig181.png?width=2166&amp;format=png&amp;auto=webp&amp;s=4144240be6b37c258200096bea612b5bf8cc9636",
        "subreddit": "wallstreetbets",
        "title": "What does Palantir do?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r0ujxu/what_does_palantir_do/",
        "created": 1637751322.0
    },
    {
        "author": "vm5662",
        "created_utc": 1635802181,
        "id": "qkobmu",
        "num_comments": 118,
        "num_crossposts": 6,
        "selftext": "**Be Fearful When Others Are Greedy and Greedy When Others Are Fearful” - Warren Buffet**\n\n**Why people are Fearful:**\n\n* One of the main concerns people worry about this stock in their last Q2 earnings is that their LTO origination was down 17% YOY. But I think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is a one time surge only and made their LTO origination in Q2 2021 looks really bad. but when compared to Q1 2021, it is still up 1%. so it is actually not that bad.\n* Because of the Q2 earnings and guidance removal the stock tanked hard and is now trading at $4-5, creating an opportunity for us to make some tendies.\n* Because the stock tanked hard there were several lawsuits against the management for this behaviour but from the legal perspective they are in their legal boundaries (personally I feel the management should have been more careful).\n* Katapult’s focus on the nonprime consumer niche seems risky at first. Afterall, you would think that customers with worse credit scores would yield higher default risks. However, Katapult’s bad debt expense, or expense for uncollectable accounts receivable, is down from 7.9% last year to 6.1% this year. That is in line with Affirm’s bad debt expense, and Affirm handles prime customers. Katapult’s bad debt expense is growing at less than half the rate of its revenue, showing investors that risks pertaining to bad debt actually minimize as the company grows.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6fzkxpkox1x71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=a61e9a7f5a6c4b907cf80eb103a30d5559c43608\n\n**Why you should be greedy:**\n\n* A study from Juniper Research suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. 55% of Americans used a BNPL option as of March 2021 vs. just 37% in July 2020. The Federal Reserve Bank of New York also reports that **38% of US consumers are considered nonprime,** making it difficult for these consumers to access financing options. **Additionally, 67% of consumers with a FICO score below 700 need a BNPL option for large purchases**. Katapult provides this solution for online customers. Katapult's platform integrates seamlessly to merchant sites, so customers can choose the financing option as they check out. As the sole provider of BNPL financing for nonprime customers, Katapult has a massive untapped market.\n* Katapult is forecasting over $1B in revenue by 2023, and the company could beat this number if it keeps aggressively expanding to include new merchants.\n* Recent great direct partnership with Salesforce and Adobe and indirect waterfall partnership from Affirm with (Amazon, Target, Walmart). The amazon - affirm deal actually sent $KPLT all the way up to $7\\~$8 in September.\n* When u look at the number of buys from insider and institutional holders when this one crash in august due to removal of their guidance, this shows smart money actually think the stock price around $3\\~5 is a steal. (The highest buy from insider is $4.42, which means CEO actually didnt expect market can be way overreacting that the price can drop to \\~$3)\n* Katapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n&amp;#x200B;\n\n[Insider purchase](https://preview.redd.it/mbfmqwlpx1x71.png?width=2359&amp;format=png&amp;auto=webp&amp;s=d9651b69dd723605151440e9821aca97f60e3b44)\n\n**Investment Thesis**\n\nKatapult Holdings is a leading buy now, pay later (\"BNPL\") company that provides Ecommerce financing solutions for nonprime consumers. KPLT has generated explosive revenue growth while remaining profitable, a rare feat for a young growth stock. While its financial performance has been fantastic, KPLT’s valuation is the key to this investment. Katapult has higher sales growth and stronger profit margins than its peers. Meanwhile, its stock is trading at \\~1/40th the multiples of these competitors (discount varies based on sales, gross profit, or EBITDA multiples). You will not find another company executing at this caliber priced this cheap. Value stocks can perform well. Growth stocks can perform well. When an impressive growth stock is trading like an undervalued stock, you have the opportunity to generate incredible returns. Katapult is a $30 stock, you don’t want to miss this one.\n\n**What Is Katapult?**\n\nKatapult provides BNPL solutions for nonprime Ecommerce customers. Katapult is the only nonprime financing platform dedicated to Ecommerce, as shown below:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n3uufepqx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=d1e60005054acf799b53aee674e6e7f148943baf\n\nInvestor Presentation\n\nKatapult offers three payment options for consumers:\n\n* Full Term: A $45 origination fee followed by either 12-24 months of lease payments, at the end of which the consumer owns the good.\n* 90 Day Discount: An early purchase option at 90 days, which enables the consumer to buy the good at a discount to the original price.\n* Extended Discount: A discounted purchase option after 90 days, but before the end of the lease period.\n\nThe average order value for goods leased through Katapult is \\~$600 with an average lease multiple of \\~2.0x cash price. The company’s solution is well-liked by consumers. Its Net Promoter Score of 58 is strong for a financial service, and Katapult has a 4.4 rating on Trust Pilot.\n\n**Business Model**\n\nKatapult partners with Ecommerce merchants like Shopify, Wayfair, Lenovo, and Purple who then integrate Katapult into their websites as a purchase option. Consumers provide their information to Katapult, who in turn makes an immediate credit approval decision. Katapult's risk model reviews over 100 attributes, including lease history and prior payment behavior, to approve or deny applicants in under five seconds. The company has a sub-3% fraud rate across its portfolio, and it recovers 80-90% of lease costs of charge-offs. The financer’s platform is sticky, as 48% of purchases have been done by repeat customers. Katapult also generates revenue through a \"waterfall\" program with Affirm.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gzebfgyrx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=5e7bbd61edc80e801e4ef6261124432914c7d641\n\nKatapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n**Solution Offered**\n\nNonprime consumers without credit scores currently struggle to get affordable financing options. Payday loans and credit cards offer predatory rates, but many of these consumers can’t afford to pay cash for furniture and other expensive items. Katapult gives these customers access to high-quality Ecommerce merchants with affordable payment structures. By integrating its platform to these Ecommerce sites, Katapult has built both a cheap and efficient solution for nonprime shoppers.\n\nOn the flipside, Ecommerce companies gain access to consumers they otherwise would not be able to sell to without bearing any credit risk. Katapult is fast, and that increases conversion rates. Merchants that integrate Katapult as a payment option also see higher repeat rates. Customers get access to new merchants and affordable financing; merchants gain millions of potential new customers with no added risk. A win-win scenario.\n\n**Valuation**\n\nKPLT is at a conservative $1B valuation with $450M in 2021 revenue. Check out the slide below from Katapult’s initial investor deck.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/evq0ng1tx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=c8e39ab5dce8ca2e895469936b5a001175cae7bd\n\n*Source: Investor Presentation*\n\nThe above slide compares different players in the BNPL sector. In a vacuum, 14x EBITDA for a company growing sales, net income, and EBITDA at 100%+ for the last three years is great value. When you compare this to other companies in the sector, Katapult looks criminally undervalued. But what if this entire sector is expensive, and KPLT’s price is reasonable in the broader FinTech market? I compiled the below data set to see Katapult against 15 other FinTech companies. The results are interesting:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cfkjo8wtx1x71.png?width=1386&amp;format=png&amp;auto=webp&amp;s=279e067ab736ae4185905d749375d1249f08d135\n\nNote that I highlighted other recent DeSPACs (PSFE, SOFI) and IPOs (AFRM, UPST, GLBE) to point out how they are priced vs. KPLT. Katapult is not just cheap for a BNPL financer. The stock is heavily discounted in the larger FinTech market as well. I built a scatterplot to illustrate these companies' \"expected\" EV/2022e Gross Profit.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h4n8zvrux1x71.png?width=1376&amp;format=png&amp;auto=webp&amp;s=7f492e668f24237ea951fb35099a7b7ea2b443e5\n\nKPLT is already profitable, expanding its margins, and growing revenue at a blistering 84% over the next two years. How does the market value it? 3.83x 2022e gross profits. Meanwhile, a regression line of the FinTech market suggests that KPLT *should* trade at 48.4x 2022e gross profits.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4b667psvx1x71.png?width=472&amp;format=png&amp;auto=webp&amp;s=359fd931a68e5598031a4547a93d24a0a11b3fbc\n\nWhile the above scatterplot shows a \"fair value\" 48.4 EV/2022e GP for Katapult, I’m not implying a guaranteed 1000% jump. You could argue that this entire sector is overvalued, and prices need to come down. However, when valuations are high, execution has to be flawless for you to turn a profit. When valuations are low, execution has to be catastrophic for you to turn a loss. KPLT is growing revenue at more than twice the pace of several peers, while trading at 1/5th their valuations. Good execution? Stock goes up. Rerating? Stock goes up. Increased coverage? Stock goes up. Company underperforms? Stock might stay flat. KPLT’s valuation gives us a \"heads I win, tails you lose\" scenario.\n\n**Short Squeeze Potential**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lwkcvkqwx1x71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=5bfe6c5e79c3c8b283c9df1231367234891a3f22\n\n**Fintel short squeeze list has $KPLT at the fourth position. The company has 15.7% of its float short and a borrow fee of 36.7%.**\n\n**Catalysts and Time Frame**\n\nKPLT is having earnings on 11/9 pre-market and can easily beat the estimates because of several partnerships with major players and the Q3 2020 is not abnormal like Q2 2020.\n\n**New Competition**\n\nI don't see Affirm or another competitor taking market share from Katapult(there’s a high chance that this could be acquired by Affirm itself). KPLT has a multi-year head start in this market niche, and it has been able to scale its operations profitably. Affirm set a new precedent through its waterfall partnership with Katapult, and I expect other BNPL companies to take similar steps if they want to enter the nonprime market.\n\n**The Trade**\n\nWe are rarely given the opportunity to buy hyper-growth at low valuations. When Mr. Market offers a gift, be greedy. Katapult's stock price declined quickly after the Q2 earnings, but it appears to have bottomed.\n\nI’m currently holding 75 $5C and $7.5C Dec’17 and Jan’21\n\n**Conclusion**\n\nKatapult is the best risk/return in the market right now. The company has managed to grow its revenue, EBITDA, and net income by \\~100% over the last three years, expects 84% revenue CAGR over the next two years, and it’s trading at 1.3x next year’s sales and 3.8x next year’s gross profit. Concentration, customer, and competition risks are minimal, and Katapult has a massive growth runway as the BNPL market grows. I imagine you will read several pitches for other FinTech companies such as Upstart, SoFi, and Square. Are these great companies? Absolutely. But ask yourself, “What has to happen for these stocks to increase 5x? 10x? What could make them decline 20%? 50%?”\n\nKatapult’s current performance relative to its peers easily justifies a $30 stock price. Now assume Katapult hits its revenue projections. Signs new partnerships with other merchants. Expands agreements with other BNPL players like Affirm. Katapult is a $1B company that could realistically grow to $10B in two years. If it outperforms, $10B might be a conservative valuation. I am incredibly bullish on Katapult, I encourage you to consider this intriguing opportunity.\n\nRelated links:\n\n* [https://ir.katapultholdings.com/news-events/news-releases](https://ir.katapultholdings.com/news-events/news-releases)\n* [https://katapult.com/partnerships/](https://katapult.com/partnerships/)",
        "subreddit": "SPACs",
        "title": "My thoughts on $KPLT and why it can be good opportunity for huge returns with low risk(already at the bottom). Earnings on 11/9 pre-market",
        "url": "https://www.reddit.com/r/SPACs/comments/qkobmu/my_thoughts_on_kplt_and_why_it_can_be_good/",
        "created": 1635830981.0
    },
    {
        "author": "Swingtrader79",
        "created_utc": 1637520557,
        "id": "qz1jhq",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "Hedge funds are beating the broader market right now and their combined buying power can easily drive stocks higher. Citi just put out a list of the top 10 stocks held by the biggest 50 hedge funds as of the end of Q3. I can't say the list is surprising, but it is interesting to see. \n\n&amp;#x200B;\n\n|Ticker|Name|Number of funds holding as top 10 position in size|\n|:-|:-|:-|\n|MSFT|Microsoft|26|\n|GOOGL|Google|17|\n|AMZN|Amazon|17|\n|FB|Facebook|15|\n|AAPL|Apple|9|\n|NFLX|Netflix|9|\n|CRM|Salesforce|6|\n|BKNG|Booking Holdings|5|\n|DASH|Doordash|5|\n|MA|Mastercard|5|\n\nIt's noteworthy that just because hedge funds own these stock, that doesn't mean they are completely bullish on them in the near term. It's very possible they are running shorts in the various forms (covered calls, puts, etc) against their own holdings to hedge themselves. \n\n**The only thing that stuck out to me here is BKNG**, which seems  overvalued, given it is trading at a price that is well above pre-pandemic levels and a P/E for this year over 55. Earnings are projected to grow at 130% next year.  That means the company would have about $100 per share in earnings. BKNG has traded very richly for some time, so applying a healthy 25X multiple on earnings, that would project a stock price of $2500 next year. In this market, a p/e of 25 looks pretty low, especially if the company continues to grow revenues quickly.\n\n**Sales for Q3 came in just under $4.7B**, which puts it on pace to exceed 2019 revenues of $15B in 2022 IF the trajectory continues. \n\nBKNG sold off big after its last earnings report, despite the fact they delivered a healthy beat of expectations. The drop is presumably because expectations had grown too high in advance of earnings, on concerns that COVID would impact travel, and on profit taking.  It's now down over 300 points from its high. \n\nIt's interesting to see the trend reversal that just occurred in the travel sector. AirBnB, BKNG, and Expedia, were all up double digits from mid-August and in the past 10 days, all 3 are down. \n\nAttractive entry point for BKNG?\n\nIt could be, but I'm betting the stock will retreat further as COVID cases rise due to holiday travels.  I'll be looking to buy the stock if it dips back to 2,100 again.",
        "subreddit": "stocks",
        "title": "The Top 10 Stocks Owned by Hedge Funds Right Now",
        "url": "https://www.reddit.com/r/stocks/comments/qz1jhq/the_top_10_stocks_owned_by_hedge_funds_right_now/",
        "created": 1637549357.0
    },
    {
        "author": "positronicsubprocess",
        "created_utc": 1635990530,
        "id": "qm9yv3",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Quicken and Salesforce partnership breakdown should lead to bullish guidance. \n\nNew partnership with Salesforce -\nWill be offering rocket products to small/local financial institutions through a SAAS based infrastructure hosted by Salesforce.    \n\nHow this benefits local institutions ?\nThey’ll be able to take on more loans with less overhead.  Licensed loan officers can complete process and hand off to rocket to complete closing.\n\nHow this benefits the consumer -\nThey’ll be able to get to work with a local bank supported by a $35BN companies software infrastructure.  \n\nHow this benefits rocket ?\nAccess to more market share.  \n99% of local banks throughout the US reported some type of mortgage operations in 2020.  \n\nQuick onboarding process, and less expensive operating costs for infrastructure support.\n\nPosition:\n5 Calls | Strike 17.5 | Expiry: Nov 19",
        "subreddit": "wallstreetbets",
        "title": "My theory to buy $RKT into earnings tomorrow",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qm9yv3/my_theory_to_buy_rkt_into_earnings_tomorrow/",
        "created": 1636019330.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "created_utc": 1637116114,
        "id": "qvoqlf",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": " \n\nI would like to introduce you to a company that me and some fellows have been bag holding (in the red) for a while.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/o01aea0zg2081.png?width=1811&amp;format=png&amp;auto=webp&amp;s=9b1c2ff27d98e97fadffb57f7ac6e47fe697f5de\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0tbh460zg2081.png?width=515&amp;format=png&amp;auto=webp&amp;s=e2a9b37a3ca822dfcab595c03876e864a4ec0b20\n\nMe - Bagholder of Warrants @ $4.0\n\nPayoneer vs PayPal\n\n&gt;*Payoneer, the Paypal for Shithole Developing Countries*\n\nPayoneer is Paypal for B2B global commerce, particularly outside North American and Europe. The company provides B2B services for millions of SMB and enterprises around the world\n\nThe growth of Payoneer’s global network included a move into India in April 2016, following a partnership with Pune-based IndusInd Bank and expressions of interest in its services from more than 10,000 freelancers and small businesses across the country.\n\n2018 PayPal study suggest that India’s freelancers represent around one quarter of the world’s gig workforce.\n\n**In August 2019, Payoneer announced a year-on-year increase of 400% in its customer base and a threefold increase in payment volumes processed in India.**\n\n*“PayPal says to shut domestic payments business in India” \\~ Reuters*\n\nNEW DELHI (Reuters) - PayPal Holdings Inc will wind down its domestic payments business in India from April 1,2021 the company said in a statement on Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hhza5041h2081.png?width=1743&amp;format=png&amp;auto=webp&amp;s=68e6bf53ca2bac7703919dbfab86bacbc49c0e89\n\nhttps://preview.redd.it/x0b8v621h2081.png?width=1759&amp;format=png&amp;auto=webp&amp;s=bb18aeaaf2806e2c0123eff083901b6b53691b5b\n\nThe ideal customer is a small but growing SMB doing business all over the world which needs currency, compliance and business services. Payoneer is an obvious candidate to handles these needs given its global network.\n\n· Payoneer offers vendors the ability to move money with a U.S. bank account and pay suppliers, without having to deal with too many banking hurdles or red tape.\n\n· A lot of freelancers on Upwork.com use Payoneer because many of them live in countries that Upwork.com can't wire money to.\n\n· Once vendors receive funds into their Payoneer account they can either withdraw the cash using their Payoneer provided Master Card or do a direct bank transfer from Payoneer to their local bank. Usually funds arrive within 1-2 business days.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/okzrve92h2081.png?width=1764&amp;format=png&amp;auto=webp&amp;s=c61bd06737a159941b6f9f26d96255fc497029c7\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins.\n\nSay a consumer wants to rent an airbnb. They use a credit card (or other payment method) to pay airbnb, a payment gateway facilitates payment acceptance. The payment is then processed and Airbnb ends up with the money from the transaction. Airbnb has now gathered cash through its acquirers (e.g., Adyen, ACI). Airbnb now needs to distribute funds to its SMB sellers. Airbnb uses payoneer to disburse funds to sellers. From this example, you can see Payoneer isn't competing with companies like Adyen or other acquirers/ processors, even though they are processing payments.\n\nPayoneer signs up individual sellers, which allows the sellers to use payoneer across platforms (e.g., facebook marketplace and amazon). Hyperwallet (owned by PayPal) is one of their competitors, but Hyperwallet operates completely differently, they sign up users via the platform, but this means you can't use hyperwallet for your business on both amazon and fb marketplace without going through the onboarding process again. Given the trend towards SMB sellers operating across multiple marketplaces, this is a huge benefit for payoneer, and makes PayPal's offering a lot less competitive. It also means Payoneer owns the seller relationship in a way that PayPal doesn't do as effectively, and makes it easier for them to package other offerings (e.g., working capital). These other offerings provide a two-fold benefit - their customer relationships become stronger, so revenue is seen as more recurring and investors will pay a higher multiple; and they'll make more money per customer.\n\nMy view is that Payoneer should see an S-type growth curve, where they'll hit a critical mass of users and see exponential growth, like cashapp, or venmo. Their investor presentation projects 25% revenue growth over the next couple years, I think this is super conservative, especially considering that 25% growth rate doesn't account for the two travel related marketplaces that got screwed by covid. Once they hit that critical mass of users, they'll pop off, sales &amp; marketing expenses will drop, and they'll become profitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h4bl85z2h2081.png?width=1556&amp;format=png&amp;auto=webp&amp;s=70d883ab62f7fb8a486f106a561fb6b927009211\n\nThe company’s focus on investing for future services is actually what gets me most excited as it may ward off near-term investor interest and improves its competitive position. It’s also a sign of a mature management team. The opportunity to provide additional services such as working capital, compliance and tax services seems like an obvious strategic move to drive growth. Specifically, working capital is far and away the most important service and something SMBs are desperate for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r6mxf5e3h2081.png?width=1664&amp;format=png&amp;auto=webp&amp;s=b56c5ccf853698f4f9ded9ecff758e2235e20180\n\nWho are their customers and where are they know? 5 million businesses in 190 countries. Customers include Amazon, Wish, Lazada (owned by Alibaba) Shopee, and Ebay. Weird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bt75qez3h2081.png?width=1631&amp;format=png&amp;auto=webp&amp;s=16c8e2fe383ce420e3c7a435f414ce4a74f599fd\n\nB2B global marketplace. The attractiveness of FinTech can be summarized in a few words, namely, “scale” and “network effects”. From the metrics Payoneer shared, it looks like they’re benefitting from these dynamics. Analysts estimate the global B2B market at tens of trillions $ and cross-border payments at $300bn. Obviously the pandemic only accelerated these trends. (From the presentation, it looks like company B2B AR/AP volume more than doubled at 140% in 2020 although the CFO later cited a 53% increase in volumes so not sure exactly how to interpret that.)\n\nVolume and customer growth drives revenues. Volumes grew over 53% in 2020 (67% adjusted for the pandemic) and are expected to grow at 44% and 33% in 2021 and 2022, respectively, which translates into 25% annual revenue growth per year for the next two years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ez48k0d4h2081.png?width=1721&amp;format=png&amp;auto=webp&amp;s=a58e917de3a963c384df9a7c6075f317d4539789\n\nThe benefits of network effects cannot be overstated as Paypal has proven. As a company acquires more customers, the value of its network increases. Payoneer’s business model leverages this same dynamic. Moreover, its network would be very difficult to replicate. The company’s global platform includes over 80 banks and clearing partners in over 100 countries. The company also provides customers data about its transactions, which I believe will be increasingly useful and sticky.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fbqvrzp4h2081.png?width=1797&amp;format=png&amp;auto=webp&amp;s=0b11294b0e932cc3737f7a0dba4788d382fc59e9\n\nWhat do I think the future holds for Payoneer? I actually think there are several exits for this company.\n\n**Growth:**\n\nNote that Payoneer currently doesn’t do B2C, hence it may be quite common for retail to never even have heard of it, unless they are a business or in the gig economy. That is one of the problems for the stock, no one has heard of it (yet) because it works quietly behind the scenes. Given enough funding, who knows, Payoneer may well expand to B2C. Alibaba initially started as B2B as well but has since expanded to B2C (Taobao).\n\nWe just need Payoneer to be 5% of PayPal (ie. $15B market cap) in order for stock price to be in the $30-$40 range. ($6B market cap corresponds to around $13-$15 stock price.)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mdrd9h35h2081.png?width=1748&amp;format=png&amp;auto=webp&amp;s=141ff8aaf50438f69846e1cdf874a66a59c8fc8f\n\n\\*\\*Acquisition:\\*\\*Large international payments processer buys them. Could be Paypal, Square, Stripe, First Data, etc. consolidation WILL happen in this space and I think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n\nWildcard: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be storage, and legal transactions then it will be financial transaction. They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\nThis is not financial advice, i am not a financial advisor. I have a long position with the warrants that i purchased in February and are therefore in the red.",
        "subreddit": "wallstreetbets",
        "title": "Payoneer (PAYO) - Emerging Markets are BACK!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qvoqlf/payoneer_payo_emerging_markets_are_back/",
        "created": 1637144914.0
    },
    {
        "author": "thriwaway2888",
        "created_utc": 1635887635,
        "id": "qlee5p",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI have a small beginners portfolio of C$20k. My portfolio is tech heavy and am looking for high growth non-tech stocks.\n\nInitial investment= C$20k + margin\nMonthly additional investment: C$500 - C$1,000\nHoldings= AAPL, WMT, CRM, MSFT\nHorizon: 2-years. I will liquidate in 2 yrs and use money to buy house\n\nI have a separate TFSA and RRSP. Each at 10k. Both invested in ETFs. I am therefore looking for non-ETF investments.\n\nThank you for your suggestions.",
        "subreddit": "stocks",
        "title": "Looking for now non-tech stock recommendations for a all portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/qlee5p/looking_for_now_nontech_stock_recommendations_for/",
        "created": 1635916435.0
    },
    {
        "author": "ShittyStockPicker",
        "created_utc": 1637377925,
        "id": "qxwfv7",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "When I first started out I'd hear a ticker on CNBC, look it up, and just check it whenever I happened to remember to. Sometimes I'd just happen to remember to look up Salesforce or GE and just happen to catch some interesting things like a dip, or a rise in price on huge volume. It was so haphazard and I missed so many opportunities. So, I created watchlists. \n\n&amp;#x200B;\n\nEveryday after the market close, or sometime on the weekend I go through the same watchlists. My watchlists are as follows:   \n\n\n1: SPDR Sector ETF Watchlist  \nThis watchlist instantly loads up all of SPDR sector ETF tickers. There are 12 of them. This is where I start my end of market routine. I look at who went up, who went down. I start thinking about how this confirms or disproves some of the theories I have about the overall market. I personally think inflation is going to level off, but not go away. Oh, well, would you look at that? The funds that benefit from inflation are down, (XLE, XLF, XLB) and XLK is up. \n\n\\*Note: I memorized which sectors each of these tickers represent. Here is a cheatsheet:   \nXLK = Tech  \nXLU = Utilities  \nSPY = (Here for Good Measure)  \nXLB = Materials  \nXLC = Communications  \nXLP = Consumer Staples  \nXLI = Industrials  \nXLRE = Real Estate  \nXLV = Healthcare  \nXLF = Financials  \nXLE = Energy\n\nhttps://preview.redd.it/hxnbo7mqzn081.jpg?width=1025&amp;format=pjpg&amp;auto=webp&amp;s=689916ee5e6eeb787ec2d5378db9070ad720d5a5\n\n&amp;#x200B;\n\nBecause of this watchlist, I started  putting together an \"inflation is under control\" watchlist. I don't feel like I need to share it. However, it is mostly tech and a -3x daily energy and a -3x daily financial ETF. \n\n**2: Look through a watchlist made up of stocks from a sector that did something interesting**\n\nNow I start going through the holdings of individual SPDR etfs. I look for trends in subgroups and individual outliers. Hmm, what's this? XLC is down, but Facebook has a nearly 2% gain for the day? Interesting. Let's look at the chart. \n\n&amp;#x200B;\n\n[Facebook is clearly an outlier, why?](https://preview.redd.it/a2pnngcoln081.jpg?width=1453&amp;format=pjpg&amp;auto=webp&amp;s=625337d22bcacfc7a183c2dff9a0399838cda075)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fzga63p8nn081.jpg?width=1309&amp;format=pjpg&amp;auto=webp&amp;s=936afc3e48a711994db2479be70d9a9e9ca254ab\n\nAhhhh, okay. Facebook might have finally hit a bottom. If I were interested in trading FB, I would probably start looking for some support and resistance levels. I would also start keeping track of FB's volume levels. I might even review my notes from the FB conference call I listened to a couple weeks ago to see if anything that sent the stock down might have changed. I would also start asking myself if this is a fluke, or if FB recovering has anything to do with any of the broader themes I've been tracking, or if this is something new I should be thinking about. \n\n  \nI repeat this process for all the SPDR funds I feel did something interesting.   \n\n\n**TLDR:**  \nWatchlists Enable Me To Quickly:   \n1: Look for trends in sectors  \n2: Look for trends in subsectors  \n3: Determine if any of today's information confirms or busts my beliefs about market themes  \n4: Determine if a sector or individual stock is worth trading, and how to trade it",
        "subreddit": "options",
        "title": "On The Importance of Watch Lists",
        "url": "https://www.reddit.com/r/options/comments/qxwfv7/on_the_importance_of_watch_lists/",
        "created": 1637406725.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1635802992,
        "id": "qkolqi",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Monday, November 1, 2021**\n\nThe S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) continued their remarkable rally to once again reach new intraday record highs, with equities carrying on momentum from a record-setting October. Market participants continue to be encouraged by the stronger-than-expected start of the Q3 corporate earnings season, with companies posting robust results despite ongoing supply-side disruptions and labor market imbalances. Looking ahead, market participants are waiting for the Fed’s monthly meeting minutes, set to be released later this week, where I expect the Fed to officially start the tapering process, and the October jobs report, which is expected to show a pick-up in hiring after two disappointing months in a row.\n\nAccording to a report by LPL Financial, November has been the best month for equities since 1950.\n\nThough some of the heavily weighted index components from last week had disappointed against consensus estimates — with both Amazon and Apple shares dropping after posting weaker-than-expected results and guidance — other stronger results helped offset these misses, with names including Alphabet and Microsoft rallying to record levels on the heels of their respective reports. \n\nOn Tuesday and Wednesday, the Federal Reserve will meet for its monthly policy-setting meeting, which is followed by a statement and press conference by Fed Chairman Jerome Powell. This meeting is expected to either announce or concretely set the stage to being tapering the pace of quantitative easing which has been running at a clip of $120 billion per month. Last month, the Fed announced that amid improving economic data, the process would begin before the end of the year and would come to an end around mid-2022. \n\nGiven the market has been anticipating the start to tapering for months now, speculation around when the Fed will make a move on interest rates has become a point of particular interest to investors. This week's FOMC statement and press conference are likely to provide some more color to market participants around how committee members are thinking about the timing for interest-rate hikes, especially given the persistent jump in inflation seen in data including last week's core personal consumption expenditures report.\n\n**Highlights**\n\n* Tesla (TSLA) continued its psycho-rally to reach a new all time high and making CEO Elon Musk the first person ever to surpass a $300 billion personal net worth. Absolutely insane.\n* Amazon (AMZN) seeks approval from the Federal Communications Commission to launch two Project Kuiper satellites in 2022. Similar to SpaceX, it intends to be a broad constellation of internet and broadband satellites.\n* Peloton (PTON) and Delta Airlines (DAL) partnered together to make exclusive meditation and stretching content for Delta’s in-seat screens. Delta stock rallied more than 3% on the news while PTON traded 1.5% higher\n* Shares of education company Chegg (CHGG) gapped down more than 25% after posting disappointing earnings.ims for $53 billion valuation in upcoming IPO.\n* EV startup Rivian which is backed by Amazon (AMZN) and Ford Motors (F) a\n* Bank of America (BAC) is reportedly planning to file an application to set up a securities firm in China. Back in August, JP Morgan (JPM) got the greenlight to setup the first foreign owned broker in China\n* Tesla (TSLA) said it is opening its fast charging network for other EV’s in the Netherlands.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AbbVie (ABBV) target raised by Morgan Stanely from $116 to $124 at Overweight. Stock currently around $115\n* Avantor with a host of target raises. Average price target $48 at Outperform. Stock currently around $39.50\n* Chubb (CB) target raised by Credit SUisse from $198 to $225 at Outperform. Stock currently around $192\n* Costco (COST) with three target raises. Stock currently around $492\n   * Telsey Advisory from $480 to $535 at Outperform\n   * Loop Capital from $515 to $545 at Buy\n   * Stifel Nicolaus from $475 to $515 at Buy\n* Salesforce (CRM) target raised by Morgan Stanley from $345 to $360 at Overweight. Stock currently around $303\n* Chevron (CVX) target raised by Raymond James from $134 to $137 at Outperform. Stock currently around 115\n* HubSpot (HUBS) target raised by BMO Capital Markets from $800 to $850 at Outperform. Stock currently around $804\n* Lab Company of America (LH) target raised by Credit Suisse from $336 to $338. Stock currently around $288\n* ServiceNow (NOW) target raised by Needham &amp; Co from $641 to $780 at Buy. Stock currently around $682\n* Exxon Mobil (XOM) target raised by Wells Fargo from $71 to $75 at Overweight. Stock currently around $65\n\n“Never let the fear of striking out keep you from playing the game.” - Babe Ruth",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, Nov 1 , 2021",
        "url": "https://www.reddit.com/r/stocks/comments/qkolqi/here_is_a_market_recap_for_today_monday_nov_1_2021/",
        "created": 1635831792.0
    },
    {
        "author": "bearcat2202",
        "created_utc": 1636596542,
        "id": "qraam4",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "What your insights? Is this new CRM (Twilio Engage) they are launching through the segment acquisition the real deal? And be the next best big thing in tech and for CRMs? They also aim to make 5x acquisitions a year for the next couple years. But it seems the true future of this company is in Twilio engage. Does anyone have good insights into this company both financially and technologically as well as twilio engage? Could this company be a 10x or better opportunity?",
        "subreddit": "stocks",
        "title": "From a technological and financial standpoint Twilio $TWLO looks to have a great opportunity as 10x+. Who understands this company well?",
        "url": "https://www.reddit.com/r/stocks/comments/qraam4/from_a_technological_and_financial_standpoint/",
        "created": 1636625342.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1637015975,
        "id": "qushen",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, November 15, 2021**\n\nStocks finished mixed, with the Dow Jones (DIA) and tech-heavy Nasdaq (QQQ) closing modestly lower, as market participants digested upbeat economic data coming from China and await for a key report on retail sales in the US later this week. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed on the day, closing 0.44% lower.\n\nStronger than expected economic data coming out of China helped lift the sentiments of market participants following last week’s inflation report. The world's second-largest economy saw both retail sales and industrial production unexpectedly rise in October in a year-over-year period, suggesting that China’s economy is holding up better than expected amid new stay-in-place restrictions and ongoing power shortages. However, prices of new homes dropped 0.25% in October versus September, marking the biggest drop in more than six years as the nation’s real estate market remains under pressure from the Evergrande situation. Here are the numbers:\n\n* Retail Sales: +4.9% YoY vs +3.5 expected\n* Industrial Production: +3.5% YoY vs +3% expected\n\nTomorrow, market participants will receive the Commerce Department’s monthly Retail Sales report, which is expected to show a 1.3% year-over-year rise in retail sales, improving from September’s disappointing 0.7% rise. Moreover, major retailers like Walmart (WMT), Target (TGT), Home Depot (HD), and Lowe’s (LOW) are set to report Q3 earnings, which will offer additional data regarding the state of consumer demand.  \n\nLast week, markets were spooked by the pace of inflation, with the recent Consumer Price Index (CPI) showing the fastest pace of increase in roughly 30 years. which showed prices soared 6.2% in a year-on-year period, accelerating from September’s 5.4% YoY rate, and higher than the 5.9% expected. The staying power and magnitude of inflationary pressures has, perhaps, become the central question for market participants, with companies across the board reporting rising input costs and price hikes passed on to the consumers to preserve margins. While Q3 earning results have robustly demonstrated that companies in the SPY were largely able to navigate these cost pressures, the possibility remains that if inflation runs hotter than expected for longer than expected, it could begin to hamper consumer demand. \n\nIan Shepherdson, Chief Economist at Pantheon Macroeconomics, wrote in a note to clients, “The surge in core inflation in October marks the start of a run of big gains, thanks to surging used auto prices, rebounding airline fares, and faster increases in housing costs. We think core inflation will peak at almost 7% in March, which will pose a serious challenge to the Fed's benign medium-term view. Chair \\[Jerome\\] Powell will have to convince markets that the combination of rocketing payrolls and soaring inflation does not threaten the transitory story, to which he appears still to be committed. We remain of the view that the Fed will start to hike in September, but a June hike can't be ruled out. If labor participation shows no sign of life by the March FOMC meeting, we expect the Fed to accelerate the taper and then hike in June. This would play badly across all asset markets.” As always, it is important to acknowledge and understand the risks present in the market. \n\n**Highlights**\n\n* Shares of Boeing (BA) surged after the company said it was “hopeful” China would resume order of the 737 Max two years after its grounding. \n* U.S. crude oil output from the Permian Basin of West Texas and New Mexico is set to jump to a record 4.95 million barrels per day in December, a new government forecast showed on Monday. This would bring production in the key U.S. shale patch well above its pre-pandemic average from March 2020.\n* Shares of oat-milk maker Oatly (OTLY) fell more than 20% after missing earnings expectations and cutting guidance. The stock is down roughly 50% since IPO back in late-May. \n* Shares of Snap (SNAP) were up after the company reached a deal with Sony Music Entertainment to allow the company to use its artist and sounds on the Snapchat App. \n* Twitter Inc said on Monday it will expand free access to the social networking site's data to help software developers create tools and products that could promote safer online conversations or curate content. The move is part of Twitter's growing effort over the past year to decentralize the company, a vision that aims to give users more control over what content they see in their Twitter feed or have new ways of sharing content on the site, Amir Shevat, Twitter's head of product for the developer platform, said in an interview.\n* Amazon.com Inc has reached a deal to sell virtual medical services to Hilton Hotels in the United States, one of the first major customers for the company’s burgeoning healthcare business. Amazon Care is an on-demand health offering that lets users message or video-chat clinicians and receive home visits in some cities.\n* UK ministers are expected to order an in-depth investigation of Nvidia Corp's planned $40 billion acquisition of British chip designer ARM over antitrust and national security concerns. As a huge NVDA bull, hope all goes well!\n* Social Finance Tech (SOFI) announced an offering of 50 million shares. The stock is down as a result. Not surprising for management to take advantage of this massive runup\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AutoDesk (ADSK) target raised by Mizuho from $350 to $380 at Buy. Stock currently around $326\n* Broadcom (AVGO) target raised by Argus from $560 to $620 at Buy. Stoick currently around $565\n* Coupang (CPNG) target raised by Mizuho from $32 to $40 at Overweight. Stock currently around $28\n* Salesforce (CRM) target raised by Mizuho from $320 to $360 at Buy. Stock currently around $305\n* Crowdstrike (CRWD) target raised by Mizuho from $330 to $360 at Buy. Stock was also downgraded by Morgan Stanley to $250, so there are competing perspectives here\n* Intuit (INTU) target raised by Morgan Stanley from $615 to $715 at Overweight. Stock currently around $626\n* MasterCard (MA) target raised by Mizuho from $50 to $465 at Buy. Stock currently around $360\n* Netflix (NFLX) target raised by KeyCorp from $690 to $725 at Overweight. Stock currently around $680\n* NVIDIA (NVDA) with three target raises. Stock currently around $300 \n   * Citigroup from $223 to $350 at Buy\n   * Robert W Baird from $240 to $360 at Outperform\n   * UBS Group from $230 to $350 at Buy\n* Palo Alto Networks (PANW) with three target raises. Stock currently around $518\n   * Mizuho from $560 to $625 at Buy\n   * Deutsche Bank from $560 to $605 at Buy\n   * Royal Bank of Canada from $560 to $590 at Outperform\n* Roblox (RBLX) target raised by BTIG Research from $98 to $133 at Buy. Stock currently around $108\n* Signature Bank (SBNY) target raised by Raymond James from $360 at $400 at Outperform. Stock currently around $321\n* Snowflake (SNOW) target raised by Mizuho from  $340 to $450 at Buy. Stock currently around $393\n* Social Finance Tech (SOFI) target raised by Mizuho from $28 to $30 at Buy. Stock currently around $22\n* Valero Energy (VLO) target raised by Wells Fargo from $102 to $106 at Overweight. Stock currently around $77\n\n\"Don't judge each day by the harvest you reap but by the seeds that you plant.\" -Robert Louis Stevenson",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, Nov 15, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/qushen/here_is_a_market_recap_for_today_monday_nov_15/",
        "created": 1637044775.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1637016001,
        "id": "qushqe",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Monday, November 15, 2021**\n\nStocks finished mixed, with the Dow Jones (DIA) and tech-heavy Nasdaq (QQQ) closing modestly lower, as market participants digested upbeat economic data coming from China and await for a key report on retail sales in the US later this week. The Russell 2000 (IWM), which tracks the performance of small-caps, underperformed on the day, closing 0.44% lower.\n\nStronger than expected economic data coming out of China helped lift the sentiments of market participants following last week’s inflation report. The world's second-largest economy saw both retail sales and industrial production unexpectedly rise in October in a year-over-year period, suggesting that China’s economy is holding up better than expected amid new stay-in-place restrictions and ongoing power shortages. However, prices of new homes dropped 0.25% in October versus September, marking the biggest drop in more than six years as the nation’s real estate market remains under pressure from the Evergrande situation. Here are the numbers:\n\n* Retail Sales: +4.9% YoY vs +3.5 expected\n* Industrial Production: +3.5% YoY vs +3% expected\n\nTomorrow, market participants will receive the Commerce Department’s monthly Retail Sales report, which is expected to show a 1.3% year-over-year rise in retail sales, improving from September’s disappointing 0.7% rise. Moreover, major retailers like Walmart (WMT), Target (TGT), Home Depot (HD), and Lowe’s (LOW) are set to report Q3 earnings, which will offer additional data regarding the state of consumer demand.  \n\nLast week, markets were spooked by the pace of inflation, with the recent Consumer Price Index (CPI) showing the fastest pace of increase in roughly 30 years. which showed prices soared 6.2% in a year-on-year period, accelerating from September’s 5.4% YoY rate, and higher than the 5.9% expected. The staying power and magnitude of inflationary pressures has, perhaps, become the central question for market participants, with companies across the board reporting rising input costs and price hikes passed on to the consumers to preserve margins. While Q3 earning results have robustly demonstrated that companies in the SPY were largely able to navigate these cost pressures, the possibility remains that if inflation runs hotter than expected for longer than expected, it could begin to hamper consumer demand. \n\nIan Shepherdson, Chief Economist at Pantheon Macroeconomics, wrote in a note to clients, “The surge in core inflation in October marks the start of a run of big gains, thanks to surging used auto prices, rebounding airline fares, and faster increases in housing costs. We think core inflation will peak at almost 7% in March, which will pose a serious challenge to the Fed's benign medium-term view. Chair \\[Jerome\\] Powell will have to convince markets that the combination of rocketing payrolls and soaring inflation does not threaten the transitory story, to which he appears still to be committed. We remain of the view that the Fed will start to hike in September, but a June hike can't be ruled out. If labor participation shows no sign of life by the March FOMC meeting, we expect the Fed to accelerate the taper and then hike in June. This would play badly across all asset markets.” As always, it is important to acknowledge and understand the risks present in the market. \n\n**Highlights**\n\n* Shares of Boeing (BA) surged after the company said it was “hopeful” China would resume order of the 737 Max two years after its grounding. \n* U.S. crude oil output from the Permian Basin of West Texas and New Mexico is set to jump to a record 4.95 million barrels per day in December, a new government forecast showed on Monday. This would bring production in the key U.S. shale patch well above its pre-pandemic average from March 2020.\n* Shares of oat-milk maker Oatly (OTLY) fell more than 20% after missing earnings expectations and cutting guidance. The stock is down roughly 50% since IPO back in late-May. \n* Shares of Snap (SNAP) were up after the company reached a deal with Sony Music Entertainment to allow the company to use its artist and sounds on the Snapchat App. \n* Twitter Inc said on Monday it will expand free access to the social networking site's data to help software developers create tools and products that could promote safer online conversations or curate content. The move is part of Twitter's growing effort over the past year to decentralize the company, a vision that aims to give users more control over what content they see in their Twitter feed or have new ways of sharing content on the site, Amir Shevat, Twitter's head of product for the developer platform, said in an interview.\n* Amazon.com Inc has reached a deal to sell virtual medical services to Hilton Hotels in the United States, one of the first major customers for the company’s burgeoning healthcare business. Amazon Care is an on-demand health offering that lets users message or video-chat clinicians and receive home visits in some cities.\n* UK ministers are expected to order an in-depth investigation of Nvidia Corp's planned $40 billion acquisition of British chip designer ARM over antitrust and national security concerns. As a huge NVDA bull, hope all goes well!\n* Social Finance Tech (SOFI) announced an offering of 50 million shares. The stock is down as a result. Not surprising for management to take advantage of this massive runup\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AutoDesk (ADSK) target raised by Mizuho from $350 to $380 at Buy. Stock currently around $326\n* Broadcom (AVGO) target raised by Argus from $560 to $620 at Buy. Stoick currently around $565\n* Coupang (CPNG) target raised by Mizuho from $32 to $40 at Overweight. Stock currently around $28\n* Salesforce (CRM) target raised by Mizuho from $320 to $360 at Buy. Stock currently around $305\n* Crowdstrike (CRWD) target raised by Mizuho from $330 to $360 at Buy. Stock was also downgraded by Morgan Stanley to $250, so there are competing perspectives here\n* Intuit (INTU) target raised by Morgan Stanley from $615 to $715 at Overweight. Stock currently around $626\n* MasterCard (MA) target raised by Mizuho from $50 to $465 at Buy. Stock currently around $360\n* Netflix (NFLX) target raised by KeyCorp from $690 to $725 at Overweight. Stock currently around $680\n* NVIDIA (NVDA) with three target raises. Stock currently around $300 \n   * Citigroup from $223 to $350 at Buy\n   * Robert W Baird from $240 to $360 at Outperform\n   * UBS Group from $230 to $350 at Buy\n* Palo Alto Networks (PANW) with three target raises. Stock currently around $518\n   * Mizuho from $560 to $625 at Buy\n   * Deutsche Bank from $560 to $605 at Buy\n   * Royal Bank of Canada from $560 to $590 at Outperform\n* Roblox (RBLX) target raised by BTIG Research from $98 to $133 at Buy. Stock currently around $108\n* Signature Bank (SBNY) target raised by Raymond James from $360 at $400 at Outperform. Stock currently around $321\n* Snowflake (SNOW) target raised by Mizuho from  $340 to $450 at Buy. Stock currently around $393\n* Social Finance Tech (SOFI) target raised by Mizuho from $28 to $30 at Buy. Stock currently around $22\n* Valero Energy (VLO) target raised by Wells Fargo from $102 to $106 at Overweight. Stock currently around $77\n\n\"Don't judge each day by the harvest you reap but by the seeds that you plant.\" -Robert Louis Stevenson",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, Nov 15, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/qushqe/here_is_a_market_recap_for_today_monday_nov_15/",
        "created": 1637044801.0
    },
    {
        "author": "ImpactExtreme",
        "created_utc": 1636524113,
        "id": "qqnlqi",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Brivo Inc., a maker of security software for buildings, is in advanced discussions to merge with blank-check company Crown PropTech Acquisitions, according to people familiar with the matter.\n\nA deal would value the combined entity at around $800 million including debt, the people said, asking not to be identified because the matter is private. \n\nRepresentatives for Brivo and Crown PropTech declined to comment.\n\nFounded in 1999, Bethesda, Maryland-based Brivo sells security technology and services including access control and video surveillance to property owners. Its cloud-based system is used to safeguard enterprises, residential buildings and properties such as vacation rentals.\n\nIt counts Amazon.com Inc.’s Whole Foods, Salesforce.com Inc. and fitness center Solidcore among its customers, Brivo’s website showed.\nBrivo was acquired by former Barracuda Networks Inc. chief executive officer Dean Drako in 2015 for $50 million, according to a statement at the time.\nCrown PropTech, a special purpose acquisition company, raised $276 million in February, according to a statement. It’s an affiliate of New York-based real estate holding company Crown Acquisitions Inc., its website showed.",
        "subreddit": "SPACs",
        "title": "$CPTK - Software Firm Brivo Nears SPAC Deal With Crown PropTech",
        "url": "https://www.reddit.com/r/SPACs/comments/qqnlqi/cptk_software_firm_brivo_nears_spac_deal_with/",
        "created": 1636552913.0
    },
    {
        "author": "bopfj",
        "created_utc": 1637719957,
        "id": "r0tpe6",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " \n\nCheck out this pharmaceutical play. It has been beaten down the past few weeks after receiving an FDA approval. Here are some bullish reasons to consider investing:\n\n1. another PDUFA on 1/29/22\n2. expected to become profitable in 2022\n3. they have 2 new products coming to market in 4Q21.\n4. they are increasing their salesforce for their primary product in 4Q21\n5. Eton now has six FDA-approved products, three of which (carglumic acid, EPRONTIA®, and Rezipres®) are expected to launch in the fourth quarter of 2021. The company also has four additional products that have been submitted to the FDA and could be approved and launched in 2022.",
        "subreddit": "StockMarket",
        "title": "DD on $ETON",
        "url": "https://www.reddit.com/r/StockMarket/comments/r0tpe6/dd_on_eton/",
        "created": 1637748757.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1635803022,
        "id": "qkom36",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Monday, November 1, 2021**\n\nThe S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) continued their remarkable rally to once again reach new intraday record highs, with equities carrying on momentum from a record-setting October. Market participants continue to be encouraged by the stronger-than-expected start of the Q3 corporate earnings season, with companies posting robust results despite ongoing supply-side disruptions and labor market imbalances. Looking ahead, market participants are waiting for the Fed’s monthly meeting minutes, set to be released later this week, where I expect the Fed to officially start the tapering process, and the October jobs report, which is expected to show a pick-up in hiring after two disappointing months in a row.\n\nAccording to a report by LPL Financial, November has been the best month for equities since 1950.\n\nThough some of the heavily weighted index components from last week had disappointed against consensus estimates — with both Amazon and Apple shares dropping after posting weaker-than-expected results and guidance — other stronger results helped offset these misses, with names including Alphabet and Microsoft rallying to record levels on the heels of their respective reports. \n\nOn Tuesday and Wednesday, the Federal Reserve will meet for its monthly policy-setting meeting, which is followed by a statement and press conference by Fed Chairman Jerome Powell. This meeting is expected to either announce or concretely set the stage to being tapering the pace of quantitative easing which has been running at a clip of $120 billion per month. Last month, the Fed announced that amid improving economic data, the process would begin before the end of the year and would come to an end around mid-2022. \n\nGiven the market has been anticipating the start to tapering for months now, speculation around when the Fed will make a move on interest rates has become a point of particular interest to investors. This week's FOMC statement and press conference are likely to provide some more color to market participants around how committee members are thinking about the timing for interest-rate hikes, especially given the persistent jump in inflation seen in data including last week's core personal consumption expenditures report.\n\n**Highlights**\n\n* Tesla (TSLA) continued its psycho-rally to reach a new all time high and making CEO Elon Musk the first person ever to surpass a $300 billion personal net worth. Absolutely insane.\n* Amazon (AMZN) seeks approval from the Federal Communications Commission to launch two Project Kuiper satellites in 2022. Similar to SpaceX, it intends to be a broad constellation of internet and broadband satellites.\n* Peloton (PTON) and Delta Airlines (DAL) partnered together to make exclusive meditation and stretching content for Delta’s in-seat screens. Delta stock rallied more than 3% on the news while PTON traded 1.5% higher\n* Shares of education company Chegg (CHGG) gapped down more than 25% after posting disappointing earnings.ims for $53 billion valuation in upcoming IPO.\n* EV startup Rivian which is backed by Amazon (AMZN) and Ford Motors (F) a\n* Bank of America (BAC) is reportedly planning to file an application to set up a securities firm in China. Back in August, JP Morgan (JPM) got the greenlight to setup the first foreign owned broker in China\n* Tesla (TSLA) said it is opening its fast charging network for other EV’s in the Netherlands.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* AbbVie (ABBV) target raised by Morgan Stanely from $116 to $124 at Overweight. Stock currently around $115\n* Avantor with a host of target raises. Average price target $48 at Outperform. Stock currently around $39.50\n* Chubb (CB) target raised by Credit SUisse from $198 to $225 at Outperform. Stock currently around $192\n* Costco (COST) with three target raises. Stock currently around $492\n   * Telsey Advisory from $480 to $535 at Outperform\n   * Loop Capital from $515 to $545 at Buy\n   * Stifel Nicolaus from $475 to $515 at Buy\n* Salesforce (CRM) target raised by Morgan Stanley from $345 to $360 at Overweight. Stock currently around $303\n* Chevron (CVX) target raised by Raymond James from $134 to $137 at Outperform. Stock currently around 115\n* HubSpot (HUBS) target raised by BMO Capital Markets from $800 to $850 at Outperform. Stock currently around $804\n* Lab Company of America (LH) target raised by Credit Suisse from $336 to $338. Stock currently around $288\n* ServiceNow (NOW) target raised by Needham &amp; Co from $641 to $780 at Buy. Stock currently around $682\n* Exxon Mobil (XOM) target raised by Wells Fargo from $71 to $75 at Overweight. Stock currently around $65\n\n“Never let the fear of striking out keep you from playing the game.” - Babe Ruth",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, Nov 1, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qkom36/here_is_a_market_recap_for_today_monday_nov_1_2021/",
        "created": 1635831822.0
    },
    {
        "author": "maschx",
        "created_utc": 1636734864,
        "id": "qsf1k7",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Phunware is *The* Engagement Platform and Blockchain.\n\nThis mention was from a live Twitter chat today with CEO Alan Knitowski, along with this beautiful quote from him: “People shorting us think we’re full of shit…Bring it…We’re here to financially blow you up.” Yesterday they reported positive earnings for the first time since 2018.\n\nAnyway, because I haven’t had the time to do a write-up on today’s interview, the following is my writeup of a a Benzinga interview with Phunware COO Randall Crowder and Board Member Ryan Costello from *last week*. It’s a written explanation of the business and its goals based on that interview, along with quotes from the two:\n\nPhunware is a mobile platform that allows people to monetize their data (whether political data for politicians or marketing data for companies) with native cryptocurrency to engage with politicians/companies in a decentralized way, allowing users to “voluntarily opt-in” to the use of their data. This allows constituents/consumers to monetize their verifiable data on a blockchain in order to reflect their interests to candidates/companies, and this helps them produce more connected campaigns or more satisfactory consumer goods/services. Politicians are incentivized to pay for political data because it is the backbone of winning any campaign, and constituents are incentivized to engage with their politicians to have their views reflected. Same goes for consumers and the businesses that require their revenue to survive.\n\nPhunware seeks to compete with traditional advertising—particularly social media—by redefining how constituents engage with their politicians. The Trump 2020 campaign was planning to outsource their data intelligence to Salesforce, but campaign insider Brad Parscale recognized the reality that this company was the only company that could do so. At that time they were managing all of Fox News’ mobile applications.\n\n\n—\n\n “If you want the Trump experience, we can do that right now for you…What you can do in the real world is things like rallies, events.” \n\n“Come for the meme, stay for the company.”\n\n“What Trump is trying to do is disruption. It’s dis-intermediating the middle man, and I think that’s what people in their soul just do not feel comfortable with. That’s probably the greatest threat to our democracy, is the prevention of the fair exchange of ideas.”\n\n“50% revenue guidance in Q3, 100% revenue guidance in Q4.”\n\n“At the time [we began working with Trump] we were managing all of Fox’s [News] entire mobile ecosystem. You have a company that can buy and build anything they want, and their outsourcing to Phunware.”\n\n—COO Randall Crowder\n\n—\n\n“The constant engagement with constituents and voters is the difference between winning and losing.”\n\n“There is not confidence that you get full participation on social media platforms…and the objective is frankly to push through those algorithms,”\n\n“It’s not just political candidates, it’s issue advocacy organizations and associations that highly value this type of engagement.”\n\n“Don’t try to convince a voter why you’re right, find a voter where they are.”\n\n—Board Member Ryan Costello",
        "subreddit": "investing",
        "title": "$PHUN up +12% on discussion of key previous clientele. CEO highlights in live Twitter chat that clients have included: Fox News, the NFL, NASCAR, and the Olympic Games. So what is Phunware?…",
        "url": "https://www.reddit.com/r/investing/comments/qsf1k7/phun_up_12_on_discussion_of_key_previous/",
        "created": 1636763664.0
    },
    {
        "author": "mikeyrocksin2021",
        "created_utc": 1637947551,
        "id": "r2saq2",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Retail stocks, along with the broader market, were down Friday morning as fears of a new Covid-19 variant hammered the market amid potentially strong Black Friday sales. Shares of Dollar Tree (DLTR), which sells the majority of its products—including toys, home decor, kitchenware, and seasonal goods—was down nearly 4% to $140.81. Nordstrom (JWN) was down 7% at $21.04. Macy’s (M) was off 7.2%. Retailers that struggled to keep up with supply-chain crunches—as noted in their third-quarter earnings—including Kohls (KSS) and Gap (GPS) were down 2.1% to $54.09, and 3.4% to $17.25, respectively. Shares of Abercrombie &amp; Fitch (ANF) were down 3.3% to $37.98.\n\nFor the most part though, retail stocks have been gaining amid high demand this year. The SPDR S&amp;P Retail exchange-traded fund (XRT) is up 50.05% this year as of Friday morning, still on pace for its best year since 2009, when it rose 74.8%. The ETF is down 2.8% in Friday trading. The Invesco S&amp;P 500 Equal Weight Consumer Discretionary ETF (RCD) is up nearly 25% this year, a sign that despite the previous Delta variant, shoppers are ready to spend their cash and investors recognize the demand.\n\nData from Friday morning showed U.S. consumers are expected to spend $12.9 billion in online sales and have already spent $6.9 billion online during Thanksgiving Day, up 1.1% from last year, according to data from Salesforce. The National Retail Federation estimates 58.1 million people will shop on Small Business Saturday, and 62.8 million will shop online on Cyber Monday. The trade organization projects consumers will spend an average of $997.73, with total spending up as much as 10.5% to $859 billion this season.\n\nU.S. online sales for the first three weeks of November are up 10% year-over-year, $74 billion already spent, as consumers continue to fit in holiday shopping as early as possible over concerns regarding shipping delays and supply chain issues, according to Salesforce.\n\nThe Dow was on track for its worst Black Friday on record, with the S&amp;P 500 and Nasdaq on pace for their worst Black Friday since 2009.\n\n[https://www.marketwatch.com/articles/retail-stocks-sink-amid-strong-black-friday-sales-blame-covid-variant-fears-51637946074?mod=mw\\_latestnews](https://www.marketwatch.com/articles/retail-stocks-sink-amid-strong-black-friday-sales-blame-covid-variant-fears-51637946074?mod=mw_latestnews)",
        "subreddit": "stocks",
        "title": "Retail Stocks Sink Amid Strong Black Friday Sales. Blame Covid Variant Fears",
        "url": "https://www.reddit.com/r/stocks/comments/r2saq2/retail_stocks_sink_amid_strong_black_friday_sales/",
        "created": 1637976351.0
    },
    {
        "author": "Biggie_Cheese96",
        "created_utc": 1637071618,
        "id": "qv8job",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I am going to be starting a new job soon that will allow me to open a second Roth IRA and max out the $500/month contribution limit. I already intend to max out the employer match on their Roth 401k and already max out my first Roth IRA (strategy is to maximize tax-free capital appreciation with growth stocks like Nvidia, Qualcomm, Salesforce, Unity, etc.) and contribute a good amount to my more speculative taxable account (Palantir, Lucid, Matterport, etc.).\n\nMy strategy for this second Roth IRA is to maximize tax-free dividend growth w/ a bit of capital appreciation, but I am at a crossroads on what I should put in this second Roth IRA.\n\nMy initial plan was to just load it up with high-yield CEF like BST, BME, CSQ, etc. or to instead focus on dividend growth stocks like a little bit lower yields but more reliable growth.",
        "subreddit": "stocks",
        "title": "Dividend Growth or CEF in a second Roth IRA",
        "url": "https://www.reddit.com/r/stocks/comments/qv8job/dividend_growth_or_cef_in_a_second_roth_ira/",
        "created": 1637100418.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1635755702,
        "id": "qk9m1z",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|TSLA|Tesla Inc|[39](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|AMD|Advanced Micro Devices Inc|[34](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|SPY|SPDR S&amp;P 500 ETF Trust|[30](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|AAPL|Apple Inc|[28](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|MSFT|Microsoft Corporation|[27](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|VOO|Vanguard S&amp;P 500 ETF|[22](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|VTI|Vanguard Index Funds - Vanguard Total Stock Market ETF|[18](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|GME|GameStop Corp|[17](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|QQQ|Invesco QQQ Trust Series 1|[14](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|CRM|salesforce.com inc|[14](https://www.memebergterminal.com/stock/salesforce.com%20inc/CRM?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/salesforce.com%20inc/CRM?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|AMZN|Amazon.com Inc|[13](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|GM|General Motors Company|[11](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|CS|Credit Suisse Group AG|[9](https://www.memebergterminal.com/stock/Credit%20Suisse%20Group%20AG/CS?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Credit%20Suisse%20Group%20AG/CS?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|NVDA|NVIDIA Corporation|[9](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|AI|C3.ai Inc|[9](https://www.memebergterminal.com/stock/C3.ai%20Inc/AI?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/C3.ai%20Inc/AI?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|CAGR|California Grapes International Inc|[6](https://www.memebergterminal.com/stock/California%20Grapes%20International%20Inc/CAGR?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/California%20Grapes%20International%20Inc/CAGR?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|MS|Morgan Stanley|[6](https://www.memebergterminal.com/stock/Morgan%20Stanley/MS?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Morgan%20Stanley/MS?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|JPM|JPMorgan Chase &amp; Co|[6](https://www.memebergterminal.com/stock/JPMorgan%20Chase%20%26%20Co/JPM?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/JPMorgan%20Chase%20%26%20Co/JPM?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|XLNX|Xilinx Inc|[6](https://www.memebergterminal.com/stock/Xilinx%20Inc/XLNX?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Xilinx%20Inc/XLNX?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|GOOG|Alphabet Inc|[6](https://www.memebergterminal.com/stock/Alphabet%20Inc/GOOG?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Alphabet%20Inc/GOOG?utm_source=rsmb-stocks&amp;utm_medium=chart)\n|FB|Facebook Inc|[5](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb-stocks&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb-stocks&amp;utm_medium=chart)",
        "subreddit": "stocks",
        "title": "I scraped r/stocks for the top ticker mentions in the last 24H. Here are the results (Monday November 01, 2021)",
        "url": "https://www.reddit.com/r/stocks/comments/qk9m1z/i_scraped_rstocks_for_the_top_ticker_mentions_in/",
        "created": 1635784502.0
    },
    {
        "author": "trickintown",
        "created_utc": 1636994831,
        "id": "qukodj",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Sub par product. His pitch is that he has ripped Salesforce off and made a cheaper CRM, has ripped Zendesk off and made a cheaper service desk ticketing. \n\nHow is it cheap? Because instead of having sales team sit in the US making $75-80k a year, he has them offshore making 12k a year. Doesn't realize the market values innovation and not cost cutting. \n\nClueless guy in the industry thinks he stands a leg against salesforce - one's playing in the MLB while he is playing elementary school softball.",
        "subreddit": "stocks",
        "title": "Is Freshworks the worst tech stock in the market?",
        "url": "https://www.reddit.com/r/stocks/comments/qukodj/is_freshworks_the_worst_tech_stock_in_the_market/",
        "created": 1637023631.0
    },
    {
        "author": "maschx",
        "created_utc": 1636732416,
        "id": "qse5cd",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Phunware is *The* Political Engagement Platform and Blockchain.\n\nI listened to a Benzinga interview with Phunware COO Randall Crowder and Board Member Ryan Costello last week, here’s an explanation of the business and its goals based on the interview, along with quotes from the two.\n\nPhunware is a mobile platform that allows constituents to engage with their politicians in a decentralized way, allowing constituents to monetize their verifiable political data on a blockchain in order to reflect these constituents’ interests, which in turn helps candidates produce more effective campaigns. Politicians are incentivized to pay for political data because it is the backbone of winning any campaign, and constituents are incentivized to engage with their politicians to have their views reflected. Phunware seeks to replace traditional political advertising particularly social media by redefining how constituents engage with their politicians. The Trump 2020 campaign was planning to outsource their data intelligence to Salesforce, but a campaign insider asserted the reality that this company was the only company that could do so. At that time they were managing all of Fox News’ mobile applications.\n\n\n—\n\n “If you want the Trump experience, we can do that right now for you…What you can do in the real world is things like rallies, events.” \n\n“Come for the meme, stay for the company.”\n\n“What Trump is trying to do is disruption. It’s dis-intermediating the middle man, and I think that’s what people in their soul just do not feel comfortable with. That’s probably the greatest threat to our democracy, is the prevention of the fair exchange of ideas.”\n\n“50% revenue guidance in Q3, 100% revenue guidance in Q4.”\n\n“At the time [we began working with Trump] we were managing all of Fox’s [News] entire mobile ecosystem. You have a company that can buy and build anything they want, and their outsourcing to Phunware.”\n\n—COO Randall Crowder\n\n—\n\n“The constant engagement with constituents and voters is the difference between winning and losing.”\n\n“There is not confidence that you get full participation on social media platforms…and the objective is frankly to push through those algorithms,”\n\n“It’s not just political candidates, it’s issue advocacy organizations and associations that highly value this type of engagement.”\n\n“Don’t try to convince a voter why you’re right, find a voter where they are.”\n\n—Board Member Ryan Costello",
        "subreddit": "pennystocks",
        "title": "$PHUN up +12% at $4.38 on mention of previous clientele: CEO highlights in live Twitter chat clients have included Fox News, the NFL, NASCAR, and the Olympic Games. So what is Phunware?…",
        "url": "https://www.reddit.com/r/pennystocks/comments/qse5cd/phun_up_12_at_438_on_mention_of_previous/",
        "created": 1636761216.0
    },
    {
        "author": "razsujemwn",
        "created_utc": 1635782641,
        "id": "qkh705",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**$XIGM goes big data play with 32.5 MIl deal and record volume**\n\nXigem Technologies (CSE:XIGM; FSE:2C1) today announced plans to acquire the assets and operations of Cylix Data Group, a business intelligence company. The Company entered into a binding letter of intent on October 29, 2021 to **purchase substantially all of the assets of Cylix (the “Business”) for aggregate consideration of $32.35 million in an arm’s-length transaction.** \n\n[www.cylixdata.com](http://www.cylixdata.com/)\n\n**Cylix** has a database holding more than 74 million data points over 25 years, it’s — as they claim — «one of the leading and most robust aggregators and originators of corporate and personal data in the Big Data market».\n\nAverage annual revenues in excess of $1.75 million and an EBITDA of over $800,000, generated primarily through its business risk profiling offering. \n\nIn operation for nearly three decades, Cylix has hundreds of blue-chip clients who regularly benefit from Cylix’s continually refreshed proprietary database.\n\n**From Xigem they get complete integration and cash 0.5 Mil investment:**\n\nCylix is expected to become a unifying engine that connects and drives other key technologies in Xigem’s portfolio. Following the planned integration with Xigem’s iAgent CRM platform and FOOi payment app, Cylix will compile comprehensive customer information to assist in allocating resources while also mitigating fraud risk in payment transactions.\n\nThe Company will appoint a nominee of Cylix to its board of directors, and will also appoint another nominee of Cylix as an observer to its board of directors.\n\nPrincipals of Cylix will maintain an active role in the business and will provide a cash investment of $500,000 into Cylix upon closing of the Transaction to fund the completion of the development of its next generation technology. \n\n**Big data market state:**\n\nThe global fraud detection and prevention market size was US$19.8 billion in 2019 and is expected to grow to US$106.7 billion by 2027, exhibiting a compound annual growth rate of 24%.\n\nAccording to Research and Markets, the global market for Big Data was estimated at US$70.5 billion in the year 2020, and is projected to reach US$243.4 billion by 2027.\n\nBut it’s not the weirdest part. The weirdest part is — Xigem (now growing in 0.17 PS area) is issuing shares for 0.5 for this transaction:\n\n«Xigem will purchase the Business for consideration of $32,350,000, to be satisfied through the issuance by the Company of 64,700,000 units at a deemed price of $0.50, with each unit comprised of one common share of the Company and one-seventh of one Common Share purchase warrant. Each Purchaser Warrant entitles the holder thereof to acquire one additional Common Share of Xigem at a price of $0.60 for a period of 24 months». \n\n**Short:** Xigem Technologies signed a LOI to buy Cylix big data company completely for 32.5 Mil. Cylix is financially OK, it’s an entry for Xigem to the growing big data market. It’s their biggest agreement by now, so the move from 0.13 to 0.17 in the first 50 minutes of trading and the 2 Mil volume (with 64k average) looks like the beginning of a good flight. At least I want to see the volume and the action when they’ll close this LOI. \n\nSource: [https://finance.yahoo.com/news/xigem-technologies-announces-binding-letter-070000687.html?guccounter=1&amp;guce\\_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce\\_referrer\\_sig=AQAAAJ37OlukdeZSbf5zNtsqfWF9RWRHLf6qRW8erv9Xp8Ctuzukpzxic8y7H3zkMT5H2NFUPt5VoU109hScIyaQrHNbCGyitvjikWS3ut2fQlrJhje6B8CpeQytgIgTe\\_yRup0KDixOYcioMcJ\\_v2D0KpdCrj2CsoZr55NNyptUlzwp](https://finance.yahoo.com/news/xigem-technologies-announces-binding-letter-070000687.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAJ37OlukdeZSbf5zNtsqfWF9RWRHLf6qRW8erv9Xp8Ctuzukpzxic8y7H3zkMT5H2NFUPt5VoU109hScIyaQrHNbCGyitvjikWS3ut2fQlrJhje6B8CpeQytgIgTe_yRup0KDixOYcioMcJ_v2D0KpdCrj2CsoZr55NNyptUlzwp)",
        "subreddit": "pennystocks",
        "title": "$XIGM goes big data play with 32.5 Mil deal and rises 37% up in the first hour - still rising",
        "url": "https://www.reddit.com/r/pennystocks/comments/qkh705/xigm_goes_big_data_play_with_325_mil_deal_and/",
        "created": 1635811441.0
    },
    {
        "author": "bopfj",
        "created_utc": 1637720471,
        "id": "r0tvj5",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " \n\nCheck out this pharmaceutical play. It has been beaten down the past few weeks after receiving an FDA approval. Here are some bullish reasons to consider investing:\n\n1. another PDUFA on 1/29/22\n2. expected to become profitable in 2022\n3. they have 2 new products coming to market in 4Q21.\n4. they are increasing their salesforce for their primary product in 4Q21\n5. Eton now has six FDA-approved products, three of which (carglumic acid, EPRONTIA®, and Rezipres®) are expected to launch in the fourth quarter of 2021. The company also has four additional products that have been submitted to the FDA and could be approved and launched in 2022.\n\nhttps://preview.redd.it/8ia85eb9eg181.png?width=2870&amp;format=png&amp;auto=webp&amp;s=bc90602a6ff7acd6c0b6ffc52f817a2577ef723c",
        "subreddit": "wallstreetbets",
        "title": "DD on $ETON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r0tvj5/dd_on_eton/",
        "created": 1637749271.0
    },
    {
        "author": "maschx",
        "created_utc": 1636734359,
        "id": "qsev1h",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "\nPhunware is *The* Engagement Platform and Blöckchain.\n\nThis mention was from a live Twitter chat today with CEO Alan Knitowski, along with this beautiful quote from him: “People shortimg us think we’re full of shit…Bring it…We’re here to financially blow you up.”\n\nAnyway, because I haven’t had the time to do a write-up on today’s interview, the following is my writeup of a a Benzinga interview with Phunware COO Randall Crowder and Board Member Ryan Costello from *last week*. It’s a written explanation of the business and its goals based on that interview, along with quotes from the two:\n\nPhunware is a mobile platform that allows people to monetize their data (whether political data for politicians or marketing data for companies) with native cryptöcurrency to engage with politicians/companies in a decentralized way, allowing users to “voluntarily opt-in” to the use of their data. This allows constituents/consumers to monetize their verifiable data on a blöckchain in order to reflect their interests to candidates/companies, and this helps them produce more connected campaigns or more satisfactory consumer goods/services. Politicians are incentivized to pay for political data because it is the backbone of winning any campaign, and constituents are incentivized to engage with their politicians to have their views reflected. Same goes for consumers and the businesses that require their revenue to survive.\n\nPhunware seeks to compete with traditional advertising—particularly social media—by redefining how constituents engage with their politicians. The Trump 2020 campaign was planning to outsource their data intelligence to Salesforce, but campaign insider Brad Parscale recognized the reality that this company was the only company that could do so. At that time they were managing all of Fox News’ mobile applications.\n\n\n—\n\n “If you want the Trump experience, we can do that right now for you…What you can do in the real world is things like rallies, events.” \n\n“Come for the meme, stay for the company.”\n\n“What Trump is trying to do is disruption. It’s dis-intermediating the middle man, and I think that’s what people in their soul just do not feel comfortable with. That’s probably the greatest threat to our democracy, is the prevention of the fair exchange of ideas.”\n\n“50% revenue guidance in Q3, 100% revenue guidance in Q4.”\n\n“At the time [we began working with Trump] we were managing all of Fox’s [News] entire mobile ecosystem. You have a company that can buy and build anything they want, and their outsourcing to Phunware.”\n\n—COO Randall Crowder\n\n—\n\n“The constant engagement with constituents and voters is the difference between winning and losing.”\n\n“There is not confidence that you get full participation on social media platforms…and the objective is frankly to push through those algorithms,”\n\n“It’s not just political candidates, it’s issue advocacy organizations and associations that highly value this type of engagement.”\n\n“Don’t try to convince a voter why you’re right, find a voter where they are.”\n\n—Board Member Ryan Costello",
        "subreddit": "stocks",
        "title": "$PHUNWARE +9% on CEO’s Twitter mention of key clientele that have included: Fox News, the NFL, NASCAR, and the Olympic Games. Why Phunware?",
        "url": "https://www.reddit.com/r/stocks/comments/qsev1h/phunware_9_on_ceos_twitter_mention_of_key/",
        "created": 1636763159.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638007910,
        "id": "r3an6a",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts?\n\n[app.fincredible.ai](https://preview.redd.it/0r8tgawt44281.png?width=851&amp;format=png&amp;auto=webp&amp;s=c24ab498e22f5a6b5ba49c1617d2be36b6870976)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "smallstreetbets",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r3an6a/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638036710.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638007902,
        "id": "r3an3s",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts?\n\n[app.fincredible.ai](https://preview.redd.it/k49v7ugt44281.png?width=851&amp;format=png&amp;auto=webp&amp;s=bdf09331afd114a1f0b46c768a7ef99cf2f3e0e8)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "StockMarket",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/r3an3s/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638036702.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638009235,
        "id": "r3ay84",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts after these few weeks?\n\n[app.fincredible.ai](https://preview.redd.it/nosgbfdu84281.png?width=851&amp;format=png&amp;auto=webp&amp;s=914986bcd1069b216782f8149138f2f28bcfa71d)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "CanadianInvestor",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/r3ay84/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638038035.0
    },
    {
        "author": "footash",
        "created_utc": 1637620091,
        "id": "qzxqpd",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n\nThree of the world’s four largest sector-based exchange-traded funds (ETFs) face a shake-up due to proposed changes in their composition that would reclassify major companies in information technology indexes as financial or industrial.\n\nS&amp;P Dow Jones Indices LLC and MSCI Inc. have launched a consultation on a potential revamp of the widely followed global industry classification standards (GICS) that determine in which sector each company is placed.\n\nThis debate could have meaningful consequences, with the weighting of banks in the US$45.7-billion Financial Select Sector SPDR Fund [XLF-A](https://www.theglobeandmail.com/investing/markets/stocks/XLF-A/), as well as other ETFs, such as US$11.6-billion Vanguard Financials ETF [VFH-A](https://www.theglobeandmail.com/investing/markets/stocks/VFH-A/), falling below one-third, from a peak of 45.4 per cent in 2013 according to S&amp;P data, if the proposed changes come into force.\n\nHowever, the US$49-billion Technology Select Sector SPDR Fund [XLK-A](https://www.theglobeandmail.com/investing/markets/stocks/XLK-A/), the world’s largest sector ETF, according to data from TrackInsight SAS, and the US$48.2-billion Vanguard Information Technology Index ETF [VGT-A](https://www.theglobeandmail.com/investing/markets/stocks/VGT-A/) would become both more cyclical – prone to rise and fall in line with the economy – and more concentrated as the sector is stripped of several stocks, including three of its eight largest.\n\n“Some of the largest information technology companies in the S&amp;P 500 Index could be changing sectors,” says Todd Rosenbluth, head of ETF and mutual fund research at CFRA Research.\n\n“At least seven of its large-cap company sector constituents are potentially moving to a new sector,” Mr. Rosenbluth adds, with the knock-on effect that “banks would no longer dominate broad financial ETFs.”\n\nMSCI and S&amp;P are proposing that “transaction and payment processing companies” are switched from the information technology sector of the GICS framework to the financial sector.\n\nThis would impact companies such as Visa Inc. [V-N](https://www.theglobeandmail.com/investing/markets/stocks/V-N/), Mastercard Inc. [MA-N](https://www.theglobeandmail.com/investing/markets/stocks/MA-N/) and PayPal Holdings Inc. [PYPL-Q](https://www.theglobeandmail.com/investing/markets/stocks/PYPL-Q/), which have a combined market capitalization of more than US$1-trillion and are, respectively, the fourth-, sixth- and eighth-largest stocks in the IT sector.\n\nThe technology category would be further denuded by being stripped of its data-processing and outsourced services, and payroll processing subindustry groupings, which would be switched to the industrial sector under the proposals. This would impact companies such as Fidelity National Information Services Inc. [FIS-N](https://www.theglobeandmail.com/investing/markets/stocks/FIS-N/), Broadridge Financial Solutions Inc. [BR-N](https://www.theglobeandmail.com/investing/markets/stocks/BR-N/), and Automatic Data Processing Inc. [AFP-Q](https://www.theglobeandmail.com/investing/markets/stocks/ADP-Q/).\n\nThe proposed changes would result in heightened concentration in the technology sector, coming as they do on top of a 2018 reshuffle that saw Facebook Inc., now known as Meta Platforms Inc. [FB-Q](https://www.theglobeandmail.com/investing/markets/stocks/FB-Q/), Twitter Inc. [TWTR-N](https://www.theglobeandmail.com/investing/markets/stocks/TWTR-N/), Snap Inc. [SNAP-N](https://www.theglobeandmail.com/investing/markets/stocks/SNAP-N/) and Alphabet Inc. [GOOGL-Q](https://www.theglobeandmail.com/investing/markets/stocks/GOOGL-Q/), the parent of Google, transferred to communications services.\n\nMicrosoft Corp. [MSFT-Q](https://www.theglobeandmail.com/investing/markets/stocks/MSFT-Q/) and Apple Inc. [AAPL-Q](https://www.theglobeandmail.com/investing/markets/stocks/AAPL-Q/) already account for a combined 44.7 per cent of the S&amp;P 500 Information Technology index, even before the latest proposals.\n\nHowever, Matthew Bartolini, head of SPDR Americas research at State Street Global Advisors, says ETFs such as his firm’s Technology Select Sector SPDR Fund would be unlikely to increase their exposure to Microsoft and Apple much further.\n\nUnder the rules of the Technology Select Sector Index, tracked by Technology Select Sector SPDR Fund, an individual company’s weight is capped at 23 per cent, while the sum of stocks with weights greater than 4.8 per cent cannot exceed 50 per cent of the index.\n\nThese rules mean the weighting of the two giants, as well as Nvidia Corp. [NVDA-Q](https://www.theglobeandmail.com/investing/markets/stocks/NVDA-Q/), the third-largest stock in the sector, effectively cannot rise any further, meaning that the weighting of the next ranked companies, such as Adobe Systems Inc. [ADBE-Q](https://www.theglobeandmail.com/investing/markets/stocks/ADBE-Q/), Salesforce.com Inc. [CRM-N](https://www.theglobeandmail.com/investing/markets/stocks/CRM-N/) and Cisco Systems Inc. [CSCO-Q](https://www.theglobeandmail.com/investing/markets/stocks/CSCO-Q/), will need to be bumped up artificially to take the slack.\n\nMr. Bartolini says this is unlikely to significantly affect the Technology Select Sector SPDR Fund’s performance, though.\n\n“What we see currently in funds is some difference relative to the S&amp;P 500 \\[IT index\\] itself because of the capping. We have to overweight some smaller names, but historically these weighting differences haven’t had a significant impact on the fund because we are still diversified within the sector itself. The movement of the sector will drive the sector’s return,” Mr. Bartolini says.\n\nThe proposed changes would be likely to increase the level of risk in technology funds such as the Technology Select Sector SPDR Fund. Visa, Mastercard and PayPal have five-year betas of between 1.1 and 0.92, according to S&amp;P Capital IQ, meaning they broadly tend to rise and fall in line with the wider market. Most other tech stocks have higher betas than that, meaning they tend to be more volatile.\n\nThe switch, assuming it happens, may also have a downward impact on the valuation of the likes of Mastercard. While there’s no logical reason for a company to be rated more lowly simply because it has changed sector – it is still the same business – a company that has been transferred will now be measured against a different peer group.\n\nFinancial Select Sector SPDR Fund, the financial sector ETF, trades on a price-to-book ratio of just 1.7 and a price-to-earnings ratio of 13.8, compared to 11.5 and 28.6, respectively, for Technology Select Sector SPDR Fund.\n\n“There is likely to be some market impact because these companies are being judged against a different peer group,” Mr. Rosenbluth says.\n\nBased on current valuations, Visa, Mastercard and PayPal would be among the five-largest constituents of the financial sector, alongside JPMorgan Chase &amp; Co. [JPM-M-N](https://www.theglobeandmail.com/investing/markets/stocks/JPM-M-N/) and Bank of America Corp. [BAC-N](https://www.theglobeandmail.com/investing/markets/stocks/BAC-N/).\n\nThey would be likely to damp volatility in the sector, given that the larger banks typically have betas of about 1.5.\n\n“It’s rare to think of tech as low risk but does this reduce the risk profile of the financial sector? I think it does,” Mr. Rosenbluth says. The trio of newcomers were likely to have stronger growth prospects than banks and insurers, he adds, but be more expensive, while rendering the financial sector less interest rate sensitive.\n\nAs a consequence, the weighting of the banking industry within the financial sector would fall from 39 per cent to 31 per cent, on current valuations.\n\nMSCI and S&amp;P are currently consulting on the proposals, with a decision due in February.",
        "subreddit": "CanadianInvestor",
        "title": "Major sector ETFs face risk of large tech companies being reclassified - V/MA/PYPL could be moved from IT to Financial sector. https://www.theglobeandmail.com/investing/globe-advisor/advisor-etfs/article-major-sector-etfs-face-risk-of-large-tech-companies-being-reclassified/",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qzxqpd/major_sector_etfs_face_risk_of_large_tech/",
        "created": 1637648891.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1637961097,
        "id": "r2www1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Good Friday afternoon to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 29th, 2021.\n\n# **Covid developments to rule the market once again in the week ahead after Friday’s rout - [(Source)](https://www.cnbc.com/2021/11/26/covid-developments-to-rule-the-market-once-again-in-the-week-ahead-after-fridays-rout.html)**\n*****\n&gt; Uncertainty about a new emerging coronavirus strain could continue to spook markets, just as Friday’s employment report and other data in the week ahead show the economy has been getting stronger.\n*****\n&gt; Stocks and other risk assets were slammed in the post-Thanksgiving session Friday on reports of a new variant in South Africa, and investors sought safety in Treasurys. Initial reports on the variant show it could be more transmissible than the Delta variant, and scientists are studying how effective vaccines are against it.\n*****\n&gt; The Dow was down 905 points, or 2.5% Friday in its worse day since October, 2020. The S&amp;P 500 tumbled 2.3% Friday to 4,594, giving it a 2.2% decline for the week.\n*****\n&gt; “I think that’s going to override what else we’re going to see,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “It’s a heavy data week with the ISMs and certainly payrolls, but I think this new variant is going to freeze behavior until there’s more clarity.”\n*****\n&gt; According to Dow Jones, economists expect a strong payroll report Friday, with 581,000 jobs added, after October’s 531,000 payrolls. They expect the economy has shaken off the effects of the slowdown linked to the Covid delta variant, and growth in the current quarter could be far stronger than the third quarter.\n*****\n&gt; The Institute of Supply Management manufacturing survey is released Wednesday, and that should also be strong.\n*****\n&gt; Scott Redler, partner with T3Live.com, said many traders were caught off sides in the shortened session Friday, usually a positive one for the market, and there are key levels the market must hold in the week ahead in order to stage a yearend Santa rally.\n*****\n&gt; “Right now, the market lost some momentum, but it’s not broken. It could be just fine and refuel if the 50-day moving average on the S&amp;P 500 holds next week. It’s all very fluid,” he said.\n*****\n&gt; The 50-day, at 4,527, is a widely-watched momentum indicator, and it is basically the average close of the last 50 sessions.\n*****\n&gt; The market had already been losing momentum this past Monday with a bearish reversal, he said.\n*****\n&gt; “On Wednesday, the market absorbed the weakness and gave traders a false sense of security which is normally a nice easy holiday-shortened session Friday,” Redler said.\n*****\n&gt; Sam Stovall, chief investment strategist at CFRA, said the S&amp;P 500 typically gains 7% between its October low and year-end close, but this year it had already gained more than 9%.\n*****\n&gt; “We’re ahead of the game and due for some sort of digestion,” Stovall said on CNBC.\n*****\n&gt; The Dow dipped more than 1,000 points during Friday trading. Riskier assets were down even more, with the Russell 2000 closing off 3.7% Friday. West Texas Intermediate oil futures plunged more than 12%, and bitcoin was down nearly 8%. Some investors began to reverse bets in the futures market that a strong economic rebound and inflationary pressures would pull the Fed off the sidelines sooner-than-expected.\n*****\n&gt; The 10-year Treasury yield, which moves opposite price, fell to 1.48% from Wednesday’s high of 1.69%.\n*****\n&gt; Investors will be looking for guidance from Fed Chairman Jerome Powell, who appears before Congress in the week ahead with Treasury Secretary Janet Yellen to discuss the coronavirus and the CARES Act stimulus package. On Tuesday, there is a hearing before the Senate Banking Committee.\n*****\n&gt; “I think you have to assume the base case is the virus remains endemic, not back to being a pandemic,” said Barry Knapp, founder of Ironsides Macroeconomics. The worry is that the variant spreads and slows activity, hitting supply chains even more. That could boost inflation while slowing growth.\n*****\n&gt; Knapp said there are risks for stocks, and investors need to be cautious buying the market on the decline.\n*****\n&gt; Knapp said the Fed could end up accelerating the taper of its bond purchases, which would move forward the time frame for potential interest rate hikes.\n*****\n&gt; “The problem with trying to buy the market overall and buying tech stocks in particular is if you buy now because it is down a couple of percent, it rallies into the end of the year and then the market sells off,” he said. For that reason, he favors dipping into cheaper sectors like energy and financials, the worst performing sectors Friday.\n*****\n&gt; Oil and energy will be in the spotlight in the coming week, as OPEC+ meets Thursday. The U.S. and other governments agreed to release oil from their strategic petroleum reserves in an attempt to drive prices lower. The U.S. plans to release 50 million barrels.\n*****\n&gt; OPEC+ has said it would continue to increase production by 400,000 barrels monthly, despite calls from the White House to speed up the release.\n*****\n&gt; Helima Croft, head of global commodities strategy at RBC, said on CNBC there is a chance OPEC could decide to pause its own production increase because of the SPR releases.\n*****\n&gt; “I think as we head into the OPEC meeting Thursday, the question is not only do they do a pause but potentially will they actually pull back some barrels because of concerns about this new variant alongside the very large SPR release,” she said.\n*****\n&gt; She said the U.S. is releasing a record amount of oil. “We are going to have a lot of barrels hitting this market, as we have these concerns about new Covid lockdown restrictions,” she said. “Again, too soon to say whether governments will pull the trigger on such measures, but the market will be concerned.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/ISOlH6m.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ddHELXX.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/2Qq5aaa.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/Jml9Z5I.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pZuwqcf.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/zz3mXj8.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RIguq8O.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eQQE2zm.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pX1v49l.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/QA0QmDF.png))**\n\n*****\n\n&gt; # When Stocks Are Up Big YTD Before Thanksgiving\n\n&gt; As the S&amp;P 500 is up rather impressively, 24.9% year-to-date this year through today’s close on the Tuesday before Thanksgiving, we ran the numbers on the 33 previous years with double digit year-to-date gains at this juncture since 1950. There are a few blemishes, but in general market gains continued into yearend.\n\n&gt; Most importantly, there are no major selloffs on this list. The big December decline of -9.2% in 2018 came after the S&amp;P 500 was down -1.2% at this point in the year. After double-digit YTD gains the S&amp;P 500 was up 70% of the time from the Tuesday before Thanksgiving to yearend for an average gain of 2.3%.\n\n&gt; Also of note is that the Santa Claus Rally suffered only four losses in these years. But these four down SCRs in 1955, 1968, 1999 and 2014 were followed by flat years in 1956 and 2015 and down years in 1969 and 2000. As Yale’s famous line states (2021 Almanac page 116 and 2022 Almanac page 118): “If Santa Claus Should Fail To Call, Bears May Come to Broad and Wall.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/2bbdc6f36627e690a68da0b174749618/6328b31e9c88f708-62/s500x750/f9d585fa7d441cb8e0ed7dfe493904d6b68a23ae.jpg))**\n\n*****\n\n&gt; # How Have Stocks Done Under Jerome Powell?\n\n&gt; The big news this week was Jerome Powell will remain in charge of the Federal Reserve (Fed) for four more years, so we wanted to do a quick blog that looked at how stocks have done while he has been the Fed Chairman.\n\n&gt; “There are many reasons for Jerome Powell to lead the Fed for another four years,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But one of the best could very well be that stocks have done quite well under his leadership. Do you really think he’d still be in charge if stocks did poorly under him? Probably not is the answer there.”\n\n&gt; As shown in the LPL Chart of the Day, the Dow has gained 40% under his leadership, ranking him 8th (near the middle of the pack) when compared with all 16 Fed Chairpersons. Interestingly, he ranks just beneath both of his predecessors in Ben Bernanke and Janet Yellen. With four more years to go, you’d have to like his chances there, but Alan Greenspan’s record of 312% is likely safe for the time being.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.24.21.png?ssl=1))**\n\n&gt; Here are some more Fed Chair fun facts (using the chart below).\n\n&gt; * On an annualized basis, the Dow has gained 9.3% per annum under Powell, the 7th best out of 16.\n&gt; * Interestingly, stocks have dropped under only one Fed Chairperson and that was Eugene Meyer during the Great Depression.\n&gt; * Taking another look at Greenspan’s 312% return and we realize he was in charge of the Fed for 18.5 years. So his annual return of 8.0% puts things in perspective.\n&gt; * The shortest tenure ever was less than a year and a half back in the late 1970s under William Miller. Meanwhile, the longest ever was William Martin at nearly 19 years.\n&gt; * Paul Volker had the best annualized return at 15.2% over his 8 years. Not to mention he handed things over to Greenspan right before the 1987 crash, one of the best handoffs we’ve ever seen in history.\n&gt; * Lastly, the Fed has been led by a woman only once and that was Janet Yellen, now in charge of the Treasury. It is worth noting that her four-year run at the Fed produced a very impressive 12.9% annualized return for stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.24.21.png?ssl=1))**\n\n*****\n\n&gt; # Finally Some Clarity on Fed Leadership\n\n&gt; President Biden officially nominated Chairman Jerome Powell to a second four-year term as Chairman of the Federal Reserve (Fed) and elevated current Fed Governor Lael Brainard to Vice Chair of the Committee. Before the announcement, there was speculation that Brainard could replace Powell as Fed Chair.\n\n&gt; We view these nominations as very market friendly. Powell has done a commendable job supporting markets during the COVID-19 shutdowns and we aren’t quite through with the pandemic. We believe stability and leadership continuity is important as we continue to make our way toward the finish line of the COVID-19 pandemic. While Brainard is well qualified to run the Fed, elevating her to Vice Chair recognizes her contributions and potentially puts her in a position to take over the Chair role in four years. Both positions require Congressional approval, and we think both should be confirmed when Congressional hearings conclude sometime over the next few months.\n\n&gt; “As we expected, President Biden chose continuity and familiarity with these Fed appointments,” noted LPL Financial Fixed Income Strategist Lawrence Gillum. “Going with Powell over Brainard is what markets were expecting, so we think markets are relieved that Fed leadership uncertainty is now out of the way.”\n\n&gt; The knee-jerk reaction in the bond market was interesting in that markets seemingly continue to shift the prospects for interest rate hikes forward. As seen on the LPL Research Chart of the Day, Treasury securities across all maturities sold off with two-year tenors among the most (negatively) impacted. Now, two-year Treasury yields are at the highest level since the pandemic began. Short maturity securities are the most impacted by changes in monetary policy. Moreover, markets are pricing in nearly three rate hikes next year with the first rate hike expected in June, which is much more aggressive than the Fed has indicated.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/11.23.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; President Biden still has three open Fed Board of Governor positions to fill, so we’re a long way from knowing for sure how Fed policy may change over the next few years. However, we would expect Biden to select governors on the dovish side of the spectrum. That said, the 2022 voting rotation with regional Fed Presidents may impart a hawkish lean to the FOMC overall, offsetting some of the dovish bias from Biden’s appointments. The rotation replaces three solidly dovish and one strongly hawkish voting members with two strongly hawkish and two solidly hawkish officials. Monetary policy is managed at the national level, so while the regional presidents will no doubt have influence, we continue to think the Fed will be more accommodative than markets are currently expecting. In addition, with the announcements today, leadership at the top of the Fed should be seen as being supportive to the economy and thus supportive for markets.\n\n*****\n\n&gt; # Pandemic and Multi-Decade Low for Claims\n\n&gt; Out of the massive slug of economic data this morning, one major bright spot was jobless claims. It has now been 88 weeks since the March 13, 2020 release; the last one before claims began to print in the millions. In that time, claims have fallen to not only take out pre-pandemic levels and the low prior to that of 203K set in April 2019 but today saw the first sub-200K reading since November 20, 1969. That compares to estimates of a reading of 260K and last week's 2K upward revised number of 270K. On a side note, in 2019 there were three weeks where the initial release of initial claims came in below 200K (1/24, 4/11, and 4/18), but they have been since revised higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-SA.png))**\n\n&gt; While that is a significant low in claims, the drop appears to a large degree to be thanks to seasonal adjustment. On a non-seasonally adjusted basis, claims rose to 258.6K which was the highest level in six weeks. It is seasonally normal for claims to head higher during the current week of the year with it having happened over 80% of the time historically. Additionally, that is a bit of catch-up considering claims have been bucking seasonal trends in recent weeks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-Seasonal.png))**\n\n&gt; Continuing claims were also lower this week falling from 2.109 million to 2.049 million. As with initial jobless claims, that sets a new low for the pandemic that is 265K above the level from March 13, 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Con-Claims-SA.png))**\n\n&gt; Factoring in all other programs creates an additional week of lag to the data meaning the most recent print is through the first week of November. The final week of October's unusual uptick on account of peculiar growth in claims for expired programs has unwound in the most recent week's data. PUA claims were more than cut in half as PEUC claims also fell by 121K. Combined that resulted in a new low of 2.44 million claims.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-NSA.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 26th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.28.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$CRM $ASAN $CRWD $SNOW $AI $OKTA $SPLK $DOCU $SNEX $JKS $MOMO $CHS $WDH $UCL $RDHL $ZS $AMBA $BOX $NTAP $HPE $BBW $RY $DCI $VEEV $DG $EXPR $SIG $VERU $LE $MRVL $ULTA $SWBI**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/eQQE2zm.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EDL3xa4.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/OkxZbaZ.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.29.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XWYrfnw.png))\n\n&gt; # ***Monday 11.29.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/E6rgE4M.png))\n\n*****\n\n&gt; # ***Tuesday  11.30.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jqz0nFS.png))\n\n&gt; # ***Tuesday 11.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oFuzxf4.png))\n\n*****\n\n&gt; # ***Wednesday 12.1.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EUMKcBz.png))\n\n&gt; # ***Wednesday 12.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7VZJksg.png))\n\n*****\n\n&gt; # ***Thursday 12.2.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/N3mMigQ.png))\n\n&gt; # ***Thursday 12.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4ob72Tx.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/5E0Yzkt.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket. :)",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/r2www1/wall_street_week_ahead_for_the_trading_week/",
        "created": 1637989897.0
    },
    {
        "author": "2WorksForYou",
        "created_utc": 1637101726,
        "id": "qvjyiu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\n*here is a detailed breakdown of the most notable position changes among marquee hedge funds:*\n\nAPPALOOSA\n\n* Top new buys: ALIT, WMT, OVV\n* Top exits: EMR, NFLX, BP, RDS/A, RDS/B\n* Boosted stakes in: M, GT, EQT, AR, GOOG, XOP, OXY, KSS, DHI, PHM\n* Cut stakes in: MU, AMZN, BABA, PCG, FB, ET, TWTR, UBER, FCX, XLE\n\nBAUPOST GROUP\n\n* Top new buys: DBX, JOBY, LFG, OB\n* Top exits: AUR, CZOO\n* Boosted stakes in: SSNC, VRNT, TBPH\n* Cut stakes in: EBAY, PCG, WLTW, QRVO, INTC, IFF, PSTH\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: RPRX, FND\n* Top exits: MRK, LBTYK, OGN\n* Boosted stakes in: CVX\n* Cut stakes in: ABBV, CHTR, BMY, V, MA, MMC, USB\n\nCOATUE MANAGEMENT\n\n* Top new buys: MSFT, BLND, AFRM, BEKE, NTLA, ABSI, HOOD, TOST, CRBU, SUNL\n* Top exits: DDOG, CHPT, ROOT, AI, LMND, SKLZ, LAZR, COIN, MVIS, SOFI\n* Boosted stakes in: BZ, MQ, JD, CFLT, DDL, SNAP, GH, CVAC, LI, RBLX\n* Cut stakes in: AMZN, NUAN, RUN, SQ, PYPL, TSLA, SHOP, PTON, Z, FB\n\nCORVEX MANAGEMENT\n\n* Top new buys: FIVN, UBER, USFD, SMFR, SLGC, SKYA, SRAD, APO\n* Top exits: DOMA, TWND, HZON, ROVR, CZOO, LIDR, XME, LGV\n* Boosted stakes in: ZNGA, CRM, MSFT, JPM, FB, DIS, CCEP\n* Cut stakes in: ATUS, EXC, TMUS, BLMN, AMZN, GOOGL\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: HOOD, WRBY, TXRH, NFLX, OPEN, PH, TPX, MASI, NTES, SGHT\n* Top exits: BKNG, U, CMG, DECK, TUYA, BHG, LTCH, BZ, FUTU, WDH\n* Boosted stakes in: EXPE, STNE, TMUS, DIS, BBWI, BLL, FTV, PTON, PODD, PINS\n* Cut stakes in: AMZN, FB, SNOW, EW, MSFT, CVNA, PCOR, DHR, CRWD, SQSP\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: CPNG, LYV, ZM, PRCT, OSCR, STNE, ABCL, FSLY, LAD, CFLT\n* Top exits: NFLX, CMI, GE, MA, V, USFD, CAT, GM, ON, BLDR\n* Boosted stakes in: GOOGL, EXPE, BKNG, DISH, OPCH, FTCH, COUP, AMZN, RETA\n* Cut stakes in: MSFT, TMUS, CVNA, PLTR, TECK, FB, FCX, INTU, PENN, SMAR\n\nELLIOTT INVESTMENT MANAGEMENT\n\n* Top new buys: SC, CTXS, HTA, VAL, APA, 1865300D\n* Top exits: EDR, SNAP, DBX, PINS, TTD, HRB\n* Cut stakes in: ARNC, FYBR, ETWO, BTU\n\nGREENLIGHT CAPITAL\n\n* Top new buys: SLV, FREY, SNAX\n* Top exits: SPY, JOBY, SNX, OPAD, DNA, CCCS, APG, IONQ, XOS, UWMC\n* Boosted stakes in: TECK, ODP, BHF, LIVN, MYPS, SONO, GLD, CPRI, JACK, CHNG\n* Cut stakes in: CNXC, CC, REZI, FUBO, SATS, AER, EXPE, ADMP, AGCB, GPOR\n\nICAHN\n\n* Top new buys: SWX\n* Boosted stakes in: DAN, IEP\n* Cut stakes in: OXY\n\nJANA PARTNERS\n\n* Top new buys: M, VVV, BKSY\n* Boosted stakes in: THS, VG, CONE\n* Cut stakes in: SPY, LH, EHC\n\nLANSDOWNE\n\n* Top new buys: WRK, FSLR, CTRA, CF, AGI, CCJ\n* Top exits: LRCX, MU, AER, UAL, LUV, ENIA, TMUS, RBLX, SSO, UVXY\n* Boosted stakes in: NVT, ILMN, GE, TSM, ADI, BKNG, IEUR\n* Cut stakes in: FCX, CARR, ETN, VMC, AMAT, DAL, RYAAY, EGO, OTIS, WMG\n\nMAVERICK CAPITAL\n\n* Top new buys: INST, CRBU, EHTH, SPIR, STZ, CCL, AAP, SHW, OLPX, PZZA\n* Top exits: BABA, AON, BECN, CZOO, TSM, HIMS, DGNS, SBUX, XMTR, KVSA\n* Boosted stakes in: V, WDAY, SE, ATVI, CRIS, LRCX, RCKT, NFLX, TWLO, DECK\n* Cut stakes in: CPNG, FB, LIVN, ALNY, ADSK, FLT, IFF, GOOG, CCK, MELI\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: AFRM, MAR, SQ, MCD, ASML, VSCO, WMG, CRL, BURL, OLPX\n* Top exits: V, JD, PYPL, LVS, ADSK, CRWD, NTES, TGT, UBER, SHOP\n* Boosted stakes in: SNAP, BILL, MA, BBWI, LYV, HLT, FB, DT, EFX, DDOG\n* Cut stakes in: AMZN, EXPE, FICO, GOOGL, ALGN, ATVI, USFD, VMEO, VAC, IAA\n\nOMEGA ADVISORS\n\n* Top new buys: LVS\n* Top exits: FOE, CS, PNTM, CRBN, JWSM, ANAC, APSG\n* Boosted stakes in: CTRA, BHC, PFSI, WSC, GM, DMAC, VRT, SRGA, FLMN, ASPU\n* Cut stakes in: NAVI, MP, OCN, BBDC, TRN, FCRD, ABR\n\nSOROBAN CAPITAL\n\n* Top new buys: RKLB, ALCC, LICY, CPAR, POND\n* Top exits: ATUS, DOMA, SPIR, ATIP, VYGG, ME, PAYO, SUNL, BGRY, TALK\n* Boosted stakes in: UNP, PLNT, WAB, MA, CSX, LOW, FB, V, KIND, ML\n* Cut stakes in: ADI, AMZN, MSFT, NFLX\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: HRC, JPM, UNH, CPNG, EQT, XLE, GS, HYZN, MTB, INTU\n* Top exits: OTIS, QS, CLVT, IFF, W, UPST, AXTA, TXN, S, NXPI\n* Boosted stakes in: INFO, NUAN, PPD, ARMK, CRM, ACN, GM, SYF, BKNG, VICI\n* Cut stakes in: FIGS, QQQ, ATVI, MGLN, ELAN, AMZN, DIS, LBRDK, GOOGL, XLU\n\nSTARBOARD VALUE \n\n* Top new buys: HUN, CYXT, BRDS, ENFA, VPCC, TREB, DKDCA, BTTX, HCIC, CPAR\n* Top exits: IWN, KVSC, ROIV, STRC, OPAD, LILM, RBOT, SPIR, ROVR, GDEV\n* Boosted stakes in: IWM, AUS, MTAC, KVSB, LNFA, FVT, TWND, PLMI, PRPB, ACAH\n* Cut stakes in: MD, BOX, CTVA, IWR, ELAN, PZZA, ACM, MMSI, ON\n\nTEMASEK HOLDINGS\n\n* Top new buys: ETWO, USIG, ONEM, BLND, POSH, DUOL, IRNT, HLTH, PATH, MNDY\n* Top exits: CTVA, SOFI, COPX, PICK, KREF, BIDU, TAL, BZ, EDU, MSFT\n* Boosted stakes in: GOVT, SCHP, GRCL, BGNE, SNOW, IAU, XME, FIXX, EWY, AFRM\n* Cut stakes in: BABA, INFO, RBLX, DIDI, ABNB, MA, DCT, NTLA, LCTU, CRM\n\nTIGER GLOBAL\n\n* Top new buys: WRBY, HOOD, BLND, VTEX, MTTR, SPIR, TOST, BKSY, AVPT, ALCC\n* Top exits: TAL\n* Boosted stakes in: SNOW, SE, DASH, DDOG, OZON, WDAY, XM, SQ, OSCR, ONTF\n* Cut stakes in: RBLX, APO, PTON, JD, SPOT, YSG, UBER, CVNA, INTU, DESP",
        "subreddit": "wallstreetbets",
        "title": "new meta",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qvjyiu/new_meta/",
        "created": 1637130526.0
    },
    {
        "author": "bopfj",
        "created_utc": 1637720183,
        "id": "r0ts1h",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\nCheck out this pharmaceutical play. It has been beaten down the past few weeks after receiving an FDA approval. Here are some bullish reasons to consider investing:\n\n1. another PDUFA on 1/29/22\n2. expected to become profitable in 2022\n3. they have 2 new products coming to market in 4Q21.\n4. they are increasing their salesforce for their primary product in 4Q21\n5. Eton now has six FDA-approved products, three of which (carglumic acid, EPRONTIA®, and Rezipres®) are expected to launch in the fourth quarter of 2021. The company also has four additional products that have been submitted to the FDA and could be approved and launched in 2022.",
        "subreddit": "wallstreetbets",
        "title": "DD on $ETON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r0ts1h/dd_on_eton/",
        "created": 1637748983.0
    },
    {
        "author": "TheThinkingReed",
        "created_utc": 1636117828,
        "id": "qnaskr",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "RKT (Rocket Companies) surprise earnings beat. Highest purchase mortgage volume ever for the company. On fire 🔥 housing market projected to continue. New partnership with Salesforce to expand there reach into 10,000 banks and credit unions. Jay on fox this morning.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnaskr/rkt_rocket_companies_surprise_earnings_beat/",
        "created": 1636146628.0
    },
    {
        "author": "maschx",
        "created_utc": 1636734422,
        "id": "qsevus",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Phunware is *The* Engagement Platform and Blockchain.\n\nThis mention was from a live Twitter chat today with CEO Alan Knitowski, along with this beautiful quote from him: “People shortimg us think we’re full of shit…Bring it…We’re here to financially blow you up.” Yesterday they reported positive earnings for the first time since 2018.\n\nAnyway, because I haven’t had the time to do a write-up on today’s interview, the following is my writeup of a a Benzinga interview with Phunware COO Randall Crowder and Board Member Ryan Costello from *last week*. It’s a written explanation of the business and its goals based on that interview, along with quotes from the two:\n\nPhunware is a mobile platform that allows people to monetize their data (whether political data for politicians or marketing data for companies) with native cryptocurrency to engage with politicians/companies in a decentralized way, allowing users to “voluntarily opt-in” to the use of their data. This allows constituents/consumers to monetize their verifiable data on a blockchain in order to reflect their interests to candidates/companies, and this helps them produce more connected campaigns or more satisfactory consumer goods/services. Politicians are incentivized to pay for political data because it is the backbone of winning any campaign, and constituents are incentivized to engage with their politicians to have their views reflected. Same goes for consumers and the businesses that require their revenue to survive.\n\nPhunware seeks to compete with traditional advertising—particularly social media—by redefining how constituents engage with their politicians. The Trump 2020 campaign was planning to outsource their data intelligence to Salesforce, but campaign insider Brad Parscale recognized the reality that this company was the only company that could do so. At that time they were managing all of Fox News’ mobile applications.\n\n\n—\n\n “If you want the Trump experience, we can do that right now for you…What you can do in the real world is things like rallies, events.” \n\n“Come for the meme, stay for the company.”\n\n“What Trump is trying to do is disruption. It’s dis-intermediating the middle man, and I think that’s what people in their soul just do not feel comfortable with. That’s probably the greatest threat to our democracy, is the prevention of the fair exchange of ideas.”\n\n“50% revenue guidance in Q3, 100% revenue guidance in Q4.”\n\n“At the time [we began working with Trump] we were managing all of Fox’s [News] entire mobile ecosystem. You have a company that can buy and build anything they want, and their outsourcing to Phunware.”\n\n—COO Randall Crowder\n\n—\n\n“The constant engagement with constituents and voters is the difference between winning and losing.”\n\n“There is not confidence that you get full participation on social media platforms…and the objective is frankly to push through those algorithms,”\n\n“It’s not just political candidates, it’s issue advocacy organizations and associations that highly value this type of engagement.”\n\n“Don’t try to convince a voter why you’re right, find a voter where they are.”\n\n—Board Member Ryan Costello",
        "subreddit": "smallstreetbets",
        "title": "$PHUN up +12% on discussion of key previous clientele. CEO highlights in live Twitter chat that clients have included: Fox News, the NFL, NASCAR, and the Olympic Games. So what is Phunware?…",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qsevus/phun_up_12_on_discussion_of_key_previous/",
        "created": 1636763222.0
    },
    {
        "author": "bopfj",
        "created_utc": 1637713437,
        "id": "r0ris6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Check out this pharmaceutical play.\nIt has been beaten down the past few weeks after FDA approval. Here are the positives:\n\n1) another PDUFA on 1/29/22\n2) expected to become profitable in 2022\n3) they have 2 new products coming to market 4Q21\n4) they are increasing their salesforce for their primary product in 4Q21\n5) Eton now has six FDA-approved products, three of which (carglumic acid, EPRONTIA®, and Rezipres®) are expected to launch in the fourth quarter of 2021. The company also has four additional products that have been submitted to the FDA and could be approved and launched in 2022.",
        "subreddit": "wallstreetbets",
        "title": "$ETON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r0ris6/eton/",
        "created": 1637742237.0
    },
    {
        "author": "TheThinkingReed",
        "created_utc": 1636117635,
        "id": "qnaqbs",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "RKT (Rocket Companies) surprise earnings beat. Highest purchase mortgage volume ever for the company. On fire 🔥 housing market projected to continue. New partnership with Salesforce to expand there reach into 10,000 banks and credit unions. Jay on fox this morning.",
        "url": "https://i.redd.it/emqfg1t70sx71.jpg",
        "created": 1636146435.0
    },
    {
        "author": "Mdiddy7",
        "created_utc": 1637001099,
        "id": "qun0ng",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Investor Relations Database/CRM/Software",
        "url": "https://www.reddit.com/r/investing/comments/qun0ng/investor_relations_databasecrmsoftware/",
        "created": 1637029899.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1637961152,
        "id": "r2wxjc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Friday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 29th, 2021.\n\n# **Covid developments to rule the market once again in the week ahead after Friday’s rout - [(Source)](https://www.cnbc.com/2021/11/26/covid-developments-to-rule-the-market-once-again-in-the-week-ahead-after-fridays-rout.html)**\n*****\n&gt; Uncertainty about a new emerging coronavirus strain could continue to spook markets, just as Friday’s employment report and other data in the week ahead show the economy has been getting stronger.\n*****\n&gt; Stocks and other risk assets were slammed in the post-Thanksgiving session Friday on reports of a new variant in South Africa, and investors sought safety in Treasurys. Initial reports on the variant show it could be more transmissible than the Delta variant, and scientists are studying how effective vaccines are against it.\n*****\n&gt; The Dow was down 905 points, or 2.5% Friday in its worse day since October, 2020. The S&amp;P 500 tumbled 2.3% Friday to 4,594, giving it a 2.2% decline for the week.\n*****\n&gt; “I think that’s going to override what else we’re going to see,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “It’s a heavy data week with the ISMs and certainly payrolls, but I think this new variant is going to freeze behavior until there’s more clarity.”\n*****\n&gt; According to Dow Jones, economists expect a strong payroll report Friday, with 581,000 jobs added, after October’s 531,000 payrolls. They expect the economy has shaken off the effects of the slowdown linked to the Covid delta variant, and growth in the current quarter could be far stronger than the third quarter.\n*****\n&gt; The Institute of Supply Management manufacturing survey is released Wednesday, and that should also be strong.\n*****\n&gt; Scott Redler, partner with T3Live.com, said many traders were caught off sides in the shortened session Friday, usually a positive one for the market, and there are key levels the market must hold in the week ahead in order to stage a yearend Santa rally.\n*****\n&gt; “Right now, the market lost some momentum, but it’s not broken. It could be just fine and refuel if the 50-day moving average on the S&amp;P 500 holds next week. It’s all very fluid,” he said.\n*****\n&gt; The 50-day, at 4,527, is a widely-watched momentum indicator, and it is basically the average close of the last 50 sessions.\n*****\n&gt; The market had already been losing momentum this past Monday with a bearish reversal, he said.\n*****\n&gt; “On Wednesday, the market absorbed the weakness and gave traders a false sense of security which is normally a nice easy holiday-shortened session Friday,” Redler said.\n*****\n&gt; Sam Stovall, chief investment strategist at CFRA, said the S&amp;P 500 typically gains 7% between its October low and year-end close, but this year it had already gained more than 9%.\n*****\n&gt; “We’re ahead of the game and due for some sort of digestion,” Stovall said on CNBC.\n*****\n&gt; The Dow dipped more than 1,000 points during Friday trading. Riskier assets were down even more, with the Russell 2000 closing off 3.7% Friday. West Texas Intermediate oil futures plunged more than 12%, and bitcoin was down nearly 8%. Some investors began to reverse bets in the futures market that a strong economic rebound and inflationary pressures would pull the Fed off the sidelines sooner-than-expected.\n*****\n&gt; The 10-year Treasury yield, which moves opposite price, fell to 1.48% from Wednesday’s high of 1.69%.\n*****\n&gt; Investors will be looking for guidance from Fed Chairman Jerome Powell, who appears before Congress in the week ahead with Treasury Secretary Janet Yellen to discuss the coronavirus and the CARES Act stimulus package. On Tuesday, there is a hearing before the Senate Banking Committee.\n*****\n&gt; “I think you have to assume the base case is the virus remains endemic, not back to being a pandemic,” said Barry Knapp, founder of Ironsides Macroeconomics. The worry is that the variant spreads and slows activity, hitting supply chains even more. That could boost inflation while slowing growth.\n*****\n&gt; Knapp said there are risks for stocks, and investors need to be cautious buying the market on the decline.\n*****\n&gt; Knapp said the Fed could end up accelerating the taper of its bond purchases, which would move forward the time frame for potential interest rate hikes.\n*****\n&gt; “The problem with trying to buy the market overall and buying tech stocks in particular is if you buy now because it is down a couple of percent, it rallies into the end of the year and then the market sells off,” he said. For that reason, he favors dipping into cheaper sectors like energy and financials, the worst performing sectors Friday.\n*****\n&gt; Oil and energy will be in the spotlight in the coming week, as OPEC+ meets Thursday. The U.S. and other governments agreed to release oil from their strategic petroleum reserves in an attempt to drive prices lower. The U.S. plans to release 50 million barrels.\n*****\n&gt; OPEC+ has said it would continue to increase production by 400,000 barrels monthly, despite calls from the White House to speed up the release.\n*****\n&gt; Helima Croft, head of global commodities strategy at RBC, said on CNBC there is a chance OPEC could decide to pause its own production increase because of the SPR releases.\n*****\n&gt; “I think as we head into the OPEC meeting Thursday, the question is not only do they do a pause but potentially will they actually pull back some barrels because of concerns about this new variant alongside the very large SPR release,” she said.\n*****\n&gt; She said the U.S. is releasing a record amount of oil. “We are going to have a lot of barrels hitting this market, as we have these concerns about new Covid lockdown restrictions,” she said. “Again, too soon to say whether governments will pull the trigger on such measures, but the market will be concerned.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/ISOlH6m.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ddHELXX.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/2Qq5aaa.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/Jml9Z5I.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pZuwqcf.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/zz3mXj8.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RIguq8O.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eQQE2zm.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pX1v49l.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/QA0QmDF.png))**\n\n*****\n\n&gt; # When Stocks Are Up Big YTD Before Thanksgiving\n\n&gt; As the S&amp;P 500 is up rather impressively, 24.9% year-to-date this year through today’s close on the Tuesday before Thanksgiving, we ran the numbers on the 33 previous years with double digit year-to-date gains at this juncture since 1950. There are a few blemishes, but in general market gains continued into yearend.\n\n&gt; Most importantly, there are no major selloffs on this list. The big December decline of -9.2% in 2018 came after the S&amp;P 500 was down -1.2% at this point in the year. After double-digit YTD gains the S&amp;P 500 was up 70% of the time from the Tuesday before Thanksgiving to yearend for an average gain of 2.3%.\n\n&gt; Also of note is that the Santa Claus Rally suffered only four losses in these years. But these four down SCRs in 1955, 1968, 1999 and 2014 were followed by flat years in 1956 and 2015 and down years in 1969 and 2000. As Yale’s famous line states (2021 Almanac page 116 and 2022 Almanac page 118): “If Santa Claus Should Fail To Call, Bears May Come to Broad and Wall.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/2bbdc6f36627e690a68da0b174749618/6328b31e9c88f708-62/s500x750/f9d585fa7d441cb8e0ed7dfe493904d6b68a23ae.jpg))**\n\n*****\n\n&gt; # How Have Stocks Done Under Jerome Powell?\n\n&gt; The big news this week was Jerome Powell will remain in charge of the Federal Reserve (Fed) for four more years, so we wanted to do a quick blog that looked at how stocks have done while he has been the Fed Chairman.\n\n&gt; “There are many reasons for Jerome Powell to lead the Fed for another four years,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But one of the best could very well be that stocks have done quite well under his leadership. Do you really think he’d still be in charge if stocks did poorly under him? Probably not is the answer there.”\n\n&gt; As shown in the LPL Chart of the Day, the Dow has gained 40% under his leadership, ranking him 8th (near the middle of the pack) when compared with all 16 Fed Chairpersons. Interestingly, he ranks just beneath both of his predecessors in Ben Bernanke and Janet Yellen. With four more years to go, you’d have to like his chances there, but Alan Greenspan’s record of 312% is likely safe for the time being.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.24.21.png?ssl=1))**\n\n&gt; Here are some more Fed Chair fun facts (using the chart below).\n\n&gt; * On an annualized basis, the Dow has gained 9.3% per annum under Powell, the 7th best out of 16.\n&gt; * Interestingly, stocks have dropped under only one Fed Chairperson and that was Eugene Meyer during the Great Depression.\n&gt; * Taking another look at Greenspan’s 312% return and we realize he was in charge of the Fed for 18.5 years. So his annual return of 8.0% puts things in perspective.\n&gt; * The shortest tenure ever was less than a year and a half back in the late 1970s under William Miller. Meanwhile, the longest ever was William Martin at nearly 19 years.\n&gt; * Paul Volker had the best annualized return at 15.2% over his 8 years. Not to mention he handed things over to Greenspan right before the 1987 crash, one of the best handoffs we’ve ever seen in history.\n&gt; * Lastly, the Fed has been led by a woman only once and that was Janet Yellen, now in charge of the Treasury. It is worth noting that her four-year run at the Fed produced a very impressive 12.9% annualized return for stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.24.21.png?ssl=1))**\n\n*****\n\n&gt; # Finally Some Clarity on Fed Leadership\n\n&gt; President Biden officially nominated Chairman Jerome Powell to a second four-year term as Chairman of the Federal Reserve (Fed) and elevated current Fed Governor Lael Brainard to Vice Chair of the Committee. Before the announcement, there was speculation that Brainard could replace Powell as Fed Chair.\n\n&gt; We view these nominations as very market friendly. Powell has done a commendable job supporting markets during the COVID-19 shutdowns and we aren’t quite through with the pandemic. We believe stability and leadership continuity is important as we continue to make our way toward the finish line of the COVID-19 pandemic. While Brainard is well qualified to run the Fed, elevating her to Vice Chair recognizes her contributions and potentially puts her in a position to take over the Chair role in four years. Both positions require Congressional approval, and we think both should be confirmed when Congressional hearings conclude sometime over the next few months.\n\n&gt; “As we expected, President Biden chose continuity and familiarity with these Fed appointments,” noted LPL Financial Fixed Income Strategist Lawrence Gillum. “Going with Powell over Brainard is what markets were expecting, so we think markets are relieved that Fed leadership uncertainty is now out of the way.”\n\n&gt; The knee-jerk reaction in the bond market was interesting in that markets seemingly continue to shift the prospects for interest rate hikes forward. As seen on the LPL Research Chart of the Day, Treasury securities across all maturities sold off with two-year tenors among the most (negatively) impacted. Now, two-year Treasury yields are at the highest level since the pandemic began. Short maturity securities are the most impacted by changes in monetary policy. Moreover, markets are pricing in nearly three rate hikes next year with the first rate hike expected in June, which is much more aggressive than the Fed has indicated.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/11.23.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; President Biden still has three open Fed Board of Governor positions to fill, so we’re a long way from knowing for sure how Fed policy may change over the next few years. However, we would expect Biden to select governors on the dovish side of the spectrum. That said, the 2022 voting rotation with regional Fed Presidents may impart a hawkish lean to the FOMC overall, offsetting some of the dovish bias from Biden’s appointments. The rotation replaces three solidly dovish and one strongly hawkish voting members with two strongly hawkish and two solidly hawkish officials. Monetary policy is managed at the national level, so while the regional presidents will no doubt have influence, we continue to think the Fed will be more accommodative than markets are currently expecting. In addition, with the announcements today, leadership at the top of the Fed should be seen as being supportive to the economy and thus supportive for markets.\n\n*****\n\n&gt; # Pandemic and Multi-Decade Low for Claims\n\n&gt; Out of the massive slug of economic data this morning, one major bright spot was jobless claims. It has now been 88 weeks since the March 13, 2020 release; the last one before claims began to print in the millions. In that time, claims have fallen to not only take out pre-pandemic levels and the low prior to that of 203K set in April 2019 but today saw the first sub-200K reading since November 20, 1969. That compares to estimates of a reading of 260K and last week's 2K upward revised number of 270K. On a side note, in 2019 there were three weeks where the initial release of initial claims came in below 200K (1/24, 4/11, and 4/18), but they have been since revised higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-SA.png))**\n\n&gt; While that is a significant low in claims, the drop appears to a large degree to be thanks to seasonal adjustment. On a non-seasonally adjusted basis, claims rose to 258.6K which was the highest level in six weeks. It is seasonally normal for claims to head higher during the current week of the year with it having happened over 80% of the time historically. Additionally, that is a bit of catch-up considering claims have been bucking seasonal trends in recent weeks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-Seasonal.png))**\n\n&gt; Continuing claims were also lower this week falling from 2.109 million to 2.049 million. As with initial jobless claims, that sets a new low for the pandemic that is 265K above the level from March 13, 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Con-Claims-SA.png))**\n\n&gt; Factoring in all other programs creates an additional week of lag to the data meaning the most recent print is through the first week of November. The final week of October's unusual uptick on account of peculiar growth in claims for expired programs has unwound in the most recent week's data. PUA claims were more than cut in half as PEUC claims also fell by 121K. Combined that resulted in a new low of 2.44 million claims.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-NSA.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 26th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.28.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$CRM $ASAN $CRWD $SNOW $AI $OKTA $SPLK $DOCU $SNEX $JKS $MOMO $CHS $WDH $UCL $RDHL $ZS $AMBA $BOX $NTAP $HPE $BBW $RY $DCI $VEEV $DG $EXPR $SIG $VERU $LE $MRVL $ULTA $SWBI**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/eQQE2zm.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EDL3xa4.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/OkxZbaZ.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.29.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XWYrfnw.png))\n\n&gt; # ***Monday 11.29.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/E6rgE4M.png))\n\n*****\n\n&gt; # ***Tuesday  11.30.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jqz0nFS.png))\n\n&gt; # ***Tuesday 11.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oFuzxf4.png))\n\n*****\n\n&gt; # ***Wednesday 12.1.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EUMKcBz.png))\n\n&gt; # ***Wednesday 12.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7VZJksg.png))\n\n*****\n\n&gt; # ***Thursday 12.2.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/N3mMigQ.png))\n\n&gt; # ***Thursday 12.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4ob72Tx.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/5E0Yzkt.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets. :)",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r2wxjc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1637989952.0
    },
    {
        "author": "TheThinkingReed",
        "created_utc": 1636117711,
        "id": "qnar8q",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "RKT (Rocket Companies) surprise earnings beat. Highest purchase mortgage volume ever for the company. On fire 🔥 housing market projected to continue. New partnership with Salesforce to expand there reach into 10,000 banks and credit unions. Jay on fox this morning.",
        "url": "https://i.redd.it/6qpfxozf0sx71.jpg",
        "created": 1636146511.0
    },
    {
        "author": "bopfj",
        "created_utc": 1637732916,
        "id": "r0xsyt",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Check out this pharmaceutical play. It has been beaten down the past few weeks after receiving an FDA approval. Here are some bullish reasons to consider investing:\n\n1. another PDUFA on 1/29/22\n2. expected to become profitable in 2022\n3. they have 2 new products coming to market in 4Q21.\n4. they are increasing their salesforce for their primary product in 4Q21\n5. Eton now has six FDA-approved products, three of which (carglumic acid, EPRONTIA®, and Rezipres®) are expected to launch in the fourth quarter of 2021. The company also has four additional products that have been submitted to the FDA and could be approved and launched in 2022.",
        "subreddit": "pennystocks",
        "title": "DD on $ETON",
        "url": "https://www.reddit.com/r/pennystocks/comments/r0xsyt/dd_on_eton/",
        "created": 1637761716.0
    },
    {
        "author": "abasoglu",
        "created_utc": 1636746747,
        "id": "qsjasm",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Alibaba has been battered so much that its core business is now valued at less than $10 per share. That might sound ridiculous considering that business is still growing and generating copious amounts of cash flow. But it’s also true.\n\nNow, how did I get to that number?\n\nI started at Alibaba’s market cap and then started to back out all its other major businesses. So, let’s start by listing these businesses along with a rough estimate of their values.\n\n\\- AliBaba Cloud is the company’s answer to Amazon’s AWS business and arguably its future growth engine. The company grew it’s revenue by 50% to $9.4 billion for Alibaba’s FY2021. It’s hard to break out a valuation for Alibaba Cloud on its own but Salesforce might be a reasonable comparison. The company generated $21.3 billion in revenue for its FY2021 and has a market value of $296 billion. Accordingly, it’s reasonable for AliBaba Cloud to be valued at **roughly $100 billion** after adjusting for size and taking a China discount.\n\n\\- Ele.me is s an online food delivery service platform and Alibaba’s direct competitor to Meituan. Ele.me has a 30.9% market share of the Chinese food delivery market versus Meituan’s 67.3%. Meituan’s current market value is $227 billion based on its Hong Kong listed shares. Based off that, Ele.me would command a valuation of roughly $104 billion … rounded down to **$100 billion**.\n\n\\- Lazada is Alibaba’s mini-me for southeast Asia. It dominates some of the countries in the region like Thailand and Malaysia while remaining competitive in the others with its regional rival Shopee (owned by SEA Limited). SEA Limited has a market value of $184 billion but its business also include gaming and a finance arm. A reasonable approximation of Lazada’s value would be around **$80 billion** based off of SEA Limited’s valuation.\n\n\\- Alipay is the company’s fintech arm. However, Alibaba only retains a 33% interest in the company. Before Alipay got in trouble, the company was heading for a $300 billion IPO. Those days are long gone but Alipay continues to grow and make money according reports. The most recent reports I’ve seen mention that Alipay’s value in a potential future IPO would have its valuation slashed to a third or about $100 billion. Alibaba’s portion of that would be $33 billion … let’s round down to **$30 billion**.\n\n\\- Cainao is Alibaba’s logistics arm. Alibaba owns a 63% stake in the company. This is a difficult one to estimate as there isn’t a comparable company out there but the company was valued at around $20 billion back in 2018. The value of this company has only gone up from there as the pandemic has driven up demand for logistic services. I wouldn’t be surprised if Alibaba’s stake is worth **$30 billion**.\n\n\\- Trendyol is Turkey’s dominant e-commerce site. Alibaba owns an 87% stake in the company. Trendyol’s most recent funding valued the company at $16.5 billion … or roughly **$15 billion** for Alibaba’s stake.\n\n\\- Youku is one of China's top online video and streaming service platforms. Alibaba bought the company out in 2016 for $4 billion. I’d say a rough value of the company now is **$10 billion**.\n\n\\- Sun Art is principally engaged in the operation of hypermarkets and e-commerce platforms in China. Alibaba owns a 72% stake that’s worth roughly **$3 billion** at current market value of the company’s HK listed shares.\n\n\\- Last but not least, Alibaba has **$57 billion** of cash and short-term investments net of debt.\n\nAll of the above pieces add up to hefty $426 billion. Alibaba’s current market cap is roughly $450 billion these days. So, you’re left with a paltry **$24 billion** valuation for Alibaba’s core e-commerce businesses (that includes Taobao, TMall, AliExpress and Alibaba.com).\n\nOr to put it another way, you’re buying those businesses for **$8.89 per share** (Alibaba has 2.7 billion shares outstanding). That’s a deal of a lifetime and why I remain bullish on Alibaba.",
        "subreddit": "wallstreetbets",
        "title": "Would you like to buy Alibaba’s Chinese e-commerce business for less than $10 per share?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qsjasm/would_you_like_to_buy_alibabas_chinese_ecommerce/",
        "created": 1636775547.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638280535,
        "id": "r5nsh3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to the final trading day of November! Here are your pre-market stock movers &amp; news on this Tuesday, November 30th, 2021-\n\n*****\n\n# [Dow futures are down more than 350 points as investors try to gauge the economic impact of omicron](https://www.cnbc.com/2021/11/29/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures tumbled in early Tuesday trading, reversing a Monday rebound on Wall Street as investors reassessed risks associated with the new omicron Covid variant.\n*****\n&gt; Futures on the Dow Jones Industrial Average dropped 390 points, or 1.1%. S&amp;P 500 futures tumbled 0.9% and Nasdaq 100 futures shed 0.5%.\n*****\n&gt; The reversal came after Moderna CEO Stephane Bancel told the Financial Times that he expects existing vaccines to be less effective against the new variant. The CEO told the paper there could be a “material drop” in the current vaccines’ effectiveness against this variant. Bancel told CNBC on Monday that it could take months to develop and ship an omicron-specific vaccine.\n*****\n&gt; Separately, Regeneron said its antibody treatment may have reduced effectiveness against omicron. Regeneron shares lost 3% in premarket trading.\n*****\n&gt; The 10-year Treasury yield fell further below 1.45% as investors worried about the economy slowing because of the new variant. The 10-year rate lost 9 basis points to 1.44% (1 basis point equals 0.01%). The yield on the 10-year Treasury was as high as 1.69% last week before Friday’s drop below 1.5%.\n*****\n&gt; The futures move lower follows a volatile last few sessions as investors evaluate the omicron impact. The Dow lost 905 points on Friday, then rebounded by 237 points on Monday.\n*****\n&gt; Travel shares, which led Friday’s drop and then gained on Monday, were taking hits once again in premarket trading Tuesday. Expedia Group fell 2.3%, Norwegian Cruise Line Holdings tumbled 3.8% and American Airlines shares were off 3.3%.\n*****\n&gt; “We have to expect...that the scenarios, all scenarios, include discoveries of people in this country with omicron and talk that the vaccines don’t work or if they did those who have had Covid have no immunity,” wrote CNBC’s Jim Cramer on Twitter Tuesday. “These all cause selling.”\n*****\n&gt; Some leading pharma stocks also took a hit, with Moderna getting the worst of it as the stock decreased 4.2%. Pfizer, however, was one of the few companies to post gains on the S&amp;P 500, rising 1.2%. Stay-at-home stock Netflix also rose, up 0.7% and videoconference leader Zoom saw shares climb 2.3%.\n*****\n&gt; Major averages rose to session highs on Monday after President Joe Biden said economic lockdowns are currently off the table and there will be no new travel restrictions.\n*****\n&gt; The new Covid variant, first detected in South Africa, has now been found in more than a dozen countries, causing many to restrict travel. The World Health Organization labeled the omicron strain a “variant of concern” on Friday when the Dow slid 900 points to suffer its worst day since October 2020.\n*****\n&gt; Covid symptoms linked to the omicron variant have been described as “extremely mild” by the South African doctor who first raised the alarm over the new strain. Still, the WHO said it will take weeks to understand how the variant may affect diagnostics, therapeutics and vaccines.\n*****\n&gt; Federal Reserve Chairman Jerome Powell will tell the Senate Tuesday as part of his quarterly testimony on the pandemic that he believes that the omicron variant poses “downside risks to employment and economic activity.” It also further complicates the inflation outlook, the Fed chief said in his prepared markets released Monday evening.\n*****\n&gt; “Greater concerns about the virus could reduce people’s willingness to work in person, which would slow progress in the labor market and intensify supply-chain disruptions,” Powell will say.\n*****\n&gt; The CBOE volatility index, also known as the VIX or Wall Street’s fear gauge, declined during Monday’s rally but still remained above 22. The gauge spiked 10 points above 28 at one point on Friday. The VIX was higher again on Tuesday.\n*****\n&gt; “This week will be instructive to see if the buy-the-dip approach by investors is still in play, or if markets are vulnerable to a more significant pullback,” said Mark Hackett, chief of investment research at Nationwide.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/Kjg0zwO.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/aaRkgfQ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/q4uP0Vh.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($JKS $MOMO $BNS $CHS $BQ $BZUN $CTRN $RDHL $UCL $ARCE $SNEX $NVGS $WDH $GBDC $INFA $BFRI)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/j6KX8En.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/tjqxvE3.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/sugyIG5.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/wNc4EG0.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/rhobqci.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/hrF7U5G.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/kLlwiak.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* PPSI\n* HOOD\n* TGTX\n* TWTR\n* LUNA.X\n* ETH.X\n* REQ.X\n* IMGN\n* TIGR\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/30/stocks-making-the-biggest-moves-premarket-regeneron-moderna-dollar-tree-and-more.html)**)\n\n*****\n\n&gt; **Regeneron Pharmaceuticals (REGN)** — Regeneron shares fell more than 1% in the premarket after the company said its Covid-19 antibody cocktail and similar drugs could be less effective against the omicron Covid variant. The drugmaker said mutations in the variant suggest “there may be reduced neutralization activity of both vaccine-induced and monoclonal antibody conveyed immunity.”\n\n&gt; #**STOCK SYMBOL:** REGN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=REGN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/REGN)**)\n\n*****\n\n&gt; **Moderna (MRNA), Pfizer (PFE)** — Shares of vaccine makers were on watch after Moderna CEO Stephane Bancel told the Financial Times he expects existing vaccines to be less effective against the omicron variant. Oxford University said there is no evidence yet that current vaccines will not protect against severe disease from omicron. Researchers are still studying the new variant and its ability to evade prior immunity. Moderna shares fell more than 2% in early morning trading. BioNTech shares fell more than 5%. Pfizer shares gained roughly 1%. Novavax shares added more than 2%.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** — Shares of Dollar Tree fell more than 2% in premarket trading after Goldman downgraded the stock to neutral from a buy. The firm said the stock is too expensive at current levels as Dollar Tree’s comeback story is now priced in.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **SolarEdge Technologies (SEDG)** — Shares of SolarEdge pulled back about 3% premarket after Morgan Stanley downgraded the stock to equal-weight from overweight. Morgan Stanley said the stock appears to be fully valued after a recent hot streak.\n\n&gt; #**STOCK SYMBOL:** SEDG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SEDG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SEDG)**)\n\n*****\n\n&gt; **Meta Platforms (FB)** — Shares of Facebook-parent Meta were slightly lower in the premarket after a U.K. regulator told the company it must sell GIF-sharing platform Giphy. The Competition and Markets Authority said Meta’s acquisition of Giphy would reduce competition between social media platforms.\n\n&gt; #**STOCK SYMBOL:** FB\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FB)**)\n\n*****\n\n&gt; **Beyond Meat (BYND), Oatly (OTLY)** — Shares of meat alternative producer Beyond Meat and plant-based dairy company Oatly each retreated more than 1% in early morning trading after HSBC initiated coverage of the stocks at a “reduce” rating. In a report on the alternative proteins market, HSBC said, “Given the prospect of heightened competition, the growth we forecast will be insufficient for many participants to achieve their lofty growth ambitions.”\n\n&gt; #**STOCK SYMBOL:** OTLY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OTLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OTLY)**)\n\n*****\n\n&gt; **Twitter (TWTR), Square (SQ)** — Shares of Twitter and Square moved higher in the premarket the day after Jack Dorsey announced he is stepping down as CEO of Twitter. Dorsey was serving as chief executive at both the social media platform and digital payments company Square. Bank of America upgraded Square to neutral from underperform and reiterate a buy rating for Twitter.\n\n&gt; #**STOCK SYMBOL:** TWTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TWTR)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** SQ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SQ)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 30th, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(11/30) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r5nsh3/1130_tuesdays_premarket_stock_movers_news/",
        "created": 1638309335.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638192297,
        "id": "r4vs7f",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "# Good Monday morning traders and investors of the r/smallstreetbets sub! Welcome to the new trading week and a fresh start! Here are your pre-market stock movers &amp; news on this Monday, November 29th, 2021-\n\n*****\n\n# [Dow futures rebound by 200 points after Friday’s big sell-off as investors reassess omicron risk](https://www.cnbc.com/2021/11/28/stock-market-futures-open-to-close-news.html)\n*****\n&gt; Stock futures pointed to a rebound following Friday’s big sell-off, as investors monitor the latest developments related to the Covid omicron variant and assess its potential market impact.\n*****\n&gt; Futures on the Dow Jones Industrial Average gained 210 points, or 0.6%. S&amp;P 500 futures added 0.8% and Nasdaq 100 futures rose about 0.9%.\n*****\n&gt; Stocks are coming off a holiday-shortened session Friday in which the Dow posted its worst day since October 2020. The Dow was down 905 points, or 2.5%. The S&amp;P 500 tumbled 2.3% and the Nasdaq Composite slipped 2.2%. The three major indexes were negative for the week.\n*****\n&gt; The World Health Organization on Friday labeled the omicron strain a “variant of concern.” While scientists continue to research the variant, omicron’s large number of mutations has raised alarm. Preliminary evidence suggests the strain has an increased risk of reinfection, according to the WHO. The variant was first reported to the WHO from South Africa and has been found in the U.K., Israel, Belgium, the Netherlands, Germany, Italy, Australia and Hong Kong, but not yet in the U.S. Many countries, including the U.S., moved to restrict travel from southern Africa.\n*****\n&gt; The South African doctor who first raised the alarm over the new variant told the BBC that patients had “extremely mild” symptoms though it was too early to determine how omicron behaves before it is studied closely.\n*****\n&gt; “While it is too early to have definitive data, early reported data suggest that the Omicron virus causes ‘mild to moderate’ symptoms (less severity) and is more transmissible,” Bill Ackman of Pershing Square Capital Management tweeted Sunday evening. “If this turns out to be true, this is bullish not bearish for markets.”\n*****\n&gt; Stocks that were the hardest hit on Friday were rebounding the most on Monday.\n*****\n&gt; Travel related stocks were up across the board. Carnival and Norwegian cruise lines were up more than 4% apiece in premarket trading. American, Delta and United airlines were up more than 2% each. Booking Holdings was up 2%. Boeing was up 1.7%.\n*****\n&gt; “We would be aggressive buyers of this pullback,” wrote Fundstrat’s Tom Lee in a note to clients Sunday night. “As with the case for Beta and Delta variants, the ‘bark’ has proven worse than the bite in each of those precedent instances. The market carnage, in our view, will be short-lived and transitory.”\n*****\n&gt; The 10-year Treasury yield rebounded back above 1.5% after a flight to safety Friday sent investors scrambling into bonds and rates lower (Prices move inversely to yields). Bank of America, American Express and other financials gained on the rebound in yields.\n*****\n&gt; One stock that continued its Friday trend was Moderna. The vaccine maker’s stock was up another 10% in premarket trading after jumping 20% on Friday.\n*****\n&gt; Vaccine makers have announced measures to investigate omicron with testing already underway. While it remains to be seen how omicron responds to current vaccines or whether new formulations are required, Moderna’s Chief Medical Officer Paul Burton said Sunday the vaccine maker could roll out a reformulated vaccine against the omicron variant early next year.\n*****\n&gt; Wall Street’s fear gauge — the CBOE volatility index — was retreating again Monday after a 10-point spike on Friday. UBS looked at the last 17 times since 1990 when the VIX surged 10 points in a single day and found markets tended to snap back in the subsequent trading days. The S&amp;P 500 was higher by 2.5%, on average, the next trading day and 1.6% higher, on average, over the next week, UBS found.\n*****\n&gt; On top of Covid developments, investors are also anticipating key economic data released this week.\n*****\n&gt; The November jobs report on Friday is expected to show solid jobs growth. Economists surveyed by Dow Jones expect 581,000 jobs added in November. The Institute of Supply Management manufacturing survey is released Wednesday and economists also expect strong results.\n*****\n&gt; “The pandemic and COVID variants remain one of the biggest risks to markets, and are likely to continue to inject volatility over the next year(s). It’s hard to say at this point how lasting or impactful this latest variant will be for markets,” Keith Lerner, co-chief investment officer at Truist Advisory Services, said in a note Friday.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://i.imgur.com/ISOlH6m.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/ICn6AUF.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/b1c86w4.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($LI $FRO $YJ $QH)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/OkxZbaZ.png)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/r4x7q0v.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/cx4jqmC.png)**)\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S ANALYST UPGRADES/DOWNGRADES!](https://i.imgur.com/QA0QmDF.png)**)\n\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/pMH4OQW.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* NRXP\n* ATNF\n* BFRI\n* APDN\n* KRYS\n* LI\n* VXRT\n* BYSI\n* BIRD\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/29/stocks-making-the-biggest-moves-premarket-moderna-carnival-zoom-and-more.html)**)\n\n*****\n\n&gt; **Moderna** — Shares of the vaccine maker continued their rally, jumping more than 11% in early morning trading Monday after gaining 20% on Friday. On Sunday the company’s chief medical officer said Moderna could roll out a reformulated vaccine against the omicron variant of Covid early next year.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; **Airlines** — Major airlines ticked up as investors bought the dip following new travel suspensions in Asia and Europe, in response to the newly discovered omicron variant of Covid-19. United, Delta and American Airlines each gained about 1%, after losing about 7% Friday. Travel booking site Expedia also rose, about 2%.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** DAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** AAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=AAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAL)**)\n\n*****\n\n&gt; **Cruise lines** — Carnival, Royal Caribbean Cruises and Norwegian Cruise Line Holdings each rose more than 3% amid the broader rebound in travel stocks from Friday’s omicron-driven sell-off.\n\n&gt; #**STOCK SYMBOL:** CCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=CCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** RCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=RCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** NCLH\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=NCLH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NCLH)**)\n\n*****\n\n&gt; **Allbirds** — Shares of the shoe manufacturer rose 2.5% after several analysts initiated coverage of the stock. Morgan Stanley and Bank of America both posted a price target of $23, implying 16% upside to Friday’s close.\n\n&gt; #**STOCK SYMBOL:** BIRD\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=BIRD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BIRD)**)\n\n*****\n\n&gt; **Coinbase** — The cryptocurrency exchange’s shares rose more than 2% as the price of bitcoin rebounded, after selling off with the broader equities market on Friday. Other crypto-related equities got a lift too, with Microstrategy rising 3.4%. Tesla and Square added more than 1%.\n\n&gt; #**STOCK SYMBOL:** COIN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=COIN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/COIN)**)\n\n*****\n\n&gt; **Zoom Video** — Zoom shares fell almost 2%, moving in the opposite direction of travel stocks and following a 5.7% jump on Friday. Other stay-at-home stocks dipped slightly Monday morning too, including Peloton, Netflix and Teladoc.\n\n&gt; #**STOCK SYMBOL:** ZM\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ZM)**)\n\n*****\n\n&gt; **Merck** — The pharmaceutical company’s shares fell 1.8% after Citi downgraded its stock to neutral from buy, saying development struggles for the company’s HIV drug islatravir will hurt Merck’s long-term potential.\n\n&gt; #**STOCK SYMBOL:** MRK\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRK)**)\n\n*****\n\n&gt; **Wynn Resorts, Las Vegas Sands** — The Macao gaming sector is lower after Alvin Chau, the head of Macau’s biggest casino junket operator, and 10 others were arrested over allegedly illegal gambling platforms targeting mainland Chinese, according to a report by the South China Morning Post. Wynn fell 1.9% and Las Vegas Sands fell 1.2%\n\n&gt; #**STOCK SYMBOL:** WYNN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=WYNN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WYNN)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, November 29th, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(11/29) Monday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r4vs7f/1129_mondays_premarket_stock_movers_news/",
        "created": 1638221097.0
    },
    {
        "author": "Shorting_Gamestop",
        "created_utc": 1638039723,
        "id": "r3kb8d",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "3X leverage SalesForce CRM calls (Yes/No)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r3kb8d/3x_leverage_salesforce_crm_calls_yesno/",
        "created": 1638068523.0
    },
    {
        "author": "hessmaxx",
        "created_utc": 1638264996,
        "id": "r5jnrh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi I‘m 19 and currently got 30k in Amazon, Nvidia, Google, Apple and Microsoft. Been holding since January 2021. Right now I saved around 1k and I‘m hesitant to invest - which one: FB, AMD, Salesforce, Cloudflare? I know I‘m very tech heavy but Im planning on holding this portfolio for the longest time. What are your thoughts?",
        "subreddit": "stocks",
        "title": "Got 1k to invest.",
        "url": "https://www.reddit.com/r/stocks/comments/r5jnrh/got_1k_to_invest/",
        "created": 1638293796.0
    },
    {
        "author": "tesla365s",
        "created_utc": 1636050802,
        "id": "qmr8qw",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "Whats your plan for next week/month? What is the best option to make a million or more in a week/month? NVIDIA/Coinbase/Salesforce?",
        "url": "https://i.redd.it/1uqo1iohhmx71.jpg",
        "created": 1636079602.0
    },
    {
        "author": "Shorting_Gamestop",
        "created_utc": 1638039846,
        "id": "r3kcvb",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "CRM 🚀🌑📈",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r3kcvb/crm/",
        "created": 1638068646.0
    },
    {
        "author": "Buck_Folton",
        "created_utc": 1638110474,
        "id": "r45qtm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’ve been a moderately successful day trader of stocks for a couple of years, small account. I fell into options accidentally a couple few weeks ago (sold some $XPEV calls  to stem the loss on a couple hundred shares I was holding, and have been selling and closing covered calls every day or two since then, because the price action has been perfect for it), and now I am fascinated, excited for the potential, and have been reading like crazy. I want to try my first thoughtful options bet this week, and I am looking at a long straddle or strangle on Salesforce, which has earnings on Tuesday.\n\n**TL;DR—Is $CRM a good play this week, and how would you play it?**\n\nFirst, I get that I am too late for a good entry, but I think it might still be possible to make a little money, and am considering the smallest possible bet, one contract per leg.\n\nI’m not necessarily expecting an earnings surprise from Salesforce, but anecdotally I feel like the market itself has brought a lot of earnings surprises this year, usually in the form of substantial drops on earnings beats. $CRM has been in a strong uptrend for months, but is sharply down over the last week or so. It just crossed below the 50-day MA, opening and closing there with a red doji on Friday, but the 50-day line is still diverging upward from the 200. If I am reading the options chain correctly, it looks like the market has a somewhat long bias. Mostly I just have a feeling the stock isn’t going to go sideways from here, which is why this strategy interests me.\n\nSo, my question is even though I know I should have been thinking about this a few weeks ago, is it still reasonable to think I might make a profit here? If so, would it be better to do a straddle at a single strike price, or maybe a long strangle, where I have lower premiums but more risk to the downside. My instinct is to get the 3DTE or 10DTE and aim for a quick profit on intrinsic value. Is that ridiculous? Should I buy LEAPS instead?\n\nThe other option would be, since I have a slightly long bias here, to just buy a call, watch what happens, and get out for a 10% loss if it goes the wrong way on me. That’s easy, though…and now that am starting to see the power of options, I want to try a real strategic, multi-leg position to test my mettle.\n\nI appreciate any help or suggestions, and comments about how dumb I am or what obvious things I’ve missed or misunderstood are entirely welcome.",
        "subreddit": "options",
        "title": "$CRM straddle/strangle? Anyone?",
        "url": "https://www.reddit.com/r/options/comments/r45qtm/crm_straddlestrangle_anyone/",
        "created": 1638139274.0
    },
    {
        "author": "cclagator",
        "created_utc": 1638139811,
        "id": "r4gnpx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was down 2.6% the past week week, a move nearly 3x more than what options were pricing. Implied volatility spiked more than 50%.\n\n**This Week – SPY** options are pricing about a 2.4% move (about $11 in either direction) for the upcoming week. That is a significantly larger move than what options were pricing last into last week (just a $4 move)\n\n**Implied Volatility** – The VIX ended Friday around 28, significantly higher on the week.\n\n**Expected Moves for This Week** (Via Options AI)\n\n* SPY **2.4%** (about $11)\n* QQQ **2.4%** (about $10)\n* IWM **3.8%** (about $8)\n* DIA **2.3%** (about $8)\n\n### In the News\n\nEquities weren’t the only assets moving on Friday’s Covid variant news, crude oil prices also tumbled. As an example, the etf USO was down 11%. Here’s a look at what options in USO are pricing for this week (about 6.5%) and into year end (about 12%):\n\n&amp;#x200B;\n\nhttps://i.redd.it/mnz40it01f281.gif\n\n### Expected Moves for Companies Reporting Earnings\n\nThe *expected moves* link to the Options AI Calendar (free to use and search for other stocks of interest). *Recent moves* on prior earnings start with the prior quarter.\n\n*Tuesday*\n\n**Salesforce** CRM / [Expected Move: **6.2%**](https://tools.optionsai.com/earnings/CRM) / Recent moves: +3%, +5%, -6%\n\n**ZScaler** ZS / [Expected Move: **9.6%**](https://tools.optionsai.com/earnings/ZS) / Recent moves: -3%, +12%, +5%\n\n*Wednesday*\n\n**Crowdstrike** CRWD / [Expected Move: **7.7%**](https://tools.optionsai.com/earnings/CRWD) / Recent moves: -4%, -4%, +6%\n\n**Snowflake** SNOW / [Expected Move: **7.9%**](https://tools.optionsai.com/earnings/SNOW) / Recent moves: +8%, +4%, +1%\n\n**Okta** OKTA / [Expected Move: **7.6%**](https://tools.optionsai.com/earnings/OKTA) / Recent moves: +3%, -10%, -6%\n\n**Splunk** SPLK / [Expected Move: **6.8%**](https://tools.optionsai.com/earnings/SPLK) / Recent moves: -1%, -10%, -3%\n\nThursday\n\n**Docusign** DOCU / [Expected Move: **7.9%**](https://tools.optionsai.com/earnings/DOCU) / Recent moves: +5%, +20%, -7%",
        "subreddit": "options",
        "title": "This week's expected moves. SPY, QQQ, USO, CRM, SNOW and more.",
        "url": "https://www.reddit.com/r/options/comments/r4gnpx/this_weeks_expected_moves_spy_qqq_uso_crm_snow/",
        "created": 1638168611.0
    },
    {
        "author": "bullnodes",
        "created_utc": 1638201838,
        "id": "r4yze7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Coming out of the long Thanksgiving weekend, we’ll get quarterly earnings reports from a number of influential technology companies.  \n\nTheir earnings could help point the direction of where stocks are headed in the final month of the year and where technology stocks can be expected to move in 2022. \n\nThe first one is a cloud computing giant Salesforce. Its shares have been gathering strenght lately after being dormant in this year’s first half. CRM stock has gained 30% in the past six months and now trades at just over $296 per share.  \nThis company remains the market leader in the cloud-based customer relationship management industry with a 20% market share. Businesses use Salesforce’s CRM products to leverage data in a way that drivea growth.  \nThe company continues to grow at a fast clip! In July of this year, it completed its $27.7 billion acquisition of instant messaging and workplace communication company Slack. Salesforce’s CRM platform now boasts more than 150,000 corporate customers worldwide, and it is the fastest-growing software-as-a-servce company ever having hit $20 billion in annual revenue more quickly than any other SaaS vendor! \nSalesforce is reporting thwir quarterly earnings results tomorrow, on Nov 30th. \n\nWould you add this stock to your watchlist?  \nVisit  [Lantern](https://uselantern.com/) and be the first to find out all the latest news about this stock (plus many more)!",
        "subreddit": "investing_discussion",
        "title": "Upcoming earnings calendar - tech stocks",
        "url": "https://www.reddit.com/r/investing_discussion/comments/r4yze7/upcoming_earnings_calendar_tech_stocks/",
        "created": 1638230638.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1638185701,
        "id": "r4ty4y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Percent Change (24H)|Mentions and Charts|\n|:-|:-|:-|:-|:-|\n|SPY|SPDR S&amp;P 500 ETF Trust|[36](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=options)|800.00|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=options)\n|GME|GameStop Corp|[12](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=options)\n|UVXY|ProShares Trust II - ProShares Ultra VIX Short-Term Futures ETF|[11](https://www.memebergterminal.com/stock/ProShares%20Trust%20II%20-%20ProShares%20Ultra%20VIX%20Short-Term%20Futures%20ETF/UVXY?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20Trust%20II%20-%20ProShares%20Ultra%20VIX%20Short-Term%20Futures%20ETF/UVXY?utm_source=rsmb&amp;utm_medium=options)\n|TSLA|Tesla Inc|[7](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=options)|250.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=options)\n|CRM|salesforce.com inc|[5](https://www.memebergterminal.com/stock/salesforce.com%20inc/CRM?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/salesforce.com%20inc/CRM?utm_source=rsmb&amp;utm_medium=options)\n|DIS|The Walt Disney Company|[5](https://www.memebergterminal.com/stock/The%20Walt%20Disney%20Company/DIS?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/The%20Walt%20Disney%20Company/DIS?utm_source=rsmb&amp;utm_medium=options)\n|QQQ|Invesco QQQ Trust Series 1|[4](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=options)\n|NVDA|NVIDIA Corporation|[3](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=options)|200.00|[See Specific Mentions](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=options)\n|SQQQ|ProShares Trust - ProShares UltraPro Short QQQ|[3](https://www.memebergterminal.com/stock/ProShares%20Trust%20-%20ProShares%20UltraPro%20Short%20QQQ/SQQQ?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20Trust%20-%20ProShares%20UltraPro%20Short%20QQQ/SQQQ?utm_source=rsmb&amp;utm_medium=options)\n|IBKR|Interactive Brokers Group Inc|[3](https://www.memebergterminal.com/stock/Interactive%20Brokers%20Group%20Inc/IBKR?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Interactive%20Brokers%20Group%20Inc/IBKR?utm_source=rsmb&amp;utm_medium=options)\n|ARKK|ARK ETF Trust - ARK Innovation ETF|[2](https://www.memebergterminal.com/stock/ARK%20ETF%20Trust%20-%20ARK%20Innovation%20ETF/ARKK?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/ARK%20ETF%20Trust%20-%20ARK%20Innovation%20ETF/ARKK?utm_source=rsmb&amp;utm_medium=options)\n|TQQQ|ProShares UltraPro QQQ|[2](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20QQQ/TQQQ?utm_source=rsmb&amp;utm_medium=options)|100.00|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20UltraPro%20QQQ/TQQQ?utm_source=rsmb&amp;utm_medium=options)\n|DOW|Dow Inc|[2](https://www.memebergterminal.com/stock/Dow%20Inc/DOW?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Dow%20Inc/DOW?utm_source=rsmb&amp;utm_medium=options)\n|AMD|Advanced Micro Devices Inc|[2](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=options)\n|MSFT|Microsoft Corporation|[2](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=options)\n|VIXY|ProShares Trust II - ProShares VIX Short-Term Futures ETF|[2](https://www.memebergterminal.com/stock/ProShares%20Trust%20II%20-%20ProShares%20VIX%20Short-Term%20Futures%20ETF/VIXY?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20Trust%20II%20-%20ProShares%20VIX%20Short-Term%20Futures%20ETF/VIXY?utm_source=rsmb&amp;utm_medium=options)\n|PFE|Pfizer Inc|[2](https://www.memebergterminal.com/stock/Pfizer%20Inc/PFE?utm_source=rsmb&amp;utm_medium=options)|-33.33|[See Specific Mentions](https://www.memebergterminal.com/stock/Pfizer%20Inc/PFE?utm_source=rsmb&amp;utm_medium=options)\n|EXP|Eagle Materials Inc|[2](https://www.memebergterminal.com/stock/Eagle%20Materials%20Inc/EXP?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Eagle%20Materials%20Inc/EXP?utm_source=rsmb&amp;utm_medium=options)\n|AMC|AMC Entertainment Holdings Inc|[2](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=options)|100.00|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=options)\n|AHT|Ashford Hospitality Trust Inc|[2](https://www.memebergterminal.com/stock/Ashford%20Hospitality%20Trust%20Inc/AHT?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Ashford%20Hospitality%20Trust%20Inc/AHT?utm_source=rsmb&amp;utm_medium=options)\n|BP|BP p.l.c|[2](https://www.memebergterminal.com/stock/BP%20p.l.c/BP?utm_source=rsmb&amp;utm_medium=options)|0.00|[See Specific Mentions](https://www.memebergterminal.com/stock/BP%20p.l.c/BP?utm_source=rsmb&amp;utm_medium=options)\n### Data source credits: Memeberg Terminal. For realtime mention counts and to see the specific comments people made about a ticker instead of just aggregate numbers, visit the source of this data @ [https://memebergterminal.com](https://memebergterminal.com?utm_source=rsmbfoot&amp;utm_medium=options)",
        "subreddit": "options",
        "title": "I scraped r/options for the top ticker mentions in the last 24H. Here are the results (Monday November 29, 2021)",
        "url": "https://www.reddit.com/r/options/comments/r4ty4y/i_scraped_roptions_for_the_top_ticker_mentions_in/",
        "created": 1638214501.0
    },
    {
        "author": "TheThinkingReed",
        "created_utc": 1636118391,
        "id": "qnaz6k",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Highest purchase mortgage volume ever for the company. On fire 🔥 housing market projected to continue. New partnership with Salesforce to expand there reach into 10,000 banks and credit unions. Jay on fox this morning.  Decades of building an eco system that takes market share when rates change.  Home values at record prices which is good for them because margins increase when or if volume drops.  US equity up 19%, good for cash out refinance for home improvements, debt consolidation and solar.  Rocketing today or crash and burn?   Long hold?",
        "subreddit": "wallstreetbets",
        "title": "RKT (Rocket Companies) surprise earnings beat.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnaz6k/rkt_rocket_companies_surprise_earnings_beat/",
        "created": 1636147191.0
    },
    {
        "author": "devilmaskrascal",
        "created_utc": 1636526174,
        "id": "qqo4gs",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[https://www.bloomberg.com./news/articles/2021-11-10/software-firm-brivo-said-to-near-spac-deal-with-crown-proptech](https://www.bloomberg.com/news/articles/2021-11-10/software-firm-brivo-said-to-near-spac-deal-with-crown-proptech)\n\nBrivo Inc., a maker of security software for buildings, is in advanced discussions to merge with blank-check company Crown PropTech Acquisitions ($CPTK), according to people familiar with the matter.\n\nA deal would value the combined entity at around $800 million including debt, the people said, asking not to be identified because the matter is private. \n\nFounded in 1999, Bethesda, Maryland-based Brivo sells security technology and services including access control and video surveillance  to property owners. Its cloud-based system is used to safeguard  enterprises, residential buildings and properties such as vacation rentals. \n\nIt counts Amazon.com Inc.’s Whole Foods, Salesforce.com Inc. and fitness center Solidcore among its customers, Brivo’s website showed.\n\n\\---\n\nAccording to their website, Brivo is used by over 23 million users and over 72,000 buildings worldwide.",
        "subreddit": "SPACs",
        "title": "Bloomberg: $CPTK nears ~$800m deal with Brivo, a property security technology and services company $CPTK-WT $CPTK-UN",
        "url": "https://www.reddit.com/r/SPACs/comments/qqo4gs/bloomberg_cptk_nears_800m_deal_with_brivo_a/",
        "created": 1636554974.0
    },
    {
        "author": "Shorting_Gamestop",
        "created_utc": 1638090683,
        "id": "r409gl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "CRM SalesForce calls📈\n\nCRWD cloudstrike calls📈\n\nMRVL Marvell Technology Puts📉\n\nPVH corp. Puts📉\n\nAny stocks you’ll be buying or selling ahead of earnings this week",
        "subreddit": "wallstreetbets",
        "title": "(Yes/No)🚀🌑",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r409gl/yesno/",
        "created": 1638119483.0
    },
    {
        "author": "Ok_Yogurtcloset44",
        "created_utc": 1638271372,
        "id": "r5l74k",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "New Investor here, didn’t take it serious during the crash but started just in August 2021\n\nI am aiming for a Growth more but if im over-diversified then lmk! My broker is M1 finance b/c i want to hold for a long time then i’ll start doing options &amp; leaps in maybe a E-trade acc.\n\nSorry if thé % aren’t correct im just multiply by the percent x % allocation \n\n44% : My Highest Conviction split between \n\nAAPL 8%\nGoogl - 7.4%\nTSLA - 7.5%\nMSFT - 7.4%\nCOIN - 4.84%\nDIS - 4.84% \nAMZN - 3.5%\n\nETFs - 25% Allocated Total:\n\nSPY - 3.75%\nQQQ - 3.75%\nJEPI - 3.5% - Will be moving to a Dividend Portfolio when I make it \nSCHD - 3.5% - Will make up 20% of the Dividend Portfolio\nARKK - 3.5%\nVXUS - 3.5%\nIXN - 3.5% \n\nGrowth Focused  - 20%:\n\nABNB - 4%\nSHOP - 4%\nCRM - 4% \n(haven’t open these positions yet) but they will be \n(SQ 2%)\n(PCOR 3%)\n(TWLO 3%)\n\nLong time Horizon is 11% - Aiming to capture the MetaVerse without FB/MVRS b/c of its controversial past &amp; cant see that changing but i do see the vision &amp; my \" Growth Speculative \" that I DCA into weekly \n\nAMD 1.87%\nU - 1.87%\nADSK - 1.87%\nNFLX - .9% - Boomer \nPYPL - 1.87% - Just a beaten down stock which i believe will bounce back \nADBE - 1.87% - Huge Growth Giant \nUPWK - .9% - I believe that contract freelancers + remote work is a huge market that it does better than SaaP FVRR \n\nAny thoughts and criticism is wanted I am happy to learn",
        "subreddit": "StockMarket",
        "title": "Portfolio Advice Needed",
        "url": "https://www.reddit.com/r/StockMarket/comments/r5l74k/portfolio_advice_needed/",
        "created": 1638300172.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638280478,
        "id": "r5nruk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to the final trading day of November! Here are your pre-market stock movers &amp; news on this Tuesday, November 30th, 2021-\n\n*****\n\n# [Dow futures are down more than 350 points as investors try to gauge the economic impact of omicron](https://www.cnbc.com/2021/11/29/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures tumbled in early Tuesday trading, reversing a Monday rebound on Wall Street as investors reassessed risks associated with the new omicron Covid variant.\n*****\n&gt; Futures on the Dow Jones Industrial Average dropped 390 points, or 1.1%. S&amp;P 500 futures tumbled 0.9% and Nasdaq 100 futures shed 0.5%.\n*****\n&gt; The reversal came after Moderna CEO Stephane Bancel told the Financial Times that he expects existing vaccines to be less effective against the new variant. The CEO told the paper there could be a “material drop” in the current vaccines’ effectiveness against this variant. Bancel told CNBC on Monday that it could take months to develop and ship an omicron-specific vaccine.\n*****\n&gt; Separately, Regeneron said its antibody treatment may have reduced effectiveness against omicron. Regeneron shares lost 3% in premarket trading.\n*****\n&gt; The 10-year Treasury yield fell further below 1.45% as investors worried about the economy slowing because of the new variant. The 10-year rate lost 9 basis points to 1.44% (1 basis point equals 0.01%). The yield on the 10-year Treasury was as high as 1.69% last week before Friday’s drop below 1.5%.\n*****\n&gt; The futures move lower follows a volatile last few sessions as investors evaluate the omicron impact. The Dow lost 905 points on Friday, then rebounded by 237 points on Monday.\n*****\n&gt; Travel shares, which led Friday’s drop and then gained on Monday, were taking hits once again in premarket trading Tuesday. Expedia Group fell 2.3%, Norwegian Cruise Line Holdings tumbled 3.8% and American Airlines shares were off 3.3%.\n*****\n&gt; “We have to expect...that the scenarios, all scenarios, include discoveries of people in this country with omicron and talk that the vaccines don’t work or if they did those who have had Covid have no immunity,” wrote CNBC’s Jim Cramer on Twitter Tuesday. “These all cause selling.”\n*****\n&gt; Some leading pharma stocks also took a hit, with Moderna getting the worst of it as the stock decreased 4.2%. Pfizer, however, was one of the few companies to post gains on the S&amp;P 500, rising 1.2%. Stay-at-home stock Netflix also rose, up 0.7% and videoconference leader Zoom saw shares climb 2.3%.\n*****\n&gt; Major averages rose to session highs on Monday after President Joe Biden said economic lockdowns are currently off the table and there will be no new travel restrictions.\n*****\n&gt; The new Covid variant, first detected in South Africa, has now been found in more than a dozen countries, causing many to restrict travel. The World Health Organization labeled the omicron strain a “variant of concern” on Friday when the Dow slid 900 points to suffer its worst day since October 2020.\n*****\n&gt; Covid symptoms linked to the omicron variant have been described as “extremely mild” by the South African doctor who first raised the alarm over the new strain. Still, the WHO said it will take weeks to understand how the variant may affect diagnostics, therapeutics and vaccines.\n*****\n&gt; Federal Reserve Chairman Jerome Powell will tell the Senate Tuesday as part of his quarterly testimony on the pandemic that he believes that the omicron variant poses “downside risks to employment and economic activity.” It also further complicates the inflation outlook, the Fed chief said in his prepared markets released Monday evening.\n*****\n&gt; “Greater concerns about the virus could reduce people’s willingness to work in person, which would slow progress in the labor market and intensify supply-chain disruptions,” Powell will say.\n*****\n&gt; The CBOE volatility index, also known as the VIX or Wall Street’s fear gauge, declined during Monday’s rally but still remained above 22. The gauge spiked 10 points above 28 at one point on Friday. The VIX was higher again on Tuesday.\n*****\n&gt; “This week will be instructive to see if the buy-the-dip approach by investors is still in play, or if markets are vulnerable to a more significant pullback,” said Mark Hackett, chief of investment research at Nationwide.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/Kjg0zwO.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/aaRkgfQ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/q4uP0Vh.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($JKS $MOMO $BNS $CHS $BQ $BZUN $CTRN $RDHL $UCL $ARCE $SNEX $NVGS $WDH $GBDC $INFA $BFRI)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/j6KX8En.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/tjqxvE3.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/sugyIG5.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/wNc4EG0.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/rhobqci.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/hrF7U5G.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/kLlwiak.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* PPSI\n* HOOD\n* TGTX\n* TWTR\n* LUNA.X\n* ETH.X\n* REQ.X\n* IMGN\n* TIGR\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/30/stocks-making-the-biggest-moves-premarket-regeneron-moderna-dollar-tree-and-more.html)**)\n\n*****\n\n&gt; **Regeneron Pharmaceuticals (REGN)** — Regeneron shares fell more than 1% in the premarket after the company said its Covid-19 antibody cocktail and similar drugs could be less effective against the omicron Covid variant. The drugmaker said mutations in the variant suggest “there may be reduced neutralization activity of both vaccine-induced and monoclonal antibody conveyed immunity.”\n\n&gt; #**STOCK SYMBOL:** REGN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=REGN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/REGN)**)\n\n*****\n\n&gt; **Moderna (MRNA), Pfizer (PFE)** — Shares of vaccine makers were on watch after Moderna CEO Stephane Bancel told the Financial Times he expects existing vaccines to be less effective against the omicron variant. Oxford University said there is no evidence yet that current vaccines will not protect against severe disease from omicron. Researchers are still studying the new variant and its ability to evade prior immunity. Moderna shares fell more than 2% in early morning trading. BioNTech shares fell more than 5%. Pfizer shares gained roughly 1%. Novavax shares added more than 2%.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** — Shares of Dollar Tree fell more than 2% in premarket trading after Goldman downgraded the stock to neutral from a buy. The firm said the stock is too expensive at current levels as Dollar Tree’s comeback story is now priced in.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **SolarEdge Technologies (SEDG)** — Shares of SolarEdge pulled back about 3% premarket after Morgan Stanley downgraded the stock to equal-weight from overweight. Morgan Stanley said the stock appears to be fully valued after a recent hot streak.\n\n&gt; #**STOCK SYMBOL:** SEDG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SEDG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SEDG)**)\n\n*****\n\n&gt; **Meta Platforms (FB)** — Shares of Facebook-parent Meta were slightly lower in the premarket after a U.K. regulator told the company it must sell GIF-sharing platform Giphy. The Competition and Markets Authority said Meta’s acquisition of Giphy would reduce competition between social media platforms.\n\n&gt; #**STOCK SYMBOL:** FB\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FB)**)\n\n*****\n\n&gt; **Beyond Meat (BYND), Oatly (OTLY)** — Shares of meat alternative producer Beyond Meat and plant-based dairy company Oatly each retreated more than 1% in early morning trading after HSBC initiated coverage of the stocks at a “reduce” rating. In a report on the alternative proteins market, HSBC said, “Given the prospect of heightened competition, the growth we forecast will be insufficient for many participants to achieve their lofty growth ambitions.”\n\n&gt; #**STOCK SYMBOL:** OTLY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OTLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OTLY)**)\n\n*****\n\n&gt; **Twitter (TWTR), Square (SQ)** — Shares of Twitter and Square moved higher in the premarket the day after Jack Dorsey announced he is stepping down as CEO of Twitter. Dorsey was serving as chief executive at both the social media platform and digital payments company Square. Bank of America upgraded Square to neutral from underperform and reiterate a buy rating for Twitter.\n\n&gt; #**STOCK SYMBOL:** TWTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TWTR)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** SQ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SQ)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 30th, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(11/30) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/r5nruk/1130_tuesdays_premarket_stock_movers_news/",
        "created": 1638309278.0
    },
    {
        "author": "bearcat2202",
        "created_utc": 1636596373,
        "id": "qra8pn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What are your insights? Is this new CRM (Twilio Engage) they are launching through the segment acquisition the real deal? And Could it be the next big thing? The company seems to continue to want to make 5+ acquisitions a year which should further contribute to growth but it seems like twilio engage should be the future. Does anyone have insights? Could this be a 10 bagger or better?",
        "subreddit": "stocks",
        "title": "From both a technological and financial standpoint Twilio $TWLO looks very strong (10x+ opp). Who understands this company inside and out?",
        "url": "https://www.reddit.com/r/stocks/comments/qra8pn/from_both_a_technological_and_financial/",
        "created": 1636625173.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638008306,
        "id": "r3aqfx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts after these few weeks?\n\n[app.fincredible.ai](https://preview.redd.it/yul7ek2464281.png?width=851&amp;format=png&amp;auto=webp&amp;s=0b704a700ae972f8ecc5c0a437dd12a66640c47b)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "investing_discussion",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/investing_discussion/comments/r3aqfx/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638037106.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638192244,
        "id": "r4vrmf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "# Good Monday morning traders and investors of the r/StockMarket sub! Welcome to the new trading week and a fresh start! Here are your pre-market stock movers &amp; news on this Monday, November 29th, 2021-\n\n*****\n\n# [Dow futures rebound by 200 points after Friday’s big sell-off as investors reassess omicron risk](https://www.cnbc.com/2021/11/28/stock-market-futures-open-to-close-news.html)\n*****\n&gt; Stock futures pointed to a rebound following Friday’s big sell-off, as investors monitor the latest developments related to the Covid omicron variant and assess its potential market impact.\n*****\n&gt; Futures on the Dow Jones Industrial Average gained 210 points, or 0.6%. S&amp;P 500 futures added 0.8% and Nasdaq 100 futures rose about 0.9%.\n*****\n&gt; Stocks are coming off a holiday-shortened session Friday in which the Dow posted its worst day since October 2020. The Dow was down 905 points, or 2.5%. The S&amp;P 500 tumbled 2.3% and the Nasdaq Composite slipped 2.2%. The three major indexes were negative for the week.\n*****\n&gt; The World Health Organization on Friday labeled the omicron strain a “variant of concern.” While scientists continue to research the variant, omicron’s large number of mutations has raised alarm. Preliminary evidence suggests the strain has an increased risk of reinfection, according to the WHO. The variant was first reported to the WHO from South Africa and has been found in the U.K., Israel, Belgium, the Netherlands, Germany, Italy, Australia and Hong Kong, but not yet in the U.S. Many countries, including the U.S., moved to restrict travel from southern Africa.\n*****\n&gt; The South African doctor who first raised the alarm over the new variant told the BBC that patients had “extremely mild” symptoms though it was too early to determine how omicron behaves before it is studied closely.\n*****\n&gt; “While it is too early to have definitive data, early reported data suggest that the Omicron virus causes ‘mild to moderate’ symptoms (less severity) and is more transmissible,” Bill Ackman of Pershing Square Capital Management tweeted Sunday evening. “If this turns out to be true, this is bullish not bearish for markets.”\n*****\n&gt; Stocks that were the hardest hit on Friday were rebounding the most on Monday.\n*****\n&gt; Travel related stocks were up across the board. Carnival and Norwegian cruise lines were up more than 4% apiece in premarket trading. American, Delta and United airlines were up more than 2% each. Booking Holdings was up 2%. Boeing was up 1.7%.\n*****\n&gt; “We would be aggressive buyers of this pullback,” wrote Fundstrat’s Tom Lee in a note to clients Sunday night. “As with the case for Beta and Delta variants, the ‘bark’ has proven worse than the bite in each of those precedent instances. The market carnage, in our view, will be short-lived and transitory.”\n*****\n&gt; The 10-year Treasury yield rebounded back above 1.5% after a flight to safety Friday sent investors scrambling into bonds and rates lower (Prices move inversely to yields). Bank of America, American Express and other financials gained on the rebound in yields.\n*****\n&gt; One stock that continued its Friday trend was Moderna. The vaccine maker’s stock was up another 10% in premarket trading after jumping 20% on Friday.\n*****\n&gt; Vaccine makers have announced measures to investigate omicron with testing already underway. While it remains to be seen how omicron responds to current vaccines or whether new formulations are required, Moderna’s Chief Medical Officer Paul Burton said Sunday the vaccine maker could roll out a reformulated vaccine against the omicron variant early next year.\n*****\n&gt; Wall Street’s fear gauge — the CBOE volatility index — was retreating again Monday after a 10-point spike on Friday. UBS looked at the last 17 times since 1990 when the VIX surged 10 points in a single day and found markets tended to snap back in the subsequent trading days. The S&amp;P 500 was higher by 2.5%, on average, the next trading day and 1.6% higher, on average, over the next week, UBS found.\n*****\n&gt; On top of Covid developments, investors are also anticipating key economic data released this week.\n*****\n&gt; The November jobs report on Friday is expected to show solid jobs growth. Economists surveyed by Dow Jones expect 581,000 jobs added in November. The Institute of Supply Management manufacturing survey is released Wednesday and economists also expect strong results.\n*****\n&gt; “The pandemic and COVID variants remain one of the biggest risks to markets, and are likely to continue to inject volatility over the next year(s). It’s hard to say at this point how lasting or impactful this latest variant will be for markets,” Keith Lerner, co-chief investment officer at Truist Advisory Services, said in a note Friday.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://i.imgur.com/ISOlH6m.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/ICn6AUF.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/b1c86w4.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($LI $FRO $YJ $QH)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/OkxZbaZ.png)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/r4x7q0v.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/cx4jqmC.png)**)\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S ANALYST UPGRADES/DOWNGRADES!](https://i.imgur.com/QA0QmDF.png)**)\n\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/pMH4OQW.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* NRXP\n* ATNF\n* BFRI\n* APDN\n* KRYS\n* LI\n* VXRT\n* BYSI\n* BIRD\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/29/stocks-making-the-biggest-moves-premarket-moderna-carnival-zoom-and-more.html)**)\n\n*****\n\n&gt; **Moderna** — Shares of the vaccine maker continued their rally, jumping more than 11% in early morning trading Monday after gaining 20% on Friday. On Sunday the company’s chief medical officer said Moderna could roll out a reformulated vaccine against the omicron variant of Covid early next year.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; **Airlines** — Major airlines ticked up as investors bought the dip following new travel suspensions in Asia and Europe, in response to the newly discovered omicron variant of Covid-19. United, Delta and American Airlines each gained about 1%, after losing about 7% Friday. Travel booking site Expedia also rose, about 2%.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** DAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** AAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=AAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAL)**)\n\n*****\n\n&gt; **Cruise lines** — Carnival, Royal Caribbean Cruises and Norwegian Cruise Line Holdings each rose more than 3% amid the broader rebound in travel stocks from Friday’s omicron-driven sell-off.\n\n&gt; #**STOCK SYMBOL:** CCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=CCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** RCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=RCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** NCLH\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=NCLH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NCLH)**)\n\n*****\n\n&gt; **Allbirds** — Shares of the shoe manufacturer rose 2.5% after several analysts initiated coverage of the stock. Morgan Stanley and Bank of America both posted a price target of $23, implying 16% upside to Friday’s close.\n\n&gt; #**STOCK SYMBOL:** BIRD\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=BIRD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BIRD)**)\n\n*****\n\n&gt; **Coinbase** — The cryptocurrency exchange’s shares rose more than 2% as the price of bitcoin rebounded, after selling off with the broader equities market on Friday. Other crypto-related equities got a lift too, with Microstrategy rising 3.4%. Tesla and Square added more than 1%.\n\n&gt; #**STOCK SYMBOL:** COIN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=COIN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/COIN)**)\n\n*****\n\n&gt; **Zoom Video** — Zoom shares fell almost 2%, moving in the opposite direction of travel stocks and following a 5.7% jump on Friday. Other stay-at-home stocks dipped slightly Monday morning too, including Peloton, Netflix and Teladoc.\n\n&gt; #**STOCK SYMBOL:** ZM\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ZM)**)\n\n*****\n\n&gt; **Merck** — The pharmaceutical company’s shares fell 1.8% after Citi downgraded its stock to neutral from buy, saying development struggles for the company’s HIV drug islatravir will hurt Merck’s long-term potential.\n\n&gt; #**STOCK SYMBOL:** MRK\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRK)**)\n\n*****\n\n&gt; **Wynn Resorts, Las Vegas Sands** — The Macao gaming sector is lower after Alvin Chau, the head of Macau’s biggest casino junket operator, and 10 others were arrested over allegedly illegal gambling platforms targeting mainland Chinese, according to a report by the South China Morning Post. Wynn fell 1.9% and Las Vegas Sands fell 1.2%\n\n&gt; #**STOCK SYMBOL:** WYNN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=WYNN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WYNN)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, November 29th, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(11/29) Monday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/r4vrmf/1129_mondays_premarket_stock_movers_news/",
        "created": 1638221044.0
    }
]