[
    {
        "author": "Regulatetherich",
        "created_utc": 1638567697,
        "id": "r89uvp",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I'm concerned about our entire financial system. As an example of this, I'll ask some questions here to induce people to respond with logical answers or maybe even more questions. How many people have been harmed by financial \"errors\" revolving any and all cases where a regulator has fined a defending company(Dc) such as RobingdaHood? \r  \n\r  \n400 fines have been issued by the SEC in 2021, but how much money has been paid by the defending company or by SEC towards restitution anytime money is stolen during these \"civil mistakes? Did it hurt Donald Trump? Did it hurt Joe Biden? Did it hurt Greta Thunberg? Did it hurt millions of retail investors only? Did it hurt the planet?! \r  \n\r  \nIf we assume these regulators such as SEC, CFPB(Consumer Financial Protection Bureau), and FINRA are getting paid $X,000,000,000 for total yearly fines, we should assume Dc robbed someone to afford to be able to pay  these fines or else what possible damage did they do in the first place? If you or me went into a thrift store and stole some air jordans worth $300 and then got arrested and had to pay the local court $100 in fines but didn't have to pay restitution; the shoes, we just made $200. Sounds like a profitable business to me! My point is, the Dc's of the world are continuing to \"make mistakes\" that rob most of the worlds population while paying \"bribes\" to the regulators or am I missing something that shows we are all being paid back \r  \nafter all brokers including Robinhood turns off the buy button, \r  \n\r  \nWhen the fines paid to the regulator is more than the restitution paid to the ones robbed, when SAC steals billions and then changes their name to Point72, when a young boy grows up in Bulgaria, \r  \n\r  \nWhen the banks that initiated the C to AAA loans \"The Big Short\" got paid millions in bonuses but the people that lost their houses got food stamps(2008), When Merril Lynch paid 100million for writing articles to the public to buy when they should have sold and sell when they should have bought(2002), when Enron(2001), when  Mizuho Financial Group  inflated credit rates FOUR YEARS AFTER 2008,  \r  \n\r  \nwhen Siemens used illegal schemes to win business in several different countries around the world and never lost any business, when  Goldman Sachs  was STILL using 2008 schemes to rob people in 2010 for millions, \r  \n\r  \nwhen UBS AG paid a $1,500,000,000 fine for  \"manipulating interbank lending rates,\" when Wells Fargo created millions of fake accounts using REAL social security numbers, when bank of America and other banks used \"creative\" math to obtain billions in overdraft fees paid by the poor who couldn't afford them(\\*when your account is closed with fines Dc gets a tax break), when  Bank of America paid $3.6 billion for  not disclosing billions of dollars worth of bonuses paid to Merrill Lynch employees AFTER 2008 after robing America, \r  \n\r  \nWhen  Wells Fargo &amp; Co, JP Morgan, and Bank of America paid $9.3 billion 5 years after 2008(did you know a single person whom received any payment from losing their house in 2008?)...  JP Morgan Chase paid $13 billion for their part(did you get any of that money?!),  \r  \n\r  \nWhen JP Morgan(2020 they are STILL in business, this is how you KNOW they are like oxygen for the rich) paid  950 million for manipulation of the precious metals market, \r  \nWhen  SAC Capital faced charges for insider trading to the tune of $1,800,000,000 with a B 12 years after they profited tremendously from \"Building 7 Charlie Vids\" and the list goes on and on and on where Dc's made HUGE mistakes that cost people their savings, their 401ks, their house, their jobs, their livelihood, their business, and some even their lives. All these things so bad for the general public are factual and MODS I'm willing to produce the evidence (found during a simple google search) or ban. I only have one real question for everyone, for you, for the president, for the apes, for the ape haters, for the rich whistleblowers(anyone ever met one or is it just Gary Gensler's friends getting the money? \"no facts for this but WTF\"), \r  \n\r  \nThe most important question might be Why are these Dc's still operating with obvious \"don't care about the planet or humans on it\" attitude after regulators clearly fined them for being criminals? A crime is a crime! This leads me to ask if you know what a tax credit is? Tax credits only help people that could afford something to begin with. They don't help the jobless(out of unemployment you're fkd.) If the goverment cares about the global warming or anyone actually getting these \"payments\" why would they care if you were poor or middle class etc? They chose to implement these credits, they chose to allow Robingdahood to IPO after forcing the world to sell as their only decision, and couldn't even exercise any other option. WHAT ARE WE SUPPOSED TO DO after the person whom is suppose to protect the freedoms and people of this country outright defend the corporations over another human being... but seriously wat do we tards do?\r  \n\n\nTLDR; Financial institutions,  brokers, hedge funds are proven crooks per finra/sec fines and the regulators are simply there to get a cut of the money stolen while never removing any license or even reporting it to the department of justice. [https://worthly.com/news/15-biggest-sec-fines-history/](https://worthly.com/news/15-biggest-sec-fines-history/)\r  \n\n\nSome math for your discussion. The link I've provided equals fines of $45.597 billion in fines in just this one page. Did you get any of that money because I didn't? All the things I've mentioned is real money paid to real people but if NO ONE knows anyone that got the money other than winners like Mark Baum and Michael B, I don't think 1929 or the 1934 investment act or the crash of 1999 or the blatant robbery in 2008 was ever fixed in any way shape or form. Anyone care to post in the relevant places with a pic from wetdirtkurt's butthole pic before I shove my computer in my arse so no one can have it?  \nMods, I can produce gain/loss porn to prove I've been here since before Jan 28th goodbye buy button. Thanks",
        "subreddit": "wallstreetbets",
        "title": "Mods, please help, I'm being censored and have proof including a $300k gain I can provide.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r89uvp/mods_please_help_im_being_censored_and_have_proof/",
        "created": 1638596497.0
    },
    {
        "author": "Business-Apartment96",
        "created_utc": 1638568356,
        "id": "r89xzw",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Nvidia don’t need to own ARM to make sht. They paid the licensing for that sht. They made the acquisition for around 40 billion before Nvidia became a 800 billion+ company. If the deal goes through, they have to pay JAP BANK 80 billion worth of cash/stocks for this shtty company that barely makes a billion even though it has 90% market share in the world. How the fuk nvidia supposed to make their money back from this shtty deal? We have Fuking META to send us to the 🌚. FUK YOU ARM. NVIDIA IS A SOFTWARE COMPANY NOW.  Nvidia paid a 1.5 billion fine to Jap Bank to save 40 billions in company values is Fuking worth it if this deal don’t go through.",
        "subreddit": "wallstreetbets",
        "title": "Guys, buy Nvidia now after the ARM deal is all but cancelled. Saving Nvidia 80 billions in cash/stocks.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r89xzw/guys_buy_nvidia_now_after_the_arm_deal_is_all_but/",
        "created": 1638597156.0
    },
    {
        "author": "TheNewPopeHBO",
        "created_utc": 1638569155,
        "id": "r8a6sj",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Read until end: \n\nI wanted to tell this story because I figured some apes would find it amusing and to give a heads up to anyone still using Robinghood or margin. \n\nToday I received my first margin call liquidation. My balance was skimming the line and I was hoping it would bounce and it didn’t. To begin, yes I am retarded but second, **do not let brokers exercise a margin call on you**. Get money in your account, cover that F***ing call or they **will** fuck you. They will not exercise their liquidation with any form of rational or ethical discretion and **will** make the worst sales possible to cost you the most amount of money possible.\n\n\nNow, for the story.\n\n\nToday at 10:38 a.m. Robbinghood liquidated 180 shares in my account netting me a $600 loss. \n\n\nAt the same time they handed me this loss, they could have instead exercised the decision to liquidate a different position of mine. A position which would have covered the same amount of margin due and only accounted for a total loss of $2. Not $2 per share but 4 shares (as opposed to 180) for a total $2 loss.\n\nI called customer service and asked them what the f*** made them decide that was an ethical way to liquidate. They agreed it was bad judgment, agreed they could correct it and then told me that despite both of these points they won’t (I am dead serious).\n\nThe cherry on top? The stocks RobbingHood sold at a massive loss were RobbingHood shares. That’s right. I took a chance on their shit company, they sucked and then penalized me for their suck. What a spit in the face.\n\nTo end on a positive note, I just liquidated my entire account and switched to WeBull closing my RH account, forever. Let this be a warning to all those who like me, ignored the warnings of so many on here.",
        "subreddit": "wallstreetbets",
        "title": "I learned my lesson: A RobbingHood Story.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r8a6sj/i_learned_my_lesson_a_robbinghood_story/",
        "created": 1638597955.0
    },
    {
        "author": "beatmymeateveryday",
        "created_utc": 1638570270,
        "id": "r8akvv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "* Which contract should I choose? I'm inclining towards Jan contract or Feb.  \nI know the further out the less liquidity and more backwardation... But also the more time for the VIX to go down. Based on the current prices, which one would you trade?\n* What product should I choose to do so?  What are the ones available?                                                        \nI want to have 2:1 or 3:1 leverage (not more) to be solvent in case that the VIX goes to \\~80 as it did in 2020 but also get some good exposure till 20 levels.\n* Does it make more sense to short VXN or VIX?\n\n&amp;#x200B;\n\nI know the contracts are trading in backwardation but I would still like to get some short exposure to some contracts.",
        "subreddit": "wallstreetbets",
        "title": "Not advice on how to trade futures? VIX/VXN SHORT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r8akvv/not_advice_on_how_to_trade_futures_vixvxn_short/",
        "created": 1638599070.0
    },
    {
        "author": "XanteraOG",
        "created_utc": 1638378588,
        "id": "r6jmwd",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hello friends! So today a SeekingAlpha article came out addressing some important points about the car trading platform $SFT.\n\n1. The current price $4.50 is HALF the lowest of the 12 analyst ratings ($9). They think it is an easy $7, so a quick 50+% upswing.\n\n2. The company has had amazing revenue growth and it’s current price is being credited to a lockup expiration of 17 mil shares. However, this stock has mainly been double digits in price and it is unlikely any of the SPAC investors would sell for a 50+% loss when the company is projected to soar.\n\n3. The short interest is around 30% which is incredibly high. The stock is a potential short squeeze (per SeekingAlpha). \n\nI see great potential for this company as their market cap is 200x lower than Carvana which is dealing with potential legal and logistical issues related to title delegations.",
        "subreddit": "wallstreetbets",
        "title": "Shift Technologies $SFT, a record bargain with extremely high short interest.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6jmwd/shift_technologies_sft_a_record_bargain_with/",
        "created": 1638407388.0
    },
    {
        "author": "HarvM169",
        "created_utc": 1638571524,
        "id": "r8b0lg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hello Everyone,\n\nIm a fairly new to the stock market world and i was curious on how...\n\nBuying - Calls , Puts\n\n&amp;\n\nSelling - Calls, Puts \n\n\nActually work...\n\n\nI have looked up videos on how they work, but i am looking for a dumb down version of it to make sure if im understanding it correctly lol\n\nAlso if anyone can provide some light on what is required to become approved for Level 3 options trading. Is it experience, income? Your risk potential? \n\nAny response will be appreciated \n\nThank You.",
        "subreddit": "wallstreetbets",
        "title": "How options work?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r8b0lg/how_options_work/",
        "created": 1638600324.0
    },
    {
        "author": "AdministrativeEnd959",
        "created_utc": 1638571910,
        "id": "r8b5gy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Theancienteconomist.com\n\nGold is a precious metal that has been seen as a store of value for centuries with also providing a natural hedge against inflation. Since gold is finite due to the restriction of natural resources, it acts in an opposing way to the dollar, since the supply of the dollar is not finite because the Treasury can always print and create more money.  I will reference an NYU thesis project, \"Gold and Equities as a Hedge Against Inflation\" by Krish Metha, in order to use CPI (Consumer Price Index) and gold futures data from 1978-2018 to track the volatility of gold futures.*  The use of a variety of summary statistics and a GJR-DCC model yielded the following correlation summaries between inflation and gold futures (as opposed to equities) pictured below (link at theancienteconomist.com , most recent article).\n\nCorrelation with Gold Futures and Inflation is &gt;0 for 3 out of 4 decades since 1980.\n\nAs we can see, the correlation table reflects the idea that gold futures have a robust, positive correlation with inflation, strengthening the case for gold as a hedge against inflation. Equities fail to exhibit a similarly strong connection over the same time spans.",
        "subreddit": "wallstreetbets",
        "title": "Using Gold to Hedge Against Inflation",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r8b5gy/using_gold_to_hedge_against_inflation/",
        "created": 1638600710.0
    },
    {
        "author": "Select_University261",
        "created_utc": 1638476427,
        "id": "r7gbq8",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\nBEEN THERE SINCE 1.45 sold at 4.30 bought at 6 and now buying as much as I can with leverage\n\nI am new but not new at the same time I suffered great with AMC I been here since last year this is my first post, please don't be mean :)\n\n[https://www.youtube.com/watch?v=M9D4d9CKG1M](https://www.youtube.com/watch?v=M9D4d9CKG1M)\n\nAlpine 4 Holdings Inc CEO Kent Wilson and ElecJet CEO Sam Gong joined Proactive to discuss its recent announcement that Alpine has acquired ElecJet/Real Graphene, entering the lithium and graphene battery manufacturing and design. The Phoenix-based tech company and ElecJet are also exploring plans with the State of Indiana to convert its South Bend, Indiana facility into a US battery production facility and bring graphene battery production to the United States.\n\nThis is the bottom line 2.20-2.30 it stopped, now it's bouncing back with all these great news  \nIt would be stupid not to buy at it's lowest point and sell it around 5-7\n\n[https://www.bizjournals.com/phoenix/news/2021/11/24/alpine-4-holdings-prices-24-million-offering.html](https://www.bizjournals.com/phoenix/news/2021/11/24/alpine-4-holdings-prices-24-million-offering.html)\n\n \n\nhttps://preview.redd.it/vgibg9g1u6381.png?width=1125&amp;format=png&amp;auto=webp&amp;s=6da5914ed9056e279ef38cbf917eb6d543779718",
        "subreddit": "wallstreetbets",
        "title": "I am new but not new at the same time I suffered great with AMC I been here since last year this is my first post, please don't be mean :) I AM SHARING BIG NEWS ALPINE IS ABOUT TO JUMP LIFT OFF",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7gbq8/i_am_new_but_not_new_at_the_same_time_i_suffered/",
        "created": 1638505227.0
    },
    {
        "author": "Reasearchguy",
        "created_utc": 1638571139,
        "id": "r8avvu",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "What’s going on with FRRSF? It looks like a shareholder coup?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r8avvu/whats_going_on_with_frrsf_it_looks_like_a/",
        "created": 1638599939.0
    },
    {
        "author": "rugerapatt",
        "created_utc": 1638352557,
        "id": "r6bb9s",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "With the COVID-19 pandemic upending life in every corner of the world and putting unwelcome pressure on people vulnerable to depression, suicide and addiction, there has never been a better time to consider new treatments for mental health challenges. One field gaining particularly rapid traction is psychedelics. Of course, substances such as LSD and magic mushrooms have been around for years. They are known for their \"mind-altering\" qualities, both positive and negative, but in many ways, the chemical properties of these compounds and their potential to benefit the brain are only just beginning to be understood.\n\nBright Minds Biosciences is a biotech company at the vanguard of this movement, developing the \"next generation\" of non-addictive psychedelic medicines to treat depression and other neurological conditions and aims to offer an alternative to today's standard treatments such as selective serotonin reuptake inhibitors (SSRIs), of which the widely known Prozac and Citalopram are but two examples.\n\n\"There haven’t really been any new ideas in the last 30 years or so,\" says Bright Minds Chief Executive Officer Ian McDonald, who added that while revolutionary when they emerged in the 1990s, SSRIs have not always been best for patient outcomes, as side effects can include weight gain and sexual dysfunction. SSRIs, he noted, might not work at all, or can even be problematic, for patients suffering from the most severe forms of depression, or people struggling with post-traumatic stress disorder (PTSD). McDonald is convinced that psychedelics is the most promising field for making progress over the next 20 or 30 years in psychiatric medicine, and that related treatments will help the people most deeply affected by such disorders.\n\nWith this in mind, Bright Minds has a portfolio of three patented mechanisms based on serotonin (5-HT) receptors that are being assessed for indications ranging from depression to chronic pain. And with $30 million raised to date, the company is fully funded for Phase 1 trials for two of its drugs, which are due to begin next year. Bright Minds aims to refine what could be seen as \"coarse\" substances and repurpose them. To do so, McDonald has assembled a top-notch team of scientists and researchers with extensive backgrounds in pharma and drug development.\n\nBright Minds aims to refine what could be seen as \"coarse\" substances and repurpose them. To do so, McDonald has assembled a top-notch team of scientists and researchers with extensive backgrounds in pharma and drug development. \n\nBright Minds Co-Founder Dr. Gideon Shapiro, for example, has over 100 patents to his name and is a leading commercial scientist creating novel psychedelics. He served as head of the Alzheimer chemistry group at Sandoz, the company first responsible for discovering LSD and marketing psilocybin, while Bright Minds' Chief Scientific Officer and organic chemist Dr. Alan Kozikowski is world-renowned for his work with psychoactive substances.\n\n\"We're not trying to reinvent the wheel,\" says McDonald. “We're taking compounds that already work and making them better. We're sanding down the rough edges and polishing them up. I'd say it's a much less risky approach than a lot of other biotechs who are doing a completely novel mechanism and where there are questions on efficacy.\" It is also worth highlighting that Bright Minds already has \"composition of matter\" patents covering all of its new chemical entity (NCE) portfolio, giving it a full monopoly over its drugs for 20 years. This approach is more akin to Big Pharma companies, which patent the molecules they invent.\n\nOlder drugs such as LSD and MDMA cannot be patented, and some companies simply pursue weaker patent strategies, according to McDonald. For example, they attempt to patent a method of production or the source of a compound. But these can easily be worked around by skilled chemists and may only offer an exclusivity period for five years, after which they become so-called generic drugs. A drug maker's profitability is at stake here. McDonald points out that potential revenue for a patented drug for depression, for example, could be between US$10,000 and $30,000 per patient per year compared to around $400 per year for a generic drug.\n\nIndeed, the global market potentially open to Bright Minds is enormous. Antidepressants alone are expected to be worth $16 billion a year by 2025. And McDonald says this figure was based on generic depression drugs. For a patented one, based on the number of patients multiplied by $20,000 a year, the figure reaches an eye-watering $600 billion.\n\nPeople who do well taking SSRIs will likely stick with them, McDonald concedes, but for that third of the patient population who do not, there is a potential market for alternatives of $200 billion. The Bright Minds portfolio is already garnering attention. The company is partnering with the US government’s National Institutes of Health to test its drugs for epilepsy and chronic pain, not least to offer an alternative to opioid drugs in the latter case. McDonald says early findings have been encouraging. In August of this year, the company reported positive pre-clinical data for its BMB-101 candidate (invented by Dr. Kozikowski) in treating the rare form of childhood epilepsy called Dravet Syndrome. This non-psychedelic drug is also being indicated as an antipsychotic for Alzheimer's and to treat addiction disorders.\n\nBMB-101 will be heading into Phase 1 trials early in 2022, with two Phase 2 studies potentially following in the second half. The company also aims to run a Phase 2 trial for its psychedelic candidate (5-HT2A) for depression and PTSD in 2022, says McDonald. \"We are entering a very catalyst-rich period. We have a number of clinical trials in 2022 coming up within the next year,\" he adds. \n\nBright Minds appears to be a front-runner in this exciting new medical space and McDonald has the resources and team to see his plan through. \"We are really the leaders in this next generation of psychedelics, looking a step further I think than the other companies, and we have the team to do it – they've done it before, and we're all very excited to get these drugs in the clinic and closer to patients.\"\n\n**Link to the complete article-** [https://ca.proactiveinvestors.com/companies/news/967805/bright-minds-biosciences-a-vision-for-next-generation-psychedelic-medicines-to-treat-neurological-conditions-967805.html](https://ca.proactiveinvestors.com/companies/news/967805/bright-minds-biosciences-a-vision-for-next-generation-psychedelic-medicines-to-treat-neurological-conditions-967805.html)",
        "subreddit": "smallstreetbets",
        "title": "Bright Minds Biosciences (CSE/Nasdaq:DRUG)- A vision for “next-generation” psychedelic medicines to treat neurological conditions",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r6bb9s/bright_minds_biosciences_csenasdaqdrug_a_vision/",
        "created": 1638381357.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638367247,
        "id": "r6fe5i",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to the first trading day of December! Here are your pre-market stock movers &amp; news on this Wednesday, December 1st, 2021-\n\n*****\n\n# [Stock futures jump ahead of first trading day of December after omicron fears dent markets](https://www.cnbc.com/2021/11/30/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; U.S. stock futures were higher in early trading Wednesday, as companies that benefit from the economic reopening gained along with big energy and pharma.\n*****\n&gt; Dow futures rose 305 points. S&amp;P 500 futures gained 1.2% and Nasdaq 100 futures rose 1.4%.\n*****\n&gt; The gains follow a Tuesday sell-off on Wall Street over fears about the new omicron Covid variant and the Federal Reserve mulling a quicker-than-planned exit from its easy monetary policy.\n*****\n&gt; Treasury yields also moved notably higher, with the benchmark 10-year Treasury note most recently back near 1.5% after falling 8 basis points Tuesday to 1.45% on fears that the pandemic would stifle economic growth.\n*****\n&gt; Merck led gainers on the S&amp;P 500, rising 4% in premarket trading a day after its Covid treatment pill received approval from the Food and Drug Administration, though by a narrow 13-10 margin.\n*****\n&gt; Energy shares also posted sharp gains, with Occidental Petroleum up 3.4% as West Texas Intermediate prices climbed more than 4% to nearly $69 a barrel.\n*****\n&gt; Elsewhere in early trading, stocks associated with the economic reopening also posted strong gains. Carnival was up 2.9%, Wynn Resorts gained 2.6% and Hilton Worldwide saw a 2.8% gain.\n*****\n&gt; The moves came a day after the Dow lost more than 650 points, the S&amp;P 500 shed 1.9% and the tech-focused Nasdaq Composite dipped 1.6%. The small-cap benchmark Russell 2000 tumbled 1.9% as cyclical names dragged on the markets.\n*****\n&gt; “Our sense is that the recent selloff is a longer-term buying opportunity. However, investors that want to avoid a potential big drawdown (while giving up some potential upside) may want to wait until the [Fed’s] Dec. 15 meeting,” Wolfe Research strategist Chris Senyek said in a note to clients.\n*****\n&gt; Fed Chairman Jerome Powell jolted markets after he said the central bank is expected to discuss speeding up the taper of its minimum $120 billion a month bond-buying program. Despite the potential disruption of omicron, the Fed chief said he thinks reducing the pace of monthly bond buys can move quicker than the $15 billion-a-month schedule announced earlier this month.\n*****\n&gt; “At this point, the economy is very strong and inflationary pressures are higher, and it is therefore appropriate in my view to consider wrapping up the taper of our asset purchases ... perhaps a few months sooner,” Powell said. “I expect that we will discuss that at our upcoming meeting.”\n*****\n&gt; Goldman Sachs said it projects the Fed will double the pace to $30 billion a month and enact its first rate hike of the pandemic era in June.\n*****\n&gt; The major averages have seen several volatile sessions, starting last Friday when the Dow Jones Industrial Average experienced its worst day since October 2020. Stocks rebounded on Monday, only to turn downward again on Tuesday.\n*****\n&gt; Wednesday marks the first trading day of the final month of 2021.\n*****\n&gt; Expediting the removal of the Fed’s easy policies tells investors that the central bank is focusing on addressing inflation, instead of new threats from the pandemic.\n*****\n&gt; “Markets appear to be having trouble digesting the combo of elevated uncertainty around the impact of the Omicron variant and a hawkish Fed pivot in the context of persistently elevated inflation,” said Gregory Daco, chief U.S. economist at Oxford Economics.\n*****\n&gt; The new Covid variant, first detected in South Africa, has now been identified in more than a dozen countries, causing many to restrict travel. Denting sentiment on Tuesday, the Moderna CEO told the Financial Times that he expects existing vaccines to be less effective against the new variant.\n*****\n&gt; Stocks wrapped up a volatile month of trading on Tuesday. The Dow lost 3.7% for its second month of losses in three. The S&amp;P 500 fell 0.8%, while the Nasdaq Composite gained 0.25% in November. The Russell 2000 shed 4.3% in November, its worst month since March 2020.\n*****\n&gt; Still, the major averages are up solidly for the year. The Dow is up 12.7% and the S&amp;P 500 is up 21.6% in 2021. The Nasdaq Composite is up an impressive 20.6% this year.\n*****\n&gt; ADP’s private payroll data for November showed 534,000 jobs added in November, above expectations of 506,000\n*****\n&gt; On Wednesday, investors will be evaluating updates on the omicron variant, as well as some key economic reports. November’s Manufacturing PMI, ISM Manufacturing print and October’s construction spending are set to release on Wednesday morning.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/8Kedb0c.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/CZnVYrP.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/XAbNcjb.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/5KwRD2M.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($CRM $ZS $AMBA $NTAP $HPE $BBW $BOX $RY $EMKR $DOOO $GIII $REX $DCI $PDCO $GFS $AIP $VBNK $SDIG)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/lCtopUt.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/o7ET4fR.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/odyatZm.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/rIUTfTU.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/X0CaSOZ.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/paTa9DS.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/6LhmSMe.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/NQh0VqW.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/lNszsgs.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #3!](https://i.imgur.com/TQK2vhS.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #4!](https://i.imgur.com/kZvQYzi.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #5!](https://i.imgur.com/m6LPOsg.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* BYSI\n* REQ.X\n* VXRT\n* NIO\n* AAPL\n* MATIC.X\n* ATNF\n* AERC\n* OP\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/12/01/stocks-making-the-biggest-moves-premarket-salesforce-allbirds-doordash-and-more.html)**)\n\n*****\n\n&gt; **Salesforce** — Shares of the software giant dropped more than 6% in premarket trading despite a better-than-expected third-quarter earnings report. The company’s fourth-quarter guidance missed analysts’ expectations. Salesforce also announced it promoted Bret Taylor to the role of co-CEO, alongside Marc Benioff.\n\n&gt; #**STOCK SYMBOL:** CRM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CRM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CRM)**)\n\n*****\n\n&gt; **Box** — Shares of Box rose more than 9% in early morning trading after the company’s quarterly financial results beat on the top and bottom lines. Box posted earnings of 22 cents per share on revenue of $224 million versus the Refinitv consensus estimate of 21 cents per share on revenue of $218.5 million, according to Refinitiv. The company’s fourth-quarter and full-year revenue and earnings also topped estimates.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise** — Shares of Hewlett Packard Enterprise fell about 2% in the premarket after missing analyst expectations for its quarterly revenue. The company reported revenue of $7.35 billion, below the Refinitiv consensus forecast of $7.38 billion. However, Hewlett Packard Enterprise posted a profit that came in 4 cents per share above consensus.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Ambarella** — Shares of Ambarella surged more than 16% in early morning trading after a better-than-expected quarterly report. The semiconductor company earned 57 cents per share, beating Refinitiv estimates by 8 cents. Revenue came in at $92.2 million versus the $90.3 million expected.\n\n&gt; #**STOCK SYMBOL:** AMBA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMBA)**)\n\n*****\n\n&gt; **Allbirds** — Allbirds shares sunk more than 5% in the premarket after the shoe maker’s losses widened even as its revenue rose from last year. The quarterly report was Allbirds’ first as a public company.\n\n&gt; #**STOCK SYMBOL:** BIRD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BIRD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BIRD)**)\n\n*****\n\n&gt; **Goldman Sachs, Amazon** — Shares of Goldman Sachs and Amazon both moved higher in premarket trading after CNBC reported the bank is unveiling a cloud service for Wall Street trading firms backed by Amazon’s cloud division. The new service is called GS Financial Cloud for Data with Amazon Web Services. Goldman added 0.9% while Amazon gained 1.2%.\n\n&gt; #**STOCK SYMBOL:** GS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GS)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** AMZN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMZN)**)\n\n*****\n\n&gt; **Lennar** — Lennar shares gained more than 4% after an upgrade from Goldman Sachs to a buy rating. Goldman says demand for new homes remains high in the country.\n\n&gt; #**STOCK SYMBOL:** LEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LEN)**)\n\n*****\n\n&gt; **Krispy Kreme** — Shares of Krispy Kreme fell more than 3% in early morning trading after Goldman Sachs downgraded the stock to a sell rating. Rising cost pressures should weigh on the stock, according to Goldman.\n\n&gt; #**STOCK SYMBOL:** DNUT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DNUT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DNUT)**)\n\n*****\n\n&gt; **DoorDash** — Shares of DoorDash gained more than 3% premarket after Gordon Haskett upgraded the stock to buy from hold. The firm said the omicron variant could spark a rebound for the food delivery app as Covid fears flare up.\n\n&gt; #**STOCK SYMBOL:** DASH\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DASH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DASH)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, December 1st, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(12/1) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r6fe5i/121_wednesdays_premarket_stock_movers_news/",
        "created": 1638396047.0
    },
    {
        "author": "AdLegitimate5400",
        "created_utc": 1638520418,
        "id": "r7ui9c",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Wowww! Still amazed at the dramatic drop in $DOCU today. You guys think it will continue to tank tomorrow as well??",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7ui9c/wowww_still_amazed_at_the_dramatic_drop_in_docu/",
        "created": 1638549218.0
    },
    {
        "author": "DrioMarqui",
        "created_utc": 1638504004,
        "id": "r7puww",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "It could be too late for many out there $AMC",
        "url": "https://i.redd.it/bc5kcvd449381.jpg",
        "created": 1638532804.0
    },
    {
        "author": "AllHailHeisenberg",
        "created_utc": 1638494938,
        "id": "r7mt61",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Talking about the video platform Rumble.\n\nhttps://www.sec.gov/Archives/edgar/data/0001830081/000121390021062980/ea151549ex99-2_cfacq6.htm\n\nLittle experts from the link:\n\nRumble, a fast-growing social media business aims to take itself public next year in a SPAC deal that could value the company at over $2 billion.\n\nTo go public, Rumble intends to merge with an investment company initially created by Cantor Fitzgerald, a decades-old Wall Street bank. The deal woud leave Rumble with $300 million in cash, the company said in a statement announcing the transaction on Wednesday evening. It hopes to complete the process by the second quarter of next year.\n\nThe Cantor Fitzgerald investment vehicle, which already trades publicly under the CFVI ticker, saw its shares rise Thursday, increasing by nearly 25% to $12.\n\nRumble, which was founded in 2013, bills itself as a “true neutral platform” but has become a popular site among those who say they unfairly limit speech.\n\n“Rumble is designed to be the rails and independent infrastructure that is immune to cancel culture,” Rumble CEO and founder Chris Pavlovski said a statement. “We are a movement that does not stifle, censor, or punish creativity and believe everyone benefits from access to a neutral network with diverse ideas and opinions.”\n\nRumble exploded in popularity following Trump’s 2020 presidential election loss with its monthly users rising from around 2 million to over 20 million at the end of last year. The site now attracts nearly 40 million such users. An investor prospectus for the SPAC highlights figures such as Dan Bongino, Rep. Devin Nunes, and Glenn Greenwald.",
        "subreddit": "investing",
        "title": "Is there a way to invest in a company that hasn’t gone public yet, but it plans to?",
        "url": "https://www.reddit.com/r/investing/comments/r7mt61/is_there_a_way_to_invest_in_a_company_that_hasnt/",
        "created": 1638523738.0
    },
    {
        "author": "Tiddymilky",
        "created_utc": 1638508473,
        "id": "r7rahz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What app or website does everyone use? Im trying to start and get into it",
        "subreddit": "smallstreetbets",
        "title": "How to start invest?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r7rahz/how_to_start_invest/",
        "created": 1638537273.0
    },
    {
        "author": "Accomplished_Suit651",
        "created_utc": 1638528155,
        "id": "r7wenv",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Step 1: Join WSB. That's it.",
        "url": "https://finance.yahoo.com/news/avoid-capital-gains-tax-155824278.html",
        "created": 1638556955.0
    },
    {
        "author": "Select_University261",
        "created_utc": 1638476563,
        "id": "r7gdnn",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nBEEN THERE SINCE 1.45 sold at 4.30 bought at 6 and now buying as much as I can with leverage\n\nI am new but not new at the same time I suffered great with AMC I been here since last year this is my first post, please don't be mean :)\n\n[Alpine 4 acquires ElecJet and enters lithium and graphene battery manufacturing industry](https://www.youtube.com/watch?v=M9D4d9CKG1M)\n\nAlpine 4 Holdings Inc CEO Kent Wilson and ElecJet CEO Sam Gong joined Proactive to discuss its recent announcement that Alpine has acquired ElecJet/Real Graphene, entering the lithium and graphene battery manufacturing and design. The Phoenix-based tech company and ElecJet are also exploring plans with the State of Indiana to convert its South Bend, Indiana facility into a US battery production facility and bring graphene battery production to the United States.\n\nThis is the bottom line 2.20-2.30 it stopped, now it's bouncing back with all these great news  \nIt would be stupid not to buy at it's lowest point and sell it around 5-7\n\n[https://www.bizjournals.com/phoenix/news/2021/11/24/alpine-4-holdings-prices-24-million-offering.html](https://www.bizjournals.com/phoenix/news/2021/11/24/alpine-4-holdings-prices-24-million-offering.html)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ams8okgiu6381.png?width=1125&amp;format=png&amp;auto=webp&amp;s=18cca978af00eaf4178ba2e8a521341172bc396e",
        "subreddit": "wallstreetbets",
        "title": "I am new but not new at the same time I suffered great with AMC I been here since last year this is my first post, please don't be mean :) I AM SHARING BIG NEWS ALPINE IS ABOUT TO JUMP LIFT OFF",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7gdnn/i_am_new_but_not_new_at_the_same_time_i_suffered/",
        "created": 1638505363.0
    },
    {
        "author": "steelo14",
        "created_utc": 1638460568,
        "id": "r7ahx7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "It seems lots of stock prices are dropping at the moment? Apple, Tesla etc",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7ahx7/it_seems_lots_of_stock_prices_are_dropping_at_the/",
        "created": 1638489368.0
    },
    {
        "author": "Lookafteryou123",
        "created_utc": 1638472728,
        "id": "r7eyeq",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I have 365 shares of Ali Baba at $205 and am losing 30k. Should I sell now or hold onto it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7eyeq/i_have_365_shares_of_ali_baba_at_205_and_am/",
        "created": 1638501528.0
    },
    {
        "author": "SituationLive4406",
        "created_utc": 1638470155,
        "id": "r7dzju",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "New Feasibility Study Announced by U.S. Gold (USAU) at Their CK Gold Project Could Launch the Company to a New Level\n\n**U.S. Gold Corp. (NASDAQ: USAU)** is a gold exploration and development company.\n\nCurrent price $11.14/share (+ 3.4% as of 1:00 P.M. EST 12-2-21)\n\nAfter closing at $10.80/share in Wednesday’s session, USAU shares opened at $11.01 today. The shares reached $11.50 quickly and traded volume in the first 30 minutes was 33K shares.\n\nIn a [press release today](https://finance.yahoo.com/news/u-gold-corp-provides-access-133000423.html), Mr. George Bee, the Company's President, Chief Executive Officer and Chairman, reminded us that the PFS assumes $1,625 per gold ounce and $3.25 per pound for copper, based on a weighted average of historic prices and consensus forward looking price (see PFS for a full explanation). Gold and copper prices today are around $1,800/ounce and $4.25/pound respectively.\n\nAlliance Global Partners, one of the analysts following USAU released the following statement and increased target price today “Increasing Target on Robust CK Gold Project PFS; Feasibility Study and Permitting On-Deck” AGP further outlined their position:\n\nOn December 1, 2021, USAU announced a positive Pre-Feasibility Study (PFS) for its CK Gold Project in Wyoming. In our view, the PFS outlined a robust project featuring low-cost production of over 100,000 gold equivalent ounces per annum over a 10-year mine life. Given the project's production profile of over 100,000 ounces of gold per year, strategic location in the United States, manageable CapEx, and accelerated permitting timeline, we view the CK Project as an attractive asset that warrants development. Further, we note that much of the heavy lifting related to Feasibility level work has already been completed, which should accelerate the project's development timeline. As such, we are reiterating our Buy rating and **increasing our price target to $25.00** from $20.00 per share. Here is a link to the [full analysts report](https://europac.bluematrix.com/sellside/EmailDocViewer?encrypt=384226a3-5f14-49c7-8061-bf580613cd8d&amp;mime=pdf&amp;co=Europac&amp;id=jsekelsky@allianceg.com&amp;source=mail).\n\n**The new feasibility Study is the biggest news, and potential catalyst I’ve ever seen come from this company. I’m keeping in mind that USAU has four gold mining projects and CK Gold is one of them with a Net Present Value of $323M. The company’s market value is under $80M.**\n\nThis new [information about the CK Gold Property](https://www.usgoldcorp.gold/news-media/press-releases/detail/142/u-s-gold-corp-announces-positive-prefeasibility-study) establishes a clear path for a mining operation with a Net Present Value of $323M and an Internal Rate of Return at 39.4%. Those are substantial numbers to achieve for an initial investment of $221M.\n\nWe’ve gotten some technical question about the prefeasibility report from our well-informed members. While [the press release](https://finance.yahoo.com/news/u-gold-corp-announces-positive-141500367.html) goes into substantial detail, we wanted to link the [Technical Report Summary](https://d1io3yog0oux5.cloudfront.net/_f533b074cecd42b4e3eb4ca58d5307a2/usgoldcorp/db/332/2068/pdf/CK+Gold+SK-1300+PFS+TRS+Dec+2021.pdf) provided by USAU as well. I believe any questions regarding the prefeasibility study can be addressed within the technical report. USAU has several geologists and technical advisors on board and while the company drilled the core samples, much of the data presented has been consolidated and verified by outside sources.\n\nThe possibilities for USAU now are encouraging and range from an inflow of money for a mining operation that leads to revenues and a substantial bottom line, to a potential exit to a larger gold miner.\n\n**original report below from 12-2-21 9:00 AM Eastern**\n\n**A just released feasibility study indicates huge potential gold reserves.**\n\nGood day everyone,\n\n**U.S. Gold Corp. (NASDAQ: USAU)** is a gold exploration and development company.\n\nCurrent price $10.76/share (at market close 11-30-21)\n\nIt’s been a while since we talked about a junior gold miner. We’ve talked about USAU before, but it was in January of this year. I wanted to talk about them now to update you about events at the company and because turmoil in the economy can impact gold prices, driving them higher. Higher gold prices usually improve the value of gold miners at all levels.\n\n**Some considerations for USAU:**\n\n38% off 52-week high Copper &amp; gold prices are strong Tiny share structure Analysts indicate 68% to 150% potential upside Fresh PFS with great results\n\nI want to note that [USAU shares](https://stockcharts.com/h-sc/ui?s=USAU) have just broken through their 20 SMA, 50 SMA and 200 SMA of $10.24, $10.19, and $10.54 respectively. With a 52-week high of $17.40/share, a near term breakout may be indicated.\n\nGold is a traditional haven for investors that are uncertain of the near-term fortunes of the economy. I talked to you earlier about moves that the Fed is contemplating to tamp down inflation. Potentially discontinuing the purchase of treasuries and mortgage-backed securities along with the other weapon in the Fed arsenal, raising interest rates. These kinds of Fed actions are designed to slow the economy and may drive investors to increase their gold positions. That is good news for USAU.\n\nThe current price of gold is $1,787/ounce and the 2021 range has been $1,684 - $1,951/ounce.\n\nUSAU presents with a tiny share structure with only 7.09M shares outstanding and 6.76M shares in the float. Insiders hold 13.32% of the outstanding shares and institutions hold 11.79% which seems significant for a development stage company.\n\nThe company has a FYE of April 30th, so they are operating in their Q3 right now. At the end of Q1 (July 31) the company reported cash of $10.7M\n\n8/20/2021 HC Wainwright Reiterated Rating Buy $15.504/8/2021 Alliance Global Lower Price Target Buy $20.00The consensus price target level from the analysts above is $17.75 indicating a possible upside of 65%.\n\nToday I want to outline the company’s flagship property, the CK Gold Project located in Wyoming, just west of Cheyenne. The property comprises about 1,120 acres and is **100% owned by U.S. Gold Corp.** Here’s a link to a [short video](https://www.usgoldcorp.gold/properties/ck-gold-project/overview) about the project.\n\n12-1-21: USAU [just released news](https://finance.yahoo.com/news/u-gold-corp-announces-positive-141500367.html) that it has completed the prefeasibility study (PFS) for the Company's CK Gold Project and has published its SK-1300 Technical Report Summary. A pre-feasibility study determines whether a probable mineral reserve is economically viable and determines whether the reserve can be economically mined. Here are the highlights:\n\nMineral Resources – 1.58 million gold equivalent (\"AuEq\") ounces of Measured and Indicated (M+I) Resources\n\nMineral Reserves – 1.44 million AuEq ounces of Proven and Probable (P1 and P2) Reserves\n\n10-year Mine Life at 20,000 short tons per day process rate\n\nInitial Capital: $221 million\n\nRobust Economics – 39.4% IRR before tax and 33.7% IRR after tax\n\nUpside Potential\n\nPermitting and Development\n\nDevelopment Plan Progress Highlights:\n\n2021 Field Season – a successful field season concluded November 2021\n\nOngoing Test-Work – geochemical, metallurgical for completion in Q1 2022\n\nInterviewing FS and EPCM engineering firm candidates, with RFPs to be submitted\n\nContinued Social and Wyoming Government Outreach\n\nI will do the math. At today’s gold price, the projected gold equivalent reserves at the CK project could be worth as much as $2.6 Billion. Not bad for a company whose market value is only $78M.\n\nEd Karr, the company CEO said, \"Considering the findings of the PFS study in the context of today's metal prices, we seem to be on the precipice of realizing exceptional value from a project whose time has come. We also are intrigued by the upside potential the CK Gold Project holds as we look at the potential value of the aggregate the project can produce at a time when development in the vicinity of the project is increasing.\"\n\nMake no mistake, this is a huge development that may result in a major catalyst for the company’s value. I will have more to add to this report tomorrow.\n\n[Privacy policy and disclaimer](https://mailchi.mp/tradersnewssource/what-type-of-stocks-will-thrive-in-this-environment-650036?e=[UNIQID])",
        "subreddit": "smallstreetbets",
        "title": "This junior gold miner has potentially massive gold reserves with a float of around 6M shares. Trading at less than half of a recently issued $25 price target. NASDAQ $USAU",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r7dzju/this_junior_gold_miner_has_potentially_massive/",
        "created": 1638498955.0
    },
    {
        "author": "kenzene",
        "created_utc": 1638473314,
        "id": "r7f649",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "A New Metric to analyze and predict the future price of stocks is here, whether we like it or not. I am talking about quantified social media sentiments. The more I learn about the correlation of sentiments vs price, the more I see traditional stock signals as insufficient for determining the stock movement, and how insight into social sentiment is critical.\n\n**The core principle underlying technical analysis is that the market price reflects all available information that could impact a market**. But is this true now? I would argue that nowadays, the price of a particular stock also reflects the social media sentiments. For e.g., AMC and GME stocks broke all fundamentals and technicals that the analysts believed to be true and depicted the price what the market sentiments provided.\n\nOver the last year, we had significant growth in terms of retail investors both in stocks and crypto -- now adding up to over 30% of the investor market. Most of them, like myself, joined the market with very limited knowledge on analysis tools. Most of them look for trends on social media to make gains and cut losses. Why? Because it saves time. Following someone else’s footsteps seems a comfortable signal that moves the price of the stock. So then why do the analysis tools still exclude these signals?\n\nAs a curious follower of the market trends, I would say that it is time to come up with a new playbook for stock market analysis. A playbook that breaks down the analysis into three main areas:\n\n1\\] Technical Analysis \n\n2\\] Fundamental Analysis \n\n3\\] Social Signals \n\nand then brings it together to provide insights on the stocks. \n\nCurrently, I have not seen many platforms offer all these services. But some platforms like public, daizy, swaggstocks and alphatrend have started to work around the community aspect of investing. Will the future of fintech products evolve to include social media sentiments as one of the analysis tools is something that we will have to wait and see. But for now, based on what I am reading, it sure seems like we are headed to a future where social media sentiments would be more of a need than a nice-to-know feature.",
        "subreddit": "smallstreetbets",
        "title": "Need for a new PLAYBOOK on stock market analysis",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r7f649/need_for_a_new_playbook_on_stock_market_analysis/",
        "created": 1638502114.0
    },
    {
        "author": "dustensalinas",
        "created_utc": 1638484772,
        "id": "r7jc2c",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "You know you've made it when...  or not ;)  I guess this is technically News flair.\n\nhttps://preview.redd.it/r99i1x7li7381.png?width=473&amp;format=png&amp;auto=webp&amp;s=f87dc681d8907f1c421b9eae2c90953b90acd6c5",
        "subreddit": "wallstreetbets",
        "title": "Apes have taken over the Vanguard News Feed",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7jc2c/apes_have_taken_over_the_vanguard_news_feed/",
        "created": 1638513572.0
    },
    {
        "author": "0ll0",
        "created_utc": 1638485047,
        "id": "r7jfje",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Zillow stock rebounds after company says it is selling houses faster than expected, will rebuy stock with the cash",
        "url": "https://www.barrons.com/articles/zillow-stock-price-homes-sale-share-buyback-51638484329",
        "created": 1638513847.0
    },
    {
        "author": "werewere223",
        "created_utc": 1638553421,
        "id": "r84nt6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is really my first merger, and I was wondering how exactly it works, for those that don't know they're merging with Planet Labs, a SPAC with googles support, and I finally decided to buy some shares. With the merger to be talked about right now, it left me wondering how exactly it's gonna work logistically, do my shares just immediately turn into Planet Labs shares? Or is their something I have to do to get those shares? (New investor so bare with me please)",
        "subreddit": "SPACs",
        "title": "How does a SPAC merger actually work? (DMYQ)",
        "url": "https://www.reddit.com/r/SPACs/comments/r84nt6/how_does_a_spac_merger_actually_work_dmyq/",
        "created": 1638582221.0
    },
    {
        "author": "scootehodg",
        "created_utc": 1638535540,
        "id": "r7ydce",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Money the all mighty. Look I love money but I also hate it. I know pretty much everyone has thought this (I hope) but for fuck sake why are we all chasing(clarify “killing each other over at the worst and just lying to each other at the least”) the crumbs these few humans are ‘letting us have’",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7ydce/money_the_all_mighty_look_i_love_money_but_i_also/",
        "created": 1638564340.0
    },
    {
        "author": "Humble_End_3738",
        "created_utc": 1638557514,
        "id": "r867mo",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "Wallstreetbetsnew",
        "title": "Why I’ll buy PLUG if it falls into mid or low 20s",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/r867mo/why_ill_buy_plug_if_it_falls_into_mid_or_low_20s/",
        "created": 1638586314.0
    },
    {
        "author": "orthonut20",
        "created_utc": 1638529284,
        "id": "r7wovr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Les Wexner Will Step Down as the Chair of the Columbus Partnership. I am sure it has has nothing to do with Ghislaine Maxwell's trial 🙄",
        "url": "https://www.columbusmonthly.com/story/lifestyle/features/2021/12/02/les-wexner-step-down-chair-columbus-partnership/8837395002/",
        "created": 1638558084.0
    },
    {
        "author": "Xavier_Almeida",
        "created_utc": 1638575438,
        "id": "r8cd1o",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "He is saying that i have to pay 10% fee because my account i locked on binance and or trust wallet o i have to pay him 1k for every 10k and the minimum withdrawal rate is 10k is thi a scam or is it true, Because he set my trust wallet to watch only so i any of this true at all before i even bother paying him. also weird how in one month he went from 400$ to 40k doing day trade he has showed me his license and on [**https://www.investor.gov/**](https://www.investor.gov/) **just wondering if this is true at all or if im being scammed thanks for your time**",
        "subreddit": "stocks",
        "title": "Just a quick question about an IA im working with",
        "url": "https://www.reddit.com/r/stocks/comments/r8cd1o/just_a_quick_question_about_an_ia_im_working_with/",
        "created": 1638604238.0
    },
    {
        "author": "omg_send_help",
        "created_utc": 1638579319,
        "id": "r8dm05",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Like I know that it's not always possible to have 20,000% gains or whatever but I keep seeing stuff like that here and I would like to experience some of this good stuff for myself in my life at least once. So any and I'll help would be greatly appreciated.",
        "subreddit": "wallstreetbets",
        "title": "I keep seeing everyone's a massive gains on the drop of DOCU. How the heck did everyone seem to know that this thing is going to drop so hard? Or was it all just a bunch of random stuff that just happened to be lucky. Anyone? Guys please help because I'm so sick and tired of being so broke!!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r8dm05/i_keep_seeing_everyones_a_massive_gains_on_the/",
        "created": 1638608119.0
    },
    {
        "author": "10xwannabe",
        "created_utc": 1638574435,
        "id": "r8c16a",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Seems this week has shaken a few investor so thought it would be a great time to review \"How to decide on your asset allocation\".\n\n**What is asset allocation?**  It is you mix of:  Stocks/ bonds/ cash/ alternative investments.  Each of those are \"super asset\" classes.  That means they are fundamentally different then another one when it comes to return/ risk/ correlation coefficients (how one zigs when others zag).  \n\n**Why is it important?**  Asset allocation is how one controls risk in your portfolio.  Early on folks spend a lot of time thinking about return, but as you learn about investing (via books/ financial theory and frankly your own experience) you realize focusing on controlling risk is MORE important.  It is more under control unlike returns..  There was a landmark paper published several years ago basically stating, 90% of all short term volatility is related to asset allocation.  It is one of the fundamental ways an investor has to limit volatility (standard deviation of returns).\n\nThis decision on asset allocation is by FAR the single most important decision an investor will make.  Harry Markowitz (father on modern portfolio theory) won a Nobel Prize in 1994 based on his work on the matter.  So yeah it is pretty important.\n\nSo lets get started...\n\nA lot of the below is an amalgam of different folk's opinions.  A good spot to start comes from:  Larry Swedroe (well known financial author) wrote (paraphrasing):  Your asset allocation is decided by one's willingness, ability, and need to take risk.  \n\n**Willingness** to take risk is based on how much your stomach can handle volatility (market going down). Easy rule of thumb is to assume your portfolio can drop in any given year 50% by the amount dedicated to stocks. For example, if you have a $100k portfolio and are 80/20 (stocks/ bonds) assume you can lose 40% in an given year. So if this is you, don't be surprised if your portfolio drops to $60k (loss of 40k) at any given year.  If that is TOO MUCH for you to handle you need to dial down the amount dedicated to stocks.\n\n**Need** to take risk is how much return you need to get to your \"number\". That is hard for any young investor to figure out as they are YEARS away from retirement. If you are closer to retirement look through your last couple of years of spending and figure out your \"number\" per year needed. Then, take that number and subtract out SS+ any pensions+ any annuity from your \"number\". That delta needs to be covered by your personal investments. Then, figure out how much you will need to return so you can take out 4%/ year to meet that \"number\". Trinity study give a basis of the 4% which would have worked as well through the worst stretch in U.S. history (70's) so good enough to use.\n\n**Ability** to take risk is all based on your:  Need for liquidity while that money is invested, stability of job. and time horizon. \n\n1.  Liquidity means only invest money you don't need until the end of the time horizon you are investing. If you are getting married, buying house, saving for retirement then EACH should have a different asset allocation as they all have different time horizons.  This is why it simply does NOT matter what happens until that time horizon is up since you don't need access to that money until then end of that specific time horizon. \n2. Stability of job is a BIG one that no one thinks about. I would say there are more folks with the stomach to handle volatility then there are folks who have a stable job that would allow them to handle the volatility. If the market crashes folks may be okay with losing large sums of money during a bear market, BUT the issue is businesses usually contract during these times which means you get fired at the same time. That means you have to dip into your investments to live off the SAME time your investments are at lows. This can be protected by having a emergency fund of 6M- 1yr if one has a unstable career IF you are going to be heavy in stocks or 3-6m EF for more balanced asset allocations.  Unless you are a doctor, tenured teacher, government worker, etc.. you will likely get fired at some point in your life (usually at the worst possible time) so be prepared for it with your investing plan ahead of time. \n3. Time horizon... below is a quick table for the MAX asset allocation based on different time horizons... Money needed in...\n\n0-2 years: 100% cash\n\n2-4: 20/80 (s/b)\n\n4-6: 40/60\n\n6-8: 60/40\n\n8-10: 80/20\n\n10+ years: 100% stocks\n\nI Hope some of this helps in figuring out a more systematic way to decide how much risk (usually equity risk) one should take on based on their own circumstance.",
        "subreddit": "investing",
        "title": "Basics of picking asset allocation that fits you...",
        "url": "https://www.reddit.com/r/investing/comments/r8c16a/basics_of_picking_asset_allocation_that_fits_you/",
        "created": 1638603235.0
    },
    {
        "author": "LastPotato1214",
        "created_utc": 1638564705,
        "id": "r88txi",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "NFNT-U not split yet.  1/2 Warrant per at $10.1.\n\nInversed the SEC on their celeb alert.\n\nhttps://www.sec.gov/oiea/investor-alerts-and-bulletins/celebrity-involvement-spacs-investor-alert\n\nThrew $10k at it, figure it'll meme, warrant ratio / promote aren't special.  Really not my normal pre DA hold here.\n\n[Link to the S1](https://www.sec.gov/Archives/edgar/data/1862327/000114036121036298/nt10026927x2_s1.htm)\n\n**Meme Potential**\n\n* This is Kevin Durants Spac\n* Sounds like NFT (this is all the DD most will do)\n* Potential Crypto (mentions Blockfi, Kraken, Blockchain.com)\n\n**Not all meme though, solid connects**\n\n[thirtyfiveventures.com/investments](https://thirtyfiveventures.com/investments) Kevin Durant and Rich Kleiman have a better than expected track record here... Coinbase, Hood, Seatgeek, Acorns were some big public ones. some others are still private that I've actually heard of; Rally (NFT Marketplace), Dutchie, Postmates, Alt (Sports cards Marketplace)), Pieology, and the Recount.\n\n&amp;#x200B;\n\n**OUR FOCUS**\n\nThe below represent examples of our thematic areas of focus, by no means exclusively, many of which are experiencing accelerated digital transformation:\n\n•**Sports**: We watch, consume and participate in sports largely in the same ways we have for decades, and all that has really changed is the screen size. Few sectors can match that claim. Generational change and technology have long knocked on the door of sports transformation and are now breaking through. Personalized streaming, augmented reality, e-sports, sports betting, biometric access, omnichannel events blurring in-home and live experiences, AI-powered analytical tools and block-chain applications are just a few examples of more bespoke approaches to engaging and retaining consumers that seek a differentiated experience. We believe this is an exciting moment for this massive global industry and one that will lend itself to incredible acquisition opportunities.\n\n•**Health &amp; Wellness**: With the COVID-19 pandemic rapidly accelerating shifts towards telehealth in all categories, individuals have shown they want to be led by instructors, doctors, and subject matter experts on almost every choice they make, and they expect the same frictionless ease and connectivity they experience in other categories. Just as mobile devices and cloud computing technology have empowered on-demand transactions in sectors like video (Netflix), music (Spotify), transportation (Uber), sports betting (FanDuel, DraftKings), and insurance (Lemonade), mental health (Calm, Headspace), digital health (Peloton, Oura, Whoop- a Thirty Five and LionTree investment), and wellness (Noom) are the next industries to be completely digitized. The traditional healthcare vertical is poised for digital transformation as well, with growing levels of investment and maturation in the space, from the IPOs of Oscar Health (LionTree acted as co-manager and investor), GoodRx and Amwell, to the merger of Teladoc and Livongo, to the acquisition of hims &amp; hers by the Oaktree Acquisition Corp SPAC in a go-public transaction (LionTree advised hims &amp; hers management).8\n\n•**Food Tech &amp; Supply**: Increased focus on personal health, animal welfare, and climate change have driven companies to harness technology to create more sustainable food products and production processes. Consumers want better options to achieve more sustainable consumption patterns, even if those alternatives are more expensive. Early pioneers such as Beyond Meat and Impossible Foods popularized plant-based meat substitutes. Companies like Seebo and Winnow have developed simple integration tools to help food manufacturers and restaurants control food waste along the manufacturing production line.\n\n•**E-Commerce**: Tremendous energy and investment are devoted to how the intersection of retail, distribution and media might look in the future. Digital-first, direct-to-consumer platforms have flourished by focusing on a specific market segment, rethinking the consumer experience, and building community around their brand. Some examples include Warby Parker (eyewear), Harry’s (personal care), Chewy (pets), Thrive Market (organic grocery), Wayfair (home decor), and Kaval and Rent The Runway (beauty/fashion/apparel) and Gucci (Luxury).\n\n•**Crypto and Digital Assets**: The recent acceleration of crypto and digital assets as frictionless tools for the consumer continues to gain tremendous momentum with the rise of platforms like Coinbase, Kraken, Chainalysis, BlockChain.com and BlockFi or security solutions for crypto assets, such as hardware wallet technologies developed by Ledger. These technologies make the internet ownable, providing new ways to reward and compensate creators for their work allowing unbound creativity, and driving toward the emergence of potentially massive new platforms to harness this democratization of scarcity. We have witnessed heightened demand for the ability to ‘purchase’ or ‘own’ pieces of art (SuperRare), content collectibles (Dapper Labs), game collectibles (Axie Infinity), real estate (Decentraland) and much more – all of which is uniquely enabled by the blockchain. Consumers have been empowered to invest directly in athletes’ performance (Sorare), artists (Beeple), and creators (Rally, Mirror), past or present. We believe these non-fungible tokens (NFTs) will enable greater liquidity for previously illiquid assets and reflect the nearly unimaginable scaling that the internet enables.",
        "subreddit": "SPACs",
        "title": "NFNT.UT Kevin Durants spac...",
        "url": "https://www.reddit.com/r/SPACs/comments/r88txi/nfntut_kevin_durants_spac/",
        "created": 1638593505.0
    },
    {
        "author": "Tryandtryagain123",
        "created_utc": 1638586094,
        "id": "r8fqaz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SPACs",
        "title": "How it feels watching everyone get rich off DWAC and CFVI…",
        "url": "https://i.redd.it/3qziycu7wf381.jpg",
        "created": 1638614894.0
    },
    {
        "author": "JonRogers1",
        "created_utc": 1638584488,
        "id": "r8f8sa",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Citadel Securities' systemic risk problem: They still haven't covered their GME/AMC short positions shhhhh (hush) and it gets worse....",
        "url": "https://www.linkedin.com/pulse/citadel-securities-systemic-risk-problem-still-havent-a-p-",
        "created": 1638613288.0
    },
    {
        "author": "thainfamouzjay",
        "created_utc": 1638561930,
        "id": "r87to9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi\nAs the title says I'm looking for the best stock or fund to save money for a year. Banks only offer like 1% or less so I want to stay away and find something that is at least 5%? \n\nThis money will most likely go towards my taxes next year since I've been working a 1099 and need to file my own taxes. \n\nWould I be safe putting it into SPY? I would like to stay away from cryptocurrency or anything that makes crazy swings. Again this is just to save money for my taxes until next year and hopefully make a bit of money in the mean time.",
        "subreddit": "investing",
        "title": "Best stock or fund to save money for a year",
        "url": "https://www.reddit.com/r/investing/comments/r87to9/best_stock_or_fund_to_save_money_for_a_year/",
        "created": 1638590730.0
    },
    {
        "author": "Flashy-Echo-8099",
        "created_utc": 1638433872,
        "id": "r72uq7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I Hope it brings inner peace to someone.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r72uq7/i_hope_it_brings_inner_peace_to_someone/",
        "created": 1638462672.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638451324,
        "id": "r77cli",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to a new day, frrrrrrrresh start! Here are your pre-market stock movers &amp; news on this Thursday, December 2nd, 2021-\n\n*****\n\n# [Dow futures rise 100 points as travel stocks get boost following omicron sell-off](https://www.cnbc.com/2021/12/01/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Dow futures rose in early trading Thursday despite the arrival of the latest Covid variant on U.S. shores and as the White House tightened travel restrictions.\n*****\n&gt; Futures contracts tied to the Dow Jones Industrial Average gained 120 points. S&amp;P 500 futures were flat and Nasdaq 100 futures dipped 0.4%.\n*****\n&gt; The Biden administration reacted to the news that an omicron case had been reported in California by asking businesses to proceed with vaccination requirements, even though the administration’s mandate was halted in courts pending review. The White House also tightened travel rules, requiring inbound passengers to be tested within 24 hours prior to departure.\n*****\n&gt; Airline, casino and energy stocks led the gainers in premarket trading.\n*****\n&gt; Dow component Boeing’s shares jumped 3.6%, cruise line Royal Caribbean was up 3.6% while MGM Resorts International moved 2.7% higher, with Covid-sensitive companies benefitting amid early evidence showing the new strain may be less severe than earlier versions.\n*****\n&gt; “We remain cautious on S&amp;P 500 amid a hawkish Fed tightening into an overvalued market,” said Savita Subramanian, Bank of America Securities head of U.S. equity &amp; quantitative strategy.\n*****\n&gt; Still, Bank of America noted that December has historically been the strongest month for the S&amp;P 500, with the average gaining 2.3% on average since 1936 and positive 79% of the time. However, December has not always been immune to sell-offs, Subramanian added.\n*****\n&gt; “Another risk is an inflation-led consumption hit, especially as fiscal/monetary stimulus run out. Fed Chair Powell’s comments on accelerated tapering and retiring the word ‘transitory’ indicate that the Fed’s focus is now inflation rather than employment.\n*****\n&gt; During regular trading on Wednesday, stocks posted strong gains earlier in the session, but fell on news that the first omicron case had been reported in California. The Dow fell about 460 points, after the 30-stock benchmark had advanced 521 points. The S&amp;P dipped 1.18%, giving back an earlier gain of about 1.9%. The Nasdaq Composite slid 1.83%, after earlier trading 1.8% higher.\n*****\n&gt; “Investors are increasingly cautious about the Omicron variant as well as the likelihood of faster tapering,” TD Securities said in a note to clients.\n*****\n&gt; Wednesday’s whipsaw continues a highly volatile streak for stocks as the market digests what the new variant means.\n*****\n&gt; “We’ve seen this movie before and Wall Street will likely remain COVID-variant headline driven until a clear assessment over this wave can be made,” said Ed Moya, senior market analyst at Oanda. “The next couple of weeks will likely see risk appetite take a cue from incremental Omicron updates, supply chain issues, and every inflation reading,” he added.\n*****\n&gt; On the data front, weekly initial jobless claims numbers will be released Thursday at 8:30 a.m. ET. Economists are expecting a print of 240,000, according to estimates from Dow Jones. The prior reading showed 199,000 first-time filers, which was the lowest since November 1969. The November jobs report will be released on Friday.\n*****\n&gt; Thursday’s reading follows a better-than-expected ADP report on Wednesday. Private payrolls increased by 534,000 in November, ahead of the expected 506,000.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/lcmXJqv.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/s3ioTNr.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/p6nFjhw.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/5KwRD2M.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($DG $KR $EXPR $SIG $TD $VERU $GMS $DLTH $CM $LE $SCWX $EH $MEI)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/C4kn8oK.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/XAPdoyp.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/P3xLOTx.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/G1tGjkp.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/8154yxP.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/830rtCF.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/5SsP6hb.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/Vwv5b34.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #3!](https://i.imgur.com/21JATCM.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* AAPL\n* DWAC\n* BA\n* ABUS\n* AMC\n* ADA.X\n* CFVI\n* CMMB\n* AGC\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/12/02/stocks-making-the-biggest-moves-premarket-snowflake-boeing-apple-and-more.html)**)\n\n*****\n\n&gt; **Snowflake** — The cloud data company’s shares jumped more than 13% after the company reported quarterly results that beat revenue estimates. Snowflake also reported sales of $334 million during the third quarter, which exceeded the $306 million expected by analysts surveyed by Refinitiv.\n\n&gt; #**STOCK SYMBOL:** SNOW\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SNOW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SNOW)**)\n\n*****\n\n&gt; **Boeing** — Shares of the aircraft maker rose 4.4% after China’s aviation regulator cleared the Boeing 737 Max to return to flying on Thursday. That model was grounded for more than two years worldwide after two fatal crashes.\n\n&gt; #**STOCK SYMBOL:** BA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BA)**)\n\n*****\n\n&gt; **Signet Jewelers** — Shares of Signet Jewelers gained about 3% in the premarket after the company posted a better-than-expected earnings report. Signet notched a profit of $1.43 per share, 71 cents higher than the Refinitiv consensus estimate. Revenue also came in higher than projected. Signet raised its fiscal 2022 guidance.\n\n&gt; #**STOCK SYMBOL:** SIG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SIG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SIG)**)\n\n*****\n\n&gt; **Apple** — Shares of Apple fell 3% after the company told some of its suppliers there could be slowing demand for iPhone 13 models, according to a report by Bloomberg. It previously expected the reduction in its initial production goal to be made up in 2022 but said that may not materialize now.\n\n&gt; #**STOCK SYMBOL:** AAPL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAPL)**)\n\n*****\n\n&gt; **Five Below** — The retailer’s shares gained more than 9% after reporting quarterly results that beat on both earnings and revenue. It also reported an increase in comparable-store sales of 14.8%, smashing the estimates of 5.3%, according to Refinitiv.\n\n&gt; #**STOCK SYMBOL:** FIVE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FIVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FIVE)**)\n\n*****\n\n&gt; **Okta** — Shares of the identity company added 2.5% following the company’s quarterly results. Okta brought in a quarterly loss of 7 cents per share, which is narrower than the 24 cents per share loss estimated by analysts. It also beat revenue estimates and issued fourth-quarter guidance above estimates.\n\n&gt; #**STOCK SYMBOL:** OKTA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OKTA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OKTA)**)\n\n*****\n\n&gt; **Lands’ End** — Lands’ End saw its shares sink more than 14% in early morning trading after reporting lower-than-expected third-quarter revenue. The apparel retailer posted revenue of $375.8 million versus the StreetAccount consensus estimate of $398 million. Lands’ End earned 22 cents per share, in line with projections. The company also issued fourth-quarter earnings and revenue guidance below expectations.\n\n&gt; #**STOCK SYMBOL:** LE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LE)**)\n\n*****\n\n&gt; **Dollar General** — Dollar General shares fell 1.7% after the company revealed plans to open 1,000 Popshelf stores by the end of the 2025 fiscal year. The vision for Popshelf, aimed at wealthier suburban shoppers, was announced a year ago. There are currently 30 Popshelf stores in six states.\n\n&gt; #**STOCK SYMBOL:** DG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DG)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Thursday, December 2nd, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(12/2) Thursday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r77cli/122_thursdays_premarket_stock_movers_news/",
        "created": 1638480124.0
    },
    {
        "author": "No_Button6150",
        "created_utc": 1638436918,
        "id": "r73jr7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello readers!\n\nI am an 18 year old who recently graduation high school. I have recently secured a 6 month Tafe course to study being a wardsman for a hospital. I’ve been investing since I turned 18 and I have around $2000 invested. This includes S&amp;P500, Crypto, and a variety of other stocks. I currently live with my mother, girlfriend and sister. My girlfriend and I pay my mum $400 a month to contribute to bills, and my girlfriend and I have around $150 in monthly bills, this includes Phone Bills, Spotify, Etc.\n\nI just want to be financially free and invest so I don’t have to work till i’m 65. I’m finding it hard to find the balance between putting money into investments and spending money on myself. I make around $2.5k Per month with my job at the moment. Please give me any recommendations or suggestions! Thanks for listening.",
        "subreddit": "investing",
        "title": "18 and don’t know what to do from here.",
        "url": "https://www.reddit.com/r/investing/comments/r73jr7/18_and_dont_know_what_to_do_from_here/",
        "created": 1638465718.0
    },
    {
        "author": "dashdevs",
        "created_utc": 1638439762,
        "id": "r748y6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi!\n\nCan you please name any factors that can negatively affect [investment](http://dashdevs.com/blog/10-market-factors-it-businesses-shouldn-t-ignore-for-2022/?utm_source=reddit&amp;utm_medium=article) in the coming 2022 year? What are the factors? There are a few obvious ones like inflation, the pandemic, digitalization, economic growth, or government policy. What else to keep in mind? And how 2022 is going to be different in terms of investing in comparison with 2021? Any ideas?\n\nThanks for sharing your ideas!",
        "subreddit": "investing",
        "title": "What to keep in mind when investing in 2022?",
        "url": "https://www.reddit.com/r/investing/comments/r748y6/what_to_keep_in_mind_when_investing_in_2022/",
        "created": 1638468562.0
    },
    {
        "author": "TreeHugger42O",
        "created_utc": 1638454522,
        "id": "r78e5h",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Here is an example where you invest 10K into 4 different ETFs with various expense ratios, but how much you put into each ETF varies.\n\nSo let's say the 4 expense ratios of the ETFs are .04, 0.12, 0.2, 0.5\n\nAnd 50% of that is in 0.04, 20% is in 0.12, another 20% in 0.2, and 10% in 0.5\n\nIf you add them all together, you get 0.86% expense ratio. But this weight is not even, so what is the proper way to figure out, I suppose, what the total weighted expense ratio would be? Would it be an average? I'm not sure how the math would work.",
        "subreddit": "investing",
        "title": "How is total weighted expense ratio calculated?",
        "url": "https://www.reddit.com/r/investing/comments/r78e5h/how_is_total_weighted_expense_ratio_calculated/",
        "created": 1638483322.0
    },
    {
        "author": "gunnaisbetter",
        "created_utc": 1638421654,
        "id": "r6zify",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Just turned 18, have spare cash and want to learn how to use it effectively",
        "url": "https://www.reddit.com/r/investing/comments/r6zify/just_turned_18_have_spare_cash_and_want_to_learn/",
        "created": 1638450454.0
    },
    {
        "author": "Inthermal-djt9",
        "created_utc": 1638420552,
        "id": "r6z5j7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello, I am entering the stock market for the first time with 100$, I'm aware that thats not that much but I dont have that much to invest. I was wondering if there is anything to know about investing/trading stocks. I was going to invest 100% of it into AMC but any other suggestions?\n\n\n\nAlso, a few questions,\n\nIs it better to have all of your money in one stock or multiple stocks?\n\nShould I use robinhood for a stock manager or a different app, or does it matter?\n\nThank you\n\n\n\n\n(also why does visual mod keep removing posts)",
        "subreddit": "wallstreetbets",
        "title": "I am new to the stock market, any tips?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6z5j7/i_am_new_to_the_stock_market_any_tips/",
        "created": 1638449352.0
    },
    {
        "author": "RobertKesselring",
        "created_utc": 1638405703,
        "id": "r6u5rj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Question 1: Suppose I buy 100 shares of XYZ at $20, Then later, I buy another 100 shares at $10. The price goes back up to $16, and I sell all 200 shares. Does the IRS count this as a $200 gain? Or does it count it as a $600 gain and a $400 loss? Would I run afoul of the wash sale rule if I re-purchased the same stock within 30 days?\n\nQuestion 2: Suppose I buy 100 shares of ABC at $100, then sell at $90 for a loss of $1000. If I re-purchase ABC within 30 days, I can count that $1000 as part of my cost basis (if I understand correctly), but what if I buy a smaller number of shares? Suppose I buy back 10 shares of ABC at $90. Is my cost basis on that 10 shares $1900? Or can I only use 1/10 of the loss because I only bought back 1/10 of the shares, making my cost basis $1000? Or is there some other way that it's calculated?",
        "subreddit": "investing",
        "title": "Wash Sale Rule and Disallowed Loss questions",
        "url": "https://www.reddit.com/r/investing/comments/r6u5rj/wash_sale_rule_and_disallowed_loss_questions/",
        "created": 1638434503.0
    },
    {
        "author": "MelinMetaMan13",
        "created_utc": 1638410011,
        "id": "r6vmpo",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Wanna see where your hard earned investment money is going of your favorite stocks via naked shorting, look no further!Pass it on!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6vmpo/wanna_see_where_your_hard_earned_investment_money/",
        "created": 1638438811.0
    },
    {
        "author": "jj456___",
        "created_utc": 1638411148,
        "id": "r6w0u1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Muscle maker grill is pretty much a health conscious eaters chipotle. Since ipo debut in 2020, they have fallen from 5$ to 1$ leaving them with a measly market cap with $19m, leaving it a plethora of room to run.\n\nIn the last two quarters, they have decimated their earnings (both 190%+ beats averaging to Quarterly Revenue Growth (yoy)**190.70%** along with acquiring a rapidly growing poke company named Pokemoto. They have focused on expanding muscle maker grill into much more cost efficient methods focusing on Ghost Kitchens and on military bases while rapidly growing the franchise locations on Pokemoto. This in turn has given them much better margins as well as much more business overall.\n\nSo long as they can clean up some of the debt on their balance sheet, the rapid growth and them trading at about 2.4x revenue seems like a no brainer on why this one might be able to run rampant and is a low risk very high reward play here. 18m outstanding shares and such a low market cap makes this a very attractive play so long as they keep up this growth",
        "subreddit": "pennystocks",
        "title": "Why I think $GRIL can reasonably 10x",
        "url": "https://www.reddit.com/r/pennystocks/comments/r6w0u1/why_i_think_gril_can_reasonably_10x/",
        "created": 1638439948.0
    },
    {
        "author": "Glittering-Skill9177",
        "created_utc": 1638417985,
        "id": "r6ycbn",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "As the President states: \"This company is a hidden gem in the Men's health market space.\"\n\n**The Global ED Drugs Market is Forecast to Grow to $4.7B by 2026!!!**\n\nPetros Pharmaceuticals sells Stendra - Patented and Trademarked prescription Erectile Dysfunction (ED) drug\n\nAiming to be THE FIRST Over-the-counter ED drug! \n\nThis would be a massive move to take over the majority of the ED market! \n\nSmall Cap Conference:\n\n[https://youtu.be/KjTzzUHmUZo](https://youtu.be/KjTzzUHmUZo)\n\nThe video above really helps to give a fantastic overview of how Petros will be revolutionizing the Men's Health Sector.\n\n&amp;#x200B;\n\nPTPI is a Low-Float Bio-Tech company is a large institutional investor base:\n\nPetros Pharmaceuticals Inc. (NASDAQ:PTPI)’s Major holders\n\nUpon looking at major shareholders, it appears that insiders hold 48.95% of Petros Pharmaceuticals Inc. shares, and 9.01% of them are in the hands of institutional investors. The stock currently has a share float of 17.65%. Petros Pharmaceuticals Inc. stock is held by 22 institutions, with Shay Capital LLC being the largest institutional investor. By Sep 29, 2021, it held 2.11% of the shares, which is about 0.28 million shares worth $0.56 million.\n\nNorthrock Partners, Llc, with 0.88% or 0.12 million shares worth $0.23 million as of Sep 29, 2021, holds the second largest percentage of outstanding shares.\n\n**The Director's total holding is 5,557,771 shares.**\n\n**\"The market value of the direct and indirect holding, based on the transaction price, is approximately $16,673,313.\"**\n\n **About Petros Pharmaceuticals**  \nPetros Pharmaceuticals is committed to the goal of becoming a world-leading specialized men's health company by identifying, developing, acquiring, and commercializing innovative therapeutics for men's health issues including, but not limited to erectile dysfunction, endothelial dysfunction, psychosexual and psychosocial ailments, Peyronie's disease, hormone health and substance use disorders. \n\nNearly 30 million men across the US experience ED.\n\n\" The Company recently undertook a relaunch of Stendra®, generating gross revenues of **approximately $30 million in 2019**. Petros intends to accelerate the relaunch of Stendra® with a well-funded commercial organization and refocused strategy. \"\n\n Petros Pharmaceuticals, Inc. Through Exclusive Marketing Agreement with Hims &amp; Hers Health, Inc. Generates 476% Year-Over-Year Growth of STENDRA Tablet Sales\n\nThis is the tip of the ICEBERG! The more I research, the more I find that this is a SLEEPING GIANT!",
        "subreddit": "pennystocks",
        "title": "$PTPI - So much to this company, Let's Dive In - Part 1",
        "url": "https://www.reddit.com/r/pennystocks/comments/r6ycbn/ptpi_so_much_to_this_company_lets_dive_in_part_1/",
        "created": 1638446785.0
    },
    {
        "author": "callsmeal",
        "created_utc": 1638418308,
        "id": "r6yg7n",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Bloomberg\n\nDeals\n\nHotel Platform Selina Agrees to Go Public Via Boa SPAC Deal[Bloomberg Article Link](https://www.bloomberg.com/news/articles/2021-12-02/rental-platform-selina-said-to-be-going-public-via-boa-spac-deal)\n\nBy \n\nCrystal Tse\n\n\nDecember 1, 2021, 8:00 PM CSTUpdated on December 1, 2021, 8:32 PM CST\n\nCombined company is set to have value of $1.2 billion\n\nMerger transaction includes a $70 million equity placement\n\nHotel platform Selina has reached a deal to go public through a merger with blank-check company Boa Acquisition Corp., according to people with knowledge of the matter.\n\nThe combined company will be valued at $1.2 billion, the people said, asking not to be identified discussing private information. The transaction includes a $70 million equity placement from South Light Capital, MORE Investment House and Ronald Cohen, co-founder of Apax Partners, the people said.\n\nThe agreement is expected to be announced as soon as Thursday, the people said.\n\nRepresentatives for Selina and Boa declined to comment.\n\nFounded by Rafael Museri and Daniel Rudasevski, London-based Selina targets Generation Z and Millennial travelers. It operates vacation rentals as well as co-working spaces in what it calls “buildings with character,” according to its website, which also advertises wellness and other events that are hosted at its locations.\n\nThe company targets non-traditional travel destinations picked by locals. In addition to the U.K. and U.S., countries with Selina locations include Portugal, Mexico, Costa Rica, Colombia, Panama and Brazil, among others, its website shows.\n\nBoa raised $230 million in its February initial public offering. It had a mandate to find businesses that provide technology solutions to the real estate industry, the special purpose acquisition company said in its listing document.\n\nThe combined company will operate as Selina Hospitality Plc, with its shares listed on the New York Stock Exchange under the symbol SLNA, the people said.",
        "subreddit": "SPACs",
        "title": "BOAS - Selina to merge with BOA Spac",
        "url": "https://www.reddit.com/r/SPACs/comments/r6yg7n/boas_selina_to_merge_with_boa_spac/",
        "created": 1638447108.0
    },
    {
        "author": "Garpcui",
        "created_utc": 1638404530,
        "id": "r6tqc3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Don't let it fool you!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6tqc3/dont_let_it_fool_you/",
        "created": 1638433330.0
    },
    {
        "author": "Lennon74",
        "created_utc": 1638368843,
        "id": "r6fycc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "$10 in free Bitcoin - Give it a try!",
        "url": "https://www.reddit.com/r/investing/comments/r6fycc/10_in_free_bitcoin_give_it_a_try/",
        "created": 1638397643.0
    },
    {
        "author": "SayNoToYourself",
        "created_utc": 1638384515,
        "id": "r6lz2g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I feel like I may have to yolo BARK ?.....I'm aping it like I fomo AMC and gamestop",
        "url": "https://post.bark.co/products/barkbox-theme-reveal-december-2021/",
        "created": 1638413315.0
    },
    {
        "author": "CharacterGap4523",
        "created_utc": 1638390794,
        "id": "r6oezq",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "Wallstreetbetsnew",
        "title": "$PHIL otc ticker is the opportunity of a Lifetime, it will go from .01 cent its actually under a penny to Surpass $1.00 MARK THIS POST! GO BUY AS MUCH SHARES AS U CAN, &amp; THANK ME LATER BIG MONEY 💰 HERE $PHIL",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/r6oezq/phil_otc_ticker_is_the_opportunity_of_a_lifetime/",
        "created": 1638419594.0
    },
    {
        "author": "REITgrass",
        "created_utc": 1638387751,
        "id": "r6n87o",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "LAKEWOOD RANCH, FL / ACCESSWIRE / December 1, 2021 / Frank Murtha, President and CEO of Major League Football, Inc. (OTC PINK:MLFB) announced today that it had sold a Convertible Senior Note coupled with Warrants for 15,000,000 shares at .03 cents and 10,000,000 shares at .035 cents per share to an institutional investor. The transaction supports the plan to conduct a 2022 playing season beginning with training camp in Lakewood Ranch, FL in April 2022. The transaction closed on November 29th, 2021. Murtha also announced that the search for new and expanded corporate offices in Lakewood Ranch, FL is underway. This facility will house League executives and key staff. MLFB is simultaneously evaluating office space and facilities in its franchise cities.\n\nMLFB's next Quarterly Filing is due December 15, 2021",
        "subreddit": "smallstreetbets",
        "title": "$MLFB Announces Closing of New Financing",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r6n87o/mlfb_announces_closing_of_new_financing/",
        "created": 1638416551.0
    },
    {
        "author": "afewfatkids",
        "created_utc": 1638386266,
        "id": "r6mnz3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Already has 2x float rotation today, 8% SI, promising news and high expectations, and lots of eyes on it. Seems like a potential monster if shorts start covering by end of the day today.\n\nI think the near future of this stock will look something like the bottom chart shown here https://imgur.com/a/Uk7xCqx (ARDX is shown in the top photo) once the momentum shifts back to bullish if we get some heavy buy and cover volume at the end of today.",
        "subreddit": "smallstreetbets",
        "title": "$ARDX parabolic move soon?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r6mnz3/ardx_parabolic_move_soon/",
        "created": 1638415066.0
    },
    {
        "author": "AdministrativeEnd959",
        "created_utc": 1638397400,
        "id": "r6r0jo",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "Wallstreetbetsnew",
        "title": "Thoughts on inflation and the fed? Is it really comparable to 2008?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/r6r0jo/thoughts_on_inflation_and_the_fed_is_it_really/",
        "created": 1638426200.0
    },
    {
        "author": "Outrageous_Bat8429",
        "created_utc": 1638393890,
        "id": "r6pmo5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There seemed to be unlimited potential. “Good fundementals!” is what everyone kept saying. “It has to re-bound soon!” I read everywhere. But UP Fintech (TIGR) continued to make new lows each week. I saw each 5-10% drop as an opportunity to average down. Now I’m holding almost 2,000 shares at $12.74 and there’s still no bottom to be seen. Maybe the next support is at $0. “Be greedy when others are fearful” is my motto, or rather, my rationale to dollar cost average in case of this being the next short squeeze. It’s crazy how well the sunk cost fallacy can encourage you to make long-term horrible decisions. I’m not in debt and am no where near retirement, but damn...do I wish I bought $NVIDIA.",
        "subreddit": "wallstreetbets",
        "title": "Tied up half my net worth in a Chinese Fintech company that is now going to zero",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6pmo5/tied_up_half_my_net_worth_in_a_chinese_fintech/",
        "created": 1638422690.0
    },
    {
        "author": "the1whowalks",
        "created_utc": 1638371920,
        "id": "r6h39a",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Somewhat explained by title, but for a little more detail and my investment horizon: \n\n1) **Current allocation:** 9k in Vanguard, 3k in work-sponsored/matched account with Fidelity (they match 3%), then a couple hundred in Marcus HSY, Coinbase (BTC and ethereum) and roundups/20 weekly to Acorns.\n\n2) Willing to be ***really*** ***aggressive***, as I will only have about three more earning years before entering med school (*hopefully !)*\n\n3) Looking to buy a house/condo where I land for med school, so really just being aggressive about maybe having $ down for that is my main goal. My range here is about 300-450 k total without interest consideration. Maybe pay down my MS1 year loan interest as a plus. \n\nI understand the value of diversification, but feels like my non-Vanguard accounts are just earning interest on small amounts, when my vanguard account has accrued 40% since I opened it three years ago. Better to just pare down to my company sponsored/matching 401(k) with Fidelity and my personal vanguard (mostly ETFS)?\n\n&amp;#x200B;\n\n**TL;DR:** willing to be very very aggressive with my portfolio and fear I am spreading too thin with current allocation - advice?",
        "subreddit": "investing",
        "title": "VG, Marcus, Coinbase, Acorns + Company Fidelity sponsored accounts - am I spread too thin?",
        "url": "https://www.reddit.com/r/investing/comments/r6h39a/vg_marcus_coinbase_acorns_company_fidelity/",
        "created": 1638400720.0
    },
    {
        "author": "swift_kick_champion",
        "created_utc": 1638377081,
        "id": "r6j2qw",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is ground breaking stuff. There are no approved treatments for  Fetal and Neonatal Alloimmune Thrombocytopenia (FNAIT), so there is a lot of upside here. It has shown to remove scrambled platelets that harm the unborn child. \n\n[https://www.biospace.com/article/releases/rallybio-reports-positive-data-in-its-clinical-program-for-the-prevention-of-fetal-and-neonatal-alloimmune-thrombocytopenia-fnait-/?s=68](https://www.biospace.com/article/releases/rallybio-reports-positive-data-in-its-clinical-program-for-the-prevention-of-fetal-and-neonatal-alloimmune-thrombocytopenia-fnait-/?s=68)",
        "subreddit": "wallstreetbets",
        "title": "Rallybio $RYLB Reports Positive Data in Its Clinical Program for the Prevention of Fetal and Neonatal Alloimmune Thrombocytopenia (FNAIT)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6j2qw/rallybio_rylb_reports_positive_data_in_its/",
        "created": 1638405881.0
    },
    {
        "author": "BenoitBB",
        "created_utc": 1638378796,
        "id": "r6jpts",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "What’s your thought about clov ? It’s the all time low … is it time to buy or let it go … educate me ;)",
        "url": "https://i.redd.it/5ssc36btry281.jpg",
        "created": 1638407596.0
    },
    {
        "author": "Deznate",
        "created_utc": 1638391801,
        "id": "r6otep",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I currently have 17.5k in the market rn and I have a little over a thousand left to invest and was thinking about YOLOing it into a random penny stock. Anyone got suggestions?",
        "subreddit": "wallstreetbets",
        "title": "Need help",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6otep/need_help/",
        "created": 1638420601.0
    },
    {
        "author": "trollol_lol77",
        "created_utc": 1638381160,
        "id": "r6kn37",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "It ain’t much, decided to get my beak wet with options, was able to double my buying power. $AAPL. I can finally upgrade my iPhone 6 🤗",
        "url": "https://i.redd.it/lpbrnocuyy281.jpg",
        "created": 1638409960.0
    },
    {
        "author": "elrzepo",
        "created_utc": 1638379553,
        "id": "r6k0d7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nI've been invested in this company since March this year and have seen steady growth with some dips that never worried me.\n\nHowever now, after its earnings in early November, the company has been dropping like a stone and is 23% down since then (and 6% just today!)\n\nThe earnings were mostly good, with huge growth but higher loss per share than anticipated.\n\nThe company is favoured by analysts with a \"Buy\" rating and average price target of 400$, it has good press (often mentioned as a stock to buy with a high potential), it has multiple sources of revenue (e-commerce, e-sports, payments) yet it keeps dropping and dropping for a month now, now at a level last time seen around June.\n\nAt first i thought that some red might come from associating it with chinese stocks (even though the company is from Singapore) but not a nearly 25% drop...\n\nIs there something I'm not seeing here?  \n\n\n \n\n* Analyst opinions remain divided on **Sea Ltd** (NYSE: SE) post Q3 results.\n* **UBS** analyst Navin Killa raised the price target to $380 from $350, implying a 22% upside, and maintained a Buy.\n* The analyst cites the company's \"strong\" Q3 results, particularly in the e-commerce segment, where gross merchandise value and revenue were up 81% and 134%, respectively.\n* Spending on sales and marketing remains elevated, and the gaming segment saw a slowdown.\n* Still, Sea Ltd should continue to benefit from adopting e-commerce and digital finance across under-penetrated regions in ASEAN and LatAm regions.\n* The rating contrasts with **BofA** analyst Sachin Salgaonkar downgraded to Neutral from Buy with a price target of $385, up from $380, implying a 23% upside.\n* Salgaonkar considers the risk/reward as balanced following the stock's 67% rise year-to-date.\n* The analyst added that the company's gaming guidance following its Q3 earnings results implied slowing Q4 growth.\n* **Citi** analyst Alicia Yap lowered the price target to $416 from $424, implying a 33% upside, and affirmed a Buy following the \"solid\" Q3 results.\n* Gaming user metrics started to resemble a normalized steady growth trend in a post-Covid environment.\n* The analyst believes Sea's growth momentum and monetization upside for Shopee remain intact.  \n\n\n[https://finance.yahoo.com/news/analysts-remain-divided-over-sea-163244783.html](https://finance.yahoo.com/news/analysts-remain-divided-over-sea-163244783.html)",
        "subreddit": "stocks",
        "title": "What is going on with SE (Sea Ltd.)?",
        "url": "https://www.reddit.com/r/stocks/comments/r6k0d7/what_is_going_on_with_se_sea_ltd/",
        "created": 1638408353.0
    },
    {
        "author": "Moon-Light-88",
        "created_utc": 1638379829,
        "id": "r6k4ax",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "RWLK an all in stock? Reviewing the company it took a hit with CV19 restrictions considering access for/to patients but with that said, it feels like a solid stock.",
        "url": "https://www.reddit.com/r/pennystocks/comments/r6k4ax/rwlk_an_all_in_stock_reviewing_the_company_it/",
        "created": 1638408629.0
    },
    {
        "author": "Beneficial-Summer-19",
        "created_utc": 1638378896,
        "id": "r6jr99",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is a new stock that does graphite mining and has its' own mine in Quebec and has seen the price of shares go from 0.30 $ at IPO to over 1$ in less than three months. It has taken a large dip in the past couple weeks and is back trading at 0.65 $. Not Financial Advice But the market cap is very small and the price is volatile and is due to reach another High!  IMO  \nSee it here! You heard it from me first!  Best of Luck!  \n[https://finance.yahoo.com/quote/GEL.V?p=GEL.V](https://finance.yahoo.com/quote/GEL.V?p=GEL.V)",
        "subreddit": "wallstreetbets",
        "title": "GEL.V. (Graphano Energy LTD) GOOD BUYING OPPORTUNITY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6jr99/gelv_graphano_energy_ltd_good_buying_opportunity/",
        "created": 1638407696.0
    },
    {
        "author": "Dragnskull",
        "created_utc": 1638598897,
        "id": "r8jdlf",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "recently learned A. i could take loans on my roth ira and 401k, and B. discovered waht I bonds are\n\nI bonds = protects buying power by providing an interest rate based on the last 6 months inflation, the current rate on i-bonds are 7.12% and get adjusted every 6 months, i understand the number could go down during on me but with how things are going i dont think its likely inflation is going to slow down in the next bit, and even if it does i wont actually lose money. maximum amount you can own is 10k (more if you get paper bonds through your tax return but that's another discussion)  \n\n\nmy 401k is through fidelity, i can take out loan with a 5.25% interest rate for 12 to 60 months and from what I understand the interest paid actually goes into my 401k, so its technically not really a fee just mandatory additional deposit into my savings, they DO mention a 50 dollar setup fee when I use their loan calculator though.\n\nplan:  \n1. take out loan on 401k for 12 months  \n2. invest the loan into a 12 month ibond  \n3. pay the bi-monthly loan payments, reimburse myself when the I-bond matures in 12 months  \n\n\nExpected results (Using current I-bond rate):\n\n$712 total earnings from I-bond  \n$525 of that will be put into the 401k (the interest paid on the loan)  \n\\-$50 dollar loan fee  \nsummary: extra $525 invested into my 401k, profit of $137 in pocket, 0% risk (i will easily cover the loans monthly bill)  \n\n\nI understand this isn't much but I like to maximize my financial opportunities \n\nQuestions:\n\n1. how does paying loans early work? could I do the max timeframe on the 401k loan (60 months) but pay it in full at the 12 month mark when the I-bond matures? I'd like to minimize the monthly payments as much as possible but I don't know if this has a downside or can even be done\n2. am i right that the 5.25% interest on the fidelity loan goes into my 401k and thus is really just more savings for me as im not actually losing money by paying it?",
        "subreddit": "investing",
        "title": "any flaws in this plan? loan on my 401k",
        "url": "https://www.reddit.com/r/investing/comments/r8jdlf/any_flaws_in_this_plan_loan_on_my_401k/",
        "created": 1638627697.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638631446,
        "id": "r8rvg6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 6th, 2021.\n\n# **More turbulence could be ahead for stocks as investors weigh omicron and the Fed’s next steps - [(Source)](https://www.cnbc.com/2021/12/03/stocks-could-face-more-turbulence-in-the-week-ahead.html)**\n*****\n&gt; Volatility could continue to plague markets after a week of violent swings that sent many stocks plummeting.\n*****\n&gt; In the week ahead, investors await more news on the omicron Covid variant and another inflation report Friday that is expected to show consumer prices remain the hottest in three decades.\n*****\n&gt; In the past week, stocks sold off on worries about the omicron variant and concerns the Federal Reserve will move away from its easy policies and raise interest rates sooner than anticipated. Fed Chairman Jerome Powell told a Congressional panel Tuesday that the central bank will consider speeding up the taper of its $120 billion monthly bond-buying program when it meets Dec. 14 and 15. The Federal Reserve put its bond-purchasing program in place in early 2020 to prop up the economy during the pandemic.\n*****\n&gt; “It’s going to be a somewhat turbulent December because we probably need to wait for earnings season to get regrounded, back to fundamentals,” said Jack Ablin, chief investment officer at Cresset. “For as high as a lot of the ratios would suggest, price-to-sales, price-to-earnings, when you throw it into the hopper with interest rates and everything else, things aren’t that bad. I don’t think we’re teetering on the edge of a cliff.”\n*****\n&gt; But Ablin did say the comments from Powell were unnerving investors, who fear the Fed will also speed up interest rate hikes. Powell acknowledged he was wrong about inflation being “transitory,” or temporary, spooking investors. The bond purchases are now scheduled to end in June.\n*****\n&gt; “I’m not sure what investors’ read on inflation is. Do they think the Fed is going to raise rates, get ahead of it too early and everything is going to roll over? Ever since Powell took ‘transitory’ out of his talk, investors have been somewhat off balance,” said Ablin.\n*****\n&gt; The consumer price index or CPI for November is expected Friday morning. Economists polled by Dow Jones predict it rose 0.6% on a monthly basis, or 6.7% year over year. That compares to a 0.9% gain in October, and a 6.2% jump year over year, the biggest move in three decades.\n*****\n&gt; # Risky names slammed\nHigh fliers and growth were among the hardest hit Friday, as investors bailed out of some of the riskiest stocks. As stocks plunged Friday, Treasury yields fell. Yields move opposite price, and the move was seen as a flight to safety. The 10-year note yield fell to 1.35%.\n*****\n&gt; The ARK Innovation ETF was down nearly 12.7% for the week. Most of the growth names in the fund plunged into bear market territory. “I think investors have to keep in mind that’s not a 15-week strategy. It’s a 15-year strategy, as far as we’re concerned,” Ablin said.\n*****\n&gt; For the week, the small cap Russell 2000 was down nearly 4%, while the S&amp;P 500 was off just 1.2%. The worst performing major sector for the week was communications services, which includes internet companies. It was down 2.8%, followed by consumer discretionary, off 2.4%. Financials lost nearly 2%, and the S&amp;P technology sector was down 0.4% for the week. But on Friday, tech lost 1.7%.\n*****\n&gt; The Federal Reserve should be quiet in the week ahead. Fed officials traditionally do not make major speeches in the blackout period, which is the coming week, ahead of their Dec. 14 and 15 meeting. One exception is Minneapolis Fed President Neel Kashkari who speaks Thursday at the Center for Indian Country Development Research Summit.\n*****\n&gt; Much of the focus will be on how the market itself is performing.\n*****\n&gt; “Ever since the Nov. 22 outside bearish day, all strength has been sold with lots of damage underneath the hood,” said Scott Redler of T3Live.com. “Now finally some of the leadership names are showing faulty action.” He noted that both Microsoft and Apple were weaker.\n*****\n&gt; “Money is not hiding in Amazon, Google, or Facebook. They haven’t been special for weeks,” he said.\n*****\n&gt; The S&amp;P closed below its 50-day moving average Friday, after closing below it Wednesday. The 50-day is at 4,544. That’s a signal to some market technicians that the index is on the verge of breaking down. The 50-day moving average is the average closing price over the past 50 days, and is viewed as a momentum indicator.\n*****\n&gt; “Basically, it’s effectively a retest of support because we had the relief rally [Thursday],” said Katie Stockton, founder of Fairlead Strategies. She said the S&amp;P 500 needs to close below the 50-day for two consecutive days before the move is considered a breakdown.\n*****\n&gt; “The action in the high growth, high multiple names is not a good sign,” said Stockton. “We do have some signs of downside exhaustion but not as widespread as I would hope. We’re seeing some of the heavyweights, like Adobe for example, taking out levels like the 50-day moving averages.” She said some of those big names have now joined the selling.\n*****\n&gt; “We’re just watching how bad it gets. Monday is going to be the tell,” said Stockton. “That also gives it the weekend to settle... Extremes have gotten a little bit more extreme. Sentiment is the most oversold from a contrarian perspective since the October low.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/hk2QMMD.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/w6utI7X.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/N8u66xV.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/tagANgL.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/28oKFM3.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t8zd2PY.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fEvF2Bm.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ponrnUL.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SqxThz0.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ARPnz4g.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/3QmNJUa.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/sz567v5.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/s9GIfxy.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/zBWalJo.png))**\n###### **([CLICK HERE FOR THE CHART LINK #4!](https://i.imgur.com/Cz7EeMl.png))**\n\n*****\n\n&gt; # Small-Cap Corrections\n\n&gt; At the close on Wednesday (12/1), the small-cap Russell 2,000 had fallen 12.1% from its recent high on November 8th, leaving the index in \"correction\" territory. A market \"correction\" is a drop of 10%+ that was preceded by a rally of at least 10% on a closing basis. This correction for the Russell 2,000 is its 58th since data for the index begins in 1978. Below is a table showing prior corrections for the Russell. The average correction sees the index fall 18.35%, which is just shy of the 20% threshold for a \"bear market.\" The median correction is a little smaller at -15.4%. In terms of length, the average Russell correction has lasted 73 days, while the median is 62 days. For the current Russell 2,000 correction to reach average levels, it would need to fall another 7% from here, and it would come to an end on January 20th, 2022.\n\n&gt; In terms of extremes, the biggest correction that the Russell 2,000 has ever experienced was the 41.9% decline seen during the initial COVID Crash from 1/16/20 to 3/18/20. The longest correction lasted 397 days from 6/24/83 to 7/25/84. In terms of the shortest correction, there were two that lasted 3 days. One of those came during the Financial Crisis while the other happened last June.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/12/raycorrec.png))**\n\n*****\n\n&gt; # December Typically Starts Out Weak\n\n&gt; December typically starts out weak as tax-loss selling ramps up and with the big gains this year we would expect that early December weakness to materialize. Then as you can see in the typical December chart here stocks begin to takeoff around mid-month led by small caps and the Russell 2000.\n\n&gt; This is what used to be known as the “January Effect:” small caps outperforming large caps in the month of January. Nowadays most of the so-called January Effect takes place in the last half of December (2021 Almanac pages 110 &amp; 112, 2022 pages 112 &amp; 114). The January Effect is not to be confused with the January Barometer (2021 Almanac page 16, 2022 page 18), which states as the S&amp;P 500 goes in January, so goes the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/84caf5990b652671445781962a51ee2f/b2ebb400780bd4c8-af/s500x750/1795f2bbf763fb254a002bda32bd9b217881240b.jpg))**\n\n*****\n\n&gt; # December Almanac: Small Cap Effect &amp; Santa Claus Rally\n\n&gt; Trading in December is holiday inspired and fueled by a buying bias throughout the month. However, the first part of the month tends to be weaker as tax-loss selling and yearend portfolio restructuring begins. Regardless, December is laden with market seasonality and important events.\n\n&gt; December is the number three S&amp;P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the second-best Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not all that likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.\n\n&gt; In the last seventeen post-election years, December’s ranking slip to #7 S&amp;P 500, #7 NASDAQ and DJIA #5. Small caps, measured by the Russell 2000, tend to have a field day in post-election-year Decembers. Since 1981, the Russell 2000 has lost ground three time in ten post-election years in December. The average small cap gain in all ten years is a solid 2.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/64044be6e473181304fe66b98074cbde/5618185eea1cfe29-fe/s400x600/931f46ef694541cebb05ea5f3193a5faa1f6bc60.jpg))**\n\n&gt; Small caps tend to start to outperform larger caps near the middle of the month (early January Effect) and The “Santa Claus Rally” begins on the open on December 27 and lasts until the second trading day of 2022. Average S&amp;P 500 gains over this seven trading-day range since 1969 are a respectable 1.3%.\n\n&gt; Years when the Santa Claus Rally (SCR) has failed to materialize are often flat or down. The last six times SCR (the last five trading days of the year and the first two trading days of the New Year) has not occurred were followed by three flat years (1994, 2004 and 2015) and two nasty bear markets (2000 and 2008) and a mild bear that ended in February 2016. As Yale Hirsch’s now famous line states, “If Santa Claus should fail to call, bears may come to Broad and Wall.”\n\n*****\n\n&gt; # 6 Things To Know About December And Omicron\n\n&gt; Here comes December, historically a pretty solid month for stocks, but now we have the Omicron variant wreaking havoc on markets. “What a difference a week makes. A week ago stocks were at all-time highs and the economy was strong. Now all we have are uncertainties and questions,” explained LPL Financial Chief Market Strategist Ryan Detrick. “As of now we’re optimistic that stocks will sidestep the new variant worries, but we recommend investors buckle up their seatbelts, as the end of 2021 could be a bumpy one.”\n\n&gt; Here are six things to think about as we head into the jolliest month of them all.\n\n&gt; First, historically, the S&amp;P 500 Index has gained 1.5% on average in December, which is the third best month of the year with only April and November better. But as you can see here, over the past 10 years, December has been much weaker. Of course, much of this was due to a huge 9.2% drop in 2018 (which we’ll get to soon enough).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-1.png?ssl=1))**\n\n&gt; Second, some more good news is December has been up 74.3% of the time, more than any other month of the year.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-2-.png?ssl=1))**\n\n&gt; drop in 2018. Only once in history was December the worst month of the year for the S&amp;P 500 and it was indeed in 2018. Three times it was the second worst month of the year, in 1968, 1980, and 1996. The worst monthly return so far this year was a 4.8% drop in September.\n\n&gt; Fourth, stocks usually don’t get moving until the second half of the month, right as the holiday good feel vibes start to come out.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-3.png?ssl=1))**\n\n&gt; Fifth, this year is in rare air, as all 11 months have made a new all-time high so far. Should the S&amp;P 500 make new highs in December that would be a perfect 12 for 12, matching 2014 as the only years to complete this incredible feat.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-4.png?ssl=1))**\n\n&gt; Sixth, as we show in the LPL Chart of the Day, it turns out that when stocks are up more than 20% for the year heading into December (like 2021), the final month actually does better, up 1.7% versus 1.5%. Also, it has been higher eight of the past nine times the year was up more than 20% heading into the final month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-post-5.png?ssl=1))**\n\n*****\n\n&gt; # Job Growth Came Up Short in November\n\n&gt; The domestic economy added just 210,000 jobs during November, well below Bloomberg-surveyed economists’ consensus forecast for a gain of 550,000 and below October’s revised tally of 546,000. The net revision to prior months was positive but only by 82,000.\n\n&gt; The modest 23,000 gain in leisure and hospitality jobs, which were up 170,000 in October, and a 20,000 drop in retail jobs don’t make much sense given solid retail sales data of late. That could set up a positive reversal from revisions next month, though that potential bump will play some tug-of-war with the emergence of the Omicron COVID-19 variant, which came after the November survey period ended.\n\n&gt; As shown in the LPL Chart of the Day, for the past four months the pace of job gains has been well below the pre-Delta variant levels of near 1 million back in June and July. However, there are a number of reasons to be optimistic that job growth picks up in early 2022, assuming the Omicron variant doesn’t get in the way.\n\n&gt; “The job growth number is disappointing, no doubt, especially considering the survey period fell before we even know the name of the newest Covid-19 variant,” noted LPL Financial Equity Strategist Jeffrey Buchbinder. “While Omicron may curb hiring a bit over the next month or two, we remain confident in our expectation for strong job gains and above-average growth in the U.S. economy in 2022.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/12/Blog-pic-12.3.21.png?ssl=1))**\n\n&gt; The story was clearly better when looking at the unemployment rate, derived from the household survey rather than from employers. The unemployment rate unexpectedly fell from 4.6% to 4.2% in November as workers—in an encouraging sign—came off the sidelines (1.14 million of them), lifting the participation rate by 0.2% to 61.8%, a post-recession high but still well off pre-pandemic levels.\n\n&gt; Inflation data also painted a somewhat reassuring picture. The year-over-year increase in average hourly earnings rose less than expected at 4.8% (+0.3% month over month), below consensus expectations of 5.0% and 0.4%, and not enough to keep up with the Consumer Price Index (CPI) over the same period. It’s reasonable to conclude that the increase in labor participation helped limit wage increases, but we have a long way to go there still. The labor market is still 3.9 million jobs below pre-pandemic levels and the labor market remains under-supplied, as noted above. In other words, further improvement in participation will still be needed to help contain inflation pressure.\n\n&gt; Some will argue that this report will make the Federal Reserve (Fed) think twice before accelerating tapering of its bond purchases, but we’re not so sure.\n\n&gt; “There were a number of positives with this jobs report,” explained LPL Financial Fixed Income Strategist Lawrence Gillum. “Labor force participation increased and the unemployment rate fell—both of which point to a continued strong jobs market. That may give the Fed reasons to speed up its tapering plans.”\n\n&gt; Overall, this report is a disappointing reminder that we’re going to have to wait longer for the booming jobs numbers that we still expect to see. We continue to expect more people to get back to work in the months ahead, in an environment of strong labor demand, which can help alleviate wage pressure and firm up the economic growth outlook. Omicron is a risk but based on the information we have today, we do not expect that variant, or any others, to meaningfully slow the job market recovery in 2022.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 3rd, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 12.5.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$CHPT $GME $LULU $CHWY $COST $AZO $RH $SAIC $LOVE $AVGO $DLHC $PATH $COUP $MDB $ASO $DBI $THO $ORCL $PLAY $CBP $SFIX $HRL $S $CONN $SUMO $SOL $UNFI $KFY $GTLB $CIEN $ALCO $PD $TOL $HQY $CASY $CNM $VRA $GEF $JW.A $ALOT $PLAB $AOUT**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/ARPnz4g.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/V8bYDe5.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 12.6.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/br3K0zL.png))\n\n&gt; # ***Monday 12.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hbGoBFe.png))\n\n*****\n\n&gt; # ***Tuesday  12.7.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tM8wghC.png))\n\n&gt; # ***Tuesday 12.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hhcFlGr.png))\n\n*****\n\n&gt; # ***Wednesday 12.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/lPByiPr.png))\n\n&gt; # ***Wednesday 12.8.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FNjpxcY.png))\n\n*****\n\n&gt; # ***Thursday 12.9.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/2PUPQhA.png))\n\n&gt; # ***Thursday 12.9.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/6kqQxly.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/OcHR8nI.png))\n\n*****\n\n&gt; # ***Friday 12.10.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ChargePoint Holdings, Inc. $21.57\n&gt; **ChargePoint Holdings, Inc. (CHPT)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 7, 2021. The consensus estimate is for a loss of $0.14 per share on revenue of $63.02 million and the Earnings Whisper ® number is ($0.11) per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat The company's guidance was for revenue of $60.00 million to $65.00 million. Short interest has decreased by 35.9% since the company's last earnings release while the stock has drifted lower by 9.3% from its open following the earnings release to be 12.1% below its 200 day moving average of $24.53. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, November 29, 2021 there was some notable buying of 1,258 contracts of the $34.00 call expiring on Friday, December 17, 2021. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 7.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHPT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # GameStop Corp. $172.39\n&gt; **GameStop Corp. (GME)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 8, 2021. The consensus estimate is for a loss of $0.22 per share on revenue of $1.19 billion and the Earnings Whisper ® number is ($0.46) per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 58.49% with revenue increasing by 18.44%. Short interest has decreased by 10.4% since the company's last earnings release while the stock has drifted lower by 4.3% from its open following the earnings release to be 7.3% below its 200 day moving average of $185.88. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 19, 2021 there was some notable buying of 2,239 contracts of the $250.00 call expiring on Friday, December 10, 2021. Option traders are pricing in a 17.7% move on earnings and the stock has averaged a 16.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=GME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # lululemon athletica inc. $435.72\n&gt; **lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 9, 2021. The consensus earnings estimate is $1.39 per share on revenue of $1.43 billion and the Earnings Whisper ® number is $1.59 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat The company's guidance was for earnings of $1.33 to $1.38 per share. Consensus estimates are for year-over-year earnings growth of 19.83% with revenue increasing by 27.97%. Short interest has increased by 6.0% since the company's last earnings release while the stock has drifted higher by 0.5% from its open following the earnings release to be 17.1% above its 200 day moving average of $371.99. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 16, 2021 there was some notable buying of 552 contracts of the $490.00 call expiring on Friday, December 10, 2021. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Chewy, Inc. $62.69\n&gt; **Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, December 9, 2021. The consensus estimate is for a loss of $0.04 per share on revenue of $2.21 billion and the Earnings Whisper ® number is ($0.04) per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 24.02%. Short interest has increased by 25.4% since the company's last earnings release while the stock has drifted lower by 20.9% from its open following the earnings release to be 20.0% below its 200 day moving average of $78.32. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, November 23, 2021 there was some notable buying of 6,763 contracts of the $65.00 put expiring on Friday, January 21, 2022. Option traders are pricing in a 16.3% move on earnings and the stock has averaged a 6.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Costco Wholesale Corp. $528.93\n&gt; **Costco Wholesale Corp. (COST)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 9, 2021. The consensus earnings estimate is $2.59 per share on revenue of $49.05 billion and the Earnings Whisper ® number is $2.77 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 13.10% with revenue increasing by 13.52%. Short interest has decreased by 17.1% since the company's last earnings release while the stock has drifted higher by 16.0% from its open following the earnings release to be 27.1% above its 200 day moving average of $416.03. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, November 29, 2021 there was some notable buying of 3,073 contracts of the $550.00 call and 2,087 contracts of the $550.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 1.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # AutoZone, Inc. -\n&gt; **AutoZone, Inc. (AZO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, December 7, 2021. The consensus earnings estimate is $20.83 per share on revenue of $3.34 billion and the Earnings Whisper ® number is $22.59 per share. Investor sentiment going into the company's earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.93% with revenue increasing by 5.89%. Short interest has increased by 22.4% since the company's last earnings release while the stock has drifted higher by 15.3% from its open following the earnings release to be 20.6% above its 200 day moving average of $1,544.93. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=AZO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # RH $537.14\n&gt; **RH (RH)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 8, 2021. The consensus earnings estimate is $6.69 per share on revenue of $985.18 million and the Earnings Whisper ® number is $7.21 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 7.90% with revenue increasing by 16.73%. Short interest has increased by 2.2% since the company's last earnings release while the stock has drifted lower by 23.9% from its open following the earnings release to be 15.5% below its 200 day moving average of $635.39. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 17, 2021 there was some notable buying of 1,250 contracts of the $310.00 call expiring on Friday, January 20, 2023. Option traders are pricing in a 13.0% move on earnings and the stock has averaged a 9.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=RH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Science Applications International Corporation $85.56\n&gt; **Science Applications International Corporation (SAIC)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, December 6, 2021. The consensus earnings estimate is $1.45 per share on revenue of $1.88 billion and the Earnings Whisper ® number is $1.57 per share. Investor sentiment going into the company's earnings release has 42% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 10.49% with revenue increasing by 3.41%. Short interest has decreased by 9.7% since the company's last earnings release while the stock has drifted lower by 1.5% from its open following the earnings release to be 3.7% below its 200 day moving average of $88.85. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 6.4% move on earnings and the stock has averaged a 4.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SAIC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lovesac Company $61.76\n&gt; **Lovesac Company (LOVE)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, December 8, 2021. The consensus estimate is for a loss of $0.40 per share on revenue of $112.19 million and the Earnings Whisper ® number is ($0.28) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 350.00% with revenue increasing by 50.10%. Short interest has increased by 26.5% since the company's last earnings release while the stock has drifted higher by 9.2% from its open following the earnings release to be 9.5% below its 200 day moving average of $68.25. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 11.6% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LOVE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Broadcom Limited $558.12\n&gt; **Broadcom Limited (AVGO)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 9, 2021. The consensus earnings estimate is $7.74 per share on revenue of $7.36 billion and the Earnings Whisper ® number is $7.85 per share. Investor sentiment going into the company's earnings release has 86% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 19.08% with revenue increasing by 13.81%. Short interest has increased by 9.0% since the company's last earnings release while the stock has drifted higher by 12.5% from its open following the earnings release to be 15.4% above its 200 day moving average of $483.79. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 16, 2021 there was some notable buying of 1,273 contracts of the $560.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 5.1% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets. :)",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning December 6th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r8rvg6/wall_street_week_ahead_for_the_trading_week/",
        "created": 1638660246.0
    },
    {
        "author": "zecavrealty",
        "created_utc": 1638640767,
        "id": "r8v56s",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nGGPI is a hidden Gem that will explode soon let me tell you why\n\nFundamentally lets look at polestar competitor: Rivian is valued at over 100 and lucid over 40 yet Polestar sold more then both combined. yet we are priced at 11$. polestar has also hit its target number in production 2021 and has ambitious goals in 2022 in expanding in the usa and asia, their vehicle are priced between 45k to 145k so i ask is ggpi really worth 11$?. this could easily become min $40-$70 company once merger is complete which we expect in q1\n\nLets look at the option chain because they are looking juicy\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3eaaqpjkek381.png?width=1584&amp;format=png&amp;auto=webp&amp;s=ce302129d6a57cb2a1b7e8b02a8cce09baba9929\n\nCall\n\nGGPI float is quite low 80M for an ev (lucid, nio, tsla, over 1B float, Rivian 500M) currently and if we look at DEC and JAN call option they are looking nuclear especially Jan over 52k will be in the money at 10 $ as well as 24k in dec\n\n&amp;#x200B;\n\nhttps://preview.redd.it/va3mlbelek381.png?width=1572&amp;format=png&amp;auto=webp&amp;s=b328d0ea50a483a2aad6c6e605e6954756f247e6\n\nd\n\nnow check out the call volume for dec and jan !!!!!!!!!!!!!!!! Folks are loading up. especially during a bear market this is HUGEE.\n\nAnother catalyst i look for is jim cramer: jim says sell i say BUY!!!!\n\n“No. I looked at this. We were talking about it with the investment club people. We got together and said, OK, just one more, one more, one more. I’m not there. I’m not backing this group. Just can’t.” - Jim Cramer\n\nNow lets talk about the bearish thesis\n\n* china cracking down on Chinese stock in the us market as polestar has links to china\n* its a spac merger still hasn't gone through yet so your investing in hopes that the merger gets approved and goes through\n* SEC investigation\n\nmy thought on these 3 bearish thesis\n\n* polestar isn't a Chinese company its based in Switzerland but has financial ties to china\n* Gores Guggenheim has a stellar website and has done this before. When polestar CEO was interviewed Dec 2nd he sounded very confident in GG merger\n* SEC investigation happens to majority of spec word is it has something to do with the price being to low or the 6% stake gg will receive after merger\n\nDid I miss anything?\n\nWhat are your thoughts ?",
        "subreddit": "SPACs",
        "title": "GGPI Is A hidden Gem",
        "url": "https://www.reddit.com/r/SPACs/comments/r8v56s/ggpi_is_a_hidden_gem/",
        "created": 1638669567.0
    },
    {
        "author": "DeveloperJ",
        "created_utc": 1638634193,
        "id": "r8stgc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I own Microsoft. I’m not selling it, but I looked at the past 20 years for Microsoft and up until 5 years ago, the price never cracked into the 60s. 2016 you could buy the stock for 50 bucks a share. And the price had stated between 20-50 dollars for the better part of 20 years. Now it’s 323?? If you look at the 20 years graph it really is pretty damn parabolic. \n\nI know everyone is dooming about a market crash or correction, but I honestly think the Covid news will dissipate. We will see 10% loses and people will get in quick and hit new all time highs. That’s just my guess, and I’m a long term investor so I don’t care too much about what happens in the day to day or even month to month. \n\nWhat I do care about though is whether I should dump a ton of money into Microsoft now, or just a little bit anticipating a correction. Because it’s parabolic, I don’t feel confident it would continue, but who knows. \n\nWhat do you guys think? \n\nNote: I love Microsoft and it’ll be worth a hell of a lot more in 10 years than it will be today, even if we are super inflated.",
        "subreddit": "stocks",
        "title": "Is it risky to invest in some tech stocks like MSFT given how parabolic the past 5 years have been?",
        "url": "https://www.reddit.com/r/stocks/comments/r8stgc/is_it_risky_to_invest_in_some_tech_stocks_like/",
        "created": 1638662993.0
    },
    {
        "author": "ThinkBigger01",
        "created_utc": 1638648784,
        "id": "r8y1jr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "No matter whether you like like crypto's or not, I hope recent days have made it clear that Bitcoin is not a \"safe haven\" or \"digital gold\" which some claim it to be. It's a risk-on asset.\n\nIn the past week when equity markets sold off because of Fed tapering fears and on friday lower than expected nonfarm payrolls, bitcoin also went down almost 20%.\n\nAgain, i'm not judging those that want to speculate on cryptos, just don't call it a safe haven. If anything it's a risk-on asset which follows more the sentiment in stocks.\n\nIf you want a safe haven than just buy gold or an ETF tracking it. Gold futures went up more than a percent on friday.",
        "subreddit": "investing",
        "title": "Bitcoin is not a safe haven or digital gold. It's a risk-on asset.",
        "url": "https://www.reddit.com/r/investing/comments/r8y1jr/bitcoin_is_not_a_safe_haven_or_digital_gold_its_a/",
        "created": 1638677584.0
    },
    {
        "author": "Wall_street_retard",
        "created_utc": 1638651640,
        "id": "r8z0tf",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Original thought: what if stocks don’t go straight up, and an index dropping 3% after it rallied 15% in 2 months doesn’t have to signify Armageddon?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r8z0tf/original_thought_what_if_stocks_dont_go_straight/",
        "created": 1638680440.0
    },
    {
        "author": "7BlueWhales",
        "created_utc": 1638652355,
        "id": "r8z9ro",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "Have You Ever Heard About It?",
        "url": "https://i.redd.it/plxquik6dl381.jpg",
        "created": 1638681155.0
    },
    {
        "author": "scobybonk",
        "created_utc": 1638656536,
        "id": "r90pib",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "check it out for me please",
        "url": "https://www.reddit.com/r/investing/comments/r90pib/check_it_out_for_me_please/",
        "created": 1638685336.0
    },
    {
        "author": "travel_learn_wine",
        "created_utc": 1638655851,
        "id": "r90hcx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Move forward - it is no longer the same",
        "url": "https://www.reddit.com/r/investing/comments/r90hcx/move_forward_it_is_no_longer_the_same/",
        "created": 1638684651.0
    },
    {
        "author": "Nobodyz_Nikki",
        "created_utc": 1638695219,
        "id": "r9btrl",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Did you know that ***Adam Aron*** of $AMC became the director of the off shore Cayman Islands company known as ***Centricus Acquisitions Corp*** not long before it was delisted, went through a name change (Arqit Quantum Inc.) and then had a ***short squeeze*** on his birthday?",
        "url": "https://www.reddit.com/gallery/r9btrl",
        "created": 1638724019.0
    },
    {
        "author": "thelegendtwentee7",
        "created_utc": 1638686186,
        "id": "r99m5s",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " [Thumbnail of graph](https://drive.google.com/file/d/1za4uleYosM1Iy7LKaCOiNLu2N4Kw2c3l/view?usp=drivesdk)      \n\nThis strategy appears to work on either a Weekly or Daily time frame. [here](https://www.tradingview.com/chart/P3uCjtT0/?symbol=NASDAQ%3ATQQQ) is the link to the chart.\n\nIf you did this strategy, you’d want to buy TQQQ once the candle finalizes as green or red because the candle can flip colors if you buy Intra-Day/Week.    \n\nMaybe you could even do this strategy but flip over to SQQQ on a red candle instead of entirely selling to profit during both swings?    \n\nEssentially the strategy boils down to this: \n&gt;If a week’s candle finalizes red, Sell. \n&gt; If a week’s candle finalizes green, Buy. \n&gt;♻️    \n\nLet me know what you think because it SEEMS like a pretty solid semi-passive move.",
        "subreddit": "stocks",
        "title": "TQQQ: Weekly/Daily Heiken Ashi Swing Trade Strategy. What do you think of it?",
        "url": "https://www.reddit.com/r/stocks/comments/r99m5s/tqqq_weeklydaily_heiken_ashi_swing_trade_strategy/",
        "created": 1638714986.0
    },
    {
        "author": "ZzLordZz",
        "created_utc": 1638661088,
        "id": "r9296e",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Everything is Fucked! If you had $500 where would you put it.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r9296e/everything_is_fucked_if_you_had_500_where_would/",
        "created": 1638689888.0
    },
    {
        "author": "vlyoz",
        "created_utc": 1638701095,
        "id": "r9d7om",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\n\ni’m 15 and I’m able to invest about 1000$ into stocks or indexs funds. I can monthly add 75$ where do i start? individual stocks or index funds? It’s money I “can” lose without it being a big problem but would rather not of course. \n\nMy mom also invests and has done for me as well I have about 20,000$ in stocks that i get access to at 21 i think\nlike 10,000$ at my moms and another account with 10,000$ that my grandparents controll. I get access to them at either at 18 or 21 not sure yet.\n\nRoth Ira isn’t a option as well since i’m from Europe and my goal is to study law.",
        "subreddit": "investing",
        "title": "is 1000$ enough to start? and where do i start?",
        "url": "https://www.reddit.com/r/investing/comments/r9d7om/is_1000_enough_to_start_and_where_do_i_start/",
        "created": 1638729895.0
    },
    {
        "author": "Ok_Veterinarian_5894",
        "created_utc": 1638355596,
        "id": "r6c1pf",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "PPSI and why I'm so excited about it.",
        "url": "https://www.reddit.com/r/pennystocks/comments/r6c1pf/ppsi_and_why_im_so_excited_about_it/",
        "created": 1638384396.0
    },
    {
        "author": "Impossible_Injury_13",
        "created_utc": 1638354777,
        "id": "r6bv2v",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " Hey, football in Europe is increasingly being ruled by sheikhs! Let's show that a community is worth more than many of its money. Let's show that sport is for everyone. Corona is dividing sport more and more. Let's make an average club a success. Let's buy BVB shares. WKN 549309. Let's push our own sports club to show the rich guys the middle finger. To show that we are all stronger than one! We all have it in hand! Together we are strong and the rich dogs should notice that!",
        "subreddit": "wallstreetbets",
        "title": "comunity vs commercial",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6bv2v/comunity_vs_commercial/",
        "created": 1638383577.0
    },
    {
        "author": "Fuzzy_Barber9230",
        "created_utc": 1638357729,
        "id": "r6ckty",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Anyone with a good DD on SRNE? Can it be one of the next nice short squeezes? The price is unnaturally held around 6$ despite massive catalysts which should have sent the stock at least 20% up.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6ckty/anyone_with_a_good_dd_on_srne_can_it_be_one_of/",
        "created": 1638386529.0
    },
    {
        "author": "Tradingjoe10",
        "created_utc": 1638370071,
        "id": "r6gecj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Source - [https://speed.ettoday.net/news/2136361](https://speed.ettoday.net/news/2136361) \\- Translated it to English  \nGogoro Twitter (something in English) -   https://twitter.com/WeAreGogoro/status/1466053848645124104?s=20   \n\n\n[ ▲The purchase of electric vehicles continues to heat up, and Gogoro's sales in November reached the highest point since 2020. ](https://preview.redd.it/6lrpmobjtx281.png?width=1935&amp;format=png&amp;auto=webp&amp;s=2775c105d24844e7942cb4d7fd5d11126d2418d6)\n\nGogoro Ruineng announced today (1) that thanks to the increase of local government subsidies, various brands have successively launched new electric vehicles, offered competitive promotion plans, invested high-visibility advertising resources, and the energy infrastructure of electric vehicles has become more With multiple factors such as completeness, the total number of electric locomotives listed in Taiwan reached 11,868 in November, setting a new monthly high in the past 23 months. The number of Gogoro listed in November also increased to 8,722, reaching the highest point since 2020. Compared with the same period last year, it has grown by as much as 50%.   \n\n\n[ ▲The growth rate of Gogoro electric locomotives in Taiwan and Liudu in November 2021 compared to November 2020. ](https://preview.redd.it/rxmhf28s0y281.png?width=1920&amp;format=png&amp;auto=webp&amp;s=1aca60e6bd6c1d451e18ab9dc121636a38c7b73d)\n\nAccording to Gogoro’s analysis, Liudu’s sales were the most enthusiastic. Among them, Taipei City’s growth rate of 202.8% was the most impressive, followed by Taoyuan City’s growth rate of 85.7%, and New Taipei City’s growth rate of 78.7%. In view of the fact that all metropolitan areas in Taiwan have been deployed. With the most complete and dense smart energy exchange network, Liudu citizens are becoming more and more accepting of Gogoro electric locomotives, which is also directly reflected in the sales situation.   \n\n\n[ ▲The growth rate of electric locomotives of various brands in November 2021 compared to October 2021. ](https://preview.redd.it/qs9sjnsy0y281.png?width=1920&amp;format=png&amp;auto=webp&amp;s=1aa98dd605a6d7bf5a4db2afc8ad37ec947af99a)\n\nFrom the perspective of the overall electric locomotive market, in November, the cumulative number of Gogoro and Powered by Gogoro Network (PBGN) alliance models totaled 10,944 (PBGN alliance partners accounted for 2,222), an increase of 15.2% from the previous month; PBGN alliance The overall sales volume has also been growing positively, with a growth rate ranging from 17.8% to 70.9%, while the sales of other non-PBGN alliance brands have shrunk from last month.   \n\n\n[ ▲The number of electric locomotives listed in each month in 2021. ](https://preview.redd.it/ytrwamx01y281.png?width=1920&amp;format=png&amp;auto=webp&amp;s=81dc8b6b1b0c8a8d1f14dfe3c5a74ddf86fd090c)\n\nGogoro pointed out that since June this year, the monthly licenses of electric locomotives have maintained a steady growth, especially in October and November for two consecutive months to exceed 10,000, which brought sales momentum to the market in the fourth quarter. \n\nIn particular, 11,868 vehicles were licensed in November, an increase of 32.6% compared to the same month last year, while the number of diesel locomotives listed in November fell 21.5% from the same month last year. Especially since March of this year, the number of monthly licenses for fuel locomotives has shown a negative growth over the same period last year, indicating that the consumption trend of the locomotive market has clearly shifted to the electric locomotive sector.   \n\n\n[ ▲Compared with the market trends of electric locomotives and fuel locomotives in each month of 2020 in 2021. ](https://preview.redd.it/90ygw1h21y281.png?width=1920&amp;format=png&amp;auto=webp&amp;s=0530a4851e7bba1f6a0cc3c1ba824166763c6b33)\n\nAnalyzing the overall market for electric locomotives from January to November this year, the cumulative number of Gogoro and PBGN alliance car models totaling 75,558 (63,383 for Gogoro and 12,175 for PBGN alliance partners), occupying a share of 80,122 electric locomotives in the whole year 94.3%, and only 5.7% of vehicles using rechargeable or other-brand battery exchange solutions. This also reflects that electric vehicles using the Gogoro Network battery exchange system are currently the most popular choice for consumers.   \n\n\n[ ▲Proportion of the total number of electric locomotives listed from January to November 2021. ](https://preview.redd.it/zljddyq51y281.png?width=1920&amp;format=png&amp;auto=webp&amp;s=a54ee60b889b2b40e7390d1310edbc268d40adda)\n\n ▲Proportion of the total number of electric locomotives listed from January to November 2021. \n\nFrom January to November this year, the top 3 brands of electric motor vehicles listed are all PBGN alliance partners. Gogoro took the first place with 63,383 units, Hongjiateng ranked second with 7,228 units, and the newly added Zhonghua eMoving also got 2,048 units. Jump to number 3. \n\nAmong them, Gogoro's VIVA car series (including Gogoro VIVA XL, Gogoro VIVA MIX and Gogoro VIVA) have sold an average of 4,000 to 5,000 units per month since July, which also shows that the VIVA car series is currently the most popular locomotive among consumers. Car selection.   \n\n\n[ ▲The cumulative number of electric locomotives of various brands listed from January to November 2021. ](https://preview.redd.it/01w7i6x41y281.png?width=1920&amp;format=png&amp;auto=webp&amp;s=a21de1ab6dc7cbbbd2542fa7ee3d287df9191429)\n\nGogoro said that the main reasons for the active growth of the electric locomotive market in the second half of the year included government policy support, government subsidies, and major automakers actively investing in the R&amp;D and manufacturing of electric locomotives. At the same time, they proposed competitive promotion cases and invested high-visibility advertising resources. Supplemented by electric locomotive energy infrastructure has been put in place, and a good and complete environment of \"selecting, buying and using cars\" has been developed; local governments have provided subsidies for the people to purchase new electric cars and to buy out electric cars this year. It has been well received by the public, and it has also contributed to the three cities including Beibeitao and other cities to launch revitalization and overweight programs in October to actively encourage consumers to buy electric locomotives.\n\nMajor automakers have successively offered competitive annual promotions, invested a large amount of advertising resources and launched new electric vehicles, including Gogoro's Gogoro VIVA MIX and Gogoro VIVA XL this year, and eMOVING EZ1 and Hongjiateng announced by PBGN alliance partner China Motor. Ai-2 Gather and the new models of other electric locomotive manufacturers have promoted the positive growth of the overall electric locomotive market this year. This year, the major automakers’ publicly announced investment in electric locomotive products from January to November 2021 is almost twice the investment in the same period last year, including traditional and online advertising exposure, marketing, and promotional activities, all of which are heating the electric locomotive market. , Allowing consumers to increase their awareness and preference for electric vehicles.\n\nIn terms of infrastructure, the total number of GoStation battery switch cabinets in operation by Gogoro Network has reached 10,248, a growth of 25.4% compared to the same period last November; the total number of battery slots has also increased from 68,860 to 90,762, an annual growth rate of as high as 31.8%. Gogoro Network cooperates with various industries to build the \"Taiwan's most dense\" battery exchange energy network. If you look at a single channel, as of the end of November this year, the battery exchange stations deployed by Gogoro Network in Taiwan’s CNPC have increased to 482 stations, compared with It grew by 30.6% at the end of last year, and the total number of battery slots also climbed 35.95% to 14,878. By the end of this year, in conjunction with the government's public construction policy, it is estimated that 583 stations will be deployed in Taiwan's PetroChina, allowing 436,000 PBGN owners to travel across the city and travel around Taiwan, and enjoy riding with confidence.\n\nAs Beibeitao has proposed an increase in subsidies for electric vehicles, and it is not ruled out that the Environmental Protection Agency may adjust the amount of subsidies for electric vehicles next year. From now until December 31, \"Gogoro Super Sale\" will be combined with government subsidies and revitalization to purchase Gogoro. Electric locomotives plus extra battery charge discounts, the project can be discounted up to 35,600 yuan. The citizens of Beibeitao purchase the original price of Gogoro VIVA BASIC at 49,980 yuan, deducting the subsidy of 21,000 yuan for the central and local governments to purchase light-duty electric vehicles, with a five-fold revitalization voucher with a denomination of 5,000 yuan. The minimum starting price is only 23,980 yuan, which is equivalent to half the price. You can purchase a car at the price of a car, please refer to the official website for the activity method: [https://promotion.gogoro.com/tw/2021-nov-supersale/](https://promotion.gogoro.com/tw/2021-nov-supersale/)",
        "subreddit": "SPACs",
        "title": "Gogoro/PPGH - November sales of Gogoro electric locomotives \"set a new high since 2020\"! The reasons for the outbreak of growth are exposed",
        "url": "https://www.reddit.com/r/SPACs/comments/r6gecj/gogoroppgh_november_sales_of_gogoro_electric/",
        "created": 1638398871.0
    },
    {
        "author": "MadDogBluesy",
        "created_utc": 1638372812,
        "id": "r6hfke",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "going long on URNM 30,669$ on 79.65$, gonna keep securing my profits with stop loss every $ it goes up.",
        "url": "https://i.redd.it/vkmm28kz9y281.png",
        "created": 1638401612.0
    },
    {
        "author": "SmashLanding",
        "created_utc": 1638371783,
        "id": "r6h1g1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AAPL single-handedly propping up the S&amp;P, so obviously I'm gonna short it.",
        "url": "https://i.redd.it/16ffeaux6y281.jpg",
        "created": 1638400583.0
    },
    {
        "author": "SinisterGoat666",
        "created_utc": 1638369644,
        "id": "r6g8te",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I’ve been holding onto it for a while and was wondering if my one has good or bad news on it? Thank you",
        "subreddit": "pennystocks",
        "title": "Any news on Clis (ClickStream)",
        "url": "https://www.reddit.com/r/pennystocks/comments/r6g8te/any_news_on_clis_clickstream/",
        "created": 1638398444.0
    },
    {
        "author": "iggy555",
        "created_utc": 1638349149,
        "id": "r6aigx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "https://www.bloomberg.com/news/articles/2021-12-01/china-plans-to-ban-loophole-used-by-tech-firms-for-foreign-ipos?sref=K5kiE5Jr\n\n\nSo it looks like China is closing the loophole on going public outside using VIEs.\n\nGoing public in Hong Kong would still be allowed.\n\nAny current companies using VIE will need to adjust their ownership structure and and be more transparent.\n\nCould a delisting of “sensitive” forms be possible?",
        "subreddit": "investing",
        "title": "China Plans to Ban Loophole Used by Tech Firms for Foreign IPOs",
        "url": "https://www.reddit.com/r/investing/comments/r6aigx/china_plans_to_ban_loophole_used_by_tech_firms/",
        "created": 1638377949.0
    },
    {
        "author": "CharacterGap4523",
        "created_utc": 1638380217,
        "id": "r6k9ts",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "Wallstreetbetsnew",
        "title": "$PHIL otc ticker is the opportunity of a Lifetime, it will go from .01 cent its actually under a penny to Surpass $1.00 MARK THIS POST! GO BUY AS MUCH SHARES AS U CAN, &amp; THANK ME LATER BIG MONEY 💰 HERE $PHIL",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/r6k9ts/phil_otc_ticker_is_the_opportunity_of_a_lifetime/",
        "created": 1638409017.0
    },
    {
        "author": "Fit-Ad-7382",
        "created_utc": 1638380756,
        "id": "r6khft",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Pltr Vs Snow : I guess it is Palantir Time now 🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6khft/pltr_vs_snow_i_guess_it_is_palantir_time_now/",
        "created": 1638409556.0
    },
    {
        "author": "swift_kick_champion",
        "created_utc": 1638377461,
        "id": "r6j81v",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is ground breaking stuff. There are no approved treatments for Fetal and Neonatal Alloimmune Thrombocytopenia (FNAIT), so there is a lot of upside here. It has shown to remove scrambled platelets that harm the unborn child.\n\n[https://www.biospace.com/article/releases/rallybio-reports-positive-data-in-its-clinical-program-for-the-prevention-of-fetal-and-neonatal-alloimmune-thrombocytopenia-fnait-/?s=68](https://www.biospace.com/article/releases/rallybio-reports-positive-data-in-its-clinical-program-for-the-prevention-of-fetal-and-neonatal-alloimmune-thrombocytopenia-fnait-/?s=68)",
        "subreddit": "wallstreetbets",
        "title": "$RLYB Rallybio big results",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6j81v/rlyb_rallybio_big_results/",
        "created": 1638406261.0
    },
    {
        "author": "cheaptissueburlap",
        "created_utc": 1638379032,
        "id": "r6jt4w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "smallstreetbets",
        "title": "Velo3d's DD part 1 - The 3d printing company that refused to be buy by space X because it knows it can aim for more.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r6jt4w/velo3ds_dd_part_1_the_3d_printing_company_that/",
        "created": 1638407832.0
    },
    {
        "author": "KokoroMain1475485695",
        "created_utc": 1638397419,
        "id": "r6r0ui",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "fintech constant crash? can anyone explain it?",
        "url": "https://www.reddit.com/r/stocks/comments/r6r0ui/fintech_constant_crash_can_anyone_explain_it/",
        "created": 1638426219.0
    },
    {
        "author": "KirkSpano",
        "created_utc": 1638391913,
        "id": "r6ov04",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "this is just a quick take note to clients &amp; readers on a position that I'm repositioning...\n\nCF Acquisition Corp will become Satellogic later this month. You have this week to redeem your units. I recommend you do so. \n\nThe share price of CFV is a shade under $10. It has been remarkably stable. Many of the owners of CFFVU are institutional and accredited investors who invested to make a small return on their money and get the warrants for free. The units are barely above $10, which tells me there is a lot of risk of a dive upon redemption. I don't want to take that risk. \n\nI believe since this stock has not run higher on the Satellogic deal, that if you have the units, then you should go to your brokerage and redeem them. You will receive about $10 per share, but also 1/3 of a warrant for every unit. Do this now, the deadline is coming! \n\nIf you own CFV shares, you are about even, maybe a few cents up. Sell the shares. Do this now!\n\nWhen the redemptions occur, this is going to look a lot like Spire Global I think. Not for sure, but it is set up that way. Even if it doesn't dip to $8ish or lower, I think there will be enough volatility to buy the shares later as we see how things develop. I do like all of these satellite as a service companies long-term, but why take another bruising? \n\n...just my opinion, do your own research and consider your own risk tolerance and goals",
        "subreddit": "SPACs",
        "title": "CF Acq redemption likely to cause dip CFV CFFVU",
        "url": "https://www.reddit.com/r/SPACs/comments/r6ov04/cf_acq_redemption_likely_to_cause_dip_cfv_cffvu/",
        "created": 1638420713.0
    },
    {
        "author": "BLACKHAWK181",
        "created_utc": 1638391032,
        "id": "r6oicg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "DFFN is going explode once more people look into the company and all the good it has been doing and the progress it has made in healing people. Go check out the stock for yourself or do a search on Trans Sodium Crocetinate that they have been using.",
        "url": "https://www.reddit.com/gallery/r6oicg",
        "created": 1638419832.0
    },
    {
        "author": "holorodurm",
        "created_utc": 1638391802,
        "id": "r6otex",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\\*\\*Plant-Based Tech/ESG play... pls moon\\*\\*\n\nCouldn't have said it better my self. With support loading up into the $0.20's I think it may be time this thing is starting to fly.\n\nPOSITION: 50,000 shares at $0.20 - Bullish on the fundamentals and upcoming market sentiment for small caps.\n\nSOURCE:\n\n[https://marketbuzz.ca/veiji-holdings-opportunity/](https://marketbuzz.ca/veiji-holdings-opportunity/)",
        "subreddit": "smallstreetbets",
        "title": "\"Before we continue, need we remind you that Vejii is a tech company. They have simply chosen the highly sought-after ESG route and focused on a sustainability-themed platform that makes plant-based businesses easily accessible to consumers and consumers easily accessible to plant-based businesses.\"",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r6otex/before_we_continue_need_we_remind_you_that_vejii/",
        "created": 1638420602.0
    },
    {
        "author": "CharacterGap4523",
        "created_utc": 1638390832,
        "id": "r6ofjh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "Wallstreetbetsnew",
        "title": "$PHIL otc ticker is the opportunity of a Lifetime, it will go from .01 cent its actually under a penny to Surpass $1.00 MARK THIS POST! GO BUY AS MUCH SHARES AS U CAN, &amp; THANK ME LATER BIG MONEY 💰 HERE $PHIL",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/r6ofjh/phil_otc_ticker_is_the_opportunity_of_a_lifetime/",
        "created": 1638419632.0
    },
    {
        "author": "yeetasaurusslump",
        "created_utc": 1638418662,
        "id": "r6yk54",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "My last yolo for a while if these don’t print, I was in the green and hopeful until it shot down at the end of the trading day, how do you guys feel about the market recovering in a couple weeks with the Omnicron hitting the states",
        "url": "https://www.reddit.com/gallery/r6yk54",
        "created": 1638447462.0
    },
    {
        "author": "k032",
        "created_utc": 1638416628,
        "id": "r6xvss",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " I'm interested in an API that you can query for some ETF (VTI, ESGU, etc) and it will return back all the holdings in the ETF and ideally percentages of the whole ETF.\n\nJust searching pretty generically at this point on Google but wondering if anyone knows of something like this.\n\nI mean that's pretty much it...to meet this subs 400 word requirement...an API is just a programming interface that some other program can access. I don't have all the data on every ETF holding and want that data to do something with, so that's why I'm looking for an API for all the ETF's data and holdings for a side project. \n\nThanks",
        "subreddit": "investing",
        "title": "API to get holding info for ETFs?",
        "url": "https://www.reddit.com/r/investing/comments/r6xvss/api_to_get_holding_info_for_etfs/",
        "created": 1638445428.0
    },
    {
        "author": "TreyDolla",
        "created_utc": 1638415505,
        "id": "r6xibp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Decentralized options? If this doesn’t scream “degen” idk what does $IBFR 0xa296ad1c47fe6bdc133f39555c1d1177bd51fbc5 check it out",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6xibp/decentralized_options_if_this_doesnt_scream_degen/",
        "created": 1638444305.0
    },
    {
        "author": "independence_hall",
        "created_utc": 1638407964,
        "id": "r6uy1a",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I thought a high PIPE price like the one being offered to DWAC means it can issue or sell fewer shares to hedge funds and receive the same amount of capital for them. \n\nIn other words, fewer shares being issued would mean current shareholders are diluted less and not more. Therefore, the fact that they were most likely able to strike a deal at elevated levels is good and not bad for current investors.",
        "subreddit": "SPACs",
        "title": "Doesn’t a high PIPE price mean less dilution for shareholders and not more?",
        "url": "https://www.reddit.com/r/SPACs/comments/r6uy1a/doesnt_a_high_pipe_price_mean_less_dilution_for/",
        "created": 1638436764.0
    },
    {
        "author": "Tangomajor",
        "created_utc": 1638405761,
        "id": "r6u6gn",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This year was my first year investing my money so I have no idea how taxes work when it comes to this. \n\nWill it work just like your job - where your investment provider(?) sends you a form (W-2 in the case of a job) and I just have to enter that info into whatever tax software I choose before they send it out to the federal and state tax agencies? Does it get any more involved than that?\n\nAre there any pitfalls or other things I should know about before tax season hits?\n\nIf it helps with info at all, I've invested using Robinhood (I know, I know) and Binance.",
        "subreddit": "investing",
        "title": "With tax season coming up, how do investment taxes work?",
        "url": "https://www.reddit.com/r/investing/comments/r6u6gn/with_tax_season_coming_up_how_do_investment_taxes/",
        "created": 1638434561.0
    },
    {
        "author": "KirkSpano",
        "created_utc": 1638392577,
        "id": "r6p4ju",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "quick note to clients/readers... \n\nDMY Tech is bringing Google aligned Planet which is ramping up sales and business operations already based on their large satellite constellation. \n\nThe share price for DMYQU is close to $11, so I don't see any big risk of a dive after redemptions. I think it is more likely we see a robust options market once the new symbol is active. Planet will trade as PL. \n\nOnce the units split, you'll get a share of PL and 1/5 warrant of PL, so every 5 units get you 1 share of PL.\n\nIf you own DMYQ shares, those will just convert to PL. \n\nThe Google connection and all the other contracts really give Planet a leg up in this space and I have been calling them best of the bunch for a while now. They have a lead on the other satellite-as-a-service companies so want this one from go. I will accumulate others such as BSKY, SPIR and SATL on the dips, already have starters in BKSY and SPIR.\n\nI am not only holding onto my DMYQU, I am rounding up the position to 4% buying more under $11 while I can. This will put me at a 5% exposure to Planet in a few weeks. I am ok with that. I can manage it from there and think the options market is going to support significant opportunities. ",
        "subreddit": "SPACs",
        "title": "dMY Tech redemption won't hurt Planet launch DMYQ DMYQ.U",
        "url": "https://www.reddit.com/r/SPACs/comments/r6p4ju/dmy_tech_redemption_wont_hurt_planet_launch_dmyq/",
        "created": 1638421377.0
    },
    {
        "author": "Serrot69",
        "created_utc": 1638393766,
        "id": "r6pkwj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What the title says plus a few more questions:\n\nWhat do you think his love for Bitcoin will mean for investors? I’m afraid this would turn into another MicroStrategy.\n\nWould you consider PayPal to be a “safer” alternative?",
        "subreddit": "stocks",
        "title": "What are you thoughts on Square now that Jack will be fully dedicated to it?",
        "url": "https://www.reddit.com/r/stocks/comments/r6pkwj/what_are_you_thoughts_on_square_now_that_jack/",
        "created": 1638422566.0
    },
    {
        "author": "thebusiness7",
        "created_utc": 1638401467,
        "id": "r6skru",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Over the last trading sessions spanning over the last two weeks, I’ve noticed heavy dark pool trades in SPY totaling several hundred million dollars each. I get notifications for these via a service I’m subscribed to. I only recently started using the service, so I only really have the past 4 weeks to compare regarding SPY dark pool activity. During this span of time, it was incredibly rare to see any major SPY dark pool trades, then I saw this cluster and then of course the market dropped. Now, does anyone have experience monitoring SPY dark pool trades? I want to know if trades of that magnitude and that close together were actually out of the norm (and thus predictive of larger players selling SPY preceding a market drop), or if those magnitudes of SPY trades are actually quite common and randomly expected.",
        "subreddit": "stocks",
        "title": "A question about SPY dark pool activity",
        "url": "https://www.reddit.com/r/stocks/comments/r6skru/a_question_about_spy_dark_pool_activity/",
        "created": 1638430267.0
    }
]