[
    {
        "author": "OutsideLife3667",
        "created_utc": 1615488788,
        "id": "m2xpwj",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I do wish ZOM would use Twitter more though, like BNGO n OCGN\n\nProtected by approximately 70 issued and pending patents, the TRUFORMA diagnostic platform uses Bulk Acoustic Wave (“BAW”) technology, developed by Qorvo to provide a non-optical and fluorescence-free detection system for use at the point-of-care. BAW technology, also used in cell phones and in the world’s most advanced radar and communications systems, is an extremely reliable and precise technology.\n\nTRUFORMA offers complete control over the testing process from start to finish, with highly sensitive and specific immunoassays that allow veterinarians to make clinical decisions faster — and begin treating patients sooner.\n\nONLY POSITIVE NEWS TIL END OF MONTH\n\n&amp;#x200B;\n\n[https://investors.zomedica.com/news-releases/news-release-details/zomedica-corp-announces-year-end-2020-financial-results](https://investors.zomedica.com/news-releases/news-release-details/zomedica-corp-announces-year-end-2020-financial-results)\n\n[https://seekingalpha.com/article/4398510-zomedica-nears-major-catalyst-in-truforma-product-launch](https://seekingalpha.com/article/4398510-zomedica-nears-major-catalyst-in-truforma-product-launch)\n\n[https://zomedica.com/truforma](https://zomedica.com/truforma)\n\n[https://investors.zomedica.com/news-releases/news-release-details/zomedica-retires-preferred-](https://investors.zomedica.com/news-releases/news-release-details/zomedica-retires-preferred-shares)[shares](https://investors.zomedica.com/news-releases/news-release-details/zomedica-retires-preferred-shares)",
        "subreddit": "pennystocks",
        "title": "ZOMEDICA!",
        "url": "https://www.reddit.com/r/pennystocks/comments/m2xpwj/zomedica/",
        "created": 1615517588.0
    },
    {
        "author": "pltr_gang_rise_up",
        "created_utc": 1615311456,
        "id": "m1bokv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "My fellow autists, degenerates, gambling addicts, and of course, my dear retards: It is I - u/pltr_gang_rise_up and I am here to share with you a true post in the spirits of WallStreetBets and would like to put on your radar - SOXL. \n\n**Backstory:**\n\n**Semiconductors,** as most are aware, are in short supply. There has been some movement by world leaders to improve supply chains in order to get the semiconductors to the place they need to be. Some car manufacturers have had to cut production in vehicles due to this ongoing issue. I believe this issue will be fixed in due time, but probably not in the immediate future. \n\n**What is SOXL?**\n\n**SOXL** is a Leveraged ETF that invests in the biggest semiconductor manufacturers in the world (INTC, AMD, QCOM, TSM, etc). \n\nBe careful, this is a \"Leveraged\" ETF - and therefore it's rather aggressive and aiming for high returns. Do some more research here if you want. Essentially it means, if the sector of semiconductors does well, the fund will do well. \n\n**Breakdown:**\n\nNow, they recently had a 15:1 split on their shares, which were trading at about $636 in February. This brought the public float to **99.40M.**\n\nWhen looking into a company, I like to start with what they own, followed by who owns them.\n\n**What they own:**\n\nHere is a breakdown of the assets that SOXL owns with their 1.46bn market cap:\n\nDreyfus Government Cash Management Institutional Shs\t11.00%\n\nFinancial Square Treasury Instruments Fund FST Shares\t9.39%\n\nBroadcom Inc.\t5.22%\n\nQualcomm Inc.\t4.96%\n\nIntel Corp.\t4.94%\n\nTexas Instruments Inc.\t4.88%\n\nNVIDIA \t4.67%\n\nMicron Technology Inc.\t2.81%\n\nTaiwan Semiconductor Manufacturing Co. Ltd. ADR\tTSM\t2.69%\n\nAnalog Devices Inc.\t2.54%\n\nApplied Materials Inc.\t2.51%\n\nLam Research Corp.\t2.50%\n\nKLA Corp.\t2.41%\n\nNXP Semiconductors N.V.\t2.40%\n\nAdvanced Micro Devices Inc.\t2.37%\n\nASML Holding N.V.\t2.22%\n\nMicrochip Technology Inc.\t2.16%\n\nXilinx Inc.\t2.01%\t\n\nMarvell Technology Group Ltd.\t1.92%\n\nSkyworks Solutions Inc.\t1.53%\n\nTeradyne Inc.\t1.20%\n\nQorvo Inc.\t1.14%\n\nMonolithic Power Systems MPWR\t0.99%\n\nON Semiconductor Corp.\t0.81%\n\nEntegris Inc.\t0.78%\n\n&amp;#x200B;\n\n**Now, I'm not sure what the first two are, but that throws up a potential flag.** These two entities represent nearly 20% of the portfolio owned. It could be nothing more than some type of government investment in such a company, as it is critical right now. \n\n**Who owns them?:**\n\nLooks like mostly hedge funds. No one really of note other than Citadel and Susquehanna. \n\n**Short Interest:**\n\nNot a heavily shorted stock. About 3.4m shares are available to short with a ratio of about 25%.\n\n**Technicals** (got me excited):\n\n&amp;#x200B;\n\nhttps://preview.redd.it/a7ndly6se1m61.png?width=1018&amp;format=png&amp;auto=webp&amp;s=698eae9b1d4ff4726eac546d2a6a8f4bb753fbc6\n\nHere we have a bounce just under the (white) 200sma. On this 4h chart, the bottom represents the buy/sell volume over time. the middle represents where we're at in terms of a squeeze. You also can see heavy buy volume at the bottom followed by a potential turn up ahead in the next few days. TONS of buy volume since the beginning of the month. \n\nThe daily was also looking nice:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/id2j5879f1m61.png?width=452&amp;format=png&amp;auto=webp&amp;s=23cbb6a2b7af021cadc9d35a9d2f8413c636cb90\n\nThere is an AIM on the indicator, meaning at this point the next logical step might be a shot to the upside in the next week. There was heavy call and put volume on the $37 strike, which seemed quite coincidental. Why that level? There were more calls than puts. The OI is still over 10k on the option. \n\nMy target is $42 by 3/19. But I encourage you to do your own analysis and come up with your own targets. I happen to think this is a good potential trade. I think in this case, the probability in my belief is to the upside.",
        "subreddit": "wallstreetbets",
        "title": "SOXL will rock your SOXL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1bokv/soxl_will_rock_your_soxl/",
        "created": 1615340256.0
    }
]