[
    {
        "author": "AxemanFromMA",
        "created_utc": 1630176003,
        "id": "pdfd16",
        "num_comments": 228,
        "num_crossposts": 0,
        "selftext": "Peter Nolan (The Board of Directors) bought a significant amount of shares of $ATVI at the support level of $80-$81. This transaction wasn't once, it was multiple times. In addition, he hasn't sold any of his shares.\n\nGoogle and $ATVI announced a deal Friday worth millions. For anyone saying the date in the article is wrong here, on Twitter Oracle stated \"Google struck secret deals worth \"hundreds of millions\" of dollars with developers like Activision\" at 1:05 PM EST. By doing a simple Google search of the Google and Activision deal, you will notice Business Insider changed the date to make it look hidden, but the original article below has the time stamp on Friday.\n\n9/3 87C has had an open interest of 10K+ since 8/23\n\nMorgan Stanley came out with an article recently seeing a $120 price target.\n\nThe legal stuff is priced in. The stock has consolidated and started an upward trend. In the World of Warcraft Shadowlands 9.1.5 update, the company addressed the issue the lawsuit was covering and suggests they are going in the correct direction. The update comes out the same week of 9/3.\n\nIf we open $85 Monday, I can easily see this stock hitting $87-$90 easily. The main catalyst here is the Google deal which the media hasn't publicized enough. The fact that someone bought 10K calls on 8/23 and hasn't sold them is the biggest indicator here for me along with the Google deal. The IV on calls Friday jumped and $ATVI held its gains. \n\n\n\nGoogle and $ATVI deal source: https://www.businessinsider.com/epic-google-project-hug-play-store-secret-deal-velocity-program-2021-8\n\nPeter Nolan purchasing shares source: http://openinsider.com/insider/Nolan-Peter-J/1243589\n\nhttps://www.sec.gov/Archives/edgar/data/718877/000135202721000068/xslF345X03/wf-form4_162855019169820.xml\n\nMorgan Stanley Source:https://daily2dailynews.com/morgan-stanley-sees-45-upside-in-activision-blizzard-time-to-buy-atvi-shares-invezz/\n\nOracle Twitter Source: https://ibb.co/vwYV3bv",
        "subreddit": "wallstreetbets",
        "title": "$ATVI should hit $87+ by 9/3/2021 DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdfd16/atvi_should_hit_87_by_932021_dd/",
        "created": 1630204803.0
    },
    {
        "author": "devilmaskrascal",
        "created_utc": 1629340427,
        "id": "p761je",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "In spite of the \"SPACs are dead\" zeitgeist, thanks to the SPAC frenzy during the bubble SPAC teams in general undoubtedly have more high quality sponsors now than ever before. Bad price action, pessimistic sentiment and the arb trap are what they are, but more legit unicorn list companies have DA'd since the crash than the entire history of SPACs prior to that, and quality companies continue to DA at competitive multiples to competition. Many of these SPAC teams have significant reputations on the line and are expected to deliver high quality long term investments, regardless of short term trading action.\n\nSince I am predominantly a pre-DA warrants investor, when vetting SPAC teams I like to look for: \n\na.) past successful SPAC experience; \n\nb.) high level of specialized experience in the sector of focus (for example, FTPA/FTVI/HERA/SCLE's Betsy Cohen and ACQR's Steven McLaughlin are specialized experts at fintech and know the field like the back of their hand). This is one of the highest indicators of long-term success.\n\nc.) past C-suite experience at high level companies. Below is a list of Fortune 200 companies' former C-Suite execs, Chairmen of the Board and/or Presidents currently on or advising SPAC teams. *I included Directors for Fortune 15 only, but many SPACs have Fortune 200 Directors. I did not include exec VPs, division heads, vice chairs or non-US subsidiary execs, of which there are also many more.*\n\n**1. Walmart** \n\n* EQD (Bill Simon, Former CEO/President/COO, Walmart US)\n* PLMI (Kevin Turner, Fmr CEO/COO, Sam's Club)\n* ENPC (Gisel Ruiz, Fmr COO, Walmart and Sam's Club)\n* BSKY (Michael Smith, Fmr COO Walmart.com)\n* TPBA (Kerry Cooper, Fmr CMO, Walmart.com)\n* Directors: DGNU, MSDA, CPAR\n\n**3. Apple** \n\n* LCAA (John Sculley, Fmr CEO)\n* Directors: ZNTE\n\n**5. UnitedHealth Group** \n\n* SNRH (Richard Burke, Founder/Fmr CEO)\n\n**6. Berkshire Hathaway** \n\n* Directors: CPAR\n\n**9. Alphabet/Google** \n\n* XPOA (Eric Schmidt, Fmr CEO and Exec Chairman)\n* Directors: CPAR\n\n**10. Exxon Mobil** \n\n* Directors: CPAR, PLMI\n\n**12. Costco Wholesale** \n\n* AFAQ (Richard Galanti, CFO)\n\n**15. Microsoft** \n\n* PLMI (Kevin Turner, Fmr COO)\n* LMACA (Greg Maffei, Fmr CFO)\n* Directors: CPAR\n\n**16. Walgreen Boots Alliance** \n\n* FORE (Greg Wasson, Fmr CEO, Walgreens)\n\n**18. Home Depot** \n\n* AAQC (Bob Nardelli, Fmr CEO/Chairman)\n\n**20. Verizon Communications** \n\n* CTAC (Dr. Shaygan Kheradpir, Fmr CIO/CTO)\n\n**23. Anthem** \n\n* CHPM (Joseph Swedish, Fmr CEO)\n\n**25. Fannie Mae** \n\n* EJFA (Timothy J. Mayopoulos, Fmr CEO/President)\n\n**28. Dell Technologies** \n\n* MSDA (Michael Dell, Founder/CEO)\n\n**29. Bank of America Merrill Lynch** \n\n* PIPP (John Thain, Fmr CEO, Merrill Lynch)\n\n**33. CitiGroup** \n\n* CCV, CVII, CCVI (Michael Klein, Fmr CEO Citigroup Markets and Banking)\n\n**34. Facebook** \n\n* BGSX (Owen Van Natta, Fmr COO)\n\n**35. UPS** \n\n* ATVC (Richard Peretz, Fmr CFO)\n\n**38. General Electric** \n\n* HCIC (Jeff Immelt, Fmr Chairman/CEO)\n\n**40. Intel** \n\n* CPUH (Omar Ishrak, Chairman)\n* SLCR (Andy Bryant, Fmr Chairman)\n\n**44. PepsiCo** \n\n* CPAR, GSAH (Steven Reinemund, Fmr. Exec Chair and CEO)\n* LCAA (John Sculley, Fmr CEO)\n* OCA (Albert Carey, Fmr CEO - North America)\n\n**45. FedEx** \n\n* YSAC (David Bronczek, Fmr President and COO)\n\n**50. Walt Disney** \n\n* FRXB (Tom Staggs, Fmr COO)\n\n**54. Boeing** \n\n* NVSA (Dennis Muilenberg, Fmr CEO/COO; John Tracy, Fmr CTO)\n\n**56. HP** \n\n* LEGA (Meg Whitman, Fmr CEO)\n* BTAQ (Leo Apotheker, Fmr CEO)\n\n**59. Goldman Sachs Group** \n\n* CRHC (Gary Cohn, Fmr COO)\n\n**64. Charter Communications** \n\n* PGRW (Carl Vogel, Fmr CEO)\n\n**77. Pfizer** \n\n* PHIC (Ian Read, Fmr Chair/CEO)\n\n**80. Oracle** \n\n* SCLE (Raymond Lane, Fmr COO)\n* DMYQ, DMYI (Harry You, Fmr CFO)\n\n**83. American Express** \n\n* CPAR (Ken Chenault, Fmr CEO/Chair)\n\n**86. Northrop Grumman** \n\n* ZNTE (Ronald Sugar, Fmr CEO/Chair)\n\n**89. Abbott Laboratories** \n\n* REVH (Jeff Leiden, Fmr FOO)\n\n**91. Dollar General** \n\n* ENPC (Michael Calbert, Chairman)\n\n**93. Coca-Cola** \n\n* HYAC (Steven Heyer, Fmr COO)\n\n**95. Thermo Fisher Scientific** \n\n* OACB (Paul Meister, Chairman)\n\n**104. Jabil** \n\n* SHAC (Tim Main, Chairman)\n\n**109. ViacomCBS** \n\n* MRAC (Thomas Freston, Fmr CEO, Viacom)\n* STWO (Sarah Kirshbaum Levy, Fmr COO, Viacom)\n* GGPI (Nancy Tellem, Fmr President, CBS)\n\n**110. Kraft Heinz** \n\n* HPX (Bernardo Hees, Fmr CEO)\n\n**115. Netflix** \n\n* MSDA (Barry McCarthy, Fmr CFO)\n\n**116. Gilead Sciences** \n\n* CPAR (Robin Washington, Fmr CFO)\n\n**118. Eli Lily** \n\n* HIGA (Sidney Taurel, Fmr CEO)\n\n**122. CBRE Group** \n\n* CBAH (Robert Sulentic, CEO)\n\n**124. Qualcomm** \n\n* PRSR (Derek Aberle, Fmr Pres/COO, Steve Altman, Fmr Pres/Vice Chair)\n\n**134. Paypal Holdings** \n\n* BTWN, BTNB (Peter Thiel, Founder/Fmr CEO)\n* RTPY (Reid Hoffman, Fmr CEO)\n\n**152. DXC Technology** \n\n* TLGA (Mike Lawrie, Fmr CEO)\n\n**163. L3Harris Technologies** \n\n* NVSA (Howard Lance, Fmr CEO/Chair, Harris)\n\n**164. Macy’s** \n\n* DEH (Terry Lundgren, Fmr CEO)\n\n**175. Marsh &amp; McLennan** \n\n* FRW (Courtney Leimkuhler, Fmr CFO, Marsh)\n\n**178. Delta Air Lines** \n\n* GNPK (Richard Anderson, Fmr CEO)\n\n**182. Western Digital** \n\n* PIAI (Mike Cordano, Fmr COO)\n\n**189. AECOM** \n\n* SBEA (Stephen Kadenacy, Fmr COO)\n\n**197. DISH Network** \n\n* CONX (Charles Ergen, Fmr CEO/Exec Chair)\n* PGRW (Carl Vogel, Fmr President)\n\nPlease let me know if there are any mistakes/corrections/sponsors I missed on currently active SPACs.",
        "subreddit": "SPACs",
        "title": "SPAC teams with Fortune 200 former/current C-suite execs, Chairmen of the Board and/or Presidents",
        "url": "https://www.reddit.com/r/SPACs/comments/p761je/spac_teams_with_fortune_200_formercurrent_csuite/",
        "created": 1629369227.0
    },
    {
        "author": "thehopeofcali",
        "created_utc": 1628567395,
        "id": "p1hh1j",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Fastly is an edge computing/security/CDN company based out of San Francisco and competes mainly with Cloudflare.\n\nWhy now:\n\n1. High short interest, at least 20% of the float, due to poor Q2'21 earnings, can catch short sellers with their shorts down\n2. Acquisition target from public cloud providers (Amazon, Google, Microsoft, Cisco, Oracle)\n3. Best edge computing product\n4. It did not want to be in the 30s in recent price action, setting up for further bullishness\n\nAnyone have any thoughts about the aforementioned points?",
        "subreddit": "wallstreetbets",
        "title": "Fastly!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1hh1j/fastly/",
        "created": 1628596195.0
    },
    {
        "author": "steveissuperman",
        "created_utc": 1628795427,
        "id": "p36llr",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Boilerplate Company Description:\n&gt;Digerati Technologies, Inc. (OTCQB: DTGI) is a provider of cloud services specializing in UCaaS (Unified Communications as a Service) solutions for the business market. Through its operating subsidiaries T3 Communications (T3com.com) and Nexogy (Nexogy.com), the Company is meeting the global needs of businesses seeking simple, flexible, reliable, and cost-effective communication and network solutions including cloud PBX, cloud telephony, cloud WAN, cloud call center, cloud mobile, and the delivery of digital oxygen on its broadband network. Digerati has developed a robust integration platform to fuel mergers and acquisitions in a highly fragmented market as it delivers business solutions on its carrier-grade network and Only in the Cloud™.\n\n\nDTGI is a stock I’ve been collecting since they acquired Nexogy and ActivePBX last Fall and posted a massive 140% revenue increase on their last earnings. The company has been steadily turning itself around with a new strategy that it began implementing a few years ago. The company has grown from around $200k in annual revenue to $15 million and growing. Much of this is thanks to the aforementioned acquisitions, each of which continue to grow as part of DTGI. \n\nLast year the company hired Maxim Group to help it manage a transition to getting listed on the Nasdaq exchange. Obviously this is a big hurdle for a small company who's stock is trading for pennies. Yesterday the company filed an S-1 to raise at least $11.5 million while also signaling an imminent RS. This is a painful but necessary step to raise the working capital and minimum share price necessary to be listed on the Nasdaq. As the filing states, \"We will not proceed with this offering in the event the Common Stock and Warrants are not approved for listing on Nasdaq.\"\nhttps://www.otcmarkets.com/filing/html?id=15154709&amp;guid=PkO1kndLS8w6N3h \n\nZack's SCR recently initiated some coverage on this stock and gave a price target of 0.21 (currently trading for approximately 0.12 to 0.13). https://scr.zacks.com/news/news-details/2021/DTGI-A-Roll-Up-Play-in-the-Fast-Growing-Fragmented-UCaaS-Market-article/default.aspx\n\nHere are some highlights from the Zack's Report:\n&gt;*Digerati sells Unified Communications as a Service (UCaaS) to SMBs primarily in Texas and Florida. UCaaS brings VoIP, video conferencing, instant messaging, and collaboration tools together on one platform that is hosted in the cloud. As well as being more cost effective and flexible in the office, it allows workers to enjoy all the features of an office-based system remotely and gives businesses more choices in the applications it chooses. Digerati’s UCaaS solution also integrates with systems like Microsoft Teams and Oracle NetSuite, becoming the cloud telco engine behind these popular systems.  \n*UCaaS solutions primarily replace premised- based systems making maintenance and upgrades easier and cheaper for the client. Digerati specializes in providing service with superior customer service to the large telcos that are the usual providers to these businesses.  \n*Digerati is in the early stages of its roll up strategy funded by its new financing partnership with Post Road Group. In November 2020, it bought Nexogy and ActivePBX for approximately $12 million, the two of which are expected to add at least $8 million in annual sales and $1.5 million in EBITDA. It plans to continue to buy companies opportunistically and accretively.  \n*Seasoned management that successfully has built and sold other public telecom and software companies and created solid returns for investors runs the company.  \n*The UCaaS industry is highly fragmented and growing rapidly. Fifty percent of the US market is served by local and regional providers. The global UCaaS market is currently $38.7 billion and expected to be $169 billion by 2027, or a CAGR of 23.5%.  \n*The company trades at a fully diluted (using 273 million shares) enterprise value of $44 million or 2.9 times its calendar 2021 estimated sales of $15.3 million versus its peers who trade at 7.1 times. As its growth strategy, improved margins, and positive cash flow are evidenced in the future, we believe it could trade closer to the peer group. \n\nI'm not necessarily encouraging anyone to rush out and buy this stock immediately, but I think it should be on everyone's watch list. Obviously dilution and an imminent RS is going to be strong headwinds for the near term, but here is what you should be watching:\n*Offering and RS is dependent on acceptance into Nasdaq. Uplisting, along with so many other improving metrics, will help bring a lot of non-retail interest back to the stock. \n*Earnings Report is due late this month or early Sept. Last report was amazing, and this one should be good and show further progress.\n*DTGI's subsidiary Nexogy is partnered with Sandler Partners, which will help grow it's sales. \n*Further acquisitions are expected. As the CEO stated in an article from April: \"I can’t currently disclose specifics, but we’re looking at [further acquisition] opportunities here in Texas and in Florida.\"\n\nFurther info on the growth of this company is outlined in this video with the CEO: https://digerati-inc.com/proactive-interview-140-growth/",
        "subreddit": "pennystocks",
        "title": "DTGI - Digerati Technology Making Moves to Uplist to NASDAQ",
        "url": "https://www.reddit.com/r/pennystocks/comments/p36llr/dtgi_digerati_technology_making_moves_to_uplist/",
        "created": 1628824227.0
    },
    {
        "author": "YoloOnTsla",
        "created_utc": 1628512096,
        "id": "p10gus",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Here’s a SPAC deal I though was dead in the water, but I’m taking a second look at. Alight inc. (ALIT) provides health benefits, retirement, payroll solutions, talent/HR, and prof services - implementing their own solutions. \n\nThey have strategic partnerships with SAP and Oracle, making ALIT an upper market play (companies like KHC, RTX, and INTC run SAP with outdated payroll and HR solutions).\n\nI think ALIT has found a niche in a “cloud native” world and fit in well with companies digital transformation journeys. If ALIT can leverage their strategic partnerships to increase opportunity flow, compete with Fidelity, Vanguard, etc.. in retirement benefits by offering more value, and continue to template integrations with major ERP’s - the only direction is up.\n\nCurrent Positions\n\n100 shares \nOpening up 2x 2/18/22 $10 calls before close today",
        "subreddit": "smallstreetbets",
        "title": "ALIT",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/p10gus/alit/",
        "created": 1628540896.0
    },
    {
        "author": "thehopeofcali",
        "created_utc": 1628566167,
        "id": "p1h5qq",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Fastly is an edge computing/security/CDN company based out of San Francisco and competes mainly with Cloudflare. \n\nWhy now:\n\n1. High short interest, at least 20% of the float, due to poor Q2'21 earnings, can catch short sellers with their shorts down\n2. Acquisition target from public cloud providers (Amazon, Google, Microsoft, Cisco, Oracle)\n3. Best edge computing product\n4. It did not want to be in the 30s in recent price action, setting up for further bullishness\n\nAnyone have any thoughts about the aforementioned points?",
        "subreddit": "wallstreetbets",
        "title": "FSLY setup",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1h5qq/fsly_setup/",
        "created": 1628594967.0
    },
    {
        "author": "PurpleCold5905",
        "created_utc": 1628010466,
        "id": "ox7wox",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "The year is 2021 of our lord, the big inflation beast has been summoned by media gatekeepers and market pundits who so fervently aim to pronounce dead the run of our great bull economy.   \n\n\nIn such times of unsteadiness, my cash seeks sanctuary.   \nThe old wisdom of the ancient ape tradition instructs me to consult the oracle, so I ask thee.   \n**In the upcoming bear market where are you parking your money? Gold? Silver? Precious Metal Stocks?**  \n\n\nThere are inflation resistant stocks that I'm paying close attention to:\n\n**Newmont Corporation (NEM)**\n\n* Newmont Corporation has recently announced that its board of directors has granted approval for advancing the Ahafo North Project into the execution phase. The project will add profitable production from the best unmined gold deposit in West Africa.\n* Newmont  Corp. has declared a quarterly Dividend of $0.55 Per Share.\n\n**Barrick Gold Corp (GOLD)**\n\n* Barrick Gold has signed 4 contracts for gold exploration with Egyptian Government this year.\n* The company expects to deliver superior performance over the second half of the year as its financials should also take advantage of higher volumes. \n* They have also initiated improvements across operations in North America, Argentina and  Tanzania which will drive the production of gold up.\n* For  full-year 2021, the Toronto-based company forecasts it will dig up  between 4.4 million to 4.7 million ounces of gold from its reserves,  paying an all-in sustaining cost ranging between $940 and $1,020 per  ounce of gold sold.\n\n**Benchmark Metals  (BNCHF)**\n\n* Benchmark’s flagship Lawyers Gold-Silver Project is one of the largest drill programs in Canada located within the Golden Horseshoe area of north-central British Columbia.\n* On May 14, 2021,  the Company announced the Updated Mineral Resource Estimate that  provided 2.1 million ounces (\"Moz\") grading 1.62 grams per tonne (\"g/t\")  gold equivalent (\"AuEq\") of Indicated Mineral Resources and 821,000  ounces grading 1.58 g/t AuEq of Inferred Mineral Resources.",
        "subreddit": "wallstreetbets",
        "title": "[GOLD THREAD] Inflation Gooroos, YOLO Apes, and Fiat Permabears Set Me Straight. What Gold Stocks Are Currently Tickling Your Fancy?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ox7wox/gold_thread_inflation_gooroos_yolo_apes_and_fiat/",
        "created": 1628039266.0
    },
    {
        "author": "yellenbubbleblower",
        "created_utc": 1628175799,
        "id": "oyk8gs",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "A sign from the Oracle of Omaha? I believe 420,690 only leads to 🚀🚀🛰️",
        "url": "https://i.redd.it/cix531xu0kf71.jpg",
        "created": 1628204599.0
    },
    {
        "author": "yellenbubbleblower",
        "created_utc": 1628174803,
        "id": "oyjukn",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "A sign from the Oracle of Omaha",
        "url": "https://i.redd.it/e5d0hxo3yjf71.jpg",
        "created": 1628203603.0
    },
    {
        "author": "Upcoming-whale",
        "created_utc": 1628516864,
        "id": "p11sj8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Microsoft and Oracle or hot to buy a Tik-Tok not too long ago. The numbers being flung about we're 40 billion and above. If you remember correctly oh, the deal fell apart because Tik-Tok would not or could not so the algorithm that secured the clients. if Lomo is able to secure clients at a rate similar to Tik-Tok, the big boys will come back. they are desperate to upgrade their business. be patient with this one. Great things are possible but take time. good luck to all and God's blessings.",
        "subreddit": "wallstreetbets",
        "title": "Microsoft Acquiring Tiktoks rival, VINCO VENTURES $BBIG!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p11sj8/microsoft_acquiring_tiktoks_rival_vinco_ventures/",
        "created": 1628545664.0
    },
    {
        "author": "getblockio",
        "created_utc": 1628696218,
        "id": "p2fhxw",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "BSC-Centric Oracle Network Berry Data Enters Strategic Collaboration with GetBlock",
        "url": "https://getblock.io/blog/bsc-centric-oracle-network-berry-data-enters-strategic-collaboration-with-getblock",
        "created": 1628725018.0
    },
    {
        "author": "Regular_Peach9880",
        "created_utc": 1628223025,
        "id": "oyz8qx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "( I'm living in Korea and my English is bad.  I'd appreciate it if you understand me. )  \n\n\nHello. It's my first time posting on Reddit.  \nI post this because I want to know how can I get back Sun Microsystems stock merged with Oracle in 2010.  \n\n\nMy father worked for Sun Microsystems and participated in ESPP(Employee Stock Purchase Plan).  \nHe didn't sell his stocks and forgot that he held stocks.\n\nAnd today, he remembered it and wanted to find it.  \n\n\nSo I tried to send e-mail to Oracle, but I can't find e-mail address on support team web page.  \nAnd I also contacted to Oracle live chat but he said he couldn't help.. (It may be because of my bad English😂)\n\n  \nI have no idea what to do so I post this issue on Reddit.\n\nIt would be great to tell me where can I query Sun Microsystems stock issue.  \nThank you for reading this.",
        "subreddit": "StockMarket",
        "title": "Sun Microsystems stock issue",
        "url": "https://www.reddit.com/r/StockMarket/comments/oyz8qx/sun_microsystems_stock_issue/",
        "created": 1628251825.0
    },
    {
        "author": "Stalkerview",
        "created_utc": 1629199502,
        "id": "p61u4c",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I want to compile good BLOWJOB portfolio, I got bored of FAANG\n\nDeep value BLOWJOB portfolio\n\nB -  Berkshire Hathaway \n\nL - Linde\n\nO-  REALTY INCOME  \n\nW - Walt Disney\n\nJ -  JOHNSON &amp; JOHNSON \n\nO -  Oracle \n\nB - BABA\n\nI want it to be steady dividend provider, for long term milking. Can you please help with your suggestions!",
        "subreddit": "wallstreetbets",
        "title": "Good BLOWJOB portfolio instead of FAANG, please help with suggestions.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p61u4c/good_blowjob_portfolio_instead_of_faang_please/",
        "created": 1629228302.0
    },
    {
        "author": "63magpie",
        "created_utc": 1628258112,
        "id": "oz73zg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hear me out, FSLY to Mars\n\nThe just pooped and are maybe getting bought by AWS or Oracle, look at new CFO, he only comes in when companies sell. FSLY back to $140",
        "subreddit": "wallstreetbets",
        "title": "Fsly to Mars - maybe getting acquired?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oz73zg/fsly_to_mars_maybe_getting_acquired/",
        "created": 1628286912.0
    },
    {
        "author": "Upcoming-whale",
        "created_utc": 1628516984,
        "id": "p11tsa",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Microsoft and Oracle or hot to buy a Tik-Tok not too long ago. The numbers being flung about we're 40 billion and above. If you remember correctly oh, the deal fell apart because Tik-Tok would not or could not so the algorithm that secured the clients. if Lomo is able to secure clients at a rate similar to Tik-Tok, the big boys will come back. they are desperate to upgrade their business. be patient with this one. Great things are possible but take time. good luck to all and God's blessings.",
        "subreddit": "wallstreetbets",
        "title": "Microsoft acquiring Tiktoks rival VINCO VENTURES, $BBIG!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p11tsa/microsoft_acquiring_tiktoks_rival_vinco_ventures/",
        "created": 1628545784.0
    },
    {
        "author": "gothicka112",
        "created_utc": 1628544677,
        "id": "p1b0h7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Here's some context. Jeff Epstein was the CEO of APXT that recently merged with the company AVPT.   \nHere's the alive and well Jeff Epstein (ex CFO of Oracle):  \n[https://www.bvp.com/team/jeff-epstein](https://www.bvp.com/team/jeff-epstein)  \n[https://www.linkedin.com/in/jeffepstein1/](https://www.linkedin.com/in/jeffepstein1/)\n\nI thought it would be hilarious content for WSB if Chris Hansen to interview this Jeffrey Epstein, so I contacted Chris Hansen and he agreed to do the interview! Unfortunately, Jeff Epstein's investor relations team didn't see the humor in taking this interview - see communication below.   \nHere's the dialogue asking Epstein on Linkedin to take the interview: [https://imgur.com/j3EjCWv](https://imgur.com/j3EjCWv)  \nHere's me asking Jeff Epstein and AVPT's investor relations Eric *Mannion* if they would take the interview: [https://imgur.com/q4AHqGZ](https://imgur.com/q4AHqGZ)  \nHere's Erica's reply bringing up Hansen's \"legal issues\": [https://imgur.com/2Vi9LLV](https://imgur.com/2Vi9LLV)  \nAfter numerous follow ups, here's Erica finally rejecting the interview: [https://imgur.com/6RaZifV](https://imgur.com/6RaZifV)  \n\n\nSome AVPT catalysts this week:   \nEarnings are being released tomorrow: [https://ir.avepoint.com/events/q2-2021-earnings-call](https://ir.avepoint.com/events/q2-2021-earnings-call)",
        "subreddit": "wallstreetbets",
        "title": "Jeff Epstein's IR rejected interview with Chris Hansen Last Week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1b0h7/jeff_epsteins_ir_rejected_interview_with_chris/",
        "created": 1628573477.0
    },
    {
        "author": "fltcpt",
        "created_utc": 1630313764,
        "id": "pee8df",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "The oracle says the market is overpriced",
        "url": "https://www.reddit.com/r/stocks/comments/pee8df/the_oracle_says_the_market_is_overpriced/",
        "created": 1630342564.0
    },
    {
        "author": "yellenbubbleblower",
        "created_utc": 1628174964,
        "id": "oyjwvx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "A sign from the Oracle of Omaha?",
        "url": "https://i.redd.it/sbwg9qxkyjf71.jpg",
        "created": 1628203764.0
    },
    {
        "author": "pasturepeople",
        "created_utc": 1628267880,
        "id": "ozabyf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Doing some research on FSLY after it tanked from earnings. It doesn't look like it is going to recover based on the earnings call and forecast.. The CEO is full of excuses and seems desperate if you listen to the call. The reason that I think it is going to outerspace is that they are perfectly poised for acquisition. \n\nEvery company their new CFO has worked at has been acquired \n\nWhat top 10 customer was FSLY talking about in their earnings that is coming back? --TikTok?\n\nWho did TikTok choose for Cloud? --Oracle\n\nWhat Cloud service doesn't have an edge network? --Oracle\n\nMaybe Oracle is going to buy FSLY! And AWS and IBM are probably going to bid that price way up\n\n&amp;#x200B;\n\nFSLY real cheap RN, get in or stay on earth like a basic bunny",
        "subreddit": "wallstreetbets",
        "title": "FSLY to Mars - CFO always goes to companies that are going to be acquired",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ozabyf/fsly_to_mars_cfo_always_goes_to_companies_that/",
        "created": 1628296680.0
    },
    {
        "author": "arnoldswartch",
        "created_utc": 1629842390,
        "id": "paxcok",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "ValueInvesting",
        "title": "Finding value in big tech podcast - analysis in this on the valuation of Microsoft, Facebook and Oracle.",
        "url": "https://podcasts.apple.com/au/podcast/good-value/id1536673580?i=1000532794496",
        "created": 1629871190.0
    }
]