[
    {
        "author": "flowersincalifornia",
        "created_utc": 1614871542,
        "id": "lxmzif",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**Vancouver, B.C. — March 1, 2021 — Next Green Wave Holdings Inc.** (**CSE: NGW**) (**OTCQX: NXGWF**) (“Next Green Wave”, “NGW” or the “Company”) is pleased to announce the following operational and financial updates:\n\n* For each individual month between March 2020 to February 2021,  the Company operated with positive cash flow, and achieved both positive  Adjusted EBITDA\\* and positive Net Income (the “Milestones”).  As a  result, It has now achieved these Milestones for 12 consecutive months.\n* On February 16, 2021, the Company submitted the full application  (the “Application”) to the City of Coalinga (the “City”), for all  required local cannabis licenses on its 50,000 square foot premium  indoor facility (“Facility B”).  The Company is working with the City to  get the Application approved at the next planning commission meeting,  scheduled to be held on March 23, 2021, and subsequently the City, which  has scheduled a council meeting on April 1, 2021.\n* Once the Application is approved by the City, the Company can  begin the process of acquiring building permits to commence construction  at its discretion.  This timeline is consistent with the previously  announced schedule from December 2020 (Click [**HERE**](https://www.nextgreenwave.com/news-releases/next-green-wave-confirms-expansion-plans/) for the press release).\n\n[1 of 14 flower rooms at Next Green Wave](https://preview.redd.it/cjwdya6b41l61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=f4692bc7012dbb3a62b583a1e5fb3e50f63ba8a5)\n\n*“I couldn’t be more proud of our operational and financial  accomplishments over the past 12 months.  We not only established  ourselves as a consistent producer of top quality cannabis products, but  also established ourselves as a consistently profitable cannabis  company.  As such, to be consistent with other industry participants, we  are going to move away from providing detailed financial results on a  monthly basis, and will instead provide them on a quarterly basis; we  will announce high level Q1 2021 results in April 2021.  That being  said, our Feb 2021 Adjusted EBITDA\\* results were consistent with the  last couple of months.”* ***– Michael Jennings CEO Next Green Wave*** \n\n**Michael Jennings**  \nChief Executive Officer, Director  \nNext Green Wave Holdings Inc.\n\n&amp;#x200B;\n\n[https:\\/\\/www.nextgreenwave.com\\/a-look-inside-next-green-wave\\/](https://preview.redd.it/u9z0dagg41l61.png?width=1280&amp;format=png&amp;auto=webp&amp;s=f7f7d564bd581097121cb7b7bbaf23d9054a44d6)\n\n**About Next  Green Wave**  \nNext Green Wave is a fully  integrated premium seed to shelf craft cannabis producer offering  products through its in-house brand portfolio and wholesale flower for  other large cannabis manufacturers. The Company owns and operates a  35,000 sf indoor facility in Coalinga, CA which is home to our nursery,  cultivation, distribution, and future extraction business.  NGW has an  exclusive seed library consisting of 120 cannabis strains and hybrids  including award-winning cultivars and is producing high quality tissue  culture plantlets through its proprietary cloning technology with  bio-tech leader[ Precigen.](https://precigen.com/)  Marketing, product design and formulation are produced in-house, please follow along us at [www.nextgreenwave.com](http://www.nextgreenwave.com/) or on [Twitter](https://twitter.com/nextgreenwave), [Instagram](https://www.instagram.com/nextgreenwave/), or [LinkedIn](https://ca.linkedin.com/company/nextgreenwave).\n\n**For more information regarding Next Green Wave please contact:**\n\n**Ryan Lange**  \nCMO\n\nTel: +1 (604) 684-6844\n\n[IR@nextgreenwave.com](mailto:IR@nextgreenwave.com)\n\n***Neither Canadian Securities Exchange (the “CSE”) nor its  Regulation Services Providers (as that term is defined in the policies  of the CSE) accepts responsibility for the adequacy or accuracy of this  release.***\n\n\\*All financial information is provided in U.S. dollars and is  unaudited and is subject to change.  Any preliminary unaudited long-term  financial projections provided herein have not been prepared in  accordance with IFRS. Management uses non-IFRS financial measures, in  addition to IFRS financial measures, to understand and compare operating  results across accounting periods, for financial and operational  decision making, for planning and forecasting purposes and to evaluate  the Company’s financial performance.  One example of a non-IFRS  financial measure is Adjusted EBITDA, which has limitations as an  analytical tool as it excludes from net income as reported, interest,  tax, depreciation, other income and expenses, non-cash grow costs  expensed for biological assets and unsold inventory, ‎and the non-cash  fair value effects of accounting for biological assets and inventories.   Management believes that these non-IFRS financial measures reflect the  Company’s ongoing business in a manner that allows for meaningful  comparisons and analysis of trends in the business, as they facilitate  comparing financial results across accounting periods and to those of  peer companies. Management also believes that these non-IFRS financial  measures enable investors to evaluate the Company’s operating results  and future prospects in the same manner as management. These non-IFRS  financial measures may also exclude expenses and gains that may be  unusual in nature, non-cash, infrequent or not reflective of the  Company’s ongoing operating results.  As there are no standardized  methods of calculating these non-IFRS measures, the Company’s methods  may differ from those used by others, and accordingly, the use of these  measures may not be directly comparable to similarly titled measures  used by others. Accordingly, Non-IFRS financial measures should not be  considered superior to, as a substitute for or as an alternative to, and  should only be considered in conjunction with IFRS financial Measures.\n\n***Next Green Wave Forward Looking Statements***\n\n*This press release contains forward-looking statements within the  meaning of applicable securities laws. All statements that are not  historical facts, including without limitation, statements regarding  future estimates, plans, programs, forecasts, projections, objectives,  assumptions, expectations or beliefs of future performance, are  “forward-looking statements” and such forward-looking statements and  forward-looking information represent  only NGW’s beliefs  regarding  future events, plans or objectives, many of which, by their nature, are  inherently uncertain and outside of NGW’s control.  Generally, such  forward-looking information or forward-looking statements can be  identified by the use of forward-looking terminology such as “plans”,  “expects” or “does not expect”, “is expected”, “budget”, “scheduled”,  “estimates”, “forecasts” “intends”, “anticipates” or “does not  anticipate”, or “believes”, or variations of such words and phrases or  may contain statements that certain actions, events or results “may”,  “could”, “would”, “might” or “will be taken”, “will continue”, “will  occur” or “will be achieved”.  The forward-looking information and  forward-looking statements contained herein may include, but are not  limited to, the Company’s expectations for long-term (YE 2020 and YE  2021) revenue and adjusted EBITDA profitability,*  *the  ability of the Company to successfully achieve business objectives  (including completion of construction and increasing production  capacity), and expectations for other economic, business, and/or  competitive factors.  There can be no assurance that such  forward-looking information will prove to be accurate, and actual  results and future events could differ materially from those anticipated  in such forward-looking information. This forward-looking information  reflects NGW’s current beliefs and is based on information currently  available to NGW and on assumptions NGW believes are reasonable.*\n\n*Forward-looking information is subject to known and unknown  risks, uncertainties and other factors that may cause actual results,  events or developments to be materially different from any future  results, events or developments expressed or implied by such forward  looking information. Such risks, uncertainties and other factors  include, among others: dependence on obtaining and maintaining  regulatory approvals, including acquiring and renewing state, local or  other licenses and any inability to obtain all necessary governmental  approvals licenses and permits to complete construction of its proposed  facilities in a timely manner; engaging in activities which currently  are illegal under US federal law and the uncertainty of existing  protection from U.S. federal or other prosecution; regulatory or  political change such as changes in applicable laws and regulations,  including U.S. state-law legalization, particularly in California, due  to inconsistent public opinion, perception of the medical-use and  adult-use marijuana industry, bureaucratic delays or inefficiencies or  any other reasons; any other factors or developments which may hinder  market growth; NGW’s limited operating history and lack of historical  profits; reliance on management; NGW’s requirements for additional  financing, and the effect of capital market conditions and other factors  on capital availability,  competition, including from more established  or better financed competitors; the need to secure and maintain  corporate alliances and partnerships, including with customers and  suppliers; and  risks  and  delays  resulting  from  the  COVID-19   pandemic. These factors should be considered carefully, and readers are  cautioned not to place undue reliance on such forward-looking  statements. Although NGW has attempted to identify important risk  factors that could cause actual actions, events or results to differ  materially from those described in forward-looking statements, there may  be other risk factors that cause actions, events or results to differ  from those anticipated, estimated or intended. There can be no assurance  that forward-looking statements will prove to be accurate, as actual  results and future events could differ materially from those anticipated  in forward-looking statements. NGW has no obligation to update any  forward-looking statement, even if new information becomes available as a  result of future events, new information or for any other reason except  as required by law.*",
        "subreddit": "pennystocks",
        "title": "Next Green Wave Announces 12 Consecutive Months of Profitability",
        "url": "https://www.reddit.com/r/pennystocks/comments/lxmzif/next_green_wave_announces_12_consecutive_months/",
        "created": 1614900342.0
    },
    {
        "author": "Financial-Text-9569",
        "created_utc": 1615610631,
        "id": "m3za7a",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\r\nFOR IMMEDIATE RELEASE\r\n\r\n\r\nMarch 04, 2021\tTSX Venture Exchange: HCC\r\n\tFrankfurt:  04U1\r\n\r\nToronto, Ontario - Hanna Capital Corp. (the “Company”), a publicly traded company focused on raising capital for exploration mainly in the base metal and resource sectors. The Company is focused on providing investors with long-term capital growth by investing in a portfolio of undervalued companies and assets.\r\n\r\nOne such asset is the Jasper Property which is wholly owned by the Company. The property is located in west-central Vancouver Island, British Columbia, and consists of 4 mineral claims covering 3978 hectares.\r\n\r\nPrevious work done on the property included soil and rock sampling, geological mapping, drilling and limited geophysical work. This work confirmed the presence of lower Jurassic Bonanza Group, which comprises predominantly tuffaceous volcanic rocks.\r\n\r\nMineralization discovered in outcrop over a 2.5 by 0.5 km area on the property consists of 15 sulphide zones. The results include: \r\n\r\n●\tOutcrop sampling included: zinc: 0.01% to 15.00%, copper: 0.09% to 8.38%, lead: 0.01% to 20.07%, gold: 0.019 g/t to 0.214 g/t and silver: 3.04g/t to 61.45g/t\r\n●\tDrilling results showed zinc: 0.146% to 11.570%, copper: 0.011% to 0.871%, lead: 0.003% to 6.330%, gold 0,006g/t to 0,05g/t and silver: 2.50g/t to 61.45g/t\r\n\r\nThe model given at the time was hydrothermally remobilized base metal mineralization related to either one of the following:\r\n\r\n●\tPolymetallic Veins Ag-Pb-Zn+/-Au.\r\n●\tEpithermal Au-Ag-Cu High Sulphidation.\r\n●\tCu+/-Ag Quartz Veins.\r\n●\tNoranda/ Kuroko massive Cu-Pb-Zn. \r\n●\tPorphyry Cu-Mo-Au.\r\n\r\nEither one of this type of geological settings may point to geological occurrences conducive to mineralization worthy of evaluation, by way of a drill program. Considerable technical re-evaluation is currently underway to take the geophysical interpretations into consideration. The results will be released once available.\r\n\r\n“The recent surge in copper price is quite encouraging for the future outlook of the Company. Every major economy in the world is preparing for an infrastructure boom which should be favorable for all base metal producers. The Company is well positioned to fully exploit this potential base metals boom and to bring value to its shareholders” said Herb Brugh, President of the Company. “The Company is looking forward to the results of the re-evaluation becoming available.”\r\n \r\n \r\nThe Qualified Person for the Jasper Property is Jacques Houle, B.A.Sc., University of Toronto – Geological Engineering – Min. Ex. Option P.Eng. since 1989 Association of Professional Engineers and Geoscientists of B.C.\r\n\r\nCorporation contact:\r\n\r\nHerb Brugh\r\nPresident and Director\r\nTel:\t416.945.6630",
        "subreddit": "Wallstreetbetsnew",
        "title": "Buy HCC",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/m3za7a/buy_hcc/",
        "created": 1615639431.0
    },
    {
        "author": "Faisal200000",
        "created_utc": 1615815123,
        "id": "m5kr50",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "guys we need  sit together we don’t sell till $10,000 or more this reason for our kids , poor people and everyone we need change our life please please share everyone’s tel them strong together don’t sell inform everyone every website",
        "subreddit": "wallstreetbets",
        "title": "AMC 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸💪🔥🔥🔥🔥",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m5kr50/amc/",
        "created": 1615843923.0
    },
    {
        "author": "flowersincalifornia",
        "created_utc": 1614872775,
        "id": "lxngl8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Vancouver, B.C. — March 1, 2021 — Next Green Wave Holdings Inc.** (**CSE: NGW**) (**OTCQX: NXGWF**) (“Next Green Wave”, “NGW” or the “Company”) is pleased to announce the following operational and financial updates:\n\n* For each individual month between March 2020 to February 2021,  the Company operated with positive cash flow, and achieved both positive  Adjusted EBITDA\\* and positive Net Income (the “Milestones”).  As a  result, It has now achieved these Milestones for 12 consecutive months.\n* On February 16, 2021, the Company submitted the full application  (the “Application”) to the City of Coalinga (the “City”), for all  required local cannabis licenses on its 50,000 square foot premium  indoor facility (“Facility B”).  The Company is working with the City to  get the Application approved at the next planning commission meeting,  scheduled to be held on March 23, 2021, and subsequently the City, which  has scheduled a council meeting on April 1, 2021.\n* Once the Application is approved by the City, the Company can  begin the process of acquiring building permits to commence construction  at its discretion.  This timeline is consistent with the previously  announced schedule from December 2020 (Click [**HERE**](https://www.nextgreenwave.com/news-releases/next-green-wave-confirms-expansion-plans/) for the press release).\n\n[1 of 14 flower rooms at Next Green Wave](https://preview.redd.it/wyf9bsq181l61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=b15e82bb2c6a8c223daa2a325cb42804ff266b90)\n\n*“I couldn’t be more proud of our operational and financial  accomplishments over the past 12 months.  We not only established  ourselves as a consistent producer of top quality cannabis products, but  also established ourselves as a consistently profitable cannabis  company.  As such, to be consistent with other industry participants, we  are going to move away from providing detailed financial results on a  monthly basis, and will instead provide them on a quarterly basis; we  will announce high level Q1 2021 results in April 2021.  That being  said, our Feb 2021 Adjusted EBITDA\\* results were consistent with the  last couple of months.”* ***– Michael Jennings CEO Next Green Wave*** \n\n**Michael Jennings**  \nChief Executive Officer, Director  \nNext Green Wave Holdings Inc.\n\n[Video Link: https:\\/\\/www.nextgreenwave.com\\/a-look-inside-next-green-wave\\/](https://preview.redd.it/dr3a54u581l61.png?width=1280&amp;format=png&amp;auto=webp&amp;s=ff9cef1c81279fd7d180e32322a78d640756204b)\n\n**About Next  Green Wave**  \nNext Green Wave is a fully  integrated premium seed to shelf craft cannabis producer offering  products through its in-house brand portfolio and wholesale flower for  other large cannabis manufacturers. The Company owns and operates a  35,000 sf indoor facility in Coalinga, CA which is home to our nursery,  cultivation, distribution, and future extraction business.  NGW has an  exclusive seed library consisting of 120 cannabis strains and hybrids  including award-winning cultivars and is producing high quality tissue  culture plantlets through its proprietary cloning technology with  bio-tech leader[ Precigen.](https://precigen.com/)  Marketing, product design and formulation are produced in-house, please follow along us at [www.nextgreenwave.com](http://www.nextgreenwave.com/) or on [Twitter](https://twitter.com/nextgreenwave), [Instagram](https://www.instagram.com/nextgreenwave/), or [LinkedIn](https://ca.linkedin.com/company/nextgreenwave).\n\n**For more information regarding Next Green Wave please contact:**\n\n**Ryan Lange**  \nCMO\n\nTel: +1 (604) 684-6844\n\n[IR@nextgreenwave.com](mailto:IR@nextgreenwave.com)\n\n***Neither Canadian Securities Exchange (the “CSE”) nor its  Regulation Services Providers (as that term is defined in the policies  of the CSE) accepts responsibility for the adequacy or accuracy of this  release.***\n\n\\*All financial information is provided in U.S. dollars and is  unaudited and is subject to change.  Any preliminary unaudited long-term  financial projections provided herein have not been prepared in  accordance with IFRS. Management uses non-IFRS financial measures, in  addition to IFRS financial measures, to understand and compare operating  results across accounting periods, for financial and operational  decision making, for planning and forecasting purposes and to evaluate  the Company’s financial performance.  One example of a non-IFRS  financial measure is Adjusted EBITDA, which has limitations as an  analytical tool as it excludes from net income as reported, interest,  tax, depreciation, other income and expenses, non-cash grow costs  expensed for biological assets and unsold inventory, ‎and the non-cash  fair value effects of accounting for biological assets and inventories.   Management believes that these non-IFRS financial measures reflect the  Company’s ongoing business in a manner that allows for meaningful  comparisons and analysis of trends in the business, as they facilitate  comparing financial results across accounting periods and to those of  peer companies. Management also believes that these non-IFRS financial  measures enable investors to evaluate the Company’s operating results  and future prospects in the same manner as management. These non-IFRS  financial measures may also exclude expenses and gains that may be  unusual in nature, non-cash, infrequent or not reflective of the  Company’s ongoing operating results.  As there are no standardized  methods of calculating these non-IFRS measures, the Company’s methods  may differ from those used by others, and accordingly, the use of these  measures may not be directly comparable to similarly titled measures  used by others. Accordingly, Non-IFRS financial measures should not be  considered superior to, as a substitute for or as an alternative to, and  should only be considered in conjunction with IFRS financial Measures.\n\n***Next Green Wave Forward Looking Statements***\n\n*This press release contains forward-looking statements within the  meaning of applicable securities laws. All statements that are not  historical facts, including without limitation, statements regarding  future estimates, plans, programs, forecasts, projections, objectives,  assumptions, expectations or beliefs of future performance, are  “forward-looking statements” and such forward-looking statements and  forward-looking information represent  only NGW’s beliefs  regarding  future events, plans or objectives, many of which, by their nature, are  inherently uncertain and outside of NGW’s control.  Generally, such  forward-looking information or forward-looking statements can be  identified by the use of forward-looking terminology such as “plans”,  “expects” or “does not expect”, “is expected”, “budget”, “scheduled”,  “estimates”, “forecasts” “intends”, “anticipates” or “does not  anticipate”, or “believes”, or variations of such words and phrases or  may contain statements that certain actions, events or results “may”,  “could”, “would”, “might” or “will be taken”, “will continue”, “will  occur” or “will be achieved”.  The forward-looking information and  forward-looking statements contained herein may include, but are not  limited to, the Company’s expectations for long-term (YE 2020 and YE  2021) revenue and adjusted EBITDA profitability,*  *the  ability of the Company to successfully achieve business objectives  (including completion of construction and increasing production  capacity), and expectations for other economic, business, and/or  competitive factors.  There can be no assurance that such  forward-looking information will prove to be accurate, and actual  results and future events could differ materially from those anticipated  in such forward-looking information. This forward-looking information  reflects NGW’s current beliefs and is based on information currently  available to NGW and on assumptions NGW believes are reasonable.*\n\n*Forward-looking information is subject to known and unknown  risks, uncertainties and other factors that may cause actual results,  events or developments to be materially different from any future  results, events or developments expressed or implied by such forward  looking information. Such risks, uncertainties and other factors  include, among others: dependence on obtaining and maintaining  regulatory approvals, including acquiring and renewing state, local or  other licenses and any inability to obtain all necessary governmental  approvals licenses and permits to complete construction of its proposed  facilities in a timely manner; engaging in activities which currently  are illegal under US federal law and the uncertainty of existing  protection from U.S. federal or other prosecution; regulatory or  political change such as changes in applicable laws and regulations,  including U.S. state-law legalization, particularly in California, due  to inconsistent public opinion, perception of the medical-use and  adult-use marijuana industry, bureaucratic delays or inefficiencies or  any other reasons; any other factors or developments which may hinder  market growth; NGW’s limited operating history and lack of historical  profits; reliance on management; NGW’s requirements for additional  financing, and the effect of capital market conditions and other factors  on capital availability,  competition, including from more established  or better financed competitors; the need to secure and maintain  corporate alliances and partnerships, including with customers and  suppliers; and  risks  and  delays  resulting  from  the  COVID-19   pandemic. These factors should be considered carefully, and readers are  cautioned not to place undue reliance on such forward-looking  statements. Although NGW has attempted to identify important risk  factors that could cause actual actions, events or results to differ  materially from those described in forward-looking statements, there may  be other risk factors that cause actions, events or results to differ  from those anticipated, estimated or intended. There can be no assurance  that forward-looking statements will prove to be accurate, as actual  results and future events could differ materially from those anticipated  in forward-looking statements. NGW has no obligation to update any  forward-looking statement, even if new information becomes available as a  result of future events, new information or for any other reason except  as required by law.*",
        "subreddit": "StockMarket",
        "title": "Next Green Wave Announces 12 Consecutive Months of Profitability",
        "url": "https://www.reddit.com/r/StockMarket/comments/lxngl8/next_green_wave_announces_12_consecutive_months/",
        "created": 1614901575.0
    }
]